
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Расценки.Количество() > 0 Тогда
		КолвоСтрокСтр = Сокрлп(Расценки.Количество());
		Для Каждого Стр ИЗ Расценки Цикл
			Состояние("Обрабатывается строка " + Сокрлп(Стр.НомерСтроки) + " из " + КолвоСтрокСтр);
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|ТО.Ссылка
			|ИЗ Справочник.ТехнологическиеОперации КАК ТО
			|ГДЕ ТО.Изделие = &Изделие";
			//Аверсон 01.02.2023 КВВ СВФР-010173 (
			Если Организация.ИНН = "690305814" Тогда
				З.Текст = З.Текст + "
				|И ТО.БазоваяРасценка = &БазоваяРасценка";
			Иначе
				З.Текст = З.Текст + "
				//Аверсон 01.02.2023 КВВ СВФР-010173 )
				|И ТО.РазрядРаботы = &РазрядРаботы";
			КонецЕсли;
			З.Текст = З.Текст + "
			|И ТО.НазваниеОперации = &НазваниеОперации
			|И ТО.ПометкаУдаления = ЛОЖЬ";
			З.УстановитьПараметр("Изделие", Стр.Изделие);
			З.УстановитьПараметр("НазваниеОперации", Стр.НазваниеОперации);
			З.УстановитьПараметр("РазрядРаботы", Стр.РазрядРаботы); 
			З.УстановитьПараметр("БазоваяРасценка", Стр.БазоваяРасценка); //Аверсон 01.02.2023 КВВ СВФР-010173
			РезЗ = З.Выполнить().Выгрузить();
			Если РезЗ.Количество() > 0 Тогда
				НужнаяСсылка = РезЗ[0].Ссылка;
			Иначе
				СпрТО = Справочники.ТехнологическиеОперации.СоздатьЭлемент();
				СпрТО.Изделие = Стр.Изделие;
				СпрТО.НазваниеОперации = Стр.НазваниеОперации;
				//Аверсон 01.02.2023 КВВ СВФР-010173 (
				Если Организация.ИНН = "690305814" Тогда     
					СпрТО.Наименование = СокрЛП(Стр.НазваниеОперации) + " (баз.расц. " + СокрЛП(Стр.БазоваяРасценка) + "; " + СокрЛП(Стр.Изделие) + ") ";
					СпрТО.БазоваяРасценка = Стр.БазоваяРасценка;
				Иначе
					//Аверсон 01.02.2023 КВВ СВФР-010173 )
					СпрТО.Наименование = СокрЛП(Стр.НазваниеОперации) + " (разряд " + СокрЛП(Стр.РазрядРаботы) + "; " + СокрЛП(Стр.Изделие) + ") ";
					СпрТО.РазрядРаботы = Стр.РазрядРаботы; 
				КонецЕсли;
				СпрТО.Организация = Организация;
				СпрТО.Записать();
				НужнаяСсылка = СпрТО.Ссылка;
			КонецЕсли;
			
			Набор = РегистрыСведений.Расценки.СоздатьНаборЗаписей();
			Период = НачалоДня(Дата);
			Набор.Отбор.Период.Установить(Период);
			Набор.Отбор.ТехнологическаяОперация.Установить(НужнаяСсылка);
			Набор.Отбор.Изделие.Установить(Стр.Изделие.Ссылка);
			Набор.Отбор.НазваниеОперации.Установить(Стр.НазваниеОперации.Ссылка); 
			//Аверсон 01.02.2023 КВВ СВФР-010173 (
			Если Организация.ИНН = "690305814" Тогда    
				Набор.Отбор.БазоваяРасценка.Установить(Стр.БазоваяРасценка.Ссылка);
			Иначе
				//Аверсон 01.02.2023 КВВ СВФР-010173 )
				Набор.Отбор.РазрядРаботы.Установить(Стр.РазрядРаботы.Ссылка); 
			КонецЕсли;
			Набор.Отбор.РегистраторДок.Установить(Ссылка);
			Запись = Набор.Добавить();
			Запись.Период = Период;
			Запись.Организация = Организация;
			Запись.ТехнологическаяОперация = НужнаяСсылка;
			Запись.Изделие = Стр.Изделие.Ссылка;
			Запись.НазваниеОперации = Стр.НазваниеОперации.Ссылка; 
			//Аверсон 01.02.2023 КВВ СВФР-010173 (
			Если Организация.ИНН = "690305814" Тогда    
				Запись.БазоваяРасценка = Стр.БазоваяРасценка.Ссылка;
			Иначе
				//Аверсон 01.02.2023 КВВ СВФР-010173 )
				Запись.РазрядРаботы = Стр.РазрядРаботы.Ссылка;     
			КонецЕсли;
			Запись.ТехническоеВремя = Стр.ТехническоеВремя;
			Запись.Тариф = Стр.Тариф;
			Запись.Расценка = Стр.Расценка;
			Запись.РегистраторДок = Ссылка;
			
			Попытка
				Набор.Записать();
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать данные о расценке: " + ОписаниеОшибки());
				Возврат;
			КонецПопытки;						
		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Набор = РегистрыСведений.Расценки.СоздатьНаборЗаписей();
	Набор.Отбор.РегистраторДок.Установить(Ссылка);
	Набор.Записать();
КонецПроцедуры
