
Функция ПолучитьКодСтроки() Экспорт
	
	мКод = 0;
	
	Для Каждого мСтрокаТЧ Из ШтатныеЕдиницы Цикл
		мКод = Макс(мКод, мСтрокаТЧ.КодСтроки);
	КонецЦикла;
	
	//+ СВЭЙ КДЯ 07.04.20 СВФР-005817
	//учитываем также строки подчиненных табличных частей, не имеющих владельца,
	// чтобы они не прикрепились к новой строке ТЧ "ШтатныеЕдиницы" 
	Для Каждого Стр Из КоэфПовышенияТО Цикл
		мКод = Макс(мКод, Стр.КодСтроки);
	КонецЦикла;
	Для Каждого Стр Из ПовышенияПоИнструкции Цикл
		мКод = Макс(мКод, Стр.КодСтроки);
	КонецЦикла;
	Для Каждого Стр Из Надбавки Цикл
		мКод = Макс(мКод, Стр.КодСтроки);
	КонецЦикла;
	//- СВЭЙ КДЯ 07.04.20 СВФР-005817
	
	Возврат мКод + 1;
	
КонецФункции

Процедура ДобавитьСтроку(мФорма) Экспорт
	
	СтрокаТабЧасти = ШтатныеЕдиницы.Добавить();
	СтрокаТабЧасти.КодСтроки = ПолучитьКодСтроки();
	СтрокаТабЧасти.ПодразделениеОрганизации = мФорма.ЭлементыФормы.Подразделения.ТекущаяСтрока;
	Если мФорма.ЭлементыФормы.ШтатныеЕдиницы.ТекущаяСтрока <> Неопределено Тогда
		СтрокаТабЧасти.БезЕТС = мФорма.ЭлементыФормы.ШтатныеЕдиницы.ТекущаяСтрока.БезЕТС;//О.Т. Аверсон 24.11.2016
	КонецЕсли;
	мФорма.ЭлементыФормы.ШтатныеЕдиницы.ТекущаяСтрока = СтрокаТабЧасти;
	
КонецПроцедуры

// Формирует запрос по таблице "ШтатныеЕдиницы" документа
//
Функция СформироватьЗапросПоШтатныеЕдиницы()

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ЗначениеПусто",	Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка());//О.Т. Аверсон 06.11.2015 № 679
	Запрос.Текст =
	"ВЫБРАТЬ
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	//|	ШтатныеЕдиницы.Сотрудник,
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	|" + ?(	ИзменениеСтавки1Разряда, "	ШтатныеЕдиницы.Сотрудник, ", "	ШтатныеЕдиницы.Сотрудник,
	|	ШтатныеЕдиницы.СотрудникЗаменяемый," ) + "
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.ПодразделениеОрганизации,
	|	ШтатныеЕдиницы.Должность,
	|	ШтатныеЕдиницы.ГрафикРаботы КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС) 
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.КоэффициентЕТС
	|	КОНЕЦ КАК КоэффициентЕТС, //О.Т. Аверсон 06.11.2015 № 679
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.РазрядЕТС
	|	КОНЕЦ КАК РазрядЕТС,//О.Т. Аверсон 06.11.2015 № 679
	|	ШтатныеЕдиницы.Категория КАК Категория,
	|	ШтатныеЕдиницы.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
	|	ШтатныеЕдиницы.ВидРасчета КАК ВидРасчета,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	СРЕДНЕЕ(ШтатныеЕдиницы.ТарифнаяСтавка) КАК ТарифнаяСтавка,
	//|	СРЕДНЕЕ(ШтатныеЕдиницы.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
	//|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавка,
	//|	СРЕДНЕЕ( ШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции ) КАК ТарифныйСПовышениемПоИнструкции,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	|	СУММА( ШтатныеЕдиницы.ЗанимаемыхСтавок ) КАК ЗанимаемыхСтавок,
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	//|	СУММА( ШтатныеЕдиницы.ТарифнаяСтавка ) КАК ТарифнаяСтавка,
	//|	СУММА( ШтатныеЕдиницы.МесячнаяТарифнаяСтавка ) КАК МесячнаяТарифнаяСтавка,
	//|	СУММА( ШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции ) КАК ТарифныйСПовышениемПоИнструкции,
	////- СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	СУММА( ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте ) КАК МесячнаяТарифнаяСтавкаВВалюте,
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.ТарифнаяСтавка КАК ТарифнаяСтавка,
	|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
	|	ШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции КАК ТарифныйСПовышениемПоИнструкции,
	|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте КАК МесячнаяТарифнаяСтавкаВВалюте,
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции КАК ИтоговоеПовышениеПоИнструкции,
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.ПовышенныйКоэффициентЕТС
	|	КОНЕЦ КАК ПовышенныйКоэффициентЕТС, //О.Т. Аверсон 06.11.2015 № 679
	|	СРЕДНЕЕ(ВЫБОР
	|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|				ТОГДА 0
	|			ИНАЧЕ ШтатныеЕдиницы.РазмерСтавки1Разряда
	|		КОНЕЦ) КАК РазмерСтавки1Разряда,//О.Т. Аверсон 06.11.2015 № 679
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА &ЗначениеПусто
	|		ИНАЧЕ ШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
	|	КОНЕЦ КАК ТарифнаяСтавкаПервогоРазряда,//О.Т. Аверсон 06.11.2015 № 679
	|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
	|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
	|	ШтатныеЕдиницы.ВидТарифнойСтавки КАК ВидТарифнойСтавки,
	|	СУММА( ШтатныеЕдиницы.СуммаВВалюте ) КАК СуммаВВалюте,
	|	СУММА( ШтатныеЕдиницы.ОкладСПовышениемВВалюте ) КАК ОкладСПовышениемВВалюте,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	ШтатныеЕдиницы.НомерСтроки КАК НомерСтроки,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	|	МАКСИМУМ( ШтатныеЕдиницы.КодСтроки ) КАК КодСтроки,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	СРЕДНЕЕ( ШтатныеЕдиницы.СуммаВВалюте ) КАК СуммаВВалюте,
	//|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте,
	//|	ШтатныеЕдиницы.БезЕТС, //О.Т. Аверсон 06.11.2015 № 679
	//|	ШтатныеЕдиницы.ОкладВВалюте,
	//|	ШтатныеЕдиницы.Валюта,
	//|	СРЕДНЕЕ(ШтатныеЕдиницы.ОкладСПовышениемВВалюте),
	//|	ШтатныеЕдиницы.ДляПечати //О.Т. Аверсон 12.04.2016 № 1041
	//|	ШтатныеЕдиницы.ОкладСПовышениемВВалюте,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	|	МИНИМУМ( ШтатныеЕдиницы.НомерСтроки ) КАК НомерСтроки,
	|	КОЛИЧЕСТВО( РАЗЛИЧНЫЕ ШтатныеЕдиницы.НомерСтроки ) > 1 КАК ЕстьДубли,
	|	МАКСИМУМ( ШтатныеЕдиницы.БезЕТС ) КАК БезЕТС,
	|	МАКСИМУМ( ШтатныеЕдиницы.ОкладВВалюте ) КАК ОкладВВалюте,
	|	МАКСИМУМ( ШтатныеЕдиницы.Валюта ) КАК Валюта,
	|	МАКСИМУМ( ШтатныеЕдиницы.ДляПечати ) КАК ДляПечати //О.Т. Аверсон 12.04.2016 № 1041
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	|ИЗ
	|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
	|ГДЕ
	|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	//|	ШтатныеЕдиницы.Сотрудник,
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	|" + ?(	ИзменениеСтавки1Разряда, "	ШтатныеЕдиницы.Сотрудник, ", "	ШтатныеЕдиницы.Сотрудник,
	|	ШтатныеЕдиницы.СотрудникЗаменяемый," ) + "
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.Сотрудник,
	|	ШтатныеЕдиницы.ПодразделениеОрганизации,
	|	ШтатныеЕдиницы.Должность,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавка,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавка,
	|	ШтатныеЕдиницы.ТарифнаяСтавка,
	|	ШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции,
	|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте,
	//- СВЭЙ КДЯ 21.09.19 СВФР-004240
	|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
	|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
	|	ШтатныеЕдиницы.ВидРасчета,
	|	ШтатныеЕдиницы.ГрафикРаботы,
	|	ШтатныеЕдиницы.ВидТарифнойСтавки,
	|	ШтатныеЕдиницы.Категория,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	ШтатныеЕдиницы.НомерСтроки,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	|	ШтатныеЕдиницы.ПроцентПоКонтракту,
	|	ШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции,
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//|	ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте,
	//|	ШтатныеЕдиницы.БезЕТС,
	//|	ШтатныеЕдиницы.ОкладВВалюте,
	//|	ШтатныеЕдиницы.Валюта,
	//|	ШтатныеЕдиницы.ДляПечати,
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.КоэффициентЕТС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.РазрядЕТС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА 0
	|		ИНАЧЕ ШтатныеЕдиницы.ПовышенныйКоэффициентЕТС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
	|			ТОГДА &ЗначениеПусто
	|		ИНАЧЕ ШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
	|	КОНЕЦ
	|";
	
	
	
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ)

	Заголовок = "";
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники"": ";
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение, в которое принимается работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана должность работника!", Отказ, Заголовок);
	КонецЕсли;
	
	//Аверсон 07.03.2023 КВВ СВФР-010498 ( (закомментировано)
	//// ГрафикРаботы
	//Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы)  Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан рабочий график!", Отказ, Заголовок);
	//КонецЕсли;
	//Аверсон 07.03.2023 КВВ СВФР-010498 ) (закомментировано)
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	//О.Т. 10.10.2014 № 241
	// НачалоДействия	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.НачалоДействия,
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Номер как Номер,
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Дата как Дата
	|ИЗ
	|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
	|ГДЕ
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.НачалоДействия = &НачалоДействия
	|	И ПлановоеШтатноеРасписаниеОрганизаций.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
	|	И ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.НачалоДействия,
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Номер,
	|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("Организация", Организация); //О.Т. Аверсон 06.01.2017 № 141
	
	Результат = Запрос.Выполнить().Выгрузить();
	если Результат.Количество() > 0 Тогда 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "На дату "+Формат(НачалоДействия,"ДЛФ=Д")+" уже есть документ № "+Результат[0].Номер+" "+Формат(Результат[0].Дата,"ДЛФ=Д")+"!", Отказ, Заголовок);
	КонецЕсли;
    //О.Т. 10.10.2014 № 241
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
Функция ПроверкаДублейШтатныхЕдиниц( РезультатЗапросаПоШтатныеЕдиницы )
	Возврат Истина;
	ЗначениеФункции = Истина;
	ТЗ_ШтатныеЕдиницы = РезультатЗапросаПоШтатныеЕдиницы.Выгрузить();
	СтрокиСДублями = ТЗ_ШтатныеЕдиницы.НайтиСтроки( Новый Структура( "ЕстьДубли", Истина ) );
	Для каждого Стр Из СтрокиСДублями Цикл
		ЗначениеФункции = Ложь;
		Сообщить( "Для строки № " + Стр.НомерСтроки + "( Должность = " + Стр.Должность 
			+ ", Подразделение = " + Стр.ПодразделениеОрганизации 
			+ " ) существуют дублирующие строки! Проведение отменено!", СтатусСообщения.ОченьВажное );
	КонецЦикла;
	
	Возврат ЗначениеФункции;
	
КонецФункции // ПроверкаДублейШтатныхЕдиниц()
//- СВЭЙ КДЯ 21.06.19 СВФР-004240


//+ СВЭЙ КДЯ 25.02.20 СВФР-005561
Функция ПолучитьОкладНа1Ставку( Движение )
	
	ОкладНа1Ставку = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ЗакрываемаяПозиция.ОкладНа1Ставку
		|	*
		|ИЗ
		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(
		|			&Период,
		|			ВидДеятельностиИзмерение = &ВидДеятельностиИзмерение
		|				И УсловияТрудаИзмерение = &УсловияТрудаИзмерение
		|				И ТарифнаяСтавкаПервогоРазряда = &ТарифнаяСтавкаПервогоРазряда
		|				И РазрядЕТС = &РазрядЕТС
		|				И ПроцентПоКонтракту = &ПроцентПоКонтракту
		|				И ПодразделениеОрганизации = &ПодразделениеОрганизации
		|				И ПовышенныйКоэффициентЕТС = &ПовышенныйКоэффициентЕТС
		|				И КоэффициентЕТС = &КоэффициентЕТС
		|				И ИтоговоеПовышениеПоИнструкции = &ИтоговоеПовышениеПоИнструкции
		|				И Должность = &Должность
		|				И ГрафикРаботы = &ГрафикРаботы) КАК ЗакрываемаяПозиция";
	
	Запрос.УстановитьПараметр("Период", Движение.Период);
	Запрос.УстановитьПараметр("ВидДеятельностиИзмерение", Движение.ВидДеятельностиИзмерение);
	Запрос.УстановитьПараметр("УсловияТрудаИзмерение", Движение.УсловияТрудаИзмерение);
	Запрос.УстановитьПараметр("ТарифнаяСтавкаПервогоРазряда", Движение.ТарифнаяСтавкаПервогоРазряда);
	Запрос.УстановитьПараметр("РазрядЕТС", Движение.РазрядЕТС);
	Запрос.УстановитьПараметр("ПроцентПоКонтракту", Движение.ПроцентПоКонтракту);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", Движение.ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ПовышенныйКоэффициентЕТС", Движение.ПовышенныйКоэффициентЕТС);
	Запрос.УстановитьПараметр("КоэффициентЕТС", Движение.КоэффициентЕТС);
	Запрос.УстановитьПараметр("ИтоговоеПовышениеПоИнструкции", Движение.ИтоговоеПовышениеПоИнструкции);
	Запрос.УстановитьПараметр("Должность", Движение.Должность);
	Запрос.УстановитьПараметр("ГрафикРаботы", Движение.ГрафикРаботы);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОкладНа1Ставку = ВыборкаДетальныеЗаписи.ОкладНа1Ставку;
	КонецЦикла;
	
	Возврат ОкладНа1Ставку;
	
КонецФункции
//- СВЭЙ КДЯ 25.02.20 СВФР-005561


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	//ВыборкаСтрокЗапроса = СформироватьЗапросПоШтатныеЕдиницы().Выбрать();
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	
	//+ СВЭЙ КДЯ 21.06.19 СВФР-004240
	РезультатЗапросаПоШтатныеЕдиницы = СформироватьЗапросПоШтатныеЕдиницы();
	Отказ = Отказ ИЛИ НЕ ПроверкаДублейШтатныхЕдиниц( РезультатЗапросаПоШтатныеЕдиницы );
	Если Отказ Тогда
		Возврат;	
	КонецЕсли; 
	ВыборкаСтрокЗапроса = РезультатЗапросаПоШтатныеЕдиницы.Выбрать();
	//- СВЭЙ КДЯ 21.06.19 СВФР-004240
	
	//О.Т. 10.10.2014 № 241
	если ВыборкаСтрокЗапроса.Количество() = 0 Тогда 
		ОбщегоНазначения.СообщитьОбОшибке("В табличной части документа нет ни одной записи!", Отказ, "");
	КонецЕсли;
	//О.Т. 10.10.2014 № 241
	Пока ВыборкаСтрокЗапроса.Следующий() Цикл
		
		ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаСтрокЗапроса , Отказ);
		Если НЕ Отказ Тогда
			Движение = Движения.ПлановоеШтатноеРасписаниеОрганизаций.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаСтрокЗапроса);
			Движение.Период = НачалоДействия;
			Если ВыборкаСтрокЗапроса.ЗанимаемыхСтавок <> 0 Тогда 
				//Аверсон 16.07.2020 КВВ СВФР-006300 (
				//	Движение.ОкладНа1Ставку = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСтрокЗапроса.ТарифнаяСтавка / ВыборкаСтрокЗапроса.ЗанимаемыхСтавок,НачалоДействия);//О.Т. Аверсон 24.11.2016 № 46
				ОкладНа1Ставку_Расчетный = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСтрокЗапроса.ТарифнаяСтавка / ВыборкаСтрокЗапроса.ЗанимаемыхСтавок,НачалоДействия);//О.Т. Аверсон 24.11.2016 № 46
				Если Цел(ВыборкаСтрокЗапроса.ЗанимаемыхСтавок)<>ВыборкаСтрокЗапроса.ЗанимаемыхСтавок Тогда 
					ОкладНа1Ставку_ДолженБыть = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСтрокЗапроса.РазмерСтавки1Разряда*ВыборкаСтрокЗапроса.КоэффициентЕТС*ВыборкаСтрокЗапроса.ПовышенныйКоэффициентЕТС,НачалоДействия);
					Если ОкладНа1Ставку_Расчетный<>ОкладНа1Ставку_ДолженБыть Тогда
						ОкладНа1Ставку_Расчетный = ОкладНа1Ставку_ДолженБыть;
					КонецЕсли;
				КонецЕсли;
				Движение.ОкладНа1Ставку = ОкладНа1Ставку_Расчетный;
				//Аверсон 16.07.2020 КВВ СВФР-006300 )
			иначе
				//+ СВЭЙ КДЯ 25.02.20 СВФР-005561
				//Движение.ОкладНа1Ставку = ВыборкаСтрокЗапроса.ТарифнаяСтавка;//О.Т. Аверсон 24.11.2016 № 46
				//- СВЭЙ КДЯ 25.02.20 СВФР-005561
				//+ СВЭЙ КДЯ 25.02.20 СВФР-005561
				Движение.ОкладНа1Ставку = ПолучитьОкладНа1Ставку( Движение );
				//- СВЭЙ КДЯ 25.02.20 СВФР-005561
			КонецЕсли;
		КонецЕсли;

	КонецЦикла; 
	
	Движения.ПлановоеШтатноеРасписаниеОрганизаций.Записать();
	
	//формируем сгрупированные регистры накопления;
	Если НЕ Отказ Тогда
		
		//	штатные единицы
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
		Запрос.УстановитьПараметр("ЗначениеПусто",	Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка());//О.Т. Аверсон 06.11.2015 № 679
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтатныеЕдиницы.ПодразделениеОрганизации,
		|	ШтатныеЕдиницы.Должность,
		|	МАКСИМУМ(ШтатныеЕдиницы.ГрафикРаботы) КАК ГрафикРаботы,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
		|				ТОГДА 0
		|			ИНАЧЕ ШтатныеЕдиницы.КоэффициентЕТС
		|		КОНЕЦ) КАК КоэффициентЕТС,//О.Т. Аверсон 06.11.2015 № 679
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
		|				ТОГДА 0
		|			ИНАЧЕ ШтатныеЕдиницы.РазрядЕТС
		|		КОНЕЦ) КАК РазрядЕТС,//О.Т. Аверсон 06.11.2015 № 679
		|	МАКСИМУМ(ШтатныеЕдиницы.Категория) КАК Категория,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.ПроцентПоКонтракту) КАК ПроцентПоКонтракту,
		|	МАКСИМУМ(ШтатныеЕдиницы.ВидРасчета) КАК ВидРасчета,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.ТарифнаяСтавка) КАК ТарифнаяСтавка,
		|	СУММА(ШтатныеЕдиницы.ЗанимаемыхСтавок) КАК КоличествоСтавок,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.МесячнаяТарифнаяСтавка) КАК РасчетнаяТарифнаяСтавка,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции) КАК ТарифныйСПовышениемПоИнструкции,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции) КАК ИтоговоеПовышениеПоИнструкции,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
		|				ТОГДА 0
		|			ИНАЧЕ ШтатныеЕдиницы.ПовышенныйКоэффициентЕТС
		|		КОНЕЦ) КАК ПовышенныйКоэффициентЕТС, //О.Т. Аверсон 06.11.2015 № 679
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
		|				ТОГДА 0
		|			ИНАЧЕ ШтатныеЕдиницы.РазмерСтавки1Разряда
		|		КОНЕЦ) КАК РазмерСтавкиПервогоРазряда,//О.Т. Аверсон 06.11.2015 № 679
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ШтатныеЕдиницы.БезЕТС или (не ШтатныеЕдиницы.БезЕТС и ШтатныеЕдиницы.Ссылка.Организация.НеУчитыватьЕТКС)
		|				ТОГДА &ЗначениеПусто
		|			ИНАЧЕ ШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
		|		КОНЕЦ) КАК ТарифнаяСтавкаПервогоРазряда,//О.Т. Аверсон 06.11.2015 № 679
		|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
		|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
		|	МАКСИМУМ(ШтатныеЕдиницы.ВидТарифнойСтавки) КАК ВидТарифнойСтавки,
		|	ШтатныеЕдиницы.БезЕТС, //О.Т. Аверсон 06.11.2015 № 679
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		|	ШтатныеЕдиницы.БезЕТС КАК БезЕТС1,
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		|	ШтатныеЕдиницы.Валюта,
		|	СРЕДНЕЕ(ШтатныеЕдиницы.СуммаВВалюте),
		|	СРЕДНЕЕ(ШтатныеЕдиницы.ОкладСПовышениемВВалюте),
		|	СРЕДНЕЕ(ШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте) //О.Т. Аверсон 12.04.2016 № 1041
		|ИЗ
		|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
		|ГДЕ
		|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтатныеЕдиницы.ПодразделениеОрганизации,
		|	ШтатныеЕдиницы.Должность,
		|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
		|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
		|	ШтатныеЕдиницы.БезЕТС,
		|	ШтатныеЕдиницы.Валюта";
	
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		//Результат = Запрос.Выполнить().Выбрать();
		//
		//НаборЗаписейШтатного = РегистрыСведений.ШтатноеРасписаниеОрганизаций.СоздатьНаборЗаписей();

		//Пока Результат.Следующий() Цикл
		//	//О.Т. Аверсон 13.03.2017 № 401
		//	НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Результат.ПодразделениеОрганизации);
		//	НаборЗаписейШтатного.Отбор.Должность.Установить(Результат.Должность);
		//	НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Результат.УсловияТрудаИзмерение);
		//	НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Результат.ВидДеятельностиИзмерение);
		//	НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		//    НаборЗаписейШтатного.Прочитать();
		//	НаборЗаписейШтатного.Очистить();
		//	//О.Т. Аверсон 13.03.2017 № 401
		//	
		//	Движение = НаборЗаписейШтатного.Добавить();
		//	ЗаполнитьЗначенияСвойств(Движение, Результат);
		//	Движение.Период = НачалоДействия;
		//	Движение.БезЕТС1 = Результат.БезЕТС;//О.Т. Аверсон 24.11.2016 № 46    
		//	НаборЗаписейШтатного.Записать();
		//КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		ВыборкаШтатного = Запрос.Выполнить().Выбрать();

		Пока ВыборкаШтатного.Следующий() Цикл
			
			МенеджерЗаписиШтатного = РегистрыСведений.ШтатноеРасписаниеОрганизаций.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств( МенеджерЗаписиШтатного, ВыборкаШтатного );
			МенеджерЗаписиШтатного.Период = НачалоДействия;
			МенеджерЗаписиШтатного.Записать();
			
		КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
				
		//коэффициенты повышения
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		Если НЕ Организация.НеУчитыватьЕТКС Тогда 
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
			Запрос.Текст = "
			|ВЫБРАТЬ
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//не сворачиваем, а перезаписываем
			|	РАЗЛИЧНЫЕ
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|	ШтатныеЕдиницы.ПодразделениеОрганизации,
			|	ШтатныеЕдиницы.Должность,
			|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
			|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
			|	КоэфПовышенияТО.Коэффициент,
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//|	СУММА(КоэфПовышенияТО.Размер) КАК Размер,
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			|	КоэфПовышенияТО.Размер КАК Размер,
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|	ШтатныеЕдиницы.БезЕТС
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.КоэфПовышенияТО КАК КоэфПовышенияТО
			|		ПО ШтатныеЕдиницы.КодСтроки = КоэфПовышенияТО.КодСтроки
			|			И ШтатныеЕдиницы.Ссылка = КоэфПовышенияТО.Ссылка
			|ГДЕ
			|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			|   И НЕ ШтатныеЕдиницы.БезЕТС
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//|СГРУППИРОВАТЬ ПО
			//|	ШтатныеЕдиницы.ПодразделениеОрганизации,
			//|	ШтатныеЕдиницы.Должность,
			//|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
			//|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
			//|	КоэфПовышенияТО.Коэффициент,
			//|	ШтатныеЕдиницы.БезЕТС
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|";

			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//Результат = Запрос.Выполнить().Выбрать();
			//РезультатКоэфПовышенияТО = Запрос.Выполнить().Выбрать();
			//
			//НаборЗаписейШтатного = РегистрыСведений.КоэфПовышенияТОПоШтатному.СоздатьНаборЗаписей();
			//Пока Результат.Следующий() Цикл
			//	
			//	если не Результат.БезЕТС и не Организация.НеУчитыватьЕТКС Тогда 
			//	
			//		//О.Т. Аверсон 13.03.2017 № 401
			//		НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Результат.ПодразделениеОрганизации);
			//		НаборЗаписейШтатного.Отбор.Должность.Установить(Результат.Должность);
			//		НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Результат.УсловияТрудаИзмерение);
			//		НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Результат.ВидДеятельностиИзмерение);
			//		НаборЗаписейШтатного.Отбор.Коэффициент.Установить(Результат.Коэффициент);
			//		//О.Т. Аверсон 13.03.2017 № 401
			//		
			//		НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
			//		НаборЗаписейШтатного.Прочитать();
			//		НаборЗаписейШтатного.Очистить();

			//		
			//		Движение = НаборЗаписейШтатного.Добавить();
			//		ЗаполнитьЗначенияСвойств(Движение, Результат);
			//		Движение.Период = НачалоДействия; 
			//		Если НаборЗаписейШтатного.Количество() > 0 Тогда  
			//			НаборЗаписейШтатного.Записать();
			//		КонецЕсли;
			//		
			//	КонецЕсли; // НЕ Результат.БезЕТС
			//	
			//КонецЦикла;
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			ВыборкаКоэфПовышенияТО = Запрос.Выполнить().Выбрать();
			Пока ВыборкаКоэфПовышенияТО.Следующий() Цикл
				МенеджерЗаписиКоэфПовышенияТО = РегистрыСведений.КоэфПовышенияТОПоШтатному.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств( МенеджерЗаписиКоэфПовышенияТО, ВыборкаКоэфПовышенияТО );
				МенеджерЗаписиКоэфПовышенияТО.Период = НачалоДействия;
				МенеджерЗаписиКоэфПовышенияТО.Записать();
			КонецЦикла;
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		КонецЕсли; // НЕ Организация.НеУчитыватьЕТКС 
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
		
		//проценты повышения
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
		Запрос.Текст =
			"ВЫБРАТЬ
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//не сворачиваем, а перезаписываем
			|	РАЗЛИЧНЫЕ
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|	ШтатныеЕдиницы.ПодразделениеОрганизации,
			|	ШтатныеЕдиницы.Должность,
			|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
			|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
			|	ПовышенияПоИнструкции.Коэффициент,
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//|	СУММА(ПовышенияПоИнструкции.Размер) КАК Размер
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			|	ПовышенияПоИнструкции.Размер КАК Размер
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ПовышенияПоИнструкции
			|		ПО ШтатныеЕдиницы.КодСтроки = ПовышенияПоИнструкции.КодСтроки
			|			И ШтатныеЕдиницы.Ссылка = ПовышенияПоИнструкции.Ссылка
			|ГДЕ
			|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
			|
			//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
			//|СГРУППИРОВАТЬ ПО
			//|	ШтатныеЕдиницы.ПодразделениеОрганизации,
			//|	ШтатныеЕдиницы.Должность,
			//|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
			//|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
			//|	ПовышенияПоИнструкции.Коэффициент
			//- СВЭЙ 22.03.19 КДЯ СВФР-003209
			|";
			
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		//Результат = Запрос.Выполнить().Выбрать();
		//РезультатПовышенияПоИнструкции = Запрос.Выполнить().Выбрать();
			
		//НаборЗаписейШтатного = РегистрыСведений.ПовышенияПоИнструкцииПоШтатному.СоздатьНаборЗаписей();
		//Пока Результат.Следующий() Цикл
		//	//О.Т. Аверсон 13.03.2017 № 401
		//	НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Результат.ПодразделениеОрганизации);
		//	НаборЗаписейШтатного.Отбор.Должность.Установить(Результат.Должность);
		//	НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Результат.УсловияТрудаИзмерение);
		//	НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Результат.ВидДеятельностиИзмерение);
		//	НаборЗаписейШтатного.Отбор.Коэффициент.Установить(Результат.Коэффициент);
		//	НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		//	НаборЗаписейШтатного.Прочитать();
		//	НаборЗаписейШтатного.Очистить();
		//	//О.Т. Аверсон 13.03.2017 № 401
		//
		//	Движение = НаборЗаписейШтатного.Добавить();
		//	ЗаполнитьЗначенияСвойств(Движение, Результат);
		//	Движение.Период = НачалоДействия;   
		//	
		//	НаборЗаписейШтатного.Записать();
		//КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		ВыборкаПовышенияПоИнструкции = Запрос.Выполнить().Выбрать();
		Пока ВыборкаПовышенияПоИнструкции.Следующий() Цикл
			МенеджерЗаписиПовышенияПоИнструкции = РегистрыСведений.ПовышенияПоИнструкцииПоШтатному.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств( МенеджерЗаписиПовышенияПоИнструкции, ВыборкаПовышенияПоИнструкции );
			МенеджерЗаписиПовышенияПоИнструкции.Период = НачалоДействия;
			МенеджерЗаписиПовышенияПоИнструкции.Записать();
		КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
		
		//Надбавки
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		//Запрос.Текст =
		//	"ВЫБРАТЬ
		//	|	ШтатныеЕдиницы.ПодразделениеОрганизации,
		//	|	ШтатныеЕдиницы.Должность,
		//	|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
		//	|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
		//	|	МАКСИМУМ(Надбавки.Валюта1) КАК Валюта1,
		//	|	МАКСИМУМ(Надбавки.Валюта2) КАК Валюта2,
		//	|	МАКСИМУМ(Надбавки.Валюта3) КАК Валюта3,
		//	|	МАКСИМУМ(Надбавки.Валюта4) КАК Валюта4,
		//	|	МАКСИМУМ(Надбавки.Валюта5) КАК Валюта5,
		//	|	МАКСИМУМ(Надбавки.Валюта6) КАК Валюта6,
		//	|	Надбавки.ВидНадбавки,
		//	|	СУММА(Надбавки.Показатель1) КАК Показатель1,
		//	|	СУММА(Надбавки.Показатель2) КАК Показатель2,
		//	|	СУММА(Надбавки.Показатель3) КАК Показатель3,
		//	|	СУММА(Надбавки.Показатель4) КАК Показатель4,
		//	|	СУММА(Надбавки.Показатель5) КАК Показатель5,
		//	|	СУММА(Надбавки.Показатель6) КАК Показатель6
		//	|ИЗ
		//	|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.Надбавки КАК Надбавки
		//	|		ПО ШтатныеЕдиницы.КодСтроки = Надбавки.КодСтроки
		//	|			И ШтатныеЕдиницы.Ссылка = Надбавки.Ссылка
		//	|ГДЕ
		//	|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ШтатныеЕдиницы.ПодразделениеОрганизации,
		//	|	ШтатныеЕдиницы.Должность,
		//	|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
		//	|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
		//	|	Надбавки.ВидНадбавки";
		//
		//Результат = Запрос.Выполнить().Выбрать();
		//
		//НаборЗаписейШтатного = РегистрыСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СоздатьНаборЗаписей();
		//Пока Результат.Следующий() Цикл
		//	//О.Т. Аверсон 13.03.2017 № 401
		//	НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Результат.ПодразделениеОрганизации);
		//	НаборЗаписейШтатного.Отбор.Должность.Установить(Результат.Должность);
		//	НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Результат.УсловияТрудаИзмерение);
		//	НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Результат.ВидДеятельностиИзмерение);
		//	НаборЗаписейШтатного.Отбор.ВидНадбавки.Установить(Результат.ВидНадбавки);
		//	НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		//	НаборЗаписейШтатного.Прочитать();
		//	НаборЗаписейШтатного.Очистить();
		//	//О.Т. Аверсон 13.03.2017 № 401
		//
		//	Движение = НаборЗаписейШтатного.Добавить();
		//	ЗаполнитьЗначенияСвойств(Движение, Результат);
		//	Движение.Период = НачалоДействия;
		//	НаборЗаписейШтатного.Записать();

		//КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209
		//не сворачиваем, а перезаписываем
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ШтатныеЕдиницы.ПодразделениеОрганизации,
			|	ШтатныеЕдиницы.Должность,
			|	ШтатныеЕдиницы.УсловияТрудаИзмерение,
			|	ШтатныеЕдиницы.ВидДеятельностиИзмерение,
			|	Надбавки.Валюта1 КАК Валюта1,
			|	Надбавки.Валюта2 КАК Валюта2,
			|	Надбавки.Валюта3 КАК Валюта3,
			|	Надбавки.Валюта4 КАК Валюта4,
			|	Надбавки.Валюта5 КАК Валюта5,
			|	Надбавки.Валюта6 КАК Валюта6,
			|	Надбавки.ВидНадбавки,
			|	Надбавки.Показатель1 КАК Показатель1,
			|	Надбавки.Показатель2 КАК Показатель2,
			|	Надбавки.Показатель3 КАК Показатель3,
			|	Надбавки.Показатель4 КАК Показатель4,
			|	Надбавки.Показатель5 КАК Показатель5,
			|	Надбавки.Показатель6 КАК Показатель6
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ШтатныеЕдиницы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.Надбавки КАК Надбавки
			|		ПО ШтатныеЕдиницы.КодСтроки = Надбавки.КодСтроки
			|			И ШтатныеЕдиницы.Ссылка = Надбавки.Ссылка
			|ГДЕ
			|	ШтатныеЕдиницы.Ссылка = &ДокументСсылка
			|";
			
		ВыборкаНадбавкиПоШтатному = Запрос.Выполнить().Выбрать();
		Пока ВыборкаНадбавкиПоШтатному.Следующий() Цикл
			МенеджерЗаписиНадбавкиПоШтатному = РегистрыСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств( МенеджерЗаписиНадбавкиПоШтатному, ВыборкаНадбавкиПоШтатному );
			МенеджерЗаписиНадбавкиПоШтатному.Период = НачалоДействия;
			МенеджерЗаписиНадбавкиПоШтатному.Записать();
		КонецЦикла;
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209
				
	КонецЕсли;  // НЕ Отказ
	
	//29.11.2010 Дмитрук Ольга
	//сделаем движения, как при проведении Кадрового перемещения
	//будет использоваться при изменении ТС 1-го разряда
	мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
	Если НачалоДействия > Дата('20110101') Тогда
		Если ЗакрыватьСтавку = Ложь Тогда
			НаборЗаписейРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();
			НаборЗаписейТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.СоздатьНаборЗаписей();
			НаборЗаписейКоэфПовышенияТО = РегистрыСведений.КоэфПовышенияТО.СоздатьНаборЗаписей();
			НаборЗаписейПовышенияПоИнструкции = РегистрыСведений.ПовышенияПоИнструкции.СоздатьНаборЗаписей();
			НаборЗаписейПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
			
			Для Каждого СтрокаШтатныеЕдиницы из ШтатныеЕдиницы Цикл
				Если Не ПустаяСтрока(СтрокаШтатныеЕдиницы.Сотрудник) Тогда
					
					// движения по регистру сведений "РаботникиОрганизаций"
					НаборЗаписейРаботникиОрганизаций.Отбор.Регистратор.Установить(Ссылка);	
					Движение = НаборЗаписейРаботникиОрганизаций.Добавить();
					Движение.Период = НачалоДействия;
					// Измерения
					Движение.Сотрудник					= СтрокаШтатныеЕдиницы.Сотрудник;
					Движение.Организация				= Организация;
					Движение.ТипРаботника				= СтрокаШтатныеЕдиницы.Сотрудник.ТипРаботника;
					Движение.СотрудникЗаменяемый		= СтрокаШтатныеЕдиницы.СотрудникЗаменяемый;
					
					// Ресурсы
					
					Движение.ПодразделениеОрганизации	= СтрокаШтатныеЕдиницы.ПодразделениеОрганизации;
					Движение.Должность					= СтрокаШтатныеЕдиницы.Должность;
					Движение.ЗанимаемыхСтавок			= СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок;
					Движение.ГрафикРаботы				= СтрокаШтатныеЕдиницы.ГрафикРаботы;
					//Если не СтрокаШтатныеЕдиницы.БезЕТС Тогда  //О.Т. Аверсон 06.11.2015 № 679
					Движение.РазрядЕТС                  = СтрокаШтатныеЕдиницы.РазрядЕТС; //РБ
					Движение.КоэффициентЕТС             = СтрокаШтатныеЕдиницы.КоэффициентЕТС; //РБ  
					Движение.ПовышенныйКоэффициентЕТС = СтрокаШтатныеЕдиницы.ПовышенныйКоэффициентЕТС; //РБ  
					Движение.ТарифнаяСтавкаПервогоРазряда = СтрокаШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда; //РБ
					Движение.БезЕТС				= СтрокаШтатныеЕдиницы.БезЕТС; 
					Движение.ОкладВВалюте				= СтрокаШтатныеЕдиницы.ОкладВВалюте; //О.Т. Аверсон 12.04.2016 № 1041
					Движение.ДляПечати                  = СтрокаШтатныеЕдиницы.ДляПечати;
					
					//иначе
					//	Движение.БезЕТС				= СтрокаШтатныеЕдиницы.БезЕТС;
					//КонецЕсли;
					Движение.Категория                  = СтрокаШтатныеЕдиницы.Категория; //РБ
					Движение.ИтоговоеПовышениеПоИнструкции = СтрокаШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции; //РБ
					
					Движение.УсловияТрудаИзмерение		   = СтрокаШтатныеЕдиницы.УсловияТрудаИзмерение; //РБ
					Движение.ВидДеятельностиИзмерение	   = СтрокаШтатныеЕдиницы.ВидДеятельностиИзмерение; //РБ
										// Реквизиты
					Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.Перемещение;
					Движение.ОбособленноеПодразделение	= Организация;
					НаборЗаписейРаботникиОрганизаций.Записать();
					
					// движения по регистру "ТарифныеСтавкиработниковОрганизации"
					НаборЗаписейТарифныеСтавкиРаботниковОрганизации.Отбор.Регистратор.Установить(Ссылка);					
					Движение = НаборЗаписейТарифныеСтавкиРаботниковОрганизации.Добавить();
					Движение.Период = НачалоДействия;
					// Измерения
					Движение.Сотрудник           = СтрокаШтатныеЕдиницы.Сотрудник;
					Движение.Организация        	= Организация;
					// Ресурсы
					Движение.Ставка          	= СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавка;
					Движение.ПроцентПоКонтракту  = СтрокаШтатныеЕдиницы.ПроцентПоКонтракту;
					Движение.ТарифнаяСтавка 		= СтрокаШтатныеЕдиницы.ТарифнаяСтавка;
					Движение.ТарифнаяСПовышениемПоИнструкции = СтрокаШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции;
					//О.Т. Аверсон 12.04.2016 № 1041
					Движение.ОкладВВалюте	= СтрокаШтатныеЕдиницы.ОкладВВалюте;
					Движение.Валюта	= СтрокаШтатныеЕдиницы.Валюта;
					Движение.СуммаВВалюте	= СтрокаШтатныеЕдиницы.СуммаВВалюте;
					Движение.ОкладСПовышениемВВалюте	= СтрокаШтатныеЕдиницы.ОкладСПовышениемВВалюте;
					Движение.МесячнаяТарифнаяСтавкаВВалюте	= СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте;
					Движение.ДляПечати	= СтрокаШтатныеЕдиницы.ДляПечати;
					//О.Т. Аверсон 12.04.2016 № 1041
					НаборЗаписейТарифныеСтавкиРаботниковОрганизации.Записать();
					
					// движения по регистру "КоэфПовышенияТО"
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
					Запрос.УстановитьПараметр("КодСтрокиСотр", СтрокаШтатныеЕдиницы.КодСтроки);
					Запрос.Текст =
					"ВЫБРАТЬ
					|	КоэфПовышенияТО.Коэффициент,
					|	СУММА(КоэфПовышенияТО.Размер) КАК Размер
					|ИЗ
					|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.КоэфПовышенияТО КАК КоэфПовышенияТО
					|ГДЕ
					|	КоэфПовышенияТО.Ссылка = &ДокументСсылка
					|   И КоэфПовышенияТО.КодСтроки = &КодСтрокиСотр
					|
					|СГРУППИРОВАТЬ ПО
					|	КоэфПовышенияТО.Коэффициент";
					
					Результат = Запрос.Выполнить().Выбрать();
					
					НаборЗаписейКоэфПовышенияТО.Отбор.Регистратор.Установить(Ссылка);					
					Пока Результат.Следующий() Цикл
						если не СтрокаШтатныеЕдиницы.БезЕТС и не Организация.НеУчитыватьЕТКС Тогда //О.Т. Аверсон 06.11.2015 № 679
							Движение = НаборЗаписейКоэфПовышенияТО.Добавить();
							ЗаполнитьЗначенияСвойств(Движение, Результат);
							Движение.Период = НачалоДействия;
							Движение.Сотрудник = СтрокаШтатныеЕдиницы.Сотрудник;
							Движение.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
						КонецЕсли;
					КонецЦикла;
					если НаборЗаписейКоэфПовышенияТО.Количество() > 0 Тогда //О.Т. Аверсон 06.11.2015 № 679
						НаборЗаписейКоэфПовышенияТО.Записать();
					КонецЕсли;
					
					// движения по регистру "ПовышенияПоИнструкции"
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
					Запрос.УстановитьПараметр("КодСтрокиСотр", СтрокаШтатныеЕдиницы.КодСтроки);
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ПовышенияПоИнструкции.Коэффициент,
					|	СУММА(ПовышенияПоИнструкции.Размер) КАК Размер
					|ИЗ
					|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ПовышенияПоИнструкции
					|ГДЕ
					|	ПовышенияПоИнструкции.Ссылка = &ДокументСсылка
					|   И ПовышенияПоИнструкции.КодСтроки = &КодСтрокиСотр
					|
					|СГРУППИРОВАТЬ ПО
					|	ПовышенияПоИнструкции.Коэффициент";
					
					Результат = Запрос.Выполнить().Выбрать();
					
					НаборЗаписейПовышенияПоИнструкции.Отбор.Регистратор.Установить(Ссылка);	
					Пока Результат.Следующий() Цикл
						Движение = НаборЗаписейПовышенияПоИнструкции.Добавить();
						ЗаполнитьЗначенияСвойств(Движение, Результат);
						Движение.Период = НачалоДействия;
						Движение.Сотрудник = СтрокаШтатныеЕдиницы.Сотрудник;
						Движение.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
					КонецЦикла;
					НаборЗаписейПовышенияПоИнструкции.Записать();
					
					//движение по регистру "ПлановыеНачисленияРаботниковОрганизаций"
					НаборЗаписейПлановыеНачисленияРаботниковОрганизаций.Отбор.Регистратор.Установить(Ссылка);					
					Движение = НаборЗаписейПлановыеНачисленияРаботниковОрганизаций.Добавить();
					Движение.Период = НачалоДействия;
					// Измерения
					Движение.Сотрудник           = СтрокаШтатныеЕдиницы.Сотрудник;
					Движение.Организация        	= Организация;
					// Ресурсы
					Движение.ВидРасчета        	= СтрокаШтатныеЕдиницы.ВидРасчета;
					
					Если СтрокаШтатныеЕдиницы.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
						ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоДействия,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = СтрокаШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = СтрокаШтатныеЕдиницы.ОкладСПовышениемВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
						Иначе
							Тариф = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
						КонецЕсли;
						Если ДнейВГоду.Размер <> 0 тогда
							Движение.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
							Движение.Показатель1ВВалюте	  = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 12.04.2016 № 1041
						Иначе
							Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
						КонецЕсли;
					ИначеЕсли СтрокаШтатныеЕдиницы.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ СтрокаШтатныеЕдиницы.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
						Если ЗначениеЗаполнено(СтрокаШтатныеЕдиницы.ГрафикРаботы) Тогда  //О.Т. Аверсон 05.02.2018 № 1547
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(НачалоДействия,
							Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),СтрокаШтатныеЕдиницы.ГрафикРаботы));
							Если ЧасовВГоду.Размер = 0 Тогда 
								ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(НачалоДействия,
								Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
							КонецЕсли;

						иначе
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(НачалоДействия,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
							
						КонецЕсли;
					
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = СтрокаШтатныеЕдиницы.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = СтрокаШтатныеЕдиницы.ОкладСПовышениемВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
						Иначе
							Тариф = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
						КонецЕсли;
						Если ЧасовВГоду.Размер <> 0 тогда
							Если НачалоДействия < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
								Движение.Показатель1 = Окр(Тариф / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);
								Движение.Показатель1ВВалюте= Окр(ТарифВВалюте / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);//О.Т. Аверсон 12.04.2016 № 1041
							иначе
								Движение.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), НачалоДействия);//О.Т. Аверсон 17.03.2016 № 949
								Движение.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / СтрокаШтатныеЕдиницы.ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), НачалоДействия);
							КонецЕсли;
						Иначе
							Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
						КонецЕсли;
					Иначе
						Движение.Показатель1  = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавка;	
						Движение.Показатель1ВВалюте  = СтрокаШтатныеЕдиницы.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
					КонецЕсли;
					
					Движение.Действие 		= Перечисления.ВидыДействияСНачислением.Изменить;
					НаборЗаписейПлановыеНачисленияРаботниковОрганизаций.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// конец Дмитрук Ольга
КонецПроцедуры
      
Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	НаборЗаписейШтатного = РегистрыСведений.ШтатноеРасписаниеОрганизаций.СоздатьНаборЗаписей();
	Для Каждого стрШт из ШтатныеЕдиницы Цикл  
		//О.Т. Аверсон 13.03.2017 № 401
		НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(стрШт.ПодразделениеОрганизации);
		НаборЗаписейШтатного.Отбор.Должность.Установить(стрШт.Должность);
		НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(стрШт.УсловияТрудаИзмерение);
		НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(стрШт.ВидДеятельностиИзмерение);
		//О.Т. Аверсон 13.03.2017 № 401
		НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		НаборЗаписейШтатного.Записать();
	КонецЦикла;
	
	НаборЗаписейШтатного = РегистрыСведений.КоэфПовышенияТОПоШтатному.СоздатьНаборЗаписей();
	Для Каждого Результат из КоэфПовышенияТО Цикл	
		//О.Т. Аверсон 13.03.2017 № 401
		Массив = ШтатныеЕдиницы.НайтиСтроки(Новый Структура("КодСтроки", Результат.КодСтроки));
		Если Массив.Количество()>0 Тогда 
			НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Массив[0].ПодразделениеОрганизации);
			НаборЗаписейШтатного.Отбор.Должность.Установить(Массив[0].Должность);
			НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Массив[0].УсловияТрудаИзмерение);
			НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Массив[0].ВидДеятельностиИзмерение);
		КонецЕсли;
		НаборЗаписейШтатного.Отбор.Коэффициент.Установить(Результат.Коэффициент);
		//О.Т. Аверсон 13.03.2017 № 401
		НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		НаборЗаписейШтатного.Записать();
	КонецЦикла;
	
	НаборЗаписейШтатного = РегистрыСведений.ПовышенияПоИнструкцииПоШтатному.СоздатьНаборЗаписей();
	Для Каждого Результат из ПовышенияПоИнструкции Цикл
		//О.Т. Аверсон 13.03.2017 № 401
		Массив = ШтатныеЕдиницы.НайтиСтроки(Новый Структура("КодСтроки", Результат.КодСтроки));
		Если Массив.Количество()>0 Тогда 
			НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Массив[0].ПодразделениеОрганизации);
			НаборЗаписейШтатного.Отбор.Должность.Установить(Массив[0].Должность);
			НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Массив[0].УсловияТрудаИзмерение);
			НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Массив[0].ВидДеятельностиИзмерение);
		КонецЕсли;
		НаборЗаписейШтатного.Отбор.Коэффициент.Установить(Результат.Коэффициент);
		//О.Т. Аверсон 13.03.2017 № 401
		НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		НаборЗаписейШтатного.Записать();
	КонецЦикла;
	
	НаборЗаписейШтатного = РегистрыСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СоздатьНаборЗаписей();
	Для Каждого Результат из Надбавки Цикл
		//О.Т. Аверсон 13.03.2017 № 401
		Массив = ШтатныеЕдиницы.НайтиСтроки(Новый Структура("КодСтроки", Результат.КодСтроки));
		Если Массив.Количество()>0 Тогда 
			НаборЗаписейШтатного.Отбор.ПодразделениеОрганизации.Установить(Массив[0].ПодразделениеОрганизации);
			НаборЗаписейШтатного.Отбор.Должность.Установить(Массив[0].Должность);
			НаборЗаписейШтатного.Отбор.УсловияТрудаИзмерение.Установить(Массив[0].УсловияТрудаИзмерение);
			НаборЗаписейШтатного.Отбор.ВидДеятельностиИзмерение.Установить(Массив[0].ВидДеятельностиИзмерение);
		КонецЕсли;
		НаборЗаписейШтатного.Отбор.ВидНадбавки.Установить(Результат.ВидНадбавки);
		//О.Т. Аверсон 13.03.2017 № 401
		НаборЗаписейШтатного.Отбор.Период.Установить(НачалоДействия);
		НаборЗаписейШтатного.Записать();
	КонецЦикла;
	
	// 29.11.2010 Дмитрук Ольга
	НаборЗаписейРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписейРаботникиОрганизаций.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейРаботникиОрганизаций.Записать();
	
	НаборЗаписейКоэфПовышенияТО = РегистрыСведений.КоэфПовышенияТО.СоздатьНаборЗаписей();
	НаборЗаписейКоэфПовышенияТО.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейКоэфПовышенияТО.Записать();
	
	НаборЗаписейПовышенияПоИнструкции = РегистрыСведений.ПовышенияПоИнструкции.СоздатьНаборЗаписей();
	НаборЗаписейПовышенияПоИнструкции.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейПовышенияПоИнструкции.Записать();
	
	НаборЗаписейТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.СоздатьНаборЗаписей();
	НаборЗаписейТарифныеСтавкиРаботниковОрганизации.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейТарифныеСтавкиРаботниковОрганизации.Записать();
	
	НаборЗаписейПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписейПлановыеНачисленияРаботниковОрганизаций.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейПлановыеНачисленияРаботниковОрганизаций.Записать();

	// конец Дмитрук Ольга
 КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗакрыватьСтавку Тогда
		Для Каждого СтроаТЧ Из ШтатныеЕдиницы Цикл
			СтроаТЧ.ЗанимаемыхСтавок = 0;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
		
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


//#Если Клиент Тогда

//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	// Вставить содержимое обработчика.
//	
//	Если ИзменятьНачисления Тогда
//		Если Вопрос("Произвести перерасчет тарифных ставок ?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда
////			Отказ = Истина;
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
//		|ИЗ
//		|	РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
//		|ГДЕ
//		|	ШтатноеРасписаниеОрганизаций.Период = &Период
//		|	И ШтатноеРасписаниеОрганизаций.Документ <> &Документ";
//	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
//	Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
//	
//	Если Запрос.Выполнить().Выгрузить().Количество() <> 0 Тогда
//		Сообщить("Документ на данную дату уже существует !!!");
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;
//	
//	ТЗШтатное =	ШтатныеЕдиницы.Выгрузить();
//	ТЗШтатное.Колонки.Добавить("Период");
//	ТЗШтатное.ЗаполнитьЗначения(Дата, "Период");

//	Движения.ПлановоеШтатноеРасписаниеОрганизаций.Загрузить(ТЗШтатное);
//	
//	Движения.ПлановоеШтатноеРасписаниеОрганизаций.Записать();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Период,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Должность,
//		|	СУММА(ПлановоеШтатноеРасписаниеОрганизаций.КоличествоСтавок) КАК КоличествоСтавок,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка КАК Документ
//		|ИЗ
//		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
//		|ГДЕ
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Период = &Период
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Период,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Должность,
//		|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка";
//	Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
//	
//	ШтатноеРасписаниеОрганизаций = РегистрыСведений.ШтатноеРасписаниеОрганизаций.СоздатьНаборЗаписей();
//	ШтатноеРасписаниеОрганизаций.Отбор.Период.Установить(Дата);
//	ШтатноеРасписаниеОрганизаций.Загрузить(Запрос.Выполнить().Выгрузить());
//	ШтатноеРасписаниеОрганизаций.Записать();

//	Если ИзменятьНачисления Тогда
////отменяем кадровый документ если он был сформирован

//		мНомер = Формат(Дата, "ДФ=MM")+Формат(Дата, "ДФ=yy")+"ШР";
//		Если Документы.КадровоеПеремещениеОрганизаций.НайтиПоНомеру(мНомер, Дата).Пустая() Тогда
//			Док = Документы.КадровоеПеремещениеОрганизаций.СоздатьДокумент();
//			Док.Номер = мНомер;
//			Док.Дата = Дата;
//			Док.Организация = Организация;
//		Иначе
//			Док = Документы.КадровоеПеремещениеОрганизаций.НайтиПоНомеру(мНомер, Дата).ПолучитьОбъект();
//		КонецЕсли;
//		Док.РаботникиОрганизации.Очистить();
//		Док.ОсновныеНачисления.Очистить();
//		Док.КоэфПовышенияТО.Очистить();
//		Док.ПовышенияПоИнструкции.Очистить();
//		Если Док.Проведен Тогда
//			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
//		КонецЕсли;
//		
////формируем кадровый документ		
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ПлановоеШтатноеРасписаниеОрганизаций.Период,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.Должность,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.КоличествоСтавок,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.КоэффициентЕТС,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентПоКонтракту,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ТарифнаяСтавка,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавка,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавкаЧасовая,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.КоэффициентМР,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.КоэффТехнологический,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентКатегория,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ТарифнаяСтавкаЧасовая,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавкаСКонтрактом,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавкаЧасоваяСКонтрактом,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.Категория,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ТарифнаяСтавкаОрганизации,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ТарифнаяСтавкаЧасоваяОрганизации,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ВидРасчета,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентПоИнструкции,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентПоПостановлению,
//			|	ПлановоеШтатноеРасписаниеОрганизаций.РазрядЕТС,
//			|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
//			|ИЗ
//			|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодСреза, ) КАК РаботникиОрганизацийСрезПоследних
//			|		ПО ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
//			|			И ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.Владелец = РаботникиОрганизацийСрезПоследних.Организация
//			|ГДЕ
//			|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка = &Документ
//			|	И (НЕ ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник В
//			|				(ВЫБРАТЬ
//			|					ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
//			|				ИЗ
//			|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
//			|				ГДЕ
//			|					ПлановыеНачисленияРаботниковОрганизаций.Период = &Период
//			|					И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО))
//			|	И ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник <> &ПустойСотрудник";
//			
//		Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
//		Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
//		Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
//		Запрос.УстановитьПараметр("ПериодСреза", НачалоДня(Дата)-86400);
//		Выборка = Запрос.Выполнить().Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			Сообщить(Выборка.Сотрудник);
//			мСтрока = Док.РаботникиОрганизации.Добавить();
//			мСтрока.Сотрудник = Выборка.Сотрудник;
//			мСтрока.ФизЛицо = Выборка.Сотрудник.ФизЛицо;
//			мСтрока.ДатаНачала = Выборка.Период;
//			мСтрока.ПодразделениеОрганизации = Выборка.ПодразделениеОрганизации;
//			мСтрока.Должность = Выборка.Должность;
//			мСтрока.ЗанимаемыхСтавок = Выборка.КоличествоСтавок;
//			мСтрока.ВидРасчета = Выборка.ВидРасчета;
//			мСтрока.ГрафикРаботы = Выборка.ГрафикРаботы;
//			мСтрока.РазрядЕТС = Выборка.РазрядЕТС;
//			мСтрока.КоэффициентЕТС = Выборка.КоэффициентЕТС;
//			мСтрока.Категория = Выборка.Категория;
//			мСтрока.ПроцентПоКонтракту = Выборка.ПроцентПоКонтракту;
//			мСтрока.СпособРасчета = Выборка.ВидРасчета;
//	
//			ДатаАктуальности = Выборка.Период - 1;
//			Док.ДобавитьСтрокиКоэфПовышенияТО(Выборка.Сотрудник, ДатаАктуальности);
//			Док.ДобавитьСтрокиПовышенияПоИнструкции(Выборка.Сотрудник, ДатаАктуальности);
//		КонецЦикла;
//		Док.ПерерасчетДокумента();
//		Док.Записать();
//		Док.Записать(РежимЗаписиДокумента.Проведение);
//		
////		
////// Движения по регистру "ПлановыеНачисленияРаботниковОрганизаций"

////		Запрос = Новый Запрос;
////		Запрос.Текст = 
////			"ВЫБРАТЬ
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Период,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.Владелец КАК Организация,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ВидРасчета,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентПоКонтракту КАК Показатель2,
////			|	ВЫБОР
////			|		КОГДА ПлановоеШтатноеРасписаниеОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам)
////			|			ТОГДА ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавка
////			|		ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавкаЧасовая
////			|	КОНЕЦ КАК Показатель1,
////			|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить) КАК Действие
////			|ИЗ
////			|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
////			|ГДЕ
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка = &Документ
////			|	И (НЕ ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник В
////			|				(ВЫБРАТЬ
////			|					ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
////			|				ИЗ
////			|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
////			|				ГДЕ
////			|					ПлановыеНачисленияРаботниковОрганизаций.Период = &Период
////			|					И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО))";
////		Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
////		Запрос.УстановитьПараметр("Период", НачалоДня(Дата));

////		Движения.ПлановыеНачисленияРаботниковОрганизаций.Загрузить(Запрос.Выполнить().Выгрузить());
////		Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
////		
////// Движения по регистру "ТарифныеСтавкиработниковОрганизации"
////		Запрос = Новый Запрос;
////		Запрос.Текст = 
////			"ВЫБРАТЬ
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Период,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации.Владелец КАК Организация,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавкаСКонтрактом КАК Ставка,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.ТарифнаяСтавка,
////			|	ПлановоеШтатноеРасписаниеОрганизаций.РасчетнаяТарифнаяСтавка КАК ТарифнаяСПовышениемПоИнструкции
////			|ИЗ
////			|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
////			|ГДЕ
////			|	ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка = &Документ
////			|	И (НЕ ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник В
////			|				(ВЫБРАТЬ
////			|					ТарифныеСтавкиРаботниковОрганизации.Сотрудник
////			|				ИЗ
////			|					РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
////			|				ГДЕ
////			|					ТарифныеСтавкиРаботниковОрганизации.Период = &Период))";
////		Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
////		Запрос.УстановитьПараметр("Период", НачалоДня(Дата));

////		Движения.ТарифныеСтавкиРаботниковОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
////		Движения.ТарифныеСтавкиРаботниковОрганизации.Записать();



////!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ВАЖНО!!!!!!!!!!!!!!!!
////изменение тарифных ставок в документах после планового штатного расписания		

////Временно закоменнтировал для ускорения 01-01-2009
//		//
//		//Запрос = Новый Запрос;
//		//Запрос.Текст = 
//		//	"ВЫБРАТЬ
//		//	|	ПлановыеНачисленияРаботниковОрганизаций.Регистратор КАК Документ
//		//	|ИЗ
//		//	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
//		//	|ГДЕ
//		//	|	ПлановыеНачисленияРаботниковОрганизаций.Период >= &Период
//		//	|	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
//		//	|	И ПлановыеНачисленияРаботниковОрганизаций.Регистратор <> &Документ
//		//	|
//		//	|СГРУППИРОВАТЬ ПО
//		//	|	ПлановыеНачисленияРаботниковОрганизаций.Регистратор";
//		//	//|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В
//		//	//|			(ВЫБРАТЬ
//		//	//|				ПлановоеШтатноеРасписаниеОрганизаций.Сотрудник
//		//	//|			ИЗ
//		//	//|				РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
//		//	//|			ГДЕ
//		//	//|				ПлановоеШтатноеРасписаниеОрганизаций.Регистратор.Ссылка = &Документ)";
//		//Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
//		//Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
//		//
//		//мВыборка = Запрос.Выполнить().Выбрать();
//		//
//		//Пока мВыборка.Следующий() Цикл
//		//	Если мВыборка.Документ.Метаданные().Имя = "ПриемНаРаботуВОрганизацию" ИЛИ
//		//		мВыборка.Документ.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Тогда
//		//		Сообщить(мВыборка.Документ);
//		//		мДокумент = мВыборка.Документ.ПолучитьОбъект();
//		//		мДокумент.ПерерасчетДокумента();
//		//		мДокумент.Записать();
//		//	КонецЕсли;
//		//КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ОбработкаУдаленияПроведения(Отказ)
//	ШтатноеРасписаниеОрганизаций = РегистрыСведений.ШтатноеРасписаниеОрганизаций.СоздатьНаборЗаписей();
//	ШтатноеРасписаниеОрганизаций.Отбор.Период.Установить(Дата);
//	ШтатноеРасписаниеОрганизаций.Очистить();
//	ШтатноеРасписаниеОрганизаций.Записать();
//	Если ИзменятьНачисления Тогда
//		мНомер = Формат(Дата, "ДФ=MM")+Формат(Дата, "ДФ=yy")+"ШР";
//		Если НЕ Документы.КадровоеПеремещениеОрганизаций.НайтиПоНомеру(мНомер, Дата).Пустая() Тогда
//			Док =Документы.КадровоеПеремещениеОрганизаций.НайтиПоНомеру(мНомер, Дата).ПолучитьОбъект();
//			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

//#КонецЕсли