//Аверсон ЕАЕ 19.12.2025 СВФР-017631
//Перем ЭлементыНастройки    Экспорт; // Массив элементов структуры СКД         
//Перем СохраненнаяНастройка Экспорт; 
//Перем Расшифровки          Экспорт; 

//#Если Клиент Тогда
// 

//Процедура СохранитьНастройку() Экспорт
//	
//	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
//	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
//	
//КонецПроцедуры

//// Инициализация отчета
////
//// Параметры:
////  Нет.
////
//Процедура ИнициализацияОтчета() Экспорт
//	
//	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
//	
//КонецПроцедуры //ИнициализацияОтчета()


//// Заполнение параметров отчета по элементу справочника из переменной СохраненнаяНастройка.
////
//Процедура ПрименитьНастройку() Экспорт
//	
//	Если СохраненнаяНастройка.Пустая() Тогда
//		Возврат;
//	КонецЕсли;
//	 
//	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
//	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
//	
//КонецПроцедуры

//// Настройка отчета 
////
//Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
//	
//	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
//	
//КонецПроцедуры

//Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт

//	//О.Т. Аверсон 08.11.2018 № 2753
//	Если РольДоступна("ЗапретИзмененияОтбораПодразделения") Тогда 
//		СписокЭлементов = КомпоновщикНастроек.Настройки.Отбор.Элементы;
//		Для каждого Элемент из СписокЭлементов Цикл
//			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
//				//О.Т. Аверсон 12.04.2018 № 1824
//				Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации") Тогда
//					мПодразделениеОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
//					Если ЗначениеЗаполнено(мПодразделениеОрганизации) Тогда 
//						Элемент.ПравоеЗначение = мПодразделениеОрганизации;
//						Элемент.Использование = Истина;
//						Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;					
//					КонецЕсли;
//				КонецЕсли;
//				//О.Т. Аверсон 12.04.2018 № 1824
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	//О.Т. Аверсон 08.11.2018 № 2753
//	
//	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
//	
//КонецФункции

//// В процедуре можно доработать компоновщик перед выводом в отчет
//// Изменения сохранены не будут
//Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
//	
//	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
//	Если ЗначениеПараметра = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ЗначениеПараметра.Значение = '00010101' Тогда
//		ЗначениеПараметра.Значение = КонецДня(ТекущаяДата());
//		ЗначениеПараметра.Использование = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры



//// Запоминание элементов структуры отчета компоновщика настроек
////
//Процедура ЗапомнитьНастройку() Экспорт 
//	
//	Если КомпоновщикНастроек.Настройки.Структура.Количество() <> 0 тогда
//		Если ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ТаблицаКомпоновкиДанных") тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	ЭлементыНастройки[0] = КомпоновщикНастроек.Настройки.Структура[0].Колонки[1];
//	ЭлементыНастройки[1] = КомпоновщикНастроек.Настройки.Структура[0].Колонки[2];
//	ЭлементыНастройки[2] = КомпоновщикНастроек.Настройки.Структура[0].Колонки[3];
//	ЭлементыНастройки[3] = КомпоновщикНастроек.Настройки.Структура[0].Колонки[2].Структура[0];
//	
//	КомпоновщикНастроек.Настройки.Структура[0].Колонки.Удалить(ЭлементыНастройки[0]);
//	КомпоновщикНастроек.Настройки.Структура[0].Колонки.Удалить(ЭлементыНастройки[1]);
//	КомпоновщикНастроек.Настройки.Структура[0].Колонки.Удалить(ЭлементыНастройки[2]);
//	
//КонецПроцедуры

//// Добавление настройки структуры в колонки таблицы
////
//Процедура ВосстановитьНастройку() Экспорт  
//	
//	Если КомпоновщикНастроек.Настройки.Структура.Количество() <> 0 тогда
//		Если ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ТаблицаКомпоновкиДанных") тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	ЭлементГруппировки = КомпоновщикНастроек.Настройки.Структура[0].Колонки.Добавить();
//	ТиповыеОтчеты.СкопироватьНастройкиКомпоновкиДанных(ЭлементГруппировки, ЭлементыНастройки[0]);
//	
//	ЭлементГруппировки = КомпоновщикНастроек.Настройки.Структура[0].Колонки.Добавить();
//	ТиповыеОтчеты.СкопироватьНастройкиКомпоновкиДанных(ЭлементГруппировки, ЭлементыНастройки[1]);
//	
//	//ЭлементГруппировки = ЭлементГруппировки.Структура.Добавить();
//	//ТиповыеОтчеты.СкопироватьНастройкиКомпоновкиДанных(ЭлементГруппировки, ЭлементыНастройки[3]);
//	
//	ЭлементГруппировки = КомпоновщикНастроек.Настройки.Структура[0].Колонки.Добавить();
//	ТиповыеОтчеты.СкопироватьНастройкиКомпоновкиДанных(ЭлементГруппировки, ЭлементыНастройки[2]);
//	
//КонецПроцедуры

//Расшифровки = Новый СписокЗначений;

//ЭлементыНастройки = Новый Массив(4);

//#КонецЕсли

Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	//
	//Если ЗначениеПараметра.Значение = '00010101' Тогда
	//	ЗначениеПараметра.Значение = НачалоГода(ТекущаяДата());
	//	ЗначениеПараметра.Использование = Истина;
	//КонецЕсли;
	//
	//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	//
	//Если ЗначениеПараметра.Значение = '00010101' Тогда
	//	ЗначениеПараметра.Значение = КонецМесяца(ТекущаяДата());
	//	ЗначениеПараметра.Использование = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#Если Клиент Тогда
	
// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры

Расшифровки = Новый СписокЗначений;
//Расшифровки.Добавить("СтандартнаяРасшифровка", "СтандартнаяРасшифровка");

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
//Аверсон СВФР-017631