
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвиженияАвтомобилиСотрудников();
КонецПроцедуры

Процедура СформироватьДвиженияАвтомобилиСотрудников()
	ДвиженияАвтомобилиСотрудников = Движения.АвтомобилиСотрудников;
	ДвиженияАвтомобилиСотрудников.Записывать = Истина;
	
	Для Каждого Стр Из РаботникиОрганизации Цикл
		НоваяЗапись = ДвиженияАвтомобилиСотрудников.Добавить();
		НоваяЗапись.Период       = Стр.ДатаС;
		НоваяЗапись.Сотрудник    = Стр.Сотрудник;
		НоваяЗапись.Организация  = Организация;
		НоваяЗапись.Автомобиль   = Стр.Автомобиль;
		НоваяЗапись.Разряд       = Стр.Разряд;
		НоваяЗапись.Класс        = Стр.Класс;
	КонецЦикла;
КонецПроцедуры

