////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

//Налоговый режим организации
Перем мУСН;
Перем мЕНВД;
Перем мФСС_БЛ;
Перем мГоловнаяОрганизация;

//Дополнительные условия для запросов
Перем мДополнительноеУсловие;
Перем мДополнительноеУсловиеВнешнееОсновные;
Перем мДополнительноеУсловиеВнешнееДополнительные;
Перем мСписокПодразделений;
Перем СпПересчетаПрошлМес; 

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАСЧЕТА ЕСН

// получение первичных данных для расчета ЕСН
// первичные в данном случае, это те, для которых учет ЕСН <> РаспределятьПоБазовымНачислениям,
// или те которые определяют свой ЕСН-учет по базовым начисленияи и при этом базируются на прошлом периоде, 
// или те у которых категория начисления = "Первичное"
// 
// Параметры:
//	Основные	- булево, если Истина, то получаем данные по основным начислениям иначе - по доп.
//
// Возвращаемое значение:
//	Результат запроса
//
Функция ПолучитьДанныеУчета(СписокНачислений, ЭтоОсновныеНачисления, ЭтоПервичныеНачисления, ГоловнаяОрганизация, ЕстьПересчет = Ложь,ПериодПересчета = Неопределено) Экспорт
	
	
	Запрос = Новый Запрос;
	
	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	
	Разрезы = Новый Массив(4);
	Разрезы[0] = "ДоходФСЗН";
	Разрезы[1] = "ДоходСтрах";
	Разрезы[2] = "ДоходЕдиногоПлатежа";
	Разрезы[3] = "КодДоходаЕСН";
	
	Запрос.УстановитьПараметр("парамИзмерения",		Измерения);
	Запрос.УстановитьПараметр("парамРазрезыЕСН",	Разрезы);
	
	Запрос.УстановитьПараметр("парамСписокНачислений", СписокНачислений);
	Запрос.УстановитьПараметр("парамПериодРегистрации",			ПериодРегистрации);
	Запрос.УстановитьПараметр("парамПериодРегистрации2",			КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрацииНачало",	ДобавитьМесяц(ПериодРегистрации,-6));
	Запрос.УстановитьПараметр("парамОрганизация",				Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация",		ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамСписокПодразделений", мСписокПодразделений);
	Запрос.УстановитьПараметр("парамПодразделениеОрганизации", ПодразделениеОрганизации);
	
	Запрос.УстановитьПараметр("парамКатегорияПервичная", Справочники.КатегорииРасчетов.Первичное);
	Запрос.УстановитьПараметр("парамПустойСпособЕСНУ", Перечисления.ДоходыФСС_НС.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамСпособНеОблагаетсяКодДоходаЕСН", Перечисления.ДоходыФСС_НС.НеОблагается);
	Запрос.УстановитьПараметр("парамПустойКодЕСНУ", Справочники.ДоходыЕСН.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодЕСН", Справочники.ДоходыЕСН.ОблагаетсяПолностью);
	//Аверсон-софт, Островская Татьяна 17.04.2012 № ...
	Запрос.УстановитьПараметр("ОблагаетсяСтрах", Справочники.ДоходыЕСН.ОблагаетсяСтрах);
	//Аверсон-софт, Островская Татьяна 17.04.2012 № ...
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка()); //О.Т. Аверсон 17.04.2019 № 4247
	
	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
	
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15 незаполненное подразделение
	ДополнительноеУсловие = "";
	ДополнительноеУсловиеВнешнее = "";
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
	
	Если ПодразделениеОрганизации.Пустая() И Ответственный.Пустая() Тогда
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15 незаполненное подразделение
		//ДополнительноеУсловие = "";
		//ДополнительноеУсловиеВнешнее = "";
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
	ИначеЕсли ПодразделениеОрганизации.Пустая() Тогда
		Если глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].РасчетЗарплатыОрганизацииПоОтветственным Тогда
			ДополнительноеУсловие = " И ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
			Если ЭтоОсновныеНачисления Тогда
				ДополнительноеУсловиеВнешнее = " И ОсновныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
			Иначе
				ДополнительноеУсловиеВнешнее = " И ДополнительныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
			КонецЕсли;	
		КонецЕсли;
	Иначе
		ДополнительноеУсловие = " И ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
		Если ЭтоОсновныеНачисления Тогда
			ДополнительноеУсловиеВнешнее = " И ОсновныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
		Иначе
			ДополнительноеУсловиеВнешнее = " И ДополнительныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
		КонецЕсли;	
	КонецЕсли;
	
	НачатьТранзакцию();
	ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
	Если ЭтоОсновныеНачисления Тогда
		//толик добавил учловие в базу ЕСН... по периоду регистрации
		//Аверсон-софт, Островская Татьяна 17.04.2012 № ...
		//Аверсон-софт, Островская Татьяна 20.08.2012 № 15686
		
		если ПенсФондБудМес = 1 тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДанныеУчета.Регистратор КАК Регистратор,
			|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
			|	ДанныеУчета.Сотрудник,
			|	ДанныеУчета.ФизЛицо,
			//+ СВЭЙ КДЯ 05.03.20 СВФР-005611
			//|	ДанныеУчета.КодДоходаЕСН,
			//- СВЭЙ КДЯ 05.03.20 СВФР-005611
			//+ СВЭЙ КДЯ 05.03.20 СВФР-005611
			|	ВЫБОР 
			|        КОГДА
			
			//Аверсон 11.09.2020 КВВ СВФР-006444 (
			//|				ВЫБОР
			//|				КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			//|		  				И ( НЕ ДанныеУчета.Параметр97Размер = 2
			//|				 				ИЛИ НЕ ДанныеУчета.СпособРасчета В (
			//|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			//|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			//|				 				ИЛИ НАЧАЛОПЕРИОДА( ДанныеУчета.ПериодДействияНачало, МЕСЯЦ ) = &парамПериодРегистрации 
			//|										И ДанныеУчета.ПериодРегистрации <= &парамПериодРегистрации )
			//|				ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН			
			//|				ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			//|				КОНЕЦ 
			|ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|		  		И НЕ ( ДанныеУчета.Параметр97Размер = 2
			|				 	И ДанныеУчета.СпособРасчета В (
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 	И ДанныеУчета.ДляПараметраБез97_ЭтоОбложениеБудетВБудущемПериоде )
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН			
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ
			//Аверсон 11.09.2020 КВВ СВФР-006444 )
			
			|			= ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходФСЗН,
			|               И
			|				ВЫБОР
			|				КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|		  				И НЕ ( ДанныеУчета.Параметр97Размер = 2 
			|				 				И ДанныеУчета.СпособРасчета В (
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 				И ДанныеУчета.ДляПараметраБез97 )
			|				ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|				ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.Облагается ) // КАК ДоходСтрах,
			|        	ТОГДА  ЗНАЧЕНИЕ( Справочник.ДоходыЕСН.ОблагаетсяСтрах )
			|        КОГДА
			|				ВЫБОР
			|				КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|		  				И ( НЕ ДанныеУчета.Параметр97Размер = 2
			|				 				ИЛИ НЕ ДанныеУчета.СпособРасчета В (
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 				ИЛИ НАЧАЛОПЕРИОДА( ДанныеУчета.ПериодДействияНачало, МЕСЯЦ ) = &парамПериодРегистрации 
			|										И ДанныеУчета.ПериодРегистрации <= &парамПериодРегистрации )
			|				ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН			
			|				ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.Облагается ) // КАК ДоходФСЗН,
			|               И
			|				ВЫБОР
			|				КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|		  				И НЕ ( ДанныеУчета.Параметр97Размер = 2 
			|				 				И ДанныеУчета.СпособРасчета В (
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|									ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 				И ДанныеУчета.ДляПараметраБез97 )
			|				ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|				ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходСтрах,
			|        	ТОГДА  ЗНАЧЕНИЕ( Справочник.ДоходыЕСН.ОблагаетсяФСЗН )
			|        ИНАЧЕ
			|        	ДанныеУчета.КодДоходаЕСН	
			|   КОНЕЦ КАК КодДоходаЕСН,
			//- СВЭЙ КДЯ 05.03.20 СВФР-005611
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637 ЭтоОсновные
			////+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			//|		  И ( НЕ ДанныеУчета.Параметр97Размер = 2
			//|				 ИЛИ НЕ ДанныеУчета.СпособРасчета В (
			//|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			//|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			//|				 ИЛИ НАЧАЛОПЕРИОДА( ДанныеУчета.ПериодДействияНачало, МЕСЯЦ ) = &парамПериодРегистрации 
			//|						И ДанныеУчета.ПериодРегистрации <= &парамПериодРегистрации )
			////- СВЭЙ КДЯ 11.02.20 СВФР-005491
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637 ЭтоОсновные
			|		  		И НЕ ( ДанныеУчета.Параметр97Размер = 2
			|				 	И ДанныеУчета.СпособРасчета В (
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 	И ДанныеУчета.ДляПараметраБез97_ЭтоОбложениеБудетВБудущемПериоде )
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН			
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходФСЗН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|		  		И НЕ ( ДанныеУчета.Параметр97Размер = 2 
			|				 	И ДанныеУчета.СпособРасчета В (
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 	И ДанныеУчета.ДляПараметраБез97 ) // _ЭтоОбложениеБылоВПрошломПериоде
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходСтрах,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
			|	ДанныеУчета.СпособРасчета,
			|	ДанныеУчета.ВидРасчета,
			|	ДанныеУчета.Результат,
			|	ДанныеУчета.ПериодДействияНачало,
			|	ДанныеУчета.ПериодДействияКонец,
			|	ДанныеУчета.ГрафикРаботы,
			|	ДанныеУчета.Сторно,
			|	ДанныеУчета.ВидУчетаВремени,
			|	ДанныеУчета.НеИмеетПравоНаПенсию
			|ИЗ
			|	(ВЫБРАТЬ
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|	 	ISNULL( Параметр97.Размер, 0 ) КАК Параметр97Размер,
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|		ОсновныеНачисления.Регистратор КАК Регистратор,
			|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
			|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
			|		ВЫБОР
			|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|		            ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 ОсновныеНачисления.ВидРасчета.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			|				ТОГДА &ОблагаетсяСтрах
			|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
			|		КОНЕЦ КАК КодДоходаЕСН,
			|		ОсновныеНачисления.Организация КАК Организация,
			|	    ВЫБОР КОГДА ОсновныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|			И ОсновныеНачисления.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|		ТОГДА Выразить(ОсновныеНачисления.Результат/10000 КАК Число(15,"+ЗначениеОкругления+")) иначе ОсновныеНачисления.Результат Конец КАК Результат,
			|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
			|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
			//+ СВЭЙ КДЯ 12.02.20 СВФР-005491
			|		ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
			//- СВЭЙ КДЯ 12.02.20 СВФР-005491
			|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
			|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
			|		ОсновныеНачисления.Сторно КАК Сторно,
			|		ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
			|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию,
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637 ЭтоОсновные
			//|		ВЫБОР
			//|		КОГДА ОсновныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			//|				И ОсновныеНачисления.ПериодДействия = &парамПериодРегистрации
			//|			ТОГДА ИСТИНА
			//|		ИНАЧЕ ЛОЖЬ
			//|		КОНЕЦ КАК ДляПараметраБез97
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637 ЭтоОсновные
			|		( ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
			|		  И ОсновныеНачисления.ПериодДействия > &парамПериодРегистрации
			|		 ) КАК ДляПараметраБез97_ЭтоОбложениеБудетВБудущемПериоде,
			|		( ОсновныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			|		  И ОсновныеНачисления.ПериодДействия = &парамПериодРегистрации
			|		 ) КАК ДляПараметраБез97 // _ЭтоОбложениеБылоВПрошломПериоде
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
			|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|					ОсновныеНачисления.Организация КАК Организация,
			|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
			|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
			|				ИЗ
			|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
			|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
			|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
			|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
			|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|								ТОГДА ОсновныеНачисления.Организация
			|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
			|						КОНЕЦ = &парамОрганизация
			|					И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+"
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ОсновныеНачисления.Сотрудник,
			|					ОсновныеНачисления.Сотрудник.Физлицо,
			|					ОсновныеНачисления.Организация,
			|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
			|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
			|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
			|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
			|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
			|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
			|			ПО (ЕСНОсновныеНачисления.Регистратор <> &парамРегистратор)
			|				И (ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация)
			|				И (ЕСНОсновныеНачисления.Сотрудник = ОсновныеНачисления.Сотрудник)
			|				И (ЕСНОсновныеНачисления.Организация = ОсновныеНачисления.Организация)
			|				И (ЕСНОсновныеНачисления.ВидРасчета = ОсновныеНачисления.ВидРасчета)
			|				И (ЕСНОсновныеНачисления.ПериодДействияНачало = ОсновныеНачисления.ПериодДействияНачало)
			|				И (ЕСНОсновныеНачисления.ПериодДействияКонец = ОсновныеНачисления.ПериодДействияКонец)
			|				И (ЕСНОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамПериодРегистрации, ) КАК ГражданствоФизЛицСрезПоследних) КАК НеПравоНаПенсию
			|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
			|
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ.СрезПоследних( 
			|		&парамПериодРегистрации, 
			|		ВидПараметра = ЗНАЧЕНИЕ(Перечисление.ВидыПараметровДляРасчетаЗарплаты.ОбязательноеСтрахованиеБез97) ) КАК Параметр97
			|   ПО ИСТИНА
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|
			|	ГДЕ
			|		ЕСНОсновныеНачисления.Сотрудник ЕСТЬ NULL 
			
			//Аверсон 31.07.2020 КВВ СВФР-006325 (
			//|		И ОсновныеНачисления.Результат <> 0 
			|	И ВЫБОР 
			|		КОГДА НЕ ОсновныеНачисления.ВидРасчета В(&СписокОсновныхВР)
			|		ТОГДА ОсновныеНачисления.Результат <> 0
			|		ИНАЧЕ ИСТИНА КОНЕЦ
			//Аверсон 31.07.2020 КВВ СВФР-006325 )
			
			|		И ВЫБОР
			|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|					ТОГДА ОсновныеНачисления.Организация
			|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
			|			КОНЕЦ = &парамОрганизация
			|  		И ОсновныеНачисления.ПериодРегистрации <= &парамПериодРегистрации //Островская Татьяна 07.05.2014 № 17321
			|		И ВЫБОР 
			|			КОГДА ОсновныеНачисления.ПериодРегистрации МЕЖДУ &парамПериодРегистрации И &парамПериодРегистрации2 
			|				ТОГДА ОсновныеНачисления.ПериодДействияНачало <= &парамПериодРегистрации2 
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|	 			  		ИЛИ (ISNULL( Параметр97.Размер, 0 ) = 2 
			|							И ОсновныеНачисления.ПериодДействияНачало >= &парамПериодРегистрации
			
			//Аверсон ЕАЕ 15.12.2021 СВФР-008384
			|							И ОсновныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК <> ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийОплатыТрудаПоСт255НК.ПособияПоВременнойНетрудоспособности)
			
			//Аверсон ЕАЕ 18.01.2022 СВФР-008623
			|							И ОсновныеНачисления.ВидРасчета.ВидНачисленияПоСт255НК <> ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийОплатыТрудаПоСт255НК.ПособияРазовыеФСЗН)
			//Аверсон СВФР-008623
			
			|)
			//Аверсон СВФР-008384
			
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|				ИНАЧЕ ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &парамПериодРегистрации И &парамПериодРегистрации2
			|		 КОНЕЦ
			|"+ДополнительноеУсловиеВнешнее+") КАК ДанныеУчета  //Изменения (О.Т.)- и ОсновныеНачисления.ПериодРегистрации <= &парамПериодРегистрации И ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &парамПериодРегистрации И &парамПериодРегистрации2
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
		иначе  // т.е.   НЕ ПенсФондБудМес = 1  ( И ЭтоОсновныеНачисления ) 
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ДанныеУчета.Регистратор КАК Регистратор,
			|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
			|	ДанныеУчета.Сотрудник,
			|	ДанныеУчета.ФизЛицо,
			//+ СВЭЙ КДЯ 05.03.20 СВФР-005611
			//|	ДанныеУчета.КодДоходаЕСН,
			//- СВЭЙ КДЯ 05.03.20 СВФР-005611
			//+ СВЭЙ КДЯ 05.03.20 СВФР-005611
			|	ВЫБОР 
			|        КОГДА
			|				ВЫБОР
			|					КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|						ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|						ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходФСЗН,
			|           	И
			|				ВЫБОР
			|					КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|						ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|						ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.Облагается ) // КАК ДоходСтрах,
			|        	ТОГДА  ЗНАЧЕНИЕ( Справочник.ДоходыЕСН.ОблагаетсяСтрах )
			|        КОГДА
			|				ВЫБОР
			|					КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|						ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|						ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.Облагается ) // КАК ДоходФСЗН,
			|           	И
			|				ВЫБОР
			|					КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|						ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|						ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|				КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходСтрах,
			|        	ТОГДА  ЗНАЧЕНИЕ( Справочник.ДоходыЕСН.ОблагаетсяФСЗН )
			|        ИНАЧЕ
			|        	ДанныеУчета.КодДоходаЕСН	
			|   КОНЕЦ КАК КодДоходаЕСН,
			//- СВЭЙ КДЯ 05.03.20 СВФР-005611
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходФСЗН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходСтрах,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
			|	ДанныеУчета.СпособРасчета,
			|	ДанныеУчета.ВидРасчета,
			|	ДанныеУчета.Результат,
			|	ДанныеУчета.ПериодДействияНачало,
			|	ДанныеУчета.ПериодДействияКонец,
			|	ДанныеУчета.ГрафикРаботы,
			|	ДанныеУчета.Сторно,
			|	ДанныеУчета.ВидУчетаВремени,
			|	ДанныеУчета.НеИмеетПравоНаПенсию
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОсновныеНачисления.Регистратор КАК Регистратор,
			|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
			|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
			|		ВЫБОР
			|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах  ИНАЧЕ
			|						РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 ОсновныеНачисления.ВидРасчета.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			|				ТОГДА &ОблагаетсяСтрах
			|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
			|		КОНЕЦ КАК КодДоходаЕСН,
			|		ОсновныеНачисления.Организация КАК Организация,
			|	    ВЫБОР КОГДА ОсновныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|			И ОсновныеНачисления.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|		ТОГДА Выразить(ОсновныеНачисления.Результат/10000 КАК Число(15,"+ЗначениеОкругления+")) иначе ОсновныеНачисления.Результат Конец КАК Результат,
			|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
			|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
			|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
			|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
			|		ОсновныеНачисления.Сторно КАК Сторно,
			|		ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
			|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию,
			|		ВЫБОР
			|		КОГДА ОсновныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			|				И ОсновныеНачисления.ПериодДействия = &парамПериодРегистрации
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ КАК ДляПараметраБез97
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
			|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|					ОсновныеНачисления.Организация КАК Организация,
			|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
			|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
			|				ИЗ
			|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
			|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
			|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
			|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
			|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|								ТОГДА ОсновныеНачисления.Организация
			|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
			|						КОНЕЦ = &парамОрганизация
			|					И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+"
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ОсновныеНачисления.Сотрудник,
			|					ОсновныеНачисления.Сотрудник.Физлицо,
			|					ОсновныеНачисления.Организация,
			|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
			|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
			|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
			|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
			|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
			|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
			|			ПО (ЕСНОсновныеНачисления.Регистратор <> &парамРегистратор)
			|				И (ЕСНОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация)
			|				И (ЕСНОсновныеНачисления.Сотрудник = ОсновныеНачисления.Сотрудник)
			|				И (ЕСНОсновныеНачисления.Организация = ОсновныеНачисления.Организация)
			|				И (ЕСНОсновныеНачисления.ВидРасчета = ОсновныеНачисления.ВидРасчета)
			|				И (ЕСНОсновныеНачисления.ПериодДействияНачало = ОсновныеНачисления.ПериодДействияНачало)
			|				И (ЕСНОсновныеНачисления.ПериодДействияКонец = ОсновныеНачисления.ПериодДействияКонец)
			|				И (ЕСНОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамПериодРегистрации, ) КАК ГражданствоФизЛицСрезПоследних) КАК НеПравоНаПенсию
			|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
			|	ГДЕ
			|		ЕСНОсновныеНачисления.Сотрудник ЕСТЬ NULL 
			
			//Аверсон 31.07.2020 КВВ СВФР-006325 (
			//|		И ОсновныеНачисления.Результат <> 0 
			|	И ВЫБОР 
			|		КОГДА НЕ ОсновныеНачисления.ВидРасчета В(&СписокОсновныхВР)
			|		ТОГДА ОсновныеНачисления.Результат <> 0
			|		ИНАЧЕ ИСТИНА КОНЕЦ
			//Аверсон 31.07.2020 КВВ СВФР-006325 )
			
			|		И ВЫБОР
			|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|					ТОГДА ОсновныеНачисления.Организация
			|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
			|			КОНЕЦ = &парамОрганизация
			|  и ОсновныеНачисления.ПериодРегистрации <= &парамПериодРегистрации //Островская Татьяна 07.05.2014 № 17321
			|		//И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+") КАК ДанныеУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			//О.Т. 22.01.2015 № 17778
			если ЕстьПересчет Тогда 
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации","И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации и ОсновныеНачисления.ПериодДействия > &парамПериодРегистрации2");				
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ЕСНОсновныеНачисления.Регистратор <> &парамРегистратор","НЕ ЕСНОсновныеНачисления.Регистратор В (&парамРегистратор)");
			иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации","И ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации");	
			КонецЕсли;
			//О.Т. 22.01.2015 № 17778
			
		КонецЕсли;
		
		//Аверсон-софт, Островская Татьяна 17.04.2012 № ...
	Иначе // т.е. НЕ ЭтоОсновныеНачисления
		//Аверсон-софт, Островская Татьяна 17.04.2012 № ...
		//Аверсон-софт, Островская Татьяна 16.08.2012 № 15713
		если ПенсФондБудМес = 1 тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДанныеУчета.Регистратор КАК Регистратор,
			|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
			|	ДанныеУчета.Сотрудник,
			|	ДанныеУчета.ФизЛицо,
			|	ДанныеУчета.КодДоходаЕСН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637
			////+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			//|			И ( НЕ ISNULL( Параметр97.Размер, 0 ) = 2
			//|				 ИЛИ НЕ ДанныеУчета.СпособРасчета В (
			//|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			//|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			//|				 ИЛИ НАЧАЛОПЕРИОДА( ДанныеУчета.НачалоБазовогоПериода, МЕСЯЦ ) = &парамПериодРегистрации 
			//|						И ДанныеУчета.ПериодРегистрации <= &парамПериодРегистрации )
			////- СВЭЙ КДЯ 11.02.20 СВФР-005491
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637
			|			И НЕ ( ISNULL( Параметр97.Размер, 0 ) = 2
			|				 	И ДанныеУчета.СпособРасчета В (
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|						ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 	И ДанныеУчета.ДляПараметраБез97_ЭтоОбложениеБудетВБудущемПериоде )
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходФСЗН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|		  И НЕ ( ISNULL( Параметр97.Размер, 0 ) = 2 
			|				 И ДанныеУчета.СпособРасчета В (
			|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
			|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
			|				 И ДанныеУчета.ДляПараметраБез97 )  // _ЭтоОбложениеБылоВПрошломПериоде
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходСтрах,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
			|	ДанныеУчета.ВидРасчета,
			|	ДанныеУчета.СпособРасчета,
			|	ДанныеУчета.Результат,
			|	ДанныеУчета.НачалоБазовогоПериода КАК БазовыйПериодНачало,
			|	ДанныеУчета.КонецБазовогоПериода КАК БазовыйПериодКонец,
			|	ДанныеУчета.БазовыйНачало КАК БазовыйНачало,
			|	ДанныеУчета.БазовыйКонец КАК БазовыйКонец,
			|	ДанныеУчета.ПериодРегистрации,
			|	ДанныеУчета.НеИмеетПравоНаПенсию
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДополнительныеНачисления.Регистратор КАК Регистратор,
			|		ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
			|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
			|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
			|		КОНЕЦ КАК НачалоБазовогоПериода,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|				ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
			|		КОНЕЦ КАК КонецБазовогоПериода,
			|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
			|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
			|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
			|		ВЫБОР
			|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			|				ТОГДА &ОблагаетсяСтрах
			|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
			|		КОНЕЦ КАК КодДоходаЕСН,
			|		ДополнительныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
			|		ДополнительныеНачисления.Организация КАК Организация,
			|	    ВЫБОР КОГДА ДополнительныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|			И ДополнительныеНачисления.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|		ТОГДА Выразить(ДополнительныеНачисления.Результат/10000 КАК Число(15,"+ЗначениеОкругления+")) иначе ДополнительныеНачисления.Результат Конец КАК Результат,
			|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
			|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию,
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637
			//|		ВЫБОР
			//|			КОГДА ДополнительныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			////+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			////|				И НачалоПериода(ДополнительныеНачисления.БазовыйПериодНачало,Месяц) = &парамПериодРегистрации
			////- СВЭЙ КДЯ 11.02.20 СВФР-005491
			////+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			//|				И ВЫБОР
			//|					КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			//|						ТОГДА НАЧАЛОПЕРИОДА( ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ )
			//|					ИНАЧЕ НАЧАЛОПЕРИОДА( ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ )
			//|				КОНЕЦ = &парамПериодРегистрации
			////- СВЭЙ КДЯ 11.02.20 СВФР-005491
			//|				ТОГДА ИСТИНА
			//|			ИНАЧЕ ЛОЖЬ
			//|		КОНЕЦ КАК ДляПараметраБез97 // _ЭтоОбложениеБылоВПрошломПериоде
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			//+ СВЭЙ КДЯ 09.03.20 СВФР-005637
			|		( ДополнительныеНачисления.ПериодРегистрации = &парамПериодРегистрации
			|			И ВЫБОР
			|				КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|					ТОГДА ДополнительныеНачисления.ПериодРегистрации
			|					ИНАЧЕ НАЧАЛОПЕРИОДА( ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ )
			|			  КОНЕЦ > &парамПериодРегистрации
			|		 ) КАК ДляПараметраБез97_ЭтоОбложениеБудетВБудущемПериоде,
			|		( ДополнительныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			|			И ВЫБОР
			|				КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|					ТОГДА ДополнительныеНачисления.ПериодРегистрации
			|					ИНАЧЕ НАЧАЛОПЕРИОДА( ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ )
			|			КОНЕЦ = &парамПериодРегистрации
			|		 ) КАК ДляПараметраБез97 // _ЭтоОбложениеБылоВПрошломПериоде
			//- СВЭЙ КДЯ 09.03.20 СВФР-005637
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
			|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|					ДополнительныеНачисления.Организация КАК Организация,
			|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
			|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
			|				ИЗ
			|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
			|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
			|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
			|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
			|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|								ТОГДА ДополнительныеНачисления.Организация
			|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
			|						КОНЕЦ = &парамОрганизация
			|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+"
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ДополнительныеНачисления.Сотрудник,
			|					ДополнительныеНачисления.Сотрудник.Физлицо,
			|					ДополнительныеНачисления.Организация,
			|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
			|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
			|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
			|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
			|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
			|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
			|			ПО (ЕСНДополнительныеНачисления.Регистратор <> &парамРегистратор)
			|				И (ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация)
			//О.Т. Аверсон 17.04.2019 № 4247
			|				И ВЫБОР
			|				КОГДА ЕСНДополнительныеНачисления.Регистратор.ПодразделениеОрганизации = &ПустоеПодразделение
			|						ИЛИ ДополнительныеНачисления.ПодразделениеОрганизации = &ПустоеПодразделение
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ЕСНДополнительныеНачисления.Регистратор.ПодразделениеОрганизации = ДополнительныеНачисления.ПодразделениеОрганизации
			|				КОНЕЦ
			//О.Т. Аверсон 17.04.2019 № 4247
			|				И (ЕСНДополнительныеНачисления.ФизЛицо = ДополнительныеНачисления.ФизЛицо)
			|				И (ЕСНДополнительныеНачисления.Организация = ДополнительныеНачисления.Организация)
			|				И (ЕСНДополнительныеНачисления.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
			|				И (ЕСНДополнительныеНачисления.ПериодРегистрации = ДополнительныеНачисления.ПериодРегистрации)
			|				И (ЕСНДополнительныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамПериодРегистрации, ) КАК ГражданствоФизЛицСрезПоследних) КАК НеПравоНаПенсию
			|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
			|	ГДЕ
			|		ЕСНДополнительныеНачисления.ФизЛицо ЕСТЬ NULL 
			|		И ДополнительныеНачисления.Результат <> 0
			|		И ВЫБОР
			|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|					ТОГДА ДополнительныеНачисления.Организация
			|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
			|			КОНЕЦ = &парамОрганизация
			|		И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+"		
			|СГРУППИРОВАТЬ ПО
			|ДополнительныеНачисления.БазовыйПериодНачало,
			|ДополнительныеНачисления.БазовыйПериодКонец,
			|ДополнительныеНачисления.Регистратор,
			|ДополнительныеНачисления.Сотрудник,
			|ВЫБОР
			|	КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|		ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|	ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
			|КОНЕЦ,
			|ВЫБОР
			|	КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|		ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|	ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
			|КОНЕЦ,
			|ВЫБОР
			|	КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|		ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|			ВЫБОР
			//|				КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|					ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|				 РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
			//|			КОНЕЦ
			|	КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|		ТОГДА
			//О.Т. Аверсон 18.04.2018 № 1864 убрано условие
			//|			ВЫБОР
			//|				КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|					ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|				 ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
			//|			КОНЕЦ
			|	КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			|		ТОГДА &ОблагаетсяСтрах
			|	ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
			|КОНЕЦ,                                                           
			|ДополнительныеНачисления.ВидРасчета,
			|ДополнительныеНачисления.Организация,
			|ДополнительныеНачисления.ПериодРегистрации,
			|НеПравоНаПенсию.НеИмеетПравоНаПенсию,
			|ДополнительныеНачисления.НомерСтроки,
			|ДополнительныеНачисления.Сотрудник.Физлицо,
			|ДополнительныеНачисления.ВидРасчета.СпособРасчета,
			|ДополнительныеНачисления.Результат) КАК ДанныеУчета
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ.СрезПоследних( 
			|		&парамПериодРегистрации, 
			|		ВидПараметра = ЗНАЧЕНИЕ(Перечисление.ВидыПараметровДляРасчетаЗарплаты.ОбязательноеСтрахованиеБез97) ) КАК Параметр97
			|   ПО ИСТИНА
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
		иначе // т.е.   НЕ ПенсФондБудМес = 1  ( И НЕ ЭтоОсновныеНачисления )
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДанныеУчета.Регистратор КАК Регистратор,
			|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
			|	ДанныеУчета.Сотрудник,
			|	ДанныеУчета.ФизЛицо,
			|	ДанныеУчета.КодДоходаЕСН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходФСЗН,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходСтрах,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
			|	ДанныеУчета.ВидРасчета,
			|	ДанныеУчета.СпособРасчета,
			|	ДанныеУчета.Результат,
			|	ДанныеУчета.НачалоБазовогоПериода КАК БазовыйПериодНачало,
			|	ДанныеУчета.КонецБазовогоПериода КАК БазовыйПериодКонец,
			|	ДанныеУчета.БазовыйНачало КАК БазовыйНачало,
			|	ДанныеУчета.БазовыйКонец КАК БазовыйКонец,
			|	ДанныеУчета.ПериодРегистрации,
			|	ДанныеУчета.НеИмеетПравоНаПенсию
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДополнительныеНачисления.Регистратор КАК Регистратор,
			|		ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
			|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
			|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
			|		КОНЕЦ КАК НачалоБазовогоПериода,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|				ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
			|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
			|		КОНЕЦ КАК КонецБазовогоПериода,
			|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
			|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
			|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
			|		ВЫБОР
			|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
			|				ТОГДА
			//|					ВЫБОР
			//|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			//|							ТОГДА &ОблагаетсяСтрах ИНАЧЕ
			|						 ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
			//|					КОНЕЦ
			|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
			|				ТОГДА &ОблагаетсяСтрах
			|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
			|		КОНЕЦ КАК КодДоходаЕСН,
			|		ДополнительныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
			|		ДополнительныеНачисления.Организация КАК Организация,
			|	    ВЫБОР КОГДА ДополнительныеНачисления.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|			И ДополнительныеНачисления.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			|		ТОГДА Выразить(ДополнительныеНачисления.Результат/10000 КАК Число(15,"+ЗначениеОкругления+")) иначе ДополнительныеНачисления.Результат Конец КАК Результат,
			|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
			|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию,
			|		ВЫБОР
			|		КОГДА ДополнительныеНачисления.ПериодРегистрации < &парамПериодРегистрации
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			//|				И НачалоПериода(ДополнительныеНачисления.БазовыйПериодНачало,Месяц) = &парамПериодРегистрации
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			//+ СВЭЙ КДЯ 11.02.20 СВФР-005491
			|			И ВЫБОР
			|				КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
			|					ТОГДА НАЧАЛОПЕРИОДА( ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ )
			|					ИНАЧЕ НАЧАЛОПЕРИОДА( ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ )
			|			КОНЕЦ = &парамПериодРегистрации
			//- СВЭЙ КДЯ 11.02.20 СВФР-005491
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ КАК ДляПараметраБез97
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
			|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
			|					ДополнительныеНачисления.Организация КАК Организация,
			|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
			|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
			|				ИЗ
			|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
			|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
			|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
			|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
			|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
			|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
			|				ГДЕ
			|					ВЫБОР
			|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|								ТОГДА ДополнительныеНачисления.Организация
			|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
			|						КОНЕЦ = &парамОрганизация
			|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+"
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ДополнительныеНачисления.Сотрудник,
			|					ДополнительныеНачисления.Сотрудник.Физлицо,
			|					ДополнительныеНачисления.Организация,
			|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
			|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
			|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
			|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
			|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
			|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
			|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
			|			ПО (ЕСНДополнительныеНачисления.Регистратор <> &парамРегистратор)
			|				И (ЕСНДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация)
			//О.Т. Аверсон 17.04.2019 № 4247
			|				И ВЫБОР
			|				КОГДА ЕСНДополнительныеНачисления.Регистратор.ПодразделениеОрганизации = &ПустоеПодразделение
			|						ИЛИ ДополнительныеНачисления.ПодразделениеОрганизации = &ПустоеПодразделение
			|					ТОГДА ИСТИНА
			|				ИНАЧЕ ЕСНДополнительныеНачисления.Регистратор.ПодразделениеОрганизации = ДополнительныеНачисления.ПодразделениеОрганизации
			|				КОНЕЦ
			//О.Т. Аверсон 17.04.2019 № 4247
			|				И (ЕСНДополнительныеНачисления.ФизЛицо = ДополнительныеНачисления.ФизЛицо)
			|				И (ЕСНДополнительныеНачисления.Организация = ДополнительныеНачисления.Организация)
			|				И (ЕСНДополнительныеНачисления.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
			|				И (ЕСНДополнительныеНачисления.ПериодРегистрации = ДополнительныеНачисления.ПериодРегистрации)
			|				И (ЕСНДополнительныеНачисления.ПериодРегистрации = &парамПериодРегистрации)
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
			|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамПериодРегистрации, ) КАК ГражданствоФизЛицСрезПоследних) КАК НеПравоНаПенсию
			|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
			|	ГДЕ
			|		ЕСНДополнительныеНачисления.ФизЛицо ЕСТЬ NULL 
			|		И ДополнительныеНачисления.Результат <> 0
			|		И ВЫБОР
			|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
			|					ТОГДА ДополнительныеНачисления.Организация
			|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
			|			КОНЕЦ = &парамОрганизация
			|		//И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации"+ДополнительноеУсловиеВнешнее+") КАК ДанныеУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеУчета.Регистратор,
			|	ДанныеУчета.Сотрудник,
			|	ДанныеУчета.ФизЛицо,
			|	ДанныеУчета.КодДоходаЕСН,
			|	ДанныеУчета.ВидРасчета,
			|	ДанныеУчета.СпособРасчета,
			|	ДанныеУчета.НачалоБазовогоПериода,
			|	ДанныеУчета.КонецБазовогоПериода,
			|	ДанныеУчета.БазовыйНачало,
			|	ДанныеУчета.БазовыйКонец,
			|	ДанныеУчета.ПериодРегистрации,
			|	ДанныеУчета.НеИмеетПравоНаПенсию,
			|	ДанныеУчета.НомерСтроки,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
			|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
			|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
			|	КОНЕЦ,
			|	ДанныеУчета.Результат
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	НомерСтроки";
			//О.Т. 22.01.2015 № 17778
			если ЕстьПересчет Тогда 
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации","И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) > &парамПериодРегистрации2");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ЕСНДополнительныеНачисления.Регистратор <> &парамРегистратор","НЕ ЕСНДополнительныеНачисления.Регистратор В (&парамРегистратор)");
			иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации","И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации");
			КонецЕсли;
			//О.Т. 22.01.2015 № 17778
		КонецЕсли;
		
		
		//Аверсон-софт, Островская Татьяна 16.08.2012 № 15713
		//Аверсон-софт, Островская Татьяна 20.08.2012 № 15686
	КонецЕсли;
	если ЕстьПересчет Тогда
		
		ЗапросРегистратор = Новый Запрос;
		ЗапросРегистратор.Текст = 
		"ВЫБРАТЬ
		|	РасчетЕСН.Ссылка
		|ИЗ
		|	Документ.РасчетЕСН КАК РасчетЕСН
		|ГДЕ
		|	РасчетЕСН.Проведен
		|	И РасчетЕСН.ПериодРегистрации = &ПериодРегистрации";
		
		ЗапросРегистратор.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		
		РезультатРегистратор = ЗапросРегистратор.Выполнить().Выбрать();
		РегистраторСписок = Новый СписокЗначений;
		Пока РезультатРегистратор.Следующий() Цикл    
			
			РегистраторСписок.Добавить(РезультатРегистратор.Ссылка);
		КонецЦикла;
		Запрос.УстановитьПараметр("парамРегистратор",РегистраторСписок);
		
	КонецЕсли;
	
	//Аверсон 31.07.2020 КВВ СВФР-006325 (
	ВидРасчетаСписок = Новый СписокЗначений;
	ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	Запрос.УстановитьПараметр("СписокОсновныхВР",ВидРасчетаСписок);	
	//Аверсон 31.07.2020 КВВ СВФР-006325 )	
	
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗафиксироватьТранзакцию();
	
	Возврат РезультатЗапроса;
	
КонецФункции // ПолучитьДанныеУчета()

// создает строку движений ЕСНОсновныеНачисления или ЕСНДополнительныеНачисления
// вызывается из ОбработатьДанныеУчета
// Параметры:
//	ДанныеУчета - спозиционированная выборка по результату запроса
//	НаборЗаписей
//
Функция СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, УчетнаяПолитикаПоПерсоналуОрганизации)
	
	СтрокаДанных = НаборЗаписей.Добавить();
	
	// регистратор
	
	// вид расчета
	СтрокаДанных.ВидРасчета					= ДанныеУчета.ВидРасчета;
	// период регистрации
	СтрокаДанных.ПериодРегистрации			= ПериодРегистрации;
	
	// только для ЕСНОсновныеНачисления
	Если ТипЗнч(НаборЗаписей) = Тип("РегистрРасчетаНаборЗаписей.ЕСНОсновныеНачисления") Тогда
		СтрокаДанных.ПериодДействияНачало	= ДанныеУчета.ПериодДействияНачало;
		СтрокаДанных.ПериодДействияКонец	= ДанныеУчета.ПериодДействияКонец;
		СтрокаДанных.ГрафикРаботы			= ДанныеУчета.ГрафикРаботы;
		СтрокаДанных.ВидУчетаВремени		= ДанныеУчета.ВидУчетаВремени;
	иначе
		СтрокаДанных.БазовыйПериодНачало = ДанныеУчета.БазовыйПериодНачало;
		СтрокаДанных.БазовыйПериодКонец = ДанныеУчета.БазовыйПериодКонец;
		//толик
		СтрокаДанных.БазовыйНачало = ДанныеУчета.БазовыйНачало;
		СтрокаДанных.БазовыйКонец = ДанныеУчета.БазовыйКонец;
	КонецЕсли;
	
	// измерения
	СтрокаДанных.Сотрудник					= ДанныеУчета.Сотрудник;
	СтрокаДанных.Физлицо					= ДанныеУчета.Физлицо;
	СтрокаДанных.Организация				= мГоловнаяОрганизация;
	
	// ресурсы
	СтрокаДанных.Результат					= ДанныеУчета.Результат;
	
	// реквизиты
	СтрокаДанных.КодДоходаЕСН				= ДанныеУчета.КодДоходаЕСН;
	СтрокаДанных.ДоходФСЗН 					= ДанныеУчета.ДоходФСЗН;
	СтрокаДанных.ДоходСтрах 				= ДанныеУчета.ДоходСтрах;
	СтрокаДанных.ДоходЕдиныйПлатеж 			= ДанныеУчета.ДоходЕдиныйПлатеж;
	СтрокаДанных.ОбособленноеПодразделение	= Организация;
	
	Возврат СтрокаДанных;
	
КонецФункции // СоздатьСтрокуДвижений()

// Функция формирует набор записей по данным из запроса
// и в том случае, если проводится обработка первичных данных
// возвращает список категорий непервичных начислений для 
// которых необходимо выполнить формирование данных ЕСН
//
// Параметры:
//	РезультатДанныеУчета		- выборка по резултату запроса, возвращенная функцией 
//								  ПолучитьПервичныеДанныеУчета или ПолучитьВторичныеДанныеУчета
//	ОбработкаПервичныхДанных	- проводится ли обработка первичных данных (или вторичных)
//	Успешно						- в этот параметр возвращается значение Ложь, если обработка не выполнена
//								  (например, если не окзалось базовых данных)
//	НаборЗаписей
//
// Возвращаемое значение:
//	массив категорий начислений, которые необходимо рассчитать на основе вторичных данных
//
Функция ОбработатьДанныеУчета(РезультатДанныеУчета, Успешно, НаборЗаписей,СпПересчетаПрошлМес,ТЗБазаПоСотруднику,СуммаЗаписанная = 0) 
	
	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
	
	// основная выборка - по ней ведем обход и вводим записи движений
	ДанныеУчета = РезультатДанныеУчета.Выбрать();
	ДанныеУчетаТЗ = РезультатДанныеУчета.Выгрузить();	
	Пока ДанныеУчета.Следующий() Цикл
		ОбработкаПрерыванияПользователя(); //О.Т. Аверсон 09.11.2017 № 1219
		СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей, УчетнаяПолитикаПоПерсоналуОрганизации);			
		
		
		если ТипЗнч(ДанныеУчета.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")Тогда
			МесяцРасчета = ДанныеУчета.ПериодДействияНачало;
		иначе
			МесяцРасчета = ДанныеУчета.БазовыйПериодНачало;
		КонецЕсли;
		ПроверкаСтроки = СпПересчетаПрошлМес.НайтиСтроки(Новый Структура("Сотрудник,ФизЛицо,Месяц",ДанныеУчета.Сотрудник,ДанныеУчета.Сотрудник.ФизЛицо,НачалоМесяца(МесяцРасчета)));	
		если ПроверкаСтроки.Количество() = 0 Тогда 
			//О.Т. Аверсон 26.03.2016 № 950
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			Если ДанныеУчета.Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = ДанныеУчета.Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			//О.Т. Аверсон 26.03.2016 № 950
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 26.03.2016 № 950
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(МесяцРасчета) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			если МесяцРасчета < ПериодРегистрации Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				
				//Аверсон ЕАЕ 13.10.2025 СВФР-017022
				//|	СУММА(ВЫБОР
				//|			КОГДА ЕСНСведенияОДоходах.ВидРасчета.ОтчисленияНаППС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
				//|				ТОГДА ЕСНСведенияОДоходах.Результат
				//|			ИНАЧЕ 0
				//|		КОНЕЦ) КАК БазаПрошл
				|	СУММА(ВЫБОР
				|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН.ВходитВБазуФСЗН
				|				ТОГДА ЕСНСведенияОДоходах.Результат
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК БазаПрошл
				//Аверсон СВФР-017022
				
				|ИЗ
				|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
				|ГДЕ
				|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
				|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
				|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
				|	И ЕСНСведенияОДоходах.Организация = &Организация";
				//|	//И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций";
				
				Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(МесяцРасчета));
				Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(МесяцРасчета));
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеУчета.Сотрудник.ФизЛицо);
				Запрос.УстановитьПараметр("Регистратор", Ссылка);
				если ТипЗнч(ДанныеУчета.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")Тогда
					Запрос.Текст = СтрЗаменить(запрос.Текст,"//И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций",
					"И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций");
				иначе
					Запрос.Текст = СтрЗаменить(запрос.Текст,"//И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций",
					"И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций");
				КонецЕсли;
				
				РезультатБаза = Запрос.Выполнить().Выбрать();
				пока РезультатБаза.Следующий() Цикл
					БазаПрошл = РезультатБаза.БазаПрошл;
					//СтрокаБазаПоСотруднику = ТЗБазаПоСотруднику.Добавить();
					//СтрокаБазаПоСотруднику.Сотрудник = ДанныеУчета.Сотрудник;
					//СтрокаБазаПоСотруднику.База = БазаПрошл;
					//СтрокаБазаПоСотруднику.Месяц = МесяцРасчета;
					//ТЗБазаПоСотруднику.Свернуть("Сотрудник,Месяц","База");
				КонецЦикла;
				если ТипЗнч(ДанныеУчета.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")Тогда
					МассивСумм = ДанныеУчетаТЗ.НайтиСтроки(Новый Структура("Сотрудник,ПериодДействияНачало,ДоходФСЗН",ДанныеУчета.Сотрудник,МесяцРасчета,Перечисления.ДоходыФСС_НС.Облагается ) );
				иначе
					МассивСумм = ДанныеУчетаТЗ.НайтиСтроки(Новый Структура("Сотрудник,БазовыйПериодНачало,ДоходФСЗН",ДанныеУчета.Сотрудник,МесяцРасчета,Перечисления.ДоходыФСС_НС.Облагается ) );
				КонецЕсли;
				ОбщаяСумма = 0;
				для Каждого стрМассивСумм  из МассивСумм Цикл 
					ОбщаяСумма = ОбщаяСумма + стрМассивСумм.Результат;
				КонецЦикла;
				если БазаПрошл = null тогда
					БазаПрошл = 0;
				конецесли;
				БазаИзТЗ = 0;
				МассивБазаИзТЗ = ТЗБазаПоСотруднику.НайтиСтроки(Новый Структура("Сотрудник,Месяц",ДанныеУчета.Сотрудник,МесяцРасчета));
				если МассивБазаИзТЗ.Количество()>0 Тогда 
					БазаИзТЗ = МассивБазаИзТЗ[0].База;
				КонецЕсли;
				
				если БазаПрошл + ОбщаяСумма > БазаОграниченияФСЗН и не БазаПрошл > БазаОграниченияФСЗН Тогда // или ДанныеУчета.Результат < 0
					
					//СтрокаПересчета = СпПересчетаПрошлМес.Добавить();
					//СтрокаПересчета.Сотрудник = ДанныеУчета.Сотрудник;
					//СтрокаПересчета.ФизЛицо = ДанныеУчета.Сотрудник.ФизЛицо;
					//СтрокаПересчета.Месяц = НачалоМесяца(МесяцРасчета);
					//СтрокаПересчета.Превышение = 0;
					//СтрокаПересчета.Отриц = 0;
					//если ДанныеУчета.Результат < 0 и ДанныеУчета.ВидРасчета.ОтчисленияНаППС = Перечисления.ДоходыФСС_НС.Облагается Тогда 
					//	СтрокаПересчета.Отриц = 1;
					//	если БазаПрошл > БазаОграниченияФСЗН Тогда 
					//		СтрокаПересчета.Превышение = 1;
					//		СтрокаПересчета.СуммаДляПревыш = ДанныеУчета.Результат;
					//	КонецЕсли;     						
					//иначе
					//	СтрокаПересчета.Месяц = ?(ЗначениеЗаполнено(СтрокаПересчета.Месяц),СтрокаПересчета.Месяц,Дата(1,1,1));
					//КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		иначе
			если ПроверкаСтроки[0].Отриц > 0 и ПроверкаСтроки[0].Превышение > 0 Тогда
				//если СуммаЗаписанная = 0 Тогда 
				СуммаМаксимальная = 0;
				ЗапросНеОбл = Новый Запрос;
				ЗапросНеОбл.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ВЫБОР
				|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.НеОблагается)
				|				ТОГДА ЕСНСведенияОДоходах.Результат
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК ДоходФСЗН
				|ИЗ
				|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
				|ГДЕ
				|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
				|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
				|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
				|	И ЕСНСведенияОДоходах.Организация = &Организация";
				
				ЗапросНеОбл.УстановитьПараметр("Организация", Организация);
				ЗапросНеОбл.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(МесяцРасчета));
				ЗапросНеОбл.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(МесяцРасчета));
				ЗапросНеОбл.УстановитьПараметр("Регистратор", Ссылка);
				ЗапросНеОбл.УстановитьПараметр("ФизЛицо", ДанныеУчета.ФизЛицо);
				РузультНеОбл = ЗапросНеОбл.Выполнить().Выгрузить(); 
				если РузультНеОбл.Количество()>0 Тогда
					СуммаМаксимальная = РузультНеОбл[0].ДоходФСЗН;
				КонецЕсли;
				//КонецЕсли;
				СуммаМаксимальная = Мин(-ПроверкаСтроки[0].СуммаДляПревыш,СуммаМаксимальная);
				СтрокаДанных.Результат = ?(СтрокаДанных.Результат+СуммаЗаписанная<=СуммаМаксимальная,СтрокаДанных.Результат,
				СуммаМаксимальная-СуммаЗаписанная);
				СуммаМаксимальная = СуммаМаксимальная - СтрокаДанных.Результат;
				СуммаЗаписанная = СуммаЗаписанная+СтрокаДанных.Результат; 
			КонецЕсли;
			
		КонецЕсли;
		
		//Аверсон ЕАЕ 20.03.2024 СВФР-012613
		Если НачалоМесяца(МесяцРасчета) < ПериодРегистрации Тогда   //прошлый месяц только
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
			СтавкаПенс = СтруктураПенс.Размер;
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(МесяцРасчета) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам * РазмерСреднейЗарплаты;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			//Аверсон ЕАЕ 13.10.2025 СВФР-017022
			//|			КОГДА ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН.ВходитВБазуФСЗН = Истина
			|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН.ВходитВБазуФСЗН = Истина
			//Аверсон ЕАЕ 13.10.2025 СВФР-017022
			|				ТОГДА ЕСНСведенияОДоходах.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК БазаПрошл
			|ИЗ
			|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			|ГДЕ
			|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
			|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
			|	И ЕСНСведенияОДоходах.Организация = &Организация";
			
			Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(МесяцРасчета));
			Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(МесяцРасчета));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеУчета.Сотрудник.ФизЛицо);
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			если ТипЗнч(ДанныеУчета.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")Тогда
				Запрос.Текст = СтрЗаменить(запрос.Текст,"//И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций",
				"И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций");
			иначе
				Запрос.Текст = СтрЗаменить(запрос.Текст,"//И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций",
				"И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций");
			КонецЕсли;
			
			РезультатБаза = Запрос.Выполнить().Выбрать();
			пока РезультатБаза.Следующий() Цикл
				БазаПрошл = РезультатБаза.БазаПрошл;
			КонецЦикла;
			если ТипЗнч(ДанныеУчета.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций")Тогда
				МассивСумм = ДанныеУчетаТЗ.НайтиСтроки(Новый Структура("Сотрудник,ПериодДействияНачало",ДанныеУчета.Сотрудник,МесяцРасчета) );
			иначе
				МассивСумм = ДанныеУчетаТЗ.НайтиСтроки(Новый Структура("Сотрудник,БазовыйПериодНачало",ДанныеУчета.Сотрудник,МесяцРасчета) );
			КонецЕсли;
			ОбщаяСумма = 0;
			для Каждого стрМассивСумм  из МассивСумм Цикл 
				Если стрМассивСумм.ВидРасчета.КодДоходаЕСН.ВходитВБазуФСЗН = Ложь Тогда
					Продолжить;
				КонецЕсли;
				ОбщаяСумма = ОбщаяСумма + стрМассивСумм.Результат;
			КонецЦикла;
			если БазаПрошл = null тогда
				БазаПрошл = 0;
			конецесли;
		
			Если БазаПрошл + ОбщаяСумма >= БазаОграниченияФСЗН Тогда
				СтрокаДанных.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;	
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-012613
		
	КонецЦикла;
	
	// при записи не затираем уже введенные движения
	НаборЗаписей.Записать(Ложь);// выполняем дозапись (набор записей чистится автоматически)
	
	Возврат 1;
	
КонецФункции  //ОбработатьДанныеУчета

// Функция формирует таблицу начислений и последовательность их обработки
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьТаблицуНачислений() Экспорт 
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	""Основные"" КАК ВидНачисления,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисления.ВидРасчета.КатегорияНачисления = ЗНАЧЕНИЕ(Справочник.КатегорииРасчетов.Первичное)
	|				ИЛИ ОсновныеНачисления.ВидРасчета.СтратегияОтраженияВУчете <> ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
	|			ТОГДА 0
	|		ИНАЧЕ ОсновныеНачисления.ВидРасчета.КатегорияНачисления.Код
	|	КОНЕЦ КАК ПорядокРасчета,
	|	ОсновныеНачисления.ВидРасчета
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|	ГДЕ
	|		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15 ++
	////+ СВЭЙ КДЯ 05.03.20 СВФР-005611
	//|		ИЛИ НАЧАЛОПЕРИОДА( ОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ ) = &парамПериодРегистрации
	////- СВЭЙ КДЯ 05.03.20 СВФР-005611
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
	|" + мДополнительноеУсловиеВнешнееОсновные + "
	|		И ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация) КАК ОсновныеНачисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Дополнительные"",
	|	ВЫБОР
	|		КОГДА ДополнительныеНачисления.ВидРасчета.КатегорияНачисления = ЗНАЧЕНИЕ(Справочник.КатегорииРасчетов.Первичное)
	|				ИЛИ ДополнительныеНачисления.ВидРасчета.СтратегияОтраженияВУчете <> ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
	|			ТОГДА 0
	|		ИНАЧЕ ДополнительныеНачисления.ВидРасчета.КатегорияНачисления.Код
	|	КОНЕЦ,
	|	ДополнительныеНачисления.ВидРасчета
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|" + мДополнительноеУсловиеВнешнееДополнительные + "
	|		И ДополнительныеНачисления.ОбособленноеПодразделение = &парамОрганизация) КАК ДополнительныеНачисления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРасчета";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамОрганизация", Организация); 
	Запрос.УстановитьПараметр("парамСписокПодразделений", мСписокПодразделений); 
	
	ТаблицаНачислений = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаНачислений;
	
КонецФункции // ПолучитьТаблицуНачислений()

// Выполняет автоматическое заполнение наборов записей о доходах ЕСН
// Параметры: 
//  НаборЗаписейОсновной, НаборЗаписейДополнительный
//
// Возвращаемое значение:
//  Истина, если автозаполнение полностью выполнено 
//	Ложь, если некоторые строки движений остались недозаполненными
//
Функция АвтозаполнениеНаборовЗаписейОДоходах(НаборЗаписейОсновной, НаборЗаписейДополнительный,СпПересчетаПрошлМес = Неопределено)
	
	Успешно = Истина;
	
	// сформируем список всех структурных подразделений организации
	мГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	// определим налоговый режим
	БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету"), КонецМесяца(ПериодРегистрации), Организация);
	УчетнаяПолитика = глЗначениеПеременной("глУчетнаяПолитикаПоНалоговомуУчету")[КонецМесяца(ПериодРегистрации)][Организация];
	мУСН = УчетнаяПолитика.УСН;
	мЕНВД = УчетнаяПолитика.ОрганизацияЯвляетсяПлательщикомЕНВД;
	мФСС_БЛ = УчетнаяПолитика.УплачиватьДобровольныеВзносыВФСС;
	
	// определим дополнительные условия для запросов
	Если Не ЗначениеЗаполнено(Ответственный) и Не ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		// нет условий по подразделению	
	ИначеЕсли Не ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		//применяем условие на подразделение по ответственному
		Если ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "РасчетЗарплатыОрганизацииПоОтветственным") Тогда
			//расчет зарплаты по ответственным включен, получим список подразделений
			СписокПодразделенийТекст = 
			"ВЫБРАТЬ 
			|	ПодразделенияОрганизаций.Ссылка
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|ГДЕ
			|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Расчетчики.ПодразделениеОрганизации
			|			ИЗ
			|				РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации, ) КАК Расчетчики
			|			ГДЕ
			|				Расчетчики.Пользователь = &парамОтветственный)
			|	И ПодразделенияОрганизаций.Владелец = &парамОрганизация";
			
		КонецЕсли;
		
	Иначе // отбор по подразделению заданному в форме документа	
		
		СписокПодразделенийТекст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&парамПодразделениеОрганизации)
		|	И ПодразделенияОрганизаций.Владелец = &парамОрганизация";
		
	КонецЕсли;
	
	
	Если ПустаяСтрока(СписокПодразделенийТекст) Тогда
		мДополнительноеУсловие = "";
		мДополнительноеУсловиеВнешнееОсновные = "";
		мДополнительноеУсловиеВнешнееДополнительные = "";
		мСписокПодразделений = Новый СписокЗначений;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("парамОрганизация",				Организация);
		Запрос.УстановитьПараметр("парамПодразделениеОрганизации",	ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("парамПериодРегистрации",			ПериодРегистрации);
		Запрос.УстановитьПараметр("парамОтветственный",				Ответственный);
		Запрос.Текст = СписокПодразделенийТекст;
		мСписокПодразделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		мДополнительноеУсловие = " И ПодразделениеОрганизации В (&парамСписокПодразделений)";
		мДополнительноеУсловиеВнешнееОсновные = " И ОсновныеНачисления.ПодразделениеОрганизации В (&парамСписокПодразделений)";
		мДополнительноеУсловиеВнешнееДополнительные = " И ДополнительныеНачисления.ПодразделениеОрганизации В (&парамСписокПодразделений)";
		
	КонецЕсли;	
	
	ТаблицаНачислений = ПолучитьТаблицуНачислений();
	
	СтруктураПоиска = Новый Структура;
	СписокНачисленийДляОтбора = Новый СписокЗначений;
	
	СтруктураПоиска.Вставить("ВидНачисления", "Основные");
	СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из СтрокиТаблицы Цикл
		СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
	КонецЦикла; 
	СпПересчетаПрошлМес = Новый ТаблицаЗначений;
	СпПересчетаПрошлМес.Колонки.Добавить("Сотрудник");
	СпПересчетаПрошлМес.Колонки.Добавить("ФизЛицо");
	СпПересчетаПрошлМес.Колонки.Добавить("Месяц");
	СпПересчетаПрошлМес.Колонки.Добавить("Отриц");
	СпПересчетаПрошлМес.Колонки.Добавить("Превышение");
	СпПересчетаПрошлМес.Колонки.Добавить("СуммаДляПревыш");
	
	ТЗБазаПоСотруднику = Новый ТаблицаЗначений;
	ТЗБазаПоСотруднику.Колонки.Добавить("Сотрудник");
	ТЗБазаПоСотруднику.Колонки.Добавить("База");
	ТЗБазаПоСотруднику.Колонки.Добавить("Месяц");
	Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
		//получим и обработаем данные учета
		ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Истина, Истина, мГоловнаяОрганизация);
		ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейОсновной,СпПересчетаПрошлМес,ТЗБазаПоСотруднику);
	КонецЕсли;             
	
	//дополнительные начисления
	СписокНачисленийДляОтбора.Очистить();
	СтруктураПоиска.Вставить("ВидНачисления", "Дополнительные");
	
	СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из СтрокиТаблицы Цикл
		СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
	КонецЦикла;
	
	Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
		//получим и обработаем данные учета
		ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Ложь, Истина, мГоловнаяОрганизация);
		ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейДополнительный,СпПересчетаПрошлМес,ТЗБазаПоСотруднику);
	КонецЕсли;
	если Организация.ИНН = "800009185" Тогда 
		СпПересчетаПрошлМес.Свернуть("Сотрудник,ФизЛицо,Месяц,","Отриц,Превышение,СуммаДляПревыш");
		//Для Каждого стрПересчетПрошлМес из СпПересчетаПрошлМес Цикл 
		//	Запрос = Новый Запрос;
		//	если стрПересчетПрошлМес.Превышение > 0 Тогда 
		//		
		//		Запрос.Текст =
		//		"ВЫБРАТЬ
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП) КАК КодДоходаЕСН,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается) КАК ДоходФСЗН,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.НеОблагается) КАК ДоходСтрах,
		//		|	ЕСНСведенияОДоходах.ВидРасчета,
		//		|	СУММА(ЕСНСведенияОДоходах.Результат) КАК Результат,
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияНачало,
		//		|	КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияКонец,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается) КАК доходЕдиныйПлатеж,
		//		|	ВложенныйЗапрос.ГрафикРаботы,
		//		|	ВложенныйЗапрос.ВидУчетаВремени,
		//		|	РасчетЕСНДополнительныеНачисления.БазовыйНачало,
		//		|	РасчетЕСНДополнительныеНачисления.БазовыйКонец,
		//		|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, ЕСТЬNULL(РасчетЕСНДополнительныеНачисления.Сотрудник, &Сотрудник)) КАК Сотрудник
		//		|ИЗ
		//		|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		//		|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени КАК ВидУчетаВремени
		//		|		ИЗ
		//		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//		|		ГДЕ
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//		|			И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
		//		|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//		|		
		//		|		СГРУППИРОВАТЬ ПО
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ГрафикРаботы,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени) КАК ВложенныйЗапрос
		//		|		ПО ЕСНСведенияОДоходах.Организация = ВложенныйЗапрос.Организация
		//		|			И ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		//		|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ВложенныйЗапрос.ПериодРегистрации)
		//		|			И ЕСНСведенияОДоходах.ВидРасчета = ВложенныйЗапрос.ВидРасчета
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
		//		|		ПО ЕСНСведенияОДоходах.Регистратор = РасчетЕСНДополнительныеНачисления.Ссылка
		//		|			И ЕСНСведенияОДоходах.ВидРасчета = РасчетЕСНДополнительныеНачисления.ВидРасчета
		//		|			И ЕСНСведенияОДоходах.ФизЛицо = РасчетЕСНДополнительныеНачисления.ФизЛицо
		//		|			И ЕСНСведенияОДоходах.ПериодВзаиморасчетов = РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало
		//		|ГДЕ
		//		|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//		|	И ЕСНСведенияОДоходах.Организация = &Организация
		//		|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН В(&КодДоходаЕСН)
		//		|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//		|	И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		//		|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//		|	И ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.НеОблагается)
		//		|
		//		|СГРУППИРОВАТЬ ПО
		//		|	ЕСНСведенияОДоходах.ВидРасчета,
		//		|	ЕСНСведенияОДоходах.КодДоходаЕСН,
		//		|	КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	ВложенныйЗапрос.ГрафикРаботы,
		//		|	ВложенныйЗапрос.ВидУчетаВремени,
		//		|	РасчетЕСНДополнительныеНачисления.БазовыйНачало,
		//		|	РасчетЕСНДополнительныеНачисления.БазовыйКонец,
		//		|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, ЕСТЬNULL(РасчетЕСНДополнительныеНачисления.Сотрудник, &Сотрудник))";
		
		//	иначе
		//		
		//		Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	ЕСНСведенияОДоходах.КодДоходаЕСН,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается) КАК ДоходФСЗН,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается) КАК ДоходСтрах,
		//		|	ЕСНСведенияОДоходах.ВидРасчета,
		//		|	СУММА(ЕСНСведенияОДоходах.Результат) КАК Результат,
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияНачало,
		//		|	КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияКонец,
		//		|	ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается) КАК доходЕдиныйПлатеж,
		//		|	ВложенныйЗапрос.ГрафикРаботы,
		//		|	ВложенныйЗапрос.ВидУчетаВремени,
		//		|	ВложенныйЗапрос1.БазовыйНачало,
		//		|	ВложенныйЗапрос1.БазовыйКонец,
		//		|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, ЕСТЬNULL(ВложенныйЗапрос1.Сотрудник, &Сотрудник)) КАК Сотрудник
		//		|ИЗ
		//		|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		//		|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени КАК ВидУчетаВремени
		//		|		ИЗ
		//		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//		|		ГДЕ
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//		|			И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
		//		|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//		|		
		//		|		СГРУППИРОВАТЬ ПО
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ГрафикРаботы,
		//		|			ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени) КАК ВложенныйЗапрос
		//		|		ПО ЕСНСведенияОДоходах.Организация = ВложенныйЗапрос.Организация
		//		|			И ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		//		|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ВложенныйЗапрос.ПериодРегистрации)
		//		|			И ЕСНСведенияОДоходах.ВидРасчета = ВложенныйЗапрос.ВидРасчета
		//		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//		|			РасчетЕСНДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		//		|			РасчетЕСНДополнительныеНачисления.ФизЛицо КАК ФизЛицо,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		//		|			РасчетЕСНДополнительныеНачисления.Ссылка КАК Ссылка,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйНачало КАК БазовыйНачало,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйКонец КАК БазовыйКонец,
		//		|			РасчетЕСНДополнительныеНачисления.Сотрудник КАК Сотрудник
		//		|		ИЗ
		//		|			Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
		//		|		
		//		|		СГРУППИРОВАТЬ ПО
		//		|			РасчетЕСНДополнительныеНачисления.ВидРасчета,
		//		|			РасчетЕСНДополнительныеНачисления.ФизЛицо,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало,
		//		|			РасчетЕСНДополнительныеНачисления.Ссылка,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйНачало,
		//		|			РасчетЕСНДополнительныеНачисления.БазовыйКонец,
		//		|			РасчетЕСНДополнительныеНачисления.Сотрудник) КАК ВложенныйЗапрос1
		//		|		ПО ЕСНСведенияОДоходах.Регистратор = ВложенныйЗапрос1.Ссылка
		//		|			И ЕСНСведенияОДоходах.ВидРасчета = ВложенныйЗапрос1.ВидРасчета
		//		|			И ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос1.ФизЛицо
		//		|			И ЕСНСведенияОДоходах.ПериодВзаиморасчетов = ВложенныйЗапрос1.БазовыйПериодНачало
		//		|ГДЕ
		//		|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//		|	И ЕСНСведенияОДоходах.Организация = &Организация
		//		|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН В(&КодДоходаЕСН)
		//		|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//		|	И ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		//		|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//		|
		//		|СГРУППИРОВАТЬ ПО
		//		|	ВложенныйЗапрос1.БазовыйНачало,
		//		|	ВложенныйЗапрос1.БазовыйКонец,
		//		|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, ЕСТЬNULL(ВложенныйЗапрос1.Сотрудник, &Сотрудник)),
		//		|	ЕСНСведенияОДоходах.КодДоходаЕСН,
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	ЕСНСведенияОДоходах.ВидРасчета,
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//		|	КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//		|	ВложенныйЗапрос.ГрафикРаботы,
		//		|	ВложенныйЗапрос.ВидУчетаВремени";
		//	КонецЕсли;
		//	КодДоходаЕСН = Новый СписокЗначений;
		//	КодДоходаЕСН.Добавить(Справочники.ДоходыЕСН.ОблагаетсяПолностью);
		//	КодДоходаЕСН.Добавить(Справочники.ДоходыЕСН.ОблагаетсяФСЗН);
		//	КодДоходаЕСН.Добавить(Справочники.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ);
		//	КодДоходаЕСН.Добавить(Справочники.ДоходыЕСН.ОблагаетсяФСЗНиЕП);
		//	Запрос.УстановитьПараметр("КодДоходаЕСН", КодДоходаЕСН);
		//	Запрос.УстановитьПараметр("Организация", Организация);
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(стрПересчетПрошлМес.Месяц));
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(стрПересчетПрошлМес.Месяц));
		//	Запрос.УстановитьПараметр("ФизЛицо", стрПересчетПрошлМес.ФизЛицо);
		//	Запрос.УстановитьПараметр("Сотрудник", стрПересчетПрошлМес.Сотрудник);
		//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
		
		//	РезультатПересчет = Запрос.Выполнить();
		//	СуммаЗаписанная = 0;
		//	ОбработатьДанныеУчета(РезультатПересчет, Успешно, НаборЗаписейОсновной,СпПересчетаПрошлМес,ТЗБазаПоСотруднику,СуммаЗаписанная);
		//	
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПланВидовРасчета.ОсновныеНачисленияОрганизаций","ПланВидовРасчета.ДополнительныеНачисленияОрганизаций");
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияНачало","НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК БазовыйПериодНачало");
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодДействияКонец","КОНЕЦПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК БазовыйПериодКонец");
		//	РезультатПересчет = Запрос.Выполнить();
		//	ОбработатьДанныеУчета(РезультатПересчет, Успешно, НаборЗаписейДополнительный,СпПересчетаПрошлМес,ТЗБазаПоСотруднику,СуммаЗаписанная);
		//	
		//КонецЦикла;
	КонецЕсли;
	
	Успешно = Истина;
	
	//Для Счетчик = 0 По 3 Цикл
	//	
	//	СписокНачисленийДляОтбора.Очистить();
	
	//	СтруктураПоиска.Вставить("ПорядокРасчета", Счетчик);
	//	
	//	//основные начисления
	//	СтруктураПоиска.Вставить("ВидНачисления", "Основные");
	//	СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
	//	Для каждого Строка Из СтрокиТаблицы Цикл
	//		СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
	//	КонецЦикла;
	//	Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
	//		//получим и обработаем данные учета
	//		ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Истина, ?(Счетчик = 0, Истина, Ложь), мГоловнаяОрганизация);
	//		ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейОсновной);
	//	КонецЕсли;             
	//		
	//	//дополнительные начисления
	//	СписокНачисленийДляОтбора.Очистить();
	//	СтруктураПоиска.Вставить("ВидНачисления", "Дополнительные");
	//	СтрокиТаблицы = ТаблицаНачислений.НайтиСтроки(СтруктураПоиска);
	//	Для каждого Строка Из СтрокиТаблицы Цикл
	//		СписокНачисленийДляОтбора.Добавить(Строка.ВидРасчета);
	//	КонецЦикла;
	//	Если СписокНачисленийДляОтбора.Количество() > 0 Тогда
	//		//получим и обработаем данные учета
	//		ДанныеУчета = ПолучитьДанныеУчета(СписокНачисленийДляОтбора, Ложь, ?(Счетчик = 0, Истина, Ложь), мГоловнаяОрганизация);
	//		ОбработатьДанныеУчета(ДанныеУчета, Успешно, НаборЗаписейДополнительный);
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	
	Возврат Не Успешно;
	
КонецФункции

// Предназначена для получения выборки из запроса с данными расчета ЕСН
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода ЕСН
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//  нет
// Возвращаемое значение:
//  Выборка результата запроса
//
Функция ПолучитьДанныеРасчетаЕСН(ГоловнаяОрганизация,Пересчет = Ложь,ПересчетДляМинусов = Ложь)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	//Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	Запрос.УстановитьПараметр( "Организация", Организация );
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	Запрос.УстановитьПараметр("парамПодлежитОбложению", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамВидСтавокЕСНиПФР", ГоловнаяОрганизация.ВидСтавокЕСНиПФР);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГруппа1", "I");
	Запрос.УстановитьПараметр("парамГруппа2", "II");
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамМуж", Перечисления.ПолФизическихЛиц.Мужской);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр( "ПодразделениеОрганизации", ПодразделениеОрганизации );
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
	Запрос.УстановитьПараметр( "ВсеПодразделения", НЕ ЗначениеЗаполнено( ПодразделениеОрганизации ) );
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
	
	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
	
	ЛьготаИнвалидов = "100000";
	
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//СписокВсехПодразделенийОрганизации = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	//СписокВсехПодразделенийОрганизации.Добавить(ГоловнаяОрганизация);
	//Запрос.УстановитьПараметр("СписокВсехПодразделенийОрганизации", СписокВсехПодразделенийОрганизации);
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	// ---------------------------------------------------------------------------
	// тексты запросов
	//
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцеы с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
		ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	
	// ФизлицаДляРасчета
	//
	ФизлицаДляРасчетаТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
	|ГДЕ
	|	ЕСНСведенияОДоходах.Период = &парамПериодРегистрации
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//|	И ЕСНСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение";
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	|	И ЕСНСведенияОДоходах.Организация = &Организация";
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	
	// ДанныеОПравеНаПенсию
	// Таблица Таблица Данные о праве на пенсию: - таблица это список иностранцев и периодов
	// Поля:
	//		Физлицо, 
	//		Месяц - месяц налогового периода
	// 
	// Описание:
	//	Выбираем Из Списка периодов
	//	Внутреннее соединение с ГражданствоФизЛиц.СрезПоследних
	//  по равенству периодов
	//  условие: что физлицо - не имеет права на пенсию
	//
	ДанныеОПравеНаПенсиюТекст = "
	|ВЫБРАТЬ
	|	Месяц(Периоды.Период) КАК Месяц,
	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекст+") КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛиц.Период = Периоды.ПериодРегистра И ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо И ГражданствоФизЛиц.НеИмеетПравоНаПенсию
	|";
	
	
	ИсчисленныйЕСНТекст = 
	"ВЫБРАТЬ
	|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL ТОГДА 35 ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН КОНЕЦ КАК ПроцентФСЗН,
	|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
	|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ПенсионныйФонд / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
	|	ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд
	|   КОНЕЦ КАК ПенсионныйФонд,
	|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ФСЗН / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
	|	ИНАЧЕ ЕСНИсчисленный.ФСЗН КОНЕЦ КАК ФСЗН,
	|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ЕдиныйПлатеж / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
	|	ИНАЧЕ ЕСНИсчисленный.ЕдиныйПлатеж КОНЕЦ КАК ЕдиныйПлатеж,
	|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ОбязательноеСтрахование / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
	|	ИНАЧЕ ЕСНИсчисленный.ОбязательноеСтрахование КОНЕЦ КАК ОбязательноеСтрахование
	|ИЗ
	|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
	|		ПО ЕСНИсчисленный.ФизЛицо = Физлица.ФизЛицо
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 1
	|	   		И НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = Физлица.Месяц
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 1
	|
	|ГДЕ
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 1
	//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация И
	//|	ЕСНИсчисленный.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации И
	//|	ЕСНИсчисленный.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации  И //Островская Татьяна 28.04.2014 № 17321
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 1
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	|	ЕСНИсчисленный.Организация = &Организация
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	|	И ЕСНИсчисленный.Период <= &парамКонецМесяцаПериодаРегистрации"; //О.Т. 14.07.2014 № 120 (Период больше чем период документа не должен попадать в сумму отчисления)
	
	если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
		ИсчисленныйЕСНТекст = ИсчисленныйЕСНТекст + "
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		//|	И ЕСНИсчисленный.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		|	И ( 
		|		&ВсеПодразделения 
		|		ИЛИ 
		|		ЕСНИсчисленный.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации) 
		|	  ) 
		|	И ( ЕСНИсчисленный.Регистратор = &Регистратор ИЛИ ЕСНИсчисленный.Регистратор.Проведен ) // чтобы не учитывать движения непроведенных документов, а таковые случаются (например, при завершении отладки, когда по регистрам есть промежуточные движения ( по кнопке : заполнить и рассчитать ) 
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		|";
	КонецЕсли;
	//О.Т. 13.02.2015 № 17778
	если ПересчетДляМинусов Тогда 
		ИсчисленныйЕСНТекст = 
		"ВЫБРАТЬ
		|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL ТОГДА 35 ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН КОНЕЦ КАК ПроцентФСЗН,
		|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ПенсионныйФонд / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
		|	ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд
		|   КОНЕЦ КАК ПенсионныйФонд,
		|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
		|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		|ИЗ
		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСНИсчисленный.ФизЛицо = Физлица.ФизЛицо
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		|	   		И НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = Физлица.Месяц
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		|
		|ГДЕ
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
		//|	И ЕСНИсчисленный.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		|	ЕСНИсчисленный.Организация = &Организация
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		|	И ЕСНИсчисленный.Период <= &парамКонецМесяцаПериодаРегистрации
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 1
		|	И ЕСНИсчисленный.ПериодВзаиморасчетов > &парамКонецМесяцаПериодаРегистрации
		|	И ЕСНИсчисленный.Регистратор <> &Регистратор
		|	И ЕСНИсчисленный.Регистратор ссылка Документ.РасчетЕСН";
		
		если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ИсчисленныйЕСНТекст = ИсчисленныйЕСНТекст + "
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			//|	И ЕСНИсчисленный.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			|	И ( 
			|		&ВсеПодразделения 
			|		ИЛИ 
			|		ЕСНИсчисленный.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации) 
			|	  ) 
			|	И ( ЕСНИсчисленный.Регистратор = &Регистратор ИЛИ ЕСНИсчисленный.Регистратор.Проведен ) // чтобы не учитывать движения непроведенных документов, а таковые случаются (например, при завершении отладки, когда по регистрам есть промежуточные движения ( по кнопке : заполнить и рассчитать ) 
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			|";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Регистратор",Ссылка);
	КонецЕсли;
	
	//О.Т. 13.02.2015 № 17778
	
	
	
	// ДоходыПоФизлицамМесяцамКодамТекст
	// Таблица ЕСН-доходы по ФЛ и Периодам:
	// Поля:
	// Описание:
	// Выбираем из ЕСНОсновныеНачисления ,ЕСНДополнительныеНачисления и ЕСНСведенияОДоходах и суммируем результат
	// с начала года по текущий период
	
	ДоходыПоФизлицамМесяцамКодамТекст = 
	"ВЫБРАТЬ
	|	ЕСННачисления.ФизЛицо КАК ФизЛицо,
	|	ЕСННачисления.Месяц,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	ЕСННачисления.Период,
	|	ЕСННачисления.Регистратор,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	ЕСННачисления.ДоходФСЗН,
	|	ЕСННачисления.ДоходСтрах,
	|	ЕСННачисления.ДоходЕдиныйПлатеж,
	|	ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСНСведенияОДоходах.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	|		ЕСНСведенияОДоходах.Регистратор,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
	|		ЕСНСведенияОДоходах.ДоходФСЗН,
	|		ЕСНСведенияОДоходах.ДоходСтрах,
	|		ЕСНСведенияОДоходах.ДоходЕдиныйПлатеж,
	|		ВЫБОР
	|	    КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|			И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
	|		ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
	|	    ИНАЧЕ ЕСНСведенияОДоходах.Результат
	|       КОНЕЦ КАК ОблагаемыйДоход
	|	ИЗ
	|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
	|	
	|	ГДЕ
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656  1 +
	//|		ЕСНСведенияОДоходах.Период >= &парамНачалоМесяцаПериодаРегистрации И
	//|		ЕСНСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации И
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656  1
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656  1 +
	|		ЕСНСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации И
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656  1
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
	//|		ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации) ";
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
	|		ЕСНСведенияОДоходах.Организация = &Организация ";
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
	если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
		ДоходыПоФизлицамМесяцамКодамТекст = ДоходыПоФизлицамМесяцамКодамТекст + "
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		//|		И ЕСНСведенияОДоходах.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		|		И ( 
		|			&ВсеПодразделения 
		|			ИЛИ 
		|			ЕСНСведенияОДоходах.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации) 
		|	  	  ) 
		|		И ( ЕСНСведенияОДоходах.Регистратор = &Регистратор ИЛИ ЕСНСведенияОДоходах.Регистратор.Проведен ) // чтобы не учитывать движения непроведенных документов, а таковые случаются (например, при завершении отладки, когда по регистрам есть промежуточные движения ( по кнопке : заполнить и рассчитать ) 
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		////+ СВЭЙ КДЯ 11.11.19 СВФР-005037
		//|		И ЕСНСведенияОДоходах.Регистратор = &Регистратор
		////- СВЭЙ КДЯ 11.11.19 СВФР-005037
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
		|";
	КонецЕсли;
	ДоходыПоФизлицамМесяцамКодамТекст = ДоходыПоФизлицамМесяцамКодамТекст + "
	|		) КАК ЕСННачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
	|		ПО ЕСННачисления.ФизЛицо = Физлица.ФизЛицо
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 2
	|   		И ЕСННачисления.Месяц = Физлица.Месяц
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 2
	|";
	если Пересчет Тогда
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
		//ДоходыПоФизлицамМесяцамКодамТекст = СтрЗаменить(ДоходыПоФизлицамМесяцамКодамТекст,"ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации)",
		//"ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации) и не (ЕСНСведенияОДоходах.Регистратор в (&парамРегистратор))");
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
		ДоходыПоФизлицамМесяцамКодамТекст = СтрЗаменить(ДоходыПоФизлицамМесяцамКодамТекст,"ЕСНСведенияОДоходах.Организация = &Организация",
		"ЕСНСведенияОДоходах.Организация = &Организация И НЕ ЕСНСведенияОДоходах.Регистратор В (&парамРегистратор) ");
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
		ЗапросРегистратор = Новый Запрос;
		ЗапросРегистратор.Текст = 
		"ВЫБРАТЬ
		|	РасчетЕСН.Ссылка
		|ИЗ
		|	Документ.РасчетЕСН КАК РасчетЕСН
		|ГДЕ
		|	РасчетЕСН.Проведен
		|	И РасчетЕСН.ПериодРегистрации = &ПериодРегистрации
		|	И РасчетЕСН.Ссылка <> &Ссылка";
		
		ЗапросРегистратор.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		ЗапросРегистратор.УстановитьПараметр("Ссылка", Ссылка);
		РезультатРегистратор = ЗапросРегистратор.Выполнить().Выбрать();
		РегистраторСписок = Новый СписокЗначений;
		Пока РезультатРегистратор.Следующий() Цикл    
			
			РегистраторСписок.Добавить(РезультатРегистратор.Ссылка);
		КонецЦикла;
		Запрос.УстановитьПараметр("парамРегистратор",РегистраторСписок);
		
	КонецЕсли;
	если ПересчетДляМинусов Тогда 
		ДоходыПоФизлицамМесяцамКодамТекст = 
		"ВЫБРАТЬ
		|	ЕСННачисления.ФизЛицо КАК ФизЛицо,
		|	ЕСННачисления.Месяц,
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		|	ЕСННачисления.Период,
		|	ЕСННачисления.Регистратор,
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		|	ЕСННачисления.ДоходФСЗН,
		|	ЕСННачисления.ДоходСтрах,
		|	ЕСННачисления.ДоходЕдиныйПлатеж,
		|	ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
		|		ЕСНСведенияОДоходах.Регистратор,
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		|		ЕСНСведенияОДоходах.ДоходФСЗН,
		|		ЕСНСведенияОДоходах.ДоходСтрах,
		|		ЕСНСведенияОДоходах.ДоходЕдиныйПлатеж,
		|		ВЫБОР
		|	    КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|			И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &парамПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|		ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		|	    ИНАЧЕ ЕСНСведенияОДоходах.Результат
		|       КОНЕЦ КАК ОблагаемыйДоход
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	
		|	ГДЕ
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656  1 +
		//|		ЕСНСведенияОДоходах.Период >= &парамНачалоМесяцаПериодаРегистрации И
		//|		ЕСНСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации И
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656  1
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656  1 +
		|		ЕСНСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации И
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656  1
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
		//|		ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации)
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 обособ. подразделения
		|		ЕСНСведенияОДоходах.Организация = &Организация
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
		|		И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		|		И ЕСНСведенияОДоходах.ПериодВзаиморасчетов > &парамКонецМесяцаПериодаРегистрации
		|		И ЕСНСведенияОДоходах.Регистратор ссылка Документ.РасчетЕСН" + 
		//+ Ништ 14.01.2026 свфр-017472: был ломаный запрос
		") КАК ЕСННачисления";
		//- Ништ 14.01.2026 свфр-017472
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ИсчисленныйЕСНТекст = ИсчисленныйЕСНТекст + "
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			//|	И ЕСНСведенияОДоходах.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			|	И ( 
			|		&ВсеПодразделения 
			|		ИЛИ 
			|		ЕСНСведенияОДоходах.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации) 
			|	  ) 
			|	И ( ЕСНСведенияОДоходах.Регистратор = &Регистратор ИЛИ ЕСНСведенияОДоходах.Регистратор.Проведен ) // чтобы не учитывать движения непроведенных документов, а таковые случаются (например, при завершении отладки, когда по регистрам есть промежуточные движения ( по кнопке : заполнить и рассчитать ) 
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12 *** отбор Подразделение
			|";
		КонецЕсли;
		ИсчисленныйЕСНТекст = 
		//+ Ништ 14.01.2026 свфр-017472: был ломаный запрос
		"ВЫБРАТЬ
		|	ЕСННачисления.ФизЛицо КАК ФизЛицо,
		|	ЕСННачисления.ПроцентФСЗН,
		|	ЕСННачисления.Месяц,
		|	ЕСННачисления.ПенсионныйФонд,
		|	ЕСННачисления.ФСЗН,
		|	ЕСННачисления.ЕдиныйПлатеж,
		|	ЕСННачисления.ОбязательноеСтрахование
		|ИЗ
		|	(" 
		//- Ништ 14.01.2026 свфр-017472
		+ ИсчисленныйЕСНТекст + "
		|	) КАК ЕСННачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСННачисления.ФизЛицо = Физлица.ФизЛицо
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 2
		|   		И ЕСННачисления.Месяц = Физлица.Месяц
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 2
		|";
		Запрос.УстановитьПараметр("Регистратор",Ссылка);
		
	КонецЕсли;
	
	
	
	
	
	Запрос.Текст = ДоходыПоФизлицамМесяцамКодамТекст;
	// ДанныеОбИнвалидности
	// Таблица Данных об Инвалидности: - таблица это список инвалидов и периодов инвалидности
	// поля:
	//		Физлицо, 
	//		Месяц - месяц налогового периода
	// Описание:	
	//	Выбираем Из Список периодов (таблица - список периодов с начала года по текущий период
	//	Внутреннее соединение с СведенияОбИнвалидностиФизлиц.СрезПоследних
	//	по равенству периодов
	//  условие: что физлицо - Инвалид
	// 
	ДанныеОбИнвалидностиТекст = "
	|ВЫБРАТЬ
	//	|	Месяц(Периоды.Период) КАК Месяц,
	|	ВЫБОР КОГДА (СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = &парамГруппа1 ИЛИ СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = &парамГруппа2) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК Группа,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ИЗ
	|	(ВЫБРАТЬ
	//	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекст+") КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо) КАК Периоды//,
	//	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра И СведенияОбИнвалидностиФизлиц.Физлицо = Периоды.Физлицо И СведенияОбИнвалидностиФизлиц.Инвалидность
	|";
	Запрос.Текст = ДанныеОбИнвалидностиТекст;
	
	
	// ОблагаемаяБазаПоМесяцам
	// Таблица Баз для исчисления ЕСН по месяцам налогового периода:
	// Поля:
	//		ФизЛицо
	//		Месяц - месяц налогового периода
	//		БазаФедеральныйБюджет         - база для налогообложения ЕСН в части налога в федеральный бюджет
	//		ЛьготаИнвалидуФБ   			  - сумма льготы инвалиду по ЕСН в части налога в федеральный бюджет
	//		БазаФСС                       - база для налогообложения ЕСН в части налога в ФСС
	//		ЛьготаИнвалидуФСС  			  - сумма льготы инвалиду по ЕСН в части налога в ФСС
	//		БазаФОМС					  - база для налогообложения ЕСН в части налогов в ФОМС
	//		ЛьготаИнвалидуФОМС 			  - сумма льготы инвалиду по ЕСН в части налога в ФОМС
	//		БазаПФР			   			  - база для взносов в ПФР (включая доходы, облагаемые ЕНВД)
	//		БазаПФР_ЕНВД			   	  - сумма облагаемых ПФР доходов, подподающих под ЕНВД
	//
	// Описание:
	//	
	// 	1) выбираем из ДоходыПоФизлицамМесяцамКодамТекст
	// 		и суммируем ОблагаемыйДоход для всех составных частей ЕСН. При этом учитывается входимость в базу
	// 		по флажку в справочнике - это База.
	//		Доход, облагаемый ЕНВД, не включаем в базу ЕСН. 
	//		Доход иностранца не включаем в базу ПФР.
	//		Для инвалидов считается база отдельно, но из неё исключаем договора подряда.
	//  2) суммировать ОблагаемыйДоход для всех составных частей ЕСН при входимости в базу и признака инвалидности - это ЛьготаИнвалиду по всем частям ЕСН
	
	
	ОблагаемаяБазаПоМесяцам = "
	|ВЫБРАТЬ
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	ВЫБОР КОГДА НЕ((Инвалид.Физлицо) ЕСТЬ NULL ) ТОГДА Инвалид.Группа ИНАЧЕ 0 КОНЕЦ КАК Группа,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	ВЫБОР КОГДА Основная.ДоходФСЗН = &парамПодлежитОбложению И Основная.Период <= &парамНачалоМесяцаПериодаРегистрации И Основная.Регистратор <> &Регистратор ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходФСЗН_Прошл,
	|	ВЫБОР КОГДА Основная.ДоходСтрах = &парамПодлежитОбложению И Основная.Период <= &парамНачалоМесяцаПериодаРегистрации И Основная.Регистратор <> &Регистратор ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходСтрах_Прошл,
	|	ВЫБОР КОГДА Основная.ДоходЕдиныйПлатеж = &парамПодлежитОбложению И Основная.Период <= &парамНачалоМесяцаПериодаРегистрации И Основная.Регистратор <> &Регистратор ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходЕдиныйПлатеж_Прошл,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	ВЫБОР КОГДА Основная.ДоходФСЗН = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходФСЗН,
	|	ВЫБОР КОГДА Основная.ДоходСтрах = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходСтрах,
	|	ВЫБОР КОГДА Основная.ДоходЕдиныйПлатеж = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходЕдиныйПлатеж
	|ИЗ
	|	("+ДоходыПоФизлицамМесяцамКодамТекст+") КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК Инвалид
	|		ПО Инвалид.Физлицо = Основная.ФизЛицо //И Инвалид.Месяц = Основная.Месяц
	|";
	
	Запрос.Текст = ОблагаемаяБазаПоМесяцам;
	
	ДляИсчисленияЕСНТекст = "
	|ВЫБРАТЬ
	|	БазаДляНачислений.ФизЛицо,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	БазаДляНачислений.ФизЛицо.Наименование КАК ФИО,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	БазаДляНачислений.Месяц,
	|	БазаДляНачислений.Группа,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	СУММА(БазаДляНачислений.БазаДоходФСЗН_Прошл) КАК БазаДоходФСЗН_Прошл,
	|	СУММА(БазаДляНачислений.БазаДоходСтрах_Прошл) КАК БазаДоходСтрах_Прошл,
	|	СУММА(БазаДляНачислений.БазаДоходЕдиныйПлатеж_Прошл) КАК БазаДоходЕдиныйПлатеж_Прошл,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	СУММА(БазаДляНачислений.БазаДоходФСЗН) КАК БазаДоходФСЗН,
	|	СУММА(БазаДляНачислений.БазаДоходСтрах) КАК БазаДоходСтрах,
	|	СУММА(БазаДляНачислений.БазаДоходЕдиныйПлатеж) КАК БазаДоходЕдиныйПлатеж,
	|   0 КАК ПенсионныйФонд,
	|   0 КАК НачисленныйФСЗН,
	|   0 КАК НачисленныйСтрах,
	|   0 КАК НачисленныйЕдиныйПлатеж,
	|   1 КАК БазаНачислений //О.Т. Аверсон 13.11.2015 № При изменении ср. зарплаты
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|   ПОМЕСТИТЬ ВтБазаИВзносы
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|ИЗ
	|	("+ОблагаемаяБазаПоМесяцам+") КАК БазаДляНачислений
	|СГРУППИРОВАТЬ ПО
	|	БазаДляНачислений.ФизЛицо,
	|	БазаДляНачислений.Месяц,
	|	БазаДляНачислений.Группа,
	|   1
	|  ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отчисления.ФизЛицо,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	Отчисления.ФизЛицо.Наименование,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
	|	Отчисления.Месяц,
	|	ВЫБОР
	|	КОГДА НЕ Инвалид.Физлицо ЕСТЬ NULL 
	|		ТОГДА Инвалид.Группа
	|	ИНАЧЕ 0
	|	КОНЕЦ,//Островская Татьяна 15.04.2014 № 17280
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	0 КАК БазаДоходФСЗН_Прошл,
	|	0 КАК БазаДоходСтрах_Прошл,
	|	0 КАК БазаДоходЕдиныйПлатеж_Прошл,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|   0 КАК БазаДоходФСЗН,
	|   0 КАК БазаДоходСтрах,
	|   0 КАК БазаДоходЕдиныйПлатеж,
	|	СУММА(Отчисления.ПенсионныйФонд) КАК ПенсионныйФонд,
	|	СУММА(Отчисления.ФСЗН) КАК НачисленныйФСЗН,
	|	СУММА(Отчисления.ОбязательноеСтрахование) КАК НачисленныйСтрах,
	|	СУММА(Отчисления.ЕдиныйПлатеж) КАК НачисленныйЕдиныйПлатеж,
	|   0
	|ИЗ
	|	("+ИсчисленныйЕСНТекст+") КАК Отчисления
	//Островская Татьяна 15.04.2014 № 17280
	|ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК Инвалид
	|	ПО (Инвалид.Физлицо = Отчисления.ФизЛицо)
	
	|	
	|СГРУППИРОВАТЬ ПО
	|	Отчисления.ФизЛицо,
	|	Отчисления.Месяц,
	|	ВЫБОР
	|		КОГДА НЕ Инвалид.Физлицо ЕСТЬ NULL 
	|			ТОГДА Инвалид.Группа
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|0
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|;
	|
	|ВЫБРАТЬ
	|	ФизЛицо,
	|	ФИО,
	|	Месяц,
	|	Группа,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	СУММА( БазаДоходФСЗН_Прошл ) КАК БазаДоходФСЗН_Прошл,
	|	СУММА( БазаДоходСтрах_Прошл ) КАК БазаДоходСтрах_Прошл,
	|	СУММА( БазаДоходЕдиныйПлатеж_Прошл ) КАК БазаДоходЕдиныйПлатеж_Прошл,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|	СУММА( БазаДоходФСЗН ) КАК БазаДоходФСЗН,
	|	СУММА( БазаДоходСтрах ) КАК БазаДоходСтрах,
	|	СУММА( БазаДоходЕдиныйПлатеж ) КАК БазаДоходЕдиныйПлатеж,
	|   СУММА( ПенсионныйФонд ) КАК ПенсионныйФонд,
	|   СУММА( НачисленныйФСЗН ) КАК НачисленныйФСЗН,
	|   СУММА( НачисленныйСтрах ) КАК НачисленныйСтрах,
	|   СУММА( НачисленныйЕдиныйПлатеж ) КАК НачисленныйЕдиныйПлатеж,
	|   МАКСИМУМ( БазаНачислений ) КАК БазаНачислений
	|ИЗ
	|	ВтБазаИВзносы КАК БазаИВзносы
	|СГРУППИРОВАТЬ ПО
	|	ФизЛицо,
	|	ФИО,
	|	Месяц,
	|	Группа
	|УПОРЯДОЧИТЬ ПО
	|	ФИО,
	|	Месяц
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 10
	|";
	//Островская Татьяна 15.04.2014 № 17280
	
	Запрос.Текст = ДляИсчисленияЕСНТекст;
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции  // ПолучитьДанныеРасчетаЕСН


// Процедура рассчитывает ЕСН по введенным доходам
//
Процедура РасчетЕСН(ГоловнаяОрганизация,СпПересчетаПрошлМес = Неопределено,Пересчет = Ложь)
	если СпПересчетаПрошлМес = Неопределено Тогда 
		СпПересчетаПрошлМес = Новый ТаблицаЗначений;
	КонецЕсли;
	//О.Т. 21.01.2015 № 17778
	ПараметрБез97Счета = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ОбязательноеСтрахованиеБез97)).Размер;//О.Т. 21.01.2015 № 17778
	если ПараметрБез97Счета = 0 Тогда 
		ПараметрБез97Счета = Ложь;
	иначе
		ПараметрБез97Счета = Истина;
	КонецЕсли;
	//О.Т. 21.01.2015 № 17778
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить(); //+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	
	
	ФизЛицоПрошл = "";//Островская Татьяна 10.09.2013 № 16725
	// получаем ЕСН по периоду регистрации
	ДанныеДляРасч = ПолучитьДанныеРасчетаЕСН(ГоловнаяОрганизация,Пересчет);
	ДанныеДляРасчетаЕСН = ДанныеДляРасч.Выбрать();
	ФизЛицаСОграниичением = Новый СписокЗначений;
	ТаблицаПрибСумм = Новый ТаблицаЗначений;
	ТаблицаПрибСумм.Колонки.Добавить("ФизЛицо");
	ТаблицаПрибСумм.Колонки.Добавить("ПериодВзаиморасчетов");
	ТаблицаСтрахование = Новый ТаблицаЗначений;
	ТаблицаСтрахование.Колонки.Добавить("ФизЛицо");
	ТаблицаСтрахование.Колонки.Добавить("СуммаСтрах");
	ТаблицаСтрахование.Колонки.Добавить("Месяц");
	НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
	НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
	НаборЗаписейОДоходах.Прочитать();
	Пока ДанныеДляРасчетаЕСН.Следующий() Цикл
		ОбработкаПрерыванияПользователя();//О.Т. Аверсон 09.11.2017 № 1219
		//+ СВЭЙ КДЯ 14.02.20 СВФР-005514
		СотрудникОсн = Неопределено;
		//- СВЭЙ КДЯ 14.02.20 СВФР-005514
		//О.Т. 08.08.2014 № 17522 950
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		СотрудникИзТЧОсн = ОсновныеНачисления.НайтиСтроки(ПараметрыОтбора);
		если СотрудникИзТЧОсн.Количество() > 0 Тогда 
			СотрудникОсн = СотрудникИзТЧОсн[0].Сотрудник;
		КонецЕсли;	
		если не ЗначениеЗаполнено(СотрудникОсн) Тогда 
			СотрудникИзТЧДоп = ДополнительныеНачисления.НайтиСтроки(ПараметрыОтбора);
			если СотрудникИзТЧДоп.Количество() > 0 Тогда 
				СотрудникОсн = СотрудникИзТЧДоп[0].Сотрудник;
			КонецЕсли;
		КонецЕсли;
		если не ЗначениеЗаполнено(СотрудникОсн) Тогда 
			СотрудникОсн = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ДанныеДляРасчетаЕСН.ФизЛицо.Наименование);
		КонецЕсли;
		Если СотрудникОсн.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
		иначе
			ВидНалогообложения = СотрудникОсн.ВидНалогообложенияОсновной;
		КонецЕсли;
		//О.Т. 08.08.2014 № 17522 950
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 26.03.2016 № 950
		ВеличинаПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;       
		РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//СуммаПрошл = 0;
		//СуммаПрошлИзмСРЗП = 0;
		////Островская Татьяна 10.09.2013 № 16725
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда 
		//	
		//	ЗапросПроверкаРез = Новый Запрос;
		//	ЗапросПроверкаРез.Текст = 
		//	"ВЫБРАТЬ
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ЕСНСведенияОДоходах.Результат
		//	|		КОНЕЦ) КАК ДоходФСЗН,
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходСтрах = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ЕСНСведенияОДоходах.Результат
		//	|		КОНЕЦ) КАК ДоходСтрах,
		//	|	ВложенныйЗапрос.ФСЗН КАК ФСЗН,
		//	|	ВложенныйЗапрос.ПенсионныйФонд КАК ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование КАК ОбязательноеСтрахование,
		//	|	СУММА(ЕСНСведенияОДоходах.Результат) КАК ОблагаемыйДоход,
		//	|	ЕСНСведенияОДоходах.ФизЛицо,
		//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//	|	ЕСНСведенияОДоходах.Организация,
		//	|	ЕСНСведенияОДоходах.Результат
		//	|ИЗ
		//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах,
		//	|	(ВЫБРАТЬ
		//	|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//	|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	|		СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК ОбязательноеСтрахование
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//	|	ГДЕ
		//	|		ЕСНИсчисленный.Организация = &Организация
		//	|		И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		//	|		И ЕСНИсчисленный.Регистратор <> &Регистратор
		//	|		И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	|		И ЕСНИсчисленный.Период <> &ПериодРегистрации) КАК ВложенныйЗапрос
		//	|ГДЕ
		//	|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//	|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|	И ЕСНСведенияОДоходах.Организация = &Организация
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование,
		//	|	ВложенныйЗапрос.ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ФСЗН,
		//	|	ЕСНСведенияОДоходах.ФизЛицо,
		//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	|	ЕСНСведенияОДоходах.Организация,
		//	|	ЕСНСведенияОДоходах.Результат";
		//	
		//	ЗапросПроверкаРез.УстановитьПараметр("Организация", Организация);
		//	ЗапросПроверкаРез.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		//	ЗапросПроверкаРез.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	ЗапросПроверкаРез.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	ЗапросПроверкаРез.УстановитьПараметр("Регистратор", Ссылка);
		//	ЗапросПроверкаРез.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//	ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	ЗапросПроверкаРез.УстановитьПараметр("ВидРасч",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
		//	ЗапросПроверкаРез.УстановитьПараметр("ДоходФСЗН",Перечисления.ДоходыФСС_НС.Облагается);
		//	
		//иначе
		//	
		//	ЗапросПроверкаРез = новый Запрос;
		//	ЗапросПроверкаРез.Текст = 
		//	"ВЫБРАТЬ
		//	|	ВложенныйЗапрос.ФизЛицо,
		//	|	ВложенныйЗапрос.Месяц,
		//	|	ВложенныйЗапрос.ДоходФСЗН,
		//	|	ВложенныйЗапрос.ДоходСтрах,
		//	|	ВложенныйЗапрос.доходЕдиныйПлатеж,
		//	|	СУММА(ВложенныйЗапрос.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		//	|	МАКСИМУМ(ВложенныйЗапрос.Сторно) КАК Сторно
		//	|ИЗ
		//	|	(ВЫБРАТЬ
		//	|		ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//	|		ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
		//	|		ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
		//	|		ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//	|		СУММА(ЕСНСведенияОДоходах.Результат) КАК ОблагаемыйДоход,
		//	|		ВложенныйЗапрос.Сторно КАК Сторно
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//	|				ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//	|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//	|				ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
		//	|				ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
		//	|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//	|				СУММА(ВЫБОР
		//	|						КОГДА ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//	|								И ЕСНСведенияОДоходах.Результат < 0
		//	|							ТОГДА 1
		//	|						ИНАЧЕ 0
		//	|					КОНЕЦ) КАК Сторно,
		//	|				ЕСНСведенияОДоходах.Регистратор КАК Регистратор
		//	|			ИЗ
		//	|				РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//	|			ГДЕ
		//	|				ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//	|				И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//	|				И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|				И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//	|				И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//	|			
		//	|			СГРУППИРОВАТЬ ПО
		//	|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	|				ЕСНСведенияОДоходах.ФизЛицо,
		//	|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//	|				ЕСНСведенияОДоходах.ДоходФСЗН,
		//	|				ЕСНСведенияОДоходах.ДоходСтрах,
		//	|				ЕСНСведенияОДоходах.Регистратор) КАК ВложенныйЗапрос
		//	|			ПО ЕСНСведенияОДоходах.Регистратор = ВложенныйЗапрос.Регистратор
		//	|	ГДЕ
		//	|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//	|		И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//	|		И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|		И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//	|		И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//	|		И НЕ(ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации)
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	|		ЕСНСведенияОДоходах.ФизЛицо,
		//	|		ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//	|		ЕСНСведенияОДоходах.ДоходФСЗН,
		//	|		ЕСНСведенияОДоходах.ДоходСтрах,
		//	|		ВложенныйЗапрос.Сторно) КАК ВложенныйЗапрос
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ВложенныйЗапрос.Месяц,
		//	|	ВложенныйЗапрос.ФизЛицо,
		//	|	ВложенныйЗапрос.доходЕдиныйПлатеж,
		//	|	ВложенныйЗапрос.ДоходСтрах,
		//	|	ВложенныйЗапрос.ДоходФСЗН";
		//	
		//	ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		//	ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
		//	ЗапросПроверкаРез.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//	ЗапросПроверкаРез.УстановитьПараметр("ДоходФСЗН",Перечисления.ДоходыФСС_НС.Облагается);
		//	ЗапросПроверкаРез.УстановитьПараметр("ВидРасч",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
		//КонецЕсли;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		РазмерСреднейЗарплатыПрошл = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400)-86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		ИзмениласьСрЗП = РазмерСреднейЗарплаты <> РазмерСреднейЗарплатыПрошл; 
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//РезЗапрос = ЗапросПроверкаРез.Выполнить().Выбрать();
		//пока РезЗапрос.Следующий() Цикл
		//	если не НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
		//		если РезЗапрос.Сторно = 1 Тогда                      
		//			СуммаПрошл = РезЗапрос.ОблагаемыйДоход;
		//		ИначеЕсли ИзмениласьСрЗП Тогда 
		//			СуммаПрошлИзмСРЗП = РезЗапрос.ОблагаемыйДоход;					
		//		КонецЕсли;
		//	иначе
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//СуммаПрошл = СуммаПрошл + ?(РезЗапрос.ДоходФСЗН = null,0,РезЗапрос.ДоходФСЗН);
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		СуммаПрошл = СуммаПрошл + ?( ЗначениеЗаполнено( РезЗапрос.ДоходФСЗН ), РезЗапрос.ДоходФСЗН , 0 );
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//	КонецЕсли;
		//	если не НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
		//		ЗапросПроверкаРез = новый Запрос;
		//		ЗапросПроверкаРез.Текст = 
		//		"ВЫБРАТЬ
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//		|	ЕСНСведенияОДоходах.ДоходФСЗН,
		//		|	ЕСНСведенияОДоходах.ДоходСтрах,
		//		|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//		|	МАКСИМУМ(ВЫБОР
		//		|			КОГДА ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//		|					И ЕСНСведенияОДоходах.Результат < 0
		//		|				ТОГДА 1
		//		|			ИНАЧЕ 0
		//		|		КОНЕЦ) КАК Сторно,
		//		|	ЕСНСведенияОДоходах.Результат
		//		|ИЗ
		//		|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//		|ГДЕ
		//		|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//		|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//		|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//		|	И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//		|	И ЕСНСведенияОДоходах.Результат < 0
		//		|	И ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
		//		|
		//		|СГРУППИРОВАТЬ ПО
		//		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//		|	ЕСНСведенияОДоходах.ФизЛицо,
		//		|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//		|	ЕСНСведенияОДоходах.ДоходФСЗН,
		//		|	ЕСНСведенияОДоходах.ДоходСтрах,
		//		|	ЕСНСведенияОДоходах.Результат";
		//		если не НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
		//			ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//			ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//		иначе
		//			ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		//			ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
		//		КонецЕсли;
		//		ЗапросПроверкаРез.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//		ЗапросПроверкаРез.УстановитьПараметр("ДоходФСЗН",Перечисления.ДоходыФСС_НС.Облагается);
		//		ЗапросПроверкаРез.УстановитьПараметр("ВидРасч",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
		//		РезПроверкаРезультата = ЗапросПроверкаРез.Выполнить().Выбрать();
		//		
		//		
		//		пока РезПроверкаРезультата.Следующий() Цикл 
		//			если РезПроверкаРезультата.Сторно = 1 Тогда                      
		//				СуммаПрошл = РезЗапрос.ОблагаемыйДоход - Мин(-РезПроверкаРезультата.Результат,БазаОграниченияФСЗН);
		//			КонецЕсли;
		//			
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЦикла;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
		//	СуммаПрошл = СуммаПрошл + ?(ДанныеДляРасчетаЕСН.БазаДоходФСЗН=Null,0,ДанныеДляРасчетаЕСН.БазаДоходФСЗН);
		//КонецЕсли;
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//если не СуммаПрошл = 0 и ДанныеДляРасчетаЕСН.БазаНачислений >= 1 Тогда //О.Т. Аверсон 13.11.2015 № При изменении ср. зарплаты
		//	если не СуммаПрошл <= БазаОграниченияФСЗН Тогда //О.Т. Аверсон 02.05.2019 № 4307 (знак равно со сторны клиента НС)
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		если ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл > 0 И ДанныеДляРасчетаЕСН.БазаНачислений >= 1 Тогда
			если ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл > БазаОграниченияФСЗН Тогда 
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
					ПроверкаПоФизЛицу = Истина;
				иначе
					ПроверкаПоФизЛицу = ФизЛицоПрошл <> ДанныеДляРасчетаЕСН.ФизЛицо;
				КонецЕсли;
				если ПроверкаПоФизЛицу Тогда 
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|       РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
					|       РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало
					|ИЗ
					|       Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
					|ГДЕ
					|       РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
					|       И &Месяц МЕЖДУ РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало И
					|       РасчетЕСНДополнительныеНачисления.БазовыйПериодКонец";
					
					Запрос.УстановитьПараметр("Месяц", ДанныеДляРасчетаЕСН.Месяц);
					Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
					Результат = Запрос.Выполнить();
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
						ПараметрыОтбора.Вставить("БазовыйПериодНачало", ВыборкаДетальныеЗаписи.БазовыйПериодНачало);
						ДопНачИзменить = ДополнительныеНачисления.НайтиСтроки(ПараметрыОтбора);
						для Каждого СтрДоп из ДопНачИзменить Цикл 
							СтрДоп.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
								СтрДоп.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							КонецЕсли;
							
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = СтрДоп.ФизЛицо и Запись.Результат = СтрДоп.Результат и Запись.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							
						КонецЦикла;
						
						НаборЗаписейОДоходах.Записать();
						
					КонецЦикла;
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|       РасчетЕСНОсновныеНачисления.ДоходФСЗН,
					|       РасчетЕСНОсновныеНачисления.ПериодДействияНачало
					|ИЗ
					|       Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
					|ГДЕ
					|       РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
					|       И &Месяц МЕЖДУ РасчетЕСНОсновныеНачисления.ПериодДействияНачало И
					|       РасчетЕСНОсновныеНачисления.ПериодДействияКонец";
					
					Запрос.УстановитьПараметр("Месяц", ДанныеДляРасчетаЕСН.Месяц);
					Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
					Результат = Запрос.Выполнить();
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
						ПараметрыОтбора.Вставить("ПериодДействияНачало", ВыборкаДетальныеЗаписи.ПериодДействияНачало);
						ОснНачИзменить = ОсновныеНачисления.НайтиСтроки(ПараметрыОтбора);
						для Каждого СтрОсн из ОснНачИзменить Цикл 
							СтрОсн.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
								СтрОсн.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							КонецЕсли;
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = СтрОсн.ФизЛицо и Запись.Результат = СтрОсн.Результат и Запись.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							
						КонецЦикла;
						НаборЗаписейОДоходах.Записать();
						
					КонецЦикла;
					
					ФизЛицоПрошл = ДанныеДляРасчетаЕСН.ФизЛицо;
				КонецЕсли;
				
			иначе
				
				//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11	
				//ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
				//ЗапросИзПредМес = Новый Запрос;
				//ЗапросИзПредМес.Текст = 
				//"ВЫБРАТЬ
				//|    РасчетЕСНИсчисленныйЕСН.ФизЛицо,
				//|	СУММА(ВЫБОР
				//|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
				//|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
				//|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондФСЗН / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
				//|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондФСЗН
				//|		КОНЕЦ) КАК ФондФСЗН,
				//|	СУММА(ВЫБОР
				//|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
				//|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
				//|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондСтрахование / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
				//|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондСтрахование
				//|		КОНЕЦ) КАК ФондСтрахование,
				//|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов
				//|ИЗ
				//|    Документ.РасчетЕСН.ИсчисленныйЕСН КАК РасчетЕСНИсчисленныйЕСН
				//|ГДЕ
				//|    РасчетЕСНИсчисленныйЕСН.Ссылка.Проведен
				//|    И НАЧАЛОПЕРИОДА(РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
				//|    И РасчетЕСНИсчисленныйЕСН.Ссылка <> &ДокументСсылка
				////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 4
				//|	 И РасчетЕСНИсчисленныйЕСН.ФизЛицо = &ФизЛицо
				////- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//|
				//|СГРУППИРОВАТЬ ПО
				//|    РасчетЕСНИсчисленныйЕСН.ФизЛицо,
				//|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов";
				//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда         
				//	ЗапросИзПредМес.УстановитьПараметр("Период", ДанныеДляРасчетаЕСН.Месяц);
				//иначе                                                               					
				//	ЗапросИзПредМес.УстановитьПараметр("Период", ПериодРегистрации);
				//КонецЕсли;
				//ЗапросИзПредМес.УстановитьПараметр("ДокументСсылка", Ссылка);
				////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 4
				//ЗапросИзПредМес.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				////- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//ТаблицаДопСумм = ЗапросИзПредМес.Выполнить().Выгрузить();
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				
				
				ВеличинаПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;       
				РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
				
				//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//"ВЫБРАТЬ
				//|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
				//|	ВЫБОР
				//|		КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL 
				//|			ТОГДА 35
				//|		ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
				//|	КОНЕЦ КАК ПроцентФСЗН,
				//|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
				//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
				//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
				//|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
				//|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
				//|ИЗ
				//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
				//|ГДЕ
				//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
				////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 3
				////|	И ЕСНИсчисленный.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
				////- СВЭЙ КДЯ 10.03.20 СВФР-005656 3
				//
				////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 3
				//|	И ЕСНИсчисленный.Период <= &парамКонецМесяцаПериодаРегистрации
				////- СВЭЙ КДЯ 10.03.20 СВФР-005656 3
				////	|	И ЕСНИсчисленный.ПериодВзаиморасчетов > &парамКонецМесяцаПериодаРегистрации //О.Т. 14.07.2014 № 120
				//|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
				//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНаМесяцНач И &ПериодВзаиморасчетовНаМесяцКон";//О.Т. 01.07.2014 № 67
				//
				//Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
				////О.Т. 01.07.2014 № 67
				//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцНач", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
				//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцКон", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
				////О.Т. 01.07.2014 № 67
				//Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
				//Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
				//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				//
				//
				//Результат = Запрос.Выполнить();
				//
				//
				//ВыборкаДетальныеЗаписи = Результат.Выбрать();
				//СуммаПенсионныйПоПериоду = 0;
				//СуммаОбСтрахованиеПоПериоду = 0;
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//	если Месяц(ДанныеДляРасчетаЕСН.Месяц) <> Месяц(ПериодРегистрации) 
				//		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
				//		ИЛИ Год(ДанныеДляРасчетаЕСН.Месяц) <> Год(ПериодРегистрации)
				//		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//		Тогда
				//		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
				//		//СуммаПенсионныйПоПериоду = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
				//		//СуммаОбСтрахованиеПоПериоду = ВыборкаДетальныеЗаписи.ОбязательноеСтрахование;
				//		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
				//		СуммаПенсионныйПоПериоду = СуммаПенсионныйПоПериоду + ВыборкаДетальныеЗаписи.ПенсионныйФонд;
				//		СуммаОбСтрахованиеПоПериоду = СуммаОбСтрахованиеПоПериоду + ВыборкаДетальныеЗаписи.ОбязательноеСтрахование;
				//		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//	КонецЕсли;
				//КонецЦикла;
				//
				//мПревышенияОграничения = Ложь;
				//БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
				//Если СтруктураПенс.ОграничениеПоДоходам = 0 ИЛИ РазмерСреднейЗарплаты = 0 тогда
				//	БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				//	БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				//Иначе
				//	мСуммаДопБазаДоходФСЗН = 0;
				//	мСуммаДопБазаДоходСтрах = 0;
				//	мНайденнаяСтрока = ТаблицаДопСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц));
				//	Если мНайденнаяСтрока.Количество() <> 0 Тогда
				//		мСуммаДопБазаДоходФСЗН = мНайденнаяСтрока[0].ФондФСЗН;
				//		мСуммаДопБазаДоходСтрах = мНайденнаяСтрока[0].ФондСтрахование;
				//	КонецЕсли;
				//	Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН > БазаОграниченияФСЗН Тогда
				//		мСуммаПревышения = (ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН)-БазаОграниченияФСЗН;
				//		ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" превышение ограничения на "+Строка(мСуммаПревышения));
				//		БазаДоходПенсионныйФонд = БазаОграниченияФСЗН;
				//		БазаДоходФСЗН = ?(БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН>0,БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН,0);
				//		мПревышенияОграничения = Истина;
				//		СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
				//		СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
				//		СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
				//	Иначе
				//		мНайденнаяСтрокаФизЛиц = ТаблицаПрибСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц)); //О.Т. 15.07.2014 № !!!
				//		если мНайденнаяСтрокаФизЛиц.Количество()>0 Тогда 
				//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				//		иначе
				//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 5
				//			//БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН;
				//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 5
				//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН + мСуммаДопБазаДоходФСЗН - СуммаПрошл;
				//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
				//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				//			если мСуммаДопБазаДоходФСЗН<> 0 Тогда //О.Т. 15.07.2014 № !!!
				//				СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
				//				СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
				//				СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
				//			КонецЕсли;
				//		КонецЕсли;
				//	КонецЕсли;
				//	
				//КонецЕсли;
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				
				//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				мСуммаПревышения = Макс( ДанныеДляРасчетаЕСН.БазаДоходФСЗН - БазаОграниченияФСЗН, 0 );
				мПревышенияОграничения = мСуммаПревышения > 0;
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				
				Если мПревышенияОграничения Тогда
					
					
					//Островская Татьяна 08.04.2014 № 17239
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	РасчетЕСНОсновныеНачисления.ВидРасчета,
					|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
					|	РасчетЕСНОсновныеНачисления.Результат,
					|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
					|	РасчетЕСНОсновныеНачисления.НомерСтроки
					|ИЗ
					|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
					|ГДЕ
					|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
					|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
					|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
					|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало";
					
					Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
					Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
					Запрос.УстановитьПараметр("Ссылка", Ссылка);
					Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
					
					ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
					//Островская Татьяна 08.04.2014 № 17239
					Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
						СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
						если СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
							или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка Тогда 
							Если мСуммаПревышения = 0 Тогда
								Прервать;
							КонецЕсли;
							Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
								
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
									КонецЕсли;								
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
								
							Иначе
								//разбиваем строку
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
									КонецЕсли;								
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
								
								
								
								НоваяСтрокаОН = ОсновныеНачисления.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
								НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
								мСуммаПревышения = 0;
								
								СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
								СтрокаРегистр.Активность = Истина;
								ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
								СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
								если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
									СтрокаРегистр.Период = ПериодРегистрации;
								иначе
									
									СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
								КонецЕсли;
								СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.ПериодДействияНачало;
								СтрокаРегистр.ОбособленноеПодразделение = Организация;
								СтрокаРегистр.Организация = Организация;
								СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
								НаборЗаписейОДоходах.Записать();
								
							КонецЕсли;
							
							
						КонецЕсли;
					КонецЦикла;
					ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();//Островская Татьяна 08.04.2014 № 17239
					Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
						СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
						если не (СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
							или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка) Тогда
							Если мСуммаПревышения = 0 Тогда
								Прервать;
							КонецЕсли;
							Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
								
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета 
										и Запись.ПериодВзаиморасчетов =  СтрокаОсновныхНачислений.ПериодДействияНачало	 Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
									КонецЕсли;								
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
								
							Иначе
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета 
										и  Запись.ПериодВзаиморасчетов =  СтрокаОсновныхНачислений.ПериодДействияНачало Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
									КонецЕсли;								
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
								
								//разбиваем строку
								НоваяСтрокаОН = ОсновныеНачисления.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
								НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
								мСуммаПревышения = 0;
								
								СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
								СтрокаРегистр.Активность = Истина;
								ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
								СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
								если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
									СтрокаРегистр.Период = ПериодРегистрации;
								иначе
									
									СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
								КонецЕсли;
								СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.ПериодДействияНачало;
								СтрокаРегистр.ОбособленноеПодразделение = Организация;
								СтрокаРегистр.Организация = Организация;
								СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
								НаборЗаписейОДоходах.Записать();
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла; 
					//Островская Татьяна 25.09.2013 № 16815
					Если мСуммаПревышения <> 0 Тогда
						//Островская Татьяна 08.04.2014 № 17239
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РасчетЕСНДополнительныеНачисления.ВидРасчета,
						|	РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
						|	РасчетЕСНДополнительныеНачисления.Результат,
						|	РасчетЕСНДополнительныеНачисления.КодДоходаЕСН,
						|	РасчетЕСНДополнительныеНачисления.НомерСтроки
						|ИЗ
						|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
						|ГДЕ
						|	РасчетЕСНДополнительныеНачисления.Ссылка = &Ссылка
						|	И РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
						|	И РасчетЕСНДополнительныеНачисления.ДоходФСЗН = &ДоходФСЗН
						|	И НАЧАЛОПЕРИОДА(РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &БазовыйПериодНачало";
						
						Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
						Запрос.УстановитьПараметр("БазовыйПериодНачало", ДанныеДляРасчетаЕСН.Месяц);
						Запрос.УстановитьПараметр("Ссылка", Ссылка);
						Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
						
						ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
						//Островская Татьяна 08.04.2014 № 17239
						//НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
						//НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
						//НаборЗаписейОДоходах.Прочитать();
						Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
							СтрокаОсновныхНачислений = ДополнительныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
							Если мСуммаПревышения = 0 Тогда
								Прервать;
							КонецЕсли;
							Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
								
								
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
										
									КонецЕсли;								                                          
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
							Иначе
								
								для Каждого Запись из НаборЗаписейОДоходах Цикл 
									если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
										Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
										если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
											Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
										КонецЕсли;
										
									КонецЕсли;								
								КонецЦикла;
								НаборЗаписейОДоходах.Записать();
								
								//разбиваем строку
								НоваяСтрокаОН = ДополнительныеНачисления.Добавить();
								
								ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
								СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
								
								//СтрокаТЗ = НовыеЗаписиВРегистр.Добавить();
								//ЗаполнитьЗначенияСвойств(СтрокаТЗ,СтрокаОсновныхНачислений);
								//СтрокаТЗ.Период = ДанныеДляРасчетаЕСН.Месяц;
								//СтрокаТЗ.ПериодВзаиморасчетов = СтрокаОсновныхНачислений.БазовыйПериодНачало;
								//СтрокаТЗ.ОбособленноеПодразделение = Организация;
								//СтрокаТЗ.Организация = Организация;
								
								НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
								
								СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
								СтрокаРегистр.Активность = Истина;
								ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
								СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
								если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
									СтрокаРегистр.Период = ПериодРегистрации;
								иначе
									
									СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
								КонецЕсли;
								СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.БазовыйПериодНачало;
								СтрокаРегистр.ОбособленноеПодразделение = Организация;
								СтрокаРегистр.Организация = Организация;
								СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
								НаборЗаписейОДоходах.Записать();
								
								
								мСуммаПревышения = 0;
								
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					Если мСуммаПревышения <> 0 Тогда
						ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" ОШИБКА расчета ограничения !!!");
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		если ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл > 0 и ИзмениласьСрЗП и ДанныеДляРасчетаЕСН.БазаНачислений >= 1 Тогда 
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			
			
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			//О.Т. Аверсон 13.11.2015 № При изменении ср. зарплаты 
			//если не СуммаПрошлИзмСРЗП = 0 и ИзмениласьСрЗП и ДанныеДляРасчетаЕСН.БазаНачислений >= 1 Тогда 
			//ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
			//ЗапросИзПредМес = Новый Запрос;
			//ЗапросИзПредМес.Текст = 
			//"ВЫБРАТЬ
			//|    РасчетЕСНИсчисленныйЕСН.ФизЛицо,
			//|	СУММА(ВЫБОР
			//|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			//|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			//|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондФСЗН / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
			//|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондФСЗН
			//|		КОНЕЦ) КАК ФондФСЗН,
			//|	СУММА(ВЫБОР
			//|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			//|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
			//|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондСтрахование / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
			//|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондСтрахование
			//|		КОНЕЦ) КАК ФондСтрахование,
			//|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов
			//|ИЗ
			//|    Документ.РасчетЕСН.ИсчисленныйЕСН КАК РасчетЕСНИсчисленныйЕСН
			//|ГДЕ
			//|    РасчетЕСНИсчисленныйЕСН.Ссылка.Проведен
			//|    И НАЧАЛОПЕРИОДА(РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
			//|    И РасчетЕСНИсчисленныйЕСН.Ссылка <> &ДокументСсылка
			//|
			//|СГРУППИРОВАТЬ ПО
			//|    РасчетЕСНИсчисленныйЕСН.ФизЛицо,
			//|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов";
			//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда         
			//	ЗапросИзПредМес.УстановитьПараметр("Период", ДанныеДляРасчетаЕСН.Месяц);
			//иначе                                                               					
			//	ЗапросИзПредМес.УстановитьПараметр("Период", ПериодРегистрации);
			//КонецЕсли;
			//ЗапросИзПредМес.УстановитьПараметр("ДокументСсылка", Ссылка);
			//ТаблицаДопСумм = ЗапросИзПредМес.Выполнить().Выгрузить();
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			
			ВеличинаПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;       
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
			//|	ВЫБОР
			//|		КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL 
			//|			ТОГДА 35
			//|		ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
			//|	КОНЕЦ КАК ПроцентФСЗН,
			//|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
			//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
			//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
			//|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
			//|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
			//|ИЗ
			//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			//|ГДЕ
			//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
			//|	И ЕСНИсчисленный.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
			////	|	И ЕСНИсчисленный.ПериодВзаиморасчетов > &парамКонецМесяцаПериодаРегистрации //О.Т. 14.07.2014 № 120
			//|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
			//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНаМесяцНач И &ПериодВзаиморасчетовНаМесяцКон";//О.Т. 01.07.2014 № 67
			//
			//Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
			////О.Т. 01.07.2014 № 67
			//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцНач", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцКон", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			////О.Т. 01.07.2014 № 67
			//Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
			//Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
			//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			//
			//
			//Результат = Запрос.Выполнить();
			//
			//
			//ВыборкаДетальныеЗаписи = Результат.Выбрать();
			//СуммаПенсионныйПоПериоду = 0;
			//СуммаОбСтрахованиеПоПериоду = 0;
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	если Месяц(ДанныеДляРасчетаЕСН.Месяц) <> Месяц(ПериодРегистрации) Тогда 
			//		СуммаПенсионныйПоПериоду = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
			//		СуммаОбСтрахованиеПоПериоду = ВыборкаДетальныеЗаписи.ОбязательноеСтрахование;
			//	КонецЕсли;
			//КонецЦикла;
			//
			//мПревышенияОграничения = Ложь;
			//БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			//Если СтруктураПенс.ОграничениеПоДоходам = 0 ИЛИ РазмерСреднейЗарплаты = 0 тогда
			//	БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			//	БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			//Иначе
			//	мСуммаДопБазаДоходФСЗН = 0;
			//	мСуммаДопБазаДоходСтрах = 0;
			//	мНайденнаяСтрока = ТаблицаДопСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц));
			//	Если мНайденнаяСтрока.Количество() <> 0 Тогда
			//		мСуммаДопБазаДоходФСЗН = мНайденнаяСтрока[0].ФондФСЗН;
			//		мСуммаДопБазаДоходСтрах = мНайденнаяСтрока[0].ФондСтрахование;
			//	КонецЕсли;
			//	Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН > БазаОграниченияФСЗН Тогда
			//		мСуммаПревышения = (ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН)-БазаОграниченияФСЗН;
			//		ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" превышение ограничения на "+Строка(мСуммаПревышения));
			//		БазаДоходПенсионныйФонд = БазаОграниченияФСЗН;
			//		БазаДоходФСЗН = ?(БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН>0,БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН,0);
			//		мПревышенияОграничения = Истина;
			//		СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
			//		СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
			//		СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
			//	Иначе
			//		мНайденнаяСтрокаФизЛиц = ТаблицаПрибСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц)); //О.Т. 15.07.2014 № !!!
			//		если мНайденнаяСтрокаФизЛиц.Количество()>0 Тогда 
			//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			//		иначе
			//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН;
			//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			//			если мСуммаДопБазаДоходФСЗН<> 0 Тогда //О.Т. 15.07.2014 № !!!
			//				СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
			//				СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
			//				СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//	
			//КонецЕсли;
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			мСуммаПревышения = Макс( ДанныеДляРасчетаЕСН.БазаДоходФСЗН - БазаОграниченияФСЗН, 0 );
			мПревышенияОграничения = мСуммаПревышения > 0;
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			
			
			Если мПревышенияОграничения  Тогда
				
				//Островская Татьяна 08.04.2014 № 17239
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетЕСНОсновныеНачисления.ВидРасчета,
				|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
				|	РасчетЕСНОсновныеНачисления.Результат,
				|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
				|	РасчетЕСНОсновныеНачисления.НомерСтроки
				|ИЗ
				|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
				|ГДЕ
				|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
				|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
				|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
				|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало";
				
				Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
				//Островская Татьяна 08.04.2014 № 17239
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					если СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
						или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка Тогда 
						Если мСуммаПревышения = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;// Поставила необлагается. Стояло почему-то Облагается. Решила что ошибка. Если что можно вернуть 
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
							
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							НаборЗаписейОДоходах.Записать();
							
						Иначе
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							НаборЗаписейОДоходах.Записать();
							
							//разбиваем строку
							НоваяСтрокаОН = ОсновныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается; // Поставила необлагается. Стояло почему-то Облагается. Решила что ошибка. Если что можно вернуть
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
							НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
							мСуммаПревышения = 0;
							
							СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
							СтрокаРегистр.Активность = Истина;
							ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
							СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
							если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
								СтрокаРегистр.Период = ПериодРегистрации;
							иначе
								
								СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
							КонецЕсли;
							СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.ПериодДействияНачало;
							СтрокаРегистр.ОбособленноеПодразделение = Организация;
							СтрокаРегистр.Организация = Организация;
							СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
							НаборЗаписейОДоходах.Записать();
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();//Островская Татьяна 08.04.2014 № 17239
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					если не (СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
						или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка) Тогда
						Если мСуммаПревышения = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
							
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета 
									и Запись.ПериодВзаиморасчетов =  СтрокаОсновныхНачислений.ПериодДействияНачало Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							НаборЗаписейОДоходах.Записать();
						Иначе
							
							для Каждого Запись из НаборЗаписейОДоходах Цикл 
								если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета 
									и Запись.ПериодВзаиморасчетов =  СтрокаОсновныхНачислений.ПериодДействияНачало Тогда 
									Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
									если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
										Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
									КонецЕсли;
								КонецЕсли;								
							КонецЦикла;
							НаборЗаписейОДоходах.Записать();
							
							//разбиваем строку
							НоваяСтрокаОН = ОсновныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
							НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
							мСуммаПревышения = 0;
							
							СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
							СтрокаРегистр.Активность = Истина;
							ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
							СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
							если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
								СтрокаРегистр.Период = ПериодРегистрации;
							иначе
								
								СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
							КонецЕсли;
							СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.ПериодДействияНачало;
							СтрокаРегистр.ОбособленноеПодразделение = Организация;
							СтрокаРегистр.Организация = Организация;
							СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
							НаборЗаписейОДоходах.Записать();
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				//О.Т. Аверсон 09.12.2016 № 79
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетЕСНОсновныеНачисления.ВидРасчета,
				|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
				|	РасчетЕСНОсновныеНачисления.Результат,
				|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
				|	РасчетЕСНОсновныеНачисления.НомерСтроки
				|ИЗ
				|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНОсновныеНачисления
				|ГДЕ
				|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
				|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
				|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
				|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &ПериодДействияНачало";
				
				Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					СтрокаОсновныхНачислений = ДополнительныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					Если мСуммаПревышения = 0 Тогда
						Прервать;
					КонецЕсли;
					Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
						СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
						СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
						мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
						
						для Каждого Запись из НаборЗаписейОДоходах Цикл 
							если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = ДанныеДляРасчетаЕСН.Месяц и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
								Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
									Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								КонецЕсли;
							КонецЕсли;								
						КонецЦикла;
						НаборЗаписейОДоходах.Записать();
					Иначе
						
						для Каждого Запись из НаборЗаписейОДоходах Цикл 
							если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = ДанныеДляРасчетаЕСН.Месяц и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
								Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
									Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								КонецЕсли;
							КонецЕсли;								
						КонецЦикла;
						НаборЗаписейОДоходах.Записать();
						//разбиваем строку
						НоваяСтрокаОН = ДополнительныеНачисления.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
						СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
						СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
						СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
						НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
						мСуммаПревышения = 0;
						
						СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
						СтрокаРегистр.Активность = Истина;
						ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
						СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
						если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
							СтрокаРегистр.Период = ПериодРегистрации;
						иначе
							
							СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
						КонецЕсли;
						СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.БазовыйПериодНачало;
						СтрокаРегистр.ОбособленноеПодразделение = Организация;
						СтрокаРегистр.Организация = Организация;
						СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
						НаборЗаписейОДоходах.Записать();
						
					КонецЕсли;
					
				КонецЦикла;
				//О.Т. Аверсон 09.12.2016 № 79
				
				
				//О.Т. Аверсон 20.06.2017 № 736 Не заходила на создание строки				
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//"ВЫБРАТЬ
				//|	РасчетЕСНОсновныеНачисления.ВидРасчета,
				//|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
				//|	РасчетЕСНОсновныеНачисления.Результат,
				//|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
				//|	РасчетЕСНОсновныеНачисления.НомерСтроки
				//|ИЗ
				//|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
				//|ГДЕ
				//|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
				//|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
				//|	И РасчетЕСНОсновныеНачисления.ВидРасчета = &ВидРасчета
				//|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало";
				//
				//Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
				//Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
				//Запрос.УстановитьПараметр("Ссылка", Ссылка);
				//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				//
				//МассивОсновныеНачисления = Запрос.Выполнить().Выгрузить();
				
				//Если МассивОсновныеНачисления.Количество()=0  Тогда 
				//О.Т. Аверсон 20.06.2017 № 736
				
				ЗапросВыгрузкаДаты = Новый Запрос;
				ЗапросВыгрузкаДаты.Текст = 
				"ВЫБРАТЬ
				|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
				|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
				|ИЗ
				|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
				|ГДЕ
				|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
				|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
				|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
				|	И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
				|	И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
				|	И НЕ(ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации)
				|
				|СГРУППИРОВАТЬ ПО
				|	ЕСНСведенияОДоходах.ФизЛицо,
				|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов";
				
				ЗапросВыгрузкаДаты.УстановитьПараметр("ВидРасч", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
				ЗапросВыгрузкаДаты.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				ЗапросВыгрузкаДаты.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
				ЗапросВыгрузкаДаты.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
				ЗапросВыгрузкаДаты.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				
				РезультВыгрузкаДаты = ЗапросВыгрузкаДаты.Выполнить().Выбрать();
				ПериодВзаиморасчетов = НачалоМесяца(ПериодРегистрации);
				Пока РезультВыгрузкаДаты.Следующий() Цикл
					ПериодВзаиморасчетов = РезультВыгрузкаДаты.ПериодВзаиморасчетов;
				КонецЦикла;
				
				
				если мСуммаПревышения <> 0 Тогда //О.Т. Аверсон 09.12.2016 № 79
					НоваяСтрокаОН = ОсновныеНачисления.Добавить();
					СтрокаОсновныхНачисленийСотрудник = ОсновныеНачисления.Найти(ДанныеДляРасчетаЕСН.ФизЛицо,"ФизЛицо");
					Если СтрокаОсновныхНачисленийСотрудник = Неопределено Тогда //О.Т. Аверсон 03.05.2019 № 4307
						СтрокаОсновныхНачисленийСотрудник = ДополнительныеНачисления.Найти(ДанныеДляРасчетаЕСН.ФизЛицо,"ФизЛицо");
					КонецЕсли;
					
					Если СтрокаОсновныхНачисленийСотрудник <> Неопределено Тогда //+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачисленийСотрудник);
						//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					Иначе
						НоваяСтрокаОН.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
					КонецЕсли; 
					//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					
					
					НоваяСтрокаОН.ПериодДействияНачало = ПериодВзаиморасчетов;
					НоваяСтрокаОН.ПериодДействияКонец = КонецМесяца(ПериодРегистрации);
					НоваяСтрокаОН.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни;
					НоваяСтрокаОН.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяФСЗН;
					НоваяСтрокаОН.ДоходФСЗН = Перечисления.ДоходыФСС_НС.Облагается;
					НоваяСтрокаОН.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
					НоваяСтрокаОН.Результат = -мСуммаПревышения; 
					СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
					СтрокаРегистр.Активность = Истина;
					ЗаполнитьЗначенияСвойств(СтрокаРегистр, НоваяСтрокаОН);
					СтрокаРегистр.Результат = НоваяСтрокаОН.Результат;
					если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
						СтрокаРегистр.Период = ПериодРегистрации;
					иначе
						
						СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
					КонецЕсли;
					СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.ПериодДействияНачало;
					СтрокаРегистр.ОбособленноеПодразделение = Организация;
					СтрокаРегистр.Организация = Организация;
					СтрокаРегистр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
					НаборЗаписейОДоходах.Записать();
					мСуммаПревышения = 0;
				КонецЕсли;
				//КонецЕсли;
				
				
				Если мСуммаПревышения <> 0 Тогда
					ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" ОШИБКА расчета ограничения !!!");
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		//О.Т. Аверсон 13.11.2015 № При изменении ср. зарплаты
		
		//О.Т. Аверсон 14.04.2018 № 1857
		Если БазаОграниченияФСЗН = 0 Тогда
			
			
			//Островская Татьяна 08.04.2014 № 17239
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетЕСНОсновныеНачисления.ВидРасчета,
			|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
			|	РасчетЕСНОсновныеНачисления.Результат,
			|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
			|	РасчетЕСНОсновныеНачисления.НомерСтроки
			|ИЗ
			|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
			|ГДЕ
			|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
			|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
			|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
			|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало";
			
			Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
			Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			
			ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
			//Островская Татьяна 08.04.2014 № 17239
			Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
				СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
				
				СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;// Поставила необлагается. Стояло почему-то Облагается. Решила что ошибка. Если что можно вернуть 
				СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
				
				для Каждого Запись из НаборЗаписейОДоходах Цикл 
					если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
						Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
						если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
							Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
						КонецЕсли;
					КонецЕсли;								
				КонецЦикла;
				НаборЗаписейОДоходах.Записать();											
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетЕСНОсновныеНачисления.ВидРасчета,
			|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
			|	РасчетЕСНОсновныеНачисления.Результат,
			|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН,
			|	РасчетЕСНОсновныеНачисления.НомерСтроки
			|ИЗ
			|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНОсновныеНачисления
			|ГДЕ
			|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
			|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
			|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
			|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &ПериодДействияНачало";
			
			Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
			Запрос.УстановитьПараметр("ПериодДействияНачало", ДанныеДляРасчетаЕСН.Месяц);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			
			ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
			Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
				СтрокаОсновныхНачислений = ДополнительныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239   				
				СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
				СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
				
				для Каждого Запись из НаборЗаписейОДоходах Цикл 
					если Запись.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо и Запись.Результат = СтрокаОсновныхНачислений.Результат и НачалоМесяца(Запись.ПериодВзаиморасчетов) = ДанныеДляРасчетаЕСН.Месяц и Запись.ВидРасчета = СтрокаОсновныхНачислений.ВидРасчета Тогда 
						Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
						если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
							Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
						КонецЕсли;
						
					КонецЕсли;								
				КонецЦикла;
				НаборЗаписейОДоходах.Записать(); 			
			КонецЦикла;
			
			
		КонецЕсли;
		//О.Т. Аверсон 14.04.2018 № 1857
		
	КонецЦикла;
	
	если ФизЛицаСОграниичением.Количество() > 0 Тогда 
		//НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
		//НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
		//НаборЗаписейОДоходах.Прочитать();
		для Каждого Запись из НаборЗаписейОДоходах Цикл 
			для Каждого стрСотр из ФизЛицаСОграниичением Цикл 
				если Запись.ФизЛицо = стрСотр.Значение Тогда 
					Запись.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
					если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда
						Запись.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		НаборЗаписейОДоходах.Записать();
	КонецЕсли;
	//Островская Татьяна 10.09.2013 № 16725
	НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
	НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
	НаборЗаписейОДоходах.Прочитать();
	
	//+ Ништ 14.01.2026 свфр-017472
	// Уже определено в начале процедуры
	//ДанныеДляРасч = ПолучитьДанныеРасчетаЕСН(ГоловнаяОрганизация,Пересчет); //О.Т. 13.02.2015 № 17778
	// Этот вызов комментируем т.к. обращения закомментированы, вызовем позже
	//ДанныеДляРасчетаЕСН = ДанныеДляРасч.Выбрать();
	//- Ништ 14.01.2026 свфр-017472
	
	//О.Т. 13.02.2015 № 17778
	если Пересчет Тогда 	
		ДанныеДляРасчДляМинусов = ПолучитьДанныеРасчетаЕСН(ГоловнаяОрганизация,ложь,Истина).Выгрузить();
	КонецЕсли;
	//О.Т. 13.02.2015 № 17778
	// очищаем табличную часть
	ИсчисленныйЕСН.Очистить();
	ИсчисленныйЕСНИтоги.Очистить();//О.Т. 16.02.2015 № 17778
	ИсчисленныйЕСНИтогиПоПроц.Очистить();//О.Т. Аверсон 18.04.2018 № 1870
	//Островская Татьяна 16.10.2013 № 16
	//НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
	//НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
	//НаборЗаписейОДоходах.Прочитать();
	//для Каждого стрНовЗаписи из НовыеЗаписиВРегистр Цикл 
	//	СтрокаРегистр = НаборЗаписейОДоходах.Добавить();
	//	СтрокаРегистр.Активность = Истина;
	//	ЗаполнитьЗначенияСвойств(СтрокаРегистр, стрНовЗаписи);
	//	//СтрокаРегистр.Результат = стрНовЗаписи.Результат;
	//	//СтрокаРегистр.Период = ДанныеДляРасчетаЕСН.Месяц;
	//	//СтрокаРегистр.ПериодВзаиморасчетов = НоваяСтрокаОН.БазовыйПериодНачало;
	//	//СтрокаРегистр.ОбособленноеПодразделение = Организация;
	//	//СтрокаРегистр.Организация = Организация;
	//	
	//	НаборЗаписейОДоходах.Записать();
	//КонецЦикла;
	//Островская Татьяна 16.10.2013 № 16
	
	//
	//Островская Татьяна 03.10.2013 № 16824
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
	|	РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ) КАК Период,
	//О.Т. 08.08.2014 № 17522
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
	|	РабочееВремяРаботниковОрганизаций.Сотрудник
	//О.Т. 08.08.2014 № 17522
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|   ГДЕ 
	|	ВЫБОР
	|			КОГДА &ФлагПоТабелю
	|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|   И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени) 
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо,
	|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ),
	|	РабочееВремяРаботниковОрганизаций.Сотрудник";
	//Запрос.УстановитьПараметр("Физлицо",ДанныеДляРасчетаЕСН.ФизЛицо);
	//Запрос.УстановитьПараметр("Период1",НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
	//Запрос.УстановитьПараметр("Период2",КонецМесяца(ДанныеДляРасчетаЕСН.Месяц)); 
	ТекстПоТабелю = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени)","");
	ЗапросДляТабеля = Новый Запрос;
	УчетнаяПолитикаЗапрос = Новый Запрос; //О.Т. 23.12.2014 № 
	УчетнаяПолитикаЗапрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
	УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
	если УчетнаяПолитика.Количество()>0 Тогда 
		Запрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
		ЗапросДляТабеля.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
	иначе
		Запрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
		ЗапросДляТабеля.УстановитьПараметр("ФлагПоТабелю",Ложь);
	КонецЕсли;
	
	РезТабель = Запрос.Выполнить().Выгрузить();
	
	
	ЗапросДляТабеля.Текст = ТекстПоТабелю;
	ВидИспользРВ = Новый СписокЗначений;
	ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	// О.Т. 20.11.2014 295
	//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные);
	//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Праздники);
	//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
	//ВидИспользРВ.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск); 
	// О.Т. 20.11.2014 295
	ЗапросДляТабеля.УстановитьПараметр("ВидИспользованияРабочегоВремени",ВидИспользРВ);
	РезТабельДля60 = ЗапросДляТабеля.Выполнить().Выгрузить();
	//Островская Татьяна 03.10.2013 № 16824
	
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	//// заполняем движения по регистру исчисленного ЕСН-ПФР
	//ТаблицаПрибСумм = Новый ТаблицаЗначений;
	//ТаблицаПрибСумм.Колонки.Добавить("ФизЛицо");
	//ТаблицаПрибСумм.Колонки.Добавить("ПериодВзаиморасчетов");//О.Т. 15.07.2014 № !!!
	//ТаблицаСтрахование = Новый ТаблицаЗначений;
	//ТаблицаСтрахование.Колонки.Добавить("ФизЛицо");
	//ТаблицаСтрахование.Колонки.Добавить("СуммаСтрах");
	//ТаблицаСтрахование.Колонки.Добавить("Месяц");
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
	
	//+ Ништ 14.01.2026 свфр-017472
	ДанныеДляРасчетаЕСН = ДанныеДляРасч.Выбрать();
	//- Ништ 14.01.2026 свфр-017472
	Пока ДанныеДляРасчетаЕСН.Следующий() Цикл
		ПроверкаСтроки = СпПересчетаПрошлМес.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ДанныеДляРасчетаЕСН.ФизЛицо,НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц)));
		//О.Т. 13.02.2015 № 17778
		если Пересчет Тогда 
			если не ДанныеДляРасчетаЕСН.Месяц > ПериодРегистрации Тогда 
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//О.Т. 13.02.2015 № 17778
		
		//О.Т. 08.08.2014 № 17522
		СотрудникОсн = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		СотрудникИзТЧОсн = ОсновныеНачисления.НайтиСтроки(ПараметрыОтбора);
		если СотрудникИзТЧОсн.Количество() > 0 Тогда 
			СотрудникОсн = СотрудникИзТЧОсн[0].Сотрудник;
		КонецЕсли;	
		если СотрудникОсн = Справочники.СотрудникиОрганизаций.ПустаяСсылка() Тогда 
			СотрудникИзТЧДоп = ДополнительныеНачисления.НайтиСтроки(ПараметрыОтбора);
			если СотрудникИзТЧДоп.Количество() > 0 Тогда 
				СотрудникОсн = СотрудникИзТЧДоп[0].Сотрудник;
			КонецЕсли;
		КонецЕсли;
		если СотрудникОсн = Справочники.СотрудникиОрганизаций.ПустаяСсылка() Тогда 
			СотрудникОсн = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ДанныеДляРасчетаЕСН.ФизЛицо.Наименование);
		КонецЕсли;
		//О.Т. 08.08.2014 № 17522
		Если СотрудникОсн.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
		иначе
			ВидНалогообложения = СотрудникОсн.ВидНалогообложенияОсновной;
		КонецЕсли;
		
		//О.Т. Аверсон 30.03.2016 № 950
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", КонецМесяца(ПериодРегистрации));
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", СотрудникОсн); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		СтавкаФСЗНИнд = 0;
		СтавкаБГСИнд = 0;
		СтавкаПенсионныйИнд = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			СтавкаФСЗНИнд = РезИндСтавкаНалогообл[0].ФСЗН;
			СтавкаБГСИнд = РезИндСтавкаНалогообл[0].БГС;
			СтавкаПенсионныйИнд = РезИндСтавкаНалогообл[0].ПенсионныйФонд;
		КонецЕсли;
		//О.Т. Аверсон 30.03.2016 № 950
		
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
		СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));
		СтруктураФСЗНИнвалиды = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения));
		СтруктураЕдиныйПлатеж = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж,ВидНалогообложения));
		СтруктураСтрах = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидНалогообложения",ГоловнаяОрганизация,ВидНалогообложения));
		
		Если ЕстьИндивидСтавка Тогда  //О.Т. Аверсон 30.03.2016 № 950
			СтавкаПенсионныйФонд = СтавкаПенсионныйИнд;
			СтавкаФСЗН = СтавкаФСЗНИнд;
			СтавкаФСЗНИнвалиды = СтавкаФСЗНИнд;
			СтавкаОбязательноеСтрахование = СтавкаБГСИнд;
		иначе
			
			Если СтруктураПенс.Количество()<>0 тогда
				СтавкаПенсионныйФонд = СтруктураПенс.Размер;
			Иначе
				Сообщить("Не заполнена ставка пенсионного фонда");
				СтавкаПенсионныйФонд = 0;
			КонецЕсли;
			
			Если СтруктураФСЗН.Количество()<>0 тогда
				СтавкаФСЗН = СтруктураФСЗН.Размер;
			Иначе
				Сообщить("Не заполнена ставка отчислений в ФСЗН");
				СтавкаФСЗН = 0;
			КонецЕсли;
			
			Если СтруктураФСЗНИнвалиды.Количество()<>0 тогда
				СтавкаФСЗНИнвалиды = СтруктураФСЗНИнвалиды.Размер;
			Иначе
				Сообщить("Не заполнена ставка отчислений в ФСЗН по инвалидам");
				СтавкаФСЗНИнвалиды = 0;
			КонецЕсли;
			
			Если СтруктураСтрах.Количество()<>0 тогда
				СтавкаОбязательноеСтрахование = СтруктураСтрах.Ставка;
			Иначе
				Сообщить("Не заполнена ставка обязательного страхования");
				СтавкаОбязательноеСтрахование = 0;
			КонецЕсли;
		КонецЕсли;
		Если СтруктураЕдиныйПлатеж.Количество()<>0 тогда
			СтавкаЕдиныйПлатеж = СтруктураЕдиныйПлатеж.Размер;
		Иначе
			Сообщить("Не заполнена ставка единого платежа");
			СтруктураЕдиныйПлатеж = 0;
		КонецЕсли;
		
		
		КонтрДата = Дата(2006,8,1);
		
		ЗапросОтчисления = Новый Запрос;
		ЗапросОтчисления.Текст = 
		"ВЫБРАТЬ
		|	СтавкиОтчисленийСФОТиЗП.ВидОтчисления,
		|	СтавкиОтчисленийСФОТиЗП.Размер
		|ИЗ
		|	РегистрСведений.СтавкиОтчисленийСФОТиЗП КАК СтавкиОтчисленийСФОТиЗП
		|ГДЕ
		|	СтавкиОтчисленийСФОТиЗП.Период = &Период
		|	И СтавкиОтчисленийСФОТиЗП.ВидОтчисления В(&ЗначенияОтчислений)
		|	И СтавкиОтчисленийСФОТиЗП.Организация = &Организация
		|	И СтавкиОтчисленийСФОТиЗП.ВидНалогообложения = &ВидНалогообложения";
		ЗначенияОтчислений = Новый СписокЗначений;
		ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд);
		ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН);
		ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды);
		ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж);
		ЗапросОтчисления.УстановитьПараметр("ЗначенияОтчислений", ЗначенияОтчислений);
		ЗапросОтчисления.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросОтчисления.УстановитьПараметр("Организация", Организация);
		ЗапросОтчисления.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		
		РезультатОтчисления = ЗапросОтчисления.Выполнить().Выбрать();
		//О.Т. Аверсон 30.03.2016 № 950
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", СотрудникОсн); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		СтавкаФСЗНИнд = 0;
		СтавкаБГСИнд = 0;
		СтавкаПенсионныйИнд = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			СтавкаФСЗНИнд = РезИндСтавкаНалогообл[0].ФСЗН;
			СтавкаБГСИнд = РезИндСтавкаНалогообл[0].БГС;
			СтавкаПенсионныйИнд = РезИндСтавкаНалогообл[0].ПенсионныйФонд;
		КонецЕсли;
		
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ПериодРегистрации-1);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", СотрудникОсн); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавкаПрошл = Ложь;
		СтавкаФСЗНИндПрошл = 0;
		СтавкаБГСИндПрошл = 0;
		СтавкаПенсионныйИндПрошл = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавкаПрошл = Истина;
			СтавкаФСЗНИндПрошл = РезИндСтавкаНалогообл[0].ФСЗН;
			СтавкаБГСИндПрошл = РезИндСтавкаНалогообл[0].БГС;
			СтавкаПенсионныйИндПрошл = РезИндСтавкаНалогообл[0].ПенсионныйФонд;
		КонецЕсли;
		
		//О.Т. Аверсон 30.03.2016 № 950
		ИзмененаСтавкаПенсионныйФонд = Ложь;
		ИзмененаСтавкаФСЗН = Ложь;
		ИзмененаСтавкаФСЗНИнвалиды = Ложь;
		ИзмененаСтавкаЕдиныйПлатеж = Ложь;
		Пока РезультатОтчисления.Следующий() Цикл
			если РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд  Тогда 
				СтавкаПенсПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
				если ?(ЕстьИндивидСтавкаПрошл,СтавкаПенсионныйИндПрошл,СтавкаПенсПрошл.Размер) <> ?(ЕстьИндивидСтавка,СтавкаПенсионныйИнд,РезультатОтчисления.Размер) Тогда 
					ИзмененаСтавкаПенсионныйФонд = Истина;
				иначе
					ИзмененаСтавкаПенсионныйФонд = Ложь;
				КонецЕсли;
			ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН Тогда
				СтавкаФСЗНПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));
				если ?(ЕстьИндивидСтавкаПрошл,СтавкаФСЗНИндПрошл,СтавкаФСЗНПрошл.Размер) <> ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,РезультатОтчисления.Размер) Тогда 
					ИзмененаСтавкаФСЗН = Истина;
				иначе
					ИзмененаСтавкаФСЗН = Ложь;
				КонецЕсли;
			ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды Тогда
				СтавкаФСЗНИнвалидыПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения));
				если ?(ЕстьИндивидСтавкаПрошл,СтавкаФСЗНИндПрошл,СтавкаФСЗНИнвалидыПрошл.Размер) <> ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,РезультатОтчисления.Размер) Тогда 
					ИзмененаСтавкаФСЗНИнвалиды = Истина;
				иначе
					ИзмененаСтавкаФСЗНИнвалиды = Ложь;
				КонецЕсли;
			ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж Тогда
				СтавкаЕдиныйПлатежПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж,ВидНалогообложения));
				если СтавкаЕдиныйПлатежПрошл.Размер <> РезультатОтчисления.Размер Тогда 
					ИзмененаСтавкаЕдиныйПлатеж = Истина;
				иначе
					ИзмененаСтавкаЕдиныйПлатеж = Ложь;
				КонецЕсли;			
			КонецЕсли;	
		КонецЦикла;
		ЗапросОтчисленияСтрах = Новый Запрос;
		ЗапросОтчисленияСтрах.Текст = 
		"ВЫБРАТЬ
		|	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.Ставка
		|ИЗ
		|	РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&Период, Организация = &Организация) КАК СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних
		|ГДЕ
		|	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.ВидНалогообложения = &ВидНалогообложения";
		ЗапросОтчисленияСтрах.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросОтчисленияСтрах.УстановитьПараметр("Организация", Организация);
		ЗапросОтчисленияСтрах.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		
		РезультатОтчисленияСтрах = ЗапросОтчисленияСтрах.Выполнить().Выбрать();
		ИзмененаСтавкаОбязательноеСтрахование = Ложь;
		Пока РезультатОтчисления.Следующий() Цикл
			СтавкаСтрахованиеПрошл = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидНалогообложения",Организация,ВидНалогообложения));
			если ?(ЕстьИндивидСтавкаПрошл,СтавкаБГСИндПрошл,СтавкаСтрахованиеПрошл.Размер) <> ?(ЕстьИндивидСтавка,СтавкаБГСИнд,РезультатОтчисления.Размер) Тогда 
				ИзмененаСтавкаОбязательноеСтрахование = Истина;
			иначе
				ИзмененаСтавкаОбязательноеСтрахование = Ложь;
			КонецЕсли;		
		КонецЦикла;
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//толик надо учитывать и предыдущие месяца
		//если ИзмененаСтавкаОбязательноеСтрахование или ИзмененаСтавкаЕдиныйПлатеж или ИзмененаСтавкаФСЗНИнвалиды или ИзмененаСтавкаФСЗН или ИзмененаСтавкаПенсионныйФонд Тогда
		//	ТаблицаДопСумм = Новый ТаблицаЗначений;
		//	ТаблицаДопСумм.Колонки.Добавить("ФизЛицо");
		//	ТаблицаДопСумм.Колонки.Добавить("ФондФСЗН");
		//	ТаблицаДопСумм.Колонки.Добавить("ФондСтрахование");
		//	ТаблицаДопСумм.Колонки.Добавить("ПериодВзаиморасчетов");
		//иначе
		//	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
		//	ЗапросИзПредМес = Новый Запрос;
		//	ЗапросИзПредМес.Текст = 
		//	"ВЫБРАТЬ
		//	|	РасчетЕСНИсчисленныйЕСН.ФизЛицо,
		//	|	СУММА(ВЫБОР
		//	|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондФСЗН / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондФСЗН
		//	|		КОНЕЦ) КАК ФондФСЗН,
		//	|	СУММА(ВЫБОР
		//	|			КОГДА РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|					И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &Период >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|				ТОГДА ВЫРАЗИТЬ(РасчетЕСНИсчисленныйЕСН.ФондСтрахование / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|			ИНАЧЕ РасчетЕСНИсчисленныйЕСН.ФондСтрахование
		//	|		КОНЕЦ) КАК ФондСтрахование,
		//	|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов
		//	|ИЗ
		//	|	Документ.РасчетЕСН.ИсчисленныйЕСН КАК РасчетЕСНИсчисленныйЕСН
		//	|ГДЕ
		//	|	РасчетЕСНИсчисленныйЕСН.Ссылка.Проведен
		//	|	И НАЧАЛОПЕРИОДА(РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		//	|	И РасчетЕСНИсчисленныйЕСН.Ссылка <> &ДокументСсылка
		//	//+ СВЭЙ КДЯ 11.11.19 СВФР-005037
		//	|	И НЕ &ПодразделениеЗаполнено
		//	//- СВЭЙ КДЯ 11.11.19 СВФР-005037
		//	|	И РасчетЕСНИсчисленныйЕСН.ФизЛицо = &ФизЛицо
		//	|	И РасчетЕСНИсчисленныйЕСН.Ссылка.Организация = &Организация
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	РасчетЕСНИсчисленныйЕСН.ФизЛицо,
		//	|	РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов";
		//	ЗапросИзПредМес.УстановитьПараметр("Период", ПериодРегистрации);
		//	ЗапросИзПредМес.УстановитьПараметр("Организация", Организация);//О.Т. Аверсон 22.06.2018 № 2118
		//	ЗапросИзПредМес.УстановитьПараметр("ДокументСсылка", Ссылка);
		//	ЗапросИзПредМес.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//	//+ СВЭЙ КДЯ 11.11.19 СВФР-005037
		//	ЗапросИзПредМес.УстановитьПараметр( "ПодразделениеЗаполнено", ЗначениеЗаполнено( ПодразделениеОрганизации ) );
		//	//- СВЭЙ КДЯ 11.11.19 СВФР-005037
		//	ТаблицаДопСумм = ЗапросИзПредМес.Выполнить().Выгрузить();
		//КонецЕсли;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//О.Т. Аверсон 30.03.2016 № 950
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалогообложения = &ВидНалогообложения
		|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", СотрудникОсн); 
		РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		ЕстьИндивидСтавка = Ложь;
		СтавкаФСЗНИнд = 0;
		СтавкаБГСИнд = 0;
		СтавкаПенсионныйИнд = 0;
		Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
			ЕстьИндивидСтавка = Истина;
			СтавкаФСЗНИнд = РезИндСтавкаНалогообл[0].ФСЗН;
			СтавкаБГСИнд = РезИндСтавкаНалогообл[0].БГС;
			СтавкаПенсионныйИнд = РезИндСтавкаНалогообл[0].ПенсионныйФонд;
		КонецЕсли;
		//О.Т. Аверсон 30.03.2016 № 950
		
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
		СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));
		СтруктураФСЗНИнвалиды = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения));
		СтруктураЕдиныйПлатеж = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж,ВидНалогообложения));
		СтруктураСтрах = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидНалогообложения",ГоловнаяОрганизация,ВидНалогообложения));//О.Т. Аверсон 09.02.2016 № 876
		
		Если ЕстьИндивидСтавка Тогда  //О.Т. Аверсон 30.03.2016 № 950
			СтавкаПенсионныйФонд = СтавкаПенсионныйИнд;
			СтавкаФСЗН = СтавкаФСЗНИнд;
			СтавкаФСЗНИнвалиды = СтавкаФСЗНИнд;
			СтавкаОбязательноеСтрахование = СтавкаБГСИнд;
		иначе
			
			Если СтруктураПенс.Количество()<>0 тогда
				СтавкаПенсионныйФонд = СтруктураПенс.Размер;
			Иначе
				СтавкаПенсионныйФонд = 0;
			КонецЕсли;
			
			Если СтруктураФСЗН.Количество()<>0 тогда
				СтавкаФСЗН = СтруктураФСЗН.Размер;
			Иначе
				СтавкаФСЗН = 0;
			КонецЕсли;
			
			Если СтруктураФСЗНИнвалиды.Количество()<>0 тогда
				СтавкаФСЗНИнвалиды = СтруктураФСЗНИнвалиды.Размер;
			Иначе
				СтавкаФСЗНИнвалиды = 0;
			КонецЕсли;
			
			Если СтруктураСтрах.Количество()<>0 тогда
				СтавкаОбязательноеСтрахование = СтруктураСтрах.Ставка;
			Иначе
				СтавкаОбязательноеСтрахование = 0;
			КонецЕсли;
		КонецЕсли;
		Если СтруктураЕдиныйПлатеж.Количество()<>0 тогда
			СтавкаЕдиныйПлатеж = СтруктураЕдиныйПлатеж.Размер;
		Иначе
			СтруктураЕдиныйПлатеж = 0;
		КонецЕсли;
		
		// Пропустим нулевые строки
		Если ДанныеДляРасчетаЕСН.ПенсионныйФонд = 0 И ДанныеДляРасчетаЕСН.НачисленныйФСЗН = 0 
			И ДанныеДляРасчетаЕСН.начисленныйСтрах = 0 И ДанныеДляРасчетаЕСН.НачисленныйЕдиныйПлатеж = 0 
			И ДанныеДляРасчетаЕСН.БазаДоходФСЗН = 0 И ДанныеДляРасчетаЕСН.БазаДоходСтрах = 0
			И ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж = 0
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			//и ТаблицаДопСумм.Количество() = 0
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			Тогда            
			Продолжить;
		КонецЕсли; 
		
		Если ЕстьИндивидСтавка И (СтавкаФСЗН = 0 ИЛИ СтавкаОбязательноеСтрахование = 0) Тогда
			Тт = ?(СтавкаФСЗН = 0 ИЛИ СтавкаОбязательноеСтрахование = 0,"ставки ФСЗН и БГС",?(СтавкаФСЗН = 0,"ставка ФСЗН","ставка БГС"));
			ОбщегоНазначения.СообщитьОбОшибке(СокрЛП(ДанныеДляРасчетаЕСН.ФизЛицо) + " в регистре сведений ""Иное налогообложение по сотрудникам"" " + Тт + " = 0 на " + Формат(?(не ЗначениеЗаполнено(ДанныеДляРасчетаЕСН.Месяц), ПериодРегистрации, ДанныеДляРасчетаЕСН.Месяц),"ДЛФ=Д"));
		КонецЕсли;
		
		// табличная часть
		НоваяСтрока = ИсчисленныйЕСН.Добавить();
		НоваяСтрокаИтог = ИсчисленныйЕСНИтоги.Добавить(); //О.Т. 16.02.2015 № 17778
		НоваяСтрокаИтогПоПроц = ИсчисленныйЕСНИтогиПоПроц.Добавить();//О.Т. Аверсон 18.04.2018 № 1870
		
		НоваяСтрока.Физлицо = ДанныеДляРасчетаЕСН.ФизЛицо;
		//НоваяСтрока.Организация = ГоловнаяОрганизация;
		//НоваяСтрока.ОбособленноеПодразделение = Организация;
		
		ВеличинаПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;       
		РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		
		ПериодРасчета                     = ?(не ЗначениеЗаполнено(ДанныеДляРасчетаЕСН.Месяц), ПериодРегистрации, ДанныеДляРасчетаЕСН.Месяц);
		НоваяСтрока.периодВзаиморасчетов = ПериодРасчета;
		
		//О.Т. 12.05.2015 № 428
		НеПравоНаПенсию = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст  = 
		"ВЫБРАТЬ
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
		|	ГражданствоФизЛицСрезПоследних.Страна,
		|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию
		|ИЗ
		|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&Период, ) КАК ГражданствоФизЛицСрезПоследних
		|ГДЕ
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо = &ФизЛицо
		|	И ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию = ИСТИНА";
		Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		Запрос.УстановитьПараметр("Период", ДанныеДляРасчетаЕСН.Месяц);//О.Т. 06.04.2015
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			
			НеПравоНаПенсию =	Выборка.НеИмеетПравоНаПенсию;
			
		КонецЦикла;
		
		//О.Т. 27.04.2015 № 415
		ЗапросГр = Новый Запрос;
		ЗапросГр.Текст = 
		"ВЫБРАТЬ
		|	ГражданствоФизЛицСрезПоследних.Страна.УчастникЕАЭС КАК УчастникЕАЭС,
		|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка
		|ИЗ
		|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&Период, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних";
		
		ЗапросГр.УстановитьПараметр("Период", ДанныеДляРасчетаЕСН.Месяц);
		ЗапросГр.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		РезультатЗапросаГр = ЗапросГр.Выполнить();		
		ВыборкаДетальныеЗаписиГр = РезультатЗапросаГр.Выбрать();	
		ФлагУчастникЕАЭС = Ложь;
		ЗначениеИнойСтавки = 0;
		Пока ВыборкаДетальныеЗаписиГр.Следующий() Цикл
			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
			//ФлагУчастникЕАЭС = ?(ВыборкаДетальныеЗаписиГр.УчастникЕАЭС = NULL, Ложь,ВыборкаДетальныеЗаписиГр.УчастникЕАЭС);
			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
			ФлагУчастникЕАЭС = ?( ЗначениеЗаполнено( ВыборкаДетальныеЗаписиГр.УчастникЕАЭС ), ВыборкаДетальныеЗаписиГр.УчастникЕАЭС , Ложь );
			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
			ЗначениеИнойСтавки = ВыборкаДетальныеЗаписиГр.ИнаяСтавка;
		КонецЦикла;
		Если ЕстьИндивидСтавка Тогда
			НоваяСтрока.ПроцентФСЗН = СтавкаФСЗНИнд;
		иначе
			
			если (ФлагУчастникЕАЭС и НеПравоНаПенсию) Тогда 
				НоваяСтрока.ПроцентФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ДанныеДляРасчетаЕСН.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения)).Размер;
			ИначеЕсли (ФлагУчастникЕАЭС и не НеПравоНаПенсию) или (ФлагУчастникЕАЭС = Ложь и НеПравоНаПенсию = Ложь) Тогда
				НоваяСтрока.ПроцентФСЗН = ?(ПериодРасчета >= КонтрДата, 
				?(ДанныеДляРасчетаЕСН.Группа = 0, СтавкаФСЗН, СтавкаФСЗНИнвалиды),
				СтавкаФСЗН);   
			КонецЕсли; 
			Если ЗначениеИнойСтавки > 0 Тогда 
				
				//Аверсон 03.10.2022 КВВ СВФР-009604 (
				Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН > 0 
					И НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < НачалоМесяца(ПериодРегистрации) Тогда 
					Мес = 0;
					ОбщегоНазначения.РазобратьРазностьДат(НачалоМесяца(ПериодРегистрации),НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц),,Мес);
					Если Мес > 1 Тогда
						ПроцентРаботникаДП = РегистрыСведений.ДополнительнаяПенсияРаботодательРаботник.ПолучитьПоследнее(ДанныеДляРасчетаЕСН.Месяц,Новый Структура("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо)).ПроцентРаботника;
						Если ПроцентРаботникаДП <> 0 Тогда
							ЗначениеИнойСтавки = НоваяСтрока.ПроцентФСЗН;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//Аверсон 03.10.2022 КВВ СВФР-009604 )
				
				НоваяСтрока.ПроцентФСЗН = ЗначениеИнойСтавки;
			КонецЕсли;
		КонецЕсли;
		//О.Т. 12.05.2015 № 428
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
		////О.Т. 27.04.2015 № 415
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|	ВЫБОР
		//|		КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL 
		//|			ТОГДА 35
		//|		ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
		//|	КОНЕЦ КАК ПроцентФСЗН,
		//|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		//|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
		//|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		//|ИЗ
		//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|ГДЕ
		//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
		//|	И ЕСНИсчисленный.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
		////	|	И ЕСНИсчисленный.ПериодВзаиморасчетов > &парамКонецМесяцаПериодаРегистрации //О.Т. 14.07.2014 № 120
		//|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНаМесяцНач И &ПериодВзаиморасчетовНаМесяцКон";//О.Т. 01.07.2014 № 67
		//
		//Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
		////О.Т. 01.07.2014 № 67
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцНач", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцКон", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		////О.Т. 01.07.2014 № 67
		//Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//
		//
		//Результат = Запрос.Выполнить();
		//
		//ВыборкаДетальныеЗаписи = Результат.Выбрать();
		//СуммаПенсионныйПоПериоду = 0;
		//СуммаОбСтрахованиеПоПериоду = 0;
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	если Месяц(ДанныеДляРасчетаЕСН.Месяц) <> Месяц(ПериодРегистрации) Тогда 
		//		СуммаПенсионныйПоПериоду = СуммаПенсионныйПоПериоду + ВыборкаДетальныеЗаписи.ПенсионныйФонд; //О.Т. 24.06.2014 № 67
		//		СуммаОбСтрахованиеПоПериоду = СуммаОбСтрахованиеПоПериоду + ВыборкаДетальныеЗаписи.ОбязательноеСтрахование;//О.Т. 24.06.2014 № 67
		//	КонецЕсли;
		//КонецЦикла;
		//
		////О.Т. 16.09.2014 № 222
		//БазаФСЗНПрошлогоМес = 0;
		//БазаСтрахПрошлогоМес = 0;
		//ПенсионныйПрошлогоМес = 0;
		//ФСЗНПрошлогоМес = 0;
		//СтрахПрошлогоМес = 0;
		//БазаФСЗНПрошлогоМесПроверка = 0;
		//БазаФСЗНПрошлогоМесПроверка1 = 0;
		//
		//ПенсионныйПоПрошлМесБудПериода = 0;
		
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК БазаПрошл,
		//|	СУММА(Основные.Результат + Дополнительные.Результат) КАК БазаПрошлПоРегистрации
		//|ИЗ
		//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах,
		//|	(ВЫБРАТЬ
		//|		СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
		//|	ИЗ
		//|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|	ГДЕ
		//|		ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1) КАК Основные,
		//|	(ВЫБРАТЬ
		//|		СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
		//|	ИЗ
		//|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		//|	ГДЕ
		//|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		//|		И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//|		И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1) КАК Дополнительные
		//|ГДЕ
		//|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//|	И ЕСНСведенияОДоходах.Организация = &Организация";
		//
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("Организация", Организация);
		//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//РезультатБаза = Запрос.Выполнить().Выбрать();
		//пока РезультатБаза.Следующий() Цикл
		//	БазаПрошл = РезультатБаза.БазаПрошл;
		//	БазаПрошлПоРегистрации = РезультатБаза.БазаПрошлПоРегистрации;
		//КонецЦикла;
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 8
		//БазаФСЗНПрошлыхПериодов = 0;
		//БазаБГСПрошлыхПериодов = 0;
		////- СВЭЙ КДЯ 10.03.20 СВФР-005656
		
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации Тогда 
		//	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ВЫБОР
		//	|						КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|							ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|						ИНАЧЕ ЕСНСведенияОДоходах.Результат
		//	|					КОНЕЦ
		//	|		КОНЕЦ) КАК ДоходФСЗН,
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходСтрах = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ВЫБОР
		//	|						КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|							ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|						ИНАЧЕ ЕСНСведенияОДоходах.Результат
		//	|					КОНЕЦ
		//	|		КОНЕЦ) КАК ДоходСтрах,
		//	|	ВложенныйЗапрос.ФСЗН КАК ФСЗН,
		//	|	ВложенныйЗапрос.ПенсионныйФонд КАК ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		//	|ИЗ
		//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах,
		//	|	(ВЫБРАТЬ
		//	|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//	|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	|		СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК ОбязательноеСтрахование
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//	|	ГДЕ
		//	|		ЕСНИсчисленный.Организация = &Организация
		//	|		И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		//	|		И ЕСНИсчисленный.Регистратор <> &Регистратор
		//	|		И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 5
		//	//|		И ЕСНИсчисленный.Период <> &ПериодРегистрации
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 5
		//	|		И ЕСНИсчисленный.Период < &ПериодРегистрации
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	|	) КАК ВложенныйЗапрос
		//	|ГДЕ
		//	|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//	|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|	И ЕСНСведенияОДоходах.Организация = &Организация
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 5
		//	|	И ЕСНСведенияОДоходах.Период < &ПериодРегистрации
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование,
		//	|	ВложенныйЗапрос.ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ФСЗН";
		//	
		//	Запрос.УстановитьПараметр("Организация", Организация);
		//	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//	Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//	
		//	РезПрошлогоМесяца = Запрос.Выполнить().Выбрать();
		//	ПроверкаСтроки = СпПересчетаПрошлМес.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ДанныеДляРасчетаЕСН.ФизЛицо,НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц)));
		//	Пока РезПрошлогоМесяца.Следующий() Цикл
		//		
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//БазаФСЗНПрошлогоМес = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//		//БазаСтрахПрошлогоМес = ?(РезПрошлогоМесяца.ДоходСтрах = null,0,РезПрошлогоМесяца.ДоходСтрах);
		//		//ПенсионныйПрошлогоМес = ?(РезПрошлогоМесяца.ПенсионныйФонд = null,0,РезПрошлогоМесяца.ПенсионныйФонд);
		//		//ФСЗНПрошлогоМес = ?(РезПрошлогоМесяца.ФСЗН = null,0,РезПрошлогоМесяца.ФСЗН);
		//		//СтрахПрошлогоМес = ?(РезПрошлогоМесяца.ОбязательноеСтрахование = null,0,РезПрошлогоМесяца.ОбязательноеСтрахование);
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		БазаФСЗНПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН , 0 );
		//		БазаСтрахПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходСтрах ), РезПрошлогоМесяца.ДоходСтрах , 0);
		//		ПенсионныйПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ПенсионныйФонд ), РезПрошлогоМесяца.ПенсионныйФонд , 0 );
		//		ФСЗНПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ФСЗН ), РезПрошлогоМесяца.ФСЗН , 0 );
		//		СтрахПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ОбязательноеСтрахование ), РезПрошлогоМесяца.ОбязательноеСтрахование , 0 );
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		
		//		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 8
		//		БазаФСЗНПрошлыхПериодов = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН, 0 );
		//		БазаБГСПрошлыхПериодов = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходСтрах ), РезПрошлогоМесяца.ДоходСтрах, 0 );
		//		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//		
		//		Если ПроверкаСтроки.Количество()> 0 Тогда 
		//			БазаФСЗНПрошлогоМесПроверка = 0;
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//БазаФСЗНПрошлогоМесПроверка1 = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			БазаФСЗНПрошлогоМесПроверка1 = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН, 0 );
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		иначе
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//БазаФСЗНПрошлогоМесПроверка = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//			//БазаФСЗНПрошлогоМесПроверка1 = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			БазаФСЗНПрошлогоМесПроверка = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН, 0 );
		//			БазаФСЗНПрошлогоМесПроверка1 = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН , 0 );
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			БазаФСЗНПрошлогоМес = 0;
		//			БазаСтрахПрошлогоМес = 0;
		//			ПенсионныйПрошлогоМес = 0;
		//			ФСЗНПрошлогоМес = 0;
		//			СтрахПрошлогоМес = 0;	
		//		КонецЕсли;
		//	КонецЦикла;
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	//если ДанныеДляРасчетаЕСН.БазаДоходСтрах + БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН и не БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН Тогда  //или ДанныеДляРасчетаЕСН.БазаДоходСтрах < 0
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//	если ДанныеДляРасчетаЕСН.БазаДоходСтрах > БазаОграниченияФСЗН и не БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН Тогда  //или ДанныеДляРасчетаЕСН.БазаДоходСтрах < 0
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//		Если ПроверкаСтроки.Количество()> 0 Тогда 
		//			БазаФСЗНПрошлогоМесПроверка = 0;
		//		иначе
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//БазаФСЗНПрошлогоМесПроверка = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//			БазаФСЗНПрошлогоМесПроверка = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН, 0 );
		//			//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		КонецЕсли;
		//		БазаФСЗНПрошлогоМес = 0;
		//		
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//БазаФСЗНПрошлогоМесПроверка1 = ?(РезПрошлогоМесяца.ДоходФСЗН = null,0,РезПрошлогоМесяца.ДоходФСЗН);
		//		//БазаСтрахПрошлогоМес = ?(РезПрошлогоМесяца.ДоходСтрах = null,0,РезПрошлогоМесяца.ДоходСтрах);
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		БазаФСЗНПрошлогоМесПроверка1 = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходФСЗН ), РезПрошлогоМесяца.ДоходФСЗН, 0 );
		//		БазаСтрахПрошлогоМес = ?( ЗначениеЗаполнено( РезПрошлогоМесяца.ДоходСтрах ), РезПрошлогоМесяца.ДоходСтрах , 0 );
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		
		//		// О.Т. 30.10.2014 264
		//		//ПенсионныйПрошлогоМес = 0;
		//		//ФСЗНПрошлогоМес = 0;
		//		//СтрахПрошлогоМес = 0;     
		//		// О.Т. 30.10.2014 264
		//	КонецЕсли;
		//	если ПроверкаСтроки.Количество()>0 Тогда 
		//		ЗаписьОтрицат = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Отриц),ПроверкаСтроки[0].Отриц,0);
		//		ЗаписьПревышение = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Превышение),ПроверкаСтроки[0].Превышение,0);
		//	иначе
		//		ЗаписьОтрицат = 0;
		//		ЗаписьПревышение = 0;
		//	КонецЕсли;
		//	
		//	если ЗаписьОтрицат >0 и ЗаписьПревышение > 0 Тогда
		//		БазаФСЗНПрошлогоМес = 0;
		//		БазаСтрахПрошлогоМес = 0;
		//		ПенсионныйПрошлогоМес = 0;
		//		ФСЗНПрошлогоМес = 0;
		//		СтрахПрошлогоМес = 0;
		//	КонецЕсли;
		//	
		//	
		//КонецЕсли;
		
		////О.Т. Аверсон 28.06.2017 № 776
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) > ПериодРегистрации Тогда
		//	
		//	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ВЫБОР
		//	|						КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|							ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|						ИНАЧЕ ЕСНСведенияОДоходах.Результат
		//	|					КОНЕЦ
		//	|		КОНЕЦ) КАК ДоходФСЗН,
		//	|	СУММА(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ДоходСтрах = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//	|				ТОГДА ВЫБОР
		//	|						КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|								И &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//	|							ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		//	|						ИНАЧЕ ЕСНСведенияОДоходах.Результат
		//	|					КОНЕЦ
		//	|		КОНЕЦ) КАК ДоходСтрах,
		//	|	ВложенныйЗапрос.ФСЗН КАК ФСЗН,
		//	|	ВложенныйЗапрос.ПенсионныйФонд КАК ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		//	|ИЗ
		//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах,
		//	|	(ВЫБРАТЬ
		//	|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//	|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	|		СУММА(ЕСНИсчисленный.ОбязательноеСтрахование) КАК ОбязательноеСтрахование
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//	|	ГДЕ
		//	|		ЕСНИсчисленный.Организация = &Организация
		//	|		И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		//	|		И ЕСНИсчисленный.Регистратор <> &Регистратор
		//	|		И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	|		И ЕСНИсчисленный.Период <> &ПериодРегистрации) КАК ВложенныйЗапрос
		//	|ГДЕ
		//	|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//	|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//	|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|	И ЕСНСведенияОДоходах.Организация = &Организация
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ВложенныйЗапрос.ОбязательноеСтрахование,
		//	|	ВложенныйЗапрос.ПенсионныйФонд,
		//	|	ВложенныйЗапрос.ФСЗН";
		//	
		//	Запрос.УстановитьПараметр("Организация", Организация);
		//	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//	Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//	Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//	
		//	РезПоПрошлымМесяцам = Запрос.Выполнить().Выбрать();
		//	
		//	Пока РезПоПрошлымМесяцам.Следующий() Цикл
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//ПенсионныйПоПрошлМесБудПериода = ?(РезПоПрошлымМесяцам.ПенсионныйФонд = null,0,РезПоПрошлымМесяцам.ПенсионныйФонд);
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//		ПенсионныйПоПрошлМесБудПериода = ?( ЗначениеЗаполнено( РезПоПрошлымМесяцам.ПенсионныйФонд ), РезПоПрошлымМесяцам.ПенсионныйФонд , 0 );
		//		//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
		////О.Т. Аверсон 28.06.2017 № 776
		//ЗапросНеОбл = Новый Запрос;
		//ЗапросНеОбл.Текст = 
		//"ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.НеОблагается)
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК ДоходФСЗН
		//|ИЗ
		//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|ГДЕ
		//|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		//|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//|	И ЕСНСведенияОДоходах.Организация = &Организация";
		//
		//ЗапросНеОбл.УстановитьПараметр("Организация", Организация);
		//ЗапросНеОбл.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//ЗапросНеОбл.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//ЗапросНеОбл.УстановитьПараметр("Регистратор", Ссылка);
		//ЗапросНеОбл.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//РезультатНеОблагается = ЗапросНеОбл.Выполнить().Выбрать();
		//СуммаНеОблагаемая = 0;
		//Пока РезультатНеОблагается.Следующий() Цикл
		//	//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//	//СуммаНеОблагаемая = СуммаНеОблагаемая + ?(РезультатНеОблагается.ДоходФСЗН = Null,0,РезультатНеОблагается.ДоходФСЗН);
		//	//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//	//+ СВЭЙ КДЯ 12.02.20 СВФР-005505
		//	СуммаНеОблагаемая = СуммаНеОблагаемая + ?( ЗначениеЗаполнено( РезультатНеОблагается.ДоходФСЗН ), РезультатНеОблагается.ДоходФСЗН , 0 );
		//	//- СВЭЙ КДЯ 12.02.20 СВФР-005505
		//КонецЦикла;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		
		//О.Т. 16.09.2014 № 222
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////О.Т. Аверсон 26.09.2018 № 2476 сделала как в начсилении зп
		//СуммаУжеНачислПенс = 0;
		////если ПенсФондБудМес = 1 тогда
		//ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//|	ВЫБОР КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//|			И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0) и &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		//|		ТОГДА ВЫРАЗИТЬ(ЕСНИсчисленный.ПенсионныйФонд / 10000 КАК ЧИСЛО(10, "+ЗначениеОкругления+"))
		//|	ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд
		//|   КОНЕЦ КАК ПенсионныйФонд
		//|ИЗ
		//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|ГДЕ
		//|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
		//|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНаМесяцНач И &ПериодВзаиморасчетовНаМесяцКон
		//|	И ЕСНИсчисленный.ПериодВзаиморасчетов <> &ПериодРегистрации
		//|	И ЕСНИсчисленный.Период <> &ПериодРегистрации";
		//
		//Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцНач", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцКон", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//РезУжеНачисленный = Запрос.Выполнить().Выбрать();
		//Пока РезУжеНачисленный.Следующий() Цикл 
		//	СуммаУжеНачислПенс = СуммаУжеНачислПенс + РезУжеНачисленный.ПенсионныйФонд;
		//КонецЦикла;
		////КонецЕсли;
		////О.Т. 15.09.2014 № 17594
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////О.Т. 18.12.2014 № 17744
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	БазаДляНачислений.ФизЛицо КАК ФизЛицо,
		//|	БазаДляНачислений.Месяц КАК Месяц,
		//|	СУММА(БазаДляНачислений.БазаДоходФСЗН) КАК БазаДоходФСЗН
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		Основная.ФизЛицо КАК ФизЛицо,
		//|		Основная.Месяц КАК Месяц,
		//|		ВЫБОР
		//|			КОГДА Основная.ДоходФСЗН = &парамПодлежитОбложению
		//|				ТОГДА Основная.ОблагаемыйДоход
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК БазаДоходФСЗН,
		//|		ВЫБОР
		//|			КОГДА Основная.ДоходСтрах = &парамПодлежитОбложению
		//|				ТОГДА Основная.ОблагаемыйДоход
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК БазаДоходСтрах,
		//|		ВЫБОР
		//|			КОГДА Основная.доходЕдиныйПлатеж = &парамПодлежитОбложению
		//|				ТОГДА Основная.ОблагаемыйДоход
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК БазаДоходЕдиныйПлатеж
		//|	ИЗ
		//|		(ВЫБРАТЬ
		//|			ЕСННачисления.ФизЛицо КАК ФизЛицо,
		//|			ЕСННачисления.Месяц КАК Месяц,
		//|			ЕСННачисления.ДоходФСЗН КАК ДоходФСЗН,
		//|			ЕСННачисления.ДоходСтрах КАК ДоходСтрах,
		//|			ЕСННачисления.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//|			ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
		//|		ИЗ
		//|			(ВЫБРАТЬ
		//|				ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//|				ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
		//|				ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
		//|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//|				ЕСНСведенияОДоходах.Результат КАК ОблагаемыйДоход
		//|			ИЗ
		//|				РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|			ГДЕ
		////	|				Выбор когда ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета тогда ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации иначе Истина конец //Условие на отпуск. было пересечение с первым запросом  //Аверсон 13.01.2020 КВВ СВФР-005310 (закомментировано)
		////	|				И 
		////Аверсон 09.02.2020 КВВ СВФР-005488 (
		//|			ВЫБОР КОГДА &парамНачалоМесяцаПериодаРегистрации = &ПериодРегистрации ТОГДА
		//|			Выбор когда ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета тогда ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации иначе Истина конец
		//|			ИНАЧЕ ИСТИНА КОНЕЦ  И
		////Аверсон 09.02.2020 КВВ СВФР-005488 )
		//|				ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
		//|				И ЕСНСведенияОДоходах.ОбособленноеПодразделение В(&СписокВсехПодразделенийОрганизации)
		//|				И НЕ(ЕСНСведенияОДоходах.Период МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1)
		//|				И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <> &ПериодРегистрации) КАК ЕСННачисления
		//|		ГДЕ
		//|			ЕСННачисления.ФизЛицо = &ФизЛицо) КАК Основная) КАК БазаДляНачислений
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	БазаДляНачислений.ФизЛицо,
		//|	БазаДляНачислений.Месяц";
		//Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		//Запрос.УстановитьПараметр("парамПодлежитОбложению", Перечисления.ДоходыФСС_НС.Облагается);
		//СписокВсехПодразделенийОрганизации = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
		//СписокВсехПодразделенийОрганизации.Добавить(Организация);
		//Запрос.УстановитьПараметр("СписокВсехПодразделенийОрганизации", СписокВсехПодразделенийОрганизации);
		//Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
		//Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(ПериодРегистрации));
		//Запрос.УстановитьПараметр("СпособРасчета", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням);
		//
		//РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		//СуммаБазаДрПериод = 0;
		//Пока РезультатЗапроса.Следующий() Цикл
		//	СуммаБазаДрПериод = СуммаБазаДрПериод + РезультатЗапроса.БазаДоходФСЗН;
		//КонецЦикла;
		////О.Т. Аверсон 26.09.2018 № 2476 сделала как в начислении зп
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////толик переделал расчет ограничения //, а васик не согласился                
		//мПревышенияОграничения = Ложь;
		//БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
		//Если СтруктураПенс.ОграничениеПоДоходам = 0 ИЛИ РазмерСреднейЗарплаты = 0 тогда
		//	БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//	БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//Иначе
		//	мСуммаДопБазаДоходФСЗН = 0;
		//	мСуммаДопБазаДоходСтрах = 0;
		//	мНайденнаяСтрока = ТаблицаДопСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц));
		//	Если мНайденнаяСтрока.Количество() <> 0 и ДанныеДляРасчетаЕСН.БазаНачислений >= 1 Тогда
		//		мСуммаДопБазаДоходФСЗН = мНайденнаяСтрока[0].ФондФСЗН;
		//		мСуммаДопБазаДоходСтрах = мНайденнаяСтрока[0].ФондСтрахование;
		//	КонецЕсли;
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 9
		//	//Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН+СуммаБазаДрПериод > БазаОграниченияФСЗН Тогда
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 9
		//	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 9
		//	Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН > БазаОграниченияФСЗН Тогда
		//	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 9
		//		мСуммаПревышения = (ДанныеДляРасчетаЕСН.БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН)-БазаОграниченияФСЗН;
		//		ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" превышение ограничения на "+Строка(мСуммаПревышения));
		//		БазаДоходПенсионныйФонд = БазаОграниченияФСЗН;
		//		БазаДоходФСЗН = ?(БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН>0,БазаОграниченияФСЗН-мСуммаДопБазаДоходФСЗН,0);
		//		мПревышенияОграничения = Истина;
		//		СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
		//		СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
		//		СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
		//	Иначе
		//		мНайденнаяСтрокаФизЛиц = ТаблицаПрибСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц)); //О.Т. 15.07.2014 № !!!
		//		если мНайденнаяСтрокаФизЛиц.Количество()>0 Тогда 
		//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//		иначе
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 7 пенс
		//			//БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН + мСуммаДопБазаДоходФСЗН + СуммаБазаДрПериод;
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 7 пенс
		//			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		//			если мСуммаДопБазаДоходФСЗН<> 0 Тогда //О.Т. 15.07.2014 № !!!
		//				СтрТаблицаФизЛиц = ТаблицаПрибСумм.Добавить();
		//				СтрТаблицаФизЛиц.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
		//				СтрТаблицаФизЛиц.ПериодВзаиморасчетов = ДанныеДляРасчетаЕСН.Месяц; //О.Т. 15.07.2014 № !!!
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//КонецЕсли;
		////Аверсон-софт, Островская Татьяна 08.06.2012 № 15289
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		мПревышенияОграничения = Ложь;
		БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам * РазмерСреднейЗарплаты;
		Если СтруктураПенс.ОграничениеПоДоходам = 0 ИЛИ РазмерСреднейЗарплаты = 0 тогда
			БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
		Иначе
			Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН > БазаОграниченияФСЗН Тогда
				мСуммаПревышения = ДанныеДляРасчетаЕСН.БазаДоходФСЗН - БазаОграниченияФСЗН;
				ОбщегоНазначения.СообщитьОбОшибке( Строка( ДанныеДляРасчетаЕСН.ФизЛицо )+" превышение ограничения на " + Строка( мСуммаПревышения ) );
				БазаДоходПенсионныйФонд = БазаОграниченияФСЗН;
				БазаДоходФСЗН = БазаОграниченияФСЗН;
				мПревышенияОграничения = Истина;
			Иначе
				БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
				БазаДоходФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН;
			КонецЕсли;
		КонецЕсли;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		Отбор = Новый Структура();
		Отбор.Вставить("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		Отбор.Вставить("Сотрудник",СотрудникОсн); //О.Т. 08.08.2014 № 17522
		Отбор.Вставить("Период",НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
		ДниТабель = 0;
		ЧасыТабель = 0;
		РезТабельМассив = РезТабель.НайтиСтроки(Отбор);
		если РезТабельМассив.Количество() > 0 Тогда 
			ДниТабель = РезТабельМассив[0].Дней;
			ЧасыТабель = РезТабельМассив[0].Часов;
		КонецЕсли;
		ДниТабельДля60 = 0;
		ЧасыТабельДля60 = 0;
		РезТабельМассивДля60 = РезТабельДля60.НайтиСтроки(Отбор);
		если РезТабельМассивДля60.Количество() > 0 Тогда 
			ДниТабельДля60 = РезТабельМассивДля60[0].Дней;
			ЧасыТабельДля60 = РезТабельМассивДля60[0].Часов;
		КонецЕсли;
		
		
		НормаПоГрафику = 0;//О.Т. 08.08.2014 № 17522
		НормаПоГрафикуЧасы = 0; //О.Т. 08.08.2014 № 17522
		НормаПоГрафикуДля60 = 0;
		НормаПоГрафикуЧасыДля60 = 0;
		если не (ДниТабель = 0 или ДниТабель = null) тогда
			
			//индивидуальный график
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Физлицо,
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ВсегоДней,
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ВсегоЧасов
			|ИЗ
			|	Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации КАК ВводИндивидуальныхГрафиковРаботыОрганизации
			|		ПО ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка = ВводИндивидуальныхГрафиковРаботыОрганизации.Ссылка
			|ГДЕ
			|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Физлицо = &Физлицо
			|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2
			|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.Проведен";
			Запрос.УстановитьПараметр("Физлицо",ДанныеДляРасчетаЕСН.ФизЛицо);
			Запрос.УстановитьПараметр("ПериодРегистрации1",НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Запрос.УстановитьПараметр("ПериодРегистрации2",КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Результ = Запрос.Выполнить();
			Результат = Запрос.Выполнить().Выбрать();
			НормаПоИндивидГрафикуЧасы = 0;
			НормаПоГрафику = 0;
			НормаПоИндивидГрафикуЧасыДля60 = 0;
			НормаПоГрафикуДля60 = 0;
			Пока Результат.Следующий() цикл
				НормаПоИндивидГрафикуЧасы = Результат.ВсегоЧасов;
				НормаПоГрафику = Результат.ВсегоДней;
				если не (ДниТабельДля60 = 0 или ДниТабельДля60 = null) тогда
					НормаПоИндивидГрафикуЧасыДля60 = Результат.ВсегоЧасов;
					НормаПоГрафикуДля60 = Результат.ВсегоДней;
				КонецЕсли;
				
			КонецЦикла;
			если  НормаПоГрафику = 0 тогда
				// Общий график
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
				|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение,
				|	ГрафикиРаботыПоВидамВремени.Месяц,
				|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма
				|ИЗ
				|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник) КАК ВложенныйЗапрос
				|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВложенныйЗапрос.ГрафикРаботы
				|ГДЕ
				|	ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
				|	И ГрафикиРаботыПоВидамВремени.ВидВремени = &ВидВремени
				|
				|СГРУППИРОВАТЬ ПО
				|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
				|	ГрафикиРаботыПоВидамВремени.Месяц";
				Запрос.УстановитьПараметр("Сотрудник",СотрудникОсн);
				Запрос.УстановитьПараметр("Период",ДанныеДляРасчетаЕСН.Месяц);
				Запрос.УстановитьПараметр("Месяц",ДанныеДляРасчетаЕСН.Месяц);
				Запрос.УстановитьПараметр("ВидВремени",Справочники.КлассификаторИспользованияРабочегоВремени.РаботаДни);
				
				Рез = Запрос.Выполнить().Выбрать();
				НормаПоГрафику = 0;
				НормаПоГрафикуЧасы = 0;
				НормаПоГрафикуДля60 = 0;
				НормаПоГрафикуЧасыДля60 = 0;
				пока Рез.Следующий() цикл
					НормаПоГрафику =Рез.ОсновноеЗначениеНорма; 
					НормаПоГрафикуЧасы =Рез.ДополнительноеЗначение;
					если не (ДниТабельДля60 = 0 или ДниТабельДля60 = null) тогда
						НормаПоГрафикуДля60 = Рез.ОсновноеЗначениеНорма;
						НормаПоГрафикуЧасыДля60 = Рез.ДополнительноеЗначение;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			//О.Т. 08.08.2014 № 17522
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.ЗанимаемыхСтавок = 0
			|				И ВложенныйЗапрос.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|			ТОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|		ИНАЧЕ ВложенныйЗапрос.ЗанимаемыхСтавок
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	РаботникиОрганизацийСрезПоследних.Регистратор
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, НЕ Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК РаботникиОрганизацийСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
			|			РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор,
			|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
			|		ИЗ
			|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|		ГДЕ
			|			РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
			|			И РаботникиОрганизацийСрезПоследних.Организация = &Организация) КАК ВложенныйЗапрос
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
			|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Период", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц)); //О.Т. 23.02.2015
			Запрос.УстановитьПараметр("Сотрудник", СотрудникОсн);
			
			РезультатСтавка = Запрос.Выполнить().Выбрать();
			ЗанимаемыхСтавок = 0;
			Пока РезультатСтавка.Следующий() Цикл
				ЗанимаемыхСтавок = РезультатСтавка.ЗанимаемыхСтавок;
			КонецЦикла;
			//О.Т. 08.08.2014 № 17522
			
			если ДниТабель < НормаПоГрафику  тогда
				ВеличинаПрожиточногоМинимума = ОбщегоНазначения.ОкруглитьПоВалюте(ВеличинаПрожиточногоМинимума/НормаПоГрафику*ДниТабель, Константы.ВалютаРегламентированногоУчета.Получить());
			КонецЕсли;
			
		КонецЕсли;
		//Аверсон-софт, Островская Татьяна 08.06.2012 № 15289
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////Островская Татьяна 10.09.2013 № 16725
		//СуммаПрошл = 0;
		//ЗапросПроверкаРез = новый Запрос;
		//ЗапросПроверкаРез.Текст = 
		//"ВЫБРАТЬ
		//|	ВложенныйЗапрос.ФизЛицо,
		//|	ВложенныйЗапрос.Месяц,
		//|	ВложенныйЗапрос.ДоходФСЗН,
		//|	ВложенныйЗапрос.ДоходСтрах,
		//|	ВложенныйЗапрос.доходЕдиныйПлатеж,
		//|	СУММА(ВложенныйЗапрос.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		//|	МАКСИМУМ(ВложенныйЗапрос.Сторно) КАК Сторно
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//|		ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
		//|		ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
		//|		ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//|		СУММА(ЕСНСведенияОДоходах.Результат) КАК ОблагаемыйДоход,
		//|		ВложенныйЗапрос.Сторно КАК Сторно
		//|	ИЗ
		//|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//|				ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
		//|				ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
		//|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
		//|				СУММА(ВЫБОР
		//|						КОГДА ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//|								И ЕСНСведенияОДоходах.Результат < 0
		//|							ТОГДА 1
		//|						ИНАЧЕ 0
		//|					КОНЕЦ) КАК Сторно,
		//|				ЕСНСведенияОДоходах.Регистратор КАК Регистратор
		//|			ИЗ
		//|				РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|			ГДЕ
		//|				ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//|				И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//|				И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//|				И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|				И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//|				И ЕСНСведенияОДоходах.Организация = &Организация
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//|				ЕСНСведенияОДоходах.ФизЛицо,
		//|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//|				ЕСНСведенияОДоходах.ДоходФСЗН,
		//|				ЕСНСведенияОДоходах.ДоходСтрах,
		//|				ЕСНСведенияОДоходах.Регистратор) КАК ВложенныйЗапрос
		//|			ПО ЕСНСведенияОДоходах.Регистратор = ВложенныйЗапрос.Регистратор
		//|	ГДЕ
		//|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//|		И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//|		И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//|		И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|		И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//|		И НЕ(ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации)
		//|		И ЕСНСведенияОДоходах.Организация = &Организация
		
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//|		ЕСНСведенияОДоходах.ФизЛицо,
		//|		ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//|		ЕСНСведенияОДоходах.ДоходФСЗН,
		//|		ЕСНСведенияОДоходах.ДоходСтрах,
		//|		ВложенныйЗапрос.Сторно) КАК ВложенныйЗапрос
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВложенныйЗапрос.Месяц,
		//|	ВложенныйЗапрос.ФизЛицо,
		//|	ВложенныйЗапрос.доходЕдиныйПлатеж,
		//|	ВложенныйЗапрос.ДоходСтрах,
		//|	ВложенныйЗапрос.ДоходФСЗН";
		//
		//ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		//ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
		//ЗапросПроверкаРез.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//ЗапросПроверкаРез.УстановитьПараметр("ДоходФСЗН",Перечисления.ДоходыФСС_НС.Облагается);
		//ЗапросПроверкаРез.УстановитьПараметр("ВидРасч",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
		//ЗапросПроверкаРез.УстановитьПараметр("Организация",Организация);
		//РезЗапрос = ЗапросПроверкаРез.Выполнить().Выбрать();
		//пока РезЗапрос.Следующий() Цикл
		//	если РезЗапрос.Сторно = 1 Тогда                      
		//		СуммаПрошл = РезЗапрос.ОблагаемыйДоход;
		//	КонецЕсли;
		//	ЗапросПроверкаРез = новый Запрос;
		//	ЗапросПроверкаРез.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЕСНСведенияОДоходах.ФизЛицо,
		//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		//	|	ЕСНСведенияОДоходах.ДоходФСЗН,
		//	|	ЕСНСведенияОДоходах.ДоходСтрах,
		//	|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//	|	МАКСИМУМ(ВЫБОР
		//	|			КОГДА ЕСНСведенияОДоходах.ВидРасчета = &ВидРасч
		//	|					И ЕСНСведенияОДоходах.Результат < 0
		//	|				ТОГДА 1
		//	|			ИНАЧЕ 0
		//	|		КОНЕЦ) КАК Сторно,
		//	|	ЕСНСведенияОДоходах.Результат
		//	|ИЗ
		//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//	|ГДЕ
		//	|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации
		//	|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации
		//	|	И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		//	|	И ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//	|	И ЕСНСведенияОДоходах.Результат < 0
		//	|	И ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
		//	|	И ЕСНСведенияОДоходах.Организация = &Организация
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	|	ЕСНСведенияОДоходах.ФизЛицо,
		//	|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		//	|	ЕСНСведенияОДоходах.ДоходФСЗН,
		//	|	ЕСНСведенияОДоходах.ДоходСтрах,
		//	|	ЕСНСведенияОДоходах.Результат";
		//	ЗапросПроверкаРез.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		//	ЗапросПроверкаРез.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
		//	ЗапросПроверкаРез.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		//	ЗапросПроверкаРез.УстановитьПараметр("ДоходФСЗН",Перечисления.ДоходыФСС_НС.Облагается);
		//	ЗапросПроверкаРез.УстановитьПараметр("ВидРасч",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
		//	ЗапросПроверкаРез.УстановитьПараметр("Организация",Организация);
		//	РезПроверкаРезультата = ЗапросПроверкаРез.Выполнить().Выбрать();
		//	
		//	пока РезПроверкаРезультата.Следующий() Цикл 
		//		если РезПроверкаРезультата.Сторно = 1 Тогда                      
		//			СуммаПрошл = РезЗапрос.ОблагаемыйДоход - Мин(-РезПроверкаРезультата.Результат,БазаОграниченияФСЗН);
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//КонецЦикла;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//если не СуммаПрошл = 0 Тогда 
		//Островская Татьяна 10.09.2013 № 16725 
		если Не НеПравоНаПенсию тогда
			
			//+ СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			////Аверсон-софт, Островская Татьяна 06.06.2012 № 15289
			////Островская Татьяна 10.09.2013 № 16725
			//если ПроверкаСтроки.Количество()>0 Тогда 
			//	ЗаписьОтрицат = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Отриц),ПроверкаСтроки[0].Отриц,0);
			//	ЗаписьПревышение = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Превышение),ПроверкаСтроки[0].Превышение,0);
			//иначе
			//	ЗаписьОтрицат = 0;
			//	ЗаписьПревышение = 0;
			//КонецЕсли;
			//
			//
			//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации и ЗаписьОтрицат >0 и ЗаписьПревышение > 0 Тогда
			//	
			//	ИспользуемаяБазаФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН; //+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			//	НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте( 
			//							ИспользуемаяБазаФСЗН * НоваяСтрока.ПроцентФСЗН / 100,
			//							ВалютаРегл );
			//	
			////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11	
			////	НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(БазаДоходФСЗН* НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить());
			////ИначеЕсли НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации и ДанныеДляРасчетаЕСН.БазаДоходФСЗН + БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН Тогда //О.Т. 30.09.2014 № 222
			////	если БазаФСЗНПрошлогоМесПроверка < БазаОграниченияФСЗН Тогда 
			////		НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте((БазаОграниченияФСЗН - БазаФСЗНПрошлогоМесПроверка1)* НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить());
			////	иначе
			////		НоваяСтрока.ФСЗН = 0;
			////	КонецЕсли;
			////ИначеЕсли СуммаПрошл <= БазаОграниченияФСЗН Тогда
			////	если  БазаДоходФСЗН = 0 и мСуммаДопБазаДоходФСЗН = 0 тогда //О.Т. Аверсон 19.04.2018 по примеру Элема добавлена мСуммаДопБазаДоходФСЗН = 0 по Сотр Нущик Юлия
			////		НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(?(Ложь,Макс(БазаДоходФСЗН, ВеличинаПрожиточногоМинимума), БазаДоходФСЗН) * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить())- данныеДляРасчетаЕСН.НачисленныйФСЗН -ФСЗНПрошлогоМес;///О.Т. Аверсон 19.03.2018 № 1727 добавила  данныеДляРасчетаЕСН.НачисленныйФСЗН из-за добавления в нижней строке +мСуммаДопБазаДоходФСЗН
			////	иначе
			////		Если РасчетФСЗНотБПМ Тогда 
			////			Если БазаДоходФСЗН+мСуммаДопБазаДоходФСЗН > ВеличинаПрожиточногоМинимума Тогда 
			////				НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(БазаДоходФСЗН * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить()) + ОбщегоНазначения.ОкруглитьПоВалюте(мСуммаДопБазаДоходФСЗН * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить()) - данныеДляРасчетаЕСН.НачисленныйФСЗН-ФСЗНПрошлогоМес;//О.Т. 16.09.2014 № 222
			////			иначе
			////				НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(ВеличинаПрожиточногоМинимума * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить()) - данныеДляРасчетаЕСН.НачисленныйФСЗН-ФСЗНПрошлогоМес;//О.Т. 16.09.2014 № 222
			////			КонецЕсли;
			////		иначе
			////			
			////			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			////			//НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(БазаДоходФСЗН * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить()) 
			////			//	+ ОбщегоНазначения.ОкруглитьПоВалюте( мСуммаДопБазаДоходФСЗН * НоваяСтрока.ПроцентФСЗН/100, константы.ВалютаРегламентированногоУчета.Получить()) 
			////			//	- данныеДляРасчетаЕСН.НачисленныйФСЗН - ФСЗНПрошлогоМес;//О.Т. 16.09.2014 № 222
			////			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			////			
			////			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			////			НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(
			////					БазаДоходФСЗН * НоваяСтрока.ПроцентФСЗН/100, 
			////					константы.ВалютаРегламентированногоУчета.Получить() )
			////				- ДанныеДляРасчетаЕСН.НачисленныйФСЗН;
			////			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			////			
			////		КонецЕсли;	//О.Т. Аверсон 19.03.2018 № 1727 Разбито отдельно база и база доп для округления			
			////	КонецЕсли;
			////- СВЭЙ КДЯ 10.03.20 СВФР-005656 11	
			//	
			////+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11	
			//ИначеЕсли НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации 
			//			И ДанныеДляРасчетаЕСН.БазаДоходФСЗН > БазаОграниченияФСЗН 
			//	      ИЛИ ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл <= БазаОграниченияФСЗН Тогда
			//	
			//	ИспользуемаяБазаФСЗН = Макс( 
			//								Мин( ДанныеДляРасчетаЕСН.БазаДоходФСЗН, БазаОграниченияФСЗН ),
			//								?( РасчетФСЗНотБПМ, ВеличинаПрожиточногоМинимума, 0 ) 
			//							);
			//				
			//	НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(
			//			ИспользуемаяБазаФСЗН * НоваяСтрока.ПроцентФСЗН / 100, ВалютаРегл )
			//		- ДанныеДляРасчетаЕСН.НачисленныйФСЗН;
			//	
			////- СВЭЙ КДЯ 10.03.20 СВФР-005656 11	
			//	
			//иначе
			//	
			//	ИспользуемаяБазаФСЗН = 0; //+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			//	
			//	если ФизЛицоПрошл <> ДанныеДляРасчетаЕСН.ФизЛицо Тогда 
			//		
			//		
			//		Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл > БазаОграниченияФСЗН Тогда  //+ СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			//				
			//			//Наркевич 08.07.2014 № замена на отбор по месяцы, было по физлицу
			//			Запрос = Новый Запрос;
			//			Запрос.Текст = 
			//			"ВЫБРАТЬ
			//			|       РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
			//			|       РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало
			//			|ИЗ
			//			|       Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
			//			|ГДЕ
			//			|       РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
			//			|       И РасчетЕСНДополнительныеНачисления.Ссылка.Организация = &Организация
			//			|       И &Месяц МЕЖДУ РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало И
			//			|       РасчетЕСНДополнительныеНачисления.БазовыйПериодКонец";
			//			
			//			Запрос.УстановитьПараметр("Месяц", ДанныеДляРасчетаЕСН.Месяц);
			//			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			//			Запрос.УстановитьПараметр("Организация", Организация);
			//			Результат = Запрос.Выполнить();
			//			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			//			
			//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//				ПараметрыОтбора = Новый Структура;
			//				ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			//				ПараметрыОтбора.Вставить("БазовыйПериодНачало", ВыборкаДетальныеЗаписи.БазовыйПериодНачало);
			//				ДопНачИзменить = ДополнительныеНачисления.НайтиСтроки(ПараметрыОтбора);
			//				для Каждого СтрДоп из ДопНачИзменить Цикл 
			//					СтрДоп.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
			//				КонецЦикла;
			//				
			//			КонецЦикла;
			//			
			//			Запрос = Новый Запрос;
			//			Запрос.Текст = 
			//			"ВЫБРАТЬ
			//			|       РасчетЕСНОсновныеНачисления.ДоходФСЗН,
			//			|       РасчетЕСНОсновныеНачисления.ПериодДействияНачало
			//			|ИЗ
			//			|       Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
			//			|ГДЕ
			//			|       РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
			//			|       И РасчетЕСНОсновныеНачисления.Ссылка.Организация = &Организация
			//			|       И &Месяц МЕЖДУ РасчетЕСНОсновныеНачисления.ПериодДействияНачало И
			//			|       РасчетЕСНОсновныеНачисления.ПериодДействияКонец";
			//			
			//			Запрос.УстановитьПараметр("Месяц", ДанныеДляРасчетаЕСН.Месяц);
			//			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			//			Запрос.УстановитьПараметр("Организация", Организация);
			//			Результат = Запрос.Выполнить();
			//			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			//			
			//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//				ПараметрыОтбора = Новый Структура;
			//				ПараметрыОтбора.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			//				ПараметрыОтбора.Вставить("ПериодДействияНачало", ВыборкаДетальныеЗаписи.ПериодДействияНачало);
			//				ОснНачИзменить = ОсновныеНачисления.НайтиСтроки(ПараметрыОтбора);
			//				для Каждого СтрОсн из ОснНачИзменить Цикл 
			//					СтрОсн.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
			//				КонецЦикла;
			//				
			//			КонецЦикла;
			//		
			//		КонецЕсли;  //ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл > БазаОграниченияФСЗН //+ СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			//		
			//		ФизЛицоПрошл = ДанныеДляРасчетаЕСН.ФизЛицо;
			//	КонецЕсли;
			//КонецЕсли;
			//- СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			
			//+ СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			
			//ПСА 14.06.2021 СВФР-007670 +++
			//ИспользуемаяБазаФСЗН = Макс( 
			//							Мин( ДанныеДляРасчетаЕСН.БазаДоходФСЗН, БазаОграниченияФСЗН ),
			//							?( РасчетФСЗНотБПМ, ВеличинаПрожиточногоМинимума, 0 ) 
			//						);
			
			Если не РасчетФСЗНотБПМ  и Мин( ДанныеДляРасчетаЕСН.БазаДоходФСЗН, БазаОграниченияФСЗН ) < 0 Тогда
				ИспользуемаяБазаФСЗН = Мин( ДанныеДляРасчетаЕСН.БазаДоходФСЗН, БазаОграниченияФСЗН )
			Иначе
				ИспользуемаяБазаФСЗН = Макс( 
				Мин( ДанныеДляРасчетаЕСН.БазаДоходФСЗН, БазаОграниченияФСЗН ),
				?( РасчетФСЗНотБПМ, ВеличинаПрожиточногоМинимума, 0 ) 
				);
			КонецЕсли;			
			//+++ПСА 14.06.2021 СВФР-007670			
			НоваяСтрока.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(
			ИспользуемаяБазаФСЗН * НоваяСтрока.ПроцентФСЗН / 100, ВалютаРегл )
			- ДанныеДляРасчетаЕСН.НачисленныйФСЗН;
			//- СВЭЙ КДЯ 17.03.20 СВФР-005656 16
			
			
			ЗапросУвольнение = Новый Запрос;
			ЗапросУвольнение.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУвольнение.УстановитьПараметр("Период", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			ЗапросУвольнение.УстановитьПараметр("Сотрудник", СотрудникОсн);
			РезультатУвольнение = ЗапросУвольнение.Выполнить().Выбрать();
			Уволен = Ложь;
			Пока РезультатУвольнение.Следующий() Цикл
				Если РезультатУвольнение.Период >= НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) и РезультатУвольнение.Период <= КонецМесяца(ДанныеДляРасчетаЕСН.Месяц) Тогда 
					Если не Организация.ИНН = "100074549" Тогда
						Уволен = Истина;
					КонецЕсли;
				иначе
					Уволен = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Уволен Тогда 
				НоваяСтрока.ПенсионныйФонд = 0;
				Сообщить("Пенсионный программой не проверен, проверьте "+СокрЛП(СотрудникОсн.Наименование)+" уволен." );
			иначе
				НоваяСтрока.ПенсионныйФонд = ОбщегоНазначения.ОкруглитьПоВалюте(
				//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				//БазаДоходПенсионныйФонд * СтавкаПенсионныйФонд/100, Константы.ВалютаРегламентированногоУчета.Получить() )
				//- данныеДляРасчетаЕСН.ПенсионныйФонд - СуммаПенсионныйПоПериоду - ПенсионныйПрошлогоМес -ПенсионныйПоПрошлМесБудПериода
				//- СуммаУжеНачислПенс
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				ИспользуемаяБазаФСЗН * СтавкаПенсионныйФонд / 100, ВалютаРегл )
				- ДанныеДляРасчетаЕСН.ПенсионныйФонд 
				//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
				;//Островская Татьяна 10.09.2013 № 16725; 222
			КонецЕсли;
			//Островская Татьяна 10.09.2013 № 16725
			//Аверсон-софт, Островская Татьяна 06.06.2012 № 15289
		иначе
			ИспользуемаяБазаФСЗН = ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл; //+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
			НоваяСтрока.ПенсионныйФонд = 0;
			НоваяСтрока.ФСЗН = 0;
		КонецЕсли;
		
		
		Если СтруктураСтрах.Ставка = 0 Тогда
			ИспользуемаяБазаБГС = 0;	
		Иначе	
			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11 фонд БГС
			ИспользуемаяБазаБГС = ДанныеДляРасчетаЕСН.БазаДоходСтрах;
			//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11 фонд БГС
		КонецЕсли;
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		НоваяСтрока.ФондФСЗН = 	ИспользуемаяБазаФСЗН - ДанныеДляРасчетаЕСН.БазаДоходФСЗН_Прошл;
		
		НоваяСтрока.ФондСтрахование =  ИспользуемаяБазаБГС - ?( БГСОтТекущихСумм, 0, ДанныеДляРасчетаЕСН.БазаДоходСтрах_Прошл );  //Аверсон 11.05.2020 КВВ СВФР-005969 (изменено БГСОтТекущихСумм на НЕ БГСОтТекущихСумм ) //Аверсон 14.05.2020 КВВ СВФР-005969 (изменено ОБРАТНО НЕ БГСОтТекущихСумм на БГСОтТекущихСумм )
		Если СтруктураСтрах.Ставка = 0 Тогда
			НоваяСтрока.ФондСтрахование = 0;
		КонецЕсли;
		
		НоваяСтрока.ОбязательноеСтрахование = ОбщегоНазначения.ОкруглитьПоВалюте(
		ИспользуемаяБазаБГС * СтавкаОбязательноеСтрахование / 100, ВалютаРегл )
		- ?( БГСОтТекущихСумм, 0, ДанныеДляРасчетаЕСН.НачисленныйСтрах );   //Аверсон 11.05.2020 КВВ СВФР-005969 (изменено БГСОтТекущихСумм на НЕ БГСОтТекущихСумм )  //Аверсон 14.05.2020 КВВ СВФР-005969 (изменено ОБРАТНО НЕ БГСОтТекущихСумм на БГСОтТекущихСумм )
		Если БГСОтТекущихСумм Тогда 
			НоваяСтрока.ФондСтрахование =  ИспользуемаяБазаБГС -  ДанныеДляРасчетаЕСН.БазаДоходСтрах_Прошл ; 
			НоваяСтрока.ОбязательноеСтрахование = ОбщегоНазначения.ОкруглитьПоВалюте(НоваяСтрока.ФондСтрахование * СтавкаОбязательноеСтрахование /100, ВалютаРегл );
		КонецЕсли;
		
		НоваяСтрока.ФондЕдиный = ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж 
		- ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж_Прошл;
		НоваяСтрока.ЕдиныйПлатеж = ОбщегоНазначения.ОкруглитьПоВалюте( 
		ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж  * СтавкаЕдиныйПлатеж / 100, ВалютаРегл ) 
		- ДанныеДляРасчетаЕСН.НачисленныйЕдиныйПлатеж;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		////КонецЕсли;
		////Аверсон-софт, Островская Татьяна 22.03.2012 № 15093
		//мСуммаДоходСтрах = 0;
		//мНайденнаяСтрокаСтрах = ТаблицаДопСумм.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц));
		//Если мНайденнаяСтрокаСтрах.Количество() <> 0 Тогда
		//	мСуммаДоходСтрах = мНайденнаяСтрокаСтрах[0].ФондСтрахование;
		//КонецЕсли;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		
		//НоваяСтрока.ЕдиныйПлатеж = ОкруглитьПоВалюте(ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж  * СтавкаЕдиныйПлатеж/100, Константы.ВалютаРегламентированногоУчета.Получить()) - данныеДляРасчетаЕСН.НачисленныйЕдиныйПлатеж;
		//НоваяСтрока.ОбязательноеСтрахование = ОкруглитьПоВалюте(ДанныеДляРасчетаЕСН.БазаДоходСтрах  * СтавкаОбязательноеСтрахование/100, Константы.ВалютаРегламентированногоУчета.Получить()) - данныеДляРасчетаЕСН.НачисленныйСтрах;
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		//НоваяСтрока.ЕдиныйПлатеж = ?(ПериодРасчета > ПериодРегистрации,0,ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж)  * СтавкаЕдиныйПлатеж/100 - данныеДляРасчетаЕСН.НачисленныйЕдиныйПлатеж;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11 фонд БГС
		//если ДанныеДляРасчетаЕСН.БазаДоходСтрах = 0 Тогда 
		//	
		//	
		//	НоваяСтрока.ОбязательноеСтрахование = (ДанныеДляРасчетаЕСН.БазаДоходСтрах)  * СтавкаОбязательноеСтрахование/100 - ?(БГСОтТекущихСумм,0,данныеДляРасчетаЕСН.НачисленныйСтрах-СтрахПрошлогоМес);//О.Т. 16.09.2014 № 222 , 876(04.03.15)
		//	мНайденнаяСтрокаСтрах = ТаблицаСтрахование.НайтиСтроки(Новый Структура("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо));
		//	Если мНайденнаяСтрокаСтрах.Количество() = 0 Тогда
		//		если БГСОтТекущихСумм Тогда 
		//			НоваяСтрока.ОбязательноеСтрахование = НоваяСтрока.ОбязательноеСтрахование * СтавкаОбязательноеСтрахование/100;//О.Т. Аверсон 09.03.2016 № 876
		//		иначе
		//			НоваяСтрока.ОбязательноеСтрахование = НоваяСтрока.ОбязательноеСтрахование + мСуммаДоходСтрах * СтавкаОбязательноеСтрахование/100-?(БГСОтТекущихСумм,0,СтрахПрошлогоМес);//О.Т. 16.09.2014 № 222 , 876(04.03.15)
		//		КонецЕсли;
		//		СтрокаТаблицаСтрахование = ТаблицаСтрахование.Добавить();
		//		СтрокаТаблицаСтрахование.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
		//		Если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
		//			СтрокаТаблицаСтрахование.СуммаСтрах = Окр(мСуммаДоходСтрах * СтавкаОбязательноеСтрахование/100,2);
		//		иначе
		//			СтрокаТаблицаСтрахование.СуммаСтрах = ОбщегоНазначения.ОкруглитьЗначение2016(мСуммаДоходСтрах * СтавкаОбязательноеСтрахование/100,ПериодРегистрации);//О.Т. Аверсон 17.03.2016 № 949
		//		КонецЕсли;
		//		СтрокаТаблицаСтрахование.Месяц = ДанныеДляРасчетаЕСН.Месяц;
		//	КонецЕсли;
		//иначе
		//	мНайденнаяСтрокаСтрах = ТаблицаСтрахование.НайтиСтроки(Новый Структура("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо));
		//	Если мНайденнаяСтрокаСтрах.Количество() = 0 Тогда
		//		если БГСОтТекущихСумм Тогда 
		//			НоваяСтрока.ОбязательноеСтрахование = ДанныеДляРасчетаЕСН.БазаДоходСтрах * СтавкаОбязательноеСтрахование/100;//О.Т. Аверсон 09.03.2016 № 876
		//		иначе
		//			НоваяСтрока.ОбязательноеСтрахование = (ДанныеДляРасчетаЕСН.БазаДоходСтрах+мСуммаДоходСтрах)  * СтавкаОбязательноеСтрахование/100 - ?(БГСОтТекущихСумм,0,данныеДляРасчетаЕСН.НачисленныйСтрах-СтрахПрошлогоМес);//О.Т. 16.09.2014 № 222 , 876(04.03.15)
		//		КонецЕсли;
		//		СтрокаТаблицаСтрахование = ТаблицаСтрахование.Добавить();
		//		СтрокаТаблицаСтрахование.ФизЛицо = ДанныеДляРасчетаЕСН.ФизЛицо;
		//		СтрокаТаблицаСтрахование.СуммаСтрах = НоваяСтрока.ОбязательноеСтрахование;
		//		СтрокаТаблицаСтрахование.Месяц = ДанныеДляРасчетаЕСН.Месяц;
		//	иначе
		//		ПоискСтрокиТЧ = ИсчисленныйЕСН.НайтиСтроки(Новый Структура("ФизЛицо,ПериодВзаиморасчетов,ФондСтрахование", ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц,0));
		//		Для Каждого СтрПоиск из ПоискСтрокиТЧ Цикл 
		//			если СтрПоиск.НомерСтроки <> НоваяСтрока.НомерСтроки Тогда 
		//				ПоискСтрокиТЧ[0].ОбязательноеСтрахование = ПоискСтрокиТЧ[0].ОбязательноеСтрахование - мНайденнаяСтрокаСтрах[0].СуммаСтрах;
		//				ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог,НоваяСтрока);//О.Т. 16.02.2015 № 17778
		//				ЗаполнитьЗначенияСвойств(НоваяСтрокаИтогПоПроц,НоваяСтрока);//О.Т. Аверсон 18.04.2018 № 1870
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;  
		//		если БГСОтТекущихСумм Тогда 
		//			НоваяСтрока.ОбязательноеСтрахование = ДанныеДляРасчетаЕСН.БазаДоходСтрах* СтавкаОбязательноеСтрахование/100;
		//		иначе
		//			НоваяСтрока.ОбязательноеСтрахование = (ДанныеДляРасчетаЕСН.БазаДоходСтрах+мСуммаДоходСтрах)  * СтавкаОбязательноеСтрахование/100 - ?(БГСОтТекущихСумм,0,данныеДляРасчетаЕСН.НачисленныйСтрах-СтрахПрошлогоМес);//О.Т. 16.09.2014 № 222 , 876(04.03.15)
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации и ДанныеДляРасчетаЕСН.БазаДоходСтрах + БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН Тогда
		//	НоваяСтрока.ОбязательноеСтрахование = (ДанныеДляРасчетаЕСН.БазаДоходСтрах)  * СтавкаОбязательноеСтрахование/100;
		//КонецЕсли;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		//        НоваяСтрока.ФондФСЗН = ?(РасчетФСЗНотБПМ,Макс(ДанныеДляРасчетаЕСН.БазаДоходФСЗН, ВеличинаПрожиточногоМинимума), ДанныеДляРасчетаЕСН.БазаДоходФСЗН);
		//Аверсон-софт, Островская Татьяна 06.06.2012 № 15289
		//Островская Татьяна 10.09.2013 № 16725
		
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		////О.Т. 30.09.2014 № 222
		//если ПроверкаСтроки.Количество()>0 Тогда 
		//	ЗаписьОтрицат = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Отриц),ПроверкаСтроки[0].Отриц,0);
		//	ЗаписьПревышение = ?(ЗначениеЗаполнено(ПроверкаСтроки[0].Превышение),ПроверкаСтроки[0].Превышение,0);
		//иначе
		//	ЗаписьОтрицат = 0;
		//	ЗаписьПревышение = 0;
		//КонецЕсли;
		//
		//
		//если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации и ЗаписьОтрицат >0 и ЗаписьПревышение > 0 Тогда
		//	
		//	НоваяСтрока.ФондФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(БазаДоходФСЗН, Константы.ВалютаРегламентированногоУчета.Получить());
		//ИначеЕсли НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) < ПериодРегистрации и ДанныеДляРасчетаЕСН.БазаДоходСтрах + БазаФСЗНПрошлогоМесПроверка > БазаОграниченияФСЗН Тогда // О.Т. 30.10.2014 264
		//	если БазаФСЗНПрошлогоМесПроверка < БазаОграниченияФСЗН Тогда 
		//		НоваяСтрока.ФондФСЗН = БазаОграниченияФСЗН - БазаФСЗНПрошлогоМесПроверка1;
		//	иначе
		//		НоваяСтрока.ФондФСЗН = 0;
		//	КонецЕсли;
		//	
		//иначе
		//	если СуммаПрошл <= БазаОграниченияФСЗН Тогда
		//		если БазаДоходФСЗН = 0 тогда
		//			НоваяСтрока.ФондФСЗН = Мин(?(Ложь,Макс(БазаДоходФСЗН, ВеличинаПрожиточногоМинимума), БазаДоходФСЗН)
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			//- БазаФСЗНПрошлогоМес,
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			- РезПрошлогоМесяца.ДоходФСЗН,
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			БазаОграниченияФСЗН );//О.Т. 16.09.2014 № 222
		//		иначе
		//			НоваяСтрока.ФондФСЗН = Мин(?(РасчетФСЗНотБПМ,Макс(БазаДоходФСЗН, ВеличинаПрожиточногоМинимума), БазаДоходФСЗН)
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			//- БазаФСЗНПрошлогоМес,
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			//+ СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			- РезПрошлогоМесяца.ДоходФСЗН,
		//			//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		//			БазаОграниченияФСЗН );//О.Т. 16.09.2014 № 222
		//		КонецЕсли;
		//	КонецЕсли; 
		//КонецЕсли;
		//О.Т. 30.09.2014 № 222
		//Островская Татьяна 10.09.2013 № 16725
		
		////Аверсон-софт, Островская Татьяна 06.06.2012 № 15289
		//НоваяСтрока.ФондЕдиный = ДанныеДляРасчетаЕСН.БазаДоходЕдиныйПлатеж;
		
		//НоваяСтрока.ФондСтрахование =  ДанныеДляРасчетаЕСН.БазаДоходСтрах; //БазаФСЗНПрошлогоМесПроверка1;//О.Т. 16.09.2014 № 222 264
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656
		
		если Пересчет Тогда 
			ТЗДляПересчета = ДанныеДляРасчДляМинусов.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ДанныеДляРасчетаЕСН.ФизЛицо,ДанныеДляРасчетаЕСН.Месяц));
			Для Каждого стрДляПересчета из ТЗДляПересчета Цикл 
				НоваяСтрока.ФондФСЗН = НоваяСтрока.ФондФСЗН - стрДляПересчета.БазаДоходФСЗН;
				НоваяСтрока.ФСЗН = НоваяСтрока.ФСЗН - стрДляПересчета.НачисленныйФСЗН;
				НоваяСтрока.ФондСтрахование = НоваяСтрока.ФондСтрахование - стрДляПересчета.БазаДоходСтрах;
				НоваяСтрока.ОбязательноеСтрахование = НоваяСтрока.ОбязательноеСтрахование - стрДляПересчета.НачисленныйСтрах;
				НоваяСтрока.ФондЕдиный = НоваяСтрока.ФондЕдиный - стрДляПересчета.БазаДоходЕдиныйПлатеж;
				НоваяСтрока.ЕдиныйПлатеж = НоваяСтрока.ЕдиныйПлатеж - стрДляПересчета.НачисленныйЕдиныйПлатеж;
				НоваяСтрока.ПенсионныйФонд = НоваяСтрока.ПенсионныйФонд - стрДляПересчета.ПенсионныйФонд;
			КонецЦикла;
		КонецЕсли;
		
		
		//О.Т. 08.08.2014 № 17522
		если НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц) >= Дата(2014,7,1) и НоваяСтрока.ОбязательноеСтрахование > 0 Тогда 
			если не (СотрудникОсн.ТипРаботника = Перечисления.ТипыРаботников.ДоговорПодряда или СотрудникОсн.ТипРаботника = Перечисления.ТипыРаботников.Практикант) Тогда 
				СрЗПРабочихИСлуж = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц)-1,
				Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗП)).размер;
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА ВЫБОР
				|					КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|						ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
				|					ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
				|				КОНЕЦ
				|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
				|	КОНЕЦ КАК ВидРасчета
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
				|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
				|ГДЕ
				|	ВЫБОР
				|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
				|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	НачисленияРаботниковОрганизации.ВидРасчета
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
				|ГДЕ
				|	НачисленияРаботниковОрганизации.Период > &парамНачало
				|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
				|	И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
				|	И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
				|	И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
				|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|			ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
				|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
				|	КОНЕЦ
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковПроверка
				|		ПО НачисленияРаботниковОрганизации.Сотрудник = НачисленияРаботниковПроверка.Сотрудник
				|			И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение = НачисленияРаботниковПроверка.ВидРасчетаИзмерение
				|			И НачисленияРаботниковОрганизации.ДокументОснование = НачисленияРаботниковПроверка.ДокументОснование
				|			И (НачисленияРаботниковПроверка.Период > НачисленияРаботниковОрганизации.Период)
				|			И (НачисленияРаботниковПроверка.Период <= НачисленияРаботниковОрганизации.ПериодЗавершения)
				|ГДЕ
				|	НачисленияРаботниковОрганизации.ПериодЗавершения >= &парамНачало
				|	И НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамКонец
				|	И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
				|	И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
				|	И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
				|	И НачисленияРаботниковПроверка.Сотрудник ЕСТЬ NULL 
				|	И НачисленияРаботниковОрганизации.Сотрудник = &Сотрудник";
				
				Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
				Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
				Запрос.УстановитьПараметр("парамНачало", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
				Запрос.УстановитьПараметр("Сотрудник", СотрудникОсн);
				
				РезультатВидРасчета = Запрос.Выполнить().Выбрать();
				Пока РезультатВидРасчета.Следующий() Цикл
					ВидРасчета = РезультатВидРасчета.ВидРасчета;
					Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням или ВидРасчета =ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам или
						ВидРасчета =ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой Тогда //О.Т. 02.03.2015 № Наркевич
						Прервать;
					Иначе
					КонецЕсли;
				КонецЦикла;
				
				если ДанныеДляРасчетаЕСН.Месяц < Дата(2015,8,1) Тогда //О.Т. 31.08.2015 № 565
					// О.Т. 20.11.2014 295
					ЗапросДоплата = Новый Запрос;
					ЗапросДоплата.Текст = 
					"ВЫБРАТЬ
					|	СУММА(ЕСНИсчисленный.Доплата) КАК Доплата
					|ИЗ
					|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
					|ГДЕ
					|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
					|	И ЕСНИсчисленный.Организация = &Организация
					//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					|	И ЕСНИсчисленный.ПериодРегистрации <= &ПериодРегистрации
					|	И ЕСНИсчисленный.Регистратор <> &Регистратор
					//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1";
					
					ЗапросДоплата.УстановитьПараметр("Организация", Организация);
					//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					ЗапросДоплата.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
					ЗапросДоплата.УстановитьПараметр("Регистратор", Ссылка);
					//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					ЗапросДоплата.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
					ЗапросДоплата.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
					ЗапросДоплата.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
					
					РезультатЗапросаПрошл = ЗапросДоплата.Выполнить().Выбрать();
					СуммаПрошлДоплата = 0;
					Пока РезультатЗапросаПрошл.Следующий() Цикл
						СуммаПрошлДоплата = РезультатЗапросаПрошл.Доплата;
					КонецЦикла;
					если СуммаПрошлДоплата = Неопределено или СуммаПрошлДоплата = Null Тогда 
						СуммаПрошлДоплата = 0;
					КонецЕсли;
					// О.Т. 20.11.2014 295
					если НормаПоИндивидГрафикуЧасыДля60 = Неопределено или НормаПоИндивидГрафикуЧасыДля60 = Неопределено Тогда
						ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог,НоваяСтрока);//О.Т. 16.02.2015 № 17778
						ЗаполнитьЗначенияСвойств(НоваяСтрокаИтогПоПроц,НоваяСтрока); //О.Т. Аверсон 18.04.2018 № 1870
						Продолжить;
					КонецЕсли;
					
					если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда 
						если НормаПоГрафикуДля60 > 0 Тогда 
							Если ДниТабельДля60 > НормаПоГрафикуДля60 Тогда
								ДниТабельДля60 =  НормаПоГрафикуДля60;
							КонецЕсли; //О.Т. 02.03.2015 № наркевич
							//если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда
							НоваяСтрока.МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ДниТабельДля60 / НормаПоГрафикуДля60 * ЗанимаемыхСтавок;
							//Иначе 
							//	НоваяСтрока.МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ДниТабельДля60 / НормаПоГрафикуДля60;
							//КонецЕсли;
						иначе
							НоваяСтрока.МинРазмер60отСрЗП = 0;
						КонецЕсли;
					иначе
						если НормаПоГрафикуЧасыДля60 > 0 Тогда 
							Если ЧасыТабельДля60 > НормаПоГрафикуЧасыДля60 Тогда
								ЧасыТабельДля60 =  НормаПоГрафикуДля60;
							КонецЕсли;//О.Т. 02.03.2015 № Наркевич
							//если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда
							НоваяСтрока.МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ЧасыТабельДля60 / НормаПоГрафикуЧасыДля60 * ЗанимаемыхСтавок;
							//Иначе 
							//	НоваяСтрока.МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ЧасыТабельДля60 / НормаПоГрафикуЧасыДля60;
							//КонецЕсли;
						ИначеЕсли НормаПоИндивидГрафикуЧасыДля60 > 0 Тогда 
							Если ЧасыТабельДля60 > НормаПоИндивидГрафикуЧасыДля60 Тогда
								ЧасыТабельДля60 =  НормаПоИндивидГрафикуЧасыДля60;
							КонецЕсли;//О.Т. 02.03.2015 № наркевич
							НоваяСтрока.МинРазмер60отСрЗП = СрЗПРабочихИСлуж * 0.6 * ЧасыТабельДля60 / НормаПоИндивидГрафикуЧасыДля60 * ЗанимаемыхСтавок;
							
						иначе
							НоваяСтрока.МинРазмер60отСрЗП = 0;
						КонецЕсли;
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					//// О.Т. 20.11.2014 295
					//Если ДанныеДляРасчетаЕСН.БазаДоходСтрах + БазаФСЗНПрошлогоМесПроверка < НоваяСтрока.МинРазмер60отСрЗП Тогда
					//	МинДоплата = НоваяСтрока.МинРазмер60отСрЗП * СтавкаОбязательноеСтрахование/100;
					//	если МинДоплата > НоваяСтрока.ОбязательноеСтрахование Тогда 
					//		НоваяСтрока.Доплата = МинДоплата - НоваяСтрока.ОбязательноеСтрахование -СуммаПрошлДоплата-БазаФСЗНПрошлогоМесПроверка*СтавкаОбязательноеСтрахование/100; // О.Т. 20.11.2014 295 наркевич
					//	иначе
					//		НоваяСтрока.Доплата = 0;
					//		НоваяСтрока.МинРазмер60отСрЗП = 0;
					//	КонецЕсли;
					//Иначе
					//	НоваяСтрока.МинРазмер60отСрЗП = 0;
					//	НоваяСтрока.Доплата = 0;
					//КонецЕсли;
					//// О.Т. 20.11.2014 295
					//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					
					//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					Если ДанныеДляРасчетаЕСН.БазаДоходСтрах < НоваяСтрока.МинРазмер60отСрЗП Тогда
						МинДоплата = ОбщегоНазначения.ОкруглитьПоВалюте( НоваяСтрока.МинРазмер60отСрЗП * СтавкаОбязательноеСтрахование/100, ВалютаРегл );
						ТекУровеньДоплаты = НоваяСтрока.ОбязательноеСтрахование + СуммаПрошлДоплата + ДанныеДляРасчетаЕСН.НачисленныйСтрах; 				 						
						если МинДоплата > ТекУровеньДоплаты Тогда 
							НоваяСтрока.Доплата = МинДоплата - ТекУровеньДоплаты;
						иначе
							НоваяСтрока.Доплата = 0;
							НоваяСтрока.МинРазмер60отСрЗП = 0;
						КонецЕсли;
					Иначе
						НоваяСтрока.МинРазмер60отСрЗП = 0;
						НоваяСтрока.Доплата = 0;
					КонецЕсли;
					//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		//О.Т. 08.08.2014 № 17522
		//ПСА 21.07.2021 СВФР-007884+++
		Если ЕстьИндивидСтавка И (СтавкаФСЗН = 0 и СтавкаОбязательноеСтрахование = 0) Тогда
			НоваяСтрока.ФондФСЗН = 0;
			НоваяСтрока.ФондСтрахование = 0;
		КонецЕсли;
		//+++ПСА 21.07.2021 СВФР-007884
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог,НоваяСтрока);//О.Т. 16.02.2015 № 17778
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИтогПоПроц,НоваяСтрока); //О.Т. Аверсон 18.04.2018 № 1870
		
		Если мПревышенияОграничения Тогда
			Если РасчетФСЗНПропорциональноНачислениям Тогда 
				//Островская Татьяна 08.04.2014 № 17239
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетЕСНОсновныеНачисления.НомерСтроки,
				|	РасчетЕСНОсновныеНачисления.ВидРасчета,
				|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
				|	РасчетЕСНОсновныеНачисления.Результат КАК Результат,
				|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН
				|ИЗ
				|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
				|ГДЕ
				|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
				|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
				|	И РасчетЕСНОсновныеНачисления.Ссылка.Организация = &Организация
				|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
				|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало
				|ИТОГИ
				|	СУММА(Результат)
				|ПО
				|	ОБЩИЕ";
				
				Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				Запрос.УстановитьПараметр("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетЕСНДополнительныеНачисления.ВидРасчета,
				|	РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
				|	РасчетЕСНДополнительныеНачисления.Результат КАК Результат,
				|	РасчетЕСНДополнительныеНачисления.КодДоходаЕСН,
				|	РасчетЕСНДополнительныеНачисления.НомерСтроки
				|ИЗ
				|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
				|ГДЕ
				|	РасчетЕСНДополнительныеНачисления.Ссылка = &Ссылка
				|	И РасчетЕСНДополнительныеНачисления.Ссылка.Организация = &Организация
				|	И РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
				|	И РасчетЕСНДополнительныеНачисления.ДоходФСЗН = &ДоходФСЗН
				|	И НАЧАЛОПЕРИОДА(РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &БазовыйПериодНачало
				|ИТОГИ
				|	СУММА(Результат)
				|ПО
				|	ОБЩИЕ";
				
				Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				Запрос.УстановитьПараметр("БазовыйПериодНачало", ДанныеДляРасчетаЕСН.Месяц);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				Запрос.УстановитьПараметр("Организация", Организация);
				
				
				ТаблицаДополнительныхНачислений = Запрос.Выполнить().Выгрузить();
				ИтогОсновные = 0;
				Если ТаблицаОсновныхНачислений.Количество()>0 Тогда 
					если ТаблицаОсновныхНачислений[0].ВидРасчета = Null Тогда
						ИтогОсновные = ТаблицаОсновныхНачислений[0].Результат;
					КонецЕсли;   					
				КонецЕсли;
				ИтогДополнительные = 0;
				Если ТаблицаДополнительныхНачислений.Количество()>0 Тогда 
					если ТаблицаДополнительныхНачислений[0].ВидРасчета = Null Тогда
						ИтогДополнительные = ТаблицаДополнительныхНачислений[0].Результат;
					КонецЕсли;   					
				КонецЕсли;
				ВсегоНачислено = ИтогОсновные + ИтогДополнительные;
				
				//+ СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				//УдельныйВесДляПропорции = БазаОграниченияФСЗН / ВсегоНачислено;
				//- СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				
				//+ СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				УдельныйВесДляПропорции = БазаДоходФСЗН / ВсегоНачислено;
				//- СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				
				СуммаДляПроверки = 0;
				//Островская Татьяна 08.04.2014 № 17239
				//ТаблицаОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура("ФизЛицо, ПериодДействияНачало, ДоходФСЗН", ДанныеДляРасчетаЕСН.ФизЛицо, НоваяСтрока.ПериодВзаиморасчетов, Перечисления.ДоходыФСС_НС.Облагается));
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					Если СтрокаВыборкиОсновныхНачислений.ВидРасчета = Null Тогда 
						Продолжить;
					КонецЕсли;
					
					СтрокаНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					
					НоваяСтрокаОН = ОсновныеНачисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаНачислений);
					
					СтрокаНачислений.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаНачислений.Результат * УдельныйВесДляПропорции,ПериодРегистрации);
					СуммаДляПроверки = СуммаДляПроверки + СтрокаНачислений.Результат;
					
					НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат - СтрокаНачислений.Результат; 
					НоваяСтрокаОН.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
					НоваяСтрокаОН.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
					
					
				КонецЦикла;
				
				Для Каждого СтрокаВыборкиДополнительныхНачислений Из ТаблицаДополнительныхНачислений Цикл
					Если СтрокаВыборкиДополнительныхНачислений.ВидРасчета = Null Тогда 
						Продолжить;
					КонецЕсли;
					
					СтрокаНачислений = ДополнительныеНачисления.Найти(СтрокаВыборкиДополнительныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					
					
					НоваяСтрокаОН = ДополнительныеНачисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаНачислений);
					
					СтрокаНачислений.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаНачислений.Результат * УдельныйВесДляПропорции,ПериодРегистрации);
					СуммаДляПроверки = СуммаДляПроверки + СтрокаНачислений.Результат;
					
					НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат - СтрокаНачислений.Результат; 
					НоваяСтрокаОН.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
					НоваяСтрокаОН.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
					
				КонецЦикла;
				
				//+ СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				//Если СуммаДляПроверки <> БазаОграниченияФСЗН
				//		и ( ТаблицаОсновныхНачислений.Количество() > 0 
				//			или ТаблицаДополнительныхНачислений.Количество() > 0 ) Тогда
				//	СтрокаНачислений.Результат = СтрокаНачислений.Результат - (СуммаДляПроверки - БазаОграниченияФСЗН);
				//	НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат + (СуммаДляПроверки - БазаОграниченияФСЗН);
				//КонецЕсли;
				//- СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				
				//+ СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				ДельтаОкругления = СуммаДляПроверки - БазаДоходФСЗН;
				Если ДельтаОкругления <> 0
					и ( ТаблицаОсновныхНачислений.Количество() > 0 
					или ТаблицаДополнительныхНачислений.Количество() > 0 ) Тогда
					СтрокаНачислений.Результат = СтрокаНачислений.Результат - ДельтаОкругления;
					НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат + ДельтаОкругления;
				КонецЕсли;
				//- СВЭЙ КДЯ 21.01.20 СВФР-005389 ( Пункт 1. )
				
			иначе				
				//Островская Татьяна 08.04.2014 № 17239
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетЕСНОсновныеНачисления.НомерСтроки,
				|	РасчетЕСНОсновныеНачисления.ВидРасчета,
				|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
				|	РасчетЕСНОсновныеНачисления.Результат,
				|	РасчетЕСНОсновныеНачисления.КодДоходаЕСН
				|ИЗ
				|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
				|ГДЕ
				|	РасчетЕСНОсновныеНачисления.Ссылка = &Ссылка
				|	И РасчетЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
				|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ДоходФСЗН
				|	И РасчетЕСНОсновныеНачисления.Ссылка.Организация = &Организация
				|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) = &ПериодДействияНачало";
				
				Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				Запрос.УстановитьПараметр("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
				//Островская Татьяна 08.04.2014 № 17239
				
				//ТаблицаОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура("ФизЛицо, ПериодДействияНачало, ДоходФСЗН", ДанныеДляРасчетаЕСН.ФизЛицо, НоваяСтрока.ПериодВзаиморасчетов, Перечисления.ДоходыФСС_НС.Облагается));
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					если СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
						или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка Тогда 
						Если мСуммаПревышения = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
						Иначе
							//разбиваем строку
							НоваяСтрокаОН = ОсновныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
							НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
							мСуммаПревышения = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();//Островская Татьяна 08.04.2014 № 17239
				Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
					СтрокаОсновныхНачислений = ОсновныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
					если не (СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни 
						или СтрокаОсновныхНачислений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка) Тогда
						Если мСуммаПревышения = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
						Иначе
							//разбиваем строку
							НоваяСтрокаОН = ОсновныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
							НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
							мСуммаПревышения = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла; 
				//Островская Татьяна 25.09.2013 № 16815
				Если мСуммаПревышения <> 0 Тогда
					//Островская Татьяна 08.04.2014 № 17239
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	РасчетЕСНДополнительныеНачисления.ВидРасчета,
					|	РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
					|	РасчетЕСНДополнительныеНачисления.Результат,
					|	РасчетЕСНДополнительныеНачисления.КодДоходаЕСН,
					|	РасчетЕСНДополнительныеНачисления.НомерСтроки
					|ИЗ
					|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
					|ГДЕ
					|	РасчетЕСНДополнительныеНачисления.Ссылка = &Ссылка
					|	И РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
					|	И РасчетЕСНДополнительныеНачисления.Ссылка.Организация = &Организация
					|	И РасчетЕСНДополнительныеНачисления.ДоходФСЗН = &ДоходФСЗН
					|	И НАЧАЛОПЕРИОДА(РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &БазовыйПериодНачало";
					
					Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
					Запрос.УстановитьПараметр("БазовыйПериодНачало", ДанныеДляРасчетаЕСН.Месяц);
					Запрос.УстановитьПараметр("Ссылка", Ссылка);
					Запрос.УстановитьПараметр("Организация", Организация);
					Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
					
					ТаблицаОсновныхНачислений = Запрос.Выполнить().Выгрузить();
					//Островская Татьяна 08.04.2014 № 17239
					
					//ТаблицаОсновныхНачислений = ДополнительныеНачисления.НайтиСтроки(Новый Структура("ФизЛицо, БазовыйПериодНачало, ДоходФСЗН", ДанныеДляРасчетаЕСН.ФизЛицо, НоваяСтрока.ПериодВзаиморасчетов, Перечисления.ДоходыФСС_НС.Облагается));
					Для Каждого СтрокаВыборкиОсновныхНачислений Из ТаблицаОсновныхНачислений Цикл
						СтрокаОсновныхНачислений = ДополнительныеНачисления.Найти(СтрокаВыборкиОсновныхНачислений.НомерСтроки,"НомерСтроки");//Островская Татьяна 08.04.2014 № 17239
						Если мСуммаПревышения = 0 Тогда
							Прервать;
						КонецЕсли;
						Если СтрокаОсновныхНачислений.Результат <= мСуммаПревышения Тогда
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							мСуммаПревышения = мСуммаПревышения - СтрокаОсновныхНачислений.Результат;
						Иначе
							//разбиваем строку
							НоваяСтрокаОН = ДополнительныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаОН, СтрокаОсновныхНачислений);
							СтрокаОсновныхНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							СтрокаОсновныхНачислений.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							СтрокаОсновныхНачислений.Результат = мСуммаПревышения;
							НоваяСтрокаОН.Результат = НоваяСтрокаОН.Результат-мСуммаПревышения;
							мСуммаПревышения = 0;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если мСуммаПревышения <> 0 Тогда
					ОбщегоНазначения.СообщитьОбОшибке(Строка(ДанныеДляРасчетаЕСН.ФизЛицо)+" ОШИБКА расчета ограничения !!!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		//енд        
		
		//Аверсон ЕАЕ 27.09.2022 СВФР-009584
		//корректировка ФСЗН (отр.суммы, превышающие 5-кратный средний заработок)
		//скорее всего, это возврат сумм предыдущего периода
		ФондФСЗН = НоваяСтрока.ФондФСЗН;
		ОстатокРаспределить = ФондФСЗН;
		Если ФондФСЗН < 0 Тогда
			//Проверяем на 5-кратное превышение (по среднему заработку предыдущего месяца)
			// Период предшествующий периоду регистрации (всего документа)
			ПредПериод = НачалоМесяца(ПериодРегистрации - 1);
			// Период предшествующий периоду взаиморасчетов (текущей строки )
			ПредМес = НачалоМесяца(НоваяСтрока.ПериодВзаиморасчетов - 1);
			СтруктураПенсПред = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПредМес, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
			РазмерСреднейЗарплатыПред = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(
				ПредМес, 
				Новый Структура(
					"ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников
				)
			).Размер;
			БазаОграниченияФСЗНПред = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
						
			Если ФондФСЗН < -БазаОграниченияФСЗНПред Тогда
				//Получим документ предыдущего периода (проведенный)
				//Найдем в нем строку с тек.физ.лицом, месяцем
				ДанныеПредыдущегоПериода = ПолучитьДанныеПредыдущегоПериода(ПредПериод, НоваяСтрока.ФизЛицо, НоваяСтрока.ПериодВзаиморасчетов);
				
				//Изменим суммы ФСЗН в тек.документе
				НоваяСтрока.ФондФСЗН = -ДанныеПредыдущегоПериода.ФондФСЗН;
				НоваяСтрока.ФСЗН = -ДанныеПредыдущегоПериода.ФСЗН;
				
				//Изменим суммы в основных начислениях
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
				СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
				СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
				СтрОсновныеНачисленияОблагается = ОсновныеНачисления.НайтиСтроки(СтруктураОтбора);
				Если СтрОсновныеНачисленияОблагается.Количество() > 0 Тогда
					НужнаяСтрока = СтрОсновныеНачисленияОблагается[0];
					ОблагаемаяСуммаОсновныеНачисления = НужнаяСтрока.Результат; //было до корректировки
					НужнаяСтрока.Результат = -ДанныеПредыдущегоПериода.ОблагаемаяСуммаОсновныеНачисления;
					ОстатокРаспределить = ОстатокРаспределить - НужнаяСтрока.Результат;
					ОстатокОсновныеНачисления = ОблагаемаяСуммаОсновныеНачисления - НужнаяСтрока.Результат;
					Остаток = Макс(ОстатокРаспределить,ОстатокОсновныеНачисления);
					//Если ОстатокРаспределить <> 0 Тогда
					Если Остаток <> 0 Тогда
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
						СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
						СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается);
						СтрОсновныеНачисленияНеОблагается = ОсновныеНачисления.НайтиСтроки(СтруктураОтбора);
						Если СтрОсновныеНачисленияНеОблагается.Количество() > 0 Тогда
							НужнаяСтр = СтрОсновныеНачисленияНеОблагается[0];
							НужнаяСтр.Результат = Остаток;
							ОстатокРаспределить = ОстатокРаспределить - НужнаяСтр.Результат;
						Иначе
							НоваяСтр = ОсновныеНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтр,НужнаяСтрока);
							НоваяСтр.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
							НоваяСтр.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
							НоваяСтр.Результат = Остаток;
							ОстатокРаспределить = ОстатокРаспределить - НоваяСтр.Результат;
						КонецЕсли;
					Иначе
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
						СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
						СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается);
						СтрОсновныеНачисленияНеОблагается = ОсновныеНачисления.НайтиСтроки(СтруктураОтбора);
						Если СтрОсновныеНачисленияНеОблагается.Количество() > 0 Тогда
							НужнаяСтр = СтрОсновныеНачисленияНеОблагается[0];
							ОсновныеНачисления.Удалить(ОсновныеНачисления.Индекс(НужнаяСтр));
						КонецЕсли;
					КонецЕсли;
					//КонецЕсли;
				КонецЕсли;
				
				//Изменим суммы в дополнительных начислениях
				Если ОстатокРаспределить <> 0 Тогда
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
					СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
					СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
					СтрДополнительныеНачисленияОблагается = ДополнительныеНачисления.НайтиСтроки(СтруктураОтбора);
					Если СтрДополнительныеНачисленияОблагается.Количество() > 0 Тогда
						НужнаяСтрока = СтрДополнительныеНачисленияОблагается[0];
						ОблагаемаяСуммаДополнительныеНачисления = НужнаяСтрока.Результат;
						НужнаяСтрока.Результат = -ДанныеПредыдущегоПериода.ОблагаемаяСуммаДополнительныеНачисления;
						ОстатокРаспределить = ОстатокРаспределить - НужнаяСтрока.Результат;
						ОстатокДополнительныеНачисления = ОблагаемаяСуммаДополнительныеНачисления - НужнаяСтрока.Результат;
						Остаток = Макс(ОстатокРаспределить,ОстатокДополнительныеНачисления);
						Если Остаток <> 0 Тогда
							СтруктураОтбора = Новый Структура;
							СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
							СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
							СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается);
							СтрДополнительныеНачисленияНеОблагается = ДополнительныеНачисления.НайтиСтроки(СтруктураОтбора);
							Если СтрДополнительныеНачисленияНеОблагается.Количество() > 0 Тогда
								НужнаяСтр = СтрДополнительныеНачисленияНеОблагается[0];
								НужнаяСтр.Результат = Остаток;
								//ОстатокРаспределить = ОстатокРаспределить - НоваяСтр.Результат;
							Иначе
								НоваяСтр = ДополнительныеНачисления.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтр,НужнаяСтрока);
								НоваяСтр.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
								НоваяСтр.КодДоходаЕСН = Справочники.ДоходыЕСН.ОблагаетсяСтрахиЕП;
								НоваяСтр.Результат = Остаток;
								//ОстатокРаспределить = ОстатокРаспределить - НоваяСтр.Результат;
							КонецЕсли;
						Иначе
							СтруктураОтбора = Новый Структура;
							СтруктураОтбора.Вставить("ФизЛицо", НоваяСтрока.ФизЛицо);
							СтруктураОтбора.Вставить("ПериодДействияНачало", НоваяСтрока.ПериодВзаиморасчетов);
							СтруктураОтбора.Вставить("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается);
							СтрДополнительныеНачисленияНеОблагается = ДополнительныеНачисления.НайтиСтроки(СтруктураОтбора);
							Если СтрДополнительныеНачисленияНеОблагается.Количество() > 0 Тогда
								НужнаяСтр = СтрДополнительныеНачисленияНеОблагается[0];
								ДополнительныеНачисления.Удалить(ДополнительныеНачисления.Индекс(НужнаяСтр));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				//Пенсионный
				БазаФСЗНДляПенсионного = ДанныеПредыдущегоПериода.ФондФСЗН + НоваяСтрока.ФондФСЗН;
				Пенс = Окр(БазаФСЗНДляПенсионного * 1 / 100,2);
				ПенсУжеРассчитанный = ПолучитьПенсУжеРассчитанный(НоваяСтрока.ФизЛицо, НоваяСтрока.ПериодВзаиморасчетов);
				НоваяСтрока.ПенсионныйФонд = Пенс - ПенсУжеРассчитанный;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИтог,НоваяСтрока,"ФондФСЗН,ФСЗН,ПенсионныйФонд");
				ЗаполнитьЗначенияСвойств(НоваяСтрокаИтогПоПроц,НоваяСтрока,"ФондФСЗН,ФСЗН,ПенсионныйФонд");
			КонецЕсли;	//Если ФондФСЗН < -БазаОграниченияФСЗНПред

			//+ Ништ 14.01.2026 свфр-017472
			НовСтрПериодВзаиморасчетов = НачалоМесяца(НоваяСтрока.ПериодВзаиморасчетов);
			// Если отрицательный фонд и период взаиморасчетов строки в предыдущих месяцах, то это корректировка
			Если НовСтрПериодВзаиморасчетов < НачалоМесяца(ПериодРегистрации) Тогда
				
				// Ищем все начисления в периоде взаиморасчетов
				ПараметрыЗапроса = Новый Структура();
				ПараметрыЗапроса.Вставить("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
				ПараметрыЗапроса.Вставить("ПериодДействия", ДанныеДляРасчетаЕСН.Месяц);
				ПараметрыЗапроса.Вставить("БазовыйПериодНачало", НовСтрПериодВзаиморасчетов);
				ПараметрыЗапроса.Вставить("БазовыйПериодКонец", КонецМесяца(НовСтрПериодВзаиморасчетов));
				НачисленияПериодаВзаиморасчетов = НайтиОсновныеИДопНачисления(ПараметрыЗапроса);
				
				струИзмененияФондов = Новый Структура(
					"флЕстьИзмененияФондФСЗН, флЕстьИзмененияФондСтрахование, ИспользуемаяБазаФСЗН, ИспользуемаяБазаБГС",
					Ложь, Ложь, ИспользуемаяБазаФСЗН, ИспользуемаяБазаБГС
				);
				
				// Сторнируем и корректируем ошибки основных начислений
				ТипНачисления = "Осн";
				струИзмененияФондов = КорректировкаНачисленийПериодаВзаиморасчетов(
					НачисленияПериодаВзаиморасчетов,
					ТипНачисления,
					ДанныеДляРасчетаЕСН,
					НоваяСтрока,
					струИзмененияФондов
				);
				
				// Сторнируем и корректируем ошибки дополнительных начислений
				ТипНачисления = "Доп";
				струИзмененияФондов = КорректировкаНачисленийПериодаВзаиморасчетов(
					НачисленияПериодаВзаиморасчетов,
					ТипНачисления,
					ДанныеДляРасчетаЕСН,
					НоваяСтрока,
					струИзмененияФондов
				);
				
				// Пересчитаем ФСЗН, Пенсионный, Страхование
				КорректироватьСтрокуТчИсчисленныйЕСН(
					струИзмененияФондов,
					НоваяСтрока,
					ДанныеДляРасчетаЕСН,
					ВалютаРегл,
					СтавкаПенсионныйФонд,
					СтавкаОбязательноеСтрахование,
					СтруктураСтрах,
					НоваяСтрокаИтог,
					НоваяСтрокаИтогПоПроц
				);
				
			КонецЕсли; //Если НовСтрПериодВзаиморасчетов < НачалоМесяца(ПериодРегистрации)
			//- Ништ 14.01.2026 свфр-017472				
			
		КонецЕсли;	//Если ФондФСЗН < 0
		//Аверсон СВФР-009584
		
	КонецЦикла;
	
	
	ИсчисленныйЕСН.Свернуть("ФизЛицо, ПериодВзаиморасчетов, ПроцентФСЗН", "ФондФСЗН, ФондЕдиный, ФондСтрахование, ПенсионныйФонд, ФСЗН, ЕдиныйПлатеж, ОбязательноеСтрахование,МинРазмер60отСрЗП,Доплата"); //О.Т. 08.08.2014 № 17522
	
	ИсчисленныйЕСНИтоги.Свернуть("ПериодВзаиморасчетов", "ФондФСЗН, ФондЕдиный, ФондСтрахование, ПенсионныйФонд, ФСЗН, ЕдиныйПлатеж, ОбязательноеСтрахование,Доплата");//О.Т. 16.02.2015 № 17778
	ИсчисленныйЕСНИтогиПоПроц.Свернуть("ПроцентФСЗН", "ФондФСЗН, ФондЕдиный, ФондСтрахование, ПенсионныйФонд, ФСЗН, ЕдиныйПлатеж, ОбязательноеСтрахование,Доплата"); //О.Т. Аверсон 18.04.2018 № 1870
	
КонецПроцедуры // РасчетЕСН()

//Аверсон ЕАЕ 27.09.2022 СВФР-009584
Функция ПолучитьДанныеПредыдущегоПериода(ПериодРегистрацииПред, ФизЛицо, Мес)
	ДанныеПредПериода = Новый Структура;
	ДанныеПредПериода.Вставить("ФондФСЗН", 0);
	ДанныеПредПериода.Вставить("ФСЗН", 0);
	ДанныеПредПериода.Вставить("ОблагаемаяСуммаОсновныеНачисления",0);
	ДанныеПредПериода.Вставить("ОблагаемаяСуммаДополнительныеНачисления",0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(РасчетЕСНИсчисленныйЕСН.ФондФСЗН) КАК ФондФСЗН,
	|	СУММА(РасчетЕСНИсчисленныйЕСН.ФСЗН) КАК ФСЗН,
	|	РасчетЕСНИсчисленныйЕСН.ФизЛицо
	|ИЗ
	|	Документ.РасчетЕСН.ИсчисленныйЕСН КАК РасчетЕСНИсчисленныйЕСН
	|ГДЕ
	|	РасчетЕСНИсчисленныйЕСН.Ссылка.ПериодРегистрации = &Дата
	|	И РасчетЕСНИсчисленныйЕСН.Ссылка.Проведен
	|	И РасчетЕСНИсчисленныйЕСН.ФизЛицо = &ФизЛицо
	|	И РасчетЕСНИсчисленныйЕСН.ПериодВзаиморасчетов = &ПериодВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетЕСНИсчисленныйЕСН.ФизЛицо";
	
	Запрос.УстановитьПараметр("Дата", ПериодРегистрацииПред);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ПериодВзаиморасчетов", Мес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФондФСЗН) Тогда
			ДанныеПредПериода.ФондФСЗН = ВыборкаДетальныеЗаписи.ФондФСЗН;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФСЗН) Тогда
			ДанныеПредПериода.ФСЗН = ВыборкаДетальныеЗаписи.ФСЗН;	
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетЕСНОсновныеНачисления.ФизЛицо,
	|	СУММА(РасчетЕСНОсновныеНачисления.Результат) КАК РезультатОсновныеНачисления,
	|	0 КАК РезультатДополнительныеНачисления
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
	|ГДЕ
	|	РасчетЕСНОсновныеНачисления.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И РасчетЕСНОсновныеНачисления.Ссылка.Проведен
	|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
	|	И РасчетЕСНОсновныеНачисления.ПериодДействияНачало = &Мес
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетЕСНОсновныеНачисления.ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетЕСНДополнительныеНачисления.ФизЛицо,
	|	СУММА(РасчетЕСНДополнительныеНачисления.Результат),
	|	0
	|ИЗ
	|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
	|ГДЕ
	|	РасчетЕСНДополнительныеНачисления.Ссылка.ПериодРегистрации = &ПериодРегистрации
	|	И РасчетЕСНДополнительныеНачисления.Ссылка.Проведен
	|	И РасчетЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
	|	И РасчетЕСНДополнительныеНачисления.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
	|	И РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало = &Мес
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетЕСНДополнительныеНачисления.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанные.ФизЛицо,
	|	СУММА(ВТДанные.РезультатОсновныеНачисления) КАК РезультатОсновныеНачисления,
	|	СУММА(ВТДанные.РезультатДополнительныеНачисления) КАК РезультатДополнительныеНачисления
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанные.ФизЛицо";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрацииПред);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("Мес", Мес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РезультатОсновныеНачисления) Тогда
			ДанныеПредПериода.ОблагаемаяСуммаОсновныеНачисления = ВыборкаДетальныеЗаписи.РезультатОсновныеНачисления;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РезультатДополнительныеНачисления) Тогда
			ДанныеПредПериода.ОблагаемаяСуммаДополнительныеНачисления = ВыборкаДетальныеЗаписи.РезультатДополнительныеНачисления;	
		КонецЕсли;
	КонецЕсли;
	Возврат ДанныеПредПериода;
КонецФункции

Функция ПолучитьПенсУжеРассчитанный(ФизЛицо, Мес)
	Пенс = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСНИсчисленныйОбороты.ФизЛицо,
	|	СУММА(ЕСНИсчисленныйОбороты.ПенсионныйФондОборот) КАК ПенсионныйФонд
	|ИЗ
	|	РегистрНакопления.ЕСНИсчисленный.Обороты(
	|			,
	|			,
	|			,
	|			ФизЛицо = &ФизЛицо
	|				И ПериодВзаиморасчетов = &Мес) КАК ЕСНИсчисленныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСНИсчисленныйОбороты.ФизЛицо";
	
	Запрос.УстановитьПараметр("Мес", Мес);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Пенс = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
	КонецЕсли;
	
	Возврат Пенс;
КонецФункции
//Аверсон СВФР-009584

// Процедура рассчитывает скидки по зарегистрированным доходам и записывает их в реквизит "Скидка" набора записей регистра "ЕСНДополнительныеНачисления"
// При расчете учитываются ранее предоставленные скидки в прошлых периодах и в текущем. 
// Если скидки были не предоставлены или неверно рассчитаны, то происходит их корректировка.
//
Процедура РасчетСкидокКДоходам(ГоловнаяОрганизация, НаборЗаписейДополнительный)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("парамРегистратор",					Ссылка);
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации",	КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация",			ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамАвторскиеВознаграждения",		Справочники.ДоходыЕСН.ДоговораАвторские);
	Запрос.УстановитьПараметр("парамНачалоГода",					НачалоГода(ПериодРегистрации));
	
	// ---------------------------------------------------------------------------------------
	// Тексты запросов
	
	// ДоходыПоФизлицамКодам
	// Сведения о ранее предоставленных скидках и доходах налогового периода
	// Предполагается, что доходы, по которым могут быть предоставлены скидки, не регистрируются 
	// в регистре "ЕСНОсновныеНачисления".
	
	ДоходыПоФизлицамКодам = 
	"ВЫБРАТЬ
	|		ЕСНДополнительныеНачисления.Физлицо,
	|		ЕСНДополнительныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
	|		ЕСНДополнительныеНачисления.Результат КАК Результат,
	|		ЕСНДополнительныеНачисления.Скидка КАК Скидка
	|	ИЗ
	|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|	ГДЕ
	|		ЕСНДополнительныеНачисления.ПериодРегистрации МЕЖДУ &парамНачалоГода И &парамКонецМесяцаПериодаРегистрации
	|		И ЕСНДополнительныеНачисления.Регистратор = &парамРегистратор
	|		И ЕСНДополнительныеНачисления.Организация = &парамГоловнаяОрганизация
	|		И ЕСНДополнительныеНачисления.КодДоходаЕСН <> &парамАвторскиеВознаграждения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕСНСведенияОДоходах.Физлицо,
	|		ЕСНСведенияОДоходах.КодДоходаЕСН,
	|		ЕСНСведенияОДоходах.Результат,
	|		ЕСНСведенияОДоходах.Скидка
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЕСНДополнительныеНачисления.Физлицо
	|		ИЗ
	|			РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|		ГДЕ
	|			ЕСНДополнительныеНачисления.Регистратор = &парамРегистратор) КАК СписокФизЛиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
	|			ПО ЕСНСведенияОДоходах.Физлицо = СписокФизЛиц.Физлицо
	|	ГДЕ
	|		ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоГода И &парамКонецМесяцаПериодаРегистрации
	|		И ЕСНСведенияОДоходах.КодДоходаЕСН <> &парамАвторскиеВознаграждения
	|		И ЕСНСведенияОДоходах.Организация = &парамГоловнаяОрганизация";
	
	// Добавим сведения о нормативных размерах скидок ЕСН по кодам доходов
	// ДанныеОДоходахИСкидках
	
	ДанныеОСкидках = 
	"ВЫБРАТЬ
	|	ДоходыПоМесяцам.Физлицо,
	|	ДоходыПоМесяцам.КодДоходаЕСН КАК КодДоходаЕСН,
	|	СУММА(ДоходыПоМесяцам.Результат) КАК РезультатЗаГод,
	|	СУММА(ДоходыПоМесяцам.Скидка) КАК ПредоставленнаяСкидкаЗаГод,
	|	ЕСНСкидкиКДоходам.ГодоваяСкидка КАК ПравоНаСкидку
	|ИЗ
	|	( " + ДоходыПоФизлицамКодам +  ") КАК ДоходыПоМесяцам 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЕСНСкидкиКДоходам.СрезПоследних(&парамНачалоГода, ) КАК ЕСНСкидкиКДоходам
	|		ПО ЕСНСкидкиКДоходам.КодДоходаЕСН = ДоходыПоМесяцам.КодДоходаЕСН
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоМесяцам.Физлицо,
	|	ДоходыПоМесяцам.КодДоходаЕСН,
	|	ЕСНСкидкиКДоходам.ГодоваяСкидка";
	
	
	Запрос.Текст = ДанныеОСкидках;
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Физлицо, КодДоходаЕСН");
	
	// Выгрузим набор для модификации скидки
	МодифицируемаяТаблица = НаборЗаписейДополнительный.Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		// В общем случае предоставляемая скидка есть
		Скидка = Мин(Выборка.РезультатЗаГод, Выборка.ПравоНаСкидку) - Выборка.ПредоставленнаяСкидкаЗаГод;
		
		Если Скидка = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		// Распределим скидку между строками о доходах
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,Выборка); // Физлицо, КодДоходаЕСН
		
		НайдСтроки = МодифицируемаяТаблица.НайтиСтроки(СтруктураПоиска);
		Если НайдСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ОсталосьРаспределить = Скидка;
		Для Каждого НайденнаяСтрока из НайдСтроки Цикл
			НайденнаяСтрока.Скидка = Мин(ОсталосьРаспределить, НайденнаяСтрока.Результат);
			ОсталосьРаспределить = ОсталосьРаспределить - НайденнаяСтрока.Скидка; 
		КонецЦикла; 
		// Остаток распределения сложим в первую строку
		НайдСтроки[0].Скидка = НайдСтроки[0].Скидка + ОсталосьРаспределить;
		
	КонецЦикла; 
	
	// Загрузим модифицированный набор
	НаборЗаписейДополнительный.Загрузить(МодифицируемаяТаблица);
	
КонецПроцедуры // РасчетСкидокКДоходам()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// расчет документа
//
Процедура РассчитатьЕСН(СпПересчетаПрошлМес = Неопределено,Пересчет = Ложь) Экспорт
	
	Отказ = Ложь;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Запишем данные о доходах из табличных частей в регистры расчетов
	НаборЗаписейОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
	НаборЗаписейОДоходах.Отбор.Регистратор.Значение = Ссылка;
	
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам(ВыборкаПоШапкеДокумента).Выбрать();
	
	Пока ВыборкаПоДоходам.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, ВыборкаПоДоходам.ТипСтроки);
		Если Не Отказ Тогда
			СтрокаНабора = НаборЗаписейОДоходах.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоДоходам);
			ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоШапкеДокумента);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейОДоходах.Записать();
	
	// Вызовем функцию расчета ЕСН (результат расчета помещается в табличную часть  "ИсчисленныйЕСН")
	РасчетЕСН(ВыборкаПоШапкеДокумента.Организация,СпПересчетаПрошлМес,Пересчет);
	
	//+ СВЭЙ КДЯ 25.11.19 СВФР-005103
	УстановитьНеОблагаетсяДляНулевыхСтавок( ОсновныеНачисления );
	УстановитьНеОблагаетсяДляНулевыхСтавок( ДополнительныеНачисления );
	//- СВЭЙ КДЯ 25.11.19 СВФР-005103
	
	// Очистим ранее записанные в регистр сведения о доходах
	НаборЗаписейОДоходах.Очистить();
	НаборЗаписейОДоходах.Записать();
	
	Если ФормироватьКорректировкуФСЗН Тогда 
		//Попытка
		Записать(РежимЗаписиДокумента.Проведение);
		
		ТЗРаботники = Новый ТаблицаЗначений;
		ТЗРаботники.Колонки.Добавить("ФизЛицо");
		ТЗРаботники.Колонки.Добавить("СтавкаФСЗН");
		ТЗРаботники.Колонки.Добавить("СтавкаПенс");
		ТЗРаботники.Колонки.Добавить("ФондЗП"); 
		
		ДокументКорректировака = Документы.КорректирокаФСЗН.СоздатьДокумент();
		ДокументКорректировака.Дата = ТекущаяДата();
		ДокументКорректировака.Организация = Организация;
		ДокументКорректировака.ПериодРегистрации = ПериодРегистрации;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСНИсчисленный.ФизЛицо,
		|	СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|	СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	ВложенныйЗапрос.Результат КАК ФондЗП,
		|	ВложенныйЗапрос.ПериодДействия,
		|	ВложенныйЗапрос.СотрудникВидНалогообложенияОсновной
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|		СУММА(ВложенныйЗапрос.Результат) КАК Результат,
		|		ВложенныйЗапрос.ПериодДействия КАК ПериодДействия,
		|		ВложенныйЗапрос.СотрудникВидНалогообложенияОсновной КАК СотрудникВидНалогообложенияОсновной
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ЕСНОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|			СУММА(ЕСНОсновныеНачисления.Результат) КАК Результат,
		|			НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ) КАК ПериодДействия,
		|			ЕСНОсновныеНачисления.Сотрудник.ВидНалогообложенияОсновной КАК СотрудникВидНалогообложенияОсновной
		|		ИЗ
		|			РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
		|		ГДЕ
		|			ЕСНОсновныеНачисления.ПериодДействияНачало МЕЖДУ &ПериодДействия И &ПериодДействия1
		|			И ЕСНОсновныеНачисления.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		|			И ЕСНОсновныеНачисления.Организация = &Организация  //Аверсон 09.04.2020 КВВ СВФР-005839
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЕСНОсновныеНачисления.ФизЛицо,
		|			НАЧАЛОПЕРИОДА(ЕСНОсновныеНачисления.ПериодДействияНачало, МЕСЯЦ),
		|			ЕСНОсновныеНачисления.Сотрудник.ВидНалогообложенияОсновной
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ЕСНДополнительныеНачисления.ФизЛицо,
		|			СУММА(ЕСНДополнительныеНачисления.Результат),
		|			НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ),
		|			ЕСНДополнительныеНачисления.Сотрудник.ВидНалогообложенияОсновной
		|		ИЗ
		|			РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
		|		ГДЕ
		|			ЕСНДополнительныеНачисления.БазовыйПериодНачало МЕЖДУ &ПериодДействия И &ПериодДействия1
		|			И ЕСНДополнительныеНачисления.ДоходФСЗН = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		|			И ЕСНДополнительныеНачисления.Организация = &Организация  //Аверсон 09.04.2020 КВВ СВФР-005839
		|
		|		СГРУППИРОВАТЬ ПО
		|			ЕСНДополнительныеНачисления.ФизЛицо,
		|			НАЧАЛОПЕРИОДА(ЕСНДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ),
		|			ЕСНДополнительныеНачисления.Сотрудник.ВидНалогообложенияОсновной) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.ФизЛицо,
		|		ВложенныйЗапрос.ПериодДействия,
		|		ВложенныйЗапрос.СотрудникВидНалогообложенияОсновной) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|		ПО ВложенныйЗапрос.ФизЛицо = ЕСНИсчисленный.ФизЛицо
		|			И (ВложенныйЗапрос.ПериодДействия = НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ))
		|ГДЕ
		|	ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодДействия И &ПериодДействия1
		|	И ЕСНИсчисленный.Организация = &Организация  //Аверсон 09.04.2020 КВВ СВФР-005839
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ПериодДействия,
		|	ВложенныйЗапрос.СотрудникВидНалогообложенияОсновной,
		|	ЕСНИсчисленный.ФизЛицо,
		|	ВложенныйЗапрос.Результат";
		
		Запрос.УстановитьПараметр("ПериодДействия", НачалоКвартала(ПериодРегистрации));
		Запрос.УстановитьПараметр("ПериодДействия1", КонецКвартала(ПериодРегистрации)); //О.Т. Аверсон 15.01.2018 № 1445 квартал
		Запрос.УстановитьПараметр("Организация", Организация);  //Аверсон 09.04.2020 КВВ СВФР-005839
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ТЗСводная = Новый ТаблицаЗначений;
		ТЗСводная.Колонки.Добавить("ПериодВзаиморасчетов");	
		ТЗСводная.Колонки.Добавить("ФондЗП");
		ТЗСводная.Колонки.Добавить("НачисленныйФСЗН");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрРаботникиОрганизации = ДокументКорректировака.РаботникиОрганизации.Добавить();
			СтрРаботникиОрганизации.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
			СтрРаботникиОрганизации.ФондЗП = ВыборкаДетальныеЗаписи.ФондЗП;
			СтрРаботникиОрганизации.ПериодВзаиморасчетов = ВыборкаДетальныеЗаписи.ПериодДействия;
			СтрРаботникиОрганизации.ПенсионныйФакт = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
			СтрРаботникиОрганизации.НачисленныйФСЗН = ВыборкаДетальныеЗаписи.ФСЗН;
			
			Если ВыборкаДетальныеЗаписи.СотрудникВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = ВыборкаДетальныеЗаписи.СотрудникВидНалогообложенияОсновной;
			КонецЕсли;
			
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
			СтрРаботникиОрганизации.ПенсионныйПлан = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаДетальныеЗаписи.ФондЗП * СтруктураПенс.Размер/ 100,Дата);
			СтрРаботникиОрганизации.ОтклонениеПенсионного = СтрРаботникиОрганизации.ПенсионныйФакт - СтрРаботникиОрганизации.ПенсионныйПлан;
			
			СтрСводная = ТЗСводная.Добавить();
			СтрСводная.ФондЗП = СтрРаботникиОрганизации.ФондЗП;
			СтрСводная.ПериодВзаиморасчетов = СтрРаботникиОрганизации.ПериодВзаиморасчетов;
			СтрСводная.НачисленныйФСЗН = СтрРаботникиОрганизации.НачисленныйФСЗН;
			
			СтрТЗРаботники = ТЗРаботники.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗРаботники,СтрРаботникиОрганизации);
			СтрТЗРаботники.СтавкаПенс = СтруктураПенс.Размер;
			СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));
			СтрТЗРаботники.СтавкаФСЗН = СтруктураФСЗН.Размер;
			
			
			
		КонецЦикла;
		
		ТЗСводная.Свернуть("ПериодВзаиморасчетов","ФондЗП,НачисленныйФСЗН");
		ДокументКорректировака.Сводная.Загрузить(ТЗСводная);
		
		ТЗРаботники.Свернуть("СтавкаФСЗН,СтавкаПенс","ФондЗП");
		СуммаРазрезаФондЗП = 0; 
		Для Каждого стр из ТЗРаботники Цикл 
			СуммаРазрезаФондЗП = СуммаРазрезаФондЗП + стр.ФондЗП*(стр.СтавкаФСЗН+стр.СтавкаПенс)/100;
			
		КонецЦикла;
		
		
		ОтклоненияФСЗН = ОбщегоНазначения.ОкруглитьЗначение2016(СуммаРазрезаФондЗП,Дата) - ДокументКорректировака.РаботникиОрганизации.Итог("НачисленныйФСЗН") -
		ДокументКорректировака.РаботникиОрганизации.Итог("ПенсионныйФакт") + ДокументКорректировака.РаботникиОрганизации.Итог("ОтклонениеПенсионного");
		
		ДокументКорректировака.ОтклоненияФСЗН = ОтклоненияФСЗН;
		
		Попытка          			   
			ДокументКорректировака.Записать(РежимЗаписиДокумента.Проведение); 			   
		Исключение
			ДокументКорректировака.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		//Исключение
		//  Сообщить("Ошибка корректировки ФСЗН");
		//КонецПопытки;
	КонецЕсли;
	
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 12
	//удаляем нулевы строки
	НулевыеСтроки = ИсчисленныйЕСН.НайтиСтроки( Новый Структура( 
	"ФСЗН,ПенсионныйФонд,ОбязательноеСтрахование,ЕдиныйПлатеж", 0, 0, 0, 0 ) );
	Для каждого НулеваяСтрока Из НулевыеСтроки Цикл
		ИсчисленныйЕСН.Удалить( НулеваяСтрока );	
	КонецЦикла; 
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 12
	
КонецПроцедуры // РассчитатьЕСН()

// Корректируем строку исчисленного ЕСН, если были изменения фондов
// Ништ 14.01.2026 свфр-017472
//
Процедура КорректироватьСтрокуТчИсчисленныйЕСН(
	струИзмененияФондов,
	СтрокаИсчисленногоЕСН, 
	ДанныеДляРасчетаЕСН, 
	ВалютаРегл, 
	СтавкаПенсионныйФонд,
	СтавкаОбязательноеСтрахование,
	СтруктураСтрах,
	СтрокаИсчисленногоЕСНИтог,
	СтрокаИсчисленногоЕСНИтогПоПроц
)

	Если струИзмененияФондов.флЕстьИзмененияФондФСЗН Или струИзмененияФондов.флЕстьИзмененияФондСтрахование Тогда
		сСписокСвойств = "";
	Иначе
		// Ничего не делаем
		Возврат;
	КонецЕсли;
	
	Если струИзмененияФондов.флЕстьИзмененияФондФСЗН Тогда
		
		//+ СВЭЙ КДЯ 17.03.20 СВФР-005656 16
		СтрокаИсчисленногоЕСН.ФСЗН = ОбщегоНазначения.ОкруглитьПоВалюте(
		    //+ Ништ 21.01.2026 свфр-017472
			// Используем СтрокаИсчисленногоЕСН.ФондФСЗН т.к. исходная ИспользуемаяБазаФСЗН была скорректирована
			//ИспользуемаяБазаФСЗН * НоваяСтрока.ПроцентФСЗН / 100
			СтрокаИсчисленногоЕСН.ФондФСЗН * СтрокаИсчисленногоЕСН.ПроцентФСЗН / 100,
			//- Ништ 21.01.2026 свфр-017472
			ВалютаРегл
		);
		//- СВЭЙ КДЯ 17.03.20 СВФР-005656 16
		
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		СтрокаИсчисленногоЕСН.ПенсионныйФонд = ОбщегоНазначения.ОкруглитьПоВалюте(
			//+ Ништ 21.01.2026 свфр-017472
			// Используем СтрокаИсчисленногоЕСН.ФондФСЗН т.к. исходная ИспользуемаяБазаФСЗН была скорректирована
			//ИспользуемаяБазаФСЗН * СтавкаПенсионныйФонд / 100,
			струИзмененияФондов.ИспользуемаяБазаФСЗН * СтавкаПенсионныйФонд / 100,
			//- Ништ 21.01.2026 свфр-017472
			ВалютаРегл
		) - ДанныеДляРасчетаЕСН.ПенсионныйФонд;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 11
		
		сСписокСвойств = ?(ПустаяСтрока(сСписокСвойств), "ФондФСЗН, ФСЗН, ПенсионныйФонд", сСписокСвойств + ", ФондФСЗН, ФСЗН, ПенсионныйФонд");
		
	КонецЕсли; // Если струИзмененияФондов.флЕстьИзмененияФондФСЗН
	
	Если струИзмененияФондов.флЕстьИзмененияФондСтрахование Тогда
		
		СтрокаИсчисленногоЕСН.ФондСтрахование =  струИзмененияФондов.ИспользуемаяБазаБГС - ?(БГСОтТекущихСумм, 0, ДанныеДляРасчетаЕСН.БазаДоходСтрах_Прошл);
		Если СтруктураСтрах.Ставка = 0 Тогда
			СтрокаИсчисленногоЕСН.ФондСтрахование = 0;
		КонецЕсли;
		
		СтрокаИсчисленногоЕСН.ОбязательноеСтрахование = ОбщегоНазначения.ОкруглитьПоВалюте(
			струИзмененияФондов.ИспользуемаяБазаБГС * СтавкаОбязательноеСтрахование / 100,
			ВалютаРегл
		) - ?(БГСОтТекущихСумм, 0, ДанныеДляРасчетаЕСН.НачисленныйСтрах);
		Если БГСОтТекущихСумм Тогда 
			СтрокаИсчисленногоЕСН.ФондСтрахование = струИзмененияФондов.ИспользуемаяБазаБГС - ДанныеДляРасчетаЕСН.БазаДоходСтрах_Прошл;
			СтрокаИсчисленногоЕСН.ОбязательноеСтрахование = ОбщегоНазначения.ОкруглитьПоВалюте(
				СтрокаИсчисленногоЕСН.ФондСтрахование * СтавкаОбязательноеСтрахование / 100,
				ВалютаРегл 
			);
		КонецЕсли;
		
		сСписокСвойств = ?(ПустаяСтрока(сСписокСвойств), "ФондСтрахование, ОбязательноеСтрахование", сСписокСвойств + ", ФондСтрахование, ОбязательноеСтрахование");
		
	КонецЕсли; // Если струИзмененияФондов.флЕстьИзмененияФондСтрахование

	ЗаполнитьЗначенияСвойств(СтрокаИсчисленногоЕСНИтог, СтрокаИсчисленногоЕСН, сСписокСвойств);
	ЗаполнитьЗначенияСвойств(СтрокаИсчисленногоЕСНИтогПоПроц, СтрокаИсчисленногоЕСН, сСписокСвойств);
	
КонецПроцедуры // ЗаполнитьСтрокуТчИсчисленныйЕСН()

// Ищем все начисления предыдущего периода для сотрудника
// Ништ 14.01.2026 свфр-017472
//
Функция НайтиОсновныеИДопНачисления(ПараметрыЗапроса)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСНОсновныеНачисления.ПериодРегистрации,
	|	""Осн"" КАК ТипНачисления,
	|	ЕСНОсновныеНачисления.Регистратор,
	|	ЕСНОсновныеНачисления.НомерСтроки,
	|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
	|	ЕСНОсновныеНачисления.ПериодДействия,
	|	ЕСНОсновныеНачисления.ПериодДействияНачало,
	|	ЕСНОсновныеНачисления.ПериодДействияКонец,
	|	ЕСНОсновныеНачисления.Сторно,
	|	ЕСНОсновныеНачисления.ФизЛицо,
	|	ЕСНОсновныеНачисления.Организация,
	|	ЕСНОсновныеНачисления.Результат,
	|	ОсновныеНачисленияОрганизаций.КодДоходаЕСН КАК КодДоходаЕСН_верный,
	|	ВЫБОР
	|		КОГДА ДоходыЕСН_верный.ВходитВБазуФСЗН
	|			ТОГДА &ОблагаетсяФСЗН
	|		КОГДА НЕ ДоходыЕСН_верный.ВходитВБазуФСЗН
	|			ТОГДА &НеОблагаетсяФСЗН
	|	КОНЕЦ КАК ДоходФСЗН_верный,
	|	ДоходыЕСН.Ссылка КАК КодДоходаЕСН,
	|	ЕСНОсновныеНачисления.ДоходФСЗН КАК ДоходФСЗН,
	|	НЕ ДоходыЕСН.Ссылка = ОсновныеНачисленияОрганизаций.КодДоходаЕСН КАК ОшибкаНачисления
	|ИЗ
	|	РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоходыЕСН КАК ДоходыЕСН
	|		ПО ЕСНОсновныеНачисления.КодДоходаЕСН = ДоходыЕСН.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|		ПО ЕСНОсновныеНачисления.ВидРасчета = ОсновныеНачисленияОрганизаций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоходыЕСН КАК ДоходыЕСН_верный
	|		ПО (ОсновныеНачисленияОрганизаций.КодДоходаЕСН = ДоходыЕСН_верный.Ссылка)
	|ГДЕ
	|	ЕСНОсновныеНачисления.Организация = &Организация
	|	И ЕСНОсновныеНачисления.ПериодДействия = &ПериодДействия
	|	И ЕСНОсновныеНачисления.ФизЛицо = &ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСНДополнительныеНачисления.ПериодРегистрации,
	|	""Доп"",
	|	ЕСНДополнительныеНачисления.Регистратор,
	|	ЕСНДополнительныеНачисления.НомерСтроки,
	|	ДополнительныеНачисленияОрганизаций.Ссылка,
	|	NULL,
	|	ЕСНДополнительныеНачисления.БазовыйПериодНачало,
	|	ЕСНДополнительныеНачисления.БазовыйПериодКонец,
	|	ЕСНДополнительныеНачисления.Сторно,
	|	ЕСНДополнительныеНачисления.ФизЛицо,
	|	ЕСНДополнительныеНачисления.Организация,
	|	ЕСНДополнительныеНачисления.Результат,
	|	ДополнительныеНачисленияОрганизаций.КодДоходаЕСН,
	|	ВЫБОР
	|		КОГДА ДоходыЕСН_верный.ВходитВБазуФСЗН
	|			ТОГДА &ОблагаетсяФСЗН
	|		КОГДА НЕ ДоходыЕСН_верный.ВходитВБазуФСЗН
	|			ТОГДА &НеОблагаетсяФСЗН
	|	КОНЕЦ,
	|	ДоходыЕСН.Ссылка,
	|	ЕСНДополнительныеНачисления.ДоходФСЗН,
	|	НЕ ДоходыЕСН.Ссылка = ДополнительныеНачисленияОрганизаций.КодДоходаЕСН
	|ИЗ
	|	РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоходыЕСН КАК ДоходыЕСН
	|		ПО ЕСНДополнительныеНачисления.КодДоходаЕСН = ДоходыЕСН.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ДополнительныеНачисленияОрганизаций
	|		ПО ЕСНДополнительныеНачисления.ВидРасчета = ДополнительныеНачисленияОрганизаций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоходыЕСН КАК ДоходыЕСН_верный
	|		ПО (ДополнительныеНачисленияОрганизаций.КодДоходаЕСН = ДоходыЕСН_верный.Ссылка)
	|ГДЕ
	|	ЕСНДополнительныеНачисления.Организация = &Организация
	|	И ЕСНДополнительныеНачисления.ФизЛицо = &ФизЛицо
	|	И ЕСНДополнительныеНачисления.БазовыйПериодНачало >= &БазовыйПериодНачало
	|	И ЕСНДополнительныеНачисления.БазовыйПериодКонец <= &БазовыйПериодКонец";
	
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ФизЛицо", 				ПараметрыЗапроса.ФизЛицо);
	Запрос.УстановитьПараметр("ПериодДействия", 		ПараметрыЗапроса.ПериодДействия);
	Запрос.УстановитьПараметр("БазовыйПериодНачало",	ПараметрыЗапроса.БазовыйПериодНачало);
	Запрос.УстановитьПараметр("БазовыйПериодКонец",		ПараметрыЗапроса.БазовыйПериодКонец);
	Запрос.УстановитьПараметр("ОблагаетсяФСЗН", 		Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("НеОблагаетсяФСЗН", 		Перечисления.ДоходыФСС_НС.НеОблагается);
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	
КонецФункции // НайтиОсновныеИДопНачисления()

// Сторнируем и корректируем ошибки основных и дополнительных начислений
//	Предусмотренные значения для ТипНачисления: "Осн", "Доп"
// Ништ 14.01.2026 свфр-017472
//
Функция КорректировкаНачисленийПериодаВзаиморасчетов(
	НачисленияПериодаВзаиморасчетов,
	ТипНачисления = "Осн",
	ДанныеДляРасчетаЕСН,
	СтрокаИсчисленногоЕСН,
	струИзмененияФондов
)
	Если ТипНачисления = "Осн" Тогда
		ИмяТчРегистратора = "ОсновныеНачисления";
	ИначеЕсли ТипНачисления = "Доп" Тогда
		ИмяТчРегистратора = "ДополнительныеНачисления";
	Иначе
		ТекстПредупреждения = "" +
		"Непредусмотренный тип начислений для строки с суммой корректировки ФСЗН " + 
		СтрокаИсчисленногоЕСН.ФондФСЗН + 
		". Сторнирование и корректировка могли быть выполнены не полностью. Обратитесь к разарботчикам.";
		
		Предупреждение(ТекстПредупреждения);
		Возврат струИзмененияФондов;
	КонецЕсли;
	
	// Ищем ошибки типа начислений
	КолонкиПоискаНачислений = "ВидРасчета, ФизЛицо, ПериодДействияНачало, ПериодДействияКонец, КодДоходаЕСН, ДоходФСЗН";
	ОшибкиНачислений = НачисленияПериодаВзаиморасчетов.НайтиСтроки(
		Новый Структура("ОшибкаНачисления, ТипНачисления", Истина, ТипНачисления)
	);
	Для Каждого СтрокаОшибки Из ОшибкиНачислений Цикл
		
		СтруПоискИсходной = Новый Структура(КолонкиПоискаНачислений);
		ЗаполнитьЗначенияСвойств(СтруПоискИсходной, СтрокаОшибки);
		СтруПоискИсходной.ПериодДействияКонец = НачалоДня(СтруПоискИсходной.ПериодДействияКонец);
		МассивИсходных = СтрокаОшибки.Регистратор[ИмяТчРегистратора].НайтиСтроки(СтруПоискИсходной);
		Для Каждого ИсходнаяСтрока Из МассивИсходных Цикл
			
			// Добавим сторнирующую строку типа начисления
			СтрокаСторно = ЭтотОбъект[ИмяТчРегистратора].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСторно, ИсходнаяСтрока, , "Результат");
			СтрокаСторно.Результат = -ИсходнаяСтрока.Результат;
			
			// Добавим корректирующую строку
			СтрокаКорректировка = ЭтотОбъект[ИмяТчРегистратора].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКорректировка, ИсходнаяСтрока, , "КодДоходаЕСН, ДоходФСЗН");
			СтрокаКорректировка.КодДоходаЕСН = СтрокаОшибки.КодДоходаЕСН_Верный;
			СтрокаКорректировка.ДоходФСЗН = СтрокаОшибки.ДоходФСЗН_верный;
			
			// Редактируем фонды строки исчисленного ЕСН
			
			// Проверяем Фонд ФСЗН
			Если СтрокаКорректировка.ДоходФСЗН = Перечисления.ДоходыФСС_НС.Облагается И ИсходнаяСтрока.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается Тогда
				// В этом случае увеличиваем величину фонда, рассчитанную к данному моменту
				СтрокаИсчисленногоЕСН.ФондФСЗН = СтрокаИсчисленногоЕСН.ФондФСЗН + СтрокаКорректировка.Результат;
				струИзмененияФондов.ИспользуемаяБазаФСЗН = струИзмененияФондов.ИспользуемаяБазаФСЗН + СтрокаКорректировка.Результат;
				струИзмененияФондов.флЕстьИзмененияФондФСЗН = Истина;
			ИначеЕсли СтрокаКорректировка.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается И ИсходнаяСтрока.ДоходФСЗН = Перечисления.ДоходыФСС_НС.Облагается Тогда
				// В этом случае уменьшаем величину фонда, рассчитанную к данному моменту
				СтрокаИсчисленногоЕСН.ФондФСЗН = СтрокаИсчисленногоЕСН.ФондФСЗН - СтрокаКорректировка.Результат;
				струИзмененияФондов.ИспользуемаяБазаФСЗН = струИзмененияФондов.ИспользуемаяБазаФСЗН - СтрокаКорректировка.Результат;
				струИзмененияФондов.флЕстьИзмененияФондФСЗН = Истина;
			КонецЕсли;	
			
			// Проверяем страховой фонд
			Если СтрокаКорректировка.ДоходСтрах = Перечисления.ДоходыФСС_НС.Облагается И ИсходнаяСтрока.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается Тогда
				струИзмененияФондов.ИспользуемаяБазаБГС = струИзмененияФондов.ИспользуемаяБазаБГС + СтрокаКорректировка.Результат;
				струИзмененияФондов.флЕстьИзмененияФондСтрахование = Истина;
			ИначеЕсли СтрокаКорректировка.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается И ИсходнаяСтрока.ДоходСтрах = Перечисления.ДоходыФСС_НС.Облагается Тогда
				струИзмененияФондов.ИспользуемаяБазаБГС = струИзмененияФондов.ИспользуемаяБазаБГС - СтрокаКорректировка.Результат;
				струИзмененияФондов.флЕстьИзмененияФондСтрахование = Истина;
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	Возврат струИзмененияФондов;
			
КонецФункции // КорректировкаНачисленийПериодаВзаиморасчетов()

//+ СВЭЙ КДЯ 25.11.19 СВФР-005103
Процедура УстановитьНеОблагаетсяДляНулевыхСтавок( ТЧ )
	ОсновнаяТЧ = ?(Найти(СокрЛП(ТЧ),"ОсновныеНачисления")>0,Истина,Ложь);  //Аверсон 05.08.2020 КВВ СВФР-006325
	
	Для каждого Стр Из ТЧ Цикл
		//+ СВЭЙ КДЯ 17.02.20 СВФР-005491
		//СтрокаСтавок = ЭтотОбъект.ИсчисленныйЕСН.Найти( Стр.ФизЛицо, "ФизЛицо" );
		//Если СтрокаСтавок <> Неопределено Тогда
		//	Если СтрокаСтавок.ФондФСЗН = 0 Тогда
		//		Стр.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
		//	КонецЕсли; 
		//	Если СтрокаСтавок.ФондЕдиный = 0 Тогда
		//		Стр.ДоходЕдиныйПлатеж = Перечисления.ДоходыФСС_НС.НеОблагается;
		//	КонецЕсли; 
		//	Если СтрокаСтавок.ФондСтрахование = 0 Тогда
		//		Стр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
		//	КонецЕсли; 
		//КонецЕсли;
		//- СВЭЙ КДЯ 17.02.20 СВФР-005491
		
		//+ СВЭЙ КДЯ 17.02.20 СВФР-005491
		
		//Аверсон 05.08.2020 КВВ СВФР-006325 (
		//	НайдСтроки = ЭтотОбъект.ИсчисленныйЕСН.НайтиСтроки( Новый Структура( "ФизЛицо", Стр.ФизЛицо ) );
		Отбор = Новый Структура();
		Отбор.Вставить("ФизЛицо",Стр.ФизЛицо);
		Отбор.Вставить("ПериодВзаиморасчетов",?(ОсновнаяТЧ,НачалоМесяца(Стр.ПериодДействияНачало),НачалоМесяца(Стр.БазовыйПериодНачало)));
		НайдСтроки = ЭтотОбъект.ИсчисленныйЕСН.НайтиСтроки(Отбор);
		//Аверсон 05.08.2020 КВВ СВФР-006325 )
		
		Если НайдСтроки.Количество() = 0 Тогда
			
			//Аверсон ЕАЕ 14.04.2022 СВФР-008953
			Если Стр.КодДоходаЕСН <>  Справочники.ДоходыЕСН.БольничныйИзФСЗН Тогда
				Стр.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяПолностью; //не найденнные строки тоже заполняем
			КонецЕсли;
			//Аверсон СВФР-008953
			
			Стр.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
			Стр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
			Продолжить;
		КонецЕсли; 
		
		ТЗ_ЕСН_ФЛ = ЭтотОбъект.ИсчисленныйЕСН.Выгрузить( НайдСтроки );
		ТЗ_ЕСН_ФЛ.Свернуть( "ФизЛицо", "ФондФСЗН, ФондЕдиный, ФондСтрахование" );  
		СтрокаСтавок = ТЗ_ЕСН_ФЛ[0];
		Если СтрокаСтавок <> Неопределено Тогда  
			Если СтрокаСтавок.ФондФСЗН = 0 
				И Стр.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням Тогда //СВЭЙ 18.10.2023 КВВ СВФР-011643
				Стр.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
			КонецЕсли; 
			Если СтрокаСтавок.ФондЕдиный = 0 Тогда
				Стр.ДоходЕдиныйПлатеж = Перечисления.ДоходыФСС_НС.НеОблагается;
			КонецЕсли; 
			Если СтрокаСтавок.ФондСтрахование = 0 Тогда
				Стр.ДоходСтрах = Перечисления.ДоходыФСС_НС.НеОблагается;
			КонецЕсли; 
			//ПСА 19.10.2021 СВФР-008261+++
			Если Стр.КодДоходаЕСН <>  Справочники.ДоходыЕСН.БольничныйИзФСЗН Тогда
				//ПСА 21.07.2021 СВФР-007884+++
				Если СтрокаСтавок.ФондФСЗН = 0 и СтрокаСтавок.ФондСтрахование = 0 Тогда
					Стр.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяПолностью;
				КонецЕсли;
				//+++ПСА 21.07.2021 СВФР-007884
			КонецЕсли;
			//+++ПСА 19.10.2021 СВФР-008261
		КонецЕсли;
		//- СВЭЙ КДЯ 17.02.20 СВФР-005491
	КонецЦикла; 	
КонецПроцедуры
//- СВЭЙ КДЯ 25.11.19 СВФР-005103

// заполнение доходов и расчет документа
//
Функция Автозаполнение(СпПересчетаПрошлМес = Неопределено,Пересчет = Ложь) Экспорт
	
	Отказ = Ложь;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат Не Отказ;
	КонецЕсли;
	
	// Удалим рассчитанный ранее исчисленный налог
	НаборЗаписейЕСНИсчисленный = РегистрыНакопления.ЕСНИсчисленный.СоздатьНаборЗаписей();
	НаборЗаписейЕСНИсчисленный.Отбор.Регистратор.Значение = Ссылка;
	
	// Создадим ссылки на наборы записей о доходах
	НаборЗаписейОсновной = РегистрыРасчета.ЕСНОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейОсновной.Отбор.Регистратор.Значение = Ссылка;
	
	НаборЗаписейДополнительный = РегистрыРасчета.ЕСНДополнительныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейДополнительный.Отбор.Регистратор.Значение = Ссылка;
	
	если не Пересчет Тогда 
		// Автозаполним наборы записей о доходах
		Отказ = АвтозаполнениеНаборовЗаписейОДоходах(НаборЗаписейОсновной, НаборЗаписейДополнительный,СпПересчетаПрошлМес);
	иначе
		мГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
		СпПересчетаПрошлМес = Новый ТаблицаЗначений;
		СпПересчетаПрошлМес.Колонки.Добавить("Сотрудник");
		СпПересчетаПрошлМес.Колонки.Добавить("ФизЛицо");
		СпПересчетаПрошлМес.Колонки.Добавить("Месяц");
		СпПересчетаПрошлМес.Колонки.Добавить("Отриц");
		СпПересчетаПрошлМес.Колонки.Добавить("Превышение");
		СпПересчетаПрошлМес.Колонки.Добавить("СуммаДляПревыш");
		
	КонецЕсли;
	
	// Расчет скидок к доходам
	НаборЗаписейДополнительный.Прочитать();
	//РасчетСкидокКДоходам(ВыборкаПоШапкеДокумента.Организация, НаборЗаписейДополнительный);
	НаборЗаписейДополнительный.Записать();
	
	// Считаем наборы записей о доходах и выгрузим их в табличные части документа
	НаборЗаписейОсновной.Прочитать();
	
	ВременнаяТаблица = НаборЗаписейОсновной.Выгрузить();
	ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,КодДоходаЕСН,ПериодДействияНачало,ПериодДействияКонец,ДоходФСЗН,ДоходСтрах,ДоходЕдиныйПлатеж","Результат");
	ОсновныеНачисления.Загрузить(ВременнаяТаблица);
	
	
	// НаборЗаписейДополнительный уже считан
	ВременнаяТаблица = НаборЗаписейДополнительный.Выгрузить();
	//толик    ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,КодДоходаЕСН,БазовыйПериодНачало,БазовыйПериодКонец,ДоходФСЗН,ДоходСтрах,ДоходЕдиныйПлатеж","Результат,Скидка");
	ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,КодДоходаЕСН,БазовыйПериодНачало,БазовыйПериодКонец,БазовыйНачало,БазовыйКонец,ДоходФСЗН,ДоходСтрах,ДоходЕдиныйПлатеж","Результат,Скидка");
	ДополнительныеНачисления.Загрузить(ВременнаяТаблица);
	
	//О.Т. 22.01.2015 № 
	ЗапросОтчисления = Новый Запрос;
	ЗапросОтчисления.Текст = 
	"ВЫБРАТЬ
	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидОтчисления,
	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.Размер,
	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.Период КАК Период,
	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения
	|ИЗ
	|	РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
	|ГДЕ
	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидОтчисления В(&ЗначенияОтчислений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	ЗначенияОтчислений = Новый СписокЗначений;
	ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд);
	ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН);
	ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды);
	ЗначенияОтчислений.Добавить(Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж);
	ЗапросОтчисления.УстановитьПараметр("ЗначенияОтчислений", ЗначенияОтчислений);
	ЗапросОтчисления.УстановитьПараметр("Период", ПериодРегистрации);
	ЗапросОтчисления.УстановитьПараметр("Организация", Организация);//О.Т. Аверсон 30.03.2016 № 950
	
	РезультатОтчисления = ЗапросОтчисления.Выполнить().Выбрать();
	
	
	
	ПериодПересчета = Дата(1,1,1);
	СтавкаПенсионныйФондИзм = Ложь;
	СтавкаФСЗНИзм = Ложь;
	СтавкаФСЗНИнвалидыИзм = Ложь;
	СтавкаЕдиныйПлатежИзм = Ложь;
	Пока РезультатОтчисления.Следующий() Цикл
		ПериодПересчета = РезультатОтчисления.Период;
		если РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд Тогда 
			СтавкаПенсПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,РезультатОтчисления.ВидНалогообложения));//О.Т. Аверсон 28.03.2016 № 950
			если СтавкаПенсПрошл.Размер <> РезультатОтчисления.Размер Тогда 
				СтавкаПенсионныйФондИзм = Истина;
			КонецЕсли;
		ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН Тогда
			СтавкаФСЗНПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,РезультатОтчисления.ВидНалогообложения));//О.Т. Аверсон 28.03.2016 № 950
			если СтавкаФСЗНПрошл.Размер <> РезультатОтчисления.Размер Тогда 
				СтавкаФСЗНИзм = Истина;
			КонецЕсли;
		ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды Тогда
			СтавкаИнвалидыПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,РезультатОтчисления.ВидНалогообложения));//О.Т. Аверсон 28.03.2016 № 950
			если СтавкаИнвалидыПрошл.Размер <> РезультатОтчисления.Размер Тогда 
				СтавкаФСЗНИнвалидыИзм = Истина;
			КонецЕсли; 
		ИначеЕсли РезультатОтчисления.ВидОтчисления = Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж Тогда
			СтавкаЕдиныйПлатежПрошл = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж,РезультатОтчисления.ВидНалогообложения));//О.Т. Аверсон 28.03.2016 № 950
			если СтавкаЕдиныйПлатежПрошл.Размер <> РезультатОтчисления.Размер Тогда 
				СтавкаЕдиныйПлатежИзм = Истина;
			КонецЕсли; 			
		КонецЕсли;	
	КонецЦикла;
	ЗапросОтчисленияСтрах = Новый Запрос;
	ЗапросОтчисленияСтрах.Текст = 
	"ВЫБРАТЬ
	|	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Ставка
	|ИЗ
	|	РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев КАК СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев
	|ГДЕ
	|	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период = &Период
	|	И СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Организация = &Организация";
	ЗапросОтчисленияСтрах.УстановитьПараметр("Период", ПериодРегистрации);
	ЗапросОтчисленияСтрах.УстановитьПараметр("Организация", Организация); //О.Т. Аверсон 28.03.2016 № 950
	РезультатОтчисленияСтрах = ЗапросОтчисленияСтрах.Выполнить().Выбрать();
	
	СтавкаОбязательноеСтрахованиеИзм = Ложь;
	Пока РезультатОтчисления.Следующий() Цикл
		СтавкаСтрах = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации-1);
		если СтавкаСтрах.Ставка <> РезультатОтчисления.Ставка Тогда 
			СтавкаОбязательноеСтрахованиеИзм = Истина;	
		КонецЕсли;	
	КонецЦикла;
	Если СтавкаПенсионныйФондИзм или СтавкаФСЗНИзм или СтавкаФСЗНИнвалидыИзм или СтавкаЕдиныйПлатежИзм или СтавкаОбязательноеСтрахованиеИзм Тогда
		если Пересчет Тогда 
			НаборЗаписейОсновной.Очистить();
			НаборЗаписейОсновной.Записать();
			ДанныеУчета = ПолучитьДанныеУчета("", Истина, Истина, мГоловнаяОрганизация,Истина,ПериодПересчета);
			НаборЗаписейОсновной.Прочитать();
			ОбработатьДанныеУчета(ДанныеУчета, Истина, НаборЗаписейОсновной,СпПересчетаПрошлМес,Новый ТаблицаЗначений);
			НаборЗаписейОсновной.Прочитать(); 
			
			НаборЗаписейДополнительный.Очистить();
			НаборЗаписейДополнительный.Записать();
			ДанныеУчета = ПолучитьДанныеУчета("", Ложь, Истина, мГоловнаяОрганизация,Истина,ПериодПересчета);
			ОбработатьДанныеУчета(ДанныеУчета, Истина, НаборЗаписейДополнительный,СпПересчетаПрошлМес,Новый ТаблицаЗначений);
			
			НаборЗаписейДополнительный.Прочитать(); 
			НаборЗаписейДополнительный.Записать();
			
			НаборЗаписейОсновной.Прочитать();
			
			ВременнаяТаблица = НаборЗаписейОсновной.Выгрузить();
			ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,КодДоходаЕСН,ПериодДействияНачало,ПериодДействияКонец,ДоходФСЗН,ДоходСтрах,ДоходЕдиныйПлатеж","Результат");
			ОсновныеНачисления.Загрузить(ВременнаяТаблица);
			
			ВременнаяТаблица = НаборЗаписейДополнительный.Выгрузить();
			ВременнаяТаблица.Свернуть("ВидРасчета,Сотрудник,ФизЛицо,КодДоходаЕСН,БазовыйПериодНачало,БазовыйПериодКонец,БазовыйНачало,БазовыйКонец,ДоходФСЗН,ДоходСтрах,ДоходЕдиныйПлатеж","Результат,Скидка");
			ДополнительныеНачисления.Загрузить(ВременнаяТаблица);
		КонецЕсли;
		
	КонецЕсли; 
	//О.Т. 22.01.2015 № 
	
	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ЕСНОсновныеНачисления") 
			или ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ЕСНДополнительныеНачисления") Тогда
			
			// Удаляем движения
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить("Не выполнено автоматическое заполнение данных о доходах. Расчет не произведен!");
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции // Автозаполнение()

// автозаполнения колонки "Скидка" табличной части "ДополнительныеНачисления"
//
Процедура РассчитатьСкидки() Экспорт
	
	Отказ = Ложь;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Запишем данные о доходах из табличной части в регистр расчета
	НаборЗаписейДополнительный = РегистрыРасчета.ЕСНДополнительныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписейДополнительный.Отбор.Регистратор.Значение = Ссылка;
	
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам(ВыборкаПоШапкеДокумента).Выбрать();
	
	Пока ВыборкаПоДоходам.Следующий() Цикл
		Если ВыборкаПоДоходам.ТипСтроки = "Дополнительные" Тогда
			ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, ВыборкаПоДоходам.ТипСтроки);
			Если Не Отказ Тогда
				СтрокаНабора = НаборЗаписейДополнительный.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоДоходам,,"Скидка");
				ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоШапкеДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// запишем движения
	НаборЗаписейДополнительный.Записать();
	
	// Вызовем функцию расчета скидок по набору записей регистра о дополнительных доходах 
	//РасчетСкидокКДоходам(ВыборкаПоШапкеДокумента.Организация, НаборЗаписейДополнительный);
	ДополнительныеНачисления.Загрузить(НаборЗаписейДополнительный.Выгрузить());
	
	// Очистим ранее записанные в регистры расчетов сведения о доходах
	НаборЗаписейДополнительный.Очистить();
	НаборЗаписейДополнительный.Записать();
	
КонецПроцедуры // РассчитатьСкидки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//	нет
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетЕСН.Дата,
	|	РасчетЕСН.Организация КАК ОбособленноеПодразделение,
	|	РасчетЕСН.Ответственный,
	|	РасчетЕСН.ПериодРегистрации КАК ПериодРегистрации,
	|	РасчетЕСН.ПериодРегистрации КАК Период,
	|	ВЫБОР
	|		КОГДА РасчетЕСН.Организация.ГоловнаяОрганизация = &ПустаяОрганизация
	|			ТОГДА РасчетЕСН.Организация
	|		ИНАЧЕ РасчетЕСН.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	РасчетЕСН.Ссылка
	|ИЗ
	|	Документ.РасчетЕСН КАК РасчетЕСН
	|ГДЕ
	|	РасчетЕСН.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Период) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Формирует запрос по табличным частям документа "ОсновныеНачисление" и "ДополнительныеНачисления"
//
Функция СформироватьЗапросПоДоходам(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("парамРегистратор",		Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяДата",				 Дата('00010101'));
	//+ СВЭЙ КДЯ 25.11.19 СВФР-005103
	Запрос.УстановитьПараметр("Период",	ВыборкаПоШапкеДокумента.ПериодРегистрации);
	//- СВЭЙ КДЯ 25.11.19 СВФР-005103
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ТипСтроки,
	|	ВложенныйЗапрос.НомерСтроки,
	|	ВложенныйЗапрос.СпособРасчета,
	|	ВложенныйЗапрос.ВидВремени,
	|	ВложенныйЗапрос.ВидРасчета,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Физлицо,
	|	ВложенныйЗапрос.КодДоходаЕСН,
	|	ВложенныйЗапрос.ДоходФСЗН,
	|	ВложенныйЗапрос.ДоходЕдиныйПлатеж,
	|	ВложенныйЗапрос.ДоходСтрах,
	|	ВложенныйЗапрос.Результат КАК Результат,
	|	ВложенныйЗапрос.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВложенныйЗапрос.ПериодДействияНачало,
	|	ВложенныйЗапрос.ПериодДействияКонец,
	|	ВложенныйЗапрос.ГрафикРаботы,
	|	ВложенныйЗапрос.СуммированныйУчетРабочегоВремени,
	|	ВложенныйЗапрос.Скидка,
	|	ВложенныйЗапрос.ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВложенныйЗапрос.БазовыйНачало,
	|	ВложенныйЗапрос.БазовыйКонец,
	|	ВложенныйЗапрос.СотрудникНаименование КАК СотрудникНаименование
	//+ СВЭЙ КДЯ 25.11.19 СВФР-005103
	|	ПОМЕСТИТЬ ВтДоходы
	//- СВЭЙ КДЯ 25.11.19 СВФР-005103
	|ИЗ
	|	(ВЫБРАТЬ
	|		""Основные"" КАК ТипСтроки,
	|		Основные.НомерСтроки КАК НомерСтроки,
	|		Основные.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|		Основные.ВидРасчета.ВидВремени КАК ВидВремени,
	|		Основные.ВидРасчета КАК ВидРасчета,
	|		Основные.Сотрудник КАК Сотрудник,
	|		Основные.Сотрудник.Физлицо КАК Физлицо,
	|		Основные.КодДоходаЕСН КАК КодДоходаЕСН,
	|		Основные.ДоходФСЗН КАК ДоходФСЗН,
	|		Основные.ДоходЕдиныйПлатеж КАК ДоходЕдиныйПлатеж,
	|		Основные.ДоходСтрах КАК ДоходСтрах,
	|		Основные.Результат КАК Результат,
	|		Основные.ПериодДействияНачало КАК ПериодВзаиморасчетов,
	|		Основные.ПериодДействияНачало КАК ПериодДействияНачало,
	|		ВЫБОР
	|			КОГДА Основные.ПериодДействияКонец <> &ПустаяДата
	|				ТОГДА КОНЕЦПЕРИОДА(Основные.ПериодДействияКонец, ДЕНЬ)
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ КАК ПериодДействияКонец,
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрез.ПериодЗавершения <= Основные.ПериодДействияНачало
	|					И РаботникиОрганизацииСрез.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрез.ГрафикРаботыЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрез.ГрафикРаботы
	|		КОНЕЦ КАК ГрафикРаботы,
	|		ЕСТЬNULL(ВЫБОР
	|				КОГДА РаботникиОрганизацииСрез.ПериодЗавершения <= Основные.ПериодДействияНачало
	|						И РаботникиОрганизацииСрез.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрез.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|				ИНАЧЕ РаботникиОрганизацииСрез.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|			КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|		0 КАК Скидка,
	|		ВЫБОР
	|			КОГДА Основные.Сотрудник.Организация = &ГоловнаяОрганизация
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|		NULL КАК БазовыйНачало,
	|		NULL КАК БазовыйКонец,
	|		Основные.Сотрудник.Наименование КАК СотрудникНаименование
	|	ИЗ
	|		Документ.РасчетЕСН.ОсновныеНачисления КАК Основные
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РаботникиОрганизацииСрез.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
	|				РаботникиОрганизации.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
	|				РаботникиОрганизации.ПериодЗавершения КАК ПериодЗавершения
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизации.Период) КАК ПериодСреза,
	|					Основные.Сотрудник КАК Сотрудник
	|				ИЗ
	|					Документ.РасчетЕСН.ОсновныеНачисления КАК Основные
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|						ПО (РаботникиОрганизации.Период <= Основные.ПериодДействияНачало)
	|							И Основные.Сотрудник = РаботникиОрганизации.Сотрудник
	|				ГДЕ
	|					Основные.Ссылка = &парамРегистратор
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Основные.Сотрудник) КАК РаботникиОрганизацииСрез
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|					ПО РаботникиОрганизацииСрез.ПериодСреза = РаботникиОрганизации.Период
	|						И РаботникиОрганизацииСрез.Сотрудник = РаботникиОрганизации.Сотрудник) КАК РаботникиОрганизацииСрез
	|			ПО Основные.Сотрудник = РаботникиОрганизацииСрез.Сотрудник
	|	ГДЕ
	|		Основные.Ссылка = &парамРегистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""Дополнительные"",
	|		Дополнительные.НомерСтроки,
	|		Дополнительные.ВидРасчета.СпособРасчета,
	|		NULL,
	|		Дополнительные.ВидРасчета,
	|		Дополнительные.Сотрудник,
	|		Дополнительные.Сотрудник.Физлицо,
	|		Дополнительные.КодДоходаЕСН,
	|		Дополнительные.ДоходФСЗН,
	|		Дополнительные.ДоходЕдиныйПлатеж,
	|		Дополнительные.ДоходСтрах,
	|		Дополнительные.Результат,
	|		Дополнительные.БазовыйПериодНачало,
	|		Дополнительные.БазовыйПериодНачало,
	|		ВЫБОР
	|			КОГДА Дополнительные.БазовыйПериодКонец <> &ПустаяДата
	|				ТОГДА КОНЕЦПЕРИОДА(Дополнительные.БазовыйПериодКонец, ДЕНЬ)
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ,
	|		NULL,
	|		NULL,
	|		Дополнительные.Скидка,
	|		ВЫБОР
	|			КОГДА Дополнительные.Сотрудник.Организация = &ГоловнаяОрганизация
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ,
	|		Дополнительные.БазовыйНачало,
	|		Дополнительные.БазовыйКонец,
	|		Дополнительные.Сотрудник.Наименование
	|	ИЗ
	|		Документ.РасчетЕСН.ДополнительныеНачисления КАК Дополнительные
	|	ГДЕ
	|		Дополнительные.Ссылка = &парамРегистратор) КАК ВложенныйЗапрос
	//+ СВЭЙ КДЯ 25.11.19 СВФР-005103
	|;
	
	//Аверсон ЕАЕ 03.12.2025 СВФР-017394
	|//////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтДоходы.Сотрудник,
	|	ВтДоходы.ПериодВзаиморасчетов,
	|	МАКСИМУМ(ИноеНалогообложениеПоСотрудникам.Период) КАК МаксПериод
	|ПОМЕСТИТЬ ВТМаксПериод
	|ИЗ ВтДоходы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИноеНалогообложениеПоСотрудникам КАК ИноеНалогообложениеПоСотрудникам
	|ПО ВтДоходы.Сотрудник = ИноеНалогообложениеПоСотрудникам.Сотрудник
	|И ВтДоходы.ПериодВзаиморасчетов >= ИноеНалогообложениеПоСотрудникам.Период
	|СГРУППИРОВАТЬ ПО
	|	ВтДоходы.Сотрудник,
	|	ВтДоходы.ПериодВзаиморасчетов
	|;
	|//////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ВТМаксПериод.Сотрудник,
	|ВТМаксПериод.ПериодВзаиморасчетов,
	|ЕСТЬNULL(ИноеНалогообложениеПоСотрудникам.ФСЗН,34) КАК ФСЗН,
	|ЕСТЬNULL(ИноеНалогообложениеПоСотрудникам.БГС,1) КАК БГС
	|ПОМЕСТИТЬ ВТИноеНалогообложение
	|ИЗ ВТМаксПериод
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИноеНалогообложениеПоСотрудникам КАК ИноеНалогообложениеПоСотрудникам
	|ПО ВТМаксПериод.Сотрудник = ИноеНалогообложениеПоСотрудникам.Сотрудник
	|И ВТМаксПериод.МаксПериод = ИноеНалогообложениеПоСотрудникам.Период
	|;
	|/////////////////////////////////////////////////////////////////
	//Аверсон СВФР-017394
	
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТипСтроки,
	|	ВложенныйЗапрос.НомерСтроки,
	|	ВложенныйЗапрос.СпособРасчета,
	|	ВложенныйЗапрос.ВидВремени,
	|	ВложенныйЗапрос.ВидРасчета,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Физлицо,
	|	ВложенныйЗапрос.КодДоходаЕСН,
	|	ВЫБОР КОГДА ISNULL( ИноеНалогообложение.ФСЗН, 34 ) = 0 ТОГДА ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) ИНАЧЕ ВложенныйЗапрос.ДоходФСЗН КОНЕЦ КАК ДоходФСЗН,
	|	ВЫБОР КОГДА ISNULL( ИноеНалогообложение.ФСЗН, 34 ) = 0 ТОГДА ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) ИНАЧЕ ВложенныйЗапрос.ДоходЕдиныйПлатеж КОНЕЦ КАК ДоходЕдиныйПлатеж,
	|	ВЫБОР КОГДА ISNULL( ИноеНалогообложение.БГС, 1 ) = 0 ТОГДА ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) ИНАЧЕ ВложенныйЗапрос.ДоходСтрах КОНЕЦ КАК ДоходСтрах,
	|	ВложенныйЗапрос.Результат КАК Результат,
	|	ВложенныйЗапрос.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВложенныйЗапрос.ПериодДействияНачало,
	|	ВложенныйЗапрос.ПериодДействияКонец,
	|	ВложенныйЗапрос.ГрафикРаботы,
	|	ВложенныйЗапрос.СуммированныйУчетРабочегоВремени,
	|	ВложенныйЗапрос.Скидка,
	|	ВложенныйЗапрос.ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВложенныйЗапрос.БазовыйНачало,
	|	ВложенныйЗапрос.БазовыйКонец,
	|	ВложенныйЗапрос.СотрудникНаименование КАК СотрудникНаименование
	|ИЗ 
	|	ВтДоходы КАК ВложенныйЗапрос
	
	//Аверсон ЕАЕ 03.12.2025 СВФР-017394
	//|	ЛЕВОЕ СОЕДИНЕНИЕ
	//|	( ВЫБРАТЬ
	//|		ИноеНалогообложениеПоСотрудникамСрезПоследних.Сотрудник,
	//|		ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН,
	//|		ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
	//|		ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
	//|	  ИЗ
	//|		РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
	//|			&Период,
	//|			Организация = &ГоловнаяОрганизация
	//|				И Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВтДоходы КАК Доходы ) 
	//|			) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних
	//|	) КАК ИноеНалогообложение
	//|   ПО 
	//|	ИноеНалогообложение.Сотрудник =  ВложенныйЗапрос.Сотрудник
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТИноеНалогообложение КАК ИноеНалогообложение
	|ПО ИноеНалогообложение.Сотрудник =  ВложенныйЗапрос.Сотрудник
	|И ИноеНалогообложение.ПериодВзаиморасчетов =  ВложенныйЗапрос.ПериодВзаиморасчетов
	//Аверсон СВФР-017394
	
	//- СВЭЙ КДЯ 25.11.19 СВФР-005103
	//+ СВЭЙ КДЯ 12.02.20 СВФР-005491
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ.СрезПоследних( &Период, 
	|							ВидПараметра = ЗНАЧЕНИЕ( Перечисление.ВидыПараметровДляРасчетаЗарплаты.ОбязательноеСтрахованиеБез97 ) ) КАК ПараметрОбязательноеСтрахованиеБез97_2
	|				ПО ПараметрОбязательноеСтрахованиеБез97_2.Размер = 2
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ.СрезПоследних( &Период, 
	|							ВидПараметра = ЗНАЧЕНИЕ( Перечисление.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца ) ) КАК ПараметрПенсионныйФондБудущегоМесяца_1
	|				ПО ПараметрПенсионныйФондБудущегоМесяца_1.Размер = 1
	|ГДЕ
	| 	ПараметрОбязательноеСтрахованиеБез97_2.Размер IS NULL
	| 	ИЛИ ПараметрПенсионныйФондБудущегоМесяца_1.Размер IS NULL
	|   ИЛИ НЕ (
	|   		ВложенныйЗапрос.ВидРасчета.СпособРасчета В ( 
	|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням),
	|					ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке) )
	|   		И
	|           ВЫБОР КОГДА ISNULL( ИноеНалогообложение.ФСЗН, 34 ) = 0 
	|				ТОГДА ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) 
	|				ИНАЧЕ ВложенныйЗапрос.ДоходФСЗН 
	|           КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходФСЗН
	|   		И
	|			ВЫБОР КОГДА ISNULL( ИноеНалогообложение.БГС, 1 ) = 0 
	|				ТОГДА ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) 
	|				ИНАЧЕ ВложенныйЗапрос.ДоходСтрах 
	|			КОНЕЦ = ЗНАЧЕНИЕ( Перечисление.ДоходыФСС_НС.НеОблагается ) // КАК ДоходСтрах
	|   		)
	//- СВЭЙ КДЯ 12.02.20 СВФР-005491
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование,
	|	ПериодВзаиморасчетов,
	|	Результат
	|";
	
	РезультатЗапроса = Запрос.Выполнить(); //+ СВЭЙ КДЯ 21.11.19 СВФР-004631
	Возврат РезультатЗапроса;
	
КонецФункции // СформироватьЗапросПоДоходам()

// Выполняет проверку правильности заполнения строки табличной части о доходах
Процедура ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, ТипСтроки, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоДоходам.НомерСтроки) +
	""" табл. части "+ТипСтроки+": ";
	
	Если ВыборкаПоДоходам.ВидРасчета.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.Сотрудник.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.КодДоходаЕСН.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан код дохода ЕСН!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоДоходам.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ТипСтроки = "Основные" Тогда
		
		// Дата начала
		Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала начисления!", Отказ, Заголовок);
		Иначе
			// Дата окончания
			Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияКонец) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания начисления!", Отказ, Заголовок);
			Иначе
				Если ВыборкаПоДоходам.ПериодДействияКонец < ВыборкаПоДоходам.ПериодДействияНачало Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания начисления не должна быть меньше даты начала!", Отказ, Заголовок);
				Иначе
					Если НачалоМесяца(ВыборкаПоДоходам.ПериодДействияКонец) <> НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
Конецпроцедуры // ПроверитьЗаполнениеСтрокиДохода()

// Добавляет запись в движения по регистру учета доходов 
//
Процедура ДобавитьСтрокуВДвиженияПоДоходам(ВыборкаПоДоходам, ГоловнаяОрганизация,ДобавлятьСтрПоСотр = Ложь)
	//О.Т. 25.09.2014 № 222
	БазаПрошл = 0;
	ЕстьОтрицательное = 0;
	Если НЕ БыстроеПроведение Тогда //Аверсон 11.04.2023 КВВ СВФР-010636 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСНСведенияОДоходах.ВидРасчета.ОтчисленияНаППС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		|			ТОГДА ЕСНСведенияОДоходах.Результат
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БазаПрошл,
		|	ВЫБОР
		|		КОГДА ЕСНСведенияОДоходах.Результат < 0
		|				И ЕСНСведенияОДоходах.ВидРасчета.ОтчисленияНаППС = ЗНАЧЕНИЕ(перечисление.ДоходыФСС_НС.Облагается)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьОтрицательное,
		|	ЕСНСведенияОДоходах.ВидРасчета,
		|	ЕСНСведенияОДоходах.КодДоходаЕСН,
		|	ЕСНСведенияОДоходах.ДоходФСЗН,
		|	ЕСНСведенияОДоходах.ДоходСтрах,
		|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
		|	ЕСНСведенияОДоходах.Результат
		|ИЗ
		|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|ГДЕ
		|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
		|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
		|	И ЕСНСведенияОДоходах.Организация = &Организация
		|	И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасчета";
		Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
		Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ФизЛицо", ВыборкаПоДоходам.Физлицо);
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("ВидРасчета", ВыборкаПоДоходам.ВидРасчета);
		РезультатБаза = Запрос.Выполнить().Выбрать();  
		БазаПрошл = 0;
		
		пока РезультатБаза.Следующий() Цикл
			БазаПрошл = БазаПрошл + РезультатБаза.БазаПрошл;
		КонецЦикла;
		РезультатБаза = Запрос.Выполнить().Выбрать();  
		
		ЕстьОтрицательное = 0;
		РезультатПрошлЕсть = Ложь;
		СуммаОсн = 0;
		РезДоходФСЗН = Новый ТаблицаЗначений;
		пока РезультатБаза.Следующий() Цикл
			ЕстьОтрицательное = ЕстьОтрицательное + РезультатБаза.ЕстьОтрицательное;
			
			// О.Т. 30.10.2014 264
			
			если ТипЗнч(РезультатБаза.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда 
				БазаОсн = ОсновныеНачисления.НайтиСтроки(Новый Структура("ПериодДействияНачало,Сотрудник,ВидРасчета",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник,РезультатБаза.ВидРасчета));
				СуммаОсн = 0;
				для Каждого стрБазаОсн из БазаОсн Цикл 
					СуммаОсн = СуммаОсн + стрБазаОсн.Результат;
				КонецЦикла;
				
			Иначе 
				БазаОсн = ДополнительныеНачисления.НайтиСтроки(Новый Структура("БазовыйПериодНачало,Сотрудник,ВидРасчета",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник,РезультатБаза.ВидРасчета));
				СуммаОсн = 0;
				для Каждого стрБазаОсн из БазаОсн Цикл 
					СуммаОсн = СуммаОсн + стрБазаОсн.Результат;
				КонецЦикла;
				
			КонецЕсли;
			Если СуммаОсн = РезультатБаза.БазаПрошл или ВыборкаПоДоходам.Результат = РезультатБаза.БазаПрошл Тогда 
				РезультатПрошлЕсть = Истина;
			КонецЕсли;
			
			если ДобавлятьСтрПоСотр Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕСНСведенияОДоходах.ДоходФСЗН,
				|	ЕСНСведенияОДоходах.ДоходСтрах,
				|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
				|	ЕСНСведенияОДоходах.КодДоходаЕСН,
				|	ЕСНСведенияОДоходах.Результат
				|ИЗ
				|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
				|ГДЕ
				|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
				|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
				|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
				|	И ЕСНСведенияОДоходах.Организация = &Организация
				|	И ЕСНСведенияОДоходах.Результат В(&Результат)
				|	И ЕСНСведенияОДоходах.ВидРасчета = &ВидРасчета";
				Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
				Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ФизЛицо", ВыборкаПоДоходам.Физлицо);
				Запрос.УстановитьПараметр("Регистратор", Ссылка);
				Запрос.УстановитьПараметр("ВидРасчета", ВыборкаПоДоходам.ВидРасчета);
				РезультатСп = Новый СписокЗначений;
				РезультатСп.Добавить(ВыборкаПоДоходам.Результат);
				//РезультатСп.Добавить(СуммаОсн);
				Запрос.УстановитьПараметр("Результат", РезультатСп);
				РезДоходФСЗН = Запрос.Выполнить().Выгрузить();
				если РезДоходФСЗН.Количество()=0 Тогда 
					
					СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("ВидОтчисления",Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд));
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
					БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
					// О.Т. 30.10.2014 264
					БазаОсн = ОсновныеНачисления.НайтиСтроки(Новый Структура("ПериодДействияНачало,Сотрудник",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник));
					СуммаОсн = 0;
					для Каждого стрБазаОсн из БазаОсн Цикл 
						СуммаОсн = СуммаОсн + стрБазаОсн.Результат;
					КонецЦикла;
					БазаДоп = ДополнительныеНачисления.НайтиСтроки(Новый Структура("БазовыйПериодНачало,Сотрудник",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник));
					СуммаДоп = 0;
					для Каждого стрБазаДоп из БазаДоп Цикл 
						СуммаДоп = СуммаДоп + стрБазаДоп.Результат;
					КонецЦикла;
					БазаТекДокумента = СуммаОсн + СуммаДоп;
					// О.Т. 30.10.2014 264
					если ВыборкаПоДоходам.ПериодДействияНачало < ПериодРегистрации Тогда
						Если БазаПрошл = null тогда
							БазаПрошл=0;	
						КонецЕсли; 
						если БазаТекДокумента > БазаОграниченияФСЗН и БазаПрошл < БазаОграниченияФСЗН и РезультатБаза.ДоходФСЗН = Перечисления.ДоходыФСС_НС.Облагается Тогда //или ДобавлятьСтрПоСотр
							
							Если ВыборкаПоДоходам.ТипСтроки = "Основные" Тогда
								
								Строка = Движения.ЕСНОсновныеНачисления.Добавить();
								
								ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоДоходам.СпособРасчета, ВыборкаПоДоходам.ВидВремени, ВыборкаПоДоходам.СуммированныйУчетРабочегоВремени);
								
								// свойства
								Строка.ПериодДействияНачало		= ВыборкаПоДоходам.ПериодДействияНачало;
								Строка.ПериодДействияКонец		= ВыборкаПоДоходам.ПериодДействияКонец;
								
								// реквизиты
								Строка.ГрафикРаботы				= ВыборкаПоДоходам.ГрафикРаботы;
								Строка.ВидУчетаВремени			= ВидУчетаВремени;
								
							Иначе
								Строка = Движения.ЕСНДополнительныеНачисления.Добавить();
								
								// ресурсы
								Строка.БазовыйПериодНачало = ВыборкаПоДоходам.ПериодДействияНачало;
								Строка.БазовыйПериодКонец  = ВыборкаПоДоходам.ПериодДействияКонец;
								//Строка.Скидка = ВыборкаПоДоходам.Скидка;
								//толик
								Строка.БазовыйНачало = ВыборкаПоДоходам.БазовыйНачало;
								Строка.БазовыйКонец  = ВыборкаПоДоходам.БазовыйКонец;
								
							КонецЕсли;
							
							// свойства
							Строка.ВидРасчета = ВыборкаПоДоходам.ВидРасчета;
							Строка.ПериодРегистрации = ПериодРегистрации;
							
							// Измерения
							Строка.Сотрудник					= ВыборкаПоДоходам.Сотрудник;
							Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
							Строка.Организация					= ГоловнаяОрганизация;
							// О.Т. 30.10.2014 264
							
							Строка.ДоходФСЗН = РезультатБаза.ДоходФСЗН;
							Строка.ДоходСтрах = РезультатБаза.ДоходСтрах;
							Строка.ДоходЕдиныйПлатеж = РезультатБаза.ДоходЕдиныйПлатеж;
							
							// О.Т. 30.10.2014 264
							// ресурсы
							Строка.Результат					= -РезультатБаза.Результат;
							
							// реквизиты
							Строка.КодДоходаЕСН					= РезультатБаза.КодДоходаЕСН;
							
							Строка.ОбособленноеПодразделение	= Организация;
							
							
							
							////////////////////////////////////////////////////////////////////////////////////////////////////
							// Сведения о доходах
							
							
							
							Строка = Движения.ЕСНСведенияОДоходах.Добавить();
							// свойства
							Строка.Период						= ПериодРегистрации;
							
							// Измерения
							Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
							Строка.Организация					= ГоловнаяОрганизация;
							Строка.периодВзаиморасчетов = ВыборкаПоДоходам.ПериодДействияНачало;
							
							// ресурсы
							Строка.Результат					= -РезультатБаза.Результат;
							//Если ВыборкаПоДоходам.ТипСтроки = "Дополнительные" Тогда
							//	Строка.Скидка					= ВыборкаПоДоходам.Скидка;
							//КонецЕсли;
							
							// реквизиты
							// О.Т. 30.10.2014 264
							
							Строка.ДоходФСЗН = РезультатБаза.ДоходФСЗН;
							Строка.ДоходСтрах = РезультатБаза.ДоходСтрах;
							Строка.ДоходЕдиныйПлатеж = РезультатБаза.ДоходЕдиныйПлатеж;
							Строка.КодДоходаЕСН	= РезультатБаза.КодДоходаЕСН;
							// О.Т. 30.10.2014 264
							Строка.ОбособленноеПодразделение	= Организация;
							Строка.ВидРасчета	= ВыборкаПоДоходам.ВидРасчета;
						КонецЕсли;
					КонецЕсли;
					
					
				КонецЕсли;
			КонецЕсли;
			
			
			
			// О.Т. 30.10.2014 264
		КонецЦикла;
		// О.Т. 30.10.2014 264
		если (не РезДоходФСЗН.Количество()=0 или (РезультатБаза.Количество() = 0 и РезДоходФСЗН.Количество()=0)) и ДобавлятьСтрПоСотр Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНСведенияОДоходах.ДоходФСЗН,
			|	ЕСНСведенияОДоходах.ДоходСтрах,
			|	ЕСНСведенияОДоходах.доходЕдиныйПлатеж,
			|	ЕСНСведенияОДоходах.КодДоходаЕСН
			|ИЗ
			|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			|ГДЕ
			|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
			|	И ЕСНСведенияОДоходах.Регистратор <> &Регистратор
			|	И ЕСНСведенияОДоходах.Организация = &Организация
			|	И ЕСНСведенияОДоходах.Результат В(&Результат)";
			Запрос.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
			Запрос.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(ВыборкаПоДоходам.ПериодДействияНачало));
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ФизЛицо", ВыборкаПоДоходам.Физлицо);
			Запрос.УстановитьПараметр("Регистратор", Ссылка);
			РезультатСп = Новый СписокЗначений;
			РезультатСп.Добавить(ВыборкаПоДоходам.Результат);
			РезультатСп.Добавить(СуммаОсн);
			Запрос.УстановитьПараметр("Результат", РезультатСп);
			РезДоходФСЗН = Запрос.Выполнить().Выгрузить();
			Если РезДоходФСЗН.Количество()>0 Тогда
				СуммаДоходыФСС = РезДоходФСЗН[0].ДоходФСЗН;
			иначе
				СуммаДоходыФСС = ВыборкаПоДоходам.ДоходФСЗН;
			КонецЕсли;
			// О.Т. 30.10.2014 264
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("ВидОтчисления",Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд));
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоходам.ПериодДействияНачало) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			// О.Т. 30.10.2014 264
			БазаОсн = ОсновныеНачисления.НайтиСтроки(Новый Структура("ПериодДействияНачало,Сотрудник",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник));
			СуммаОсн = 0;
			для Каждого стрБазаОсн из БазаОсн Цикл 
				СуммаОсн = СуммаОсн + стрБазаОсн.Результат;
			КонецЦикла;
			БазаДоп = ДополнительныеНачисления.НайтиСтроки(Новый Структура("БазовыйПериодНачало,Сотрудник",ВыборкаПоДоходам.ПериодДействияНачало,ВыборкаПоДоходам.Сотрудник));
			СуммаДоп = 0;
			для Каждого стрБазаДоп из БазаДоп Цикл 
				СуммаДоп = СуммаДоп + стрБазаДоп.Результат;
			КонецЦикла;
			БазаТекДокумента = СуммаОсн + СуммаДоп;
			// О.Т. 30.10.2014 264
			если ВыборкаПоДоходам.ПериодДействияНачало < ПериодРегистрации Тогда
				Если БазаПрошл = null тогда
					БазаПрошл=0;	
				КонецЕсли; 
				если БазаТекДокумента > БазаОграниченияФСЗН и БазаПрошл < БазаОграниченияФСЗН и СуммаДоходыФСС = Перечисления.ДоходыФСС_НС.Облагается и РезультатПрошлЕсть Тогда //или ДобавлятьСтрПоСотр
					
					Если ВыборкаПоДоходам.ТипСтроки = "Основные" Тогда
						
						Строка = Движения.ЕСНОсновныеНачисления.Добавить();
						
						ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоДоходам.СпособРасчета, ВыборкаПоДоходам.ВидВремени, ВыборкаПоДоходам.СуммированныйУчетРабочегоВремени);
						
						// свойства
						Строка.ПериодДействияНачало		= ВыборкаПоДоходам.ПериодДействияНачало;
						Строка.ПериодДействияКонец		= ВыборкаПоДоходам.ПериодДействияКонец;
						
						// реквизиты
						Строка.ГрафикРаботы				= ВыборкаПоДоходам.ГрафикРаботы;
						Строка.ВидУчетаВремени			= ВидУчетаВремени;
						
					Иначе
						Строка = Движения.ЕСНДополнительныеНачисления.Добавить();
						
						// ресурсы
						Строка.БазовыйПериодНачало = ВыборкаПоДоходам.ПериодДействияНачало;
						Строка.БазовыйПериодКонец  = ВыборкаПоДоходам.ПериодДействияКонец;
						//Строка.Скидка = ВыборкаПоДоходам.Скидка;
						//толик
						Строка.БазовыйНачало = ВыборкаПоДоходам.БазовыйНачало;
						Строка.БазовыйКонец  = ВыборкаПоДоходам.БазовыйКонец;
						
					КонецЕсли;
					
					// свойства
					Строка.ВидРасчета = ВыборкаПоДоходам.ВидРасчета;
					Строка.ПериодРегистрации = ПериодРегистрации;
					
					// Измерения
					Строка.Сотрудник					= ВыборкаПоДоходам.Сотрудник;
					Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
					Строка.Организация					= ГоловнаяОрганизация;
					// О.Т. 30.10.2014 264
					если РезДоходФСЗН.Количество()>0 Тогда 
						Строка.ДоходФСЗН = РезДоходФСЗН[0].ДоходФСЗН;
						Строка.ДоходСтрах = РезДоходФСЗН[0].ДоходСтрах;
						Строка.ДоходЕдиныйПлатеж = РезДоходФСЗН[0].ДоходЕдиныйПлатеж;
					иначе
						Строка.ДоходФСЗН = ВыборкаПоДоходам.ДоходФСЗН;
						Строка.ДоходСтрах = ВыборкаПоДоходам.ДоходСтрах;
						Строка.ДоходЕдиныйПлатеж = ВыборкаПоДоходам.ДоходЕдиныйПлатеж;
					КонецЕсли;
					// О.Т. 30.10.2014 264
					// ресурсы
					Строка.Результат					= -ВыборкаПоДоходам.Результат;
					
					// реквизиты
					Строка.КодДоходаЕСН					= ВыборкаПоДоходам.КодДоходаЕСН;
					
					Строка.ОбособленноеПодразделение	= Организация;
					
				КонецЕсли;
			КонецЕсли;
			
			
			если ВыборкаПоДоходам.ПериодДействияНачало < ПериодРегистрации Тогда 
				если БазаТекДокумента > БазаОграниченияФСЗН и БазаПрошл < БазаОграниченияФСЗН и СуммаДоходыФСС = Перечисления.ДоходыФСС_НС.Облагается и РезультатПрошлЕсть Тогда  //или ДобавлятьСтрПоСотр
					Строка = Движения.ЕСНСведенияОДоходах.Добавить();
					// свойства
					Строка.Период						= ПериодРегистрации;
					
					// Измерения
					Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
					Строка.Организация					= ГоловнаяОрганизация;
					Строка.периодВзаиморасчетов = ВыборкаПоДоходам.ПериодДействияНачало;
					
					// ресурсы
					Строка.Результат					= -ВыборкаПоДоходам.Результат;
					//Если ВыборкаПоДоходам.ТипСтроки = "Дополнительные" Тогда
					//	Строка.Скидка					= ВыборкаПоДоходам.Скидка;
					//КонецЕсли;
					
					// реквизиты
					// О.Т. 30.10.2014 264
					если РезДоходФСЗН.Количество()>0 Тогда 
						Строка.ДоходФСЗН = РезДоходФСЗН[0].ДоходФСЗН;
						Строка.ДоходСтрах = РезДоходФСЗН[0].ДоходСтрах;
						Строка.ДоходЕдиныйПлатеж = РезДоходФСЗН[0].ДоходЕдиныйПлатеж;
						Строка.КодДоходаЕСН = РезДоходФСЗН[0].КодДоходаЕСН;
					иначе
						Строка.ДоходФСЗН = ВыборкаПоДоходам.ДоходФСЗН;
						Строка.ДоходСтрах = ВыборкаПоДоходам.ДоходСтрах;
						Строка.ДоходЕдиныйПлатеж = ВыборкаПоДоходам.ДоходЕдиныйПлатеж;
						Строка.КодДоходаЕСН	= ВыборкаПоДоходам.КодДоходаЕСН;
					КонецЕсли;
					// О.Т. 30.10.2014 264
					Строка.ОбособленноеПодразделение	= Организация;
					Строка.ВидРасчета	= ВыборкаПоДоходам.ВидРасчета;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; // Аверсон 11.04.2023 КВВ СВФР-010636
	
	//О.Т. 25.09.2014 № 222
	Если ВыборкаПоДоходам.ТипСтроки = "Основные" Тогда
		
		Строка = Движения.ЕСНОсновныеНачисления.Добавить();
		
		ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоДоходам.СпособРасчета, ВыборкаПоДоходам.ВидВремени, ВыборкаПоДоходам.СуммированныйУчетРабочегоВремени);
		
		// свойства
		Строка.ПериодДействияНачало		= ВыборкаПоДоходам.ПериодДействияНачало;
		Строка.ПериодДействияКонец		= ВыборкаПоДоходам.ПериодДействияКонец;
		
		// реквизиты
		Строка.ГрафикРаботы				= ВыборкаПоДоходам.ГрафикРаботы;
		Строка.ВидУчетаВремени			= ВидУчетаВремени;
		
	Иначе
		Строка = Движения.ЕСНДополнительныеНачисления.Добавить();
		
		// ресурсы
		Строка.БазовыйПериодНачало = ВыборкаПоДоходам.ПериодДействияНачало;
		Строка.БазовыйПериодКонец  = ВыборкаПоДоходам.ПериодДействияКонец;
		//Строка.Скидка = ВыборкаПоДоходам.Скидка;
		//толик
		Строка.БазовыйНачало = ВыборкаПоДоходам.БазовыйНачало;
		Строка.БазовыйКонец  = ВыборкаПоДоходам.БазовыйКонец;
		
	КонецЕсли;
	
	// свойства
	Строка.ВидРасчета = ВыборкаПоДоходам.ВидРасчета;
	Строка.ПериодРегистрации = ПериодРегистрации;
	
	// Измерения
	Строка.Сотрудник					= ВыборкаПоДоходам.Сотрудник;
	Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
	Строка.Организация					= ГоловнаяОрганизация;
	
	// ресурсы
	Строка.Результат					= ВыборкаПоДоходам.Результат;
	
	// реквизиты
	Строка.КодДоходаЕСН					= ВыборкаПоДоходам.КодДоходаЕСН;
	Строка.ДоходФСЗН = ВыборкаПоДоходам.ДоходФСЗН;
	Строка.ДоходСтрах = ВыборкаПоДоходам.ДоходСтрах;
	Строка.ДоходЕдиныйПлатеж = ВыборкаПоДоходам.ДоходЕдиныйПлатеж;
	
	Строка.ОбособленноеПодразделение	= Организация;
	//О.Т. 16.09.2014 № 222
	
	
	
	
	//О.Т. 16.09.2014 № 222
	// продублируем сведения о доходах в рег-ре налогового учета
	Строка = Движения.ЕСНСведенияОДоходах.Добавить();
	
	// свойства
	Строка.Период						= ПериодРегистрации;
	
	// Измерения
	Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
	Строка.Организация					= ГоловнаяОрганизация;
	Строка.периодВзаиморасчетов = ВыборкаПоДоходам.ПериодДействияНачало;
	
	// ресурсы
	Строка.Результат					= ВыборкаПоДоходам.Результат;
	//Если ВыборкаПоДоходам.ТипСтроки = "Дополнительные" Тогда
	//	Строка.Скидка					= ВыборкаПоДоходам.Скидка;
	//КонецЕсли;
	
	// реквизиты
	Строка.КодДоходаЕСН					= ВыборкаПоДоходам.КодДоходаЕСН;
	Строка.ДоходФСЗН = ВыборкаПоДоходам.ДоходФСЗН;
	Строка.ДоходСтрах = ВыборкаПоДоходам.ДоходСтрах;
	Строка.ДоходЕдиныйПлатеж = ВыборкаПоДоходам.ДоходЕдиныйПлатеж;
	Строка.ОбособленноеПодразделение	= Организация;
	Строка.ВидРасчета	= ВыборкаПоДоходам.ВидРасчета;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоДоходам()

// Добавляет запись в движения по регистру учета доходов 
//
Процедура ДобавитьСтрокуВДвиженияПоДоходамПоСотрудникам(ВыборкаПоДоходам, ГоловнаяОрганизация,ТаблицаДляДвиженийДоходы)
	
	
	Если ВыборкаПоДоходам.ДоходФСЗН = Перечисления.ДоходыФСС_НС.Облагается или ВыборкаПоДоходам.КодДоходаЕСН = Справочники.ДоходыЕСН.БольничныйИзФСЗН или ВыборкаПоДоходам.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве Тогда 
		Строка = ТаблицаДляДвиженийДоходы.Добавить();//Движения.ЕСНСведенияОДоходахПоСотрудникам.Добавить();
		
		// свойства
		Строка.Период						= ПериодРегистрации;
		
		// Измерения
		Строка.Сотрудник					= ВыборкаПоДоходам.Сотрудник;
		Строка.Физлицо						= ВыборкаПоДоходам.Физлицо;
		Строка.Организация					= ГоловнаяОрганизация;
		Строка.ПериодВзаиморасчетов			= ВыборкаПоДоходам.ПериодДействияНачало;
		Строка.ПериодКонец					= ВыборкаПоДоходам.ПериодДействияКонец;
		
		//+ СВЭЙ КДЯ 21.11.19 СВФР-005088
		//Строка.КодДоходаЕСН = ВыборкаПоДоходам.ВидРасчета.КодДоходаЕСН;
		//- СВЭЙ КДЯ 21.11.19 СВФР-005088
		
		//+ СВЭЙ КДЯ 21.11.19 СВФР-005088
		//При проведении документа "Расчет отчислений с ФОТ и ЗП" 
		//значение измерения "Доход ФСЗН" регистра накопления "Фонды Сведения о доходах ( по сотрудникам )"
		//заполняется не из табличной части документа ( из колонки "Код дохода  взносов" ) ( что было бы верно ),
		//а из поля вида расчета ( которое может быть пустым ) ( что неверно ).
		//Пример:  база Стравиты, документ "Расчет отчислений с ФОТ и ЗП"  № 46 от 31.07.2019 ,   
		//			сотрудник Сидорович Ксения Юрьевна, вид расчета "Прочие начисления".
		//Это приводит к неверному формирования ПУ-3.
		Строка.КодДоходаЕСН = ВыборкаПоДоходам.КодДоходаЕСН;
		//- СВЭЙ КДЯ 21.11.19 СВФР-005088
		
		Строка.ВидРасчета  = ВыборкаПоДоходам.ВидРасчета;
		Если ВыборкаПоДоходам.ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ДоговорПодряда Тогда 
			Строка.СуммаПоДоговорамПодряда = ВыборкаПоДоходам.Результат;
		КонецЕсли;
		
		
		
		// ресурсы
		Строка.Результат					= ВыборкаПоДоходам.Результат;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоДоходам()


// Формирует запрос по табличной части документа "ИсчисленныйЕСН" 
//
Функция СформироватьЗапросПоНалогам()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Налог.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Налог.ПроцентФСЗН ЕСТЬ NULL 
	|			ТОГДА 34
	|		ИНАЧЕ Налог.ПроцентФСЗН
	|	КОНЕЦ КАК ПроцентФСЗН,
	|	Налог.ФизЛицо,
	|	Налог.ФСЗН,
	|	Налог.ОбязательноеСтрахование,
	|	Налог.ЕдиныйПлатеж,
	|	Налог.ПериодВзаиморасчетов,
	|	Налог.ПенсионныйФонд,
	|	Налог.Доплата,
	|	Налог.ФондФСЗН   //Аверсон 07.10.2022 КВВ СВФР-009604
	|ИЗ
	|	Документ.РасчетЕСН.ИсчисленныйЕСН КАК Налог
	|ГДЕ
	|	Налог.Ссылка = &парамРегистратор";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНалогам()

// Выполняет проверку правильности заполнения строки табличной части налогов
Процедура ПроверитьЗаполнениеСтрокиНалога(ВыборкаПоНалогам, Отказ, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоНалогам.НомерСтроки) +
	""" табл. части Расчет взносов: ";
	Если ВыборкаПоНалогам.ФизЛицо.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке  + "Не указан работник!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНалога()

// Добавляет запись в движения по регистру учета налогов
Процедура ДобавитьСтрокуВДвиженияПоНалогам(ВыборкаПоНалогам, ВыборкаПоШапкеДокумента)
	
	//толик добавил автоматическое удержание по расчетам с работниками	
	Если ВыборкаПоНалогам.ПенсионныйФонд <> 0 тогда
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		
		// свойства
		Движение.Период					= КонецМесяца(ПериодРегистрации);
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		
		// измерения
		Движение.Физлицо				= ВыборкаПоНалогам.Физлицо;
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		УчетЗадолженностиПоМесяцам		= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
		КонецЕсли;
		
		// ресурсы
		Движение.СуммаВзаиморасчетов	= -ВыборкаПоНалогам.ПенсионныйФонд;
		
		//  // Свойства
		//  Движение.ПериодРегистрации          = ПериодРегистрации;
		//  Движение.БазовыйПериодНачало        = НачалоМесяца(ВыборкаПоНалогам.ПериодВзаиморасчетов);
		//  Движение.БазовыйПериодКонец		    = КонецМесяца(ВыборкаПоНалогам.ПериодВзаиморасчетов);
		//  Движение.ВидРасчета				    = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
		//  Движение.Сторно				    	= ?(ВыборкаПоНалогам.ПенсионныйФонд >= 0, Ложь, Истина);
		
		//  // Измерения
		//  Движение.ФизЛицо                    = ВыборкаПоНалогам.ФизЛицо;
		//  Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		
		//  // Ресурсы
		//  Движение.Результат					= ВыборкаПоНалогам.ПенсионныйФонд;
		
		//  // Реквизиты
		//Движение.ОбособленноеПодразделение = ВыборкаПоШапкеДокумента.Организация;
		//  Движение.Размер  	                = 1;
		//  Движение.ДокументОснование          =  ЭтотОбъект;
		//  СтрокаВзаиморасчетов = движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		//  
		//  // свойства
		//  СтрокаВзаиморасчетов.Период 				= КонецМесяца(ПериодРегистрации);
		//  СтрокаВзаиморасчетов.ВидДвижения			= ВидДвиженияНакопления.Приход;
		//  
		//  // измерения 
		//  СтрокаВзаиморасчетов.Физлицо 				= ВыборкаПоНалогам.ФизЛицо;
		//  СтрокаВзаиморасчетов.Организация 			= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		//  СтрокаВзаиморасчетов.ПериодВзаиморасчетов 	= КонецМесяца(ПериодРегистрации);//ВыборкаПоНалогам.ПериодВзаиморасчетов;
		//  
		//  // ресурсы
		//  СтрокаВзаиморасчетов.СуммаВзаиморасчетов 	= 0 - ВыборкаПоНалогам.ПенсионныйФонд;
	КонецЕсли;
	//
	СтрокаНабора = Движения.ЕСНИсчисленный.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоШапкеДокумента);
	ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоНалогам);
	
	//+ СВЭЙ КДЯ 14.02.20 СВФР-005514
	СотрудникОсн = Неопределено;
	//- СВЭЙ КДЯ 14.02.20 СВФР-005514
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ФизЛицо", ВыборкаПоНалогам.ФизЛицо);
	СотрудникИзТЧОсн = ОсновныеНачисления.НайтиСтроки(ПараметрыОтбора);
	если СотрудникИзТЧОсн.Количество() > 0 Тогда 
		СотрудникОсн = СотрудникИзТЧОсн[0].Сотрудник;
	КонецЕсли;	
	если не ЗначениеЗаполнено(СотрудникОсн) Тогда 
		СотрудникИзТЧДоп = ДополнительныеНачисления.НайтиСтроки(ПараметрыОтбора);
		если СотрудникИзТЧДоп.Количество() > 0 Тогда 
			СотрудникОсн = СотрудникИзТЧДоп[0].Сотрудник;
		КонецЕсли;
	КонецЕсли;
	если не ЗначениеЗаполнено(СотрудникОсн) Тогда 
		СотрудникОсн = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ВыборкаПоНалогам.ФизЛицо.Наименование);
	КонецЕсли;
	
	СтрокаНабора = Движения.ЕСНИсчисленныйПоСотрудникам.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоШапкеДокумента);
	ЗаполнитьЗначенияСвойств(СтрокаНабора,ВыборкаПоНалогам); 
	СтрокаНабора.Сотрудник = СотрудникОсн;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&Период,
	//+ СВЭЙ КДЯ 14.04.20 СВФР-005859
	|						Физлицо = &Физлицо
	//- СВЭЙ КДЯ 14.04.20 СВФР-005859
	|			) КАК СведенияОбИнвалидностиФизлицСрезПоследних
	|ГДЕ
	|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность";
	
	Запрос.УстановитьПараметр("Период", ПериодРегистрации);
	//+ СВЭЙ КДЯ 14.04.20 СВФР-005859
	Запрос.УстановитьПараметр("Физлицо", ВыборкаПоНалогам.Физлицо);
	//- СВЭЙ КДЯ 14.04.20 СВФР-005859
	
	Если ЗначениеЗаполнено(СтрокаНабора.Сотрудник.ВидНалогообложенияОсновной) Тогда 
		ВидНалогообложения = СтрокаНабора.Сотрудник.ВидНалогообложенияОсновной;
	иначе
		ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество()=0 Тогда 
		ЗначениеПроцентФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидНалогообложения,ВидОтчисления",ВидНалогообложения,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)); 
	иначе
		ЗначениеПроцентФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидНалогообложения,ВидОтчисления",ВидНалогообложения,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды));
	КонецЕсли;
	СтрокаНабора.ПроцентФСЗН = ЗначениеПроцентФСЗН.Размер;
	
	//Аверсон 04.10.2022 КВВ СВФР-009604 (
	Если КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации) > КонецДня(Дата(2022, 01, 31)) 
		И КонецМесяца(ВыборкаПоНалогам.ПериодВзаиморасчетов) > КонецДня(Дата(2022, 01, 31))и (ВыборкаПоНалогам.ПенсионныйФонд <> 0 или ВыборкаПоНалогам.ФондФСЗН <> 0)  Тогда //пустые не пишем
		СтрокаНабораДДДПУ3 = Движения.ДопДанныеДляПУ3.Добавить();
		СтрокаНабораДДДПУ3.Период = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		СтрокаНабораДДДПУ3.Сотрудник = СотрудникОсн;
		СтрокаНабораДДДПУ3.Организация = ВыборкаПоШапкеДокумента.Организация;
		СтрокаНабораДДДПУ3.ПериодВзаиморасчетов = ВыборкаПоНалогам.ПериодВзаиморасчетов;
		СтрокаНабораДДДПУ3.ПенсионныйФонд = ВыборкаПоНалогам.ПенсионныйФонд;
		СтрокаНабораДДДПУ3.СуммаВыплат = ВыборкаПоНалогам.ФондФСЗН;    //Аверсон 07.10.2022 КВВ СВФР-009604 (фондфсзн)
		СтрокаНабораДДДПУ3.ПенсСтрах = Окр(ВыборкаПоНалогам.ФондФСЗН * ((ВыборкаПоНалогам.ПроцентФСЗН - 6)/100),2);   //Аверсон 07.10.2022 КВВ СВФР-009604 (фондфсзн)
		СтрокаНабораДДДПУ3.СоцСтрах = ВыборкаПоНалогам.ФСЗН - СтрокаНабораДДДПУ3.ПенсСтрах;   //Аверсон 07.10.2022 КВВ СВФР-009604 (фондфсзн)
	КонецЕсли;
	//Аверсон 04.10.2022 КВВ СВФР-009604 )
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоНалогам()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого Набор Из Движения Цикл
		Набор.Очистить();
	КонецЦикла;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СотрПрошл = "";
	ПроверкаНаОтрицательные = Новый ТаблицаЗначений;
	ПроверкаНаОтрицательные.Колонки.Добавить("Сотрудник");
	ПроверкаНаОтрицательные.Колонки.Добавить("Период");
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПоДоходам.Следующий() Цикл
		
		если ВыборкаПоДоходам.Результат < 0 и ВыборкаПоДоходам.ВидРасчета.ОтчисленияНаППС = Перечисления.ДоходыФСС_НС.Облагается и ВыборкаПоДоходам.ПериодВзаиморасчетов <> ПериодРегистрации Тогда 
			СтрокаОтр = ПроверкаНаОтрицательные.Добавить();
			СтрокаОтр.Сотрудник = ВыборкаПоДоходам.Сотрудник;
			СтрокаОтр.Период = ВыборкаПоДоходам.ПериодВзаиморасчетов;
		КонецЕсли;
		ПроверкаНаОтрицательные.Свернуть("Сотрудник,Период");
		СотрПрошл = ВыборкаПоДоходам.Сотрудник;
	КонецЦикла;
	
	ТаблицаДляДвиженийДоходы = Новый ТаблицаЗначений;
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("Сотрудник");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("ФизЛицо");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("Организация");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("ПериодВзаиморасчетов");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("ПериодКонец");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("Результат");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("СуммаПоДоговорамПодряда");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("Период");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("ВидРасчета");
	ТаблицаДляДвиженийДоходы.Колонки.Добавить("КодДоходаЕСН");
	
	
	
	РазныеСуммыПоВР = Новый ТаблицаЗначений;
	РазныеСуммыПоВР.Колонки.Добавить("Сотрудник");
	РазныеСуммыПоВР.Колонки.Добавить("ВидРасчета");
	ВыборкаПоДоходам = СформироватьЗапросПоДоходам(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПоДоходам.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ, ВыборкаПоДоходам.ТипСтроки, Заголовок);
		Если Не Отказ Тогда
			если РазныеСуммыПоВР.НайтиСтроки(Новый Структура("Сотрудник,ВидРасчета",ВыборкаПоДоходам.Сотрудник,ВыборкаПоДоходам.ВидРасчета)).Количество() = 0 Тогда 
				ДобавлятьСтрПоСотр = Истина;
			иначе
				ДобавлятьСтрПоСотр = Ложь;
			КонецЕсли;
			ДобавитьСтрокуВДвиженияПоДоходам(ВыборкаПоДоходам,ВыборкаПоШапкеДокумента.Организация,ДобавлятьСтрПоСотр);
			ДобавитьСтрокуВДвиженияПоДоходамПоСотрудникам(ВыборкаПоДоходам,ВыборкаПоШапкеДокумента.Организация,ТаблицаДляДвиженийДоходы);
			СтрРазныеСуммыПоВР = РазныеСуммыПоВР.Добавить();
			СтрРазныеСуммыПоВР.Сотрудник = ВыборкаПоДоходам.Сотрудник;
			СтрРазныеСуммыПоВР.ВидРасчета = ВыборкаПоДоходам.ВидРасчета;
		КонецЕсли;
	КонецЦикла;
	ТаблицаДляДвиженийДоходы.Свернуть("Период,Сотрудник,Физлицо,Организация,ПериодВзаиморасчетов,ПериодКонец,ВидРасчета,КодДоходаЕСН","Результат,СуммаПоДоговорамПодряда");
	Для Каждого стр из ТаблицаДляДвиженийДоходы Цикл 
		Строка = Движения.ЕСНСведенияОДоходахПоСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,стр);
	КонецЦикла;
	
	
	
	ВыборкаПоНалогам = СформироватьЗапросПоНалогам().Выбрать();
	Пока ВыборкаПоНалогам.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиНалога(ВыборкаПоНалогам, Отказ);
		Если Не Отказ Тогда
			ДобавитьСтрокуВДвиженияПоНалогам(ВыборкаПоНалогам, ВыборкаПоШапкеДокумента);
		КонецЕсли;
	КонецЦикла;
	
	//Аверсон 01.07.2022 КВВ СВФР-009250 (
	Если ДополнительнаяПенсия.Количество() > 0 Тогда 
		//Аверсон 30.09.2022 КВВ СВФР-009506 (
		ТЗФЛ = ИсчисленныйЕСН.Выгрузить();  
		ТЗФЛ.Свернуть("ФизЛицо");
		//Аверсон 30.09.2022 КВВ СВФР-009506 )
		
		НаборЗаписей = Движения.ДополнительнаяПенсия;
		Для Каждого СтрДП Из ДополнительнаяПенсия Цикл
			Движение = НаборЗаписей.Добавить();
			
			Движение.Сотрудник	= СтрДП.Сотрудник;
			Движение.Организация = Организация;
			Движение.Период = ПериодРегистрации;
			Движение.ПериодНачисления = СтрДП.ПериодДействияНачало;
			Движение.ПериодНачисленияПо = СтрДП.ПериодДействияКонец;
			Движение.База = СтрДП.База;
			Движение.СуммаРаботника = СтрДП.СуммаРаботника;
			Движение.СуммаРаботодателя = СтрДП.СуммаРаботодателя;
			
			//Аверсон 01.09.2022 КВВ СВФР-009481 (
			//Движение.ДатаУплаты = Дата;
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|Взаиморасчеты.Регистратор.Дата КАК ДатаВыплаты
			|ИЗ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|ГДЕ Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|И Взаиморасчеты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
			|И Взаиморасчеты.Организация = &Организация
			|И Взаиморасчеты.Физлицо = &Работник
			|И Взаиморасчеты.ХарактерВыплаты = Значение(Перечисление.ХарактерВыплатыЗарплаты.Зарплата)";
			З.УстановитьПараметр("Работник", СтрДП.Сотрудник.Физлицо);
			З.УстановитьПараметр("Организация", Организация);
			З.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДобавитьМесяц(СтрДП.ПериодДействияНачало,1)));
			З.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(СтрДП.ПериодДействияНачало,1)));
			РезЗ = З.Выполнить().Выгрузить();
			Если РезЗ.Количество() = 0 Тогда
				//Аверсон 30.09.2022 КВВ СВФР-009506 (
				Отбор = Новый Структура;
				Отбор.Вставить("ФизЛицо", СтрДП.Сотрудник.Физлицо);
				СтрК = ТЗФЛ.НайтиСтроки(Отбор);
				Если СтрК.Количество() > 0 Тогда
					//Аверсон 30.09.2022 КВВ СВФР-009506 )
					
					//Аверосон 03.11.2022 КВВ СВФР-009612 (
					ЗапросОсновныеУволенные = Новый Запрос;
					ЗапросОсновныеУволенные.Текст = "
					|ВЫБРАТЬ 
					|Работники.Сотрудник,
					|КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) КАК ДатаУвольнения
					|ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники   		
					|ГДЕ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)		
					|И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
					|И Работники.Сотрудник = &Сотрудник";               
					ЗапросОсновныеУволенные.УстановитьПараметр("Сотрудник", СтрДП.Сотрудник); 
					ЗапросОсновныеУволенные.УстановитьПараметр("ДатаНачала", НачалоМесяца(СтрДП.ПериодДействияНачало));  
					ЗапросОсновныеУволенные.УстановитьПараметр("ДатаОкончания", КонецМесяца(СтрДП.ПериодДействияНачало));
					РезЗЗапросОсновныеУволенные = ЗапросОсновныеУволенные.Выполнить().Выгрузить();
					Если РезЗЗапросОсновныеУволенные.Количество() > 0 Тогда	
						Движение.ДатаУплаты = НачалоДня(РезЗЗапросОсновныеУволенные[0].ДатаУвольнения);
						
						//Аверсон 15.11.2022 КВВ СВФР-009835 (
						Если ЗначениеЗаполнено(Организация.ДниВыдачиЗП) Тогда
							ДатаВыпЗП = Число(Лев(Организация.ДниВыдачиЗП,2));
							ДД = ДобавитьМесяц(НачалоМесяца(Движение.ДатаУплаты),1)+(ДатаВыпЗП-1)*86400;
							
							ЗДат = Новый Запрос;
							ЗДат.Текст = "ВЫБРАТЬ 
							|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
							|РегламентированныйПроизводственныйКалендарь.ВидДня
							|ИЗ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
							|ГДЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ДОБАВИТЬКДАТЕ(&ПроверкаДаты,ДЕНЬ,-10) И &ПроверкаДаты
							|УПОРЯДОЧИТЬ ПО
							|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря УБЫВ";
							ЗДат.УстановитьПараметр("ПроверкаДаты", ДД);
							РезЗДат = ЗДат.Выполнить().Выгрузить();
							Для Каждого СтрРезЗДат ИЗ РезЗДат Цикл
								Если СтрРезЗДат.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный ИЛИ
									СтрРезЗДат.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
									ДД = СтрРезЗДат.ДатаКалендаря;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							Движение.ДатаУплаты = ДД;
						КонецЕсли;
						//Аверсон 15.11.2022 КВВ СВФР-009835 )
						
					Иначе
						//Аверосон 03.11.2022 КВВ СВФР-009612 )
						
						Сообщить("Дата уплаты доп.пенсии будет не заполнена по сотруднику " + СокрЛП(СтрДП.Сотрудник));
					КонецЕсли;
				КонецЕсли;
			Иначе
				Движение.ДатаУплаты = НачалоДня(РезЗ[0].ДатаВыплаты);
			КонецЕсли;
			//Аверсон 01.09.2022 КВВ СВФР-009481 )
			
		КонецЦикла;
	КонецЕсли;
	//Аверсон 01.07.2022 СВФР-009250 )
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ИсчисленныйЕСН,, "Физлицо");
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для Каждого Набор Из Движения Цикл
		Набор.Очистить();
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;		// в секундах
