//Островская Татьяна 20.11.2013 № 16927
 
//Функция ВыбратьКаталог(ИмяКаталога) Экспорт
//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
//	Диалог.Заголовок = "Укажите каталог";
//	Диалог.МножественныйВыбор = Ложь;
//	Диалог.Каталог = ИмяКаталога;

//	Если Диалог.Выбрать() Тогда
//		ИмяКаталога = Диалог.Каталог;
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;

//КонецФункции
 
Процедура ИнициализацияКнопкиПечать(прФорма, прОбъект) Экспорт
	Если прФорма.ЭлементыФормы.Найти("ОсновныеДействияФормы") = Неопределено Или прФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Найти("кнПечать") = Неопределено Тогда
		Возврат;
	КонецЕсли;


	лкПечать = прФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.кнПечать;

    //что это?
	лкТаб = 0;
	
	Обработки.ПечатьОбъектов.Создать().ПолучитьСписокМакетов(прОбъект.Метаданные().Имя, лкТаб);


	Если лкТаб.Количество() > 1 Тогда


		лкПечать.ТипКнопки = ТипКнопкиКоманднойПанели.Подменю;


		Для каждого лкСтрТаб Из лкТаб Цикл


			Если лкСтрТаб.ПризнакПользовательскогоМакета Тогда
				лкТекст = ?(ПустаяСтрока(лкСтрТаб.СинонимМакета), лкСтрТаб.ИмяМакета, лкСтрТаб.СинонимМакета) + " (П)";
				лкПодсказка = "Печать пользовательского макета";
			Иначе
				лкТекст = ?(ПустаяСтрока(лкСтрТаб.СинонимМакета), лкСтрТаб.ИмяМакета, лкСтрТаб.СинонимМакета);
				лкПодсказка = "Печать";
			КонецЕсли;


			лкКнопка = лкПечать.Кнопки.Добавить(лкСтрТаб.ИмяМакета, ТипКнопкиКоманднойПанели.Действие, лкТекст, Новый Действие("Печать"));
			лкКнопка.Подсказка = лкПодсказка;
			лкКнопка.Пояснение = лкПодсказка;

		КонецЦикла;

	ИначеЕсли лкТаб.Количество() = 1 Тогда
		лкПечать.Имя = лкТаб[0].ИмяМакета;

	КонецЕсли;

КонецПроцедуры
 