
Перем мЭтоНовыйЭлемент;
Перем мМонополныйРежимПередЗаписью;

Процедура ПередЗаписью(Отказ)
	
	мЭтоНовыйЭлемент = ЭтоНовый();
	мМонополныйРежимПередЗаписью = ОбщегоНазначения.ОпределитьТекущийРежимРаботыМонопольный();
	
	Если мЭтоНовыйЭлемент 
		И НЕ ПараметрыСеанса.ИспользованиеРИБ
		И НЕ мМонополныйРежимПередЗаписью Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке("Создание нового узла для обмена данными должно быть выполнено в монопольном режиме.", Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ПараметрыСеанса.ИспользованиеРИБ 
		И Ссылка <> ПланыОбмена.Полный.ЭтотУзел() Тогда
		
		ОбщегоНазначения.СообщитьИнформацияОПрефиксации();
		
	КонецЕсли;
	
	ПолныеПрава.ОпределитьФактИспользованияРИБ();		
		
КонецПроцедуры
