
#Если Клиент Тогда
	//  Процедура заполняет фильтр по переданным значениям
	//  	Организация, Подразделение, ДокументТабель,ДатаАктуальности 
	Процедура УстановитьФильтр(ФильтрСоответствия) Экспорт
		
		Если ФильтрСоответствия["Организация"] <> Неопределено Тогда
			Организация = ФильтрСоответствия["Организация"];
		КонецЕсли;
		
		Если ФильтрСоответствия["Подразделение"] <> Неопределено Тогда
			Подразделение = ФильтрСоответствия["Подразделение"];
		КонецЕсли;
		
		Если ФильтрСоответствия["ДокументТабель"] <> Неопределено Тогда
			ДокументТабель = ФильтрСоответствия["ДокументТабель"];
		КонецЕсли;
		
		Если ФильтрСоответствия["ДатаАктуальности"] <> Неопределено Тогда
			ДатаАктуальности = ФильтрСоответствия["ДатаАктуальности"];
		КонецЕсли;
		
		Если ФильтрСоответствия["ПечатьНеявок"] <> Неопределено Тогда
			ПечатьНеявок = ФильтрСоответствия["ПечатьНеявок"];
		КонецЕсли;
		
	КонецПроцедуры // УстановитьФильтр()
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
	// Выполняет запрос и формирует табличный документ-результат отчета
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	// Параметры:
	//	ДокументРезультат - табличный документ, формируемый отчетом
	//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
	//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
	//                      табличного документа)
	//
	Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь, МакетИзДок = Неопределено) Экспорт
		
		//Аверсон ЕАЕ 08.09.2025 СВФР-016595
		ДокументРезультат.Очистить();
		
		Если ПоСотрудникам Тогда
			ОтчетНач = НачалоМесяца(НачалоПериода);
			ОтчетКон = КонецМесяца(КонецПериода);
		Иначе
			ОтчетНач = НачалоМесяца(ДатаАктуальности);
			ОтчетКон = КонецМесяца(ДатаАктуальности);
		КонецЕсли;
		
		Нач = ОтчетНач;
		Пока Нач < ОтчетКон Цикл
			Кон = КонецМесяца(Нач);
		//Аверсон СВФР-016595
			
			//Аверсон 06.09.2021 КВВ СВФР-007989 (
			Если Организация.ИНН = "700067572" И МакетИзДок = "ТабельНовИзДок" И ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
				ТЗСотрудников = ДокументТабель.ОтработанноеВремя.Выгрузить();    
				
				Если ТЗСотрудников.Количество() > 0 Тогда   
					
					//Аверсон 01.11.2021 КВВ СВФР-008325 (
					СписокВРБезЧасов = Новый СписокЗначений;    
					ГрРБезЧасов = Справочники.ГруппыРасчетов.НайтиПоНаименованию("НеВыводитьЧасыВПечФормеТабеля");
					Если (ГрРБезЧасов <> Null и ГрРБезЧасов <> Справочники.ГруппыРасчетов.ПустаяСсылка()) Тогда   
						Для Каждого стрГр Из ГрРБезЧасов.КлассификаторИспользованияРВ Цикл 
							СписокВРБезЧасов.Добавить(стрГр.ВидКлассификатора);    
						КонецЦикла;
					КонецЕсли;
					//Аверсон 01.11.2021 КВВ СВФР-008325 )
					
					ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
					ПоБригадам = ДокументТабель.ВыводитьНаимБригады;
					
					//Аверсон 04.11.2021 КВВ СВФР-008325 ( (закомментировано)
					//СчКолвоСтрок = 0;
					//КолвоНаСтр = ВосстановитьЗначение("КолвоНаСтр_ТабельНов");
					//КолвоНаСтр = ?(ЗначениеЗаполнено(КолвоНаСтр),КолвоНаСтр,1);
					//ВвестиЧисло(КолвоНаСтр,"Печатать строк на странице",2,0);	
					//СохранитьЗначение("КолвоНаСтр_ТабельНов",КолвоНаСтр);
					//Аверсон 04.11.2021 КВВ СВФР-008325 ) (закомментировано)
					
					ПодписьФИО1 = ""; ПодписьДолжность1 = "";
					Если ЗначениеЗаполнено(ДокументТабель.ОтветственныйОТиЗ) Тогда
						ПодписьФИО1 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.ОтветственныйОТиЗ.Физлицо.Наименование);
						ПодписьДолжность1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.ОтветственныйОТиЗ)).Должность;
					КонецЕсли;
					ПодписьФИО2 = ""; ПодписьДолжность2 = "";
					Если ЗначениеЗаполнено(ДокументТабель.Ответственный) И ЗначениеЗаполнено(ДокументТабель.Ответственный.Сотрудник) Тогда
						ПодписьФИО2 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.Ответственный.Сотрудник.Физлицо.Наименование);
						ПодписьДолжность2 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.Ответственный.Сотрудник)).Должность;
					КонецЕсли;	
					
					ВВ1 = "ПервыйВидВремени";
					ВВ2 = "ВторойВидВремени";
					ВВ3 = "ТретийВидВремени";
					
					Ч1 = "ПервыйЧасов";
					Ч2 = "ВторойЧасов";
					Ч3 = "ТретийЧасов";
					
					ТЗСотрудников.Колонки.Добавить("Должность");
					ТЗСотрудников.Колонки.Добавить("РазрядЕТС");
					ТЗСотрудников.Колонки.Добавить("Категория");
					ТЗСотрудников.Колонки.Добавить("КатегорияКод");
					
					
					Если ПоБригадам Тогда
						ТЗСотрудников.Колонки.Добавить("БригадаКод");
					КонецЕсли;
					Если ДокументТабель.СпособСортировкиПечФормы Тогда // сортировка по ТН
						ТЗСотрудников.Колонки.Добавить("ТН");
					Иначе
						ТЗСотрудников.Колонки.Добавить("Наим");
					КонецЕсли;
					
					//Аверсон ЕАЕ 08.09.2025 СВФР-016595
					//ДокументРезультат.Очистить();
					//Аверсон СВФР-016595
					
					мМакет = ПолучитьМакет("МакетНовБобруйск1");
					
					Область = мМакет.ПолучитьОбласть("Заголовок4");
					ОбластьКатегория = мМакет.ПолучитьОбласть("Категория");
					ОбластьПодвал4 = мМакет.ПолучитьОбласть(?(ЭтоТрансЦех,"Подвал4Т","Подвал4"));
					ОбластьШапка3 = мМакет.ПолучитьОбласть(?(ЭтоТрансЦех,"Шапка3Т","Шапка3"));
					ОбластьДетали3 = мМакет.ПолучитьОбласть(?(ЭтоТрансЦех,"Детали3Т","Детали3"));
					ОбластьПодвал5 = мМакет.ПолучитьОбласть("Подвал5");
					ОбластьПодвал3 = мМакет.ПолучитьОбласть(?(ЭтоТрансЦех,"Подвал3Т","Подвал3"));
					ОбластьБригада = мМакет.ПолучитьОбласть("Бригада");
					ОбластьПодвалБригада = мМакет.ПолучитьОбласть(?(ЭтоТрансЦех,"ПодвалБригадаТ","ПодвалБригада"));
					
					//Аверсон 04.11.2021 КВВ СВФР-008325 (
					ДокументРезультат.Автомасштаб         = Истина;   
					ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
					ДокументРезультат.ПолеСлева		= 5;
					ДокументРезультат.ПолеСправа	= 5;
					ДокументРезультат.ПолеСверху	= 5;
					ДокументРезультат.ПолеСнизу		= 5;
					ДокументРезультат.РазмерКолонтитулаСверху = 5;
					ДокументРезультат.РазмерКолонтитулаСнизу  = 5;
					
					МассивДляПроверки = Новый Массив;     
					
					Если ЗначениеЗаполнено(ПодписьФИО1) Тогда
						ОбластьПодвал5.Параметры.ПодписьДолжность1 = Врег(Лев(ПодписьДолжность1,1)) + Сред(ПодписьДолжность1,2);
						ОбластьПодвал5.Параметры.ПодписьФИО1 = ПодписьФИО1;
					Иначе
						ОбластьПодвал5.Параметры.ПодписьДолжность1 = "";
						ОбластьПодвал5.Параметры.ПодписьФИО1 = "";
					КонецЕсли;
					Если ЗначениеЗаполнено(ПодписьФИО2) Тогда
						ОбластьПодвал5.Параметры.ПодписьДолжность2 = Врег(Лев(ПодписьДолжность2,1)) + Сред(ПодписьДолжность2,2);
						ОбластьПодвал5.Параметры.ПодписьФИО2 = ПодписьФИО2;
					Иначе
						ОбластьПодвал5.Параметры.ПодписьДолжность2 = "";
						ОбластьПодвал5.Параметры.ПодписьФИО2 = "";
					КонецЕсли;
					//Аверсон 04.11.2021 КВВ СВФР-008325 )
					
					//Аверсон 02.11.2021 КВВ СВФР-008325 (
					ОбластьЗаголовок4_1 = мМакет.ПолучитьОбласть("Заголовок4_1");
					//ОбластьНомерСтраницы = мМакет.ПолучитьОбласть("НомерСтраницы");  
					НомерСтраницы = 1; 
					//Аверсон 02.11.2021 КВВ СВФР-008325 )
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
					|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
					|	Организации.Наименование,
					|	ОрганизацииОтветственныеЛица.Дата КАК Дата
					|ИЗ
					|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
					|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
					|ГДЕ
					|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
					|	И Организации.Наименование = &Наименование
					|
					|УПОРЯДОЧИТЬ ПО
					|	Дата";
					
					Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
					Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
					
					Результат = Запрос.Выполнить().Выбрать();
					
					Пока Результат.Следующий() Цикл
						Руководитель = Результат.Сотрудник;
					КонецЦикла;
					если не Руководитель = Неопределено Тогда 
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ФИОФизЛиц.Фамилия,
						|	ФИОФизЛиц.Имя,
						|	ФИОФизЛиц.Отчество,
						|	ФИОФизЛиц.ФизЛицо
						|ИЗ
						|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
						|ГДЕ
						|	ФИОФизЛиц.ФизЛицо = &ФизЛицо";
						
						Запрос.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
						
						Результат1 = Запрос.Выполнить().Выбрать();
						Пока Результат1.Следующий() цикл
							Фамилия = Результат1.Фамилия;
							Имя = Лев(Результат1.Имя,1);
							Отчество = Лев(Результат1.Отчество,1);
							ФИО = Фамилия + " "+Имя+"."+Отчество+".";
						КонецЦикла;
					КонецЕсли;
					
					Область.Параметры.Организация = Организация.Наименование;
					ОбластьЗаголовок4_1.Параметры.Подразделение = Подразделение.Наименование;
					
					//Аверсон ЕАЕ 08.09.2025 СВФР-016595
					//ОбластьЗаголовок4_1.Параметры.Период = ПредставлениеПериода(НачалоМесяца(ДатаАктуальности), КонецМесяца(ДатаАктуальности), "ДФ=""ММММ.гггг""");
					ОбластьЗаголовок4_1.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Нач), КонецМесяца(Кон), "ДФ=""ММММ.гггг""");
					//Аверсон СВФР-016595
					
					если ФИО = Неопределено Тогда 
						Область.Параметры.Руководитель = Руководитель;
					иначе
						Область.Параметры.Руководитель = ФИО;
					КонецЕсли;
					
					ОбластьЗаголовок4_1.Параметры.ТекстНаряд = " по табелю ";
					ОбластьЗаголовок4_1.Параметры.НомерНаряда = ДокументТабель.Номер;			
					
					
					ДокументРезультат.Вывести(Область);
					ДокументРезультат.Вывести(ОбластьЗаголовок4_1);//Аверсон 02.11.2021 КВВ СВФР-008325
					ДокументРезультат.Вывести(ОбластьШапка3);
					
					
					Для Каждого Стр ИЗ ТЗСотрудников Цикл
						Если ПоБригадам Тогда
							БригадаКод = СокрЛП(РегистрыСведений.НазначениеСотрудниковПоБригадам.ПолучитьПоследнее(КонецМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Стр.Сотрудник)).Бригада.Код);
							Если ЗначениеЗаполнено(БригадаКод) Тогда
								Стр.БригадаКод = БригадаКод;
							КонецЕсли;
						КонецЕсли;
						Если ДокументТабель.СпособСортировкиПечФормы Тогда 
							Стр.ТН = Стр.Сотрудник.Код;
						Иначе
							Стр.Наим = Стр.Сотрудник.Наименование;
						КонецЕсли;
						
						//Аверсон 03.10.2021 КВВ СВФР-008152 (пункт 5) (
						ДанныеНаДату = КонецМесяца(ДокументТабель.ПериодРегистрации);
						
						//Аверсон ЕАЕ 08.09.2025 СВФР-016595
						//мС = День(КонецМесяца(ДатаАктуальности));
						//мС1 = День(НачалоМесяца(ДатаАктуальности));
						мС = День(КонецМесяца(Кон));
						мС1 = День(НачалоМесяца(Нач));
						//Аверсон СВФР-016595
						
						Пока мС >= мС1 Цикл
							Если ЗначениеЗаполнено(Стр[ВВ1+ Строка(мС)]) Тогда
								ДанныеНаДату = КонецДня(Дата(Год(ДанныеНаДату), Месяц(ДанныеНаДату), мС));
								Прервать;
							КонецЕсли;	
							мС = мС - 1;
						КонецЦикла;
						
						//Стр.Должность =  РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Стр.Сотрудник)).Должность;
						//Стр.РазрядЕТС = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Стр.Сотрудник)).РазрядЕТС;
						//Категория = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Стр.Сотрудник)).Категория;
						Стр.Должность =  РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДанныеНаДату,Новый Структура("Сотрудник",Стр.Сотрудник)).Должность;
						Стр.РазрядЕТС = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДанныеНаДату,Новый Структура("Сотрудник",Стр.Сотрудник)).РазрядЕТС;
						Категория = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДанныеНаДату,Новый Структура("Сотрудник",Стр.Сотрудник)).Категория;
						//Аверсон 03.10.2021 КВВ СВФР-008152 (пункт 5) )
						
						Если НЕ ЗначениеЗаполнено(Категория) Тогда
							Категория = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НачалоМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Стр.Сотрудник)).Категория;
						КонецЕсли;
						Стр.Категория = Категория;
						КатегорияКод = 100;
						Если ЗначениеЗаполнено(Категория) Тогда
							Если Категория = Справочники.КатегорииРаботников.Руководители Тогда
								КатегорияКод = 1;
							ИначеЕсли Категория = Справочники.КатегорииРаботников.Специалисты Тогда
								КатегорияКод = 2;
							ИначеЕсли Категория = Справочники.КатегорииРаботников.Служащие Тогда
								КатегорияКод = 3;
							ИначеЕсли Категория = Справочники.КатегорииРаботников.РабочиеОсновные Тогда
								КатегорияКод = 4;
							ИначеЕсли Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда
								КатегорияКод = 5;
							Иначе
								КатегорияКод = 6;
							КонецЕсли;
						КонецЕсли;
						
						Стр.КатегорияКод = КатегорияКод;
					КонецЦикла;
					
					
					Если ПоБригадам Тогда
						ТЗСотрудниковБригады = ТЗСотрудников.Скопировать();
						ТЗСотрудниковБригады.Свернуть("БригадаКод");
						ТЗСотрудниковБригады.Сортировать("БригадаКод");
						
						ТЗСотрудниковКатегории = ТЗСотрудников.Скопировать();
						ТЗСотрудниковКатегории.Свернуть("Категория,КатегорияКод,БригадаКод");
						ТЗСотрудниковКатегории.Сортировать("КатегорияКод,Категория");
						
						КолвоЦиклов = ТЗСотрудниковБригады.Количество();
					Иначе
						ТЗСотрудниковКатегории = ТЗСотрудников.Скопировать();
						ТЗСотрудниковКатегории.Свернуть("Категория,КатегорияКод");
						ТЗСотрудниковКатегории.Сортировать("КатегорияКод,Категория");
						КолвоЦиклов = 1;
					КонецЕсли;
					
					
					Если ДокументТабель.СпособСортировкиПечФормы Тогда
						ТЗСотрудников.Сортировать("ТН");
					Иначе 
						ТЗСотрудников.Сортировать("Наим");
					КонецЕсли;
					
					СчДетали3 = 0;
					
					ТЗСотрудниковКатегории_ = Новый ТаблицаЗначений;
					ТЗСотрудниковКатегории_.Колонки.Добавить("Категория");			 ТЗСотрудниковКатегории_.Колонки.Добавить("КатегорияКод");
					ТЗСотрудниковКатегории_.Колонки.Добавить("ВсегоОтрабДней");	     ТЗСотрудниковКатегории_.Колонки.Добавить("ЯЧД");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("ДниРемонта");	         ТЗСотрудниковКатегории_.Колонки.Добавить("К");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("П");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("КВых");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("О");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("Б");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("БРод");	             ТЗСотрудниковКатегории_.Колонки.Добавить("СРА");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("СРЗ");	             ТЗСотрудниковКатегории_.Колонки.Добавить("Донор");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("Уч");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("Отстр");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("Ттариф");	             ТЗСотрудниковКатегории_.Колонки.Добавить("Прогулы");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("ГД");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("КД");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("НП");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("ПоСред");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("ОЖ");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("ВсегоОтрабЧасов");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("ЯЧ");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("РемонтЧ");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("КЧ");	                 ТЗСотрудниковКатегории_.Колонки.Добавить("ПЧ");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("КВыхЧ");	             ТЗСотрудниковКатегории_.Колонки.Добавить("С");	
					ТЗСотрудниковКатегории_.Колонки.Добавить("Н");
					
					Если ПоБригадам Тогда
						ТЗСотрудниковБригады.Колонки.Добавить("ВсегоОтрабДней");	 ТЗСотрудниковБригады.Колонки.Добавить("ЯЧД");	
						ТЗСотрудниковБригады.Колонки.Добавить("ДниРемонта");	     ТЗСотрудниковБригады.Колонки.Добавить("К");	
						ТЗСотрудниковБригады.Колонки.Добавить("П");	              	 ТЗСотрудниковБригады.Колонки.Добавить("КВых");	
						ТЗСотрудниковБригады.Колонки.Добавить("О");	                 ТЗСотрудниковБригады.Колонки.Добавить("Б");	
						ТЗСотрудниковБригады.Колонки.Добавить("БРод");	             ТЗСотрудниковБригады.Колонки.Добавить("СРА");	
						ТЗСотрудниковБригады.Колонки.Добавить("СРЗ");	             ТЗСотрудниковБригады.Колонки.Добавить("Донор");	
						ТЗСотрудниковБригады.Колонки.Добавить("Уч");	             ТЗСотрудниковБригады.Колонки.Добавить("Отстр");	
						ТЗСотрудниковБригады.Колонки.Добавить("Ттариф");	         ТЗСотрудниковБригады.Колонки.Добавить("Прогулы");	
						ТЗСотрудниковБригады.Колонки.Добавить("ГД");	             ТЗСотрудниковБригады.Колонки.Добавить("КД");	
						ТЗСотрудниковБригады.Колонки.Добавить("НП");	             ТЗСотрудниковБригады.Колонки.Добавить("ПоСред");	
						ТЗСотрудниковБригады.Колонки.Добавить("ОЖ");	             ТЗСотрудниковБригады.Колонки.Добавить("ВсегоОтрабЧасов");	
						ТЗСотрудниковБригады.Колонки.Добавить("ЯЧ");	             ТЗСотрудниковБригады.Колонки.Добавить("РемонтЧ");	
						ТЗСотрудниковБригады.Колонки.Добавить("КЧ");	             ТЗСотрудниковБригады.Колонки.Добавить("ПЧ");	
						ТЗСотрудниковБригады.Колонки.Добавить("КВыхЧ");	             ТЗСотрудниковБригады.Колонки.Добавить("С");	
						ТЗСотрудниковБригады.Колонки.Добавить("Н");
					КонецЕсли;
					
					ИтогВсегоОтрабДней = 0;           ИтогДниФакт = 0;           ИтогДниРемонта = 0;	
					ИтогКомандировка = 0;             ИтогПраздничные = 0;       ИтогКомандировкаВых = 0;
					ИтогОтпуск = 0;	                  ИтогБольничные = 0;	     ИтогБольничныеРод = 0;
					ИтогСРА = 0;                      ИтогСРЗ = 0;	             ИтогДонор = 0;	
					ИтогУч = 0;                       ИтогОтстр = 0;	         ИтогТтариф = 0;
					ИтогПрогулы = 0;	              ИтогГД = 0;	             ИтогКД = 0;	
					ИтогНП = 0;	                      ИтогПоСред = 0;	         ИтогОЖ = 0;	
					ИтогВсегоОтрабЧасов = 0;	      ИтогЧасыФакт = 0;	         ИтогРемонтЧ = 0;
					ИтогКЧ = 0;	                      ИтогПраздничныеЧ = 0;	     ИтогКВыхЧ = 0;	
					ИтогСверхурочные = 0;	          ИтогНочные = 0;
					
					
					Для ААА = 1 По КолвоЦиклов Цикл //для бригад
						Если ПоБригадам Тогда
							БригадаКод = ТЗСотрудниковБригады[ААА-1].БригадаКод;
							ОбластьБригада.Параметры.ПечБригада = ?(ЗначениеЗаполнено(БригадаКод),"БРИГАДА № " + СокрЛП(БригадаКод),"БЕЗ БРИГАДЫ");
							
							//Аверсон 04.11.2021 КВВ СВФР-008325 (
							//	ДокументРезультат.Вывести(ОбластьБригада);
							МассивДляПроверки.Очистить();
							МассивДляПроверки.Добавить(ОбластьБригада);
							МассивДляПроверки.Добавить(ОбластьПодвал5);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
							МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
							МассивДляПроверки.Добавить(ОбластьШапка3);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
							
							Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
								ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
								ДокументРезультат.Вывести(ОбластьПодвал5);
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								НомерСтраницы = НомерСтраницы + 1;
								
								ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
								ДокументРезультат.Вывести(ОбластьШапка3);
							КонецЕсли;
							ДокументРезультат.Вывести(ОбластьБригада);
							//Аверсон 04.11.2021 КВВ СВФР-008325 )
							
							ОтборКатегория = Новый Структура;
							ОтборКатегория.Вставить("БригадаКод", БригадаКод);
							СтрокиТЗСотрудниковКатегории = ТЗСотрудниковКатегории.НайтиСтроки(ОтборКатегория);
							
							ВсегоОтрабДней_Бриг = 0;	ЯЧД_Бриг = 0;		ДниРемонта_Бриг = 0;
							К_Бриг = 0;              	П_Бриг = 0;			КВых_Бриг = 0;	
							О_Бриг = 0;					Б_Бриг = 0;			БРод_Бриг = 0;
							СРА_Бриг = 0;				СРЗ_Бриг = 0;		Донор_Бриг = 0;	
							Уч_Бриг = 0;				Отстр_Бриг = 0;		Ттариф_Бриг = 0;
							Прогулы_Бриг = 0;			ГД_Бриг = 0;		КД_Бриг = 0;
							НП_Бриг = 0;				ПоСред_Бриг = 0;	ОЖ_Бриг = 0;
							ВсегоОтрабЧасов_Бриг = 0;	ЯЧ_Бриг = 0;		РемонтЧ_Бриг = 0;
							КЧ_Бриг = 0;				ПЧ_Бриг = 0;		КВыхЧ_Бриг = 0;
							С_Бриг = 0;					Н_Бриг = 0;
							
						Иначе
							СтрокиТЗСотрудниковКатегории = ТЗСотрудниковКатегории.Скопировать();
						КонецЕсли;
						
						Для Каждого СтрКатегория ИЗ СтрокиТЗСотрудниковКатегории Цикл
							ОбластьКатегория.Параметры.ПечКатегория = СтрКатегория.Категория;
							
							//Аверсон 04.11.2021 КВВ СВФР-008325 (
							//ДокументРезультат.Вывести(ОбластьКатегория);
							МассивДляПроверки.Очистить();
							МассивДляПроверки.Добавить(ОбластьКатегория);
							МассивДляПроверки.Добавить(ОбластьПодвал5);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
							МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
							МассивДляПроверки.Добавить(ОбластьШапка3);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
							
							Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
								ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
								ДокументРезультат.Вывести(ОбластьПодвал5);
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								НомерСтраницы = НомерСтраницы + 1;
								
								ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
								ДокументРезультат.Вывести(ОбластьШапка3);
							КонецЕсли;
							ДокументРезультат.Вывести(ОбластьКатегория);
							//Аверсон 04.11.2021 КВВ СВФР-008325 )
							
							СтрКатегория_ = ТЗСотрудниковКатегории_.Добавить();
							СтрКатегория_.Категория = СтрКатегория.Категория;
							СтрКатегория_.КатегорияКод = СтрКатегория.КатегорияКод;
							
							
							ДниРемонта = 0;
							
							ПП = 0;
							Отбор = Новый Структура;
							Отбор.Вставить("Категория", СтрКатегория.Категория);
							Если ПоБригадам Тогда
								Отбор.Вставить("БригадаКод", БригадаКод);
							КонецЕсли;
							СтрокиТЗСотрудников = ТЗСотрудников.НайтиСтроки(Отбор);
							
							ВсегоОтрабДней_Кат = 0;		ЯЧД_Кат = 0;		ДниРемонта_Кат = 0;
							К_Кат = 0;              	П_Кат = 0;			КВых_Кат = 0;	
							О_Кат = 0;					Б_Кат = 0;			БРод_Кат = 0;
							СРА_Кат = 0;				СРЗ_Кат = 0;		Донор_Кат = 0;	
							Уч_Кат = 0;					Отстр_Кат = 0;		Ттариф_Кат = 0;
							Прогулы_Кат = 0;			ГД_Кат = 0;			КД_Кат = 0;
							НП_Кат = 0;					ПоСред_Кат = 0;		ОЖ_Кат = 0;
							ВсегоОтрабЧасов_Кат = 0;	ЯЧ_Кат = 0;			РемонтЧ_Кат = 0;
							КЧ_Кат = 0;					ПЧ_Кат = 0;			КВыхЧ_Кат = 0;
							С_Кат = 0;					Н_Кат = 0;
							
							Для Каждого СтрТЗСотрудников Из СтрокиТЗСотрудников Цикл
								ПП = ПП + 1;
								ВсегоОтрабДней = 0;		ЯЧД = 0;		ДниРемонта = 0;
								К = 0;              	П = 0;			КВых = 0;	
								О = 0;					Б = 0;			БРод = 0;
								СРА = 0;				СРЗ = 0;		Донор = 0;	
								Уч = 0;					Отстр = 0;		Ттариф = 0;
								Прогулы = 0;			ГД = 0;			КД = 0;
								НП = 0;					ПоСред = 0;		ОЖ = 0;
								ВсегоОтрабЧасов = 0;	ЯЧ = 0;			РемонтЧ = 0;
								КЧ = 0;					ПЧ = 0;			КВыхЧ = 0;
								С = 0;					Н = 0;
								
								ОбластьДетали3.Параметры.мНомер = ПП;
								ОбластьДетали3.Параметры.Таб = СтрТЗСотрудников.Сотрудник.Код;
								ОбластьДетали3.Параметры.ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрТЗСотрудников.Сотрудник);
								ОбластьДетали3.Параметры.Должность = СтрТЗСотрудников.Должность;
								ОбластьДетали3.Параметры.Разряд = СокрЛП(СтрТЗСотрудников.РазрядЕТС);
								
								ЭтоНеТрансИНеСделка = Ложь;
								Если НЕ ЭтоТрансЦех Тогда
									Если (СтрТЗСотрудников.Категория = Справочники.КатегорииРаботников.РабочиеОсновные 
										ИЛИ СтрТЗСотрудников.Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные)
										И НЕ СтрТЗСотрудников.Должность.СдельнаяОплата Тогда
										ЭтоНеТрансИНеСделка = Истина;
									КонецЕсли;
								КонецЕсли;
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//Для мС = День(НачалоМесяца(ДатаАктуальности)) По День(КонецМесяца(ДатаАктуальности)) Цикл
								Для мС = День(НачалоМесяца(Нач)) По День(КонецМесяца(Кон)) Цикл
									//Аверсон СВФР-016595
									
									СтрокаЗначенийДня = ""; 
									Если ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) Тогда
										ВидВремени1 = СтрТЗСотрудников[ВВ1+ Строка(мС)];
										Часов1 = СтрТЗСотрудников[Ч1+ Строка(мС)];
										
										ПечатьБезЧасов = ?(СписокВРБезЧасов.НайтиПоЗначению(ВидВремени1)<>Неопределено,Истина,Ложь); //Аверсон 01.11.2021 КВВ СВФР-008325 
										СтрокаЗначенийДня = ВидВремени1.БуквенныйКод + " " + ?(ЗначениеЗаполнено(Часов1),?(ПечатьБезЧасов=Истина,"",Часов1),"");  //Аверсон 01.11.2021 КВВ СВФР-008325
										
										//*** (	
										П = П + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,1,0);
										ДниРемонта = ДниРемонта + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,1,0);
										Донор = Донор + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты,1,0);
										Отстр = Отстр + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой,1,0);
										Прогулы = Прогулы + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы,1,0);
										ГД = ГД + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид,1,0);
										КД = КД + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору,1,0);
										НП = НП + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием,1,0);
										
										ПоСред = ПоСред + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
										ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
										ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия,1,0);
										
										ОЖ = ОЖ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком,1,0);
										Ттариф = Ттариф + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя,1,0);
										Уч = Уч + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый,1,0);
										СРЗ = СРЗ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности,1,0);
										СРА = СРА + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя,1,0);
										БРод = БРод + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам,1,0);
										Б = Б + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь,1,0);
										О = О + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск,1,0);
										
										Н = Н + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,Часов1,0);
										РемонтЧ = РемонтЧ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,Часов1,0);
										
										Если ЭтоТрансЦех Тогда
											ЯЧД = ЯЧД + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
											ЯЧ = ЯЧ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа ИЛИ ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка,Часов1,0);
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
												Иначе
													ЯЧД = ЯЧД + 1;
												КонецЕсли;
											КонецЕсли;
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
													ЯЧД = ЯЧД - 1;
												КонецЕсли;
											КонецЕсли;
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
												КВых = КВых + 1;
												КВыхЧ = КВыхЧ + Часов1;
											КонецЕсли;
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
													//	КВых = КВых + 1;
													//	КВыхЧ = КВыхЧ + Часов1;
													П = П - 1;
												ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
													ПЧ = ПЧ + Часов1;
													ЯЧ = ЯЧ - Часов1;
												КонецЕсли;
											КонецЕсли;
											С = С + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов1,0);
											
											
										Иначе 
											С = С + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов1,0);
											ПЧ = ПЧ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,Часов1,0);
											
											Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
												ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
											Иначе
												ЯЧД = ЯЧД + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
												ЯЧ = ЯЧ + ?(ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Часов1,0);
												Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
													Если ЭтоНеТрансИНеСделка Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
															ЯЧ = ЯЧ - СтрТЗСотрудников[Ч2+ Строка(мС)];
														ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
															ЯЧ = ЯЧ - СтрТЗСотрудников[Ч3+ Строка(мС)];
														КонецЕсли;
														
														//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) (
														Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
															ИЛИ
															(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
															ЯЧД = ЯЧД - 1;
														КонецЕсли;
														//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) )
														
														//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) (
													Иначе
														Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
															ИЛИ
															(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
															ЯЧД = ЯЧД - 1;
															ЯЧ = ЯЧ - Часов1;
														КонецЕсли;
														//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) )
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											
											//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) (
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
													П = П - 1;
													ПЧ = ПЧ - Часов1; 
												КонецЕсли;
											КонецЕсли;
											//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) )
											
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
													КВых = КВых + 1;
													КВыхЧ = КВыхЧ + Часов1;
												Иначе
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
														К = К + 1;
														КЧ = КЧ + Часов1;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											
											Если ВидВремени1=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												К = К + 1;
												КЧ = КЧ + Часов1;
											КонецЕсли;
											
										КонецЕсли;
										//*** )
										
										Если ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) Тогда
											ВидВремени2 = СтрТЗСотрудников[ВВ2+ Строка(мС)];
											Часов2 = СтрТЗСотрудников[Ч2+ Строка(мС)];
											
											ПечатьБезЧасов = ?(СписокВРБезЧасов.НайтиПоЗначению(ВидВремени2)<>Неопределено,Истина,Ложь); //Аверсон 01.11.2021 КВВ СВФР-008325 
											СтрокаЗначенийДня = СтрокаЗначенийДня + "/ " + ВидВремени2.БуквенныйКод + " " + ?(ЗначениеЗаполнено(Часов2),?(ПечатьБезЧасов=Истина,"",Часов2),""); //Аверсон 01.11.2021 КВВ СВФР-008325
											
											//*** (
											П = П + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,1,0);
											ДниРемонта = ДниРемонта + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,1,0);
											Донор = Донор + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты,1,0);
											Отстр = Отстр + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой,1,0);
											Прогулы = Прогулы + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы,1,0);
											ГД = ГД + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид,1,0);
											КД = КД + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору,1,0);
											НП = НП + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием,1,0);
											
											ПоСред = ПоСред + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
											ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
											ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия,1,0);
											
											ОЖ = ОЖ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком,1,0);
											Ттариф = Ттариф + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя,1,0);
											Уч = Уч + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый,1,0);
											СРЗ = СРЗ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности,1,0);
											СРА = СРА + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя,1,0);
											БРод = БРод + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам,1,0);
											Б = Б + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь,1,0);
											О = О + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск,1,0);
											
											Н = Н + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,Часов2,0);
											РемонтЧ = РемонтЧ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,Часов2,0);
											
											Если ЭтоТрансЦех Тогда
												ЯЧД = ЯЧД + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
												ЯЧ = ЯЧ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа ИЛИ ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка,Часов2,0);
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
													Иначе
														ЯЧД = ЯЧД + 1;
													КонецЕсли;
												КонецЕсли;
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
														ЯЧД = ЯЧД - 1;
													КонецЕсли;
												КонецЕсли;
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
													КВых = КВых + 1;
													КВыхЧ = КВыхЧ + Часов2;
												КонецЕсли;
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
														//КВых = КВых + 1;
														//КВыхЧ = КВыхЧ + Часов2;
														П = П - 1;
													ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
														ПЧ = ПЧ + Часов2;
														ЯЧ = ЯЧ - Часов2;
													КонецЕсли;	
												КонецЕсли;
												С = С + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов2,0);
											Иначе
												С = С + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов2,0);
												ПЧ = ПЧ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,Часов2,0);
												Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
													ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
												Иначе
													ЯЧД = ЯЧД + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
													ЯЧ = ЯЧ + ?(ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Часов2,0);
													Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
														Если ЭтоНеТрансИНеСделка Тогда
															Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
																ЯЧ = ЯЧ - СтрТЗСотрудников[Ч1+ Строка(мС)];
															ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
																ЯЧ = ЯЧ - СтрТЗСотрудников[Ч3+ Строка(мС)];
															КонецЕсли;
															
															//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) (
															Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
																ИЛИ
																(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
																ЯЧД = ЯЧД - 1;
															КонецЕсли;
															//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) )
															
															//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) (
														Иначе
															Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
																ИЛИ
																(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
																ЯЧД = ЯЧД - 1;
																ЯЧ = ЯЧ - Часов2;
															КонецЕсли;
															//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) )
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
												
												//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) (
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
														П = П - 1;
														ПЧ = ПЧ - Часов2; 
													КонецЕсли;
												КонецЕсли;
												//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) )
												
												Если ВидВремени2=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
														КВых = КВых + 1;
														КВыхЧ = КВыхЧ + Часов2;
													Иначе
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) И (СтрТЗСотрудников[ВВ3+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
															К = К + 1;
															КЧ = КЧ + Часов2;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
												
											КонецЕсли;
											//*** )
											Если ЗначениеЗаполнено(СтрТЗСотрудников[ВВ3+ Строка(мС)]) Тогда
												ВидВремени3 = СтрТЗСотрудников[ВВ3+ Строка(мС)];
												Часов3 = СтрТЗСотрудников[Ч3+ Строка(мС)];
												
												ПечатьБезЧасов = ?(СписокВРБезЧасов.НайтиПоЗначению(ВидВремени3)<>Неопределено,Истина,Ложь); //Аверсон 01.11.2021 КВВ СВФР-008325 
												СтрокаЗначенийДня = СтрокаЗначенийДня + "/ " + ВидВремени3.БуквенныйКод + " " + ?(ЗначениеЗаполнено(Часов3),?(ПечатьБезЧасов=Истина,"",Часов3),""); //Аверсон 01.11.2021 КВВ СВФР-008325
												
												//*** (
												П = П + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,1,0);
												ДниРемонта = ДниРемонта + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,1,0);
												Донор = Донор + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты,1,0);
												Отстр = Отстр + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой,1,0);
												Прогулы = Прогулы + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы,1,0);
												ГД = ГД + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид,1,0);
												КД = КД + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору,1,0);
												НП = НП + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием,1,0);
												
												ПоСред = ПоСред + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
												ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
												ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия,1,0);
												
												ОЖ = ОЖ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком,1,0);
												Ттариф = Ттариф + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя,1,0);
												Уч = Уч + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый,1,0);
												СРЗ = СРЗ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности,1,0);
												СРА = СРА + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя,1,0);
												БРод = БРод + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам,1,0);
												Б = Б + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь,1,0);
												О = О + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск,1,0);
												
												Н = Н + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,Часов3,0);
												РемонтЧ = РемонтЧ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт,Часов3,0);
												
												Если ЭтоТрансЦех Тогда
													ЯЧД = ЯЧД + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
													ЯЧ = ЯЧ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа ИЛИ ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка,Часов3,0);
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
														Иначе
															ЯЧД = ЯЧД + 1;
														КонецЕсли;
													КонецЕсли;
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
															ЯЧД = ЯЧД - 1;
														КонецЕсли;
													КонецЕсли;
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
														КВых = КВых + 1;
														КВыхЧ = КВыхЧ + Часов3;
													КонецЕсли;
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
															//	КВых = КВых + 1;
															//	КВыхЧ = КВыхЧ + Часов3;
															П = П - 1;
														ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
															ПЧ = ПЧ + Часов3;
															ЯЧ = ЯЧ - Часов3;
														КонецЕсли;
													КонецЕсли;
													С = С + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов3,0);
												Иначе
													С = С + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные,Часов3,0);
													ПЧ = ПЧ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,Часов3,0);
													Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
														ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
													Иначе
														ЯЧД = ЯЧД + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,1,0);
														ЯЧ = ЯЧ + ?(ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Часов3,0);
														Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
															Если ЭтоНеТрансИНеСделка Тогда
																Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
																	ЯЧ = ЯЧ - СтрТЗСотрудников[Ч2+ Строка(мС)];
																ИначеЕсли (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные) Тогда
																	ЯЧ = ЯЧ - СтрТЗСотрудников[Ч1+ Строка(мС)];
																КонецЕсли;
																
																//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) (
																Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
																	ИЛИ
																	(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
																	ЯЧД = ЯЧД - 1;
																КонецЕсли;
																//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 1) )
																
																//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) (
															Иначе
																Если ((ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) 
																	ИЛИ
																	(ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) Тогда
																	ЯЧД = ЯЧД - 1;
																	ЯЧ = ЯЧ - Часов3;
																КонецЕсли;
																//Аверсон 01.11.2021 КВВ СВФР-008325 (пункт 2) )
															КонецЕсли;
														КонецЕсли;
													КонецЕсли;
													
													//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) (
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) Тогда
															П = П - 1;
															ПЧ = ПЧ - Часов3; 
														КонецЕсли;
													КонецЕсли;
													//Аверсон 02.11.2021 КВВ СВФР-008325 (пункт 3) )
													
													Если ВидВремени3=Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
														Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники)
															ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
															КВых = КВых + 1;
															КВыхЧ = КВыхЧ + Часов3;
														Иначе
															Если (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ2+ Строка(мС)]) И (СтрТЗСотрудников[ВВ2+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа)
																ИЛИ (ЗначениеЗаполнено(СтрТЗСотрудников[ВВ1+ Строка(мС)]) И (СтрТЗСотрудников[ВВ1+ Строка(мС)])=Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
																К = К + 1;
																КЧ = КЧ + Часов3;
															КонецЕсли;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
												
												//*** )
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									ОбластьДетали3.Параметры["Зн"+Строка(мС)] = СокрЛП(СтрокаЗначенийДня);
									
									//*** (
									
									Если ЭтоТрансЦех Тогда
										ВсегоОтрабЧасов = ЯЧ + ПЧ + С + РемонтЧ + КВыхЧ;
										ВсегоОтрабДней = ЯЧД + ДниРемонта + П + КВых;
									Иначе
										ВсегоОтрабДней = ЯЧД + ДниРемонта + К + П + КВых;
										ВсегоОтрабЧасов = ЯЧ + ПЧ + С;
									КонецЕсли;
									
									
									ОбластьДетали3.Параметры.ВсегоОтрабДней = ВсегоОтрабДней;
									ОбластьДетали3.Параметры.П = П;
									ОбластьДетали3.Параметры.ДниРемонта = ДниРемонта;
									ОбластьДетали3.Параметры.Донор = Донор;
									ОбластьДетали3.Параметры.Отстр = Отстр;
									ОбластьДетали3.Параметры.Прогулы = Прогулы;
									ОбластьДетали3.Параметры.ГД = ГД;
									ОбластьДетали3.Параметры.КД = КД;
									ОбластьДетали3.Параметры.НП = НП;
									ОбластьДетали3.Параметры.ПоСред = ПоСред;
									ОбластьДетали3.Параметры.ОЖ = ОЖ;
									ОбластьДетали3.Параметры.Ттариф = Ттариф;
									ОбластьДетали3.Параметры.Уч = Уч;
									ОбластьДетали3.Параметры.СРЗ = СРЗ;
									ОбластьДетали3.Параметры.СРА = СРА;
									ОбластьДетали3.Параметры.БРод = БРод;
									ОбластьДетали3.Параметры.Б = Б;
									ОбластьДетали3.Параметры.О = О;
									ОбластьДетали3.Параметры.Н = Н;
									ОбластьДетали3.Параметры.РемонтЧ = РемонтЧ;
									ОбластьДетали3.Параметры.ЯЧД = ЯЧД;
									ОбластьДетали3.Параметры.ЯЧ = ЯЧ;
									ОбластьДетали3.Параметры.ВсегоОтрабЧасов = ВсегоОтрабЧасов;
									ОбластьДетали3.Параметры.С = С;
									ОбластьДетали3.Параметры.ПЧ = ПЧ;
									ОбластьДетали3.Параметры.К = К;
									ОбластьДетали3.Параметры.КЧ = КЧ;
									ОбластьДетали3.Параметры.КВых = КВых;
									ОбластьДетали3.Параметры.КВыхЧ = КВыхЧ;
									//*** )
									
								КонецЦикла;
								
								//*** (
								ВсегоОтрабДней_Кат = ВсегоОтрабДней_Кат + ВсегоОтрабДней;
								П_Кат = П_Кат + П;
								ДниРемонта_Кат = ДниРемонта_Кат + ДниРемонта;
								Донор_Кат = Донор_Кат + Донор;
								Отстр_Кат = Отстр_Кат + Отстр;
								Прогулы_Кат = Прогулы_Кат + Прогулы;
								ГД_Кат = ГД_Кат + ГД;
								КД_Кат = КД_Кат + КД;
								НП_Кат = НП_Кат + НП;
								ПоСред_Кат = ПоСред_Кат + ПоСред;
								ОЖ_Кат = ОЖ_Кат + ОЖ;
								Ттариф_Кат = Ттариф_Кат + Ттариф;
								Уч_Кат = Уч_Кат + Уч;
								СРЗ_Кат = СРЗ_Кат + СРЗ;
								СРА_Кат = СРА_Кат + СРА;
								БРод_Кат = БРод_Кат + БРод;
								Б_Кат = Б_Кат + Б;
								О_Кат = О_Кат + О;
								Н_Кат = Н_Кат + Н;
								РемонтЧ_Кат = РемонтЧ_Кат + РемонтЧ;
								ВсегоОтрабЧасов_Кат = ВсегоОтрабЧасов_Кат + ВсегоОтрабЧасов;
								ЯЧД_Кат = ЯЧД_Кат + ЯЧД;
								ЯЧ_Кат = ЯЧ_Кат + ЯЧ;
								С_Кат = С_Кат + С;
								ПЧ_Кат = ПЧ_Кат + ПЧ;
								К_Кат = К_Кат + К;
								КЧ_Кат = КЧ_Кат + КЧ;
								КВых_Кат = КВых_Кат + КВых;
								КВыхЧ_Кат = КВыхЧ_Кат + КВыхЧ;
								
								//*** )
								
								Если ПоБригадам Тогда
									//*** (
									ВсегоОтрабДней_Бриг = ВсегоОтрабДней_Бриг + ВсегоОтрабДней;
									П_Бриг = П_Бриг + П;
									ДниРемонта_Бриг = ДниРемонта_Бриг + ДниРемонта;
									Донор_Бриг = Донор_Бриг + Донор;
									Отстр_Бриг = Отстр_Бриг + Отстр;
									Прогулы_Бриг = Прогулы_Бриг + Прогулы;
									ГД_Бриг = ГД_Бриг + ГД;
									КД_Бриг = КД_Бриг + КД;
									НП_Бриг = НП_Бриг + НП;
									ПоСред_Бриг = ПоСред_Бриг + ПоСред;
									ОЖ_Бриг = ОЖ_Бриг + ОЖ;
									Ттариф_Бриг = Ттариф_Бриг + Ттариф;
									Уч_Бриг = Уч_Бриг + Уч;
									СРЗ_Бриг = СРЗ_Бриг + СРЗ;
									СРА_Бриг = СРА_Бриг + СРА;
									БРод_Бриг = БРод_Бриг + БРод;
									Б_Бриг = Б_Бриг + Б;
									О_Бриг = О_Бриг + О;
									Н_Бриг = Н_Бриг + Н;
									РемонтЧ_Бриг = РемонтЧ_Бриг + РемонтЧ;
									ВсегоОтрабЧасов_Бриг = ВсегоОтрабЧасов_Бриг + ВсегоОтрабЧасов;
									ЯЧД_Бриг = ЯЧД_Бриг + ЯЧД;
									ЯЧ_Бриг = ЯЧ_Бриг + ЯЧ;
									С_Бриг = С_Бриг + С;
									ПЧ_Бриг = ПЧ_Бриг + ПЧ;
									К_Бриг = К_Бриг + К;
									КЧ_Бриг = КЧ_Бриг + КЧ;
									КВых_Бриг = КВых_Бриг + КВых;
									КВыхЧ_Бриг = КВыхЧ_Бриг + КВыхЧ;
									
									
									//*** )
								КонецЕсли;
								
								//Аверсон 04.11.2021 КВВ СВФР-008325 (
								//ОбластьОформления = ДокументРезультат.Вывести(ОбластьДетали3);
								МассивДляПроверки.Очистить();
								МассивДляПроверки.Добавить(ОбластьДетали3);
								МассивДляПроверки.Добавить(ОбластьПодвал5);
								//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
								МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
								МассивДляПроверки.Добавить(ОбластьШапка3);
								//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
								
								Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
									ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
									ДокументРезультат.Вывести(ОбластьПодвал5);
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									НомерСтраницы = НомерСтраницы + 1;
									
									ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
									ДокументРезультат.Вывести(ОбластьШапка3);
								КонецЕсли;
								ОбластьОформления = ДокументРезультат.Вывести(ОбластьДетали3);
								//Аверсон 04.11.2021 КВВ СВФР-008325 )
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//А = НачалоМесяца(ДатаАктуальности);
								//Б = НачалоДня(КонецМесяца(ДатаАктуальности));
								А = НачалоМесяца(Нач);
								Б = НачалоДня(КонецМесяца(Кон));
								//Аверсон СВФР-016595
								
								Пока А<=Б Цикл;
									Если ДеньНедели(А) = 6 ИЛИ ДеньНедели(А)=7 Тогда
										ДокументРезультат.Область(ОбластьОформления.Верх, 6+День(А), ОбластьОформления.Низ, 6+День(А)).ЦветФона = WebЦвета.Розовый;
									КонецЕсли;
									А = А+60*60*24;
								КонецЦикла;
								
								//Аверсон 04.11.2021 КВВ СВФР-008325 ( (закомментировано)
								//СчКолвоСтрок = СчКолвоСтрок + 1;
								//СчДетали3 = СчДетали3 + 1;
								//
								//Если СчКолвоСтрок = КолвоНаСтр И СчДетали3 < ТЗСотрудников.Количество() Тогда
								//	Если ЗначениеЗаполнено(ПодписьФИО1) Тогда
								//		ОбластьПодвал5.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность1,1)) + Сред(ПодписьДолжность1,2);
								//		ОбластьПодвал5.Параметры.ПодписьФИО = ПодписьФИО1;
								//		ДокументРезультат.Вывести(ОбластьПодвал5);   
								//	КонецЕсли;
								//	Если ЗначениеЗаполнено(ПодписьФИО2) Тогда
								//		ОбластьПодвал5.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность2,1)) + Сред(ПодписьДолжность2,2);
								//		ОбластьПодвал5.Параметры.ПодписьФИО = ПодписьФИО2;
								//		ДокументРезультат.Вывести(ОбластьПодвал5);   
								//	КонецЕсли;		
								//	
								//	//Аверсон 02.11.2021 КВВ СВФР-008325 (
								//	ОбластьНомерСтраницы.Параметры.НомерСтраницы = НомерСтраницы;
								//	ДокументРезультат.Вывести(ОбластьНомерСтраницы); 
								//	НомерСтраницы = НомерСтраницы + 1;
								//	//Аверсон 02.11.2021 КВВ СВФР-008325 )
								//	
								//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();	
								//	ДокументРезультат.Вывести(ОбластьЗаголовок4_1); //Аверсон 02.11.2021 КВВ СВФР-008325
								//	ДокументРезультат.Вывести(ОбластьШапка3);
								//	СчКолвоСтрок = 0;
								//КонецЕсли;
								//Аверсон 04.11.2021 КВВ СВФР-008325 ) (закомментировано)
							КонецЦикла;
							
							//*** (
							СтрКатегория_.ВсегоОтрабДней = ВсегоОтрабДней_Кат;
							СтрКатегория_.П = П_Кат;
							СтрКатегория_.ДниРемонта = ДниРемонта_Кат;
							СтрКатегория_.Донор = Донор_Кат;
							СтрКатегория_.Отстр = Отстр_Кат;
							СтрКатегория_.Прогулы = Прогулы_Кат;
							СтрКатегория_.ГД = ГД_Кат;
							СтрКатегория_.КД = КД_Кат;
							СтрКатегория_.НП = НП_Кат;
							СтрКатегория_.ПоСред = ПоСред_Кат;
							СтрКатегория_.ОЖ = ОЖ_Кат;
							СтрКатегория_.Ттариф = Ттариф_Кат;
							СтрКатегория_.Уч = Уч_Кат;
							СтрКатегория_.СРЗ = СРЗ_Кат;
							СтрКатегория_.СРА = СРА_Кат;
							СтрКатегория_.БРод = БРод_Кат;
							СтрКатегория_.Б = Б_Кат;
							СтрКатегория_.О = О_Кат;
							СтрКатегория_.Н = Н_Кат;
							СтрКатегория_.РемонтЧ = РемонтЧ_Кат;
							СтрКатегория_.ВсегоОтрабЧасов = ВсегоОтрабЧасов_Кат;
							СтрКатегория_.ЯЧД = ЯЧД_Кат;
							СтрКатегория_.ЯЧ = ЯЧ_Кат;
							СтрКатегория_.С = С_Кат;
							СтрКатегория_.ПЧ = ПЧ_Кат;
							СтрКатегория_.К = К_Кат;
							СтрКатегория_.КЧ = КЧ_Кат;
							СтрКатегория_.КВых = КВых_Кат;
							СтрКатегория_.КВыхЧ = КВыхЧ_Кат;
							
							//*** )
							
							//*** (
							ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + ВсегоОтрабДней_Кат;
							ИтогПраздничные = ИтогПраздничные + П_Кат;
							ИтогДниРемонта = ИтогДниРемонта + ДниРемонта_Кат;
							ИтогДонор = ИтогДонор + Донор_Кат;
							ИтогОтстр = ИтогОтстр + Отстр_Кат;
							ИтогПрогулы = ИтогПрогулы + Прогулы_Кат;
							ИтогГД = ИтогГД + ГД_Кат;
							ИтогКД = ИтогКД + КД_Кат;
							ИтогНП = ИтогНП + НП_Кат;
							ИтогПоСред = ИтогПоСред + ПоСред_Кат;
							ИтогОЖ = ИтогОЖ + ОЖ_Кат;
							ИтогТтариф = ИтогТтариф + Ттариф_Кат;
							ИтогУч = ИтогУч + Уч_Кат;
							ИтогСРЗ = ИтогСРЗ + СРЗ_Кат;
							ИтогСРА = ИтогСРА + СРА_Кат;
							ИтогБольничныеРод = ИтогБольничныеРод + БРод_Кат;
							ИтогБольничные = ИтогБольничные + Б_Кат;
							ИтогОтпуск = ИтогОтпуск + О_Кат;
							ИтогНочные = ИтогНочные + Н_Кат;
							ИтогРемонтЧ = ИтогРемонтЧ + РемонтЧ_Кат;
							ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + ВсегоОтрабЧасов_Кат;
							ИтогДниФакт = ИтогДниФакт + ЯЧД_Кат;
							ИтогЧасыФакт = ИтогЧасыФакт + ЯЧ_Кат;
							ИтогСверхурочные = ИтогСверхурочные + С_Кат;
							ИтогПраздничныеЧ = ИтогПраздничныеЧ + ПЧ_Кат;
							ИтогКомандировка = ИтогКомандировка + К_Кат;
							ИтогКЧ = ИтогКЧ + КЧ_Кат;
							ИтогКомандировкаВых = ИтогКомандировкаВых + КВых_Кат;
							ИтогКВыхЧ = ИтогКВыхЧ + КВыхЧ_Кат;
							
							//*** )
							
						КонецЦикла;	
						
						Если ПоБригадам Тогда
							//*** (
							ТЗСотрудниковБригады[ААА-1].ВсегоОтрабДней = ВсегоОтрабДней_Бриг;
							ТЗСотрудниковБригады[ААА-1].П = П_Бриг;
							ТЗСотрудниковБригады[ААА-1].ДниРемонта = ДниРемонта_Бриг;
							ТЗСотрудниковБригады[ААА-1].Донор = Донор_Бриг;
							ТЗСотрудниковБригады[ААА-1].Отстр = Отстр_Бриг;
							ТЗСотрудниковБригады[ААА-1].Прогулы = Прогулы_Бриг;
							ТЗСотрудниковБригады[ААА-1].ГД = ГД_Бриг;
							ТЗСотрудниковБригады[ААА-1].КД = КД_Бриг;
							ТЗСотрудниковБригады[ААА-1].НП = НП_Бриг;
							ТЗСотрудниковБригады[ААА-1].ПоСред = ПоСред_Бриг;
							ТЗСотрудниковБригады[ААА-1].ОЖ = ОЖ_Бриг;
							ТЗСотрудниковБригады[ААА-1].Ттариф = Ттариф_Бриг;
							ТЗСотрудниковБригады[ААА-1].Уч = Уч_Бриг;
							ТЗСотрудниковБригады[ААА-1].СРЗ = СРЗ_Бриг;
							ТЗСотрудниковБригады[ААА-1].СРА = СРА_Бриг;
							ТЗСотрудниковБригады[ААА-1].БРод = БРод_Бриг;
							ТЗСотрудниковБригады[ААА-1].Б = Б_Бриг;
							ТЗСотрудниковБригады[ААА-1].О = О_Бриг;
							ТЗСотрудниковБригады[ААА-1].Н = Н_Бриг;
							ТЗСотрудниковБригады[ААА-1].РемонтЧ = РемонтЧ_Бриг;
							ТЗСотрудниковБригады[ААА-1].ВсегоОтрабЧасов = ВсегоОтрабЧасов_Бриг;
							ТЗСотрудниковБригады[ААА-1].ЯЧД = ЯЧД_Бриг;
							ТЗСотрудниковБригады[ААА-1].ЯЧ = ЯЧ_Бриг;
							ТЗСотрудниковБригады[ААА-1].С = С_Бриг;
							ТЗСотрудниковБригады[ААА-1].ПЧ = ПЧ_Бриг;
							ТЗСотрудниковБригады[ААА-1].К = К_Бриг;
							ТЗСотрудниковБригады[ААА-1].КЧ = КЧ_Бриг;
							ТЗСотрудниковБригады[ААА-1].КВыХ = КВых_Бриг;
							ТЗСотрудниковБригады[ААА-1].КВыхЧ = КВыхЧ_Бриг;
							
							//*** )
						КонецЕсли;
						
					КонецЦикла;
					
					Если ПоБригадам Тогда
						ТЗСотрудниковБригады.Свернуть("БригадаКод","ВсегоОтрабДней,ЯЧД,ДниРемонта,К,П,КВых,О,Б,БРод,СРА,СРЗ,Донор,Уч,Отстр,Ттариф,Прогулы,ГД,КД,НП,ПоСред,ОЖ,ВсегоОтрабЧасов,ЯЧ,РемонтЧ,КЧ,ПЧ,КВыхЧ,С,Н");
						ТЗСотрудниковБригады.Сортировать("БригадаКод");  
						Для Каждого СтрБригады ИЗ ТЗСотрудниковБригады Цикл
							ОбластьПодвалБригада.Параметры.ТекстПодвала = ?(ЗначениеЗаполнено(СтрБригады.БригадаКод),"Всего по БРИГАДЕ № " + СокрЛП(СтрБригады.БригадаКод),"Всего БЕЗ БРИГАДЫ");
							//*** (
							ОбластьПодвалБригада.Параметры.ИтогВсегоОтрабДней = СтрБригады.ВсегоОтрабДней;
							ОбластьПодвалБригада.Параметры.ИтогПраздничные = СтрБригады.П;
							ОбластьПодвалБригада.Параметры.ИтогДниРемонта = СтрБригады.ДниРемонта;
							ОбластьПодвалБригада.Параметры.ИтогДонор = СтрБригады.Донор;
							ОбластьПодвалБригада.Параметры.ИтогОтстр = СтрБригады.Отстр;
							ОбластьПодвалБригада.Параметры.ИтогПрогулы = СтрБригады.Прогулы;
							ОбластьПодвалБригада.Параметры.ИтогГД = СтрБригады.ГД;
							ОбластьПодвалБригада.Параметры.ИтогКД = СтрБригады.КД;
							ОбластьПодвалБригада.Параметры.ИтогНП = СтрБригады.НП;
							ОбластьПодвалБригада.Параметры.ИтогПоСред = СтрБригады.ПоСред;
							ОбластьПодвалБригада.Параметры.ИтогОЖ = СтрБригады.ОЖ;
							ОбластьПодвалБригада.Параметры.ИтогТтариф = СтрБригады.Ттариф;
							ОбластьПодвалБригада.Параметры.ИтогУч = СтрБригады.Уч;
							ОбластьПодвалБригада.Параметры.ИтогСРЗ = СтрБригады.СРЗ;
							ОбластьПодвалБригада.Параметры.ИтогСРА = СтрБригады.СРА;
							ОбластьПодвалБригада.Параметры.ИтогБольничныеРод = СтрБригады.БРод;
							ОбластьПодвалБригада.Параметры.ИтогБольничные = СтрБригады.Б;
							ОбластьПодвалБригада.Параметры.ИтогОтпуск = СтрБригады.О;
							ОбластьПодвалБригада.Параметры.ИтогНочные = СтрБригады.Н;
							ОбластьПодвалБригада.Параметры.ИтогРемонтЧ = СтрБригады.РемонтЧ;
							ОбластьПодвалБригада.Параметры.ИтогВсегоОтрабЧасов = СтрБригады.ВсегоОтрабЧасов;
							ОбластьПодвалБригада.Параметры.ИтогДниФакт = СтрБригады.ЯЧД;
							ОбластьПодвалБригада.Параметры.ИтогЧасыФакт = СтрБригады.ЯЧ;
							ОбластьПодвалБригада.Параметры.ИтогСверхурочные = СтрБригады.С;
							ОбластьПодвалБригада.Параметры.ИтогПраздничныеЧ = СтрБригады.ПЧ;
							ОбластьПодвалБригада.Параметры.ИтогКомандировка = СтрБригады.К;
							ОбластьПодвалБригада.Параметры.ИтогКЧ = СтрБригады.КЧ;
							ОбластьПодвалБригада.Параметры.ИтогКомандировкаВых = СтрБригады.КВых;
							ОбластьПодвалБригада.Параметры.ИтогКВыхЧ = СтрБригады.КВыхЧ;
							//*** )
							
							
							//Аверсон 04.11.2021 КВВ СВФР-008325 (
							//	ДокументРезультат.Вывести(ОбластьПодвалБригада);
							МассивДляПроверки.Очистить();
							МассивДляПроверки.Добавить(ОбластьПодвалБригада);
							МассивДляПроверки.Добавить(ОбластьПодвал5);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
							МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
							МассивДляПроверки.Добавить(ОбластьШапка3);
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
							
							Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
								ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
								ДокументРезультат.Вывести(ОбластьПодвал5);
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								НомерСтраницы = НомерСтраницы + 1;
								
								ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
								ДокументРезультат.Вывести(ОбластьШапка3);
							КонецЕсли;
							ДокументРезультат.Вывести(ОбластьПодвалБригада);
							//Аверсон 04.11.2021 КВВ СВФР-008325 )
							
							
						КонецЦикла;
					КонецЕсли;
					
					
					ТЗСотрудниковКатегории_.Свернуть("КатегорияКод,Категория","ВсегоОтрабДней,ЯЧД,ДниРемонта,К,П,КВых,О,Б,БРод,СРА,СРЗ,Донор,Уч,Отстр,Ттариф,Прогулы,ГД,КД,НП,ПоСред,ОЖ,ВсегоОтрабЧасов,ЯЧ,РемонтЧ,КЧ,ПЧ,КВыхЧ,С,Н");
					ТЗСотрудниковКатегории_.Сортировать("КатегорияКод,Категория");
					
					Для Каждого СтрКатегория ИЗ ТЗСотрудниковКатегории_ Цикл
						ОбластьПодвал4.Параметры.ТекстПодвала = "Всего по категории """ + СокрЛП(СтрКатегория.Категория) + """";
						//*** (
						ОбластьПодвал4.Параметры.ИтогВсегоОтрабДней = СтрКатегория.ВсегоОтрабДней;
						ОбластьПодвал4.Параметры.ИтогПраздничные = СтрКатегория.П;
						ОбластьПодвал4.Параметры.ИтогДниРемонта = СтрКатегория.ДниРемонта;
						ОбластьПодвал4.Параметры.ИтогДонор = СтрКатегория.Донор;
						ОбластьПодвал4.Параметры.ИтогОтстр = СтрКатегория.Отстр;
						ОбластьПодвал4.Параметры.ИтогПрогулы = СтрКатегория.Прогулы;
						ОбластьПодвал4.Параметры.ИтогГД = СтрКатегория.ГД;
						ОбластьПодвал4.Параметры.ИтогКД = СтрКатегория.КД;
						ОбластьПодвал4.Параметры.ИтогНП = СтрКатегория.НП;
						ОбластьПодвал4.Параметры.ИтогПоСред = СтрКатегория.ПоСред;
						ОбластьПодвал4.Параметры.ИтогОЖ = СтрКатегория.ОЖ;
						ОбластьПодвал4.Параметры.ИтогТтариф = СтрКатегория.Ттариф;
						ОбластьПодвал4.Параметры.ИтогУч = СтрКатегория.Уч;
						ОбластьПодвал4.Параметры.ИтогСРЗ = СтрКатегория.СРЗ;
						ОбластьПодвал4.Параметры.ИтогСРА = СтрКатегория.СРА;
						ОбластьПодвал4.Параметры.ИтогБольничныеРод = СтрКатегория.БРод;
						ОбластьПодвал4.Параметры.ИтогБольничные = СтрКатегория.Б;
						ОбластьПодвал4.Параметры.ИтогОтпуск = СтрКатегория.О;
						ОбластьПодвал4.Параметры.ИтогНочные = СтрКатегория.Н;
						ОбластьПодвал4.Параметры.ИтогРемонтЧ = СтрКатегория.РемонтЧ;
						ОбластьПодвал4.Параметры.ИтогВсегоОтрабЧасов = СтрКатегория.ВсегоОтрабЧасов;
						ОбластьПодвал4.Параметры.ИтогДниФакт = СтрКатегория.ЯЧД;
						ОбластьПодвал4.Параметры.ИтогЧасыФакт = СтрКатегория.ЯЧ;
						ОбластьПодвал4.Параметры.ИтогСверхурочные = СтрКатегория.С;
						ОбластьПодвал4.Параметры.ИтогПраздничныеЧ = СтрКатегория.ПЧ;
						ОбластьПодвал4.Параметры.ИтогКомандировка = СтрКатегория.К;
						ОбластьПодвал4.Параметры.ИтогКЧ = СтрКатегория.КЧ;
						ОбластьПодвал4.Параметры.ИтогКомандировкаВых = СтрКатегория.КВых;
						ОбластьПодвал4.Параметры.ИтогКВыхЧ = СтрКатегория.КВыхЧ;
						
						
						//*** )
						//Аверсон 04.11.2021 КВВ СВФР-008325 (
						//	ДокументРезультат.Вывести(ОбластьПодвал4);
						МассивДляПроверки.Очистить();
						МассивДляПроверки.Добавить(ОбластьПодвал4);
						МассивДляПроверки.Добавить(ОбластьПодвал5);
						//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
						МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
						МассивДляПроверки.Добавить(ОбластьШапка3);
						//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
						
						Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
							ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
							ДокументРезультат.Вывести(ОбластьПодвал5);
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							НомерСтраницы = НомерСтраницы + 1;
							
							ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
							ДокументРезультат.Вывести(ОбластьШапка3);
						КонецЕсли;
						ДокументРезультат.Вывести(ОбластьПодвал4);
						//Аверсон 04.11.2021 КВВ СВФР-008325 )
					КонецЦикла;
					
					ОбластьПодвал3.Параметры.ТекстПодвала = "ВСЕГО ПО ТАБЕЛЮ:";
					//*** (
					ОбластьПодвал3.Параметры.ИтогВсегоОтрабДней = ИтогВсегоОтрабДней;
					ОбластьПодвал3.Параметры.ИтогПраздничные = ИтогПраздничные;
					ОбластьПодвал3.Параметры.ИтогДниРемонта = ИтогДниРемонта;
					ОбластьПодвал3.Параметры.ИтогДонор = ИтогДонор;
					ОбластьПодвал3.Параметры.ИтогОтстр = ИтогОтстр;
					ОбластьПодвал3.Параметры.ИтогПрогулы = ИтогПрогулы;
					ОбластьПодвал3.Параметры.ИтогГД = ИтогГД;
					ОбластьПодвал3.Параметры.ИтогКД = ИтогКД;
					ОбластьПодвал3.Параметры.ИтогНП = ИтогНП;
					ОбластьПодвал3.Параметры.ИтогПоСред = ИтогПоСред;
					ОбластьПодвал3.Параметры.ИтогОЖ = ИтогОЖ;
					ОбластьПодвал3.Параметры.ИтогТтариф = ИтогТтариф;
					ОбластьПодвал3.Параметры.ИтогУч = ИтогУч;
					ОбластьПодвал3.Параметры.ИтогСРЗ = ИтогСРЗ;
					ОбластьПодвал3.Параметры.ИтогСРА = ИтогСРА;
					ОбластьПодвал3.Параметры.ИтогБольничныеРод = ИтогБольничныеРод;
					ОбластьПодвал3.Параметры.ИтогБольничные = ИтогБольничные;
					ОбластьПодвал3.Параметры.ИтогОтпуск = ИтогОтпуск;
					ОбластьПодвал3.Параметры.ИтогНочные = ИтогНочные;
					ОбластьПодвал3.Параметры.ИтогРемонтЧ = ИтогРемонтЧ;
					ОбластьПодвал3.Параметры.ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов;
					ОбластьПодвал3.Параметры.ИтогДниФакт = ИтогДниФакт;
					ОбластьПодвал3.Параметры.ИтогЧасыФакт = ИтогЧасыФакт;
					ОбластьПодвал3.Параметры.ИтогСверхурочные = ИтогСверхурочные;
					ОбластьПодвал3.Параметры.ИтогПраздничныеЧ = ИтогПраздничныеЧ;
					ОбластьПодвал3.Параметры.ИтогКомандировка = ИтогКомандировка;
					ОбластьПодвал3.Параметры.ИтогКЧ = ИтогКЧ;
					ОбластьПодвал3.Параметры.ИтогКомандировкаВых = ИтогКомандировкаВых;
					ОбластьПодвал3.Параметры.ИтогКВыхЧ = ИтогКВыхЧ;
					
					//*** )
					
					//Аверсон 04.11.2021 КВВ СВФР-008325 (
					//	ДокументРезультат.Вывести(ОбластьПодвал3);
					МассивДляПроверки.Очистить();
					МассивДляПроверки.Добавить(ОбластьПодвал3);
					МассивДляПроверки.Добавить(ОбластьПодвал5);
					//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) (
					МассивДляПроверки.Добавить(ОбластьЗаголовок4_1);
					МассивДляПроверки.Добавить(ОбластьШапка3);
					//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 7) )
					
					Если НЕ ДокументРезультат.ПроверитьВывод(МассивДляПроверки) Тогда
						ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
						ДокументРезультат.Вывести(ОбластьПодвал5);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						НомерСтраницы = НомерСтраницы + 1;
						
						ДокументРезультат.Вывести(ОбластьЗаголовок4_1);
						ДокументРезультат.Вывести(ОбластьШапка3);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьПодвал3);
					
					ОбластьПодвал5.Параметры.НомерСтраницы = НомерСтраницы;
					ДокументРезультат.Вывести(ОбластьПодвал5);
					//Аверсон 04.11.2021 КВВ СВФР-008325 )
					
					//Аверсон 04.11.2021 КВВ СВФР-008325 ( (закомментировано)
					//Если ЗначениеЗаполнено(ПодписьФИО1) Тогда
					//	ОбластьПодвал5.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность1,1)) + Сред(ПодписьДолжность1,2);
					//	ОбластьПодвал5.Параметры.ПодписьФИО = ПодписьФИО1;
					//	ДокументРезультат.Вывести(ОбластьПодвал5);   
					//КонецЕсли;
					//Если ЗначениеЗаполнено(ПодписьФИО2) Тогда
					//	ОбластьПодвал5.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность2,1)) + Сред(ПодписьДолжность2,2);
					//	ОбластьПодвал5.Параметры.ПодписьФИО = ПодписьФИО2;
					//	ДокументРезультат.Вывести(ОбластьПодвал5);   
					//КонецЕсли;	
					//
					////Аверсон 02.11.2021 КВВ СВФР-008325 (
					//ОбластьНомерСтраницы.Параметры.НомерСтраницы = НомерСтраницы;
					//ДокументРезультат.Вывести(ОбластьНомерСтраницы); 
					//НомерСтраницы = НомерСтраницы + 1;
					////Аверсон 02.11.2021 КВВ СВФР-008325 )
					//Аверсон 04.11.2021 КВВ СВФР-008325 ) (закомментировано) 
					
					//ДокументРезультат.ФиксацияСлева = 3;   //не работает, т.к ячейки объеденены в подвале. и без объденения не работает
					ДокументРезультат.ФиксацияСверху = 8;
					
					
					ДокументРезультат.ТолькоПросмотр	= Истина;
				КонецЕсли;
				
			Иначе  // ТАБЕЛЬ НЕ ИЗ ДОКУМЕНТА, А ИЗ РЕГИСТРОВ
				//Аверсон 06.09.2021 КВВ СВФР-007989 )
				
				//Аверсон 15.11.2019 КВВ СВФР-005053 (
				СчКолвоСтрок = 0;
				Если (Организация.ИНН = "806000046" ИЛИ Организация.ИНН = "700067572") И МакетИзДок = "ТабельНов" Тогда  //Аверсон 29.06.2021 КВВ СВФР-007782 (унп Бобруйска)
					КолвоНаСтр = ВосстановитьЗначение("КолвоНаСтр_ТабельНов");
					КолвоНаСтр = ?(ЗначениеЗаполнено(КолвоНаСтр),КолвоНаСтр,1);
					ВвестиЧисло(КолвоНаСтр,"Печатать строк на странице",2,0);	
					СохранитьЗначение("КолвоНаСтр_ТабельНов",КолвоНаСтр);
					
					//Аверсон 11.07.2021 КВВ СВФР-007813 (
					Если Организация.ИНН = "700067572" И МакетИзДок = "ТабельНов" Тогда
						ОтветПодписиНаКаждЛист = Вопрос("Выводить подписи на каждый лист?" + Символы.ПС + "Да - на каждый лист, но без цветового выделения выходных" + Символы.ПС + "Нет - подписи только в конце, но с цветовым выделением выходных", РежимДиалогаВопрос.ДаНет);
					КонецЕсли;
					//Аверсон 11.07.2021 КВВ СВФР-007813 )
				КонецЕсли;
				//Аверсон 15.11.2019 КВВ СВФР-005053 )
				
				НовыйМакет = Ложь;
				Если ПечатьНеявок = Ложь Тогда
					мМакет = ПолучитьМакет("Макет");
				Иначе         
					мМакет = ПолучитьМакет("МакетНеявки");
				КонецЕсли;
				Если не МакетИзДок = Неопределено Тогда 
					Если МакетИзДок = "ТабельНов" и ПечатьНеявок = Ложь Тогда 
						мМакет = ?(Организация.ИНН = "700067572" И ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") ,ПолучитьМакет("МакетНовБобруйск"),ПолучитьМакет("МакетНов"));  //Аверсон 11.07.2021 КВВ СВФР-007813 (Бобруйск)
						
						//Аверсон 15.12.2021 КВВ СВФР-008495 (
						Если Организация.ИНН = "100010315" 
							ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628" Тогда //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
							мМакет = ПолучитьМакет("МакетНовОртопеды");
						КонецЕсли;
						//Аверсон 15.12.2021 КВВ СВФР-008495 )
						
						НовыйМакет = Истина;
					КонецЕсли;
				ИначеЕсли ТабельНовый Тогда 
					Если ПечатьНеявок = Ложь Тогда 
						мМакет = ?(Организация.ИНН = "700067572" И ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации"),ПолучитьМакет("МакетНовБобруйск"),ПолучитьМакет("МакетНов"));  //Аверсон 11.07.2021 КВВ СВФР-007813 (Бобруйск)
						НовыйМакет = Истина;
					КонецЕсли;
				КонецЕсли;
				
				
				СписокВидовРасчета = Новый СписокЗначений;
				СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
				СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
				СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
				СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата);
				
				//Аверсон 29.08.2020 СВФР-006487 (
				Для Каждого Стр Из Справочники.ГруппыРасчетов.ДопВидыНачисленийДляТабеля.Основные Цикл 
					СписокВидовРасчета.Добавить(Стр.ВидРасчета);
				КонецЦикла;
				//Аверсон 29.08.2020 СВФР-006487 ) 
				
				Если ПечатьНеявок = Истина Тогда
					НеявкиТЗ = Новый ТаблицаЗначений;
					НеявкиТЗ.Колонки.Добавить("Неявка");
					НеявкиТЗ.Колонки.Добавить("Дней", Новый ОписаниеТипов("Число"));
					СпрКодировкаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Выбрать();
					Пока СпрКодировкаРабочегоВремени.Следующий() Цикл
						Если СпрКодировкаРабочегоВремени.Ссылка = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни или СпрКодировкаРабочегоВремени.Ссылка = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
							Продолжить;
						КонецЕсли;
						
						Если СпрКодировкаРабочегоВремени.ОтображатьВТабелях = Истина Тогда
							Если СпрКодировкаРабочегоВремени.РабочееВремя = Ложь Тогда
								НоваяСтрока = НеявкиТЗ.Добавить();
								НоваяСтрока.Неявка = СпрКодировкаРабочегоВремени.Ссылка;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				
				Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
					//BAV 25072011 добавил РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонДата, )
					ТекстЗапроса =
					"ВЫБРАТЬ
					|	Сотрудники.ДатаПриема,
					|	Сотрудники.ДатаУвольнения,
					|	Сотрудники.Сотрудник,
					|	Сотрудники.Сотрудник.Код КАК Таб,
					|	Сотрудники.Сотрудник.Наименование КАК ФИО,
					|	Сотрудники.Должность,";
					
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если Организация.ИНН = "700067572" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|	Сотрудники.РазрядЕТС,";
					КонецЕсли;
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					
					ТекстЗапроса = ТекстЗапроса + "
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
					|ИЗ
					|	(ВЫБРАТЬ
					|		Периоды.Сотрудник КАК Сотрудник,
					|		МАКСИМУМ(Периоды.НачДата) КАК ДатаПриема,
					|		МИНИМУМ(Периоды.КонДата) КАК ДатаУвольнения,
					|		МАКСИМУМ(Периоды.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,";
					
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если Организация.ИНН = "700067572" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|	МАКСИМУМ(Периоды.РазрядЕТС) КАК РазрядЕТС,";
					КонецЕсли;
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					
					ТекстЗапроса = ТекстЗапроса + "
					|		МАКСИМУМ(Периоды.Должность) КАК Должность
					|	ИЗ
					|		(ВЫБРАТЬ
					|			ПриятыеДоДаты.Сотрудник КАК Сотрудник,
					|			&НачДата КАК НачДата,
					|			&КонДата КАК КонДата,
					|			ПриятыеДоДаты.ПодразделениеОрганизации КАК ПодразделениеОрганизации,";
					
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если Организация.ИНН = "700067572" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|	ПриятыеДоДаты.РазрядЕТС КАК РазрядЕТС,";
					КонецЕсли;
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					
					ТекстЗапроса = ТекстЗапроса + "
					|			ПриятыеДоДаты.Должность КАК Должность
					|		ИЗ
					|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачДатаДо, (НЕ Временно)) КАК ПриятыеДоДаты
					|		ГДЕ
					|			ПриятыеДоДаты.Организация = &Организация
					|			И ПриятыеДоДаты.ЗанимаемыхСтавок <> 0
					|			И ПриятыеДоДаты.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
					|		
					|		ОБЪЕДИНИТЬ ВСЕ
					|		
					|		ВЫБРАТЬ
					|			Движение.Сотрудник,
					|			ВЫБОР
					|				КОГДА Движение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
					|					ТОГДА Движение.Период
					|				ИНАЧЕ &НачДата
					|			КОНЕЦ,
					|			ВЫБОР
					|				КОГДА Движение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
					|					ТОГДА Движение.Период
					|				ИНАЧЕ &КонДата
					|			КОНЕЦ,
					|			Движение.ПодразделениеОрганизации,";
					
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если Организация.ИНН = "700067572" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|	Движение.РазрядЕТС,";
					КонецЕсли;
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					
					ТекстЗапроса = ТекстЗапроса + "
					|			Движение.Должность
					|		ИЗ
					|			РегистрСведений.РаботникиОрганизаций КАК Движение
					|		ГДЕ
					|			Движение.Организация = &Организация
					|			И Движение.Период МЕЖДУ &НачДата И &КонДата
					|			И (НЕ Движение.Временно)) КАК Периоды
					|	
					|	СГРУППИРОВАТЬ ПО
					|		Периоды.Сотрудник) КАК Сотрудники
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонДата, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
					|		ПО Сотрудники.Сотрудник = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
					|ГДЕ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)";
					Если ЗначениеЗаполнено(Подразделение) Тогда  //О.Т. Аверсон 23.02.2017 № 300
						ТекстЗапроса = ТекстЗапроса + "	
						|	И Сотрудники.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
					КонецЕсли;
					
					//Аверсон ЕАЕ 08.09.2025 СВФР-016595
					Если Сотрудник.Количество() > 0 Тогда
						ТекстЗапроса = ТекстЗапроса + "	
						|	И Сотрудники.Сотрудник В (&СписокСотрудников)";
					КонецЕсли;
					//Аверсон СВФР-016595
					
					ТекстЗапроса = ТекстЗапроса + "
					|
					|СГРУППИРОВАТЬ ПО
					|	Сотрудники.ДатаПриема,
					|	Сотрудники.ДатаУвольнения,
					|	Сотрудники.Сотрудник,
					|	Сотрудники.Сотрудник.Код,
					|	Сотрудники.Сотрудник.Наименование,";
					
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если Организация.ИНН = "700067572" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|	Сотрудники.РазрядЕТС,";
					КонецЕсли;
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					
					ТекстЗапроса = ТекстЗапроса + "
					|	Сотрудники.Должность,
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
					|
					|УПОРЯДОЧИТЬ ПО
					|	Таб";
					
					//Аверсон ЕАЕ 08.09.2025 СВФР-016595
					//Запрос.УстановитьПараметр("НачДата",	НачалоМесяца(ДатаАктуальности));
					//Запрос.УстановитьПараметр("НачДатаДо",	НачалоМесяца(ДатаАктуальности)-1);
					//Запрос.УстановитьПараметр("КонДата",	КонецМесяца(ДатаАктуальности));
					Запрос.УстановитьПараметр("НачДата",	Нач);
					Запрос.УстановитьПараметр("НачДатаДо",	НачалоДня(Нач)-1);
					Запрос.УстановитьПараметр("КонДата",	Кон);
					Если ПоСотрудникам Тогда
						Запрос.УстановитьПараметр("СписокСотрудников", Сотрудник);
					КонецЕсли;
					//Аверсон СВФР-016595
					
					Запрос.УстановитьПараметр("Организация",		Организация);   
					Запрос.УстановитьПараметр("ПодразделениеОрганизации",      Подразделение);
					Запрос.УстановитьПараметр("ВидРасчета",      СписокВидовРасчета);
					
				Иначе
					Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						ТекстЗапроса = ПолучитьТекстЗапросаПоПоказатель1();  //Аверсон 10.11.2020 КВВ СВФР-006805 (код вынесен отдельно)
						
						Запрос.УстановитьПараметр("ПодразделениеОрганизации",      Подразделение);
						Запрос.УстановитьПараметр("ВидРасчета",      СписокВидовРасчета);
						
						//Аверсон ЕАЕ 08.09.2025 СВФР-016595
						//Запрос.УстановитьПараметр("КонДата",	КонецМесяца(ДатаАктуальности));
						Запрос.УстановитьПараметр("КонДата",	КонецМесяца(Кон));
						//Аверсон СВФР-016595
						
						//BAV 25072011 добавил РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонДата, )
						//РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, )
						
					ИначеЕсли ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
						ТекстЗапроса =
						"ВЫБРАТЬ
						|	СдельныйНарядИсполнители.Сотрудник.Код КАК Таб,
						|	СдельныйНарядИсполнители.Сотрудник.Наименование КАК ФИО,
						|	СдельныйНарядИсполнители.Сотрудник,
						|	СдельныйНарядИсполнители.Должность,
						|	СдельныйНарядИсполнители.ТарифнаяСтавка КАК Тариф
						|ИЗ
						|	Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
						|		
						|ГДЕ
						|	СдельныйНарядИсполнители.Ссылка = &Ссылка
						
						|УПОРЯДОЧИТЬ ПО
						|Таб";
						
					КонецЕсли;
					
					Запрос.УстановитьПараметр("Ссылка",	ДокументТабель);
					
				КонецЕсли;
				
				Запрос.Текст = ТекстЗапроса;
				
				РезультатЗапроса = Запрос.Выполнить();
				
				//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) (		
				Если Организация.ИНН = "700067572" Тогда       
					ТЗРезультатЗапроса = РезультатЗапроса.Выгрузить();
					ТЗРезультатЗапросаСотр1 = ТЗРезультатЗапроса.Скопировать();
					ТЗРезультатЗапросаСотр = ТЗРезультатЗапроса.Скопировать();
					ТЗРезультатЗапросаСотр.Свернуть("Сотрудник",);
					Если ТЗРезультатЗапроса.Количество() <> ТЗРезультатЗапросаСотр.Количество() Тогда
						Для Каждого СтрТЗРезультатЗапросаСотр1 ИЗ ТЗРезультатЗапросаСотр1 Цикл
							СотрСтроки = ТЗРезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",СтрТЗРезультатЗапросаСотр1.Сотрудник));
							Если СотрСтроки.Количество() > 1 Тогда
								Сч = 0;
								Для Каждого СтрокаТаблицы Из СотрСтроки Цикл
									Сч = Сч + 1;
									Если Сч > 1 Тогда
										ТЗРезультатЗапроса.Удалить(СтрокаТаблицы);
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) )
				
				//Аверсон ЕАЕ 08.09.2025 СВФР-016595
				//ДокументРезультат.Очистить();
				//Аверсон СВФР-016595
				
				//Аверсон-софт, Островская Татьяна 28.04.2012 № 15286
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
				|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
				|	Организации.Наименование,
				|	ОрганизацииОтветственныеЛица.Дата КАК Дата
				|ИЗ
				|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
				|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
				|ГДЕ
				|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
				|	И Организации.Наименование = &Наименование
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата";
				
				Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
				Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
				
				Результат = Запрос.Выполнить().Выбрать();
				
				Пока Результат.Следующий() Цикл
					Руководитель = Результат.Сотрудник;
				КонецЦикла;
				//Аверсон-софт, Островская Татьяна 14.08.2012 № 15
				если не Руководитель = Неопределено Тогда 
					//Аверсон-софт, Островская Татьяна 14.08.2012 № 15
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФИОФизЛиц.Фамилия,
					|	ФИОФизЛиц.Имя,
					|	ФИОФизЛиц.Отчество,
					|	ФИОФизЛиц.ФизЛицо
					|ИЗ
					|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
					|ГДЕ
					|	ФИОФизЛиц.ФизЛицо = &ФизЛицо";
					
					Запрос.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
					
					Результат1 = Запрос.Выполнить().Выбрать();
					Пока Результат1.Следующий() цикл
						Фамилия = Результат1.Фамилия;
						Имя = Лев(Результат1.Имя,1);
						Отчество = Лев(Результат1.Отчество,1);
						ФИО = Фамилия + " "+Имя+"."+Отчество+".";
					КонецЦикла;
				КонецЕсли;
				
				//Аверсон-софт, Островская Татьяна 28.04.2012 № 15286
				
				ЕСли ПечатьНеявок = Ложь Тогда
					если (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") и НовыйМакет = Ложь Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							Область = мМакет.ПолучитьОбласть("Заголовок3");
						иначе
							Область = мМакет.ПолучитьОбласть("Заголовок1");
						КонецЕсли;
					иначе
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							//Аверсон 24.10.2019 КВВ СВФР-004972 (
							Если Организация.ИНН = "806000046" И МакетИзДок = "ТабельНов" Тогда
								Область = мМакет.ПолучитьОбласть("Заголовок3");
							Иначе
								//Аверсон 24.10.2019 КВВ СВФР-004972 )
								Если Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628" Тогда
									Область = мМакет.ПолучитьОбласть("ЗаголовокПервый");  
									ФилиалРП  = "";
									УправлениеОтчетами.Просклонять(глСклонение,организация,2,ФилиалРП,,ложь);
									
									Область.Параметры.ФЛ = ФилиалРП;
									Область.Параметры.ИОФ = Имя+"."+Отчество+"."+Фамилия;
									ДокументРезультат.Вывести(Область);
								КонецЕсли;
								//Аверсон 12.02.2021 КВВ СВФР-007187 (
								Если Организация.ИНН = "700067572" Тогда
									Область = мМакет.ПолучитьОбласть("Заголовок4");
								Иначе
									//Аверсон 12.02.2021 КВВ СВФР-007187 )
									Область = мМакет.ПолучитьОбласть("Заголовок2");
								КонецЕсли;
							КонецЕсли;
						иначе
							Область = мМакет.ПолучитьОбласть("Заголовок");
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область = мМакет.ПолучитьОбласть("Заголовок1|Область4");
					иначе
						Область = мМакет.ПолучитьОбласть("Заголовок|Область1");
					КонецЕсли;
				КонецЕсли;
				Область.Параметры.Организация = Организация.Наименование;
				Область.Параметры.Подразделение = Подразделение.Наименование;
				
				//Аверсон ЕАЕ 08.09.2025 СВФР-016595
				//Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(ДатаАктуальности), КонецМесяца(ДатаАктуальности), "ДФ=""ММММ.гггг""");
				Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(Нач), КонецМесяца(Кон), "ДФ=""ММММ.гггг""");
				//Аверсон СВФР-016595
				
				//Аверсон-софт, Островская Татьяна 28.04.2012 № 15286  
				если не ПечатьНеявок Тогда
					если ФИО = Неопределено Тогда 
						Если НЕ (Организация.ИНН = "806000046" И МакетИзДок = "ТабельНов") Тогда  //Аверсон 24.10.2019 КВВ СВФР-004972
							Область.Параметры.Руководитель = Руководитель;
						КонецЕсли;
					иначе
						Если НЕ (Организация.ИНН = "806000046" И МакетИзДок = "ТабельНов") Тогда  //Аверсон 24.10.2019 КВВ СВФР-004972
							Если НЕ ((Организация.ИНН = "100010315" 
								ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
								И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь) Тогда  //Аверсон 15.12.2021 КВВ СВФР-008495
								Область.Параметры.Руководитель = ФИО;
							КонецЕсли;;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				//Аверсон-софт, Островская Татьяна 28.04.2012 № 15286
				Если ЗначениеЗаполнено(ДокументТабель) тогда 
					Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
						Область.Параметры.ТекстНаряд = " по наряду ";
						Область.Параметры.НомерНаряда = ДокументТабель.Номер;
					ИначеЕсли ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область.Параметры.ТекстНаряд = " по табелю ";
						Область.Параметры.НомерНаряда = ДокументТабель.Номер;			
					КонецЕсли;
				Иначе
					Область.Параметры.ТекстНаряд = "";
					Область.Параметры.НомерНаряда = "";			
				КонецЕсли;
				
				Если ПечатьНеявок = Истина Тогда
					ДокументРезультат.Вывести(Область);
					
					Если НеявкиТЗ.Количество() > 0 Тогда   
						Для Каждого ТекСтр Из НеявкиТЗ Цикл
							Область = мМакет.ПолучитьОбласть("Заголовок|Область2");
							ДокументРезультат.Присоединить(Область);
							
						КонецЦикла;
					КонецЕсли;
					
					Область = мМакет.ПолучитьОбласть("Заголовок|Область3");
					ДокументРезультат.Присоединить(Область);
					
				КонецЕсли;
				
				
				//Параметры документа
				ДокументРезультат.Автомасштаб         = Истина;
				ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
				ДокументРезультат.ПолеСлева			 = 0;
				ДокументРезультат.ПолеСправа		 = 0;
				ОбластьПовторения = мМакет.Область(5, ,8, );
				ДокументРезультат.ПовторятьПриПечатиСтроки = ОбластьПовторения;
				
				Если ПечатьНеявок = Ложь Тогда
					ДокументРезультат.Вывести(Область);
					//Островская Татьяна 25.02.2014 № 17145
					если (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") и НовыйМакет = Ложь Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
						//Шапка
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							Область = мМакет.ПолучитьОбласть("Шапка3");
						иначе
							Область = мМакет.ПолучитьОбласть("Шапка1");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
						ДокументРезультат.Вывести(Область);
						ОбластьШапки = Область; // ПСА 11-01-2021 СВФР-007034 +++
						//детали	
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							Область = мМакет.ПолучитьОбласть("Детали3");
						иначе
							Область = мМакет.ПолучитьОбласть("Детали1");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
					иначе
						//Шапка
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							//Аверсон 12.02.2021 КВВ СВФР-007187 (
							Если Организация.ИНН = "700067572" Тогда
								//Аверсон 11.07.2021 КВВ СВФР-007813 (         
								ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
								Если ЭтоТрансЦех Тогда
									Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Шапка3ТБ"),мМакет.ПолучитьОбласть("Шапка3Т")); //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
								Иначе
									Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Шапка3Б"),мМакет.ПолучитьОбласть("Шапка3")); //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
								КонецЕсли;
								//Область.Параметры.ПрофессияТ = ?(ДокументТабель.ВыводитьНаимБригады,"Профессия (Наименование бригады)","Профессия");   //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) закомментировано
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								
								//Аверсон ЕАЕ 21.05.2024 СВФР-012907
								//Климовичи
							ИначеЕсли Организация.ИНН = "700103211" Тогда
								Область = мМакет.ПолучитьОбласть("Шапка5");	
								//Аверсон СВФР-012907
								
							Иначе
								//Аверсон 12.02.2021 КВВ СВФР-007187 )
								Область = мМакет.ПолучитьОбласть("Шапка2");
							КонецЕсли;
						иначе
							Область = мМакет.ПолучитьОбласть("Шапка");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
						ДокументРезультат.Вывести(Область);
						ОбластьШапки = Область; // ПСА 11-01-2021 СВФР-007034 +++
						
						//Аверсон 12.02.2021 КВВ СВФР-007187 (
						Если Организация.ИНН = "700067572" И ОтветПодписиНаКаждЛист = КодВозвратаДиалога.Нет Тогда
							
							//Аверсон ЕАЕ 08.09.2025 СВФР-016595
							//А = НачалоМесяца(ДатаАктуальности);
							//Б = НачалоДня(КонецМесяца(ДатаАктуальности));
							А = НачалоМесяца(Нач);
							Б = НачалоДня(КонецМесяца(Кон));
							//Аверсон СВФР-016595
							
							Пока А<=Б Цикл;
								Если ДеньНедели(А) = 6 ИЛИ ДеньНедели(А)=7 Тогда
									//ДокументРезультат.Область(7, 6+День(А), 8, 6+День(А)).ЦветФона = WebЦвета.Розовый;
									ДокументРезультат.Область(6, 6+День(А), 8, 6+День(А)).ЦветФона = WebЦвета.Розовый; //Аверсон 29.06.2021 КВВ СВФР-007782
								КонецЕсли;
								А = А+60*60*24;
							КонецЦикла;
						КонецЕсли;
						//Аверсон 12.02.2021 КВВ СВФР-007187 )
						
						//детали	
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							//Аверсон 12.02.2021 КВВ СВФР-007187 (
							Если Организация.ИНН = "700067572" Тогда
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
								Если ЭтоТрансЦех Тогда
									Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Детали3ТБ"),мМакет.ПолучитьОбласть("Детали3Т"));  //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) 
								Иначе
									Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Детали3Б"),мМакет.ПолучитьОбласть("Детали3")); //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
								КонецЕсли;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								
								//Аверсон ЕАЕ 21.05.2024 СВФР-012907
								//Климовичи
							ИначеЕсли Организация.ИНН = "700103211" Тогда
								Область = мМакет.ПолучитьОбласть("Детали5");	
								//Аверсон СВФР-012907
								
							Иначе
								//Аверсон 12.02.2021 КВВ СВФР-007187 )
								Область = мМакет.ПолучитьОбласть("Детали2");
							КонецЕсли;
						иначе
							Область = мМакет.ПолучитьОбласть("Детали");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
					КонецЕсли;	
					//Островская Татьяна 25.02.2014 № 17145
				Иначе
					//О.Т. 24.02.2015 № 366
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область = мМакет.ПолучитьОбласть("Шапка1|Область4");
					иначе
						Область = мМакет.ПолучитьОбласть("Шапка|Область1");
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					ДокументРезультат.Вывести(Область);
					
					н = 1; к = Окр(НеявкиТЗ.Количество() / 2);
					
					Если НеявкиТЗ.Количество() > 0 Тогда   
						Для Каждого ТекСтр Из НеявкиТЗ Цикл
							мТекст = "";
							//О.Т. 24.02.2015 № 366
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								Область = мМакет.ПолучитьОбласть("Шапка1|Область5");
							иначе
								Область = мМакет.ПолучитьОбласть("Шапка|Область2");
							КонецЕсли;
							//О.Т. 24.02.2015 № 366
							Если н = к Тогда
								мТекст = "Неявки (человеко - дни)";
							КонецЕсли;
							Область.Параметры.Текст = мТекст;
							Область.Параметры.Неявка = СокрЛП(ТекСтр.Неявка.Наименование);
							Область.Параметры.НеявкаСокр = СокрЛП(ТекСтр.Неявка.БуквенныйКод);
							ДокументРезультат.Присоединить(Область);
							н = н + 1;
						КонецЦикла;
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область = мМакет.ПолучитьОбласть("Шапка1|Область6");
					иначе
						Область = мМакет.ПолучитьОбласть("Шапка|Область3");
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					ДокументРезультат.Присоединить(Область);
					
				КонецЕсли;
				
				
				Если НовыйМакет Тогда //О.Т. Аверсон 25.11.2016 № 51
					ЗапросП = Новый Запрос;
					ТекстЗапроса =
					
					//Аверсон 03.03.2023 КВВ СВФР-010471 (
					"ВЫБРАТЬ
					|ПСР.ДатаНачала,
					|КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ПСР.ДатаОкончания, ДЕНЬ, -1),ДЕНЬ) КАК ДатаОкончания,
					|ПСР.Сотрудник,
					|ПСР.Регистратор
					|ПОМЕСТИТЬ ВтКомандировок
					|ИЗ РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПСР
					|ГДЕ ПСР.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
					|;
					|
					//Аверсон 03.03.2023 КВВ СВФР-010471 )
					
					//СВЭЙ 15.04.2024 КВВ СВФР-012843 (
					|
					|ВЫБРАТЬ 
					|РабочееВремяРаботниковОрганизаций.Период,
					|РабочееВремяРаботниковОрганизаций.Сотрудник,
					|РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|ПОМЕСТИТЬ ВтДниКомандировок
					|
					|ИЗ
					|РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций 
					|ГДЕ РабочееВремяРаботниковОрганизаций.Сотрудник В(&Сотрудник)       
					|И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата 
					|И (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)     
					|И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор
					|И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
					|И ВЫБОР
					|КОГДА &ФлагПоТабелю
					|ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
					|ИНАЧЕ ИСТИНА
					|КОНЕЦ
					|;   
					|
					|ВЫБРАТЬ 
					|РабочееВремяРаботниковОрганизаций.Период,
					|РабочееВремяРаботниковОрганизаций.Сотрудник,
					|РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|ПОМЕСТИТЬ ВтДниПраздников
					|
					|ИЗ
					|РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций 
					|ГДЕ РабочееВремяРаботниковОрганизаций.Сотрудник В(&Сотрудник)       
					|И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата 
					|И (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)     
					|И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор
					|И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
					|И ВЫБОР
					|КОГДА &ФлагПоТабелю
					|ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
					|ИНАЧЕ ИСТИНА
					|КОНЕЦ
					|;
					//СВЭЙ 15.04.2024 КВВ СВФР-012843 )
					
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВЫБОР
					//(начало) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					//|	КОГДА ЕСТЬNULL(ПериодыСостоянийРаботниковОрганизаций.Сотрудник, 1) = 1
					//(конец ) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|	КОГДА ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) <> 1
					|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
					|	ИНАЧЕ ВЫБОР
					|			КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций  //О.Т. Аверсон 18.10.2017 № 1139
					|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
					|				ИНАЧЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|			КОНЕЦ
					|	КОНЕЦ КАК ВидВремени,
					|	//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,  //Островская Татьяна 13.12.2013 № 16970
					|	РабочееВремяРаботниковОрганизаций.Период КАК Дата,
					|	СУММА(ВЫБОР";
					
					//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 1) (
					Если Организация.ИНН = "101542412" Тогда 
						ТекстЗапроса = ТекстЗапроса + "
						//|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ (НЕ СостояниеРаботает.Сотрудник IS NULL И НЕ СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска))";
						
						//Аверсон 11.11.2022 КВВ СВФР-009828 (
						|КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ 
						|(НЕ СостояниеРаботает.Сотрудник IS NULL И 
						|(НЕ СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска ИЛИ
						|(СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска И 
						|(
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Компенсация)
						
						//Аверсон 19.01.2023 КВВ СВФР-010191 (
						|ИЛИ
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Продление)
						|ИЛИ
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
						//Аверсон 19.01.2023 КВВ СВФР-010191 )
						
						|))
						|)))";
						//Аверсон 11.11.2022 КВВ СВФР-009828 )
						
					Иначе
						//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 1) )
						
						//(начало) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						//|	КОГДА ЕСТЬNULL(ПериодыСостоянийРаботниковОрганизаций.Сотрудник, 1) = 1
						//(конец ) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						ТекстЗапроса = ТекстЗапроса + "
						|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )";
						//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса + "
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА 
					
					//Аверсон 03.03.2023 КВВ СВФР-010471 (
					//|РабочееВремяРаботниковОрганизаций.Часов				
					|ВЫБОР КОГДА 
					|СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска";
					
					//Аверсон 07.06.2023 КВВ СВФР-010937 (
					Если Организация.ИНН = "100010315" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|И 
						|((ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
						|И СостояниеРаботает.Регистратор.Приказ.Ссылка = ПериодыСостоянийРаботниковОрганизаций.Регистратор.Ссылка
						|)
						|ИЛИ
						|ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
						|)";
					Иначе
						//Аверсон 07.06.2023 КВВ СВФР-010937 )
						ТекстЗапроса = ТекстЗапроса + "
						|И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
						|И СостояниеРаботает.Регистратор.Приказ.Ссылка = ПериодыСостоянийРаботниковОрганизаций.Регистратор.Ссылка";
					КонецЕсли;
					
					ТекстЗапроса = ТекстЗапроса + "
					|И ЕСТЬNULL(ВтКомандировок.Сотрудник, 1) <> 1
					|ТОГДА 0
					|ИНАЧЕ				
					|РабочееВремяРаботниковОрганизаций.Часов
					|КОНЕЦ				
					//Аверсон 03.03.2023 КВВ СВФР-010471 )
					
					|	ИНАЧЕ 0
					|	КОНЕЦ) КАК Часов,
					|	СУММА(ВЫБОР";
					
					//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 1) (
					Если Организация.ИНН = "101542412" Тогда 
						ТекстЗапроса = ТекстЗапроса + "
						//|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ (НЕ СостояниеРаботает.Сотрудник IS NULL И НЕ СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска))";
						
						//Аверсон 11.11.2022 КВВ СВФР-009828 (
						|КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ 
						|(НЕ СостояниеРаботает.Сотрудник IS NULL И 
						|(НЕ СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска ИЛИ
						|(СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска И 
						|(
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Компенсация)
						
						//Аверсон 19.01.2023 КВВ СВФР-010191 (
						|ИЛИ
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Продление)
						|ИЛИ
						|СостояниеРаботает.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
						//Аверсон 19.01.2023 КВВ СВФР-010191 )
						|))
						|)))";
						//Аверсон 11.11.2022 КВВ СВФР-009828 )
						
					Иначе
						//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 1) )
						
						//(начало) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						//|	КОГДА ЕСТЬNULL(ПериодыСостоянийРаботниковОрганизаций.Сотрудник, 1) = 1
						//(конец ) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
						ТекстЗапроса = ТекстЗапроса + "
						|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )";
						//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса + "
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1";
					
					//Аверсон 07.06.2023 КВВ СВФР-010937 (
					Если Организация.ИНН = "100010315" Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|ТОГДА
						|ВЫБОР КОГДА
						|СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
						|И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
						|И ЕСТЬNULL(ВтКомандировок.Сотрудник, 1) <> 1
						|ТОГДА РабочееВремяРаботниковОрганизаций.Часов
						|ИНАЧЕ 0 
						|КОНЕЦ ";
					Иначе
						ТекстЗапроса = ТекстЗапроса + "	
						|		ТОГДА 0";
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса + "
					|	ИНАЧЕ ";
					
					//Аверсон 12.11.2022 КВВ СВФР-009828 (пункт 2) (
					//|РабочееВремяРаботниковОрганизаций.Часов
					Если Организация.ИНН = "101542412" Тогда 
						ТекстЗапроса = ТекстЗапроса + "
						|ВЫБОР КОГДА СостояниеРаботает.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска И 
						|ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
						|ТОГДА 0
						|ИНАЧЕ
						|РабочееВремяРаботниковОрганизаций.Часов
						|КОНЕЦ";
					Иначе
						ТекстЗапроса = ТекстЗапроса + "
						//СВЭЙ 15.04.2024 КВВ СВФР-012843 (
						//|РабочееВремяРаботниковОрганизаций.Часов";
						|ВЫБОР КОГДА 
						|РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
						|И НЕ ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
						|И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
						|И ЕСТЬNULL(ВтДниКомандировок.Сотрудник, 1) <> 1
						|И ЕСТЬNULL(ВтДниПраздников.Сотрудник, 1) <> 1
						|ТОГДА 0
						|ИНАЧЕ
						|РабочееВремяРаботниковОрганизаций.Часов 
						|КОНЕЦ";
						//СВЭЙ 15.04.2024 КВВ СВФР-012843 )
					КонецЕсли;
					ТекстЗапроса = ТекстЗапроса + "
					//Аверсон 12.11.2022 КВВ СВФР-009828 (пункт 2) )
					
					|	КОНЕЦ) КАК ЧасовК,
					|	ВЫБОР
					|		КОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ КАК Порядок,
					|	РабочееВремяРаботниковОрганизаций.Сотрудник,
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочееВремяРаботниковОрганизаций.Период) КАК Дней
					|ИЗ
					|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
					|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
					|   ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ПериодыСостоянийРаботниковОрганизаций.Сотрудник
					//(начало) добавлено Кухарчуком Д.Я. 12.12.18, Задача СВФР-002220
					|	И (ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <> ДАТАВРЕМЯ(1,1,1) И ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания <> ДАТАВРЕМЯ(1,1,1) )
					//(конец ) добавлено Кухарчуком Д.Я. 12.12.18, Задача СВФР-002220
					|	И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.ДатаНачала И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания, ДЕНЬ, -1))
					//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботает
					|   ПО РабочееВремяРаботниковОрганизаций.Сотрудник = СостояниеРаботает.Сотрудник
					|   И СостояниеРаботает.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает) 
					|   И СостояниеРаботает.Организация = &Организация 
					|	И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ СостояниеРаботает.Период И КОНЕЦПЕРИОДА( СостояниеРаботает.ПериодЗавершения, ДЕНЬ) )
					//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
					|	ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ПереносДнейКомандировок.Сотрудник
					|	И РабочееВремяРаботниковОрганизаций.Период = ПереносДнейКомандировок.ДатаНаКакую
					
					//Аверсон 03.03.2023 КВВ СВФР-010471 (
					|
					|ЛЕВОЕ СОЕДИНЕНИЕ ВтКомандировок
					|ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ВтКомандировок.Сотрудник
					|И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ ВтКомандировок.ДатаНачала И ВтКомандировок.ДатаОкончания
					|
					//Аверсон 03.03.2023 КВВ СВФР-010471 )
					
					//СВЭЙ 15.04.2024 КВВ СВФР-012843 (
					|ЛЕВОЕ СОЕДИНЕНИЕ ВтДниКомандировок
					|ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ВтДниКомандировок.Сотрудник
					|И РабочееВремяРаботниковОрганизаций.Период = ВтДниКомандировок.Период
					|
					|ЛЕВОЕ СОЕДИНЕНИЕ ВтДниПраздников
					|ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ВтДниПраздников.Сотрудник
					|И РабочееВремяРаботниковОрганизаций.Период = ВтДниПраздников.Период 
					|
					//СВЭЙ 15.04.2024 КВВ СВФР-012843 )
					
					|ГДЕ
					|	РабочееВремяРаботниковОрганизаций.Сотрудник В(&Сотрудник)
					|	И (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
					|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
					|	И (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)
					|			ИЛИ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность))
					|  //И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор
					|	И ВЫБОР
					|			КОГДА &ФлагПоТабелю
					|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ 
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР
					//(начало) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					//|	КОГДА ЕСТЬNULL(ПериодыСостоянийРаботниковОрганизаций.Сотрудник, 1) = 1
					//(конец ) закоментировано Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|	КОГДА ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) <> 1
					|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
					|	ИНАЧЕ ВЫБОР
					|			КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций //О.Т. Аверсон 18.10.2017 № 1139
					|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
					|			ИНАЧЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|		  КОНЕЦ
					|	КОНЕЦ,
					|	//РабочееВремяРаботниковОрганизаций.Тариф,	  //Островская Татьяна 13.12.2013 № 16970
					|	РабочееВремяРаботниковОрганизаций.Сотрудник,
					|	РабочееВремяРаботниковОрганизаций.Период,
					|	ВЫБОР
					|		КОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ
					|
					|УПОРЯДОЧИТЬ ПО
					|	Порядок"; //О.Т. Аверсон 25.11.2016 № 51
				иначе
					ЗапросП = Новый Запрос;
					ТекстЗапроса =
					"ВЫБРАТЬ
					|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
					|	//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,  //Островская Татьяна 13.12.2013 № 16970
					|	РабочееВремяРаботниковОрганизаций.Период КАК Дата,
					|	Сумма(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
					|	ВЫБОР
					|		КОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ КАК Порядок,
					|	РабочееВремяРаботниковОрганизаций.Сотрудник,
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочееВремяРаботниковОрганизаций.Период) КАК Дней
					|ИЗ
					|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
					|ГДЕ
					|	РабочееВремяРаботниковОрганизаций.Сотрудник В(&Сотрудник)
					|	И (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
					|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
					|	И (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)
					|			ИЛИ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность))
					|  //И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор
					|	И ВЫБОР
					|			КОГДА &ФлагПоТабелю
					|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ 
					|СГРУППИРОВАТЬ ПО
					|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
					|	//РабочееВремяРаботниковОрганизаций.Тариф,	  //Островская Татьяна 13.12.2013 № 16970		
					|	РабочееВремяРаботниковОрганизаций.Период, 
					|	ВЫБОР
					|		КОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ,
					|	РабочееВремяРаботниковОрганизаций.Сотрудник
					|
					|УПОРЯДОЧИТЬ ПО
					|	Порядок";
				КонецЕсли;
				
				//Аверсон ЕАЕ 08.09.2025 СВФР-016595
				//ЗапросП.УстановитьПараметр("НачДата",	НачалоМесяца(ДатаАктуальности));
				//ЗапросП.УстановитьПараметр("КонДата",	КонецМесяца(ДатаАктуальности));
				ЗапросП.УстановитьПараметр("НачДата",	НачалоМесяца(Нач));
				ЗапросП.УстановитьПараметр("КонДата",	КонецМесяца(Кон));
				//Аверсон СВФР-016595
				
				Если ЗначениеЗаполнено(ДокументТабель) Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор","И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор");
					//Островская Татьяна 13.12.2013 № 16970
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,","РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф,","РабочееВремяРаботниковОрганизаций.Тариф,");
					//Островская Татьяна 13.12.2013 № 16970
					ЗапросП.УстановитьПараметр("Регистратор",	ДокументТабель.Ссылка);
					
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) (
					Если Организация.ИНН = "700067572" Тогда
						ЗапросП.УстановитьПараметр("Сотрудник",  ТЗРезультатЗапроса.ВыгрузитьКолонку("Сотрудник")); 
						//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) )
					Иначе
						ЗапросП.УстановитьПараметр("Сотрудник",  РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
					КонецЕсли;
				Иначе 
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) (
					Если Организация.ИНН = "700067572" Тогда
						ЗапросП.УстановитьПараметр("Сотрудник",  ТЗРезультатЗапроса.ВыгрузитьКолонку("Сотрудник")); 
						//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) )
					Иначе
						ЗапросП.УстановитьПараметр("Сотрудник",  РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
					КонецЕсли;
					
					//Островская Татьяна 13.12.2013 № 16970
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,","");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф,","");
					//Островская Татьяна 13.12.2013 № 16970
				КонецЕсли;
				
				//Аверсон ЕАЕ 10.09.2025 СВФР-016610
				//Бобруйскводоканал
				Если Организация.ИНН = "790041382" И ЗначениеЗаполнено(ДокументТабель) И НовыйМакет = Истина Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочееВремяРаботниковОрганизаций.Период) КАК Дней","СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней");
				КонецЕсли;
				//Аверсон СВФР-016610
				
				ЗапросП.Текст = ТекстЗапроса;
				УчетнаяПолитикаЗапрос = Новый Запрос;//О.Т. 23.12.2014 № 
				УчетнаяПолитикаЗапрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
				|ИЗ
				|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				|ГДЕ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				
				УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				если УчетнаяПолитика.Количество()>0 Тогда 
					ЗапросП.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
				иначе
					ЗапросП.УстановитьПараметр("ФлагПоТабелю",Ложь);
				КонецЕсли;
				//(начало) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
				ЗапросП.УстановитьПараметр( "Организация", Организация );
				//(конец ) добавлено Кухарчуком Д.Я. 17.07.18, Задача СВФР-002220
				
				ТаблицаОтрабВремя = ЗапросП.Выполнить().Выгрузить();
				
				//Аверсон 08.04.2022 КВВ СВФР-008929 (
				Если Организация.ИНН = "101542412" И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
					НайденнаяСтрокаП = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("ВидВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
					Если НайденнаяСтрокаП.Количество() <> 0 Тогда 
						Для Каждого Стрр ИЗ НайденнаяСтрокаП Цикл
							Если Стрр.Часов = 0 И Стрр.ЧасовК <> 0 Тогда
								ЗапросПоПриказу = Новый Запрос;
								ЗапросПоПриказу.Текст = "ВЫБРАТЬ 
								|РО.ОтработаноЧасов
								|ИЗ Документ.ПриказНаРаботуВПраздничныеИВыходныеДни.РаботникиОрганизации КАК РО
								|ГДЕ РО.Сотрудник = &Сотрудник
								|И РО.Доплачивать = ИСТИНА
								|И РО.ЯвкаВТабель = ИСТИНА
								|И РО.ДатаВыхода = &ДатаВыхода
								|И РО.Ссылка.Проведен";//только проведенные
								ЗапросПоПриказу.УстановитьПараметр("Сотрудник",Стрр.Сотрудник);
								ЗапросПоПриказу.УстановитьПараметр("ДатаВыхода",НачалоДня(Стрр.Дата));
								РезЗапросПоПриказу = ЗапросПоПриказу.Выполнить().Выгрузить();
								Если РезЗапросПоПриказу.Количество() > 0 Тогда
									Стрр.ЧасовК = Стрр.ЧасовК - РезЗапросПоПриказу[0].ОтработаноЧасов;								
								КонецЕсли;							
							Иначе
								Продолжить;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				//Аверсон 08.04.2022 КВВ СВФР-008929 )
				
				//Аверсон 21.01.2022 КВВ СВФР-008495 (
				Если (Организация.ИНН = "100010315" 
					ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
					И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда 
					НайденнаяСтрокаП = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("ВидВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
					Если НайденнаяСтрокаП.Количество() <> 0 Тогда 
						Для Каждого Стрр ИЗ НайденнаяСтрокаП Цикл
							Если Стрр.Часов = 0 И Стрр.ЧасовК > 9 Тогда
								
								ЗапросПоПриказу = Новый Запрос;
								ЗапросПоПриказу.Текст = "ВЫБРАТЬ 
								|РО.ОтработаноЧасов
								|ИЗ Документ.ПриказНаРаботуВПраздничныеИВыходныеДни.РаботникиОрганизации КАК РО
								|ГДЕ РО.Сотрудник = &Сотрудник
								|И РО.Доплачивать = ИСТИНА
								|И РО.ЯвкаВТабель = ИСТИНА
								|И РО.ДатаВыхода = &ДатаВыхода";
								ЗапросПоПриказу.УстановитьПараметр("Сотрудник",Стрр.Сотрудник);
								ЗапросПоПриказу.УстановитьПараметр("ДатаВыхода",НачалоДня(Стрр.Дата));
								РезЗапросПоПриказу = ЗапросПоПриказу.Выполнить().Выгрузить();
								Если РезЗапросПоПриказу.Количество() > 0 Тогда
									СтрТЗ = ТаблицаОтрабВремя.Добавить();
									СтрТЗ.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									СтрТЗ.Дата = Стрр.Дата;
									СтрТЗ.Дней = Стрр.Дней;
									СтрТЗ.Порядок = Стрр.Порядок;
									СтрТЗ.Сотрудник = Стрр.Сотрудник;
									СтрТЗ.Тариф = Стрр.Тариф;
									СтрТЗ.Часов = РезЗапросПоПриказу[0].ОтработаноЧасов;
									СтрТЗ.ЧасовК = 0;
									Стрр.ЧасовК = Стрр.ЧасовК - РезЗапросПоПриказу[0].ОтработаноЧасов;								
								КонецЕсли;							
							Иначе
								Продолжить;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				//Аверсон 21.01.2022 КВВ СВФР-008495 )
				
				ТаблицаОтрабВремяИтог = ТаблицаОтрабВремя.Скопировать();
				Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
					Если НовыйМакет Тогда 
						ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, ВидВремени", "Дней, Часов,ЧасовК");
					иначе   			
						ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, ВидВремени", "Дней, Часов");
					КонецЕсли;
				Иначе
					Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
						ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, Тариф, ВидВремени", "Дней, Часов");
					ИначеЕсли ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Если НовыйМакет Тогда 
							ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, ВидВремени", "Дней, Часов,ЧасовК");
						иначе
							ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, ВидВремени", "Дней, Часов");	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ЗапросП.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
				|	РегламентированныйПроизводственныйКалендарь.ВидДня
				|ИЗ
				|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
				|ГДЕ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачДата И &КонДата
				|	И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
				|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье))";
				ТаблицаВыходные = ЗапросП.Выполнить().Выгрузить();
				
				Выборка = РезультатЗапроса.Выбрать();
				мНомер = 0;
				
				мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
				ИтогЧасыФакт = 0; ИтогВчерние = 0; ИтогНочные = 0; ИтогСверхурочные = 0; ИтогВыходные = 0;
				ИтогОтпуск = 0; ИтогДОтпуск = 0; ИтогБольничные = 0; ИтогПраздничные = 0; ИтогКомандировка = 0;
				ИтогКомандировкаВых = 0; //Аверсон 08.06.2021 КВВ СВФР-007627
				ИтогРемонт = 0;
				ИтогДниФакт = 0;//О.Т. 24.02.2015 № 366
				Выходные = 0; Праздничные = 0;
				ИтогЗаСвойСчет = 0;	//Островская Татьяна 25.02.2014 № 17145
				ФактИтогоСвРВ = 0;//О.Т. 11.07.2014 № 115
				ФактИтогоСвРВДни = 0;//О.Т. 24.02.2015 № 366
				
				ИтогПрогулы2 = 0; ИтогГосОб2 = 0; //СВЭЙ 20.09.2023 КВВ СВФР-011482
				
				//Аверсон ЕАЕ 22.05.2024 СВФР-012907
				ИтогоВыхВДнейОбщийИтог = 0;
				//Аверсон СВФР-012907
				
				//Аверсон 15.12.2021 КВВ СВФР-008495 (
				Если (Организация.ИНН = "100010315" 
					ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
					И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь Тогда  
					ИтогЧДеньДонора = 0;	
					ИтогЧМедОсмотр = 0;	
					ИтогЧГосОбяз = 0;	
					ИтогЧОтстрОтРаб = 0;	
					ИтогДнОтпускЗаСвойСчет = 0;
					ИтогДнДеньМамы = 0;	
					ИтогДнУчОтпуск = 0;	
					ИтогДнКурсыОбуч = 0;	
					ИтогДнПростой = 0;	
					ИтогДнПрогул = 0;	
					ИтогДнСправка = 0;
					ИтогЧПоСред = 0;
					ИтогЧПраздники = 0;
				КонецЕсли;
				//Аверсон 15.12.2021 КВВ СВФР-008495 )
				
				//Аверсон 12.02.2021 КВВ СВФР-007187 (
				Если ЗначениеЗаполнено(ДокументТабель) И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") 
					И Организация.ИНН = "700067572" Тогда  //Бобруйск
					
					//Аверсон 11.07.2021 КВВ СВФР-007813 (
					ИтогВсегоОтрабЧасов = 0;
					ИтогВсегоОтрабДней = 0;
					//Аверсон 11.07.2021 КВВ СВФР-007813 )
					
					ЭтоТрансЦех = ?(ЗначениеЗаполнено(Подразделение),?(Найти(Нрег(Подразделение.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);  //Аверсон 01.04.2021 КВВ СВФР-007334
					
					//Аверсон 19.02.2021 КВВ СВФР-007187 (
					ЗапросП = Новый Запрос;
					ТекстЗапроса =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВЫБОР
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|	КОГДА ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) <> 1
					|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
					|	ИНАЧЕ ВЫБОР
					|			КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций 
					|				ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени //ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)   //Аверсон 19.02.2021 КВВ СВФР-007187 заменено
					|				ИНАЧЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|			КОНЕЦ
					|	КОНЕЦ КАК ВидВремени,
					|	//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,  
					|	РабочееВремяРаботниковОрганизаций.Период КАК Дата,
					|	СУММА(ВЫБОР
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА 
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 9) (
					|ВЫБОР КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций  
					|ТОГДА 0 ИНАЧЕ
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 9) )
					|РабочееВремяРаботниковОрганизаций.Часов
					| КОНЕЦ
					|	ИНАЧЕ 0
					|	КОНЕЦ) КАК Часов,
					|	СУММА(ВЫБОР
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА 0
					|	ИНАЧЕ РабочееВремяРаботниковОрганизаций.Часов
					|	КОНЕЦ) КАК ЧасовК,
					|	ВЫБОР
					|		КОГДА (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|		ИЛИ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка))//Аверсон 19.02.2021 КВВ СВФР-007187 добавлено
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ КАК Порядок,
					|	РабочееВремяРаботниковОрганизаций.Сотрудник,
					|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочееВремяРаботниковОрганизаций.Период) КАК Дней
					|ИЗ
					|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
					|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
					|   ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ПериодыСостоянийРаботниковОрганизаций.Сотрудник
					|	И (ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <> ДАТАВРЕМЯ(1,1,1) И ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания <> ДАТАВРЕМЯ(1,1,1) )
					|	И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.ДатаНачала И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания, ДЕНЬ, -1))
					|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботает
					|   ПО РабочееВремяРаботниковОрганизаций.Сотрудник = СостояниеРаботает.Сотрудник
					|   И СостояниеРаботает.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает) 
					|   И СостояниеРаботает.Организация = &Организация 
					|	И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ СостояниеРаботает.Период И
					//Аверсон 04.05.2021 КВВ СВФР-007334 (
					//|КОНЕЦПЕРИОДА( СостояниеРаботает.ПериодЗавершения, ДЕНЬ) 
					|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботает.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1)
					//Аверсон 04.05.2021 КВВ СВФР-007334 )
					|)
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
					|	ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ПереносДнейКомандировок.Сотрудник
					|	И РабочееВремяРаботниковОрганизаций.Период = ПереносДнейКомандировок.ДатаНаКакую
					|ГДЕ
					|	РабочееВремяРаботниковОрганизаций.Сотрудник В(&Сотрудник)
					|	И (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
					|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
					|	И (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)
					|			ИЛИ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность))
					|  //И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор
					//	|   И НЕ ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций  //Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 9)
					|	И ВЫБОР
					|			КОГДА &ФлагПоТабелю
					|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
					|			ИНАЧЕ ИСТИНА
					|		КОНЕЦ 
					|СГРУППИРОВАТЬ ПО
					|	ВЫБОР
					|	КОГДА ( ПериодыСостоянийРаботниковОрганизаций.Сотрудник IS NULL ИЛИ НЕ СостояниеРаботает.Сотрудник IS NULL )
					|			И ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) = 1
					|		ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|	КОГДА ЕСТЬNULL(ПереносДнейКомандировок.ДатаНаКакую, 1) <> 1
					|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
					|	ИНАЧЕ ВЫБОР
					|			КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций 
					|			ТОГДА РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени //ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка) //Аверсон 19.02.2021 КВВ СВФР-007187 заменено
					|			ИНАЧЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени
					|		  КОНЕЦ
					|	КОНЕЦ,
					|	//РабочееВремяРаботниковОрганизаций.Тариф,	  
					|	РабочееВремяРаботниковОрганизаций.Сотрудник,
					|	РабочееВремяРаботниковОрганизаций.Период,
					|	ВЫБОР
					|		КОГДА (РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
					|		ИЛИ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка))//Аверсон 19.02.2021 КВВ СВФР-007187 добавлено
					|			ТОГДА 0
					|		ИНАЧЕ 1
					|	КОНЕЦ
					|
					|УПОРЯДОЧИТЬ ПО
					|	Порядок"; 
					
					//Аверсон ЕАЕ 08.09.2025 СВФР-016595
					//ЗапросП.УстановитьПараметр("НачДата",	НачалоМесяца(ДатаАктуальности));
					//ЗапросП.УстановитьПараметр("КонДата",	КонецМесяца(ДатаАктуальности));
					ЗапросП.УстановитьПараметр("НачДата",	НачалоМесяца(Нач));
					ЗапросП.УстановитьПараметр("КонДата",	КонецМесяца(Кон));
					//Аверсон СВФР-016595
					
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор","И РабочееВремяРаботниковОрганизаций.Регистратор = &Регистратор");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,","РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//РабочееВремяРаботниковОрганизаций.Тариф,","РабочееВремяРаботниковОрганизаций.Тариф,");
					ЗапросП.УстановитьПараметр("Регистратор",	ДокументТабель.Ссылка);
					//ЗапросП.УстановитьПараметр("Сотрудник",  РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник"));
					ЗапросП.УстановитьПараметр("Сотрудник",  ТЗРезультатЗапроса.ВыгрузитьКолонку("Сотрудник")); //Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5)
					ЗапросП.Текст = ТекстЗапроса;
					
					ЗапросП.УстановитьПараметр("ФлагПоТабелю",Ложь);
					ЗапросП.УстановитьПараметр( "Организация", Организация );
					
					ТаблицаОтрабВремя = ЗапросП.Выполнить().Выгрузить();
					ТаблицаОтрабВремяИтог = ТаблицаОтрабВремя.Скопировать();
					ТаблицаОтрабВремяИтог.Свернуть("Сотрудник, ВидВремени", "Дней, Часов,ЧасовК");
					//Аверсон 19.02.2021 КВВ СВФР-007187 )
					
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) (
					//ТЗОбщ = РезультатЗапроса.Выгрузить();
					//ТЗОбщКат = РезультатЗапроса.Выгрузить();
					ТЗОбщ = ТЗРезультатЗапроса.Скопировать(); 
					ТЗОбщКат = ТЗРезультатЗапроса.Скопировать();
					//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 5) )
					
					ТЗОбщКат.Свернуть("ДолжностьКатегория,ДолжностьКатегорияКод");
					ТЗОбщКат.Сортировать("ДолжностьКатегорияКод");
					
					ТЗИтогиПоКатегориям = Новый ТаблицаЗначений;
					ТЗИтогиПоКатегориям.Колонки.Добавить("Категория");
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогДниФакт");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогПраздничные");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогОтпуск");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогБольничные");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогБольничныеРод");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогСРА");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогСРЗ");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогДонор");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогУч");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогОтстр");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогТтариф");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогПрогулы");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогГД");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогКД");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогНП");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогРозыск");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогОЖ");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогПоСред");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогКомандировка");
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогКомандировкаВых"); //Аверсон 08.06.2021 КВВ СВФР-007627
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогЧасыФакт");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогПраздничныеЧ");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогНочные");	
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогСверхурочные");
					//Аверсон 11.07.2021 КВВ СВФР-007813 (                 
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогТтариф2");
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогВсегоОтрабЧасов");
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогВсегоОтрабДней");
					//Аверсон 11.07.2021 КВВ СВФР-007813 )
					ТЗИтогиПоКатегориям.Колонки.Добавить("ИтогЧасыРемонт"); //ПСА 12.07.2021 СВФР-007845+++
					
					
					
					ИтогПраздничныеЧ = 0;  ИтогСРЗ = 0; ИтогСРА = 0; ИтогБольничныеРод = 0; ИтогДонор = 0; ИтогТтариф = 0;  ИтогОЖ = 0;
					ИтогУч = 0; ИтогПрогулы = 0; ИтогГД = 0; ИтогКД = 0; ИтогНП = 0; ИтогРозыск = 0; ИтогПоСред = 0; ИтогОтстр = 0;
					ИтогТтариф2 = 0;//Аверсон 11.07.2021 КВВ СВФР-007813
					//ПСА 12.07.2021 СВФР-007845+++
					Если ЭтоТрансЦех Тогда
						ИтогЧасыРемонт = 0;
					КонецЕсли;
					//+++ПСА 12.07.2021 СВФР-007845
					Сч1 = 7;
					Для Каждого СтрТЗОбщКат Из ТЗОбщКат Цикл
						//Аверсон 11.07.2021 КВВ СВФР-007813 (
						Если ЭтоТрансЦех Тогда
							ОбластьКат = мМакет.ПолучитьОбласть("КатегорияТ");
						Иначе
							ОбластьКат = мМакет.ПолучитьОбласть("Категория");
						КонецЕсли;
						//Аверсон 11.07.2021 КВВ СВФР-007813 )
						
						ОбластьКат.Параметры.ПечКатегория = СтрТЗОбщКат.ДолжностьКатегория;
						
						мНомер = 0;
						ДокументРезультат.Вывести(ОбластьКат);
						Сч1 = Сч1 + 1;
						Для Каждого Выборка Из ТЗОбщ Цикл
							Если Выборка.ДолжностьКатегория <> СтрТЗОбщКат.ДолжностьКатегория Тогда
								Продолжить;
							КонецЕсли;
							Б_1 = 0; 	Б_2 = 0;   		О_1 = 0;		О_2 = 0;
							БРод_ = 0;	СРА_ = 0;		СРЗ_1 = 0;		СРЗ_2 = 0;  	Донор_ = 0;		Уч_1 = 0; Уч_2 = 0;
							Отстр_ = 0;	Ттариф_1 = 0;	Ттариф_2 = 0;   Прогулы_ = 0;	ГД_1 = 0;		ГД_2 = 0; КД_ = 0;	
							НП_ = 0;	Розыск_ = 0;	ПоСред_ = 0;	К_ = 0;			ОЖ_ = 0;
							КВых_ = 0; //Аверсон 08.06.2021 КВВ СВФР-007627
							
							Выходные = 0; Праздничные = 0;
							ВыходныеДни = 0; ПраздничныеДни = 0;
							
							//Аверсон 11.07.2021 КВВ СВФР-007813 (
							Если ЭтоТрансЦех Тогда
								Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Детали3ТБ"),мМакет.ПолучитьОбласть("Детали3Т"));  //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) 
							Иначе
								Область = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Детали3Б"),мМакет.ПолучитьОбласть("Детали3")); //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
							КонецЕсли;
							//Аверсон 11.07.2021 КВВ СВФР-007813 )
							СчКолвоСтрок = СчКолвоСтрок + 1; 
							
							НоваяСтрокаТЗИтКат = ТЗИтогиПоКатегориям.Добавить();
							НоваяСтрокаТЗИтКат.Категория = СтрТЗОбщКат.ДолжностьКатегория;
							
							Область.Параметры.Заполнить(Выборка);
							//Аверсон 11.07.2021 КВВ СВФР-007813 (
							Если ДокументТабель.ВыводитьНаимБригады Тогда
								//Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) (
								//БригадаТ = СокрЛП(РегистрыСведений.НазначениеСотрудниковПоБригадам.ПолучитьПоследнее(НачалоМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Выборка.Сотрудник)).Бригада.Наименование);
								//Если ЗначениеЗаполнено(БригадаТ) Тогда
								//	Область.Параметры.Должность = СокрЛП(Выборка.Должность) + Символы.ПС + "(" + БригадаТ + ")";
								//КонецЕсли;
								БригадаТ = СокрЛП(РегистрыСведений.НазначениеСотрудниковПоБригадам.ПолучитьПоследнее(НачалоМесяца(ДокументТабель.ПериодРегистрации),Новый Структура("Сотрудник",Выборка.Сотрудник)).Бригада.Код);
								Область.Параметры.Бригада = БригадаТ;
								Область.Параметры.Должность = СокрЛП(Выборка.Должность);
								//Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) )
							КонецЕсли;
							//Аверсон 11.07.2021 КВВ СВФР-007813 )
							Область.Параметры.ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.Сотрудник);//О.Т. 12.07.2014 №115
							Область.Параметры.Разряд = СтрЗаменить(СокрЛП(Выборка.РазрядЕТС),".","");
							мНомер = мНомер + 1;
							Область.Параметры.мНомер = мНомер;
							
							Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
								Если ЗначениеЗаполнено(Выборка.Видрасчета) Тогда
									Область.Параметры.Тариф = Выборка.Показатель1;	
								КонецЕСли;		
							КонецЕсли;
							ФактИтогоСвРВ = 0;
							ФактИтогоСвРВДни = 0;
							ОтпускВПраздник = 0;
							
							ЗапросКадр = Новый Запрос;
							ЗапросКадр.Текст = 
							"ВЫБРАТЬ
							|	РаботникиОрганизацийСрезПоследних.Период
							|ИЗ
							|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
							|			&Период,
							|			Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
							|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";			
							
							//Аверсон ЕАЕ 08.09.2025 СВФР-016595
							//ЗапросКадр.УстановитьПараметр("Период", КонецМесяца(ДатаАктуальности));
							ЗапросКадр.УстановитьПараметр("Период", КонецМесяца(Кон));
							//Аверсон СВФР-016595
							
							ЗапросКадр.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);     			
							РезультатЗапроса = ЗапросКадр.Выполнить().Выбрать(); 
							ДатаПриема = Дата(1,1,1);
							Пока РезультатЗапроса.Следующий() Цикл 
								ДатаПриема = РезультатЗапроса.Период;
							КонецЦикла;
							ЗапросКадр.Текст = СтрЗаменить(ЗапросКадр.Текст,"Документ.ПриемНаРаботуВОрганизацию","Документ.УвольнениеИзОрганизаций");
							РезультатЗапроса = ЗапросКадр.Выполнить().Выбрать(); 
							ДатаУвольнения = Дата(1,1,1);
							Пока РезультатЗапроса.Следующий() Цикл 
								ДатаУвольнения = РезультатЗапроса.Период;
							КонецЦикла;
							
							//Аверсон ЕАЕ 08.09.2025 СВФР-016595
							//ДатаАктуальности1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(ДатаАктуальности),Мин(ДатаУвольнения,КонецМесяца(ДатаАктуальности)),КонецМесяца(ДатаАктуальности));
							//ДатаАктуальности2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(ДатаАктуальности),Макс(ДатаПриема,ДатаАктуальности),ДатаАктуальности);
							ДатаАктуальности1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(Нач),Мин(ДатаУвольнения,КонецМесяца(Кон)),КонецМесяца(Кон));
							ДатаАктуальности2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(Нач),Макс(ДатаПриема,Нач),Нач);
							//Аверсон СВФР-016595
							
							ЯвокВВыходные = 0; //Аверсон 31.03.2021 КВВ СВФР-007334
							ЯвокВКомандировки = 0;  //Аверсон 02.04.2021 КВВ СВФР-007334
							ВыходныхЧасВКомандировки = 0; //Аверсон 02.04.2021 КВВ СВФР-007334
							ВыходныхЧасВКомандировкиМИНУС = 0;		//Аверсон 07.05.2021 КВВ СВФР-007334
							ВсегоОтрабДней = 0;   //Аверсон 11.07.2021 КВВ СВФР-007813
							
							Для мС = День(ДатаАктуальности2)-1 По День(ДатаАктуальности1)-1 Цикл
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//мДатаОтсчета = НачалоДня(ДатаАктуальности)+мС*86400;
								мДатаОтсчета = НачалоДня(Нач)+мС*86400;
								//Аверсон СВФР-016595
								
								НайденнаяСтрока = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата", Выборка.Сотрудник, мДатаОтсчета));
								
								Если НайденнаяСтрока.Количество() <> 0 Тогда
									//Аверсон 07.07.2021 КВВ СВФР-007801 ( (пункт 9, 11) 
									Если НайденнаяСтрока.Количество() = 2 Тогда
										Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
											И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
											Дней0 = НайденнаяСтрока[0].Дней; 	
											Порядок0 = НайденнаяСтрока[0].Порядок;
											ЧасовК0 = НайденнаяСтрока[0].ЧасовК;
											Часов0 = НайденнаяСтрока[0].Часов;	
											Тариф0 = НайденнаяСтрока[0].Тариф;	
											ВидВремени0 = НайденнаяСтрока[0].ВидВремени;
											
											НайденнаяСтрока[0].Порядок = НайденнаяСтрока[1].Порядок;
											НайденнаяСтрока[0].ЧасовК = НайденнаяСтрока[1].ЧасовК;
											НайденнаяСтрока[0].Часов = НайденнаяСтрока[1].Часов;	
											НайденнаяСтрока[0].Тариф = НайденнаяСтрока[1].Тариф;	
											НайденнаяСтрока[0].ВидВремени = НайденнаяСтрока[1].ВидВремени;
											
											НайденнаяСтрока[1].Порядок = Порядок0;
											НайденнаяСтрока[1].ЧасовК = ЧасовК0;
											НайденнаяСтрока[1].Часов = Часов0;	
											НайденнаяСтрока[1].Тариф = Тариф0;	
											НайденнаяСтрока[1].ВидВремени = ВидВремени0;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 07.07.2021 КВВ СВФР-007801 ) 
									
									ВидВремениПравильный = ?(НовыйМакет,НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа  
									ИЛИ НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
									ИЛИ НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка //Аверсон 19.02.2021 КВВ СВФР-007187
									ИЛИ (НайденнаяСтрока.Количество() > 1 И 
									(НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)) //Аверсон 02.04.2021 КВВ СВФР-007334
									, НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
									
									//Аверсон 04.08.2021 КВВ СВФР-007942 (
									Если ЭтоТрансЦех 
										И НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт 
										И НЕ ВидВремениПравильный Тогда
										ВсегоОтрабДней = ВсегоОтрабДней + 1;
									КонецЕсли;
									//Аверсон 04.08.2021 КВВ СВФР-007942 )
									
									Если ВидВремениПравильный Тогда
										ВсегоОтрабДней = ВсегоОтрабДней + 1;
										//Аверсон 31.03.2021 КВВ СВФР-007334 (
										Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
											И (ДеньНедели(мДатаОтсчета)=6 ИЛИ (ДеньНедели(мДатаОтсчета)=7)) Тогда
											//Аверсон 30.06.2021 КВВ СВФР-007782 (
											ОтборТВ = Новый Структура;
											ОтборТВ.Вставить("Дата", мДатаОтсчета);
											СтрокиТВ = ТаблицаВыходные.НайтиСтроки(ОтборТВ);
											Если СтрокиТВ.Количество() > 0 Тогда
												НормаВремениПоГрафику = ПрочиеПроцедуры.ПолучитьДанныеПоИндивидуальномуЗаИнтервал(мДатаОтсчета,мДатаОтсчета,Выборка.Сотрудник).КоличествоЧасов;
												Если НормаВремениПоГрафику = 0 Тогда
													//Аверсон 30.06.2021 КВВ СВФР-007782 )
													ЯвокВВыходные = ЯвокВВыходные + НайденнаяСтрока[0].Дней;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 31.03.2021 КВВ СВФР-007334 )
										
										Если НайденнаяСтрока.Количество() > 1 Тогда
											Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт Тогда
												Область.Параметры["Зн"+Строка(мС+1)] = ""+ НайденнаяСтрока[0].Часов + " " + НайденнаяСтрока[1].ВидВремени.БуквенныйКод;
											Иначе                               
												ЕстьЯвка = Ложь;   //Аверсон 04.03.2021 КВВ СВФР-007187
												Для Каждого стрЗнач из НайденнаяСтрока Цикл 
													Если стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
														
														//Аверсон 07.05.2021 КВВ СВФР-007334 (
														Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
															Часов_ = ?(стрЗнач.Часов=0,стрЗнач.ЧасовК,стрЗнач.Часов/2);
															//Область.Параметры["Зн"+Строка(мС+1)] = ?(Область.Параметры["Зн"+Строка(мС+1)] = Неопределено,0,Область.Параметры["Зн"+Строка(мС+1)]) + Часов_;
															Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[1].ВидВремени.БуквенныйКод;
															ВыходныхЧасВКомандировкиМИНУС = ВыходныхЧасВКомандировкиМИНУС + (стрЗнач.Часов + стрЗнач.ЧасовК);
														Иначе
															//Аверсон 07.05.2021 КВВ СВФР-007334 )
															Часов_ = стрЗнач.Часов;
															Область.Параметры["Зн"+Строка(мС+1)] = ?(Область.Параметры["Зн"+Строка(мС+1)] = Неопределено,0,Область.Параметры["Зн"+Строка(мС+1)]) + Часов_;
														КонецЕсли;
														
														ЕстьЯвка = Истина;  //Аверсон 04.03.2021 КВВ СВФР-007187
														//Аверсон 19.02.2021 КВВ СВФР-007187 (	
													ИначеЕсли стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
														//Область.Параметры["Зн"+Строка(мС+1)] = ?(Область.Параметры["Зн"+Строка(мС+1)] = Неопределено,стрЗнач.ЧасовК,Область.Параметры["Зн"+Строка(мС+1)]) + стрЗнач.Часов;
														Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].ВидВремени.БуквенныйКод; //Аверсон 04.03.2021 КВВ СВФР-007187 
														//Аверсон 19.02.2021 КВВ СВФР-007187 )
														//Аверсон 02.04.2021 КВВ СВФР-007334 (
														Если НайденнаяСтрока.Количество() = 2 Тогда
															Если НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И
																НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
																Область.Параметры["Зн"+Строка(мС+1)] = СокрЛП(НайденнаяСтрока[1].Часов+НайденнаяСтрока[1].ЧасовК) + "/" + НайденнаяСтрока[0].ВидВремени.БуквенныйКод;
																ЯвокВКомандировки = ЯвокВКомандировки + НайденнаяСтрока[1].Дней;
																Прервать;
															КонецЕсли;
														КонецЕсли;
														//Аверсон 02.04.2021 КВВ СВФР-007334 )
													ИначеЕсли стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные 
														ИЛИ стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники 
														ИЛИ стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда 
														//Аверсон 04.03.2021 КВВ СВФР-007187 (
														Если стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники И ЕстьЯвка Тогда
															//Игнор, тк дублировать часы не надо
														Иначе
															//Аверсон 04.03.2021 КВВ СВФР-007187 )
															//Аверсон 02.04.2021 КВВ СВФР-007334 (
															Если стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники
																И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
																Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[1].ВидВремени.БуквенныйКод + "/" + НайденнаяСтрока[0].ВидВремени.БуквенныйКод;
																ВыходныхЧасВКомандировки = ВыходныхЧасВКомандировки + (стрЗнач.Часов + стрЗнач.ЧасовК);
															Иначе
																//Аверсон 02.04.2021 КВВ СВФР-007334 )
																Если Область.Параметры["Зн"+Строка(мС+1)] = Неопределено Тогда 
																	Область.Параметры["Зн"+Строка(мС+1)] = стрЗнач.Часов;
																Иначе 
																	Область.Параметры["Зн"+Строка(мС+1)] = Строка(Область.Параметры["Зн"+Строка(мС+1)]) + "/"+Строка(стрЗнач.Часов+стрЗнач.ЧасовК); //Аверсон 19.02.2021 КВВ СВФР-007187 (добавлено + стрЗнач.ЧасовК)
																КонецЕсли;
															КонецЕсли;
														КонецЕсли;
													КонецЕсли;                       
												КонецЦикла;
											КонецЕсли;
										Иначе
											//Аверсон 03.03.2021 КВВ СВФР-007187 (
											Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].ВидВремени.БуквенныйКод;
											Иначе
												//Аверсон 03.03.2021 КВВ СВФР-007187 )
												Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].Часов;
											КонецЕсли;
										КонецЕсли;
									Иначе
										НайденнаяСтрокаСверх = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
										ВремяСверхурочные = 0;
										ВремяСверхурочныеДни = 0;
										для Каждого стрСверх из НайденнаяСтрокаСверх Цикл 
											ВремяСверхурочные = ВремяСверхурочные + стрСверх.Часов;
											ВремяСверхурочныеДни = ВремяСверхурочныеДни + стрСверх.Дней;
										КонецЦикла;
										НайденнаяСтрокаВыхДни = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
										ВремяВыходные = 0;
										ВремяВыходныеДни = 0;
										для Каждого стрВых из НайденнаяСтрокаВыхДни Цикл 
											ВремяВыходные = ВремяВыходные + стрВых.Часов;
											ВремяВыходныеДни = ВремяВыходныеДни + стрВых.Дней; 
										КонецЦикла;
										ФактИтогоСвРВ = ФактИтогоСвРВ + ВремяСверхурочные + ВремяВыходные;
										ФактИтогоСвРВДни = ФактИтогоСвРВДни + ВремяСверхурочныеДни + ВремяВыходныеДни;
										если ВремяСверхурочные <> 0 или ВремяВыходные <> 0 Тогда 
											Область.Параметры["Зн"+Строка(мС+1)] = ВремяВыходные + ВремяСверхурочные;
										иначе
											ВзятьСтрокуИзНайденных = 0; 
											Если НайденнаяСтрока.Количество() > 1 И ((мС+1) = День(КонецМесяца(мДатаОтсчета))) И 
												НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность Тогда
												ВзятьСтрокуИзНайденных = 1;
											КонецЕсли;
											Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[ВзятьСтрокуИзНайденных].ВидВремени.БуквенныйКод;// была эта строка  //Аверсон 06.05.2020 КВВ СВФР-005949 ( ВзятьСтрокуИзНайденных вместо 0)
										КонецЕсли;
									КонецЕсли;
								Иначе
									ЗапросКом = Новый Запрос;
									ЗапросКом.Текст = 
									"ВЫБРАТЬ
									|	ПериодыСостоянийРаботниковОрганизаций.ДатаНачала
									|ИЗ
									|	РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
									|ГДЕ
									|	ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
									|	И ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <= &Дата
									|	И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания, ДЕНЬ, -1) >= &Дата
									|	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = &Сотрудник";
									ЗапросКом.УстановитьПараметр("Дата", мДатаОтсчета);
									ЗапросКом.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
									
									РезультатЗапросаКом = ЗапросКом.Выполнить().Выгрузить();
									НайденнаяСтрокаВыходные = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчета));
									
									Если НайденнаяСтрокаВыходные.Количество() <> 0 Тогда
										Если НовыйМакет Тогда 
											СчПроверка = мС;
											Если СчПроверка <> 0 Тогда
												Пока Область.Параметры["Зн"+Строка(СчПроверка)] = "" Цикл 
													СчПроверка = СчПроверка - 1;								
												КонецЦикла;
												
												//Аверсон ЕАЕ 08.09.2025 СВФР-016595
												//мДатаОтсчетаПроверка = НачалоДня(ДатаАктуальности)+мС*86400; 
												мДатаОтсчетаПроверка = НачалоДня(Нач)+мС*86400;
												//Аверсон СВФР-016595
												
												НайденнаяСтрокаВыходныеПроверка = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчетаПроверка));
												Пока НайденнаяСтрокаВыходныеПроверка.Количество() > 0 Цикл 
													мДатаОтсчетаПроверка = мДатаОтсчетаПроверка + 86400;
													НайденнаяСтрокаВыходныеПроверка = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчетаПроверка));
												КонецЦикла;
												НайденнаяСтрокаПроверка = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата", Выборка.Сотрудник, мДатаОтсчетаПроверка));
												Если НайденнаяСтрокаПроверка.Количество()>0 Тогда 
													Если ТаблицаОтрабВремя.Количество() > 6 И //СВЭЙ 14.02.2024 КВВ СВФР-012441
														ТаблицаОтрабВремя[5].ВидВремени.БуквенныйКод = Область.Параметры["Зн"+Строка(СчПроверка)] Тогда
														Если Область.Параметры["Зн"+Строка(СчПроверка)] = "ОЖ" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "ОЖ";
														ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "ОТ" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "ОТ";
															ОтпускВПраздник = ОтпускВПраздник +1;
														ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "Б" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "Б";
														иначе
															Область.Параметры["Зн"+Строка(мС+1)] = "В";
														КонецЕсли;
													иначе
														//Аверсон 15.02.2021 КВВ СВФР-007187 (
														Если Область.Параметры["Зн"+Строка(СчПроверка)] <>"В" И СокрЛП(ТипЗнч(Область.Параметры["Зн"+Строка(СчПроверка)])) <> "Число" Тогда
															ВидВр = Область.Параметры["Зн"+Строка(СчПроверка)];
															
															Если ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь.БуквенныйКод
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты.БуквенныйКод
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск.БуквенныйКод
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск.БуквенныйКод
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам.БуквенныйКод	
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя.БуквенныйКод 		
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение.БуквенныйКод 
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый.БуквенныйКод 
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору.БуквенныйКод 	
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка.БуквенныйКод 		
																ИЛИ ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод
																Тогда
																
																Если ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь.БуквенныйКод Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.Заболевание;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты.БуквенныйКод Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск.БуквенныйКод Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск.БуквенныйКод  Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам.БуквенныйКод	Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя.БуквенныйКод Тогда	
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение.БуквенныйКод  Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебный;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый.БуквенныйКод Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору.БуквенныйКод Тогда	
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускПоКоллДоговору;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка.БуквенныйКод 	Тогда	
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.Командировка;
																ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод  Тогда
																	СостояниеРОрг = Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком;
																КонецЕсли;
																
																
																
																ЗапросСост_ = Новый Запрос;
																ЗапросСост_.Текст = 
																"ВЫБРАТЬ
																|	СостояниеРаботниковОрганизаций.Регистратор
																|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
																|ГДЕ
																|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
																|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
																|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
																ЗапросСост_.УстановитьПараметр("Период", мДатаОтсчета);   
																СостРаб = Новый СписокЗначений;
																СостРаб.Добавить(СостояниеРОрг);
																ЗапросСост_.УстановитьПараметр("Состояние", СостРаб);
																ЗапросСост_.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);												
																РезультатСост = ЗапросСост_.Выполнить().Выбрать();
																Если РезультатСост.Количество()=0 Тогда 
																	Область.Параметры["Зн"+Строка(мС+1)] = "В";
																Иначе
																	Область.Параметры["Зн"+Строка(мС+1)] = Область.Параметры["Зн"+Строка(СчПроверка)];
																	
																	Если ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь.БуквенныйКод Тогда Б_1 = Б_1 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты.БуквенныйКод Тогда Б_2 = Б_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск.БуквенныйКод Тогда О_1 = О_1 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск.БуквенныйКод Тогда О_2 = О_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам.БуквенныйКод Тогда БРод_ = БРод_ + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя.БуквенныйКод Тогда СРА_ = СРА_ + 1;		
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности.БуквенныйКод Тогда СРЗ_1 = СРЗ_1 + 1;		
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора.БуквенныйКод Тогда СРЗ_2 = СРЗ_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты.БуквенныйКод Тогда Донор_ = Донор_ + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение.БуквенныйКод Тогда Уч_1 = Уч_1 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый.БуквенныйКод Тогда Уч_2 = Уч_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой.БуквенныйКод Тогда Отстр_ = Отстр_ + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя.БуквенныйКод Тогда Ттариф_1 = Ттариф_1 + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт.БуквенныйКод Тогда Ттариф_2 = Ттариф_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы.БуквенныйКод Тогда Прогулы_ = Прогулы_ + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид.БуквенныйКод Тогда ГД_1 = ГД_1 + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень.БуквенныйКод Тогда ГД_2 = ГД_2 + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору.БуквенныйКод Тогда КД_ = КД_ + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам.БуквенныйКод Тогда НП_ = НП_ + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием.БуквенныйКод Тогда Розыск_ = Розыск_ + 1; 
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия.БуквенныйКод Тогда ПоСред_ = ПоСред_ + 1;
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку.БуквенныйКод Тогда ПоСред_ = ПоСред_ + 1; //Аверсон 09.03.2021 КВВ СВФР-007310
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования.БуквенныйКод Тогда ПоСред_ = ПоСред_ + 1; //Аверсон 23.08.2023 КВВ СВФР-011294
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка.БуквенныйКод Тогда К_ = К_ + 1;	
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной.БуквенныйКод Тогда КВых_ = КВых_ + 1;//Аверсон 08.06.2021 КВВ СВФР-007627
																	ИначеЕсли ВидВр = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод Тогда ОЖ_ = ОЖ_ + 1;	
																	КонецЕсли;
																	
																КонецЕсли;
																
															Иначе
																Область.Параметры["Зн"+Строка(мС+1)] = "В"; 
															КонецЕсли;
															
														Иначе
															//Аверсон 15.02.2021 КВВ СВФР-007187 )
															Область.Параметры["Зн"+Строка(мС+1)] = "В";  
														КонецЕсли;
													КонецЕсли;
												иначе
													Область.Параметры["Зн"+Строка(мС+1)] = "В";
												КонецЕсли;
											иначе
												Область.Параметры["Зн"+Строка(мС+1)] = "В";
											КонецЕсли;
										иначе
											Область.Параметры["Зн"+Строка(мС+1)] = "";
										КонецЕсли;
									КонецЕсли;
									Если НовыйМакет и РезультатЗапросаКом.Количество() > 0 Тогда 
										Область.Параметры["Зн"+Строка(мС+1)] = "К";
									КонецЕсли;
								КонецЕсли;					
							КонецЦикла;
							ЧасыФакт = 0; ЧасыРемонт = 0; ДниРемонт = 0; ДниФакт = 0;
							
							ВсегоОтрабЧасов = 0; //Аверсон 11.07.2021 КВВ СВФР-007813
							МинусПЧ = 0;  //Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 6)
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.В = НайденнаяСтрокаП[0].Часов;
								ИтогВчерние = ИтогВчерние + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Н = НайденнаяСтрокаП[0].Часов;
								ИтогНочные = ИтогНочные + НайденнаяСтрокаП[0].Часов;
								НоваяСтрокаТЗИтКат.ИтогНочные = НайденнаяСтрокаП[0].Часов;	
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.С = НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								ИтогСверхурочные = ИтогСверхурочные + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								НоваяСтрокаТЗИтКат.ИтогСверхурочные = НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ЭтоТрансЦех ИЛИ (НЕ ЭтоТрансЦех И Выборка.Должность.СдельнаяОплата) тогда
									//ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК; 
								КонецЕсли;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Ттариф = Ттариф_1 + НайденнаяСтрокаП[0].Дней;
								ИтогТтариф = Ттариф_1 + ИтогТтариф + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогТтариф = Ттариф_1 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.НП = НП_ + НайденнаяСтрокаП[0].Дней;
								ИтогНП = НП_ + ИтогНП + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогНП = НП_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//Аверсон 11.07.2021 КВВ СВФР-007813 (
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.НП = Розыск_ + НайденнаяСтрокаП[0].Дней;
								ИтогНП = Розыск_ + ИтогНП + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогНП = Розыск_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//Аверсон 11.07.2021 КВВ СВФР-007813 )
							
							//Аверсон 11.07.2021 КВВ СВФР-007813 ( (закомментировано)
							//НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПодСледствием));
							//Если НайденнаяСтрокаП.Количество() <> 0 Тогда
							//	Область.Параметры.Розыск = Розыск_ + НайденнаяСтрокаП[0].Дней;
							//	ИтогРозыск = Розыск_ + ИтогРозыск + НайденнаяСтрокаП[0].Дней;
							//	НоваяСтрокаТЗИтКат.ИтогРозыск = Розыск_ + НайденнаяСтрокаП[0].Дней;
							//КонецЕсли;
							//Аверсон 11.07.2021 КВВ СВФР-007813 ) (закомментировано)
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ОЖ = ОЖ_ + НайденнаяСтрокаП[0].Дней;
								ИтогОЖ = ОЖ_ + ИтогОЖ + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогОЖ = ОЖ_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.СРЗ = СРЗ_1 + НайденнаяСтрокаП[0].Дней;
								ИтогСРЗ = СРЗ_1 + ИтогСРЗ + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогСРЗ = СРЗ_1 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Донор = Донор_ + НайденнаяСтрокаП[0].Дней;
								ИтогДонор = Донор_ + ИтогДонор + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогДонор = Донор_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
								ИтогПоСред = ПоСред_ + ИтогПоСред + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							//Аверсон 09.03.2021 КВВ СВФР-007310 (
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
								ИтогПоСред = ПоСред_ + ИтогПоСред + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//Аверсон 09.03.2021 КВВ СВФР-007310 )
							
							//Аверсон 23.08.2023 КВВ СВФР-011294 (
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
								ИтогПоСред = ПоСред_ + ИтогПоСред + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогПоСред = ПоСред_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//Аверсон 23.08.2023 КВВ СВФР-011294 )
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Отстр = Отстр_ + НайденнаяСтрокаП[0].Дней;
								ИтогОтстр = Отстр_ + ИтогОтстр + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогОтстр = Отстр_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ГД = ГД_1 + НайденнаяСтрокаП[0].Дней;
								ИтогГД = ГД_1 + ИтогГД + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогГД = ГД_1 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.СРЗ = СРЗ_2 + НайденнаяСтрокаП[0].Дней;
								ИтогСРЗ = СРЗ_2 + ИтогСРЗ + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогСРЗ = СРЗ_2 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.КД = КД_ + НайденнаяСтрокаП[0].Дней;
								ИтогКД = КД_ + ИтогКД + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогКД = КД_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ГД = ГД_2 + НайденнаяСтрокаП[0].Дней;
								ИтогГД = ГД_2 + ИтогГД + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогГД = ГД_2 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.СРА = СРА_ + НайденнаяСтрокаП[0].Дней;
								ИтогСРА = СРА_ + ИтогСРА + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогСРА = СРА_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.П = НайденнаяСтрокаП[0].Дней;
								ИтогПраздничные = ИтогПраздничные + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогПраздничные = НайденнаяСтрокаП[0].Дней;
								Область.Параметры.ПЧ = НайденнаяСтрокаП[0].Часов + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].ЧасовК,0); //Аверсон 02.04.2021 КВВ СВФР-007334
								ИтогПраздничныеЧ = ИтогПраздничныеЧ + НайденнаяСтрокаП[0].Часов + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].ЧасовК,0); //Аверсон 02.04.2021 КВВ СВФР-007334
								НоваяСтрокаТЗИтКат.ИтогПраздничныеЧ = НайденнаяСтрокаП[0].Часов + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].ЧасовК,0); //Аверсон 02.04.2021 КВВ СВФР-007334
								Праздничные = НайденнаяСтрокаП[0].Часов;
								
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ЭтоТрансЦех ИЛИ (НЕ ЭтоТрансЦех И Выборка.Должность.СдельнаяОплата) тогда
									//ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								КонецЕсли;  
								//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 6) (
								Если НЕ ЭтоТрансЦех И НЕ Выборка.Должность.СдельнаяОплата Тогда
									МинусПЧ = МинусПЧ + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 6) )
								
								//Если НЕ УчлиДни Тогда
								//	ВсегоОтрабДней = ВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	УчлиДни = Истина;
								//КонецЕсли;
								//	ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней,0) + НайденнаяСтрокаП[0].Дней;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.О = О_1 + НайденнаяСтрокаП[0].Дней + ОтпускВПраздник;
								ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП[0].Дней + ОтпускВПраздник;
								НоваяСтрокаТЗИтКат.ИтогОтпуск = НайденнаяСтрокаП[0].Дней + ОтпускВПраздник;
							КонецЕсли;
							
							НайденнаяСтрокаП1 = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск));
							
							Если НайденнаяСтрокаП1.Количество() <> 0 Тогда
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда  					
									Область.Параметры.О = О_2 + Область.Параметры.О + НайденнаяСтрокаП1[0].Дней;
									ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП1[0].Дней; 	
									НоваяСтрокаТЗИтКат.ИтогОтпуск = НайденнаяСтрокаП1[0].Дней;
								иначе
									Область.Параметры.О = О_2 + НайденнаяСтрокаП1[0].Дней;
									ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП1[0].Дней; 	
									НоваяСтрокаТЗИтКат.ИтогОтпуск = НайденнаяСтрокаП1[0].Дней;
								КонецЕсли;
							КонецЕсли;
							
							Если О_1 <> 0 ИЛИ О_2 <> 0 Тогда 
								ИтогОтпуск = ИтогОтпуск + О_1 + О_2; 	
								НоваяСтрокаТЗИтКат.ИтогОтпуск = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогОтпуск),НоваяСтрокаТЗИтКат.ИтогОтпуск,0) + О_1 + О_2;
							КонецЕсли;
							
							
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								ИтогДОтпуск = ИтогДОтпуск + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								ИтогЗаСвойСчет = ИтогЗаСвойСчет + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь));
							НайденнаяСтрокаП1 = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам));
							НайденнаяСтрокаП2 = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Б = Б_1 + НайденнаяСтрокаП[0].Дней;
								ИтогБольничные = ИтогБольничные + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогБольничные = НайденнаяСтрокаП[0].Дней;
								
							КонецЕсли;
							Если НайденнаяСтрокаП1.Количество() <> 0 Тогда
								Область.Параметры.БРод = БРод_ + НайденнаяСтрокаП1[0].Дней;
								ИтогБольничныеРод = ИтогБольничныеРод + БРод_ + НайденнаяСтрокаП1[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогБольничныеРод = БРод_ + НайденнаяСтрокаП1[0].Дней;
							КонецЕсли;
							
							Если НайденнаяСтрокаП2.Количество() <> 0 Тогда
								Область.Параметры.Б = Б_2 + НайденнаяСтрокаП2[0].Дней;
								ИтогБольничные = ИтогБольничные + НайденнаяСтрокаП2[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогБольничные = НайденнаяСтрокаП2[0].Дней;
							КонецЕсли;
							
							Если Б_1 <> 0 ИЛИ Б_2 <> 0 Тогда 
								ИтогБольничные = ИтогБольничные + Б_1 + Б_2; 	
								НоваяСтрокаТЗИтКат.ИтогБольничные = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогБольничные),НоваяСтрокаТЗИтКат.ИтогБольничные,0) + Б_1 + Б_2;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Уч = Уч_1 + НайденнаяСтрокаП[0].Дней;
								ИтогУч = Уч_1 + ИтогУч + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогУч = Уч_1 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Уч = Уч_2 + НайденнаяСтрокаП[0].Дней;
								ИтогУч = Уч_2 + ИтогУч + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогУч = Уч_2 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Прогулы = Прогулы_ + НайденнаяСтрокаП[0].Дней;
								ИтогПрогулы = Прогулы_ + ИтогПрогулы + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогПрогулы = Прогулы_ + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;					
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
							//Аверсон 05.05.2021 КВВ СВФР-007334 ( (Закомментировано)
							//Если НайденнаяСтрокаП.Количество() <> 0 Тогда
							//	Область.Параметры.Вых = НайденнаяСтрокаП[0].Часов;
							//	ИтогВыходные = ИтогВыходные + НайденнаяСтрокаП[0].Часов;
							//	Выходные = НайденнаяСтрокаП[0].Часов;
							//КонецЕсли;
							//Аверсон 05.05.2021 КВВ СВФР-007334 ) (Закомментировано)
							
							//НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							//Если НайденнаяСтрокаП.Количество() <> 0 Тогда  
							//	ДниКомандировок = НайденнаяСтрокаП[0].Дней;
							//	Если НовыйМакет Тогда
							//		ЧасыКомандировок = НайденнаяСтрокаП[0].ЧасовК;
							//	иначе
							//		ЧасыКомандировок = НайденнаяСтрокаП[0].Часов;
							//	КонецЕсли;
							//	ИтогКомандировка = ИтогКомандировка + ЧасыКомандировок;	
							//	НоваяСтрокаТЗИтКат.ИтогКомандировка = ЧасыКомандировок;
							//иначе
							//	ДниКомандировок = 0;
							//	ЧасыКомандировок = 0;
							//КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.К = К_ + НайденнаяСтрокаП[0].Дней;
								ИтогКомандировка = К_ + ИтогКомандировка + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогКомандировка = К_ + НайденнаяСтрокаП[0].Дней;
								
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ЭтоТрансЦех тогда
									ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								КонецЕсли;
								//Если НЕ УчлиДни Тогда
								//	ВсегоОтрабДней = ВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	УчлиДни = Истина;
								//КонецЕсли;
								
								//ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней,0) + НайденнаяСтрокаП[0].Дней;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
							КонецЕсли;
							
							//Аверсон 08.06.2021 КВВ СВФР-007627 (
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.КВых = КВых_ + НайденнаяСтрокаП[0].Дней;
								ИтогКомандировкаВых = КВых_ + ИтогКомандировкаВых + НайденнаяСтрокаП[0].Дней;
								НоваяСтрокаТЗИтКат.ИтогКомандировкаВых = КВых_ + НайденнаяСтрокаП[0].Дней;
								
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ЭтоТрансЦех тогда
									ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								КонецЕсли;
								//Если НЕ УчлиДни Тогда
								//	ВсегоОтрабДней = ВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	УчлиДни = Истина;
								//КонецЕсли;
								
								//	ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней,0) + НайденнаяСтрокаП[0].Дней;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
							КонецЕсли;
							//Аверсон 08.06.2021 КВВ СВФР-007627 )
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								//ПСА 12.07.2021 СВФР-007845+++
								//Область.Параметры.Ттариф2 = Ттариф_2 + НайденнаяСтрокаП[0].Дней;
								//ИтогТтариф2 = Ттариф_2 + ИтогТтариф2 + НайденнаяСтрокаП[0].Дней;
								//НоваяСтрокаТЗИтКат.ИтогТтариф2 = Ттариф_2 + НайденнаяСтрокаП[0].Дней;
								Если ЭтоТрансЦех Тогда
									Область.Параметры.Ттариф2 = Ттариф_2 + НайденнаяСтрокаП[0].Дней;
									ИтогТтариф2 = Ттариф_2 + ИтогТтариф2 + НайденнаяСтрокаП[0].Дней;
									НоваяСтрокаТЗИтКат.ИтогТтариф2 = Ттариф_2 + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								//+++ПСА 12.07.2021 СВФР-007845
								
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ЭтоТрансЦех тогда
									ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
									//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								КонецЕсли;
								//Если НЕ УчлиДни Тогда
								//	ВсегоОтрабДней = ВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	УчлиДни = Истина;
								//КонецЕсли;
								
								//ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней,0) + НайденнаяСтрокаП[0].Дней;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
							КонецЕсли;
							
							Если НовыйМакет Тогда 
								НайденнаяСтрокаКомандировки = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
								Если НайденнаяСтрокаКомандировки.Количество()> 0 Тогда 
									ДниКомандировок = НайденнаяСтрокаКомандировки[0].Дней;
									Если НовыйМакет Тогда
										//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 9) (
										Если ЭтоТрансЦех Тогда
											ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК + НайденнаяСтрокаКомандировки[0].Часов;
											
										Иначе
											//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 9) )
											ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК;
										КонецЕсли;
									иначе
										ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].Часов;
									КонецЕсли;
								иначе
									ДниКомандировок = 0;
									ЧасыКомандировок = 0;
								КонецЕсли;
								
								НайденнаяСтрокаДниПеренос = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
								Если НайденнаяСтрокаДниПеренос.Количество()> 0 Тогда 
									ДниВыхПеренос = НайденнаяСтрокаДниПеренос[0].Дней;
									Если НовыйМакет Тогда
										ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].ЧасовК;
									иначе
										ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].Часов;
									КонецЕсли;
								иначе
									ДниВыхПеренос = 0;
									ЧасыВыхПеренос = 0;
								КонецЕсли;
							иначе
								ДниКомандировок = 0;
								ЧасыКомандировок = 0;
								ДниВыхПеренос = 0;
								ЧасыВыхПеренос = 0;                          
							КонецЕсли;
							
							НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								//Если ЭтоТрансЦех тогда
								ВсегоОтрабЧасов = ВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								//	Если НЕ УчлиДни Тогда
								//	ВсегоОтрабДней = ВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//	УчлиДни = Истина;
								//КонецЕсли;
								
								//	ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								//	НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов,0) + НайденнаяСтрокаП[0].Часов + НайденнаяСтрокаП[0].ЧасовК;
								//	ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + НайденнаяСтрокаП[0].Дней;
								//НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ?(ЗначениеЗаполнено(НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней),НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней,0) + НайденнаяСтрокаП[0].Дней;
								//КонецЕсли;                            
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								
								//	Область.Параметры.ЯЧ = ЧасыФакт + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов) + ФактИтогоСвРВ + ?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0);// + ЧасыРемонт + Праздничные + Выходные;  						//Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								Область.Параметры.ЯЧ = ЧасыФакт - МинусПЧ + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов) + ?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0) - ВыходныхЧасВКомандировкиМИНУС;// + ЧасыРемонт + Праздничные + Выходные;  						//Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
								//	Область.Параметры.ЯЧД = ДниФакт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни+ ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос - ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334                //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								Область.Параметры.ЯЧД = ДниФакт + НайденнаяСтрокаП[0].Дней + ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос - ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334                //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
								//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов) + ФактИтогоСвРВ +?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0); //+ ЧасыФакт + Праздничные + Выходные;                    //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								ИтогЧасыФакт = ИтогЧасыФакт - МинусПЧ + ЧасыРемонт + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов) +?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0) - ВыходныхЧасВКомандировкиМИНУС; //+ ЧасыФакт + Праздничные + Выходные;                    //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
								//ИтогДниФакт = ИтогДниФакт + ДниРемонт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни + ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос- ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334          //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								ИтогДниФакт = ИтогДниФакт + ДниРемонт + НайденнаяСтрокаП[0].Дней + ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос- ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334          //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
								//НоваяСтрокаТЗИтКат.ИтогЧасыФакт = ЧасыРемонт + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов)  + ФактИтогоСвРВ +?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0);                                                      //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								НоваяСтрокаТЗИтКат.ИтогЧасыФакт = ЧасыРемонт- МинусПЧ + ?(ЭтоТрансЦех=Истина,НайденнаяСтрокаП[0].Часов+НайденнаяСтрокаП[0].ЧасовК,НайденнаяСтрокаП[0].Часов)  +?(ЭтоТрансЦех=Истина,ЧасыКомандировок,0)+ЧасыВыхПеренос + ?(ЭтоТрансЦех=Истина,ВыходныхЧасВКомандировки,0) - ВыходныхЧасВКомандировкиМИНУС;                                                      //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
								//НоваяСтрокаТЗИтКат.ИтогДниФакт = ДниРемонт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни + ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос- ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334     //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								НоваяСтрокаТЗИтКат.ИтогДниФакт = ДниРемонт + НайденнаяСтрокаП[0].Дней + ?(ЭтоТрансЦех=Истина,ДниКомандировок,0)+ДниВыхПеренос- ЯвокВВыходные - ?(ЭтоТрансЦех=Истина,ЯвокВКомандировки,0);//Аверсон 31.03.2021 КВВ СВФР-007334     //Аверсон 01.04.2021 КВВ СВФР-007334 (Командировка)
								
							иначе
								//Область.Параметры.ЯЧ = ЧасыФакт + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;// + ЧасыРемонт + Праздничные + Выходные;
								Область.Параметры.ЯЧ = ЧасыФакт - МинусПЧ + ЧасыКомандировок+ЧасыВыхПеренос;// + ЧасыРемонт + Праздничные + Выходные;
								
								//	Область.Параметры.ЯЧД = ДниФакт + ФактИтогоСвРВДни+ ДниКомандировок+ДниВыхПеренос;
								Область.Параметры.ЯЧД = ДниФакт + ДниКомандировок+ДниВыхПеренос;
								
								//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + ФактИтогоСвРВ +ЧасыКомандировок+ЧасыВыхПеренос; //+ ЧасыФакт + Праздничные + Выходные;
								ИтогЧасыФакт = ИтогЧасыФакт- МинусПЧ + ЧасыРемонт +ЧасыКомандировок+ЧасыВыхПеренос; //+ ЧасыФакт + Праздничные + Выходные;
								
								//	ИтогДниФакт = ИтогДниФакт + ДниРемонт + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;
								ИтогДниФакт = ИтогДниФакт + ДниРемонт  + ДниКомандировок+ДниВыхПеренос;
								
								//	НоваяСтрокаТЗИтКат.ИтогЧасыФакт = ЧасыРемонт + ФактИтогоСвРВ +ЧасыКомандировок+ЧасыВыхПеренос;
								НоваяСтрокаТЗИтКат.ИтогЧасыФакт = ЧасыРемонт - МинусПЧ +ЧасыКомандировок+ЧасыВыхПеренос;
								
								//	НоваяСтрокаТЗИтКат.ИтогДниФакт = ДниРемонт + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;
								НоваяСтрокаТЗИтКат.ИтогДниФакт = ДниРемонт  + ДниКомандировок+ДниВыхПеренос;
							КонецЕсли;
							
							//Аверсон 11.07.2021 КВВ СВФР-007813 (
							Область.Параметры.ВсегоОтрабЧасов = ВсегоОтрабЧасов;  
							Область.Параметры.ВсегоОтрабДней = ВсегоОтрабДней;
							ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов + ВсегоОтрабЧасов;
							НоваяСтрокаТЗИтКат.ИтогВсегоОтрабЧасов = ВсегоОтрабЧасов;
							ИтогВсегоОтрабДней = ИтогВсегоОтрабДней + ВсегоОтрабДней;
							НоваяСтрокаТЗИтКат.ИтогВсегоОтрабДней = ВсегоОтрабДней;
							
							//Аверсон 11.07.2021 КВВ СВФР-007813 )
							
							Если НовыйМакет Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
										//Аверсон 11.03.2021 КВВ СВФР-007187 (
										//	Область.Параметры.ЯЧ = ?(Область.Параметры.ЯЧ = Неопределено,0,Область.Параметры.ЯЧ) + НайденнаяСтрокаП[0].Часов;// + ЧасыРемонт + Праздничные + Выходные;   	
										ПрибавитьЧасов = ?(НайденнаяСтрокаП[0].ЧасовК=0,?(СтрТЗОбщКат.ДолжностьКатегория<>Справочники.КатегорииРаботников.РабочиеОсновные,0,НайденнаяСтрокаП[0].Часов),0);
										Область.Параметры.ЯЧ = ?(Область.Параметры.ЯЧ = Неопределено,0,Область.Параметры.ЯЧ) + ПрибавитьЧасов; 
										ИтогЧасыФакт = ИтогЧасыФакт + ПрибавитьЧасов; //+ ЧасыФакт + Праздничные + Выходные;
										НоваяСтрокаТЗИтКат.ИтогЧасыФакт = ?(Область.Параметры.ЯЧ = Неопределено,0,Область.Параметры.ЯЧ) + ПрибавитьЧасов;
										//Аверсон 11.03.2021 КВВ СВФР-007187 )
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							//ПСА 12.07.2021 СВФР-007845+++
							Если ЭтоТрансЦех Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ЧасыРемонт = НайденнаяСтрокаП[0].Часов;
									Область.Параметры.РЧ = ?(Область.Параметры.РЧ = Неопределено,0,Область.Параметры.РЧ) + ЧасыРемонт;
									ИтогЧасыРемонт = ИтогЧасыРемонт + ЧасыРемонт;
								КонецЕсли;
								НоваяСтрокаТЗИтКат.ИтогЧасыРемонт = ЧасыРемонт;
							КонецЕсли;
							//+++ПСА 12.07.2021 СВФР-007845
							
							
							ДокументРезультат.Вывести(Область);
							
							Если ОтветПодписиНаКаждЛист = КодВозвратаДиалога.Нет Тогда
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//А = НачалоМесяца(ДатаАктуальности);
								//Б = НачалоДня(КонецМесяца(ДатаАктуальности));
								А = НачалоМесяца(Нач);
								Б = НачалоДня(КонецМесяца(Кон));
								//Аверсон СВФР-016595
								
								Пока А<=Б Цикл;
									Если ДеньНедели(А) = 6 ИЛИ ДеньНедели(А)=7 Тогда
										ДокументРезультат.Область(Сч1+2, 6+День(А), Сч1+3, 6+День(А)).ЦветФона = WebЦвета.Розовый;
									КонецЕсли;
									А = А+60*60*24;
								КонецЦикла;
							КонецЕсли;
							Сч1 = Сч1 + 2;
							
							//Аверсон 29.06.2021 КВВ СВФР-007782 (
							Если СчКолвоСтрок = КолвоНаСтр Тогда
								
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								Если ОтветПодписиНаКаждЛист = КодВозвратаДиалога.Да Тогда   			
									Область = мМакет.ПолучитьОбласть("Подвал5");
									
									//Аверсон 27.08.2021 КВВ СВФР-007989 ( (пункт 1) (закомментировано)
									//ПодписьДолжность = "";
									//ПодписьФИО = "";
									//ПоПодр = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),ДокументТабель.ПодразделениеОрганизации,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
									//Если ЗначениеЗаполнено(ПоПодр) Тогда
									//	РезультатП = СформироватьЗапросПоОтветствЛицамПод(ПоПодр, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
									//	Пока РезультатП.Следующий() Цикл
									//		ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РезультатП.ФизическоеЛицо.Наименование);
									//		ПодписьДолжность = РезультатП.Должность.Наименование;
									//	КонецЦикла;
									//	Если ЗначениеЗаполнено(ПодписьДолжность) Тогда
									//		Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
									//		Область.Параметры.ПодписьФИО = ПодписьФИО;
									//		ДокументРезультат.Вывести(Область);  //Сч1 = Сч1 + 2;
									//	КонецЕсли;
									//КонецЕсли;  
									//Аверсон 27.08.2021 КВВ СВФР-007989 )
									
									Если ЗначениеЗаполнено(ДокументТабель.ОтветственныйОТиЗ) Тогда
										ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.ОтветственныйОТиЗ.Физлицо.Наименование);
										ПодписьДолжность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.ОтветственныйОТиЗ)).Должность;
										
										Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
										Область.Параметры.ПодписьФИО = ПодписьФИО;
										
										ДокументРезультат.Вывести(Область);   //Сч1 = Сч1 + 2;
									КонецЕсли;
									
									Если ЗначениеЗаполнено(ДокументТабель.Ответственный) И ЗначениеЗаполнено(ДокументТабель.Ответственный.Сотрудник) Тогда
										ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.Ответственный.Сотрудник.Физлицо.Наименование);
										ПодписьДолжность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.Ответственный.Сотрудник)).Должность;
										
										Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
										Область.Параметры.ПодписьФИО = ПодписьФИО;
										
										ДокументРезультат.Вывести(Область);   //Сч1 = Сч1 + 2;
									КонецЕсли;			
								КонецЕсли;
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								
								
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();	
								//Аверсон 11.07.2021 КВВ СВФР-007813 (
								ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
								Если ЭтоТрансЦех Тогда
									ОблШТЧ = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Шапка3ТБ"),мМакет.ПолучитьОбласть("Шапка3Т"));    //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
								Иначе
									ОблШТЧ = ?(ДокументТабель.ВыводитьНаимБригады,мМакет.ПолучитьОбласть("Шапка3Б"),мМакет.ПолучитьОбласть("Шапка3"));    //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7)
								КонецЕсли;
								//ОблШТЧ.Параметры.ПрофессияТ = ?(ДокументТабель.ВыводитьНаимБригады,"Профессия (Наименование бригады)","Профессия"); //Аверсон 03.08.2021 КВВ СВФР-007942 (пункт 7) закомментировано
								//Аверсон 11.07.2021 КВВ СВФР-007813 )
								ДокументРезультат.Вывести(ОблШТЧ);
								Если ОтветПодписиНаКаждЛист = КодВозвратаДиалога.Нет Тогда
									
									//Аверсон ЕАЕ 08.09.2025 СВФР-016595
									//А = НачалоМесяца(ДатаАктуальности);
									//Б = НачалоДня(КонецМесяца(ДатаАктуальности));
									А = НачалоМесяца(Нач);
									Б = НачалоДня(КонецМесяца(Кон));
									//Аверсон СВФР-016595
									
									Пока А<=Б Цикл;
										Если ДеньНедели(А) = 6 ИЛИ ДеньНедели(А)=7 Тогда
											ДокументРезультат.Область(Сч1, 6+День(А), Сч1+3, 6+День(А)).ЦветФона = WebЦвета.Розовый;  //29.06.2021 изменить макет по дням!
										КонецЕсли;
										А = А+60*60*24;
									КонецЦикла;
								КонецЕсли;
								СчКолвоСтрок = 0;
								Сч1 = Сч1 + 4;
							КонецЕсли;
							//Аверсон 29.06.2021 КВВ СВФР-007782 )
						КонецЦикла;
					КонецЦикла;
				Иначе
					//Аверсон 12.02.2021 КВВ СВФР-007187 )  (не Бобруйск)
					
					
					Пока Выборка.Следующий() Цикл
						Выходные = 0; Праздничные = 0;
						ВыходныеДни = 0; ПраздничныеДни = 0;//О.Т. 24.02.2015 № 366
						
						
						Если ПечатьНеявок = Ложь Тогда
							//Островская Татьяна 25.02.2014 № 17145
							если (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") и НовыйМакет = Ложь Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
								//О.Т. 24.02.2015 № 366
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									Область = мМакет.ПолучитьОбласть("Детали3");
								иначе
									Область = мМакет.ПолучитьОбласть("Детали1");
								КонецЕсли;
								//О.Т. 24.02.2015 № 366
							иначе
								//О.Т. 24.02.2015 № 366
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									//Аверсон ЕАЕ 21.05.2024 СВФР-012907
									//Климовичи
									Если Организация.ИНН = "700103211" Тогда
										Область = мМакет.ПолучитьОбласть("Детали5");
									Иначе
										//Аверсон СВФР-012907
										Область = мМакет.ПолучитьОбласть("Детали2");
									КонецЕсли;
									СчКолвоСтрок = СчКолвоСтрок + 1; //Аверсон 15.11.2019 КВВ СВФР-005053
								иначе
									Область = мМакет.ПолучитьОбласть("Детали");
								КонецЕсли;
								//О.Т. 24.02.2015 № 366
							КонецЕсли;
							//Островская Татьяна 25.02.2014 № 17145
							Область.Параметры.Заполнить(Выборка);
							Область.Параметры.ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.Сотрудник);//О.Т. 12.07.2014 №115
							мНомер = мНомер + 1;
							Если НЕ ((Организация.ИНН = "100010315" 
								ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
								И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь) Тогда  //Аверсон 15.12.2021 КВВ СВФР-008495
								Область.Параметры.мНомер = мНомер;
							КонецЕсли;;
							
							Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
								Если ЗначениеЗаполнено(Выборка.Видрасчета) Тогда
									//Островская Татьяна 25.02.2014 № 17145
									если не (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
										Если не НовыйМакет Тогда 
											Область.Параметры.Тариф = Выборка.Показатель1;	
										КонецЕсли;
									КонецЕсли;
									//Островская Татьяна 25.02.2014 № 17145
								КонецЕСли;
							Иначе
								Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									Если ЗначениеЗаполнено(Выборка.Видрасчета) Тогда
										//Островская Татьяна 25.02.2014 № 17145
										если не (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
											Если не НовыйМакет Тогда
												Область.Параметры.Тариф = Выборка.Показатель1;	
												//Аверсон 10.11.2020 КВВ СВФР-006805 (
												Если НЕ ЗначениеЗаполнено(Выборка.Показатель1) Тогда
													ЗУв = Новый Запрос;
													ЗУв.Текст = "ВЫБРАТЬ 
													|УвольнениеРаботники.ДатаУвольнения
													|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники	
													|ГДЕ УвольнениеРаботники.Сотрудник = &Сотрудник И
													|УвольнениеРаботники.Ссылка.Проведен";
													ЗУв.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
													РезЗУв = ЗУв.Выполнить().Выбрать();
													
													//Аверсон ЕАЕ 08.09.2025 СВФР-016595
													//парамКонец = КонецМесяца(ДатаАктуальности);
													//Если РезЗУв.Следующий() Тогда
													//	парамКонец = Мин(КонецМесяца(ДатаАктуальности),КонецДня(РезЗУв.ДатаУвольнения));
													//КонецЕсли;
													парамКонец = КонецМесяца(Кон);
													Если РезЗУв.Следующий() Тогда
														парамКонец = Мин(КонецМесяца(Кон),КонецДня(РезЗУв.ДатаУвольнения));
													КонецЕсли;
													//Аверсон СВФР-016595
													
													З = Новый Запрос;
													ТекстЗ = ПолучитьТекстЗапросаПоПоказатель1();  
													З.Текст = СтрЗаменить(ТекстЗ,"//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник","И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник");
													З.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
													З.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
													З.УстановитьПараметр("КонДата",	парамКонец);
													З.УстановитьПараметр("Ссылка",	ДокументТабель);
													З.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
													
													//Аверсон 22.07.2021 КВВ СВФР-007844 (
													ПечТариф = 0;
													РезЗ = З.Выполнить().Выбрать();
													Если РезЗ.Следующий() Тогда
														ПечТариф = РезЗ.Показатель1;
													КонецЕсли;
													
													Если НЕ ЗначениеЗаполнено(ПечТариф) Тогда
														З = Новый Запрос;
														ТекстЗ = ПолучитьТекстЗапросаПоПоказатель1();  
														ТекстЗ = СтрЗаменить(ТекстЗ,"//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник","И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник");
														ТекстЗ = СтрЗаменить(ТекстЗ,"ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1","
														|ВЫБОР КОГДА
														|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
														|И 
														|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
														|ТОГДА  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1Завершения
														|ИНАЧЕ  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
														|КОНЕЦ КАК Показатель1");
														З.Текст = ТекстЗ;
														З.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
														З.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
														З.УстановитьПараметр("КонДата",	парамКонец);
														З.УстановитьПараметр("Ссылка",	ДокументТабель);
														З.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
														
														РезЗ = З.Выполнить().Выбрать();
														Если РезЗ.Следующий() Тогда
															ПечТариф = РезЗ.Показатель1;
														КонецЕсли;
													КонецЕсли;
													Область.Параметры.Тариф = ПечТариф;
													//Аверсон 22.07.2021 КВВ СВФР-007844 )
												КонецЕсли;
												//Аверсон 10.11.2020 КВВ СВФР-006805 )
											КонецЕсли;
										КонецЕсли;
										//Островская Татьяна 25.02.2014 № 17145
									КонецЕСли;
								КонецЕсли;			
							КонецЕсли;
							ФактИтогоСвРВ = 0;//О.Т. 30.07.2014 № 136
							ФактИтогоСвРВДни = 0;//О.Т. 24.02.2015 № 366
							ОтпускВПраздник = 0;
							
							ЗапросКадр = Новый Запрос;
							ЗапросКадр.Текст = 
							"ВЫБРАТЬ
							|	РаботникиОрганизацийСрезПоследних.Период
							|ИЗ
							|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
							|			&Период,
							|			Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
							|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";			
							
							//Аверсон ЕАЕ 08.09.2025 СВФР-016595
							//ЗапросКадр.УстановитьПараметр("Период", КонецМесяца(ДатаАктуальности));
							ЗапросКадр.УстановитьПараметр("Период", КонецМесяца(Кон));
							//Аверсон СВФР-016595
							
							ЗапросКадр.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);     			
							РезультатЗапроса = ЗапросКадр.Выполнить().Выбрать(); 
							ДатаПриема = Дата(1,1,1);
							Пока РезультатЗапроса.Следующий() Цикл 
								ДатаПриема = РезультатЗапроса.Период;
							КонецЦикла;
							ЗапросКадр.Текст = СтрЗаменить(ЗапросКадр.Текст,"Документ.ПриемНаРаботуВОрганизацию","Документ.УвольнениеИзОрганизаций");
							РезультатЗапроса = ЗапросКадр.Выполнить().Выбрать(); 
							ДатаУвольнения = Дата(1,1,1);
							Пока РезультатЗапроса.Следующий() Цикл 
								//ПСА 12.03.2021 СВФР-007323 +++
								//ДатаУвольнения = РезультатЗапроса.Период;
								ДатаУвольнения = РезультатЗапроса.Период-24*60*60;
								//+++ПСА 12.03.2021 СВФР-007323
							КонецЦикла;
							
							//Аверсон ЕАЕ 08.09.2025 СВФР-016595
							//ДатаАктуальности1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(ДатаАктуальности),Мин(ДатаУвольнения,КонецМесяца(ДатаАктуальности)),КонецМесяца(ДатаАктуальности));
							//ДатаАктуальности2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(ДатаАктуальности),Макс(ДатаПриема,ДатаАктуальности),ДатаАктуальности);
							ДатаАктуальности1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(Нач),Мин(ДатаУвольнения,КонецМесяца(Кон)),КонецМесяца(Кон));
							ДатаАктуальности2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(Нач),Макс(ДатаПриема,Нач),Нач);
							//Аверсон СВФР-016595
							
							//Аверсон ЕАЕ 09.02.2022 СВФР-008706
							СчитаемПраздники = 0;
							СчитаемВыходные = 0;
							//Аверсон СВФР-008706
							
							//Аверсон ЕАЕ 22.05.2024 СВФР-012907
							ИтогоВыхРВЧасов = 0;
							ИтогоВыхВДней = 0;
							//Аверсон СВФР-012907
							
							Для мС = День(ДатаАктуальности2)-1 По День(ДатаАктуальности1)-1 Цикл
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//мДатаОтсчета = НачалоДня(ДатаАктуальности)+мС*86400;
								мДатаОтсчета = НачалоДня(Нач)+мС*86400;
								//Аверсон СВФР-016595
								
								Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
									Если Выборка.ДатаПриема <= мДатаОтсчета И Выборка.ДатаУвольнения >= мДатаОтсчета Тогда
										НайденнаяСтрока = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата", Выборка.Сотрудник, мДатаОтсчета));
										Если НайденнаяСтрока.Количество() <> 0 Тогда
											ВидВремениПравильный = ?(НовыйМакет,НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа или 
											НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные, НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
											
											Если ВидВремениПравильный Тогда
												//заявка №2037 (база заявок Кристалла) Дмитрук О.Г.
												Если НайденнаяСтрока.Количество() > 1 Тогда
													Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт Тогда
														Область.Параметры["Зн"+Строка(мС+1)] = ""+ НайденнаяСтрока[0].Часов + " " + НайденнаяСтрока[1].ВидВремени.БуквенныйКод;
													Иначе
														Если НовыйМакет Тогда 
															Для Каждого стрЗнач из НайденнаяСтрока Цикл 
																Если стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа или стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
																	Область.Параметры["Зн"+Строка(мС+1)] = ?(Область.Параметры["Зн"+Строка(мС+1)] = Неопределено,0,Область.Параметры["Зн"+Строка(мС+1)]) + НайденнаяСтрока[0].Часов;
																КонецЕсли;
															КонецЦикла;
														иначе
															Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].Часов;
														КонецЕсли;
													КонецЕсли;
												Иначе
													Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].Часов;
												КонецЕсли;
												//заявка №2037
											Иначе
												//О.Т. 11.07.2014 № 115
												НайденнаяСтрокаСверх = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
												ВремяСверхурочные = 0;
												ВремяСверхурочныеДни = 0;//О.Т. 24.02.2015 № 366
												для Каждого стрСверх из НайденнаяСтрокаСверх Цикл 
													ВремяСверхурочные = ВремяСверхурочные + стрСверх.Часов;
													ВремяСверхурочныеДни = ВремяСверхурочныеДни + стрСверх.Дней;//О.Т. 24.02.2015 № 366
												КонецЦикла;
												НайденнаяСтрокаВыхДни = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
												ВремяВыходные = 0;
												ВремяВыходныеДни = 0;//О.Т. 24.02.2015 № 366
												для Каждого стрВых из НайденнаяСтрокаВыхДни Цикл 
													ВремяВыходные = ВремяВыходные + стрВых.Часов;
													ВремяВыходныеДни = ВремяВыходныеДни + стрВых.Дней; //О.Т. 24.02.2015 № 366
													
													//Аверсон ЕАЕ 22.05.2024 СВФР-012907
													ИтогоВыхРВЧасов = ИтогоВыхРВЧасов + ВремяВыходные;
													//Аверсон СВФР-012907
												КонецЦикла;
												ФактИтогоСвРВ = ФактИтогоСвРВ + ВремяСверхурочные + ВремяВыходные;
												ФактИтогоСвРВДни = ФактИтогоСвРВДни + ВремяСверхурочныеДни + ВремяВыходныеДни;//О.Т. 24.02.2015 № 366
												если ВремяСверхурочные <> 0 или ВремяВыходные <> 0 Тогда 
													Область.Параметры["Зн"+Строка(мС+1)] = ВремяВыходные + ВремяСверхурочные;
												иначе
													Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].ВидВремени.БуквенныйКод;// была эта строка
												КонецЕсли;
												//О.Т. 11.07.2014 № 115
											КонецЕсли;
										Иначе
											НайденнаяСтрокаВыходные = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчета));
											Если НайденнаяСтрокаВыходные.Количество() <> 0 Тогда
												//Область.Параметры["Зн"+Строка(мС+1)] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни.БуквенныйКод;
												Если НовыйМакет Тогда 
													СчПроверка = мС;
													Если СчПроверка <> 0 Тогда
														Пока Область.Параметры["Зн"+Строка(СчПроверка)] = "" Цикл 
															СчПроверка = СчПроверка - 1;								
														КонецЦикла;
														Если Область.Параметры["Зн"+Строка(СчПроверка)] = "ОЖ" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "ОЖ";
															//О.Т. Аверсон 08.05.2018 № 1915
														ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "ОТ" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "ОТ";
															ОтпускВПраздник = ОтпускВПраздник +1;
														ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "Б" Тогда 
															Область.Параметры["Зн"+Строка(мС+1)] = "Б";
															//О.Т. Аверсон 08.05.2018 № 1915
														иначе
															Область.Параметры["Зн"+Строка(мС+1)] = "В";
														КонецЕсли;
													иначе
														Область.Параметры["Зн"+Строка(мС+1)] = "В";
													КонецЕсли;
													
												иначе
													Область.Параметры["Зн"+Строка(мС+1)] = "";
												КонецЕсли;
												
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
								Иначе
									Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
										НайденнаяСтрока = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата", Выборка.Сотрудник, мДатаОтсчета));
									ИначеЕсли ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
										НайденнаяСтрока = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, Тариф", Выборка.Сотрудник, мДатаОтсчета, Выборка.Тариф));
									КонецЕсли;
									
									Если НайденнаяСтрока.Количество() <> 0 Тогда
										ВидВремениПравильный = ?(НовыйМакет,НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа или 
										НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные, НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
										
										Если ВидВремениПравильный Тогда
											//заявка №2037 (база заявок Кристалла) Дмитрук О.Г.
											Если НайденнаяСтрока.Количество() > 1 Тогда
												Если НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И НайденнаяСтрока[1].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт Тогда
													Область.Параметры["Зн"+Строка(мС+1)] = ""+ НайденнаяСтрока[0].Часов + " " + НайденнаяСтрока[1].ВидВремени.БуквенныйКод;
												Иначе
													Если НовыйМакет Тогда 
														Для Каждого стрЗнач из НайденнаяСтрока Цикл 
															Если стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																Область.Параметры["Зн"+Строка(мС+1)] = ?(Область.Параметры["Зн"+Строка(мС+1)] = Неопределено,0,Область.Параметры["Зн"+Строка(мС+1)]) + стрЗнач.Часов;
															ИначеЕсли стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда 
																Если Область.Параметры["Зн"+Строка(мС+1)] = Неопределено Тогда 
																	Область.Параметры["Зн"+Строка(мС+1)] = стрЗнач.Часов;
																Иначе 
																	Область.Параметры["Зн"+Строка(мС+1)] = Строка(Область.Параметры["Зн"+Строка(мС+1)]) + "/"+Строка(стрЗнач.Часов);
																КонецЕсли;
															КонецЕсли;
															//Аверсон 23.01.2022 КВВ СВФР-008495 (
															Если (Организация.ИНН = "100010315" 
																ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
																И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда  
																Если (стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора ИЛИ
																	стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты ИЛИ
																	стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия ИЛИ
																	стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности ИЛИ
																	стрЗнач.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты ИЛИ
																	Найти(СокрЛП(Нрег(стрЗнач.ВидВремени)),"медосмотр")> 0) 
																	И НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																	Область.Параметры["Зн"+Строка(мС+1)] = Строка(Область.Параметры["Зн"+Строка(мС+1)]) +Символы.ПС + "---"+ Символы.ПС +Строка(стрЗнач.Часов);
																КонецЕсли;
															КонецЕсли;
															//Аверсон 23.01.2022 КВВ СВФР-008495 )
														КонецЦикла;
													иначе
														Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].Часов;
													КонецЕсли;
													
												КонецЕсли;
											Иначе
												Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[0].Часов;
											КонецЕсли;
											//заявка №2037
										Иначе
											//О.Т. 11.07.2014 № 115
											НайденнаяСтрокаСверх = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
											ВремяСверхурочные = 0;
											ВремяСверхурочныеДни = 0;//О.Т. 24.02.2015 № 366
											для Каждого стрСверх из НайденнаяСтрокаСверх Цикл 
												ВремяСверхурочные = ВремяСверхурочные + стрСверх.Часов;
												ВремяСверхурочныеДни = ВремяСверхурочныеДни + стрСверх.Дней;//О.Т. 24.02.2015 № 366
											КонецЦикла;
											НайденнаяСтрокаВыхДни = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата, ВидВремени", Выборка.Сотрудник, мДатаОтсчета,Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
											ВремяВыходные = 0;
											ВремяВыходныеДни = 0;//О.Т. 24.02.2015 № 366
											для Каждого стрВых из НайденнаяСтрокаВыхДни Цикл 
												ВремяВыходные = ВремяВыходные + стрВых.Часов;
												ВремяВыходныеДни = ВремяВыходныеДни + стрВых.Дней; //О.Т. 24.02.2015 № 366
												
												//Аверсон ЕАЕ 22.05.2024 СВФР-012907
												//Климовичи
												ИтогоВыхРВЧасов = ИтогоВыхРВЧасов + ВремяВыходные;
												//Аверсон СВФР-012907
											КонецЦикла;
											ФактИтогоСвРВ = ФактИтогоСвРВ + ВремяСверхурочные + ВремяВыходные;
											ФактИтогоСвРВДни = ФактИтогоСвРВДни + ВремяСверхурочныеДни + ВремяВыходныеДни;//О.Т. 24.02.2015 № 366
											если ВремяСверхурочные <> 0 или ВремяВыходные <> 0 Тогда 
												Область.Параметры["Зн"+Строка(мС+1)] = ВремяВыходные + ВремяСверхурочные;
											иначе
												//Аверсон 06.05.2020 КВВ СВФР-005949 (
												ВзятьСтрокуИзНайденных = 0; 
												Если НайденнаяСтрока.Количество() > 1 И ((мС+1) = День(КонецМесяца(мДатаОтсчета))) И 
													НайденнаяСтрока[0].ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность Тогда
													ВзятьСтрокуИзНайденных = 1;
												КонецЕсли;
												//Аверсон 06.05.2020 КВВ СВФР-005949 )
												Область.Параметры["Зн"+Строка(мС+1)] = НайденнаяСтрока[ВзятьСтрокуИзНайденных].ВидВремени.БуквенныйКод;// была эта строка  //Аверсон 06.05.2020 КВВ СВФР-005949 ( ВзятьСтрокуИзНайденных вместо 0)
											КонецЕсли;
											//О.Т. 11.07.2014 № 115
										КонецЕсли;
									Иначе
										
										//О.Т. Аверсон 25.11.2016 № 51
										ЗапросКом = Новый Запрос;
										ЗапросКом.Текст = 
										"ВЫБРАТЬ
										|	ПериодыСостоянийРаботниковОрганизаций.ДатаНачала
										|ИЗ
										|	РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
										|ГДЕ
										|	ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
										|	И ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <= &Дата
										|	И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания, ДЕНЬ, -1) >= &Дата
										|	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = &Сотрудник";
										
										ЗапросКом.УстановитьПараметр("Дата", мДатаОтсчета);
										ЗапросКом.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
										
										РезультатЗапросаКом = ЗапросКом.Выполнить().Выгрузить();
										//О.Т. Аверсон 25.11.2016 № 51
										
										НайденнаяСтрокаВыходные = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчета));
										
										Если НайденнаяСтрокаВыходные.Количество() <> 0 Тогда
											//Область.Параметры["Зн"+Строка(мС+1)] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни.БуквенныйКод;
											Если НовыйМакет Тогда 
												СчПроверка = мС;
												Если СчПроверка <> 0 Тогда
													Пока Область.Параметры["Зн"+Строка(СчПроверка)] = "" Цикл 
														СчПроверка = СчПроверка - 1;								
													КонецЦикла;
													
													//Аверсон ЕАЕ 08.09.2025 СВФР-016595
													//мДатаОтсчетаПроверка = НачалоДня(ДатаАктуальности)+мС*86400; //О.Т. Аверсон 28.11.2018 № 2740
													мДатаОтсчетаПроверка = НачалоДня(Нач)+мС*86400; //О.Т. Аверсон 28.11.2018 № 2740
													//Аверсон СВФР-016595
													
													НайденнаяСтрокаВыходныеПроверка = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчетаПроверка));
													Пока НайденнаяСтрокаВыходныеПроверка.Количество() > 0 Цикл 
														мДатаОтсчетаПроверка = мДатаОтсчетаПроверка + 86400;
														НайденнаяСтрокаВыходныеПроверка = ТаблицаВыходные.НайтиСтроки(Новый Структура("Дата", мДатаОтсчетаПроверка));
													КонецЦикла;
													НайденнаяСтрокаПроверка = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Дата", Выборка.Сотрудник, мДатаОтсчетаПроверка));
													Если НайденнаяСтрокаПроверка.Количество()>0 Тогда 
														Если ТаблицаОтрабВремя.Количество() > 6 И //СВЭЙ 14.02.2024 КВВ СВФР-012441
															ТаблицаОтрабВремя[5].ВидВремени.БуквенныйКод = Область.Параметры["Зн"+Строка(СчПроверка)] Тогда
															Если Область.Параметры["Зн"+Строка(СчПроверка)] = "ОЖ" Тогда 
																Область.Параметры["Зн"+Строка(мС+1)] = "ОЖ";
																//О.Т. Аверсон 08.05.2018 № 1915
															ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "ОТ" Тогда 
																Область.Параметры["Зн"+Строка(мС+1)] = "ОТ";
																ОтпускВПраздник = ОтпускВПраздник +1;
															ИначеЕсли Область.Параметры["Зн"+Строка(СчПроверка)] = "Б" Тогда 
																Область.Параметры["Зн"+Строка(мС+1)] = "Б";
																//О.Т. Аверсон 08.05.2018 № 1915
															иначе
																Область.Параметры["Зн"+Строка(мС+1)] = "В";
															КонецЕсли;
														иначе
															Область.Параметры["Зн"+Строка(мС+1)] = "В";
														КонецЕсли;
														
														
													иначе
														Область.Параметры["Зн"+Строка(мС+1)] = "В";
													КонецЕсли;
													
													
												иначе
													Область.Параметры["Зн"+Строка(мС+1)] = "В";
												КонецЕсли;
											иначе
												Область.Параметры["Зн"+Строка(мС+1)] = "";
											КонецЕсли;
										КонецЕсли;
										//О.Т. Аверсон 25.11.2016 № 51
										Если НовыйМакет и РезультатЗапросаКом.Количество() > 0 Тогда 
											Область.Параметры["Зн"+Строка(мС+1)] = "К";
										КонецЕсли;
										//О.Т. Аверсон 25.11.2016 № 51
										Если Организация.ИНН = "806000046" Тогда 
											ЗапросКом = Новый Запрос;
											ЗапросКом.Текст = 
											"ВЫБРАТЬ
											|	ПериодыСостоянийРаботниковОрганизаций.Регистратор
											|ИЗ
											|	РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
											|ГДЕ
											|	ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
											|	И ПериодыСостоянийРаботниковОрганизаций.ДатаНачала МЕЖДУ &Дата И &Дата1
											|	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = &Сотрудник";
											
											ЗапросКом.УстановитьПараметр("Дата", НачалоМесяца(мДатаОтсчета));
											ЗапросКом.УстановитьПараметр("Дата1", КонецМесяца(мДатаОтсчета));
											ЗапросКом.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
											
											РезультатЗапросаКом = ЗапросКом.Выполнить().Выгрузить();
											Для Каждого стрКом из РезультатЗапросаКом Цикл 
												Для Каждого стрКом2 из стрКом.Регистратор.ПереносДней Цикл 
													Если стрКом2.Сотрудник = Выборка.Сотрудник и НачалоДня(стрКом2.ДатаНаКакую) = НачалоДня(мДатаОтсчета) Тогда 
														Область.Параметры["Зн"+Строка(мС+1)] = "В";
													КонецЕсли;
													
												КонецЦикла;
												
											КонецЦикла;
											
											ЗапросПереносКоманд = Новый Запрос;
											ЗапросПереносКоманд.Текст = 
											"ВЫБРАТЬ
											|	ПереносДнейКомандировок.Сотрудник
											|ИЗ
											|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
											|ГДЕ
											|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
											|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
											
											ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", мДатаОтсчета);
											ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
											
											РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
											
											Пока РезультатПереносКоманд.Следующий() Цикл
												Область.Параметры["Зн"+Строка(мС+1)] = "В"; 
											КонецЦикла;
											
											
											ЗапросПереносКоманд = Новый Запрос;
											ЗапросПереносКоманд.Текст = 
											"ВЫБРАТЬ
											|	ПереносДнейКомандировок.Сотрудник
											|ИЗ
											|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
											|ГДЕ
											|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
											|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
											
											ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", мДатаОтсчета);
											ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
											
											РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
											
											Пока РезультатПереносКоманд.Следующий() Цикл
												Область.Параметры["Зн"+Строка(мС+1)] = "В"; 
											КонецЦикла;
											
											
											ЗапросСост = Новый Запрос;
											ЗапросСост.Текст = 
											"ВЫБРАТЬ
											|	СостояниеРаботниковОрганизаций.Регистратор
											|ИЗ
											|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
											|ГДЕ
											|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
											|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
											|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
											ЗапросСост.УстановитьПараметр("Период", мДатаОтсчета);   
											СостРаб = Новый СписокЗначений;
											СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты);
											ЗапросСост.УстановитьПараметр("Состояние", СостРаб);
											ЗапросСост.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);												
											РезультатСост = ЗапросСост.Выполнить().Выбрать();
											Если РезультатСост.Количество()>0 Тогда 
												Область.Параметры["Зн"+Строка(мС+1)] = "В";
											КонецЕсли;
											
											
											
										КонецЕсли;
										
									КонецЕсли;					
								КонецЕсли;
								//ПСА 22.02.2021 СВФР-007194+++
								Если НовыйМакет Тогда
									Если не ЗначениеЗаполнено(Область.Параметры["Зн"+Строка(мС+1)]) Тогда
										Область.Параметры["Зн"+Строка(мС+1)] = "В";
									КонецЕсли;	
								КонецЕсли;
								//+++ПСА 22.02.2021 СВФР-007194
								
								//Аверсон ЕАЕ 09.02.2022 СВФР-008706
								//проверяем каждую дату на выходной/праздник и получаем рабочие часы, если сотрудник работал
								ЭтоГосПраздник = Ложь;
								ЭтоВыходной = Ложь;
								ОтборТВ = Новый Структура;
								ОтборТВ.Вставить("Дата", мДатаОтсчета);
								СтрокиТВ = ТаблицаВыходные.НайтиСтроки(ОтборТВ);
								Если СтрокиТВ.Количество() > 0 Тогда
									Если СтрокиТВ[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
										ЭтоГосПраздник = Истина;
									ИначеЕсли (СтрокиТВ[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота) 
										ИЛИ (СтрокиТВ[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье) Тогда
										
										//Аверсон 17.08.2023 КВВ СВФР-011286 (
										НормаВремениПоИндГрафику = ПрочиеПроцедуры.ПолучитьДанныеПоИндивидуальномуЗаИнтервал(мДатаОтсчета,мДатаОтсчета,Выборка.Сотрудник).КоличествоЧасов;
										НормаПоГрафикуСотр = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(мДатаОтсчета, мДатаОтсчета, Выборка.Сотрудник).НормаЧасов;
										Если НормаВремениПоИндГрафику = 0 И НормаПоГрафикуСотр = 0 Тогда
											//Аверсон 17.08.2023 КВВ СВФР-011286 )
											
											ЭтоВыходной = Истина;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								
								ОтработаноЧасов = 0;
								
								Если ЭтоГосПраздник ИЛИ ЭтоВыходной Тогда
									//Получаем количество отработанных часов
									Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
										НайдСтр = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени, Дата",Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Работа, мДатаОтсчета));
									Иначе
										НайдСтр = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени, Дата",Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Работа, мДатаОтсчета));
									КонецЕсли;
									Если НайдСтр.Количество() <> 0 Тогда
										ОтработаноЧасов = НайдСтр[0].Часов;	
									КонецЕсли;
									
									//Аверсон ЕАЕ 18.08.2025 СВФР-016459 (п.3)
									Если ОтработаноЧасов = 0 Тогда
										Если ЗначениеЗаполнено(ДокументТабель) И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
											СтрТабеля = ДокументТабель.ОтработанноеВремя.Найти(Выборка.Сотрудник, "Сотрудник");
											Если СтрТабеля <> Неопределено Тогда
												Для н = 1 По 3 Цикл
													Если н = 1 Тогда
														ТекПриставка = "Первый";
													ИначеЕсли н = 2 Тогда
														ТекПриставка = "Второй";
													Иначе
														ТекПриставка = "Третий";
													КонецЕсли;
													ИмяКолонкиВидВремени = ТекПриставка + "ВидВремени" + СокрЛП(День(мДатаОтсчета));
													ИмяКолонкиЧасов = ТекПриставка + "Часов" + СокрЛП(День(мДатаОтсчета));
													Если СтрТабеля[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														ОтработаноЧасов = ОтработаноЧасов + СтрТабеля[ИмяКолонкиЧасов];	
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									//Аверсон СВФР-016459
									
								КонецЕсли;
								Если ЭтоГосПраздник Тогда
									СчитаемПраздники = СчитаемПраздники + ОтработаноЧасов;	
								ИначеЕсли ЭтоВыходной Тогда
									СчитаемВыходные = СчитаемВыходные + ОтработаноЧасов;
								КонецЕсли;
								//Аверсон СВФР-008706
								
								//Аверсон ЕАЕ 22.05.2024 СВФР-012907
								//Климовичи
								Если Область.Параметры["Зн"+Строка(мС+1)] = "В" Тогда
									ИтогоВыхВДней = ИтогоВыхВДней + 1;		
								КонецЕсли;
								//Аверсон СВФР-012907
								
							КонецЦикла;
							ЧасыФакт = 0; ЧасыРемонт = 0; ДниРемонт = 0; ДниФакт = 0;//О.Т. 24.02.2015 № 366
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.В = НайденнаяСтрокаП[0].Часов;
								ИтогВчерние = ИтогВчерние + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Н = НайденнаяСтрокаП[0].Часов;
								ИтогНочные = ИтогНочные + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.С = НайденнаяСтрокаП[0].Часов;
								ИтогСверхурочные = ИтогСверхурочные + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							//Аверсон ЕАЕ 09.02.2022 СВФР-008706
							//Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
							//	НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
							//Иначе
							//	НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
							//КонецЕсли;
							//Если НайденнаяСтрокаП.Количество() <> 0 Тогда
							//	//Аверсон 07.12.2021 КВВ СВФР-008449 (
							//	ЭтоГосПраздник = Ложь;
							//	ОтборТВ = Новый Структура;
							//	ОтборТВ.Вставить("Дата", мДатаОтсчета);
							//	СтрокиТВ = ТаблицаВыходные.НайтиСтроки(ОтборТВ);
							//	Если СтрокиТВ.Количество() > 0 Тогда
							//		Если СтрокиТВ[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
							//			ЭтоГосПраздник = Истина;
							//		КонецЕсли;
							//	КонецЕсли;
							//	Если НЕ ЭтоГосПраздник Тогда
							//		Попытка
							//			Область.Параметры.Вых = НайденнаяСтрокаП[0].Часов;
							//			ИтогВыходные = ИтогВыходные + НайденнаяСтрокаП[0].Часов;
							//			Выходные = НайденнаяСтрокаП[0].Часов;
							//		Исключение
							//		КонецПопытки;
							//	Иначе
							//		//Аверсон 07.12.2021 КВВ СВФР-008449 )
							//		Попытка
							//		Область.Параметры.П = НайденнаяСтрокаП[0].Часов;
							//		ИтогПраздничные = ИтогПраздничные + НайденнаяСтрокаП[0].Часов;
							//		Праздничные = НайденнаяСтрокаП[0].Часов;
							//		Исключение
							//		КонецПопытки;
							//	КонецЕсли;
							//КонецЕсли;
							
							Если НЕ (Организация.ИНН = "101542412" И МакетИзДок = "ТабельНов") Тогда //Аверсон 13.12.2022 КВВ СВФР-009948
								Попытка //Аверсон 17.02.2022 КВВ (попытку НЕ убирать! )
									
									//Аверсон ЕАЕ 22.05.2024 СВФР-012907
									//Климовичи
									Если Организация.ИНН = "700103211" Тогда
										Область.Параметры.Вых = ИтогоВыхРВЧасов;
									Иначе
										//Аверсон СВФР-012907
										Область.Параметры.Вых = СчитаемВыходные;
									КонецЕсли;
								Исключение
								КонецПопытки;
								
								//Аверсон ЕАЕ 22.05.2024 СВФР-012907
								//Климовичи
								Если Организация.ИНН = "700103211" Тогда
									Область.Параметры.ВыхД = ИтогоВыхВДней;
									ИтогоВыхВДнейОбщийИтог = ИтогоВыхВДнейОбщийИтог + ИтогоВыхВДней;
								КонецЕсли;
								//Аверсон СВФР-012907
								
								//Аверсон ЕАЕ 22.05.2024 СВФР-012907
								//Климовичи
								Если Организация.ИНН = "700103211" Тогда
									ИтогВыходные = ИтогВыходные + ИтогоВыхРВЧасов;
								Иначе
									//Аверсон СВФР-012907	
									ИтогВыходные = ИтогВыходные + СчитаемВыходные;
								КонецЕсли;
								Выходные = СчитаемВыходные;
							КонецЕсли;
							
							Попытка //Аверсон 17.02.2022 КВВ (попытку НЕ убирать! )
								Область.Параметры.П = СчитаемПраздники;
							Исключение
							КонецПопытки;
							ИтогПраздничные = ИтогПраздничные + СчитаемПраздники;
							Праздничные = СчитаемПраздники;
							//Аверсон СВФР-008706
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.О = НайденнаяСтрокаП[0].Дней + ОтпускВПраздник;
								ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП[0].Дней + ОтпускВПраздник;
							КонецЕсли;
							
							//О.Т. Аверсон 14.11.2017 № 1246
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП1 = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск));
							Иначе
								НайденнаяСтрокаП1 = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск));
							КонецЕсли;
							
							Если НайденнаяСтрокаП1.Количество() <> 0 Тогда
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда  					
									Область.Параметры.О = Область.Параметры.О + НайденнаяСтрокаП1[0].Дней;
									ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП1[0].Дней; 					
								иначе
									Область.Параметры.О = НайденнаяСтрокаП1[0].Дней;
									ИтогОтпуск = ИтогОтпуск + НайденнаяСтрокаП1[0].Дней; 				
								КонецЕсли;
							КонецЕсли;
							//О.Т. Аверсон 14.11.2017 № 1246
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ДО = НайденнаяСтрокаП[0].Дней;
								ИтогДОтпуск = ИтогДОтпуск + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							//Аверсон 16.03.2021 КВВ СВФР-007336 (
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.ДО = НайденнаяСтрокаП[0].Дней;
								ИтогДОтпуск = ИтогДОтпуск + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//Аверсон 16.03.2021 КВВ СВФР-007336 )
							
							//Островская Татьяна 25.02.2014 № 17145
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Попытка
									Область.Параметры.ДО1 = НайденнаяСтрокаП[0].Дней;
									ИтогЗаСвойСчет = ИтогЗаСвойСчет + НайденнаяСтрокаП[0].Дней;
								Исключение
								КонецПопытки;
							КонецЕсли;
							//Островская Татьяна 25.02.2014 № 17145
							
							//СВЭЙ 20.09.2023 КВВ СВФР-011482 (
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Попытка
									Область.Параметры.Прогулы2 = НайденнаяСтрокаП[0].Дней;
								Исключение
								КонецПопытки;
								ИтогПрогулы2 = ИтогПрогулы2 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Попытка
									Область.Параметры.ГосОб2 = НайденнаяСтрокаП[0].Дней;
								Исключение
								КонецПопытки;
								ИтогГосОб2 = ИтогГосОб2 + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							//СВЭЙ 20.09.2023 КВВ СВФР-011482 )
							
							//Аверсон 15.12.2021 КВВ СВФР-008495 (
							Если (Организация.ИНН = "100010315" 
								ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
								И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда  
								
								//отпуск за свой счет (
								ДнОтпускЗаСвойСчет = 0;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнОтпускЗаСвойСчет = ДнОтпускЗаСвойСчет + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								//Аверсон 20.01.2022 КВВ СВФР-008495 (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнОтпускЗаСвойСчет = ДнОтпускЗаСвойСчет + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								Если ДнОтпускЗаСвойСчет > 0 Тогда
									Область.Параметры.ДнОтпускЗаСвойСчет = ДнОтпускЗаСвойСчет;
									ИтогДнОтпускЗаСвойСчет = ИтогДнОтпускЗаСвойСчет + ДнОтпускЗаСвойСчет;
								КонецЕсли;
								//Аверсон 20.01.2022 КВВ СВФР-008495 )
								//отпуск за свой счет )
								
								//прогул (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Область.Параметры.ДнПрогул = НайденнаяСтрокаП[0].Дней;
									ИтогДнПрогул = ИтогДнПрогул + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								//прогул )
								
								//уч.отпуск (
								ДнУчОтпуск = 0;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнУчОтпуск = ДнУчОтпуск + НайденнаяСтрокаП[0].Дней;
									ИтогДнУчОтпуск = ИтогДнУчОтпуск + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнУчОтпуск = ДнУчОтпуск + НайденнаяСтрокаП[0].Дней;
									ИтогДнУчОтпуск = ИтогДнУчОтпуск + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								Если ДнУчОтпуск > 0 Тогда
									Область.Параметры.ДнУчОтпуск = ДнУчОтпуск;
								КонецЕсли;
								//уч.отпуск )
								
								//по среднему (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Область.Параметры.ЧПоСред = НайденнаяСтрокаП[0].Часов;
									ИтогЧПоСред = ИтогЧПоСред + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								//по среднему )
								
								//праздн. и вых. (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Область.Параметры.ЧПраздники = НайденнаяСтрокаП[0].Часов;
									ИтогЧПраздники = ИтогЧПраздники + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								//праздн. и вых. )
								
								//день донора (
								ЧДеньДонора = 0;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонора));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ЧДеньДонора = ЧДеньДонора + НайденнаяСтрокаП[0].Часов;
									ИтогЧДеньДонора = ИтогЧДеньДонора + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ЧДеньДонора = ЧДеньДонора + НайденнаяСтрокаП[0].Часов;
									ИтогЧДеньДонора = ИтогЧДеньДонора + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								Если ЧДеньДонора > 0 Тогда
									Область.Параметры.ЧДеньДонора = ЧДеньДонора;
								КонецЕсли;
								//день донора )
								
								//медосмотр, отстранение от работы, простой, справка, день матери, курсы  (
								ЧМедОсмотр = 0;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Медкомиссия));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ЧМедОсмотр = ЧМедОсмотр + НайденнаяСтрокаП[0].Часов;
									ИтогЧМедОсмотр = ИтогЧМедОсмотр + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								
								ДнПростой = 0; ДнСправка = 0; ДнДеньМамы = 0; ДнКурсыОбуч = 0;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник", Выборка.Сотрудник));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Для Каждого СтрНайденнаяСтрокаП ИЗ НайденнаяСтрокаП Цикл
										НайденныхЧасов = СтрНайденнаяСтрокаП.Часов;
										НайденныхДней = СтрНайденнаяСтрокаП.Дней;
										Если Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"медосмотр")>0 Тогда
											ЧМедОсмотр = ЧМедОсмотр + НайденныхЧасов;
											ИтогЧМедОсмотр = ИтогЧМедОсмотр + НайденныхЧасов;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"отстранение от работы")>0 Тогда
											Область.Параметры.ЧОтстрОтРаб = НайденныхЧасов;
											ИтогЧОтстрОтРаб = ИтогЧОтстрОтРаб + НайденныхЧасов;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"простой целосменный")>0 
											ИЛИ Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"отпуск с частичным сохранением зарплаты по инициативе нанимателя")>0 Тогда
											ДнПростой = ДнПростой + НайденныхДней;
											ИтогДнПростой = ИтогДнПростой + НайденныхДней;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"справка")>0 
											ИЛИ Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"больничный неоплачиваемый по уходу за ребенком")>0 Тогда
											ДнСправка = ДнСправка + НайденныхДней;
											ИтогДнСправка = ИтогДнСправка + НайденныхДней;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"неоплачиваемый день матери")>0 Тогда
											ДнДеньМамы = ДнДеньМамы + НайденныхДней;
											ИтогДнДеньМамы = ИтогДнДеньМамы + НайденныхДней;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"семинар")>0 Тогда
											ДнКурсыОбуч = ДнКурсыОбуч + НайденныхДней;
											ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденныхДней;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"курсы целевого назначения")>0 
											И СтрНайденнаяСтрокаП.ВидВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.КурсыЦелевогоНазначения Тогда //Аверсон 03.03.2023 КВВ СВФР-010474 (обработка предопределенного идет далее)
											ДнКурсыОбуч = ДнКурсыОбуч + НайденныхДней;
											ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденныхДней;
										ИначеЕсли Найти(Нрег(СокрЛП(СтрНайденнаяСтрокаП.ВидВремени)),"повышение квалификации в другой местности")>0 Тогда
											ДнКурсыОбуч = ДнКурсыОбуч + НайденныхДней;
											ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденныхДней;
										Иначе
											Продолжить;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
								
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнДеньМамы = ДнДеньМамы + НайденнаяСтрокаП[0].Дней;
									ИтогДнДеньМамы = ИтогДнДеньМамы + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнДеньМамы = ДнДеньМамы + НайденнаяСтрокаП[0].Дней;
									ИтогДнДеньМамы = ИтогДнДеньМамы + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								
								//курсы (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Переподготовка));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Стажировка));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.СмежнаяПрофессия));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПрофПодготовкаНеРабочих));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								//Аверсон 24.01.2022 КВВ СВФР-008645 (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ПрофПодготовкаРабочих));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.КурсыЦелевогоНазначения));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									ДнКурсыОбуч = ДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
									ИтогДнКурсыОбуч = ИтогДнКурсыОбуч + НайденнаяСтрокаП[0].Дней;
								КонецЕсли;
								//Аверсон 24.01.2022 КВВ СВФР-008645 )
								
								//курсы )
								
								
								Если ЧМедОсмотр > 0 Тогда
									Область.Параметры.ЧМедОсмотр = ЧМедОсмотр;
								КонецЕсли;
								Если ДнПростой > 0 Тогда
									Область.Параметры.ДнПростой = ДнПростой;
								КонецЕсли;
								Если ДнСправка > 0 Тогда
									Область.Параметры.ДнСправка = ДнСправка;
								КонецЕсли;
								Если ДнДеньМамы > 0 Тогда
									Область.Параметры.ДнДеньМамы = ДнДеньМамы;
								КонецЕсли;
								Если ДнКурсыОбуч > 0 Тогда
									Область.Параметры.ДнКурсыОбуч = ДнКурсыОбуч;
								КонецЕсли;
								
								
								//медосмотр, отстранение от работы, простой, справка, день матери, курсы )
								
								// гособязанность (
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности));
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Область.Параметры.ЧГосОбяз = НайденнаяСтрокаП[0].Часов;
									ИтогЧГосОбяз = ИтогЧГосОбяз + НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								// гособязанность )
								
							КонецЕсли;
							//Аверсон 15.12.2021 КВВ СВФР-008495 )
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Б = НайденнаяСтрокаП[0].Дней;
								ИтогБольничные = ИтогБольничные + НайденнаяСтрокаП[0].Дней;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
							КонецЕсли;
							
							//Аверсон 13.12.2022 КВВ СВФР-009948 (
							Если Организация.ИНН = "101542412" И МакетИзДок = "ТабельНов" Тогда
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//ДатаАкт1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(ДатаАктуальности),Мин(ДатаУвольнения,КонецМесяца(ДатаАктуальности)),КонецМесяца(ДатаАктуальности));
								//ДатаАкт2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(ДатаАктуальности),Макс(ДатаПриема,ДатаАктуальности),ДатаАктуальности);
								ДатаАкт1 = ?(НачалоМесяца(ДатаУвольнения) = НачалоМесяца(Нач),Мин(ДатаУвольнения,КонецМесяца(Кон)),КонецМесяца(Кон));
								ДатаАкт2 = ?(НачалоМесяца(ДатаПриема) = НачалоМесяца(Нач),Макс(ДатаПриема,Нач),Нач);
								//Аверсон СВФР-016595
								
								СумВых = 0;	СумПразд = 0;				
								Для мС = День(ДатаАкт2)-1 По День(ДатаАкт1)-1 Цикл
									
									//Аверсон ЕАЕ 08.09.2025 СВФР-016595
									//мДатаОтсчета = НачалоДня(ДатаАктуальности)+мС*86400;
									мДатаОтсчета = НачалоДня(Нач)+мС*86400;
									//Аверсон СВФР-016595
									
									ЭтоПраздник = Ложь;
									ОтборПр = Новый Структура;
									ОтборПр.Вставить("Дата", мДатаОтсчета);
									СтрокиПр = ТаблицаВыходные.НайтиСтроки(ОтборПр);
									Если СтрокиПр.Количество() > 0 Тогда
										Если СтрокиПр[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
											ЭтоПраздник = Истина;
										КонецЕсли;
									КонецЕсли;
									
									ЗС = Новый Запрос;
									ЗС.Текст = 
									"ВЫБРАТЬ
									|	СостояниеРаботниковОрганизаций.Регистратор,
									|	СостояниеРаботниковОрганизаций.Состояние
									|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
									|ГДЕ
									|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
									|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
									|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
									ЗС.УстановитьПараметр("Период", НачалоДня(мДатаОтсчета));   
									СостРаб = Новый СписокЗначений;
									СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты);
									СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
									ЗС.УстановитьПараметр("Состояние", СостРаб);
									ЗС.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);												
									РезЗС = ЗС.Выполнить().Выгрузить();
									Если РезЗС.Количество() <> 0 Тогда 
										Если ТипЗнч(РезЗС[0].Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
											
											Для Каждого стрТЧ из РезЗС[0].Регистратор.РаботникиОрганизации Цикл
												Если стрТЧ.Сотрудник <> Выборка.Сотрудник Тогда
													Продолжить;
												КонецЕсли;
												Если стрТЧ.ЯвкаВТабель = Истина Тогда
													Если РезЗС[0].Состояние = Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты Тогда
														Если НачалоДня(СтрТЧ.ДеньОтдыха) = НачалоДня(мДатаОтсчета) Тогда
															Если ЭтоПраздник Тогда
																СумПразд = СумПразд + СтрТЧ.ОтработаноЧасов;
															Иначе
																СумВых = СумВых + СтрТЧ.ОтработаноЧасов;
															КонецЕсли;
														КонецЕсли;
													Иначе
														Если НачалоДня(СтрТЧ.ДатаВыхода) = НачалоДня(мДатаОтсчета) И НЕ ЗначениеЗаполнено(СтрТЧ.ДеньОтдыха) Тогда
															Если ЭтоПраздник Тогда
																СумПразд = СумПразд + СтрТЧ.ОтработаноЧасов;
															Иначе
																СумВых = СумВых + СтрТЧ.ОтработаноЧасов;
															КонецЕсли;
															
														КонецЕсли;
														
													КонецЕсли;
												Иначе
													Продолжить;
												КонецЕсли;
											КонецЦикла;
										Иначе
											Сообщить(Выборка.Сотрудник);
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Область.Параметры.Вых = СумВых;
								ИтогВыходные = ИтогВыходные + СумВых;
								Выходные = СумВых;
								
								Область.Параметры.П = СумПразд;
								ИтогПраздничные = ИтогПраздничные + СумПразд;
								Праздничные = СумПразд;
								
							Иначе
								//Аверсон 13.12.2022 КВВ СВФР-009948 )
								
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									Если Организация.ИНН = "806000046" Тогда
										НайденнаяСтрокаП = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
										Для Каждого стрВых из НайденнаяСтрокаП Цикл 
											ЗапросСост = Новый Запрос;
											ЗапросСост.Текст = 
											"ВЫБРАТЬ
											|	СостояниеРаботниковОрганизаций.Регистратор
											|ИЗ
											|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
											|ГДЕ
											|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
											|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
											|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
											мДатаОтсчета1 = НачалоДня(стрВых.Дата);
											ЗапросСост.УстановитьПараметр("Период", мДатаОтсчета1);   
											СостРаб = Новый СписокЗначений;
											СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты);
											ЗапросСост.УстановитьПараметр("Состояние", СостРаб);
											ЗапросСост.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);												
											РезультатСост = ЗапросСост.Выполнить().Выбрать();
											Если РезультатСост.Количество()=0 Тогда 
												Область.Параметры.Вых = ?(Область.Параметры.Вых=Неопределено,0,Область.Параметры.Вых)+НайденнаяСтрокаП[0].Часов;
												ИтогВыходные = ИтогВыходные + НайденнаяСтрокаП[0].Часов;
												Выходные = Выходные + НайденнаяСтрокаП[0].Часов;
												
											КонецЕсли; 
										КонецЦикла;
										
										
									иначе
										Попытка
											Область.Параметры.Вых = НайденнаяСтрокаП[0].Часов;
											ИтогВыходные = ИтогВыходные + НайденнаяСтрокаП[0].Часов;
											Выходные = НайденнаяСтрокаП[0].Часов;
										Исключение
										КонецПопытки;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда  
								
								ДниКомандировок = НайденнаяСтрокаП[0].Дней;
								Если НовыйМакет Тогда
									//Аверсон 11.07.2023 КВВ СВФР-011104 (
									
									//Аверсон ЕАЕ 10.09.2024 СВФР-013244
									//Минск-Новости, ФишФуд
									Если Организация.ИНН = "101542412" ИЛИ Организация.ИНН = "192240370" Тогда
										//ЧасыКомандировок = НайденнаяСтрокаП[0].ЧасовК + ?(НайденнаяСтрокаП[0].ЧасовК=0,НайденнаяСтрокаП[0].Часов,0);
										ЧасыКомандировок = НайденнаяСтрокаП[0].ЧасовК + НайденнаяСтрокаП[0].Часов;
									Иначе
										//Аверсон СВФР-013244
										
										//Аверсон 11.07.2023 КВВ СВФР-011104 )
										
										//Аверсон ЕАЕ 10.12.2024 СВФР-014135
										//ЧасыКомандировок = НайденнаяСтрокаП[0].ЧасовК;
										ЧасыКомандировок = НайденнаяСтрокаП[0].ЧасовК + НайденнаяСтрокаП[0].Часов;
										//Аверсон СВФР-014135
										
									КонецЕсли;
								иначе
									ЧасыКомандировок = НайденнаяСтрокаП[0].Часов;
								КонецЕсли;
								
								//заявка №2032 (база заявок Кристалла) Дмитрук О.Г.
								//Область.Параметры.К = НайденнаяСтрокаП[0].Дней;
								//ИтогКомандировка = ИтогКомандировка + НайденнаяСтрокаП[0].Дней;
								Область.Параметры.К = ЧасыКомандировок;
								ИтогКомандировка = ИтогКомандировка + ЧасыКомандировок;				
								//заявка №2032
							иначе
								ДниКомандировок = 0;
								ЧасыКомандировок = 0;
								
							КонецЕсли;
							
							//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Р = НайденнаяСтрокаП[0].Часов;
								ЧасыРемонт = ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
								ДниРемонт = ДниРемонт + НайденнаяСтрокаП[0].Дней;//О.Т. 24.02.2015 № 366
								ИтогРемонт = ИтогРемонт + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							//заявка №1664
							
							
							
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
								Если НовыйМакет Тогда 
									НайденнаяСтрокаКомандировки = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
									Если НайденнаяСтрокаКомандировки.Количество()> 0 Тогда 
										ДниКомандировок = НайденнаяСтрокаКомандировки[0].Дней;
										Если НовыйМакет Тогда
											//СВЭЙ 14.06.2024 КВВ СВФР-013244 (
											//Минск-Новости, ФишФуд
											Если Организация.ИНН = "101542412" ИЛИ Организация.ИНН = "192240370" Тогда
												//ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК + ?(НайденнаяСтрокаКомандировки[0].ЧасовК=0,НайденнаяСтрокаКомандировки[0].Часов,0);
												ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК + НайденнаяСтрокаКомандировки[0].Часов;
											Иначе
												//СВЭЙ 14.06.2024 КВВ СВФР-013244 )
												
												//Аверсон ЕАЕ 10.12.2024 СВФР-014135
												//ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК;
												ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК + НайденнаяСтрокаКомандировки[0].Часов;
												//Аверсон СВФР-014135
											КонецЕсли;
										иначе
											ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].Часов;
										КонецЕсли;
									иначе
										ДниКомандировок = 0;
										ЧасыКомандировок = 0;
									КонецЕсли;
									
									НайденнаяСтрокаДниПеренос = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
									Если НайденнаяСтрокаДниПеренос.Количество()> 0 Тогда 
										
										Если Организация.ИНН = "806000046" Тогда
											НайденнаяСтрокаП = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
											Для Каждого стрВых из НайденнаяСтрокаП Цикл 
												ЗапросСост = Новый Запрос;
												ЗапросСост.Текст = 
												"ВЫБРАТЬ
												|	СостояниеРаботниковОрганизаций.Регистратор
												|ИЗ
												|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
												|ГДЕ
												|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
												|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
												|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
												мДатаОтсчета1 = НачалоДня(стрВых.Дата);
												ЗапросСост.УстановитьПараметр("Период", мДатаОтсчета1);   
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты);
												ЗапросСост.УстановитьПараметр("Состояние", СостРаб);
												ЗапросСост.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);												
												РезультатСост = ЗапросСост.Выполнить().Выбрать();
												ДниВыхПеренос =0;
												ЧасыВыхПеренос = 0;
												Если РезультатСост.Количество()=0 Тогда 
													ДниВыхПеренос = ДниВыхПеренос + НайденнаяСтрокаДниПеренос[0].Дней;
													Если НовыйМакет Тогда
														ЧасыВыхПеренос = ЧасыВыхПеренос+НайденнаяСтрокаДниПеренос[0].ЧасовК;
													иначе
														ЧасыВыхПеренос = ЧасыВыхПеренос+НайденнаяСтрокаДниПеренос[0].Часов;
													КонецЕсли;
												КонецЕсли; 
											КонецЦикла;
											
										иначе
											
											//Аверсон 15.08.2023 КВВ СВФР-011217 (
											Убрать = Ложь;
											НайденнаяСтрОснТЗ = ТаблицаОтрабВремя.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
											Для Каждого СтрДата ИЗ НайденнаяСтрОснТЗ Цикл
												З_ = Новый Запрос;
												З_.Текст = "ВЫБРАТЬ 
												|РегСостояние.Регистратор
												|ПОМЕСТИТЬ ВтДок
												|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК РегСостояние
												|ГДЕ
												|РегСостояние.Сотрудник = &Сотрудник
												|И НАЧАЛОПЕРИОДА(РегСостояние.Период,ДЕНЬ) = &ДатаПроверки
												|;
												|ВЫБРАТЬ *
												|ИЗ Документ.ПриказНаРаботуВПраздничныеИВыходныеДни.РаботникиОрганизации КАК РО
												|ГДЕ РО.Сотрудник = &Сотрудник
												|И РО.Доплачивать = ЛОЖЬ
												|И РО.ЯвкаВТабель = ИСТИНА
												|И РО.ДеньОтдыха = &ДатаПроверки
												|И РО.Ссылка В (ВЫБРАТЬ ВтДок.Регистратор ИЗ ВтДок)";
												З_.УстановитьПараметр("Сотрудник",СтрДата.Сотрудник);
												З_.УстановитьПараметр("ДатаПроверки",НачалоДня(СтрДата.Дата));
												РезЗ_ = З_.Выполнить().Выгрузить();
												Если РезЗ_.Количество() > 0 Тогда
													Убрать = Истина;
												КонецЕсли;
											КонецЦикла;
											
											//ДниВыхПеренос = НайденнаяСтрокаДниПеренос[0].Дней;
											ДниВыхПеренос = ?(Убрать,0,НайденнаяСтрокаДниПеренос[0].Дней);
											//Аверсон 15.08.2023 КВВ СВФР-011217 )
											
											Если НовыйМакет Тогда
												ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].ЧасовК;
											иначе
												ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].Часов;
											КонецЕсли;
											
											//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 2) (
											Если Организация.ИНН = "101542412" И ЧасыВыхПеренос = 0 И ДниВыхПеренос <> 0 Тогда 
												ДниВыхПеренос = 0;
											КонецЕсли;
											//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 2) )
											
										КонецЕсли;
									иначе
										ДниВыхПеренос = 0;
										ЧасыВыхПеренос = 0;
									КонецЕсли;
								иначе
									ДниКомандировок = 0;
									ЧасыКомандировок = 0;
									ДниВыхПеренос = 0;
									ЧасыВыхПеренос = 0; 
								КонецЕсли;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								
								//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
								//Островская Татьяна 29.04.2013 № 16452
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
									
									//Аверсон 21.01.2022 КВВ СВФР-008495 (
									ЧасыКомандировок_ = ЧасыКомандировок;
									ДниКомандировок_ = ДниКомандировок;
									ФактИтогоСвРВ_ = ФактИтогоСвРВ;
									ФактИтогоСвРВДни_ = ФактИтогоСвРВДни;
									Если (Организация.ИНН = "100010315" 
										ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
										И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда 
										ЧасыКомандировок_ = 0;
										ДниКомандировок_ = 0;
										ФактИтогоСвРВДни_ = 0;
										ФактИтогоСвРВ_ = 0;
									КонецЕсли;
									//Аверсон 21.01.2022 КВВ СВФР-008495 )
									Область.Параметры.ЯЧ = ЧасыФакт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ_ + ЧасыКомандировок_+ЧасыВыхПеренос;// + ЧасыРемонт + Праздничные + Выходные;
									Область.Параметры.ЯЧД = ДниФакт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни_+ ДниКомандировок_+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ_ +ЧасыКомандировок_+ЧасыВыхПеренос; //+ ЧасыФакт + Праздничные + Выходные;
									ИтогДниФакт = ИтогДниФакт + ДниРемонт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни_ + ДниКомандировок_+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									//заявка №1799 
									
								Иначе
									Область.Параметры.ЯЧ = ЧасыФакт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ; //+ ЧасыРемонт;
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыФакт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ;//+ ЧасыРемонт;
								КонецЕсли;
								//Островская Татьяна 29.04.2013 № 16452
								//заявка №1664
							иначе
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									
									Область.Параметры.ЯЧ = ЧасыФакт + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;// + ЧасыРемонт + Праздничные + Выходные;
									Область.Параметры.ЯЧД = ДниФакт + ФактИтогоСвРВДни+ ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + ФактИтогоСвРВ +ЧасыКомандировок+ЧасыВыхПеренос; //+ ЧасыФакт + Праздничные + Выходные;
									ИтогДниФакт = ИтогДниФакт + ДниРемонт + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									
								Иначе
									Область.Параметры.ЯЧ = ЧасыФакт + ФактИтогоСвРВ; //+ ЧасыРемонт;
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыФакт + ФактИтогоСвРВ;//+ ЧасыРемонт;
								КонецЕсли;
							КонецЕсли;
							
							//Аверсон 03.01.2022 КВВ СВФР-008495 (
							Если (Организация.ИНН = "100010315" 
								ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
								И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь И ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда  
								Если ДокументТабель.ОтличаютсяВредныеЧасы Тогда
									ОтборВред = Новый Структура;
									ОтборВред.Вставить("Сотрудник", Выборка.Сотрудник);
									СтрокиВред = ДокументТабель.ОтработанноеВремя.НайтиСтроки(ОтборВред);
									Область.Параметры.ЧВредности = ?(СтрокиВред.Количество() > 0,СтрокиВред[0].ИтогоВредность,0);
								Иначе
									
									//Область.Параметры.ЧВредности = Область.Параметры.ЯЧ;
								КонецЕсли;
							КонецЕсли;
							//Аверсон 03.01.2022 КВВ СВФР-008495 )
							
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") и НовыйМакет Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
								
								Если НайденнаяСтрокаП.Количество() <> 0 Тогда
									//Область.Параметры.ЯЧ = ЧасыФакт + НайденнаяСтрокаП[0].Часов;
									//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыФакт + НайденнаяСтрокаП[0].Часов;
									
									//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
									//Островская Татьяна 29.04.2013 № 16452
									Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
										//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
										// двоит сверхур если они в явке, выведим сообщение
										//Область.Параметры.ЯЧ = ?(Область.Параметры.ЯЧ = Неопределено,0,Область.Параметры.ЯЧ) + НайденнаяСтрокаП[0].Часов;// + ЧасыРемонт + Праздничные + Выходные;   						
										//ИтогЧасыФакт = ИтогЧасыФакт + НайденнаяСтрокаП[0].Часов; //+ ЧасыФакт + Праздничные + Выходные;
										Сообщить(СокрЛП(Выборка.Сотрудник.наименование)+ " проверьте отработанные часы за месяц");
										// двоит сверхур если они в явке, выведим сообщение
										//заявка №1799 
										//Область.Параметры.ЯЧ = ЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
										//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
									КонецЕсли;
									//Островская Татьяна 29.04.2013 № 16452
									//заявка №1664
								КонецЕсли;
							КонецЕсли;
							// ПСА 11-01-2021 СВФР-007034 +++
							//ДокументРезультат.Вывести(Область);
							Если ДокументРезультат.ПроверитьВывод(Область) Тогда
								ДокументРезультат.Вывести(Область);				
							Иначе
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(ОбластьШапки);
								ДокументРезультат.Вывести(Область);
							КонецЕсли;
							//+++ ПСА 11-01-2021 СВФР-007034
							
							//Аверсон 15.11.2019 КВВ СВФР-005053 (
							Если Организация.ИНН = "806000046" И МакетИзДок = "ТабельНов" Тогда
								Если СчКолвоСтрок = КолвоНаСтр Тогда
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();	
									ОблШТЧ = мМакет.ПолучитьОбласть("Шапка2");
									ДокументРезультат.Вывести(ОблШТЧ);
									СчКолвоСтрок = 0;
								КонецЕсли;
							КонецЕсли;
							//Аверсон 15.11.2019 КВВ СВФР-005053 )
						Иначе
							ЧасыРемонт = 0;
							ДниРемонт = 0;//О.Т. 24.02.2015 № 366
							ДниФакт = 0;//О.Т. 24.02.2015 № 366
							
							//О.Т. 24.02.2015 № 366
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								Область = мМакет.ПолучитьОбласть("Детали1|Область4");
							иначе
								Область = мМакет.ПолучитьОбласть("Детали|Область1");
							КонецЕсли;
							//О.Т. 24.02.2015 № 366
							Область.Параметры.Заполнить(Выборка);
							Область.Параметры.ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.Сотрудник);//О.Т. 12.07.2014 №115
							мНомер = мНомер + 1;
							Область.Параметры.мНомер = мНомер;
							
							Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
								Если ЗначениеЗаполнено(Выборка.Видрасчета) Тогда
									Область.Параметры.Тариф = Выборка.Показатель1;	
								КонецЕСли;
							Иначе
								Если ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									Если ЗначениеЗаполнено(Выборка.Видрасчета) Тогда
										Область.Параметры.Тариф = Выборка.Показатель1;	
										//Аверсон 10.11.2020 КВВ СВФР-006805 (
										Если НЕ ЗначениеЗаполнено(Выборка.Показатель1) Тогда
											ЗУв = Новый Запрос;
											ЗУв.Текст = "ВЫБРАТЬ 
											|УвольнениеРаботники.ДатаУвольнения
											|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники	
											|ГДЕ УвольнениеРаботники.Сотрудник = &Сотрудник И
											|УвольнениеРаботники.Ссылка.Проведен";
											ЗУв.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
											РезЗУв = ЗУв.Выполнить().Выбрать();
											
											//Аверсон ЕАЕ 08.09.2025 СВФР-016595
											//парамКонец = КонецМесяца(ДатаАктуальности);
											//Если РезЗУв.Следующий() Тогда
											//	парамКонец = Мин(КонецМесяца(ДатаАктуальности),КонецДня(РезЗУв.ДатаУвольнения));
											//КонецЕсли;
											парамКонец = КонецМесяца(Кон);
											Если РезЗУв.Следующий() Тогда
												парамКонец = Мин(КонецМесяца(Кон),КонецДня(РезЗУв.ДатаУвольнения));
											КонецЕсли;
											//Аверсон СВФР-016595
											
											З = Новый Запрос;
											ТекстЗ = ПолучитьТекстЗапросаПоПоказатель1();  
											З.Текст = СтрЗаменить(ТекстЗ,"//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник","И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник");
											З.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
											З.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
											З.УстановитьПараметр("КонДата",	парамКонец);
											З.УстановитьПараметр("Ссылка",	ДокументТабель);
											З.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
											
											//Аверсон 22.07.2021 КВВ СВФР-007844 (
											ПечТариф = 0;
											РезЗ = З.Выполнить().Выбрать();
											Если РезЗ.Следующий() Тогда
												ПечТариф = РезЗ.Показатель1;
											КонецЕсли;
											
											Если НЕ ЗначениеЗаполнено(ПечТариф) Тогда
												З = Новый Запрос;
												ТекстЗ = ПолучитьТекстЗапросаПоПоказатель1();  
												ТекстЗ = СтрЗаменить(ТекстЗ,"//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник","И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник");
												ТекстЗ = СтрЗаменить(ТекстЗ,"ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1","
												|ВЫБОР КОГДА
												|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
												|И 
												|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
												|ТОГДА  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1Завершения
												|ИНАЧЕ  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
												|КОНЕЦ КАК Показатель1");
												З.Текст = ТекстЗ;
												З.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
												З.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
												З.УстановитьПараметр("КонДата",	парамКонец);
												З.УстановитьПараметр("Ссылка",	ДокументТабель);
												З.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
												
												РезЗ = З.Выполнить().Выбрать();
												Если РезЗ.Следующий() Тогда
													ПечТариф = РезЗ.Показатель1;
												КонецЕсли;
											КонецЕсли;
											Область.Параметры.Тариф = ПечТариф;
											//Аверсон 22.07.2021 КВВ СВФР-007844 )
										КонецЕсли;
										//Аверсон 10.11.2020 КВВ СВФР-006805 )
									КонецЕСли;
								КонецЕсли;			
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.В = НайденнаяСтрокаП[0].Часов;
								ИтогВчерние = ИтогВчерние + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
							КонецЕсли;	
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Н = НайденнаяСтрокаП[0].Часов;
								ИтогНочные = ИтогНочные + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.С = НайденнаяСтрокаП[0].Часов;
								ИтогСверхурочные = ИтогСверхурочные + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;	
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Праздники));
							КонецЕсли;	
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.П = НайденнаяСтрокаП[0].Часов;
								ИтогПраздничные = ИтогПраздничные + НайденнаяСтрокаП[0].Часов;
								Праздничные = НайденнаяСтрокаП[0].Часов;
								ПраздничныеДни = НайденнаяСтрокаП[0].Дней;//О.Т. 24.02.2015 № 366
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Вых = НайденнаяСтрокаП[0].Часов;
								ИтогВыходные = ИтогВыходные + НайденнаяСтрокаП[0].Часов;
								Выходные = НайденнаяСтрокаП[0].Часов;
								ВыходныеДни = НайденнаяСтрокаП[0].Дней;//О.Т. 24.02.2015 № 366
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								//заявка №2032 (база заявок Кристалла) Дмитрук О.Г.
								//Область.Параметры.К = НайденнаяСтрокаП[0].Дней;
								//ИтогКомандировка = ИтогКомандировка + НайденнаяСтрокаП[0].Дней;
								Область.Параметры.К = НайденнаяСтрокаП[0].Часов;
								ИтогКомандировка = ИтогКомандировка + НайденнаяСтрокаП[0].Часов;				
								//заявка №2032
							КонецЕсли;
							
							//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Ремонт));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								Область.Параметры.Р = НайденнаяСтрокаП[0].Часов;
								ЧасыРемонт = ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
								ДниРемонт = ДниРемонт + НайденнаяСтрокаП[0].Дней;//О.Т. 24.02.2015 № 366
								ИтогРемонт = ИтогРемонт + НайденнаяСтрокаП[0].Часов;
							КонецЕсли;
							//заявка №1664 
							
							
							
							
							
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
								Если НовыйМакет Тогда 
									НайденнаяСтрокаКомандировки = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
									Если НайденнаяСтрокаКомандировки.Количество()> 0 Тогда 
										ДниКомандировок = НайденнаяСтрокаКомандировки[0].Дней;
										Если НовыйМакет Тогда
											ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК;
										иначе
											ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].Часов;
										КонецЕсли;
									иначе
										ДниКомандировок = 0;
										ЧасыКомандировок = 0;
									КонецЕсли;
									
									НайденнаяСтрокаДниПеренос = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни));
									Если НайденнаяСтрокаДниПеренос.Количество()> 0 Тогда 
										ДниВыхПеренос = НайденнаяСтрокаДниПеренос[0].Дней;
										Если НовыйМакет Тогда
											ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].ЧасовК;
										иначе
											ЧасыВыхПеренос = НайденнаяСтрокаДниПеренос[0].Часов;
										КонецЕсли;
									иначе
										ДниВыхПеренос = 0;
										ЧасыВыхПеренос = 0;
									КонецЕсли;
									
									
								иначе
									ДниКомандировок = 0;
									ЧасыКомандировок = 0;
									ДниВыхПеренос = 0;
									ЧасыВыхПеренос = 0;
								КонецЕсли;
								
							иначе
								ДниКомандировок = 0;
								ЧасыКомандировок = 0;
								ДниВыхПеренос = 0;
								ЧасыВыхПеренос = 0;
							КонецЕсли;      			
							
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								//Область.Параметры.ЯЧ = НайденнаяСтрокаП[0].Часов;
								//ИтогЧасыФакт = ИтогЧасыФакт + НайденнаяСтрокаП[0].Часов;
								
								//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
									
									
									Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									Область.Параметры.ЯЧД = ДниФакт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогДниФакт = ИтогДниФакт + ДниРемонт + НайденнаяСтрокаП[0].Дней + Праздничные + Выходные + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									//заявка №1799
									//Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
									//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
								Иначе
									Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
								КонецЕсли;
								//заявка №1664
							иначе
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
									
									
									Область.Параметры.ЯЧ = ЧасыРемонт + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									Область.Параметры.ЯЧД = ДниФакт + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогДниФакт = ИтогДниФакт + ДниРемонт + Праздничные + Выходные + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									//заявка №1799
									//Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
									//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
								Иначе
									Область.Параметры.ЯЧ = ЧасыРемонт  + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
								КонецЕсли; 				
							КонецЕсли;
							
							
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							Иначе
								НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
							КонецЕсли;
							Если НайденнаяСтрокаП.Количество() <> 0 Тогда
								//Область.Параметры.ЯЧ = НайденнаяСтрокаП[0].Часов;
								//ИтогЧасыФакт = ИтогЧасыФакт + НайденнаяСтрокаП[0].Часов;
								
								//заявка №1664 (база заявок Кристалла) Дмитрук О.Г.
								Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
									//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
									Если НовыйМакет Тогда 
										НайденнаяСтрокаКомандировки = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Командировка));
										Если НайденнаяСтрокаКомандировки.Количество()> 0 Тогда 
											ДниКомандировок = НайденнаяСтрокаКомандировки[0].Дней;
											Если НовыйМакет Тогда
												ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].ЧасовК;
											иначе
												ЧасыКомандировок = НайденнаяСтрокаКомандировки[0].Часов;
											КонецЕсли;
										иначе
											ДниКомандировок = 0;
											ЧасыКомандировок = 0;
										КонецЕсли;
										
									иначе
										ДниКомандировок = 0;
										ЧасыКомандировок = 0;
									КонецЕсли;
									
									Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									Область.Параметры.ЯЧД = ДниФакт + НайденнаяСтрокаП[0].Дней + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогДниФакт = ИтогДниФакт + ДниРемонт + НайденнаяСтрокаП[0].Дней + Праздничные + Выходные + ФактИтогоСвРВДни + ДниКомандировок+ДниВыхПеренос;//О.Т. 24.02.2015 № 366
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов + Праздничные + Выходные + ФактИтогоСвРВ + ЧасыКомандировок+ЧасыВыхПеренос;//О.Т. 11.07.2014 № 115
									//заявка №1799
									//Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
									//ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов;
								Иначе
									Область.Параметры.ЯЧ = ЧасыРемонт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
									ИтогЧасыФакт = ИтогЧасыФакт + ЧасыРемонт + НайденнаяСтрокаП[0].Часов + ФактИтогоСвРВ;//О.Т. 11.07.2014 № 115
								КонецЕсли;
								//заявка №1664
							КонецЕсли;
							
							ДокументРезультат.Вывести(Область);
							
							Если НеявкиТЗ.Количество() > 0 Тогда   
								Для Каждого ТекСтр Из НеявкиТЗ Цикл
									//О.Т. 24.02.2015 № 366
									Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
										Область = мМакет.ПолучитьОбласть("Детали1|Область5");
									иначе
										Область = мМакет.ПолучитьОбласть("Детали|Область2");
									КонецЕсли;
									//О.Т. 24.02.2015 № 366
									
									Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
										НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, Тариф, ВидВремени", Выборка.Сотрудник, Выборка.Тариф, Текстр.Неявка.Ссылка));
									Иначе
										НайденнаяСтрокаП = ТаблицаОтрабВремяИтог.НайтиСтроки(Новый Структура("Сотрудник, ВидВремени", Выборка.Сотрудник, Текстр.Неявка.Ссылка));
									КонецЕсли;
									Если НайденнаяСтрокаП.Количество() <> 0 Тогда
										Область.Параметры.ДнНеявка = НайденнаяСтрокаП[0].Дней;
										
										НайденнаяСтрокаНеявки = НеявкиТЗ.НайтиСтроки(Новый Структура("Неявка", Текстр.Неявка.Ссылка));
										Если НайденнаяСтрокаНеявки.Количество() <> 0 Тогда
											НайденнаяСтрокаНеявки[0].Дней = НайденнаяСтрокаНеявки[0].Дней + НайденнаяСтрокаП[0].Дней;
										КонецЕсли;
									КонецЕсли;
									ДокументРезультат.Присоединить(Область);
									
								КонецЦикла;
							КонецЕсли;
							
							//О.Т. 24.02.2015 № 366
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								Область = мМакет.ПолучитьОбласть("Детали1|Область6");
							иначе
								Область = мМакет.ПолучитьОбласть("Детали|Область3");
							КонецЕсли;
							//О.Т. 24.02.2015 № 366
							
							ДокументРезультат.Присоединить(Область);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли; //Аверсон 12.02.2021 КВВ СВФР-007187 (иначе от категорий Бобруйска
				
				Если ПечатьНеявок = Ложь Тогда
					//Островская Татьяна 25.02.2014 № 17145
					если (Организация.ИНН = "800009185" или Организация.ИНН = "600124787" или Организация.ИНН = "500036445" или Организация.ИНН = "500826909") и НовыйМакет = Ложь Тогда //Аверсон ЕАЕ 06.06.2025 СВФР-015776 (Гроднооблгаз)
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							Область = мМакет.ПолучитьОбласть("Подвал3");
						иначе
							Область = мМакет.ПолучитьОбласть("Подвал1");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
					иначе
						//О.Т. 24.02.2015 № 366
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							Если Организация.ИНН = "806000046" и МакетИзДок = "ТабельНов" Тогда
								Область = мМакет.ПолучитьОбласть("Подвал2Страв");
								
								//Аверсон ЕАЕ 08.09.2025 СВФР-016595
								//ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, ДатаАктуальности);
								ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, Нач);
								//Аверсон СВФР-016595
								
								ЗаместительДиректораПоУправлениюПерсоналом = ОтветственныеЛица.РуководительКадровойСлужбы;
								ИнициалыЗаместительДиректораПоУправлениюПерсоналом = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ЗаместительДиректораПоУправлениюПерсоналом);
								//ДолжностьРуководитель = ОтветственныеЛица.РуководительДолжность;
								//Область.Параметры.ДолжностьОтв =ДолжностьРуководитель;
								Область.Параметры.Ответственный =ИнициалыЗаместительДиректораПоУправлениюПерсоналом; 
								
								//Аверсон 14.07.2022 КВВ СВФР-009298 (пункт 8) (
								ОтветственныйДолжность = СокрЛП(ОтветственныеЛица.РуководительКадровойСлужбыДолжность);
								Область.Параметры.ОтветственныйДолжность = ОтветственныйДолжность;
								//Аверсон 14.07.2022 КВВ СВФР-009298 (пункт 8) )
								
							иначе
								//Аверсон 12.02.2021 КВВ СВФР-007187 (
								Если Организация.ИНН = "700067572" Тогда
									
									//Аверсон 11.07.2021 КВВ СВФР-007813 (
									ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
									Если ЭтоТрансЦех Тогда
										Область = мМакет.ПолучитьОбласть("Подвал4Т");
									Иначе
										Область = мМакет.ПолучитьОбласть("Подвал4");
									КонецЕсли;
									//Аверсон 11.07.2021 КВВ СВФР-007813 )
									
									
									Если ТЗИтогиПоКатегориям.Количество() > 0 Тогда
										ТЗИтогиПоКатегориям.Свернуть("Категория","ИтогДниФакт,ИтогПраздничные,ИтогОтпуск,ИтогБольничные,ИтогБольничныеРод,ИтогСРА,ИтогСРЗ,ИтогДонор,ИтогУч,ИтогОтстр,ИтогТтариф,ИтогТтариф2,ИтогПрогулы,ИтогГД,ИтогКД,ИтогНП,ИтогРозыск,ИтогОЖ,ИтогПоСред,ИтогКомандировка,ИтогКомандировкаВых,ИтогЧасыФакт,ИтогПраздничныеЧ,ИтогНочные,ИтогСверхурочные,ИтогВсегоОтрабЧасов,ИтогВсегоОтрабДней, ИтогЧасыРемонт"); //Аверсон 08.06.2021 КВВ СВФР-007627 (ИтогКомандировкаВых)  //Аверсон 11.07.2021 КВВ СВФР-007813 (ИтогТтариф2,ИтогВсегоОтрабЧасов,ИтогВсегоОтрабДней) //ПСА 12.07.2021 (ИтогЧасыРемонт)
										Для Каждого СтрА ИЗ ТЗИтогиПоКатегориям Цикл
											Область.Параметры.ТекстПодвала = "По категории """ + СокрЛП(СтрА.Категория) + """"; 
											Область.Параметры.ИтогДниФакт	= СтрА.ИтогДниФакт;
											Область.Параметры.ИтогПраздничные= СтрА.ИтогПраздничные;	
											Область.Параметры.ИтогОтпуск	  = СтрА.ИтогОтпуск;
											Область.Параметры.ИтогБольничные	= СтрА.ИтогБольничные;
											Область.Параметры.ИтогБольничныеРод	 = СтрА.ИтогБольничныеРод;
											Область.Параметры.ИтогСРА	          = СтрА.ИтогСРА;
											Область.Параметры.ИтогСРЗ	         = СтрА.ИтогСРЗ;
											Область.Параметры.ИтогДонор	         = СтрА.ИтогДонор;
											Область.Параметры.ИтогУч	         = СтрА.ИтогУч;
											Область.Параметры.ИтогОтстр	         = СтрА.ИтогОтстр;
											Область.Параметры.ИтогТтариф	     = СтрА.ИтогТтариф;
											
											Область.Параметры.ИтогПрогулы	     = СтрА.ИтогПрогулы;
											Область.Параметры.ИтогГД	         = СтрА.ИтогГД;
											Область.Параметры.ИтогКД	         = СтрА.ИтогКД;
											Область.Параметры.ИтогНП	         = СтрА.ИтогНП;
											//Область.Параметры.ИтогРозыск	     = СтрА.ИтогРозыск;    //Аверсон 11.07.2021 КВВ СВФР-007813
											Область.Параметры.ИтогОЖ	    	 = СтрА.ИтогОЖ;
											Область.Параметры.ИтогПоСред	     = СтрА.ИтогПоСред;
											Область.Параметры.ИтогКомандировка	= СтрА.ИтогКомандировка;
											Область.Параметры.ИтогКомандировкаВых	= СтрА.ИтогКомандировкаВых; //Аверсон 08.06.2021 КВВ СВФР-007627
											Область.Параметры.ИтогЧасыФакт	    = СтрА.ИтогЧасыФакт;
											Область.Параметры.ИтогПраздничныеЧ	= СтрА.ИтогПраздничныеЧ;
											Область.Параметры.ИтогНочные	    = СтрА.ИтогНочные;
											Область.Параметры.ИтогСверхурочные  = СтрА.ИтогСверхурочные;
											//Аверсон 11.07.2021 КВВ СВФР-007813 (
											Область.Параметры.ИтогВсегоОтрабЧасов  = СтрА.ИтогВсегоОтрабЧасов;
											Область.Параметры.ИтогВсегоОтрабДней  = СтрА.ИтогВсегоОтрабДней;
											//ПСА 12.07.2021 СВФР-007845 +++
											//Область.Параметры.ИтогТтариф2	     = СтрА.ИтогТтариф2;
											Если ЭтоТрансЦех Тогда
												Область.Параметры.ИтогТтариф2	     = СтрА.ИтогТтариф2;
												Область.Параметры.ИтогЧасыРемонт = СтрА.ИтогЧасыРемонт;
											КонецЕсли;	
											//+++ПСА 12.07.2021 СВФР-007845
											//Аверсон 11.07.2021 КВВ СВФР-007813 )
											ДокументРезультат.Вывести(Область);
										КонецЦикла;
									КонецЕсли;
									
									//Аверсон 11.07.2021 КВВ СВФР-007813 (
									ЭтоТрансЦех = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),?(Найти(Нрег(ДокументТабель.ПодразделениеОрганизации.Наименование),"транспортный цех")=0,Ложь,Истина),Ложь);
									Если ЭтоТрансЦех Тогда
										Область = мМакет.ПолучитьОбласть("Подвал3Т");
									Иначе
										Область = мМакет.ПолучитьОбласть("Подвал3");
									КонецЕсли;
									//Аверсон 11.07.2021 КВВ СВФР-007813 )
									
									//Аверсон ЕАЕ 21.05.2024 СВФР-012907
									//Климовичи
								ИначеЕсли Организация.ИНН = "700103211" Тогда
									Область = мМакет.ПолучитьОбласть("Подвал5");	
									//Аверсон СВФР-012907
									
								Иначе
									//Аверсон 12.02.2021 КВВ СВФР-007187 )
									Область = мМакет.ПолучитьОбласть("Подвал2");
								КонецЕсли;
							КонецЕсли;
						иначе
							Область = мМакет.ПолучитьОбласть("Подвал");
						КонецЕсли;
						//О.Т. 24.02.2015 № 366
					КонецЕсли;
					
					//Аверсон 20.04.2020 КВВ СВФР-006308 (
					Если НЕ (Организация.ИНН = "806000046" и МакетИзДок = "ТабельНов") Тогда
						ПодписьДолжность = "Начальник участка";
						ПодписьФИО = "";
						Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
							ПоПодр = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),ДокументТабель.ПодразделениеОрганизации,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
						Иначе
							ПоПодр = ?(ЗначениеЗаполнено(Подразделение),Подразделение,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
						КонецЕсли;
						Если ЗначениеЗаполнено(ПоПодр) Тогда
							РезультатП = СформироватьЗапросПоОтветствЛицамПод(ПоПодр, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
							Пока РезультатП.Следующий() Цикл
								ПодписьФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(РезультатП.ФизическоеЛицо.Наименование);
								ПодписьДолжность = РезультатП.Должность.Наименование;
							КонецЦикла;
						КонецЕсли;             
						
						Если НЕ (Организация.ИНН = "700067572" И МакетИзДок = "ТабельНов" И ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации")) Тогда   //Аверсон 11.07.2021 КВВ СВФР-007813
							Если НЕ ((Организация.ИНН = "100010315" 
								ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
								И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь) Тогда  //Аверсон 15.12.2021 КВВ СВФР-008495
								Область.Параметры.ПодписьДолжность = ПодписьДолжность;
								Область.Параметры.ПодписьФИО = ПодписьФИО;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//Аверсон 20.04.2020 КВВ СВФР-006308 )
					
					
					//Островская Татьяна 25.02.2014 № 17145
				Иначе
					//О.Т. 24.02.2015 № 366
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область = мМакет.ПолучитьОбласть("Подвал1|Область4");
					иначе
						Область = мМакет.ПолучитьОбласть("Подвал|Область1");
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ДокументТабель) Тогда
					Область.Параметры.ТекстПодвала = "Всего по подразделению:";
				Иначе
					Если (ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации")) Тогда
						Область.Параметры.ТекстПодвала = "Всего по табелю:";
					Иначе
						Область.Параметры.ТекстПодвала = "Всего по наряду:";
					КонецЕсли;
				КонецЕсли;
				Область.Параметры.ИтогЧасыФакт = ИтогЧасыФакт;
				Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
					Область.Параметры.ИтогДниФакт = ИтогДниФакт;//О.Т. 24.02.2015 № 366
				КонецЕсли;
				
				//Аверсон 12.02.2021 КВВ СВФР-007187 (
				Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") И Организация.ИНН = "700067572" Тогда
					Область.Параметры.ИтогПраздничныеЧ = ИтогПраздничныеЧ;
					Область.Параметры.ИтогСРА = ИтогСРА;
					Область.Параметры.ИтогСРЗ = ИтогСРЗ;
					Область.Параметры.ИтогДонор = ИтогДонор;
					Область.Параметры.ИтогТтариф = ИтогТтариф;
					//Аверсон 11.07.2021 КВВ СВФР-007813 (
					//ПСА 12.07.2021 СВФР-007845 +++
					//Область.Параметры.ИтогТтариф2 = ИтогТтариф2;  
					Если ЭтоТрансЦех Тогда
						Область.Параметры.ИтогТтариф2 = ИтогТтариф2;  
					КонецЕсли;	
					//+++ПСА 12.07.2021 СВФР-007845
					
					Область.Параметры.ИтогВсегоОтрабЧасов = ИтогВсегоОтрабЧасов; 
					Область.Параметры.ИтогВсегоОтрабДней = ИтогВсегоОтрабДней; 
					//Аверсон 11.07.2021 КВВ СВФР-007813 )
					//ПСА 12.07.2021 СВФР-007845+++
					Если ЭтоТрансЦех Тогда
						Область.Параметры.ИтогЧасыРемонт = ИтогЧасыРемонт; 
					КонецЕсли;
					//+++ПСА 12.07.2021 СВФР-007845			
					
					Область.Параметры.ИтогГД = ИтогГД;
					Область.Параметры.ИтогКД = ИтогКД;
					Область.Параметры.ИтогНП = ИтогНП;
					//Область.Параметры.ИтогРозыск = ИтогРозыск;   //Аверсон 11.07.2021 КВВ СВФР-007813
					Область.Параметры.ИтогОЖ = ИтогОЖ;
					Область.Параметры.ИтогПоСред = ИтогПоСред;
					Область.Параметры.ИтогОтстр = ИтогОтстр;    
					Область.Параметры.ИтогКомандировкаВых = ИтогКомандировкаВых;//Аверсон 08.06.2021 КВВ СВФР-007627
				Иначе
					//Аверсон 12.02.2021 КВВ СВФР-007187 )
					Если НЕ ((Организация.ИНН = "100010315" 
						ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
						И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь) Тогда  //Аверсон 15.12.2021 КВВ СВФР-008495
						Область.Параметры.ИтогВчерние = ИтогВчерние;
						Область.Параметры.ИтогРемонт = ИтогРемонт;
						Область.Параметры.ИтогВыходные = ИтогВыходные;
					КонецЕсли;
				КонецЕсли;             
				Область.Параметры.ИтогКомандировка = ИтогКомандировка;
				Область.Параметры.ИтогНочные = ИтогНочные;
				Область.Параметры.ИтогСверхурочные = ИтогСверхурочные;
				Попытка
					Область.Параметры.ИтогПраздничные = ИтогПраздничные;
				Исключение
				КонецПопытки;
				
				//СВЭЙ 20.09.2023 КВВ СВФР-011482 (
				Попытка
					Область.Параметры.ИтогГосОб2 = ИтогГосОб2;
				Исключение
				КонецПопытки;
				
				Попытка
					Область.Параметры.ИтогПрогулы2 = ИтогПрогулы2;
				Исключение
				КонецПопытки;
				//СВЭЙ 20.09.2023 КВВ СВФР-011482 )
				
				Если ПечатьНеявок = Ложь Тогда
					//Аверсон 12.02.2021 КВВ СВФР-007187 (
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") И Организация.ИНН = "700067572" Тогда
						Область.Параметры.ИтогБольничныеРод = ИтогБольничныеРод;
						Область.Параметры.ИтогУч = ИтогУч;
						Область.Параметры.ИтогПрогулы  = ИтогПрогулы;
					Иначе
						//Аверсон 12.02.2021 КВВ СВФР-007187 )
						Область.Параметры.ИтогДОтпуск = ИтогДОтпуск; 
						Попытка
							Область.Параметры.ИтогЗаСвойСчет = ИтогЗаСвойСчет;//Островская Татьяна 25.02.2014 № 17145
						Исключение
						КонецПопытки;
					КонецЕсли;
					Область.Параметры.ИтогОтпуск = ИтогОтпуск;
					Область.Параметры.ИтогБольничные = ИтогБольничные;
				КонецЕсли;
				
				//Аверсон 15.12.2021 КВВ СВФР-008495 (
				Если (Организация.ИНН = "100010315"
					ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
					И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь Тогда  
					Область.Параметры.ИтогЧДеньДонора = ИтогЧДеньДонора;	
					Область.Параметры.ИтогЧМедОсмотр = ИтогЧМедОсмотр;	
					Область.Параметры.ИтогЧГосОбяз = ИтогЧГосОбяз;	
					Область.Параметры.ИтогЧОтстрОтРаб = ИтогЧОтстрОтРаб;	
					Область.Параметры.ИтогДнОтпускЗаСвойСчет = ИтогДнОтпускЗаСвойСчет;
					Область.Параметры.ИтогДнДеньМамы = ИтогДнДеньМамы;	
					Область.Параметры.ИтогДнУчОтпуск = ИтогДнУчОтпуск;	
					Область.Параметры.ИтогДнКурсыОбуч = ИтогДнКурсыОбуч;	
					Область.Параметры.ИтогДнПростой = ИтогДнПростой;	
					Область.Параметры.ИтогДнПрогул = ИтогДнПрогул;	
					Область.Параметры.ИтогДнСправка = ИтогДнСправка;
					Область.Параметры.ИтогЧПоСред = ИтогЧПоСред;
					Область.Параметры.ИтогЧПраздники = ИтогЧПраздники;
				КонецЕсли;
				//Аверсон 15.12.2021 КВВ СВФР-008495 )
				
				//Аверсон ЕАЕ 22.05.2024 СВФР-012907
				//Климовичи
				Если Организация.ИНН = "700103211" И МакетИзДок = "ТабельНов" И ПечатьНеявок = Ложь Тогда
					Область.Параметры.ИтогВыхД = ИтогоВыхВДнейОбщийИтог;
				КонецЕсли;
				//Аверсон СВФР-012907
				
				ДокументРезультат.Вывести(Область);
				
				//Аверсон 11.07.2021 КВВ СВФР-007813 (
				Если Организация.ИНН = "700067572" И МакетИзДок = "ТабельНов" И ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда   			
					Область = мМакет.ПолучитьОбласть("Подвал5");
					
					//Аверсон 27.08.2021 КВВ СВФР-007989 ( (пункт 1) (закомментировано)
					//ПодписьДолжность = "";
					//ПодписьФИО = "";
					//ПоПодр = ?(ЗначениеЗаполнено(ДокументТабель.ПодразделениеОрганизации),ДокументТабель.ПодразделениеОрганизации,Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
					//Если ЗначениеЗаполнено(ПоПодр) Тогда
					//	РезультатП = СформироватьЗапросПоОтветствЛицамПод(ПоПодр, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
					//	Пока РезультатП.Следующий() Цикл
					//		ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РезультатП.ФизическоеЛицо.Наименование);
					//		ПодписьДолжность = РезультатП.Должность.Наименование;
					//	КонецЦикла;
					//	Если ЗначениеЗаполнено(ПодписьДолжность) Тогда
					//		Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
					//		Область.Параметры.ПодписьФИО = ПодписьФИО;
					//		ДокументРезультат.Вывести(Область);
					//	КонецЕсли;
					//КонецЕсли;  
					//Аверсон 27.08.2021 КВВ СВФР-007989 )
					
					Если ЗначениеЗаполнено(ДокументТабель.ОтветственныйОТиЗ) Тогда
						ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.ОтветственныйОТиЗ.Физлицо.Наименование);
						ПодписьДолжность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.ОтветственныйОТиЗ)).Должность;
						
						Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
						Область.Параметры.ПодписьФИО = ПодписьФИО;
						
						ДокументРезультат.Вывести(Область);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ДокументТабель.Ответственный) И ЗначениеЗаполнено(ДокументТабель.Ответственный.Сотрудник) Тогда
						ПодписьФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ДокументТабель.Ответственный.Сотрудник.Физлицо.Наименование);
						ПодписьДолжность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДокументТабель.Дата,Новый Структура("Сотрудник",ДокументТабель.Ответственный.Сотрудник)).Должность;
						
						Область.Параметры.ПодписьДолжность = Врег(Лев(ПодписьДолжность,1)) + Сред(ПодписьДолжность,2);
						Область.Параметры.ПодписьФИО = ПодписьФИО;
						
						ДокументРезультат.Вывести(Область);
					КонецЕсли;			
				КонецЕсли;
				//Аверсон 11.07.2021 КВВ СВФР-007813 )
				
				Если ПечатьНеявок = Истина Тогда
					Если НеявкиТЗ.Количество() > 0 Тогда   
						Для Каждого ТекСтр Из НеявкиТЗ Цикл
							//О.Т. 24.02.2015 № 366
							Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
								Область = мМакет.ПолучитьОбласть("Подвал1|Область5");
							иначе
								Область = мМакет.ПолучитьОбласть("Подвал|Область2");
							КонецЕсли;
							//О.Т. 24.02.2015 № 366
							Область.Параметры.ИтогДнНеявка = Текстр.Дней;
							ДокументРезультат.Присоединить(Область);
							
						КонецЦикла;
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					Если ЗначениеЗаполнено(ДокументТабель) и ТипЗнч(ДокументТабель) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремениОрганизации") Тогда
						Область = мМакет.ПолучитьОбласть("Подвал1|Область6");
					иначе
						Область = мМакет.ПолучитьОбласть("Подвал|Область3");
					КонецЕсли;
					//О.Т. 24.02.2015 № 366
					ДокументРезультат.Присоединить(Область);		
				КонецЕсли;
				Если НовыйМакет Тогда 
					ДокументРезультат.ФиксацияСверху = 8;
					ДокументРезультат.ТолькоПросмотр	= Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Аверсон ЕАЕ 08.09.2025 СВФР-016595
			Нач = Кон + 1;
			
		КонецЦикла;
		//Аверсон СВФР-016595
		
	КонецПроцедуры
	
	Функция ПолучитьТекстЗапросаПоПоказатель1()
		//Аверсон 10.11.2020 КВВ СВФР-006805 ( (код вынесен отдельно) 
		Если Организация.ИНН = "806000046" Тогда 
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник.Код КАК Таб,
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	ВЫБОР
			|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет > 10
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет < 100
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель <> ЗНАЧЕНИЕ(справочник.ПодразделенияОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет / 10 КАК ЧИСЛО(10, 1))
			|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет > 100
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет < 1000
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель <> ЗНАЧЕНИЕ(справочник.ПодразделенияОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет / 100 КАК ЧИСЛО(10, 2))
			|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет > 1000
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет < 10000
			|			И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Родитель <> ЗНАЧЕНИЕ(справочник.ПодразделенияОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет / 1000 КАК ЧИСЛО(10, 3))
			|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет
			|	КОНЕЦ КАК ПодразделениеОрганизацииПриоритет,
			|	ВЫБОР
			|	КОГДА РаботникиОрганизацийСрезПоследних.Должность.Приоритет > 10
			|			И РаботникиОрганизацийСрезПоследних.Должность.Приоритет < 100
			|			И РаботникиОрганизацийСрезПоследних.Должность.Родитель <> ЗНАЧЕНИЕ(справочник.ДолжностиОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.Должность.Приоритет / 10 КАК ЧИСЛО(10, 1))
			|	КОГДА РаботникиОрганизацийСрезПоследних.Должность.Приоритет > 100
			|			И РаботникиОрганизацийСрезПоследних.Должность.Приоритет < 1000
			|			И РаботникиОрганизацийСрезПоследних.Должность.Родитель <> ЗНАЧЕНИЕ(справочник.ДолжностиОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.Должность.Приоритет / 100 КАК ЧИСЛО(10, 2))
			|	КОГДА РаботникиОрганизацийСрезПоследних.Должность.Приоритет > 1000
			|			И РаботникиОрганизацийСрезПоследних.Должность.Приоритет < 10000
			|			И РаботникиОрганизацийСрезПоследних.Должность.Родитель <> ЗНАЧЕНИЕ(справочник.ДолжностиОрганизаций.пустаяСсылка)
			|		ТОГДА ВЫРАЗИТЬ(РаботникиОрганизацийСрезПоследних.Должность.Приоритет / 1000 КАК ЧИСЛО(10, 3))
			|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность.Приоритет
			|	КОНЕЦ КАК ДолжностьПриоритет,    
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, ";
			Если ЗначениеЗаполнено(Подразделение) Тогда 
				ТекстЗапроса = ТекстЗапроса+" ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса+"
			|		) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонДата, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|			ПО (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник)
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник
			|ГДЕ
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &Ссылка
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник  //Аверсон 10.11.2020 КВВ СВФР-006805
			|
			|УПОРЯДОЧИТЬ ПО ПодразделениеОрганизацииПриоритет, ДолжностьПриоритет";
		иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник.Код КАК Таб,
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизацийСрезПоследних.Должность,";
			
			//Аверсон 12.02.2021 КВВ СВФР-007187 (
			Если Организация.ИНН = "700067572" Тогда
				ТекстЗапроса = ТекстЗапроса+"
				|	РаботникиОрганизацийСрезПоследних.Должность.Категория,
				|	РаботникиОрганизацийСрезПоследних.Должность.Категория.Код,
				|	РаботникиОрганизацийСрезПоследних.РазрядЕТС,";
			КонецЕсли;
			//Аверсон 12.02.2021 КВВ СВФР-007187 )
			
			ТекстЗапроса = ТекстЗапроса+"
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, ";
			Если ЗначениеЗаполнено(Подразделение) Тогда 
				ТекстЗапроса = ТекстЗапроса+" ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса+"
			|		) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонДата, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|			ПО (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник)
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник
			|ГДЕ
			|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &Ссылка
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	//И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник  //Аверсон 10.11.2020 КВВ СВФР-006805
			|
			|УПОРЯДОЧИТЬ ПО Таб";
			если не ДокументТабель.СпособСортировкиПечФормы Тогда 
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"УПОРЯДОЧИТЬ ПО Таб","УПОРЯДОЧИТЬ ПО ФИО");
			КонецЕсли;
		КонецЕсли;
		Возврат ТекстЗапроса;
		//Аверсон 10.11.2020 КВВ СВФР-006805 ) (код вынесен отдельно)
	КонецФункции
	
	Функция СформироватьЗапросПоОтветствЛицамПод(ВыбПодразделение, ВыбОтветственноеЛицо)
		//Аверсон 20.04.2020 КВВ СВФР-006308 (
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ВыбПодразделение);
		Запрос.УстановитьПараметр("ОтветственноеЛицо",ВыбОтветственноеЛицо);
		Запрос.УстановитьПараметр("Период",РабочаяДата);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат РезультатЗапроса;
		//Аверсон 20.04.2020 КВВ СВФР-006308 )
	КонецФункции
#КонецЕсли
