////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет перерасчет налога для указанного списка физлиц 
Процедура Рассчитать() Экспорт
	
	// Используем временную таблицу для исбежания моргания в форме документа
	ВременнаяТаблицаНДФЛ = РаботникиОрганизации.Выгрузить();
	ВременнаяТаблицаНДФЛ.Индексы.Добавить("Физлицо");
	ВременнаяТаблицаНДФЛ.Индексы.Добавить("ПериодДействия"); //О.Т. Аверсон 23.06.2017 № 762
	
	// Очистим имеющиеся данные
	ВременнаяТаблицаНДФЛ.ЗаполнитьЗначения(0,"НалогПоСтавке09,НалогПоСтавке13,НалогПоСтавке35,НалогПоСтавке9,НалогПоСтавке40,ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйВычетДополнительный,ПримененныйВычетМолодыеСпециалисты"); //Аверсон ЕАЕ 12.01.2024 СВФР-012095
	ВременнаяТаблицаНДФЛ.ЗаполнитьЗначения(Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),"ПодразделениеОрганизации");
	
	// определим месяц налогового периода, по который будем рассчитывать налог с начала года 						 
	Если Год(Дата) = НалоговыйПериод Тогда
		МесяцНалоговогоПериода = НачалоМесяца(Дата);
	Иначе	
		// последний месяц налогового периода
		МесяцНалоговогоПериода = Дата(НалоговыйПериод, 12, 31);
	КонецЕсли; 		
	
	// дата, по которую будем учитывать зарегистрированные доходы и начисленные налоги 
	ПериодРегистрации = Дата;
	
	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	//------------------------------------------------------------------------------------------------------
	// Расчет налога по ставке 13% (30% для нерезидентов)
	
	// Составим текст запроса для выбора списка физлиц, по которым надо считать НДФЛ
	СписокФизЛицТекст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.Физлицо
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &парамРегистратор";
	
	// получение результата НДФЛ по ставке 13 процентов
	// для него передается Организация, период и ссылка на регистратор
	
	ВыборкаПодразделений = "";
	ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(НачалоГода(МесяцНалоговогоПериода), МесяцНалоговогоПериода, МесяцНалоговогоПериода, Организация, ГоловнаяОрганизация, Ссылка, СписокФизлицТекст,,Истина,,ВыборкаПодразделений);
	
	СтруктураПоиска = Новый Структура("Физлицо,Период");
	
	// Перепишем данные расчета в табличную часть документа
	// Учитывая, что в выборке данные расчета отсортированы по месяцам налогового периода и все значения 
	// хранятся нарастающим итогом, то для каждого физлица просто возьмем данные за последний рассчитанный месяц  
	
	УжеИсчислили = 0;
	УжеПрименилиЛичный = 0;
	УжеПрименилиДетский = 0;
	УжеПрименилиДетскийИнвалидов = 0;
	ТекущееФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	ТекущийГод = 0;
	
	ЗаписьГода = Истина;
	
	Если ДанныеНДФЛ <> НеОпределено Тогда
		
		Пока ДанныеНДФЛ.Следующий() Цикл
			
			
			//МассивОсновные = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеНДФЛ.ФизЛицо));        
			//Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			//Для Каждого стрОстновные из МассивОсновные Цикл 
			//	Сотрудник = стрОстновные.Сотрудник;
			//КонецЦикла;
			Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ДанныеНДФЛ.ФизЛицо.Наименование);
			
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			
			ЗапросШкала = Новый Запрос;
			ЗапросШкала.Текст = "ВЫБРАТЬ
			|	ШкалаПодоходногоНалогаСрезПоследних.Налог
			|ИЗ
			|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(&КонецПериода, ) КАК ШкалаПодоходногоНалогаСрезПоследних
			|ГДЕ
			|	ШкалаПодоходногоНалогаСрезПоследних.Организация = &Организация
			|	И ШкалаПодоходногоНалогаСрезПоследних.ВидНалогообложения = &ВидНалогообложения
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШкалаПодоходногоНалогаСрезПоследних.НижнийПредел";
			ЗапросШкала.УстановитьПараметр("КонецПериода", ДанныеНДФЛ.Период);//О.Т. 09.01.2015 № 
			ЗапросШкала.УстановитьПараметр("Организация", Организация);
			ЗапросШкала.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			Шкала = ЗапросШкала.Выполнить().Выгрузить();
			если ЗаписьГода Тогда 
				ГодПредыдущий = ДанныеНДФЛ.период;
				ЗаписьГода = Ложь;
			КонецЕсли;
			//О.Т. Аверсон 31.03.2016 № 950
			ЗапросИндСтавкаНалогообл = Новый Запрос;
			ЗапросИндСтавкаНалогообл.Текст = 
			"ВЫБРАТЬ
			|	ИноеНалогообложениеПоСотрудникамСрезПоследних.НДФЛ
			|ИЗ
			|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ВидНалогообложения = &ВидНалогообложения
			|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
			
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ДанныеНДФЛ.Период);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", Сотрудник); 
			РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
			ЕстьИндивидСтавка = Ложь;
			СтавкаНДФЛИнд = 0;
			Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
				ЕстьИндивидСтавка = Истина;
				СтавкаНДФЛИнд = РезИндСтавкаНалогообл[0].НДФЛ;
			КонецЕсли;
			//О.Т. Аверсон 31.03.2016 № 950
			
			
			Если ТекущееФизлицо <> ДанныеНДФЛ.ФизЛицо ИЛИ ТекущийГод <> Год(ДанныеНДФЛ.Период) Тогда
				УжеИсчислили = 0;
				// уже примененные вычеты
				УжеПрименилиЛичный = 0;
				УжеПрименилиДетский = 0;
				УжеПрименилиДетскийЛьгота = 0;
				УжеПрименилиДополнительный = 0;
				
				//Аверсон ЕАЕ 12.01.2024 СВФР-012095
				УжеПрименилиМолодыеСпециалисты = 0;
				//Аверсон СВФР-012095
				
				//толик необходимо обнулять вычеты за каждый месяц иначе если дохода на вычет нет остается старое значение !!!				
				//ВычетыПримененные312ЗаМесяц = 0;
				//ВычетыПримененные311ЗаМесяц = 0;
				//ВычетыПримененные640СтрахЗаМесяц = 0;
				УжеПрименили312 = 0;
				УжеПрименили311 = 0;
				УжеПрименили640Страх = 0;
				УжеПрименили641Страх = 0; //СВЭЙ 18.12.2023 КВВ СВФР-011937
				// текущие физлицо и год периода
				ТекущееФизлицо = ДанныеНДФЛ.ФизЛицо;
				ТекущийГод = Год(ДанныеНДФЛ.Период);
			КонецЕсли;
			
			
			СтрокаТЗ = ВременнаяТаблицаНДФЛ.Найти(ДанныеНДФЛ.ФизЛицо, "ФизЛицо");
			Если СтрокаТЗ = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			//О.Т. Аверсон 23.06.2017 № 762
			Если СтрокаТЗ.ПериодДействия = Null тогда
				СтрокаТЗ.ПериодДействия = ДанныеНДФЛ.Период;
			КонецЕсли;
			СтрокаТЗ = ВременнаяТаблицаНДФЛ.НайтиСтроки(Новый Структура("ФизЛицо,ПериодДействия",ДанныеНДФЛ.ФизЛицо,ДанныеНДФЛ.Период));
			Если СтрокаТЗ.Количество()>0 Тогда
				СтрокаТЗ = СтрокаТЗ[0];
			иначе
				СтрокаТЗ = ВременнаяТаблицаНДФЛ.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЗ,ДанныеНДФЛ);
				СтрокаТЗ.ПериодДействия = ДанныеНДФЛ.Период;
			КонецЕсли;
			//О.Т. Аверсон 23.06.2017 № 762
			
			
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,ДанныеНДФЛ);
			
			ВыборкаПодразделений.Сбросить();
			Если ВыборкаПодразделений.НайтиСледующий(СтруктураПоиска) Тогда
				СтрокаТЗ.ПодразделениеОрганизации	= ВыборкаПодразделений.ПодразделениеОрганизации;
			КонецЕсли;
			//О.Т. Аверсон 04.04.2017 № 
			ВычетыПримененные312ЗаМесяц = 0;
			ВычетыПримененные311ЗаМесяц = 0;
			ВычетыПримененные640СтрахЗаМесяц = 0;
			//О.Т. Аверсон 04.04.2017 № 
			
			ВычетыПримененные641СтрахЗаМесяц = 0; //СВЭЙ 18.12.2023 КВВ СВФР-011937
			
			//Островская Татьяна 18.09.2013 № 16727
			//ЗапросДети = Новый Запрос;
			//ЗапросДети.Текст = 
			//"ВЫБРАТЬ
			//|	КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя
			//|ИЗ
			//|	(ВЫБРАТЬ
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения КАК ДатаРождения,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета КАК ДатаНачалаВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета КАК ДатаКонцаВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
			//|	ИЗ
			//|		Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
			//|	ГДЕ
			//|		РАЗНОСТЬДАТ(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения, &ДатаВычета, ГОД) < 18
			//|		И НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
			//|	
			//|	СГРУППИРОВАТЬ ПО
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя,
			//|		НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения) КАК ВложенныйЗапрос";
			//ЗапросДети.УстановитьПараметр("ДатаВычета",ДанныеНДФЛ.Период);
			//ЗапросДети.УстановитьПараметр("Физлицо",ДанныеНДФЛ.ФизЛицо);
			//РезДети = ЗапросДети.Выполнить().Выбрать();
			//если РезДети.Следующий() Тогда
			//	если РезДети.Имя > 0 Тогда 
			//		ВычетыПримененныеДетский = ДанныеНДФЛ.ПримененныеВычетыДетские*2;
			//	иначе
			//		ВычетыПримененныеДетский = ДанныеНДФЛ.ПримененныеВычетыДетские;
			//	КонецЕсли;
			//иначе
			ВычетыПримененныеДетский = (ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.РанееПримененныеВычетыДетские - УжеПрименилиДетский);
			//КонецЕсли;
			//Островская Татьяна 18.09.2013 № 16727
			
			
			
			ВычетыПримененныеЛичный = ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.РанееПримененныеВычетыЛичные - УжеПрименилиЛичный;
			ВычетыПримененныеДетскийЛьгота = ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота  - ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьгота  - УжеПрименилиДетскийЛьгота;
			ВычетыПримененныеДополнительный =  ДанныеНДФЛ.ПримененныеВычетыДополнительные - ДанныеНДФЛ.РанееПримененныеВычетыДополнительные - УжеПрименилиДополнительный;
			
			//Аверсон ЕАЕ 12.01.2024 СВФР-012095
			ВычетыПримененныеМолодыеСпециалисты =  ДанныеНДФЛ.ПримененныеВычетыМолодыеСпециалисты - ДанныеНДФЛ.РанееПримененныеВычетыМолодыеСпециалисты - УжеПрименилиМолодыеСпециалисты;
			//Аверсон СВФР-012095
			
			ДоходЗаПериодДляВычета = ДанныеНДФЛ.ДоходЗаПериод - (ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод + ДанныеНДФЛ.ПримененныеВычетыДетскиеЗаПериод  + ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьготаЗаПериод + ДанныеНДФЛ.ПримененныеВычетыДополнительныеЗаПериод + ДанныеНДФЛ.ПримененныеВычетыМолодыеСпециалистыЗаПериод); //Аверсон ЕАЕ 12.01.2024 СВФР-012095
			
			ОграничениеНДФЛ = РегистрыСведений.НДФЛРазмерВычетов.ПолучитьПоследнее(ДанныеНДФЛ.Период, Новый Структура("КодВычета",Справочники.ВычетыНДФЛ.Код640страх)).ОграничениеПоДоходам;
			
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
			Вычеты641СтрахОстаток = ДанныеНДФЛ.Вычет641СтрахОстаток - УжеПрименили641Страх;
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты641СтрахОстаток > ДоходЗаПериодДляВычета тогда
					Если ДоходЗаПериодДляВычета > ОграничениеНДФЛ тогда
						ВычетыПримененные641СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные641СтрахЗаМесяц = ДоходЗаПериодДляВычета;
					КонецЕсли;
				Иначе
					Если Вычеты641СтрахОстаток > ОграничениеНДФЛ тогда
						ВычетыПримененные641СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные641СтрахЗаМесяц = Вычеты641СтрахОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ДоходЗаПериодДляВычета = ДоходЗаПериодДляВычета - ВычетыПримененные641СтрахЗаМесяц;
			Если ДоходЗаПериодДляВычета < 0 Тогда
				ДоходЗаПериодДляВычета = 0;
			КонецЕсли;
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
			
			
			Вычеты640СтрахОстаток = ДанныеНДФЛ.Вычет640СтрахОстаток - УжеПрименили640Страх;
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты640СтрахОстаток > ДоходЗаПериодДляВычета тогда
					Если ДоходЗаПериодДляВычета > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = ДоходЗаПериодДляВычета;
					КонецЕсли;
				Иначе
					Если Вычеты640СтрахОстаток > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = Вычеты640СтрахОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//КонецЕсли;
			//Островская Татьяна 09.03.2014 № 17170
			
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
			ДоходЗаПериодДляВычета = ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц; 
			Если ДоходЗаПериодДляВычета < 0 Тогда
				ДоходЗаПериодДляВычета = 0;
			КонецЕсли;
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
			
			Вычеты312Остаток = ДанныеНДФЛ.Вычет312Остаток - УжеПрименили312;
			Если ДоходЗаПериодДляВычета > 0 тогда
				
				//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
				//Если  Вычеты312Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц тогда 				
				//ВычетыПримененные312ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц ; 
				Если Вычеты312Остаток <> 0 И Вычеты312Остаток > ДоходЗаПериодДляВычета Тогда 
					ВычетыПримененные312ЗаМесяц = ДоходЗаПериодДляВычета ;
					//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
					
				Иначе
					ВычетыПримененные312ЗаМесяц = Вычеты312Остаток;
				КонецЕсли;
			КонецЕсли;
			
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
			ДоходЗаПериодДляВычета = ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц; 
			Если ДоходЗаПериодДляВычета < 0 Тогда
				ДоходЗаПериодДляВычета = 0;
			КонецЕсли;
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
			
			//О.Т. Аверсон 23.08.2016 № 
			Если ДанныеНДФЛ.Период = Дата(2016,07,01) Тогда 
				УжеПрименили311 = ОбщегоНазначения.ОкруглитьЗначение2016(УжеПрименили311/10000,ПериодРегистрации);
			КонецЕсли;
			
			Вычеты311Остаток = ДанныеНДФЛ.Вычет311Остаток - УжеПрименили311;
			Если ДоходЗаПериодДляВычета > 0 тогда
				
				//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
				//Если  Вычеты311Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц тогда  
				//ВычетыПримененные311ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц; 
				Если Вычеты311Остаток <> 0 И Вычеты311Остаток > ДоходЗаПериодДляВычета  тогда 
					ВычетыПримененные311ЗаМесяц = ДоходЗаПериодДляВычета ;
					//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
					
				Иначе
					//если  Вычеты311Остаток = 0 Тогда 
					//	если Год(ДанныеНДФЛ.Период) <>  Год(ГодПредыдущий) Тогда 
					//		ВычетыПримененные311ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц;
					//	иначе
					//		
					//		ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
					//	КонецЕсли;
					//иначе
					ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
					//КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ГодПредыдущий = ДанныеНДФЛ.Период;
			//если ДанныеНДФЛ.Период = ПериодРегистрации Тогда //О.Т. 08.04.2015 убрано условие, не срабатывало. Не попадала сумма, сформированная в прошл.мес за тек.период
			//	ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц -  ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
			//Иначе 
			ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц;
			ВычетыПримененные312 = ВычетыПримененные312ЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц;
			ВычетыПримененные311 = ВычетыПримененные311ЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
			
			ВычетыПримененные640Страх = Мин(ВычетыПримененные640СтрахЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц,ОграничениеНДФЛ-ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц); //Островская Татьяна 11.03.2014 № 17170
			//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			УжеПрименили640Страх = УжеПрименили640Страх + ВычетыПримененные640СтрахЗаМесяц;
			//(конец) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			
			Если ДанныеНДФЛ.Период = Дата(2016,07,01) Тогда //О.Т.20160817
				если ОбщегоНазначения.ОкруглитьЗначение2016(УжеПрименили640Страх / 10000,ПериодРегистрации) >= ОграничениеНДФЛ Тогда 
					ВычетыПримененные640Страх = 0;
				КонецЕсли;
			иначе
				если УжеПрименили640Страх >= ОграничениеНДФЛ Тогда 
					ВычетыПримененные640Страх = 0;
				КонецЕсли;
			КонецЕсли;
			
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 (
			ВычетыПримененные641Страх = Мин(ВычетыПримененные641СтрахЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты641СтрахЗаМесяц,ОграничениеНДФЛ-ДанныеНДФЛ.РанееПримененныеВычеты641СтрахЗаМесяц); 
			УжеПрименили641Страх = УжеПрименили641Страх + ВычетыПримененные641СтрахЗаМесяц;
			
			Если УжеПрименили641Страх >= ОграничениеНДФЛ Тогда 
				ВычетыПримененные641Страх = 0;
			КонецЕсли;
			//СВЭЙ 18.12.2023 КВВ СВФР-011937 )
			
			//КонецЕсли;
			
			Если ДанныеНДФЛ.Резидент Тогда
				//О.Т. Аверсон 19.05.2016 № 1173 Подохдный считать по периодам, а не с накоплением за год
				//НалогИсчисленный = ((ДанныеНДФЛ.ДоходЗаГод - ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота - ДанныеНДФЛ.ПримененныеВычетыДополнительные - (ВычетыПримененные640СтрахЗаМесяц + УжеПрименили640Страх) - (ВычетыПримененные312ЗаМесяц + УжеПрименили312) - (ВычетыПримененные311Мес + УжеПрименили311))*?(ПериодРегистрации<Дата(2016,07,1),ОКР(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,2,0),ОбщегоНазначения.ОкруглитьЗначение2016(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,ПериодРегистрации,0)) - ДанныеНДФЛ.НалогРанееИсчисленный) - УжеИсчислили;//О.Т. Аверсон 15.03.2016 № 949
				Если ФлагБезПрошлогоПН = 1 Тогда
					НалогИсчисленный = -(ОбщегоНазначения.ОкруглитьПоВалюте((ВычетыПримененныеДетский+ ВычетыПримененныеДетскийЛьгота+ ВычетыПримененныеДополнительный + ВычетыПримененныеМолодыеСпециалисты + ВычетыПримененные311+ВычетыПримененные312+ВычетыПримененные640Страх+ВычетыПримененные641Страх)*?(ПериодРегистрации<Дата(2016,07,1),ОКР(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,2,0),?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100),Константы.ВалютаРегламентированногоУчета.Получить()) ); //СВЭЙ 18.12.2023 КВВ СВФР-011937 (ВычетыПримененные641Страх) //Аверсон ЕАЕ 12.01.2024 СВФР-012095
					СтрокаТЗ.Сотрудник = Сотрудник;
				Иначе
					НалогИсчисленный = (ОбщегоНазначения.ОкруглитьПоВалюте((ДанныеНДФЛ.ДоходЗаПериод - ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДетскиеЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьготаЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДополнительныеЗаПериод - ДанныеНДФЛ.ПримененныеВычетыМолодыеСпециалистыЗаПериод - ВычетыПримененные640СтрахЗаМесяц - ВычетыПримененные641СтрахЗаМесяц - ВычетыПримененные312ЗаМесяц - ВычетыПримененные311Мес)*?(ПериодРегистрации<Дата(2016,07,1),ОКР(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,2,0),?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100),Константы.ВалютаРегламентированногоУчета.Получить()) - ДанныеНДФЛ.НалогРанееИсчисленный); //СВЭЙ 18.12.2023 КВВ СВФР-011937 (ВычетыПримененные641СтрахЗаМесяц) //Аверсон ЕАЕ 12.01.2024 СВФР-012095
				КонецЕсли;
				//О.Т. Аверсон 19.05.2016 № 1173
				
				Если ДанныеНДФЛ.ДоходЗаПериод = ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод и ДанныеНДФЛ.ДоходЗаПериод <> 0 Тогда 
					Сообщить("Проверьте расчет подоходного!");
				КонецЕсли;
				
				//О.Т. Аверсон 25.05.2016 № 1187
				если ПериодРегистрации >= Дата(2016,07,01) Тогда 
					если ДанныеНДФЛ.Период < Дата(2016,07,01) и ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод = 0 и ДанныеНДФЛ.ПримененныеВычетыДетскиеЗаПериод = 0 и 
						ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьготаЗаПериод = 0 и  ДанныеНДФЛ.ПримененныеВычетыДополнительныеЗаПериод = 0 и ДанныеНДФЛ.ПримененныеВычетыМолодыеСпециалистыЗаПериод = 0 и  ВычетыПримененные640СтрахЗаМесяц = 0 и //Аверсон ЕАЕ 12.01.2024 СВФР-012095
						ВычетыПримененные312ЗаМесяц = 0 и  ВычетыПримененные311Мес = 0 Тогда
						НалогИсчисленный = 0;
					КонецЕсли;  					
				КонецЕсли;
				//О.Т. Аверсон 25.05.2016 № 1187
				
				//УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108 по периоду не отнимается предыдущие месяца
				НалогИсчисленный = ОбщегоНазначения.ОкруглитьПоВалюте(ОбщегоНазначения.ОкруглитьЗначение2016(НалогИсчисленный,ДанныеНДФЛ.Период),Константы.ВалютаРегламентированногоУчета.Получить());
				//заявка №1735 (база заявок Кристалла) Дмитрук О.Г.			
				//НалогИсчисленный = ?(НалогИсчисленный < 0,0,НалогИсчисленный);
				НалогИсчисленный = НалогИсчисленный;
				//заявка №1735						
			Иначе
				НалогИсчисленный = ДанныеНДФЛ.НалогИсчисленный;
				//О.Т. Аверсон 25.05.2016 № 1187
				если ПериодРегистрации >= Дата(2016,07,01) Тогда 
					если ДанныеНДФЛ.Период < Дата(2016,07,01) Тогда
						НалогИсчисленный = 0;
					КонецЕсли;  					
				КонецЕсли;
				//О.Т. Аверсон 25.05.2016 № 1187
				УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
			КонецЕсли;
			
			
			//Островская Татьяна 27.03.2014 № 17170
			
			// Запомним суммы для следующей итерации
			//УжеИсчислили = УжеИсчислили + НалогИсчисленный;
			УжеПрименилиЛичный = УжеПрименилиЛичный + ВычетыПримененныеЛичный;
			УжеПрименилиДетский = УжеПрименилиДетский + ВычетыПримененныеДетский;
			УжеПрименилиДетскийЛьгота = УжеПрименилиДетскийЛьгота + ВычетыПримененныеДетскийЛьгота;
			УжеПрименилиДополнительный = УжеПрименилиДополнительный + ВычетыПримененныеДополнительный;
			
			//Аверсон ЕАЕ 12.01.2024 СВФР-012095
			УжеПрименилиМолодыеСпециалисты = УжеПрименилиМолодыеСпециалисты + ВычетыПримененныеМолодыеСпециалисты;
			//Аверсон СВФР-012095
			
			УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
			УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311ЗаМесяц;
			
			
			СтрокаТЗ.НалогПоСтавке13   				= НалогИсчисленный;
			Если ФлагБезПрошлогоПН = 0 Тогда 
				СтрокаТЗ.ПримененныйВычетЛичный			= ВычетыПримененныеЛичный;
			КонецЕсли;
			СтрокаТЗ.ПримененныйВычетНаДетей			= ВычетыПримененныеДетский;//Островская Татьяна 19.09.2013 № 16727
			СтрокаТЗ.ПримененныйВычетНаДетейЛьгота	= ВычетыПримененныеДетскийЛьгота;
			СтрокаТЗ.ПримененныйВычетДополнительный	= ВычетыПримененныеДополнительный;
			
			//Аверсон ЕАЕ 12.01.2024 СВФР-012095
			СтрокаТЗ.ПримененныйВычетМолодыеСпециалисты	= ВычетыПримененныеМолодыеСпециалисты;
			//Аверсон СВФР-012095
			
			СтрокаТЗ.ПримененныйВычетИмущественныйРасход = ВычетыПримененные311;//О.Т. Аверсон 12.09.2017 № 1027
			
			СтрокаТЗ.ПримененныйВычетИмущественныйПроцентыПоКредитам = ВычетыПримененные312;//О.Т. Аверсон 27.06.2017 № 762
			
			//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			СтрокаТЗ.ПримененныйВычетСтраховойРасход = ВычетыПримененные640Страх;
			//(конец) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			
			СтрокаТЗ.ПримененныйВычетСтраховойРасход641 = ВычетыПримененные641Страх; //СВЭЙ 18.12.2023 КВВ СВФР-011937
		КонецЦикла;	
		
	КонецЕсли;
	
	//------------------------------------------------------------------------------------------------------
	// Расчет налогов по ставке 15, 20 и 40 %
	
	
	// Ранее расчитанные налоги
	РанееНачисленныеНалогиТекст = 
	"ВЫБРАТЬ
	|	РасчетыСБюджетом.ФизЛицо,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке9,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке09,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке35,
	|	Сумма(ВЫБОР КОГДА РасчетыСБюджетом.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА РасчетыСБюджетом.Налог ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке40,
	|	РасчетыСБюджетом.МесяцНалоговогоПериода как Период
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК РасчетыСБюджетом
	|
	|ГДЕ
	|	РасчетыСБюджетом.Организация = &парамГоловнаяОрганизация И
	//|	РасчетыСБюджетом.Период <= &парамПериодРегистрации И //О.Т. Аверсон 23.06.2017 № 762
	|	(РасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаНалоговогоПериода ИЛИ РасчетыСБюджетом.МесяцНалоговогоПериода = &парамКонецМесяцаНалоговогоПериода) И
	|	РасчетыСБюджетом.Регистратор <> &парамРегистратор И
	|	РасчетыСБюджетом.ВидДвижения = &парамВидДвиженияПриход И
	|	РасчетыСБюджетом.ФизЛицо В(" + СписокФизЛицТекст + ") И
	|	РасчетыСБюджетом.ВидСтроки = &парамВидСтрокиНачисление
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСБюджетом.ФизЛицо,
	|	РасчетыСБюджетом.МесяцНалоговогоПериода";
	
	// Составим текст запроса для выбора списка физлиц, по которым надо считать НДФЛ (исключим нерезидентов)
	СписокФизлицРезидентовТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.ФизЛицо
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамКонецГода) КАК НеРезиденты
	|		ПО НеРезиденты.ФизЛицо = ТЧРаботникиОрганизации.ФизЛицо
	|
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &парамРегистратор И
	|	(((НеРезиденты.ФизЛицо) ЕСТЬ NULL ) ИЛИ ((НеРезиденты.Страна)=&Беларусь))";
	
	// НачислениеНалоговТекст
	НачислениеНалоговТекст = 
	"ВЫБРАТЬ
	|	НДФЛОбороты.ФизЛицо КАК ФизЛицо,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка9 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента9/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке9,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка09 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента09/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке09,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка35 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента35/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке35,
	|	Сумма(ВЫБОР КОГДА КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка40 ТОГДА (НДФЛОбороты.СуммаДоходаОборот-НДФЛОбороты.СуммаВычетаОборот)*&парамСтавкаРезидента40/100 ИНАЧЕ 0 КОНЕЦ) КАК НалогПоСтавке40,
	|	НДФЛОбороты.ПериодРегистрации КАК Период
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах.Обороты(&парамНачалоГода, &парамКонецМесяцаНалоговогоПериода, Месяц, ПериодРегистрации <= &парамПериодРегистрации И Организация = &парамГоловнаяОрганизация И ВЫБОР КОГДА Физлицо В (" + СписокФизлицРезидентовТекст + ") ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК НДФЛОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛОбороты.ФизЛицо,
	|	НДФЛОбороты.ПериодРегистрации";
	
	// Объединение запросов
	НалогиТекст = 
	"ВЫБРАТЬ
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.ФизЛицо ИНАЧЕ РанееНачислено.ФизЛицо КОНЕЦ КАК ФизЛицо,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке9 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке9 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке9,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке09 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке09 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке09,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке35,
	|	ВЫБОР КОГДА НЕ НачисленныеНалоги.ФизЛицо ЕСТЬ NULL ТОГДА НачисленныеНалоги.НалогПоСтавке40 ИНАЧЕ 0 КОНЕЦ - ВЫБОР КОГДА НЕ РанееНачислено.ФизЛицо ЕСТЬ NULL ТОГДА РанееНачислено.НалогПоСтавке35 ИНАЧЕ 0 КОНЕЦ КАК НалогПоСтавке40,
	|	НачисленныеНалоги.Период
	| ИЗ (" + НачислениеНалоговТекст + ") КАК НачисленныеНалоги
	|   ПОЛНОЕ СОЕДИНЕНИЕ (" +РанееНачисленныеНалогиТекст + ") КАК РанееНачислено
	|	ПО РанееНачислено.ФизЛицо = НачисленныеНалоги.ФизЛицо
	|	И (РанееНачислено.Период = НачисленныеНалоги.Период)//О.Т. Аверсон 23.06.2017 № 762
	|";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Беларусь", Справочники.КлассификаторСтранМира.БЕЛАРУСЬ);
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамСтавка9", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9);
	Запрос.УстановитьПараметр("парамСтавка09", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
	Запрос.УстановитьПараметр("парамСтавка35", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	Запрос.УстановитьПараметр("парамСтавка40", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40);
	Запрос.УстановитьПараметр("парамСтавкаРезидента9", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9));
	Запрос.УстановитьПараметр("парамСтавкаРезидента09", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09));
	Запрос.УстановитьПараметр("парамСтавкаРезидента35", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35));
	Запрос.УстановитьПараметр("парамСтавкаРезидента40", ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40));
	
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамКонецМесяцаНалоговогоПериода", КонецМесяца(МесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(МесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(МесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("парамВидСтрокиНачисление", Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
	Запрос.УстановитьПараметр("парамВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	Запрос.Текст = НалогиТекст;
	
	ДанныеНДФЛ = Запрос.Выполнить().Выбрать();
	
	Пока ДанныеНДФЛ.Следующий() Цикл
		
		Строка = ВременнаяТаблицаНДФЛ.НайтиСтроки(Новый Структура("ФизЛицо,ПериодДействия", ДанныеНДФЛ.ФизЛицо,ДанныеНДФЛ.Период));
		
		Если Строка.Количество()=0 Тогда
			Продолжить;
		иначе
			Строка = Строка[0];
		КонецЕсли;	
		
		Строка.НалогПоСтавке9   			= ДанныеНДФЛ.НалогПоСтавке9;
		Строка.НалогПоСтавке09   			= ДанныеНДФЛ.НалогПоСтавке09;
		Строка.НалогПоСтавке35				= ДанныеНДФЛ.НалогПоСтавке35;
		Строка.НалогПоСтавке40				= ДанныеНДФЛ.НалогПоСтавке40;
		
	КонецЦикла;	
	
	
	// Загружаем результаты расчета
	РаботникиОрганизации.Очистить();	
	Для Каждого стр из ВременнаяТаблицаНДФЛ Цикл 
		Если не (стр.НалогПоСтавке13 =0 и стр.ПримененныйВычетЛичный =0 и стр.ПримененныйВычетНаДетей =0 и стр.ПримененныйВычетНаДетейЛьгота =0 и стр.ПримененныйВычетДополнительный =0 и стр.ПримененныйВычетМолодыеСпециалисты =0 и стр.ПримененныйВычетИмущественныйРасход =0 и стр.НалогПоСтавке9 =0 и стр.НалогПоСтавке09 =0 и стр.НалогПоСтавке13 =0 и //Аверсон ЕАЕ 12.01.2024 СВФР-012095
			//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			стр.ПримененныйВычетИмущественныйПроцентыПоКредитам = 0 
			и стр.ПримененныйВычетСтраховойРасход = 0 
			//(конец) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
			и стр.ПримененныйВычетСтраховойРасход641 = 0 //СВЭЙ 18.12.2023 КВВ СВФР-011937
			и стр.НалогПоСтавке35 =0 и стр.НалогПоСтавке40 =0) Тогда 
			
			//Аверсон ЕАЕ 12.10.2017
			Если Стр.ПериодДействия <= '20160630235959' И Дата > '20160630235959' Тогда
				Стр.НалогПоСтавке09 = Стр.НалогПоСтавке09 / 10000;
				Стр.НалогПоСтавке13 = Стр.НалогПоСтавке13 / 10000;
				Стр.НалогПоСтавке35 = Стр.НалогПоСтавке35 / 10000;
				Стр.ПримененныйВычетНаДетейИнвалидов = Стр.ПримененныйВычетНаДетейИнвалидов / 10000;
				Стр.ПримененныйВычетИмущественныйРасход = Стр.ПримененныйВычетИмущественныйРасход / 10000;
				Стр.ПримененныйВычетИмущественныйПроцентыПоКредитам = Стр.ПримененныйВычетИмущественныйПроцентыПоКредитам / 10000;
				//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
				Стр.ПримененныйВычетСтраховойРасход = Стр.ПримененныйВычетСтраховойРасход / 10000;
				//(конец) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
				Стр.ПримененныйВычетЛичный = Стр.ПримененныйВычетЛичный / 10000;
				Стр.ПримененныйВычетНаДетей = Стр.ПримененныйВычетНаДетей / 10000;
				Стр.НалогПоСтавке9 = Стр.НалогПоСтавке9 / 10000;
				Стр.НалогПоСтавке40 = Стр.НалогПоСтавке40 / 10000;
				Стр.ПримененныйВычетДополнительный = Стр.ПримененныйВычетДополнительный / 10000;
				
				//Аверсон ЕАЕ 12.01.2024 СВФР-012095
				Стр.ПримененныйВычетМолодыеСпециалисты = Стр.ПримененныйВычетМолодыеСпециалисты / 10000;
				//Аверсон СВФР-012095
				
				Стр.ПримененныйВычетНаДетейЛьгота = Стр.ПримененныйВычетНаДетейЛьгота / 10000;
			КонецЕсли;
			//Аверсон
			
			СтрРаботникиОрганизации = РаботникиОрганизации.Добавить();
			ЗаполнитьЗначенияСвойств(СтрРаботникиОрганизации,стр);
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация" , Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НДФЛПерерасчет.Дата,
	|	НДФЛПерерасчет.Ссылка,
	|	НДФЛПерерасчет.НалоговыйПериод,
	|	НДФЛПерерасчет.ПериодВзаиморасчетов,
	|	НДФЛПерерасчет.Организация,
	|	НДФЛПерерасчет.Ответственный,
	|	ВЫБОР КОГДА НДФЛПерерасчет.Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА НДФЛПерерасчет.Организация ИНАЧЕ НДФЛПерерасчет.Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация
	|ИЗ
	|	Документ.НДФЛПерерасчет КАК НДФЛПерерасчет
	|
	|ГДЕ
	|	НДФЛПерерасчет.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части документам
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧРаботникиОрганизации.НомерСтроки,
	|	ТЧРаботникиОрганизации.ФизЛицо,
	|	ТЧРаботникиОрганизации.НалогПоСтавке09,
	|	ТЧРаботникиОрганизации.НалогПоСтавке13,
	|	ТЧРаботникиОрганизации.НалогПоСтавке35,
	|	ТЧРаботникиОрганизации.НалогПоСтавке9,
	|	ТЧРаботникиОрганизации.НалогПоСтавке40,
	|	ТЧРаботникиОрганизации.ПримененныйВычетЛичный,
	|	ТЧРаботникиОрганизации.ПримененныйВычетНаДетей,
	|	ТЧРаботникиОрганизации.ПримененныйВычетНаДетейЛьгота,
	|	ТЧРаботникиОрганизации.ПримененныйВычетИмущественныйРасход,
	|	ТЧРаботникиОрганизации.ПримененныйВычетИмущественныйПроцентыПоКредитам,
	//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
	|	ТЧРаботникиОрганизации.ПримененныйВычетСтраховойРасход,
	//(конец) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
	|	ТЧРаботникиОрганизации.ПримененныйВычетДополнительный,
	|	ТЧРаботникиОрганизации.ПримененныйВычетСтраховойРасход641,
	//Аверсон ЕАЕ 12.01.2024 СВФР-012095
	|	ТЧРаботникиОрганизации.ПримененныйВычетМолодыеСпециалисты,
	//Аверсон СВФР-012095
	
	|	ТЧРаботникиОрганизации.ПериодДействия, //О.Т. Аверсон 23.06.2017 № 762
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации //О.Т. Аверсон 05.04.2019
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос для расчета сумм НДФЛ к зачету
//
// Параметры: 
//	нет
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНДФЛКЗачету()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодВзаиморасчетов);
	Запрос.УстановитьПараметр("Ставка13", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
	Запрос.УстановитьПараметр("Ставка09", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
	Запрос.УстановитьПараметр("Ставка35", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке13) КАК Налог,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток, 0) > ВЫБОР
	|				КОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13) > 0
	|					ТОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13)
	|		ИНАЧЕ ЕСТЬNULL(НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток, 0)
	|	КОНЕЦ КАК НДФЛКЗачетуУчтено,
	|	СтрокиНДФЛ.ФизЛицо,
	|	&Ставка13 КАК Ставка
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛКЗачету.Остатки(
	|		&ПериодРегистрации,
	|		Физлицо В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					НДФЛПерерасчетРаботникиОрганизации.ФизЛицо
	|				ИЗ
	|					Документ.НДФЛПерерасчет.РаботникиОрганизации КАК НДФЛПерерасчетРаботникиОрганизации
	|				ГДЕ
	|					НДФЛПерерасчетРаботникиОрганизации.Ссылка = &ДокументСсылка)
	|			И Организация = &Организация) КАК НДФЛКЗачету
	|		ПО НДФЛКЗачету.ФизЛицо = СтрокиНДФЛ.ФизЛицо
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо,
	|	НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СтрокиНДФЛ.НалогПоСтавке13) < 0
	|		ИЛИ ВЫБОР
	|			КОГДА ЕСТЬNULL(НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток, 0) > ВЫБОР
	|					КОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13) > 0
	|						ТОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|				ТОГДА СУММА(СтрокиНДФЛ.НалогПоСтавке13)
	|			ИНАЧЕ ЕСТЬNULL(НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток, 0)
	|		КОНЕЦ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке09),
	|	0,
	|	СтрокиНДФЛ.ФизЛицо,
	|	&Ставка09
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке9),
	|	0,
	|	СтрокиНДФЛ.ФизЛицо,
	|	&Ставка09
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке40),
	|	0,
	|	СтрокиНДФЛ.ФизЛицо,
	|	&Ставка09
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке35),
	|	0,
	|	СтрокиНДФЛ.ФизЛицо,
	|	&Ставка35
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНДФЛКЗачету

Функция СформироватьЗапросПоНДФЛудержанный()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодВзаиморасчетов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке13) КАК Налог,
	|	СтрокиНДФЛ.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	Документ.НДФЛПерерасчет.РаботникиОрганизации КАК СтрокиНДФЛ
	|ГДЕ
	|	СтрокиНДФЛ.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиНДФЛ.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтрокиНДФЛ.НалогПоСтавке13) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНДФЛудержанный()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 		 - флаг отказа в проведении,
//	Заголовок	 - Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.НалоговыйПериод) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан налоговый период, за который выполняется перерасчет налога!", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодВзаиморасчетов) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан месяц, в котором следует отразить расчеты с работниками!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строки документа.
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоРаботникиОрганизации, Отказ, Заголовок)
	
	НачалоСообщения = "В строке № """+ СокрЛП(ВыборкаПоРаботникиОрганизации.НомерСтроки) +
	""" табл. части ""РаботникиОрганизации"": ";
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НачалоСообщения + "не указано физическое лицо!", Отказ, Заголовок);
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.НалогПоСтавке09 + ВыборкаПоРаботникиОрганизации.НалогПоСтавке13 + ВыборкаПоРаботникиОрганизации.НалогПоСтавке35 
	//	+ ВыборкаПоРаботникиОрганизации.ПримененныйВычетЛичный + ВыборкаПоРаботникиОрганизации.ПримененныйВычетНаДетей + ВыборкаПоРаботникиОрганизации.ПримененныйВычетНаДетейЛьгота
	//	+ ВыборкаПоРаботникиОрганизации.ПримененныйВычетИмущественныйРасход + ВыборкаПоРаботникиОрганизации.ПримененныйВычетИмущественныйПроцентыПоКредитам
	//	+ ВыборкаПоРаботникиОрганизации.ПримененныйВычетСтраховойРасход // добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
	//	+ ВыборкаПоРаботникиОрганизации.ПримененныйВычетСтраховойРасход641 //СВЭЙ 18.12.2023 КВВ СВФР-011937
	//	) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке(НачалоСообщения + "не указаны суммы перерасчета налога!", Отказ, Заголовок);
	//КонецЕсли;  //проводить документ с нулями
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Создает и заполняет структуру, содержащую имена регистров накопления
// документа. В дальнейшем движения заносятся только по тем регистрам накопления, для которых в 
// данной процедуре заданы ключи.
//
// Параметры: 
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                 накопления по которым надо проводить документ
//
// Возвращаемое значение:
//  Нет.
//
// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УпрощенныйУчетНДФЛ, УчетЗадолженностиПоМесяцам) 
	
	// Перерасчет - начисление налога
	
	Если Год(ВыборкаПоШапкеДокумента.Дата) > ВыборкаПоШапкеДокумента.НалоговыйПериод Тогда
		МесяцНалоговогоПериода = Дата(ВыборкаПоШапкеДокумента.НалоговыйПериод, 12, 1);
	Иначе	
		МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	КонецЕсли; 
	
	Если ВыборкаПоТЧ.НалогПоСтавке09 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
		// Ресурсы
		Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке09; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты			= Истина;
		Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации; //О.Т. Аверсон 05.04.2019
		
	КонецЕсли;
	
	Если (ВыборкаПоТЧ.НалогПоСтавке13 <> 0) Или (ВыборкаПоТЧ.ПримененныйВычетЛичный <> 0) Или (ВыборкаПоТЧ.ПримененныйВычетНаДетей <> 0) Или (ВыборкаПоТЧ.ПримененныйВычетНаДетейЛьгота <> 0) Или (ВыборкаПоТЧ.ПримененныйВычетДополнительный <> 0) Или (ВыборкаПоТЧ.ПримененныйВычетМолодыеСпециалисты <> 0) Тогда //Аверсон ЕАЕ 12.01.2024 СВФР-012095
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
		Движение.МесяцНалоговогоПериода      	= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке13; 
		Движение.ПримененныйВычетЛичный			= ВыборкаПоТЧ.ПримененныйВычетЛичный; 
		Движение.ПримененныйВычетНаДетей		= ВыборкаПоТЧ.ПримененныйВычетНаДетей; 
		Движение.ПримененныйВычетНаДетейЛьгота= ВыборкаПоТЧ.ПримененныйВычетНаДетейЛьгота; 
		Движение.ПримененныйДополнительныйВычет= ВыборкаПоТЧ.ПримененныйВычетДополнительный;
		
		//Аверсон ЕАЕ 12.01.2024 СВФР-012095
		Движение.ПримененныйВычетМолодыеСпециалисты = ВыборкаПоТЧ.ПримененныйВычетМолодыеСпециалисты;
		//Аверсон СВФР-012095
		
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты			= Истина;
		Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
	КонецЕсли;
	
	Если ВыборкаПоТЧ.НалогПоСтавке35 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
		// Ресурсы
		Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке35; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты			= Истина;
		Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации; //О.Т. Аверсон 05.04.2019
	КонецЕсли;
	
	Если ВыборкаПоТЧ.НалогПоСтавке9 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
		// Ресурсы
		Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке9; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты			= Истина;
		Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
	КонецЕсли;
	
	Если ВыборкаПоТЧ.НалогПоСтавке40 <> 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40;
		Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
		// Ресурсы
		Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке40; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление;
		Движение.ИсчисленоИзЗарплаты			= Истина;
		Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации; //О.Т. Аверсон 05.04.2019
	КонецЕсли;
	
	// имущественные вычеты
	Если ВыборкаПоТЧ.ПримененныйВычетИмущественныйРасход <> 0 Тогда 
		Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;  
		Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.Год							= ВыборкаПоШапкеДокумента.НалоговыйПериод;
		Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код650;
		
		// Ресурсы
		Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетИмущественныйРасход; 
		Если ФлагПроверкаНаВычет Тогда  
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
			
			// Свойства
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;  
			Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.Год							= Год(ВыборкаПоТЧ.ПериодДействия);
			Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код650;
			
			// Ресурсы
			Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетИмущественныйРасход; 
			
		КонецЕсли;
	КонецЕсли;
	
	//(начало) добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
	Если ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход <> 0 Тогда 
		Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.Год							= ВыборкаПоШапкеДокумента.НалоговыйПериод;
		Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код640Страх;
		
		// Ресурсы
		Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход; 
		Если ФлагПроверкаНаВычет Тогда 
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			
			Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
			
			// Свойства
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;  
			Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.Год							= Год(ВыборкаПоТЧ.ПериодДействия);
			Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код640Страх;
			
			// Ресурсы
			Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход; 
			
		КонецЕсли;
		
	КонецЕсли;
	//(конец)  добавлено Кухарчуком Д.Я. 13.12.18, задача СВФР-002929
	Если ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход641 <> 0 Тогда 
		Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.Год							= ВыборкаПоШапкеДокумента.НалоговыйПериод;
		Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код641Страх;
		
		// Ресурсы
		Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход641; 
		Если ФлагПроверкаНаВычет Тогда 
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			
			Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
			
			// Свойства
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;  
			Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.Год							= Год(ВыборкаПоТЧ.ПериодДействия);
			Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код641Страх;
			
			// Ресурсы
			Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетСтраховойРасход641; 
			
		КонецЕсли;
		
	КонецЕсли;
	Если ВыборкаПоТЧ.ПримененныйВычетИмущественныйПроцентыПоКредитам <> 0 Тогда
		
		Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация; 
		Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.Год							= ВыборкаПоШапкеДокумента.НалоговыйПериод;
		Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код640;
		
		// Ресурсы
		Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетИмущественныйПроцентыПоКредитам; 
		Если ФлагПроверкаНаВычет Тогда  
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			
			Движение = Движения.НДФЛИмущественныеВычетыФизлиц.Добавить();
			
			// Свойства
			Движение.Период							= ВыборкаПоТЧ.ПериодДействия;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ФизЛицо	 	 	 			= ВыборкаПоТЧ.ФизЛицо;
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;  
			Движение.ОбособленноеПодразделение	    = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.Год							= Год(ВыборкаПоТЧ.ПериодДействия);
			Движение.КодВычетаИмущественный			= Справочники.ВычетыНДФЛ.Код640;
			
			// Ресурсы
			Движение.Размер							= ВыборкаПоТЧ.ПримененныйВычетИмущественныйПроцентыПоКредитам; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	// сразу же, не дожидаясь выплаты, регистрируем факт удержания налога по ставкам 9 и 35%
	Если УпрощенныйУчетНДФЛ Тогда 
		
		Если ВыборкаПоТЧ.НалогПоСтавке09 <> 0 Тогда
			Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
			// Свойства
			Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09;
			Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
			// Ресурсы
			Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке09; 
			// Реквизиты
			Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание;
			Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
			
		КонецЕсли;
		
		Если ВыборкаПоТЧ.НалогПоСтавке9 <> 0 Тогда
			Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
			// Свойства
			Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9;
			Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
			// Ресурсы
			Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке9; 
			// Реквизиты
			Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание;
			Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
			
		КонецЕсли;
		
		Если ВыборкаПоТЧ.НалогПоСтавке40 <> 0 Тогда
			Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
			// Свойства
			Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40;
			Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
			// Ресурсы
			Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке40; 
			// Реквизиты
			Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание;
			Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
		КонецЕсли;
		
		Если ВыборкаПоТЧ.НалогПоСтавке35 <> 0 Тогда
			Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
			// Свойства
			Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35;
			Движение.МесяцНалоговогоПериода 		= ВыборкаПоТЧ.ПериодДействия;//О.Т. Аверсон 23.06.2017 № 762 //МесяцНалоговогоПериода;;
			// Ресурсы
			Движение.Налог							= ВыборкаПоТЧ.НалогПоСтавке35; 
			// Реквизиты
			Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание;
			Движение.ПодразделениеОрганизации		= ВыборкаПоТЧ.ПодразделениеОрганизации;//О.Т. Аверсон 05.04.2019
		КонецЕсли;
		
	КонецЕсли;
	
	// регистрация перерасчета во взаиморасчетах с работниками
	
	Если НЕ НеФормироватьВзаиморасчеты Тогда //СВЭЙ 21.12.2024 КВВ СВФР-012330
		
		Если ВыборкаПоТЧ.НалогПоСтавке09 <> 0 Тогда
			Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
			// Свойства
			Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Если УчетЗадолженностиПоМесяцам Тогда
				Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.ПериодВзаиморасчетов;
			КонецЕсли;
			
			// Ресурсы
			Движение.СуммаВзаиморасчетов			= - ВыборкаПоТЧ.НалогПоСтавке09; 
		КонецЕсли;
		
		Если ВыборкаПоТЧ.НалогПоСтавке13 <> 0 Тогда
			Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
			// Свойства
			Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Если УчетЗадолженностиПоМесяцам Тогда
				Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.ПериодВзаиморасчетов;
			КонецЕсли;
			
			// Ресурсы
			Движение.СуммаВзаиморасчетов			= - ВыборкаПоТЧ.НалогПоСтавке13; 
		КонецЕсли;
		
		Если ВыборкаПоТЧ.НалогПоСтавке35 <> 0 Тогда
			Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
			// Свойства
			Движение.Период           				= ВыборкаПоШапкеДокумента.Дата;
			Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
			// Измерения
			Движение.Организация					= ВыборкаПоШапкеДокумента.Организация;
			Движение.ФизЛицо                		= ВыборкаПоТЧ.ФизЛицо;
			Если УчетЗадолженностиПоМесяцам Тогда
				Движение.ПериодВзаиморасчетов           = ВыборкаПоШапкеДокумента.ПериодВзаиморасчетов;
			КонецЕсли;
			
			// Ресурсы
			Движение.СуммаВзаиморасчетов			= - ВыборкаПоТЧ.НалогПоСтавке35; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//				  				  из результата запроса к ТЧ документа, 
//  ВыборкаПоШапкеДокумента		- выборка по данным шапки документа
//	НаборЗаписей				- набор записей для НДФЛРасчетыСБюджетом
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуНДФЛКЗачету(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента)
	
	// НДФЛ к зачету
	Если ВыборкаПоСтрокамДокумента.Налог < 0 Тогда
		Движение = Движения.НДФЛКЗачету.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.ФизЛицо                        = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Движение.Организация				    = ВыборкаПоШапкеДокумента.Организация;
		Движение.СтавкаНалогообложенияРезидента	= ВыборкаПоСтрокамДокумента.Ставка;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету			= - ВыборкаПоСтрокамДокумента.Налог;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.НДФЛКЗачетуУчтено <> 0 Тогда
		
		Движение = Движения.НДФЛКЗачету.Добавить();
		
		// Свойства
		Движение.Период		 = ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ФизЛицо                        = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Движение.Организация				    = ВыборкаПоШапкеДокумента.Организация;
		Движение.СтавкаНалогообложенияРезидента	= ВыборкаПоСтрокамДокумента.Ставка;
		
		// Ресурсы
		Движение.СуммаНДФЛКЗачету			= ВыборкаПоСтрокамДокумента.НДФЛКЗачетуУчтено;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуНДФЛКЗачету

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//				  				  из результата запроса к ТЧ документа, 
//  ВыборкаПоШапкеДокумента		- выборка по данным шапки документа
//	НаборЗаписей				- набор записей для НДФЛРасчетыСБюджетом
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуНДФЛудержанный(ВыборкаСуммКУдержанию, ВыборкаПоНДФЛКЗачету, ВыборкаПоШапкеДокумента)
	
	НалогКУдержанию = ВыборкаСуммКУдержанию.Налог; // положительная сумма исчисленного налога
	
	// учтем возможный зачет образовавшейся ранее переплаты налога
	ВыборкаПоНДФЛКЗачету.Сбросить();
	Если ВыборкаПоНДФЛКЗачету.НайтиСледующий(ВыборкаСуммКУдержанию.ФизЛицо,"ФизЛицо") Тогда
		НалогКУдержанию = НалогКУдержанию - ВыборкаПоНДФЛКЗачету.НДФЛКЗачетуУчтено;
	КонецЕсли;
	
	Если Год(ВыборкаПоШапкеДокумента.Дата) > ВыборкаПоШапкеДокумента.НалоговыйПериод Тогда
		МесяцНалоговогоПериода = Дата(ВыборкаПоШапкеДокумента.НалоговыйПериод, 12, 1);
	Иначе	
		МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	КонецЕсли; 
	
	Если НалогКУдержанию > 0 Тогда
		Движение = Движения.НДФЛРасчетыСБюджетом.Добавить();
		// Свойства
		Движение.Период                 		= ВыборкаПоШапкеДокумента.Дата;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		// Измерения
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо                		= ВыборкаСуммКУдержанию.ФизЛицо;
		Движение.СтавкаНалогообложенияРезидента	= Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
		Движение.МесяцНалоговогоПериода      	= МесяцНалоговогоПериода;
		// Ресурсы
		Движение.Налог							= НалогКУдержанию; 
		// Реквизиты
		Движение.ОбособленноеПодразделение  	= ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидСтроки						= Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуНДФЛудержанный

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	
	//СВЭЙ 21.12.2024 КВВ СВФР-012330 (
	Отказ = Ложь;
	
	Если Год(Дата) = НалоговыйПериод Тогда
		Предупреждение("Неверный год перерасчета!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ТЗДок = РезультатЗапросаПоШапке.Выгрузить();
		Если ТЗДок.Количество() > 0 Тогда
			ТЗТЧ = ТЗДок[0].Ссылка.РаботникиОрганизации.Выгрузить();     
			Для Каждого Стр ИЗ ТЗТЧ Цикл
				Стр.ПериодДействия = НачалоГода(Стр.ПериодДействия);
			КонецЦикла;
			
			ТЗТЧ.Свернуть("ПериодДействия");
			Если ТЗТЧ.Количество() > 1 Тогда
				Предупреждение("В табличной части присутствуют периоды за разные года. Документ не может быть проведен!");	
				Отказ = Истина; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда	
		//СВЭЙ 21.12.2024 КВВ СВФР-012330 )
		
		// Получим реквизиты шапки из запроса
		ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
		
		Если ВыборкаПоШапкеДокумента.Следующий() Тогда
			
			//Надо позвать проверку заполнения реквизитов шапки
			ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
			
			// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
			Если НЕ Отказ Тогда
				
				// получим учетную политику
				УпрощенныйУчетНДФЛ = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УпрощенныйУчетНДФЛ");
				
				// ведется ли учет задолженности в разрезе периодов возникновения задолженности
				УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
				
				// получим реквизиты табличной части
				РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации(Режим);
				ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 
					
					// проверим очередную строку табличной части
					ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоРаботникиОрганизации, Отказ, Заголовок);
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, УпрощенныйУчетНДФЛ, УчетЗадолженностиПоМесяцам);
					
				КонецЦикла;
				
				// НДФЛ к зачету
				// получим реквизиты табличной части
				Если НЕ Отказ Тогда
					
					ВыборкаПоНДФЛКЗачету = СформироватьЗапросПоНДФЛКЗачету().Выбрать();
					Пока ВыборкаПоНДФЛКЗачету.Следующий() Цикл 
						// Заполним записи в наборах записей регистров
						//  ДобавитьСтрокуНДФЛКЗачету(ВыборкаПоНДФЛКЗачету, ВыборкаПоШапкеДокумента); //О.Т. Аверсон 20.09.2017 № 1027 убрать
					КонецЦикла;
					
					Если УпрощенныйУчетНДФЛ Тогда
						
						ВыборкаПоНДФЛуд = СформироватьЗапросПоНДФЛудержанный().Выбрать();
						Пока ВыборкаПоНДФЛуд.Следующий() Цикл 
							
							// Заполним записи в наборах записей регистров
							ДобавитьСтрокуНДФЛудержанный(ВыборкаПоНДФЛуд, ВыборкаПоНДФЛКЗачету, ВыборкаПоШапкеДокумента);
							
						КонецЦикла;
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон 20.03.2023 КВВ СВФР-010572 (
	Если Организация.ИНН = "700067572" Тогда
		СохранитьЗначение("ФлагПроверкаНаВычет",ФлагПроверкаНаВычет);
	КонецЕсли;
	//Аверсон 20.03.2023 КВВ СВФР-010572 )
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,, "Физлицо");
	
КонецПроцедуры
