Процедура ИмпортСотрудников(мФорма) Экспорт

//формируем файл
		
	Попытка
		Дбф=Новый XBase();
	//	Дбф.ОткрытьФайл(ПутьДБФЭкспорт+"\Swr.DBF");
		Дбф.Кодировка=КодировкаXBase.OEM;
		Дбф.Поля.Добавить("Tab_nom", "S", 10);
		Дбф.Поля.Добавить("F", "S", 30);
		Дбф.Поля.Добавить("i", "S", 30);
		Дбф.Поля.Добавить("o", "S", 30);
		Дбф.Поля.Добавить("Kstr1", "S", 10);
		Дбф.Поля.Добавить("Kprof", "S", 10);
		Дбф.Поля.Добавить("Kkat", "S", 10);
		Дбф.Поля.Добавить("Razr", "S", 10);
		Дбф.Поля.Добавить("Dat_pr", "D");
		Дбф.Поля.Добавить("Dat_st", "D");
		Дбф.Поля.Добавить("Dat_uv", "D");
		Дбф.Поля.Добавить("Dat_uv2", "D");
		Дбф.Поля.Добавить("Data_dk", "S", 6);
		Дбф.Поля.Добавить("Datn_dk", "S", 6);
		Дбф.Поля.Добавить("Sopl", "N", 1);
		Дбф.Поля.Добавить("Podr", "S", 40);
		Дбф.Поля.Добавить("Pol", "S", 1);
		Дбф.СоздатьФайл("F:\PROGRAMM\DBPERCO\Swr.DBF");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Код КАК Tab_nom,
			|	ФИОФизЛицСрезПоследних.Фамилия КАК F,
			|	ФИОФизЛицСрезПоследних.Имя КАК I,
			|	ФИОФизЛицСрезПоследних.Отчество КАК O,
			|	РаботникиОрганизаций.ПодразделениеОрганизации.Код КАК Kstr,
			|	РаботникиОрганизаций.Должность.Код КАК Kprof,
			|	РаботникиОрганизаций.РазрядЕТС КАК Razr,
			|	РаботникиОрганизаций.Категория.Код КАК Kkat,
			|	&ПустаяДата КАК Data_dk,
			|	&ПустаяДата КАК Data_pr,
			|	&ПустаяДата КАК Data_uv,
			|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|	&ПустаяДата КАК Datn_dk,
			|	0 КАК Sopl,
			|	РаботникиОрганизаций.ПодразделениеОрганизации.Наименование КАК Podr,
			|	ФизическиеЛицаСтажи.ДатаОтсчета КАК Data_st,
			|	СотрудникиОрганизаций.Физлицо.Пол КАК Пол
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, (НЕ Временно)) КАК РаботникиОрганизаций
			|		ПО (РаботникиОрганизаций.Сотрудник = СотрудникиОрганизаций.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
			|		ПО (ФИОФизЛицСрезПоследних.ФизЛицо = СотрудникиОрганизаций.Физлицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
			|		ПО СотрудникиОрганизаций.Физлицо.Ссылка = ФизическиеЛицаСтажи.Ссылка
			|			И (ФизическиеЛицаСтажи.ВидСтажа = &ВидСтажа)
			|ГДЕ
			|	СотрудникиОрганизаций.Актуальность
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникиОрганизаций.Наименование";
			
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		Запрос.УстановитьПараметр("ВидСтажа", Справочники.ВидыСтажа.НепрерывныйСтаж);
		Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
		Справочник = Запрос.Выполнить().Выгрузить();
	//прием
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизаций.Период,
			|	РаботникиОрганизаций.Сотрудник
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РаботникиОрганизаций";
		Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
		Прием = Запрос.Выполнить().Выбрать();
		
		мФорма.ЭлементыФормы.Индикатор.МинимальноеЗначение = 0;
		мФорма.ЭлементыФормы.Индикатор.Значение = 0;
		мФорма.ЭлементыФормы.Индикатор.МаксимальноеЗначение = Прием.Количество();
		Пока Прием.Следующий() Цикл
			мФорма.ЭлементыФормы.Индикатор.Значение = мФорма.ЭлементыФормы.Индикатор.Значение + 1;
			СтрокиОсновныхНачислений = Справочник.НайтиСтроки(Новый Структура ("Сотрудник", Прием.Сотрудник));
			Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
				СтрокиОсновныхНачислений[0].Data_pr = Прием.Период;	
			КонецЕсли;
		КонецЦикла;
		
	//увольнение	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизаций.Период,
			|	РаботникиОрганизаций.Сотрудник
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций";
		Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
		Увольнение = Запрос.Выполнить().Выбрать();
		мФорма.ЭлементыФормы.Индикатор.МинимальноеЗначение = 0;
		мФорма.ЭлементыФормы.Индикатор.Значение = 0;
		мФорма.ЭлементыФормы.Индикатор.МаксимальноеЗначение = Увольнение.Количество();
		Пока Увольнение.Следующий() Цикл
			мФорма.ЭлементыФормы.Индикатор.Значение = мФорма.ЭлементыФормы.Индикатор.Значение + 1;
			СтрокиОсновныхНачислений = Справочник.НайтиСтроки(Новый Структура ("Сотрудник", Увольнение.Сотрудник));
			Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
				СтрокиОсновныхНачислений[0].Data_uv = Увольнение.Период;	
			КонецЕсли;
		КонецЦикла;
		
	//декрет
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостояниеРаботниковОрганизацийСрезПоследних.Период,
			|	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
			|	СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения
			|ИЗ
			|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&КонДата, Состояние В (&Состояния)) КАК СостояниеРаботниковОрганизацийСрезПоследних";
			//|
			//|ОБЪЕДИНИТЬ ВСЕ
			//|
			//|ВЫБРАТЬ
			//|	НачислениеПоБольничномуЛисту.ДатаНачала,
			//|	НачислениеПоБольничномуЛисту.Сотрудник,
			//|	НачислениеПоБольничномуЛисту.ДатаОкончания
			//|ИЗ
			//|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
			//|ГДЕ
			//|	НачислениеПоБольничномуЛисту.Проведен
			//|	И НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
			//|	И НачислениеПоБольничномуЛисту.ДатаНачала <= &КонДата";
			
		Состояния = Новый СписокЗначений;
		Состояния.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
		Состояния.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам);
		
		Запрос.УстановитьПараметр("Состояния", Состояния);
		Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
		Увольнение = Запрос.Выполнить().Выбрать();
		
		мФорма.ЭлементыФормы.Индикатор.МинимальноеЗначение = 0;
		мФорма.ЭлементыФормы.Индикатор.Значение = 0;
		мФорма.ЭлементыФормы.Индикатор.МаксимальноеЗначение = Увольнение.Количество();
		Пока Увольнение.Следующий() Цикл
			мФорма.ЭлементыФормы.Индикатор.Значение = мФорма.ЭлементыФормы.Индикатор.Значение + 1;
			СтрокиОсновныхНачислений = Справочник.НайтиСтроки(Новый Структура ("Сотрудник", Увольнение.Сотрудник));
			Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
				СтрокиОсновныхНачислений[0].Datn_dk = Увольнение.Период;	
				СтрокиОсновныхНачислений[0].Data_dk = Увольнение.ПериодЗавершения;	
			КонецЕсли;
		КонецЦикла;
		
	//система оплаты
	//1-Сделка
	//2-Повременка
	//3-Оклад

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("КонДата", ТекущаяДата());
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
			|			&КонДата,
			|			Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|				И ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
			|				И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних";
		Оплата = Запрос.Выполнить().Выбрать();
		мФорма.ЭлементыФормы.Индикатор.МинимальноеЗначение = 0;
		мФорма.ЭлементыФормы.Индикатор.Значение = 0;
		мФорма.ЭлементыФормы.Индикатор.МаксимальноеЗначение = Увольнение.Количество();
		Пока Оплата.Следующий() Цикл
			мФорма.ЭлементыФормы.Индикатор.Значение = мФорма.ЭлементыФормы.Индикатор.Значение + 1;
			СтрокиОсновныхНачислений = Справочник.НайтиСтроки(Новый Структура ("Сотрудник", Оплата.Сотрудник));
			Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
				Если Оплата.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата Тогда
					СтрокиОсновныхНачислений[0].Sopl = 1;	
				ИначеЕсли Оплата.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой Тогда
					СтрокиОсновныхНачислений[0].Sopl = 2;	
				ИначеЕсли Оплата.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда
					СтрокиОсновныхНачислений[0].Sopl = 3;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
		Для Каждого мСтрока из Справочник Цикл
			Дбф.Добавить();
			Дбф.УстановитьЗначениеПоля("Tab_nom", мСтрока.Tab_nom);
			Дбф.УстановитьЗначениеПоля("F", СокрЛП(мСтрока.F));
			Дбф.УстановитьЗначениеПоля("i", СокрЛП(мСтрока.I));
			Дбф.УстановитьЗначениеПоля("o", СокрЛП(мСтрока.O));
			Дбф.УстановитьЗначениеПоля("Kstr1", мСтрока.Kstr);
			Дбф.УстановитьЗначениеПоля("Kprof", мСтрока.Kprof);
			Дбф.УстановитьЗначениеПоля("Kkat", мСтрока.Kkat);
			Дбф.УстановитьЗначениеПоля("Razr", мСтрока.Razr);
			Дбф.УстановитьЗначениеПоля("Dat_pr", мСтрока.Data_pr);
			Дбф.УстановитьЗначениеПоля("Dat_st", мСтрока.Data_st);
			Дбф.УстановитьЗначениеПоля("Dat_uv", мСтрока.Data_uv);
			Дбф.УстановитьЗначениеПоля("Dat_uv2", мСтрока.Data_uv);
			Дбф.УстановитьЗначениеПоля("Data_dk", Формат(мСтрока.Data_dk, "ДФ='ddMMyy'"));
			Дбф.УстановитьЗначениеПоля("Datn_dk", Формат(мСтрока.Datn_dk, "ДФ='ddMMyy'"));
			Дбф.УстановитьЗначениеПоля("Sopl", мСтрока.Sopl);
			Дбф.УстановитьЗначениеПоля("Podr", мСтрока.Podr);
			Если мСтрока.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
				Дбф.УстановитьЗначениеПоля("Pol", "М");
			ИначеЕсли мСтрока.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Дбф.УстановитьЗначениеПоля("Pol", "Ж");
			Иначе
				Дбф.УстановитьЗначениеПоля("Pol", "Н");
			КонецЕсли;
			Дбф.Записать();
		КонецЦикла;
		Дбф.ЗакрытьФайл();
	Исключение
//		ОбщегоНазначения.СообщитьОбОшибке("Ошибка импорта сотрудников !!!");
	КонецПопытки;
	
КонецПроцедуры	
