
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();				   

	ДокументРезультат.Очистить();
	
	ОтчетПустой = Истина;	
	
	// Параметры документа
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОрганизационнаяСтруктура";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ДатаОтчета = '00010101';
	
	//УстановитьДатуОтчета(НастройкиОтчета, ДатаОтчета);
	
	ПараметрЮридическаяСтруктура = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЮридическаяСтруктура"));	
	Если ПараметрЮридическаяСтруктура <> Неопределено Тогда
		ПараметрЮридическаяСтруктура.Значение = Истина;
	КонецЕсли;
	
	ДанныеОтчета = Новый ДеревоЗначений;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//МакетКомпоновки = МакетКомпоновкиДанныхДляКоллекцииЗначений(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	// Создадим и инициализируем процессор компоновки.
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	
	// Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ВывестиМакетЮридическаяСтруктура(ДокументРезультат, ДанныеОтчета, ДатаОтчета);
	
	ОтчетПустой = ДанныеОтчета.Строки.Количество() = 0;

	ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	ДопСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

Процедура УстановитьДатуОтчета(НастройкиОтчета, ДатаОтчета)
	
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра <> Неопределено Тогда
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Дата") 
			Или ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
			Дата = Дата(ЗначениеПараметра.Значение);
			Если Дата = '00010101' Тогда
				ЗначениеПараметра.Значение = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ДатаОтчета = ЗначениеПараметра.Значение;
	Если ТипЗнч(ДатаОтчета) = Тип("СтандартнаяДатаНачала") Тогда
		ДатаОтчета = ДатаОтчета.Дата;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВывестиМакетЮридическаяСтруктура(ДокументРезультат, ДанныеОтчета, ДатаОтчета)
	
	ДополнительныеПараметры = ПараметрыОтчета(ДанныеОтчета, ДатаОтчета, Истина);
	
	ПараметрыМакета = ДополнительныеПараметры.ПараметрыМакета;
	
	ОбластьПодразделение 	= ПараметрыМакета.ОбластьПодразделение;
	//ОбластьДанныеПозиции 	= ПараметрыМакета.ОбластьДанныеПозиции;
	//ОбластьСотрудник 		= ПараметрыМакета.ОбластьСотрудник;
	//ОбластьЧертаСлева 		= ПараметрыМакета.ОбластьЧертаСлева;
	//ОбластьЧертаСнизу 		= ПараметрыМакета.ОбластьЧертаСнизу;
	//ОбластьУгол 			= ПараметрыМакета.ОбластьУгол;
	ОбластьПустойБлок 		= ПараметрыМакета.ОбластьПустойБлок;
	//
	Для Каждого ДанныеОрганизации Из ДанныеОтчета.Строки Цикл 
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ВывестиДанныеПодразделенияВерхнегоУровня(ТабличныйДокумент, ДанныеОрганизации, ДанныеОрганизации.Организация, ДополнительныеПараметры);
		
		ДокументРезультат.Вывести(ОбластьПустойБлок);
		ДокументРезультат.Вывести(ОбластьПустойБлок);
		
		ОбластьПодразделение.Параметры.ПодразделениеНаименование = ДанныеОрганизации.ОрганизацияНаименование;
		ОбластьПодразделение.Параметры.Подразделение = ДанныеОрганизации.Организация;
		ДокументРезультат.Присоединить(ОбластьПодразделение);
		
		ОбластьЯчеек = ДокументРезультат.Вывести(ТабличныйДокумент.ПолучитьОбласть(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
		ОбластьЯчеек.ШиринаКолонки = 6;
		
		ДокументРезультат.Вывести(ОбластьПустойБлок);
		
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	ДокументРезультат.Область("R1C1").Текст = "Вводится с " + Формат(ДатаОтчетаДляПечати,"ДЛФ=Д"); //Аверсон 31.08.2021 КВВ СВФР-008056
	
КонецПроцедуры

Функция ПараметрыОтчета(ДанныеОтчета, ДатаОтчета, ЮридическаяСтруктура)
	
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.ОрганизационнаяСтруктура.ПФ_MXL_ОрганизационнаяСтруктура");
	Макет = ПолучитьМакет("ПФ_MXL_ОрганизационнаяСтруктура");
	
	ОбластьПодразделение = Макет.ПолучитьОбласть("R3C2:R4C7");
	ОбластьРуководительПодразделения = Макет.ПолучитьОбласть("R13C2:R15C7");
	ОбластьДанныеПозиции = Макет.ПолучитьОбласть("R6C2:R7C7");
	ОбластьСотрудник = Макет.ПолучитьОбласть("R6C9:R6C18");
	ОбластьСотрудникФото = Макет.ПолучитьОбласть("R9C2:R11C12");
	ОбластьКадровыйРезервНачало = Макет.ПолучитьОбласть("R9C14:R9C19");
	ОбластьКадровыйРезервПродолжение = Макет.ПолучитьОбласть("R10C14:R10C19");
	ОбластьКадровыйРезервОкончание = Макет.ПолучитьОбласть("R11C14:R11C19");
	ОбластьЧертаСлева = Макет.ПолучитьОбласть("R3C10:R3C10");
	ОбластьЧертаСнизу = Макет.ПолучитьОбласть("R3C13:R3C13");
	ОбластьУгол = Макет.ПолучитьОбласть("R3C11:R3C11");
	ОбластьПустойБлок = Макет.ПолучитьОбласть("R3C12:R3C12");
	
	ПараметрыМакета = Новый Структура;
	ПараметрыМакета.Вставить("ОбластьПодразделение", ОбластьПодразделение);
	ПараметрыМакета.Вставить("ОбластьРуководительПодразделения", ОбластьРуководительПодразделения);
	ПараметрыМакета.Вставить("ОбластьДанныеПозиции", ОбластьДанныеПозиции);
	ПараметрыМакета.Вставить("ОбластьСотрудник", ОбластьСотрудник);
	ПараметрыМакета.Вставить("ОбластьСотрудникФото", ОбластьСотрудникФото);
	ПараметрыМакета.Вставить("ОбластьКадровыйРезервНачало", ОбластьКадровыйРезервНачало);
	ПараметрыМакета.Вставить("ОбластьКадровыйРезервПродолжение", ОбластьКадровыйРезервПродолжение);
	ПараметрыМакета.Вставить("ОбластьКадровыйРезервОкончание", ОбластьКадровыйРезервОкончание);
	ПараметрыМакета.Вставить("ОбластьЧертаСлева", ОбластьЧертаСлева);
	ПараметрыМакета.Вставить("ОбластьЧертаСнизу", ОбластьЧертаСнизу);
	ПараметрыМакета.Вставить("ОбластьУгол", ОбластьУгол);
	ПараметрыМакета.Вставить("ОбластьПустойБлок", ОбластьПустойБлок);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрВыводитьРуководителей = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьРуководителей"));	
	ВыводитьРуководителей = ?(ПараметрВыводитьРуководителей = Неопределено, Ложь, ПараметрВыводитьРуководителей.Значение);
	
	ПараметрВыводитьКоличествоСтавок = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьКоличествоСтавок"));	
	ВыводитьКоличествоСтавок = ?(ПараметрВыводитьКоличествоСтавок = Неопределено, Ложь, ПараметрВыводитьКоличествоСтавок.Значение);
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда 
	//	ПараметрВыводитьКадровыйРезерв = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьКадровыйРезерв"));	
	//	ВыводитьКадровыйРезерв = ?(ПараметрВыводитьКадровыйРезерв = Неопределено, Ложь, ПараметрВыводитьКадровыйРезерв.Значение);
	//Иначе 
		ВыводитьКадровыйРезерв = Ложь;
	//КонецЕсли;
	
	ПараметрВыводитьСотрудников = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьСотрудников"));	
	ВыводитьСотрудников = ?(ПараметрВыводитьСотрудников = Неопределено, Ложь, ПараметрВыводитьСотрудников.Значение);
	
	ПараметрВыводитьФотографииСотрудников = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьФотографииСотрудников"));	
	ВыводитьФотографииСотрудников = ?(ПараметрВыводитьФотографииСотрудников = Неопределено, Ложь, ПараметрВыводитьФотографииСотрудников.Значение);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ДатаОтчета", ДатаОтчета);
	СтруктураНастроек.Вставить("ВыводитьРуководителей", ВыводитьРуководителей);
	СтруктураНастроек.Вставить("ВыводитьКоличествоСтавок", ВыводитьКоличествоСтавок);
	СтруктураНастроек.Вставить("ВыводитьКадровыйРезерв", ВыводитьКадровыйРезерв);
	СтруктураНастроек.Вставить("ВыводитьСотрудников", ВыводитьСотрудников);
	СтруктураНастроек.Вставить("ВыводитьФотографииСотрудников", ВыводитьФотографииСотрудников);
	
	//Руководители = ?(ВыводитьРуководителей, РуководителиПодразделений(ДанныеОтчета, ЮридическаяСтруктура), Неопределено);
	//ФотографииСотрудников = ?(ВыводитьФотографииСотрудников, ФотографииСотрудников(ДанныеОтчета), Неопределено); 
	//КадровыйРезервПозиций = ?(ВыводитьКадровыйРезерв, КадровыйРезервПозиций(ДанныеОтчета, ДатаОтчета), Неопределено);
	Руководители = Неопределено;
	ФотографииСотрудников = Неопределено; 
	КадровыйРезервПозиций = Неопределено;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыМакета", ПараметрыМакета);
	ДополнительныеПараметры.Вставить("НастройкиОтчета", СтруктураНастроек);
	ДополнительныеПараметры.Вставить("РуководителиПодразделений", Руководители);
	ДополнительныеПараметры.Вставить("ФотографииСотрудников", ФотографииСотрудников);
	ДополнительныеПараметры.Вставить("КадровыйРезервПозиций", КадровыйРезервПозиций);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Процедура ВывестиДанныеПодразделенияВерхнегоУровня(ДокументРезультат, ДанныеОрганизации, ТекущееПодразделение, ДополнительныеПараметры)
	
	ПараметрыМакета = ДополнительныеПараметры.ПараметрыМакета;
	НастройкиОтчета = ДополнительныеПараметры.НастройкиОтчета;
	Руководители = ДополнительныеПараметры.РуководителиПодразделений;
	
	ОбластьПодразделение 				= ПараметрыМакета.ОбластьПодразделение;
	ОбластьРуководительПодразделения 	= ПараметрыМакета.ОбластьРуководительПодразделения;
	ОбластьЧертаСлева 					= ПараметрыМакета.ОбластьЧертаСлева;
	ОбластьЧертаСнизу 					= ПараметрыМакета.ОбластьЧертаСнизу;
	ОбластьУгол 						= ПараметрыМакета.ОбластьУгол;
	ОбластьПустойБлок 					= ПараметрыМакета.ОбластьПустойБлок;
	
	ВыводитьРуководителей = НастройкиОтчета.ВыводитьРуководителей;
	
	КоличествоПодразделений = 0;
	Для Каждого ДанныеПодразделенияВерхнегоУровня Из ДанныеОрганизации.Строки Цикл 
		Если ДанныеПодразделенияВерхнегоУровня.Подразделение <> ТекущееПодразделение Тогда 
			КоличествоПодразделений = КоличествоПодразделений + 1;
		КонецЕсли;
	КонецЦикла;
	
	НомерПодразделения = 1;
	
	Для Каждого ДанныеПодразделенияВерхнегоУровня Из ДанныеОрганизации.Строки Цикл 
		
		Если ДанныеПодразделенияВерхнегоУровня.Подразделение = ТекущееПодразделение Тогда 
			Продолжить;
		КонецЕсли;
		
		МаксимальныйИндекс = 0;
		ЕстьПодчиненныеПодразделения = Ложь;
		
		Для Каждого ДанныеПодразделения Из ДанныеПодразделенияВерхнегоУровня.Строки Цикл 
			Если ДанныеПодразделения.Подразделение <> ДанныеПодразделенияВерхнегоУровня.Подразделение Тогда 
				МаксимальныйИндекс = ДанныеПодразделенияВерхнегоУровня.Строки.Индекс(ДанныеПодразделения);
				ЕстьПодчиненныеПодразделения = Истина;
			КонецЕсли;
		КонецЦикла;
		
		СписокПозиций = Новый Массив;
		//ЗаполнитьСписокПозицийПодразделения(ДанныеПодразделенияВерхнегоУровня, ДанныеПодразделенияВерхнегоУровня.Подразделение, СписокПозиций);
		
		ОбластьПодчиненныеПозиции = Новый ТабличныйДокумент;
		//ВывестиДанныеПозиций(ОбластьПодчиненныеПозиции, СписокПозиций, Не ЕстьПодчиненныеПодразделения, ДополнительныеПараметры);
		
		ОбластьПодчиненныеПодразделения = Новый ТабличныйДокумент;
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		Для Каждого ДанныеПодразделения Из ДанныеПодразделенияВерхнегоУровня.Строки Цикл 
			
			Если ДанныеПодразделения.Подразделение = ДанныеПодразделенияВерхнегоУровня.Подразделение Тогда 
				Продолжить;
			КонецЕсли;
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ВывестиДанныеПодразделения(ТабличныйДокумент, ДанныеПодразделения, ДанныеПодразделения.Подразделение, ДополнительныеПараметры);
			
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				
				ЛеваяКолонка = Новый ТабличныйДокумент;
				ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
				ЛеваяКолонка.Вывести(ОбластьУгол);
				
				Если ДанныеПодразделенияВерхнегоУровня.Строки.Индекс(ДанныеПодразделения) < МаксимальныйИндекс Тогда 
					КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы - 2;
					Для Сч = 1 По КоличествоСтрок Цикл 
						ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
					КонецЦикла;
				КонецЕсли;
				
				ОбластьПодчиненныеПодразделения.Вывести(ЛеваяКолонка.ПолучитьОбласть(1, 1, ЛеваяКолонка.ВысотаТаблицы, 1));
				ОбластьПодчиненныеПодразделения.Присоединить(ТабличныйДокумент.ПолучитьОбласть(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ОбластьПодразделениеВерхнегоУровня = Новый ТабличныйДокумент;
		
		ВыводимаяОбласть = ?(НомерПодразделения = 1, ОбластьПустойБлок, ОбластьЧертаСнизу);
		ОбластьПодразделениеВерхнегоУровня.Вывести(ВыводимаяОбласть);
		Для Сч = 1 По 3 Цикл 
			ОбластьПодразделениеВерхнегоУровня.Присоединить(ВыводимаяОбласть);
		КонецЦикла;	
		
		Если КоличествоПодразделений > 1 Тогда
			Если НомерПодразделения <> КоличествоПодразделений Тогда
				ОбластьПодразделениеВерхнегоУровня.Присоединить(?(НомерПодразделения = 1, ОбластьУгол, ОбластьЧертаСнизу));
				ШиринаТаблицы = Макс(ОбластьПодчиненныеПодразделения.ШиринаТаблицы, ОбластьПодчиненныеПозиции.ШиринаТаблицы, ОбластьПодразделение.ШиринаТаблицы, 5);
				Для Сч = 4 По ШиринаТаблицы Цикл 
					ОбластьПодразделениеВерхнегоУровня.Присоединить(ОбластьЧертаСнизу);
				КонецЦикла;
			КонецЕсли;
		Иначе 
			ОбластьПодразделениеВерхнегоУровня.Присоединить(ОбластьЧертаСлева);
		КонецЕсли;
		
		ОбластьПодразделениеВерхнегоУровня.Вывести(ОбластьПустойБлок);
		Для Сч = 1 По 3 Цикл 
			ОбластьПодразделениеВерхнегоУровня.Присоединить(ОбластьПустойБлок);
		КонецЦикла;	
		ОбластьПодразделениеВерхнегоУровня.Присоединить(ОбластьЧертаСлева);
		
		ОбластьПустаяКолонка = Новый ТабличныйДокумент;
		Для Сч = 1 По ОбластьПодчиненныеПодразделения.ВысотаТаблицы + 2 Цикл 
			ОбластьПустаяКолонка.Вывести(ОбластьПустойБлок);
		КонецЦикла;
		ОбластьПодразделениеВерхнегоУровня.Вывести(ОбластьПустаяКолонка.ПолучитьОбласть(1, 1, ОбластьПустаяКолонка.ВысотаТаблицы, 1));
		
		ОбластьДанныеПодразделения = Новый ТабличныйДокумент;
		ОбластьПодразделение.Параметры.ПодразделениеНаименование = ДанныеПодразделенияВерхнегоУровня.ПодразделениеНаименование;
		ОбластьПодразделение.Параметры.Подразделение = ДанныеПодразделенияВерхнегоУровня.Подразделение;
		ОбластьДанныеПодразделения.Вывести(ОбластьПодразделение);
		
		Если ВыводитьРуководителей Тогда
			ДанныеРуководителя = Руководители[ДанныеПодразделенияВерхнегоУровня.Подразделение];
			Если ДанныеРуководителя <> Неопределено Тогда 
				ОбластьРуководительПодразделения.Параметры.Руководитель = ДанныеРуководителя.Руководитель;
				ОбластьРуководительПодразделения.Параметры.ДолжностьРуководителя = ДанныеРуководителя.ПозицияРуководителя;
				ОбластьДанныеПодразделения.Вывести(ОбластьРуководительПодразделения);
			КонецЕсли;
		КонецЕсли;
		
		Если ОбластьПодчиненныеПозиции.ВысотаТаблицы > 0 Тогда 
			ОбластьДанныеПодразделения.Вывести(ОбластьПодчиненныеПозиции.ПолучитьОбласть(1, 1, ОбластьПодчиненныеПозиции.ВысотаТаблицы, ОбластьПодчиненныеПозиции.ШиринаТаблицы));
		КонецЕсли;
		
		Если ОбластьПодчиненныеПодразделения.ВысотаТаблицы > 0 Тогда 
			ОбластьДанныеПодразделения.Вывести(ОбластьПодчиненныеПодразделения.ПолучитьОбласть(1, 1, ОбластьПодчиненныеПодразделения.ВысотаТаблицы, ОбластьПодчиненныеПодразделения.ШиринаТаблицы));
		КонецЕсли;
		
		ОбластьПодразделениеВерхнегоУровня.Присоединить(ОбластьДанныеПодразделения.ПолучитьОбласть(1, 1, ОбластьДанныеПодразделения.ВысотаТаблицы, ОбластьДанныеПодразделения.ШиринаТаблицы));
		
		ВысотаОбласти = ОбластьПодразделениеВерхнегоУровня.ВысотаТаблицы;
		ШиринаОбласти = ОбластьПодразделениеВерхнегоУровня.ШиринаТаблицы;
		
		Если НомерПодразделения = 1 Тогда
			ДокументРезультат.Вывести(ОбластьПодразделениеВерхнегоУровня.ПолучитьОбласть(1, 1, ВысотаОбласти, ШиринаОбласти));
		Иначе 
			ДокументРезультат.Присоединить(ОбластьПодразделениеВерхнегоУровня.ПолучитьОбласть(1, 1, ВысотаОбласти, ШиринаОбласти));
		КонецЕсли;
		
		НомерПодразделения = НомерПодразделения + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСписокПозицийПодразделения(ДанныеВышестоящегоПодразделения, Подразделение, СписокПозиций)
	
	Для Каждого ДанныеПодразделения Из ДанныеВышестоящегоПодразделения.Строки Цикл 
		
		Если ДанныеПодразделения.Подразделение <> Подразделение Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПодразделения.Позиция) Тогда 
			// {{ Локализация_КомплекснаяАвтоматизацияДляБеларуси
			Если ДанныеПодразделения.ПозицияГруппаПозицийПодразделения <> null  Тогда
				Если Не ДанныеПодразделения.ПозицияГруппаПозицийПодразделения Тогда
					СписокПозиций.Добавить(ДанныеПодразделения);
				КонецЕсли;
			КонецЕсли;
			// Локализация_КомплекснаяАвтоматизацияДляБеларуси }
		Иначе 
			ЗаполнитьСписокПозицийПодразделения(ДанныеПодразделения, Подразделение, СписокПозиций);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДанныеПодразделения(ДокументРезультат, ДанныеВышестоящегоПодразделения, ТекущееПодразделение, ДополнительныеПараметры)
	
	ПараметрыМакета = ДополнительныеПараметры.ПараметрыМакета;
	НастройкиОтчета = ДополнительныеПараметры.НастройкиОтчета;
	Руководители = ДополнительныеПараметры.РуководителиПодразделений;
	
	ОбластьПодразделение 				= ПараметрыМакета.ОбластьПодразделение;
	ОбластьРуководительПодразделения 	= ПараметрыМакета.ОбластьРуководительПодразделения;
	ОбластьЧертаСлева 					= ПараметрыМакета.ОбластьЧертаСлева;
	ОбластьУгол 						= ПараметрыМакета.ОбластьУгол;
	ОбластьПустойБлок 					= ПараметрыМакета.ОбластьПустойБлок;
	
	ВыводитьРуководителей = НастройкиОтчета.ВыводитьРуководителей;
	
	ДокументРезультат.Вывести(ОбластьПустойБлок);
	
	ОбластьПодразделение.Параметры.ПодразделениеНаименование = ДанныеВышестоящегоПодразделения.ПодразделениеНаименование;
	ОбластьПодразделение.Параметры.Подразделение = ДанныеВышестоящегоПодразделения.Подразделение;
	ДокументРезультат.Вывести(ОбластьПодразделение);
	
	Если ВыводитьРуководителей Тогда
		ДанныеРуководителя = Руководители[ДанныеВышестоящегоПодразделения.Подразделение];
		Если ДанныеРуководителя <> Неопределено Тогда 
			ОбластьРуководительПодразделения.Параметры.Руководитель = ДанныеРуководителя.Руководитель;
			ОбластьРуководительПодразделения.Параметры.ДолжностьРуководителя = ДанныеРуководителя.ПозицияРуководителя;
			ДокументРезультат.Вывести(ОбластьРуководительПодразделения);
		КонецЕсли;
	КонецЕсли;
	
	МаксимальныйИндекс = 0;
	ЕстьПодчиненныеПодразделения = Ложь;
	
	Для Каждого ДанныеПодразделения Из ДанныеВышестоящегоПодразделения.Строки Цикл 
		Если ДанныеПодразделения.Подразделение <> ТекущееПодразделение Тогда 
			МаксимальныйИндекс = ДанныеВышестоящегоПодразделения.Строки.Индекс(ДанныеПодразделения);
			ЕстьПодчиненныеПодразделения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СписокПозиций = Новый Массив;
	//ЗаполнитьСписокПозицийПодразделения(ДанныеВышестоящегоПодразделения, ДанныеВышестоящегоПодразделения.Подразделение, СписокПозиций);
	
	ОбластьПодчиненныеПозиции = Новый ТабличныйДокумент;
	//ВывестиДанныеПозиций(ОбластьПодчиненныеПозиции, СписокПозиций, Не ЕстьПодчиненныеПодразделения, ДополнительныеПараметры);
	
	Если ОбластьПодчиненныеПозиции.ВысотаТаблицы > 0 Тогда 
		ДокументРезультат.Вывести(ОбластьПодчиненныеПозиции.ПолучитьОбласть(1, 1, ОбластьПодчиненныеПозиции.ВысотаТаблицы, ОбластьПодчиненныеПозиции.ШиринаТаблицы));
	КонецЕсли;
	
	Для Каждого ДанныеПодразделения Из ДанныеВышестоящегоПодразделения.Строки Цикл 
		
		Если ДанныеПодразделения.Подразделение = ТекущееПодразделение Тогда 
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ВывестиДанныеПодразделения(ТабличныйДокумент, ДанныеПодразделения, ДанныеПодразделения.Подразделение, ДополнительныеПараметры);
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			
			ЛеваяКолонка = Новый ТабличныйДокумент;
			ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
			ЛеваяКолонка.Вывести(ОбластьУгол);
			
			Если ДанныеВышестоящегоПодразделения.Строки.Индекс(ДанныеПодразделения) < МаксимальныйИндекс Тогда 
				КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы - 2;
				Для Сч = 1 По КоличествоСтрок Цикл 
					ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
				КонецЦикла;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ЛеваяКолонка.ПолучитьОбласть(1, 1, ЛеваяКолонка.ВысотаТаблицы, 1));
			ДокументРезультат.Присоединить(ТабличныйДокумент.ПолучитьОбласть(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДанныеПозиций(ДокументРезультат, СписокПозиций, ПоследнееПодразделение, ДополнительныеПараметры)
	
	ПараметрыМакета = ДополнительныеПараметры.ПараметрыМакета;
	
	ОбластьПодразделение 	= ПараметрыМакета.ОбластьПодразделение;
	ОбластьЧертаСлева 		= ПараметрыМакета.ОбластьЧертаСлева;
	ОбластьУгол 			= ПараметрыМакета.ОбластьУгол;
	ОбластьПустойБлок 		= ПараметрыМакета.ОбластьПустойБлок;
	
	МаксимальныйИндекс = СписокПозиций.Количество() - 1;
	
	Для ИндексЭлемента = 0 По МаксимальныйИндекс Цикл 
		
		ДанныеПозиции = СписокПозиций[ИндексЭлемента];
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ВывестиДанныеПозиции(ТабличныйДокумент, ДанныеПозиции, ДополнительныеПараметры);
		
		ЛеваяКолонка = Новый ТабличныйДокумент;
		ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
		ЛеваяКолонка.Вывести(ОбластьУгол);
		
		Если Не ПоследнееПодразделение Или ИндексЭлемента < МаксимальныйИндекс Тогда 
			КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы - 2;
			Для Сч = 1 По КоличествоСтрок Цикл 
				ЛеваяКолонка.Вывести(ОбластьЧертаСлева);
			КонецЦикла;
		КонецЕсли;
		
		ДокументРезультат.Вывести(ЛеваяКолонка.ПолучитьОбласть(1, 1, ЛеваяКолонка.ВысотаТаблицы, 1));
		ДокументРезультат.Присоединить(ТабличныйДокумент.ПолучитьОбласть(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДанныеПозиции(ДокументРезультат, ДанныеПозиции, ДополнительныеПараметры)
	
	ПараметрыМакета = ДополнительныеПараметры.ПараметрыМакета;
	НастройкиОтчета = ДополнительныеПараметры.НастройкиОтчета;
	ФотографииСотрудников = ДополнительныеПараметры.ФотографииСотрудников;
	КадровыйРезервПозиций = ДополнительныеПараметры.КадровыйРезервПозиций;
	
	ОбластьПодразделение 				= ПараметрыМакета.ОбластьПодразделение;
	ОбластьДанныеПозиции 				= ПараметрыМакета.ОбластьДанныеПозиции;
	ОбластьСотрудник 					= ПараметрыМакета.ОбластьСотрудник;
	ОбластьСотрудникФото 				= ПараметрыМакета.ОбластьСотрудникФото;
	ОбластьКадровыйРезервНачало 		= ПараметрыМакета.ОбластьКадровыйРезервНачало;
	ОбластьКадровыйРезервПродолжение 	= ПараметрыМакета.ОбластьКадровыйРезервПродолжение;
	ОбластьКадровыйРезервОкончание 		= ПараметрыМакета.ОбластьКадровыйРезервОкончание;
	ОбластьЧертаСлева 					= ПараметрыМакета.ОбластьЧертаСлева;
	ОбластьУгол 						= ПараметрыМакета.ОбластьУгол;
	ОбластьПустойБлок 					= ПараметрыМакета.ОбластьПустойБлок;
	
	ДатаОтчета 						= НастройкиОтчета.ДатаОтчета;
	ВыводитьКоличествоСтавок 		= НастройкиОтчета.ВыводитьКоличествоСтавок;
	ВыводитьКадровыйРезерв 			= НастройкиОтчета.ВыводитьКадровыйРезерв;
	ВыводитьСотрудников 			= НастройкиОтчета.ВыводитьСотрудников;
	ВыводитьФотографииСотрудников 	= НастройкиОтчета.ВыводитьФотографииСотрудников;
	
	ДокументРезультат.Вывести(ОбластьПустойБлок);
	
	ОбластьПодразделение.Параметры.ПодразделениеНаименование = ДанныеПозиции.ПозицияНаименование;
	ОбластьПодразделение.Параметры.Подразделение = ДанныеПозиции.Позиция;
	ДокументРезультат.Вывести(ОбластьПодразделение);
	
	Если ВыводитьКоличествоСтавок Тогда
		ОбластьДанныеПозиции.Параметры.КоличествоСтавок = ДанныеПозиции.КоличествоСтавок;
		ОбластьДанныеПозиции.Параметры.СвободноСтавок = ДанныеПозиции.КоличествоСтавок - ДанныеПозиции.ЗанятоСтавок;
		ДокументРезультат.Вывести(ОбластьДанныеПозиции);
	КонецЕсли;
	
	Если ВыводитьКадровыйРезерв Тогда 
		КадровыйРезервПозиции = КадровыйРезервПозиций[ДанныеПозиции.Позиция];
		Если КадровыйРезервПозиции <> Неопределено И КадровыйРезервПозиции.Количество() > 0 Тогда 
			ДокументРезультат.Вывести(ОбластьКадровыйРезервНачало);
			МаксимальныйИндекс = КадровыйРезервПозиции.Количество() - 1;
			Для Каждого ДанныеФизическогоЛица Из КадровыйРезервПозиции Цикл 
				ВыводимаяОбласть = ?(КадровыйРезервПозиции.Индекс(ДанныеФизическогоЛица) = МаксимальныйИндекс, ОбластьКадровыйРезервОкончание, ОбластьКадровыйРезервПродолжение);
				ВыводимаяОбласть.Параметры.ФизическоеЛицо = ДанныеФизическогоЛица.Значение;
				ВыводимаяОбласть.Параметры.ФИОПолные = ДанныеФизическогоЛица.Представление;
				ДокументРезультат.Вывести(ВыводимаяОбласть);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыводитьСотрудников Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Для Каждого ДанныеСотрудника Из ДанныеПозиции.Строки Цикл 
			Если ЗначениеЗаполнено(ДанныеСотрудника.Сотрудник) Тогда
				ВыводимаяОбласть = ?(ВыводитьФотографииСотрудников, ОбластьСотрудникФото, ОбластьСотрудник);
				ВыводимаяОбласть.Параметры.Сотрудник = ДанныеСотрудника.Сотрудник;
				ВыводимаяОбласть.Параметры.ФИОПолные = ДанныеСотрудника.ФИОПолные;
				ВыводимаяОбласть.Параметры.ТабельныйНомер = ДанныеСотрудника.ТабельныйНомер;
				//ВыводимаяОбласть.Параметры.Возраст = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(ДанныеСотрудника.ДатаРождения, ДатаОтчета);
				Если ВыводитьФотографииСотрудников Тогда 
					Фотография = ФотографииСотрудников.Получить(ДанныеСотрудника.Сотрудник);
					ВыводимаяОбласть.Рисунки.Фотография.Картинка = ?(Фотография = Неопределено, Новый Картинка, Фотография);
				КонецЕсли;
				ТабличныйДокумент.Вывести(ВыводимаяОбласть);
			КонецЕсли;
		КонецЦикла;
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда 
			ДокументРезультат.Вывести(ОбластьУгол);
			ДокументРезультат.Вывести(ОбластьПустойБлок);
			ДокументРезультат.Присоединить(ТабличныйДокумент.ПолучитьОбласть(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


