
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр КорректировкаФСЗН
	Если ОтклоненияФСЗН <> 0 Тогда 
		Движения.КорректировкаФСЗН.Записывать = Истина;
		Движения.КорректировкаФСЗН.Очистить();
		Движение = Движения.КорректировкаФСЗН.Добавить();
		Движение.Период = ПериодРегистрации;
		Движение.СтатьяЗатрат = СтатьяЗатрат;
		Движение.СуммаКорректировки = ОтклоненияФСЗН;
		Движение.Организация = Организация; //Аверсон 17.07.2020 КВВ СВФР-006279
	КонецЕсли;                     
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
