////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Предопределенные значения справочника "КлассификаторИспользованияРабочегоВремени"
Перем КлассификаторНочноеВремя, КлассификаторВечернееВремя;

// Значение  "ПоДням" перечисления ВидыУчетаВремени
Перем ВидУчетаВремениПоДням;

// Значение  "ПоЧасам" перечисления ВидыУчетаВремени
Перем ВидУчетаВремениПоЧасам;
Перем ВидУчетаВремениПоВечернимЧасам;
Перем ВидУчетаВремениПоНочнымЧасам;
//толик
Перем ВидУчетаВремениПоВредность;

// Массив строк "Первый", "Второй", "Третий" - приставки элементов табличной части документа.
Перем МассивПриставок;

// Значения справочника Классификатор использования рабочего времени. 
Перем КлассификаторЯвка;
Перем КлассификаторНочныеЧасы;
Перем КлассификаторВечерниеЧасы;
//толик
Перем КлассификаторВредность;

Перем КлассификаторПустаяСсылка;
// Индекс записи в наборе записей регистра сведений Графика
Перем ИндексЗаписиЯвка;

// Дата на которую происходит получение записи регистра.
Перем ДатаИндексаЗаписиЯвка;

// Количество часов работы которое проставляется для вида времени ПоДням
Перем ВремяЯвки;

// Структура для поиска строки таблицы значений
Перем СтруктураПоиска;

Перем ТЗ_Переносы, МассивБуквОтменыПереноса; //+ СВЭЙ КДЯ 19.11.19 СВФР-004908

Перем СостояниеПроверкиПереноса; //Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1)
Перем СпЗн_ВидыВремениОтсутствия; //СВЭЙ 24.06.2024 КВВ СВФР-013142
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
Функция СформироватьЗапросПоКатегорииОбъекта(Сотрудник) Экспорт
	Запрос = Новый Запрос;
	КатегорииТекст =" 
	|ВЫБРАТЬ
	|	КатегорииОбъектов.Объект
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = &Категория";
	
	Запрос.Текст = КатегорииТекст;
	Запрос.УстановитьПараметр("Объект", Сотрудник);
	Запрос.УстановитьПараметр("Категория", ПризнакФормированияТабеля);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
КонецФункции

//Аверсон-софт, Плиско Ю.А. 11.11.2014   Начало:      (для Госпиталь)
Процедура ОсновноеМестоРаботыИлиСовместительство_ДобавляемИлиУдаляемСотрудника(СписокСотрудников)  Экспорт
	Если Организация.ИНН ="100765738"  Тогда
		//Доработка актуальна только если выбрано подразделение, т. к. если не выбрано, то попадут все сотрудники
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			// Подразделение по совместительству  - ищем и удаляем если есть сотрудник по основному месту работы 
			Запрос = Новый Запрос;
			Запрос.Текст =   			
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	СотрудникиОрганизаций.Физлицо,
			|	СотрудникиОрганизаций1.Ссылка КАК Ссылка1,
			|	СотрудникиОрганизаций1.Физлицо КАК Физлицо1
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций1
			|		ПО СотрудникиОрганизаций.Физлицо = СотрудникиОрганизаций1.Физлицо
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка в (&СписокСотрудников)
			|	И СотрудникиОрганизаций.ВидЗанятости = &ВидЗанятости    
			|	И СотрудникиОрганизаций1.ВидЗанятости = &ВидЗанятости2";
			
			Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
			Запрос.УстановитьПараметр("ВидЗанятости2", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
			Запрос.УстановитьПараметр("ВидЗанятости", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
			
			Результат = Запрос.Выполнить();
			
			//Аверсон ЕАЕ 15.05.2025 СВФР-015767
			//МассивСотр = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
			МассивСотр = Новый Массив;
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если МассивСотр.Найти(Выборка.Ссылка) = Неопределено Тогда
					МассивСотр.Добавить(Выборка.Ссылка);	
				КонецЕсли;
			КонецЦикла;
			//Аверсон СВФР-015767
			
			Для сч=0 По МассивСотр.ВГраница() Цикл
				Если ТипЗнч(СписокСотрудников) = Тип("ТаблицаЗначений") Тогда
					СтрТЗ = СписокСотрудников.Найти(МассивСотр[Сч],"Ссылка");
					СписокСотрудников.Удалить(СтрТЗ);
				ИначеЕсли ТипЗнч(СписокСотрудников) = Тип("Массив") Тогда
					Индекс = СписокСотрудников.Найти(МассивСотр[Сч]);
					СписокСотрудников.Удалить(Индекс);
				КонецЕсли;
			КонецЦикла; 
			//---
			// Подразделение по основному месту работы - ищем и добавляем по совместительству
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	СотрудникиОрганизаций.Физлицо,
			|	СотрудникиОрганизаций1.Ссылка КАК Ссылка1,
			|	СотрудникиОрганизаций1.Физлицо КАК Физлицо1
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций1
			|		ПО СотрудникиОрганизаций.Физлицо = СотрудникиОрганизаций1.Физлицо
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка в (&СписокСотрудников)
			|	И СотрудникиОрганизаций.ВидЗанятости = &ВидЗанятости    
			|	И СотрудникиОрганизаций1.ВидЗанятости = &ВидЗанятости2";
			
			Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
			Запрос.УстановитьПараметр("ВидЗанятости", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
			Запрос.УстановитьПараметр("ВидЗанятости2", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
			
			Результат = Запрос.Выполнить();
			МассивСотр = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка1");
			
			Для сч=0 По МассивСотр.ВГраница() Цикл
				Если ТипЗнч(СписокСотрудников) = Тип("ТаблицаЗначений") Тогда
					СтрТЗ = СписокСотрудников.Добавить();	
					СтрТЗ.Ссылка = МассивСотр[Сч];
				ИначеЕсли ТипЗнч(СписокСотрудников) = Тип("Массив") Тогда
					СписокСотрудников.Добавить(МассивСотр[Сч]);	
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
Функция ПолучитьМассивПраздников()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "ПериодРегистрации", ЭтотОбъект.ПериодРегистрации );
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаПраздника
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ( Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник )";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "ДатаПраздника" );
	
КонецФункции // ПолучитьМассивПраздников()

Процедура ОчиститьЯчейкуТабеля( СтрокаРасшифровкиПоДням, ИндексЯчейки )
	
	Для каждого ТекПриставка Из МассивПриставок Цикл
		НазваниеЯчейкиВидаВремени = ТекПриставка + "ВидВремени" + ИндексЯчейки;
		НазваниеЯчейкиЧасов = ТекПриставка + "Часов" + ИндексЯчейки;
		СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремени ] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
		СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасов ] = 0;
	КонецЦикла;
	
КонецПроцедуры
//- СВЭЙ КДЯ 27.11.19 СВФР-004908


//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
Функция ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки = Неопределено, ЭтоИндивидГрафик = Ложь ) //Аверсон 08.06.2023 КВВ СВФР-010920 (ЭтоИндивидГрафик)
	Перем БукваЧасы, СтрокаПереноса;
	
	БукваЧасы = Новый Структура( "Буква, Часы", ВыборкаТабеля.БукваВидаВремени, ВыборкаТабеля.ОсновноеЗначение );
	
	Если БукваЧасы.Буква = КлассификаторЯвка ИЛИ БукваЧасы.Буква = КлассификаторНочныеЧасы Тогда
		
		НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки( Новый Структура( "ВыходнойДень", ВыборкаТабеля.Дата ) );
		Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
			СтрокаПереноса = НайденныеСтрокиПереноса[ 0 ];
			ДатаПереносаИз = СтрокаПереноса.РабочийДень;
			
			Если (ДатаПереносаИз < ВыборкаТабеля.Дата // т.е. выходной уже заполнен
				И НачалоМесяца(ДатаПереносаИз) = НачалоМесяца(ВыборкаТабеля.Дата)) //Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 2)
				//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
				ИЛИ ДатаПереносаИз > ВыборкаТабеля.Дата И ТЗ_Неявки <> Неопределено 
				//- СВЭЙ КДЯ 27.11.19 СВФР-004908
				Тогда
				
				
				ИндексЯчейкиВыходного = День( ВыборкаТабеля.Дата );
				//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
				//ОчиститьЯчейкуТабеля( СтрокаРасшифровкиПоДням, ИндексЯчейкиВыходного ); //+ СВЭЙ КДЯ 27.11.19 СВФР-004908
				//- СВЭЙ КДЯ 03.12.19 СВФР-004908
				ИндексЯчейкиРабочего = День( ДатаПереносаИз );
				
				СчПриставок = 0; СчПроставленного = 0; //Аверсон 09.06.2021 КВВ СВФР-007627
				Для каждого ТекПриставка Из МассивПриставок Цикл //+ СВЭЙ КДЯ 27.11.19 СВФР-004908
					//ТекПриставка = "Первый";                           //+ СВЭЙ КДЯ 27.11.19 СВФР-004908
					СчПриставок = СчПриставок + 1; //Аверсон 09.06.2021 КВВ СВФР-007627
					НазваниеЯчейкиВидаВремениРабочего = ТекПриставка + "ВидВремени" + ИндексЯчейкиРабочего;
					НазваниеЯчейкиЧасовРабочего = ТекПриставка + "Часов" + ИндексЯчейкиРабочего;
					БукваРабочего = СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениРабочего ];
					ЧасовРабочего = СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ];
					
					//Аверсон 04.06.2021 КВВ СВФР-007642 (
					ЕстьЯвкаПоверх = Ложь;
					Если ТЗ_Неявки <> Неопределено Тогда
						СчЯ = 0;
						Для каждого Стр Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник ) ) Цикл
							Если Стр.ДатаНачала <= ДатаПереносаИз И ДатаПереносаИз <= Стр.ДатаОкончания Тогда
								Если (Стр.БукваВидаВремени = КлассификаторЯвка 
									ИЛИ Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка //СВЭЙ 30.06.2024 КВВ СВФР-013212
									ИЛИ Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) //СВЭЙ 24.06.2024 КВВ СВФР-013212
									И СчЯ > 0 Тогда
									ЕстьЯвкаПоверх = Истина;
								КонецЕсли;
							КонецЕсли; 	
							СчЯ = СчЯ + 1;
						КонецЦикла; 		
					КонецЕсли;
					//Аверсон 04.06.2021 КВВ СВФР-007642 )
					
					Если НЕ ЗначениеЗаполнено( БукваРабочего ) 
						И БукваЧасы.Буква = КлассификаторЯвка 
						И НЕ ЕстьЯвкаПоверх //Аверсон 04.06.2021 КВВ СВФР-007642
						И ТЗ_Неявки <> Неопределено Тогда
						
						Для каждого Стр Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник ) ) Цикл
							Если Стр.ДатаНачала <= ДатаПереносаИз И ДатаПереносаИз <= Стр.ДатаОкончания Тогда
								СчПроставленного = СчПроставленного + 1; //Аверсон 09.06.2021 КВВ СВФР-007627
								//Аверсон 08.06.2021 КВВ СВФР-007627 (
								Если Организация.ИНН = "700067572" 
									И НЕ ПодразделениеТранспортногоЦеха() 
									И Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
								Иначе
									//Аверсон 08.06.2021 КВВ СВФР-007627 )
									//Аверсон 09.06.2021 КВВ СВФР-007627 (
									Если НЕ (Организация.ИНН = "700067572") 
										ИЛИ (Организация.ИНН = "700067572" 
										И СчПриставок = СчПроставленного) Тогда
										//Аверсон 09.06.2021 КВВ СВФР-007627 )
										БукваРабочего = Стр.БукваВидаВремени;
										СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениРабочего ] = БукваРабочего;
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли; 	
						КонецЦикла; 		
						
					КонецЕсли; 
					
					Если МассивБуквОтменыПереноса.Найти( БукваРабочего ) <> Неопределено Тогда
						
						//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
						//Если БукваЧасы.Буква = КлассификаторЯвка Тогда
						//	СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ] = БукваЧасы.Часы;
						//	БукваЧасы.Буква = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
						//	БукваЧасы.Часы = 0;
						//ИначеЕсли БукваЧасы.Буква = КлассификаторНочныеЧасы Тогда	
						////+ СВЭЙ КДЯ 27.11.19 СВФР-004908
						////	НазваниеЯчейкиВидаВремени = МассивПриставок[ ИндексМассиваПриставок ] + "ВидВремени" + ИндексЯчейкиРабочего;
						////	НазваниеЯчейкиЧасов = МассивПриставок[ ИндексМассиваПриставок ] + "Часов" + ИндексЯчейкиРабочего;
						////	СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремени ] = КлассификаторНочныеЧасы;
						////	СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасов ] = БукваЧасы.Часы;
						////- СВЭЙ КДЯ 27.11.19 СВФР-004908
						//	БукваЧасы.Буква = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
						//	БукваЧасы.Часы = 0;
						//КонецЕсли;
						//- СВЭЙ КДЯ 03.12.19 СВФР-004908
						
						//Аверсон 08.06.2023 КВВ СВФР-010920 (
						Обнулять = Истина;
						Если ЭтоИндивидГрафик И БукваЧасы.Буква = КлассификаторЯвка Тогда
							Если БукваРабочего = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
								ИЛИ БукваРабочего = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь Тогда
								Если ЧасовРабочего = 0 Тогда
									Обнулять = Ложь;
								Иначе
									Сообщить("Проверьте перенесенный день (" + Формат(ВыборкаТабеля.Дата,"ДФ=dd.MM.yyyy") + ") по сотруднику " + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаТабеля.Сотрудник) + " (тн " + Формат(ВыборкаТабеля.Сотрудник.Код,"ЧГ=0") + ")");
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;
						
						//Аверсон ЕАЕ 21.02.2025 СВФР-014858
						Если БукваЧасы.Буква = КлассификаторЯвка И БукваРабочего = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда
							Обнулять = Ложь;
						КонецЕсли;
						//Аверсон СВФР-014858
						
						Если Обнулять Тогда
							//Аверсон 08.06.2023 КВВ СВФР-010920 )
							
							//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
							Если БукваЧасы.Буква = КлассификаторЯвка Тогда
								СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ] = БукваЧасы.Часы;
							КонецЕсли;
							БукваЧасы.Буква = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
							БукваЧасы.Часы = 0;
							
							ОчиститьЯчейкуТабеля( СтрокаРасшифровкиПоДням, ИндексЯчейкиВыходного );
							//- СВЭЙ КДЯ 03.12.19 СВФР-004908
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла; // ТекПриставка Из МассивПриставок  //+ СВЭЙ КДЯ 27.11.19 СВФР-004908
				
				//Аверсон 08.06.2023 КВВ СВФР-010920 (
			Иначе //не в этом месяце дата, откуда переносим
				Если ДатаПереносаИз < ВыборкаТабеля.Дата // т.е. выходной уже заполнен
					И НачалоМесяца(ДатаПереносаИз) < НачалоМесяца(ВыборкаТабеля.Дата)
					И ЭтоИндивидГрафик Тогда
					
					З = Новый Запрос;
					З.Текст = "ВЫБРАТЬ
					|РВРО.ВидИспользованияРабочегоВремени
					|ИЗ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РВРО
					|ГДЕ
					|РВРО.ДатаНачала = &ДатаПроверки
					|И РВРО.Сотрудник = &Сотрудник";
					З.УстановитьПараметр("ДатаПроверки", ДатаПереносаИз);
					З.УстановитьПараметр("Сотрудник", ВыборкаТабеля.Сотрудник);
					РезЗ = З.Выполнить().Выгрузить();
					Если РезЗ.Количество() > 0 Тогда
						БукваРабочего = РезЗ[0].ВидИспользованияРабочегоВремени;
						
						Если БукваЧасы.Буква = КлассификаторЯвка Тогда
							Если БукваРабочего = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
								ИЛИ БукваРабочего = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь Тогда
								Сообщить("Проверьте перенесенный день (" + Формат(ВыборкаТабеля.Дата,"ДФ=dd.MM.yyyy") + ") по сотруднику " + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаТабеля.Сотрудник) + " (тн " + Формат(ВыборкаТабеля.Сотрудник.Код,"ЧГ=0") + ")");
								СчПриставок = 0;
								ИндексЯчейкиВыходного = День( ВыборкаТабеля.Дата );
								БукваЧасы.Буква = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
								БукваЧасы.Часы = 0;
								ОчиститьЯчейкуТабеля( СтрокаРасшифровкиПоДням, ИндексЯчейкиВыходного );
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//Аверсон 08.06.2023 КВВ СВФР-010920 )
				
			КонецЕсли; // ДатаПереносаВ < ВыборкаТабеля.Дата
			
		КонецЕсли; // НайденныеСтрокиПереноса.Количество() > 0
		
	КонецЕсли;  // БукваЧасы.Буква = КлассификаторЯвка ИЛИ БукваЧасы.Буква = КлассификаторНочныеЧасы 
	
	
	Если МассивБуквОтменыПереноса.Найти( БукваЧасы.Буква ) <> Неопределено Тогда
		
		НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки( Новый Структура( "РабочийДень", ВыборкаТабеля.Дата ) );
		Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
			СтрокаПереноса = НайденныеСтрокиПереноса[ 0 ];
			ДатаПереносаВ = СтрокаПереноса.ВыходнойДень;
			
			Если ДатаПереносаВ < ВыборкаТабеля.Дата // т.е. выходной уже заполнен
				И НЕ(НЕ ЗаполнитьПоКадровымДокументам И ЕстьИндивГрафикУСотрудника(СтрокаРасшифровкиПоДням.Сотрудник,ВыборкаТабеля.Дата)) Тогда //Аверсон 14.05.2020 КВВ СВФР-005980
				ИндексЯчейкиРабочего = День( ВыборкаТабеля.Дата );
				ИндексЯчейкиВыходного = День( ДатаПереносаВ );
				
				//очищаем текущую ячейку
				Если ТЗ_Неявки <> Неопределено Тогда
					
					ЧасовИтого = 0;
					Для каждого ТекПриставка Из МассивПриставок Цикл
						НазваниеЯчейкиВидаВремениРабочего = ТекПриставка + "ВидВремени" + ИндексЯчейкиРабочего;
						НазваниеЯчейкиЧасовРабочего = ТекПриставка + "Часов" + ИндексЯчейкиРабочего;
						Если ЗначениеЗаполнено( СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениРабочего ] ) Тогда
							СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениРабочего ] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();	
						КонецЕсли; 
						Если ЗначениеЗаполнено( СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ] ) Тогда
							ЧасовИтого = ЧасовИтого + СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ];
							СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовРабочего ] = 0;	
						КонецЕсли; 
					КонецЦикла; // ТекПриставка Из МассивПриставок 
					Если ЧасовИтого > 0 Тогда
						БукваЧасы.Часы = ЧасовИтого;
					КонецЕсли;
					
				КонецЕсли; // ТЗ_Неявки <> Неопределено
				
				//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
				БылОчищенВидВремениВыходного = Ложь;
				//- СВЭЙ КДЯ 03.12.19 СВФР-004908
				Для каждого ТекПриставка Из МассивПриставок Цикл
					НазваниеЯчейкиВидаВремениВыходного = ТекПриставка + "ВидВремени" + ИндексЯчейкиВыходного;
					НазваниеЯчейкиЧасовВыходного = ТекПриставка + "Часов" + ИндексЯчейкиВыходного;
					БукваВыходного = СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениВыходного ];
					ЧасовВыходного = СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовВыходного ];
					Если БукваВыходного = КлассификаторЯвка Тогда
						БукваЧасы.Часы	= ЧасовВыходного;
						СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениВыходного ] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
						СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовВыходного ] = 0;
						//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
						БылОчищенВидВремениВыходного = Истина;
						//- СВЭЙ КДЯ 03.12.19 СВФР-004908
					ИначеЕсли БукваВыходного = КлассификаторНочныеЧасы Тогда
						//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
						//НазваниеЯчейкиВидаВремени = ТекПриставка + "ВидВремени" + ИндексЯчейкиВТаблице;
						//НазваниеЯчейкиЧасов = ТекПриставка + "Часов" + ИндексЯчейкиВТаблице;
						//СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремени ] = КлассификаторНочныеЧасы;
						//СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасов ] = ЧасовВыходного;
						//- СВЭЙ КДЯ 27.11.19 СВФР-004908
						//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
						СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениВыходного ] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
						СтрокаРасшифровкиПоДням[ НазваниеЯчейкиЧасовВыходного ] = 0;
						//- СВЭЙ КДЯ 27.11.19 СВФР-004908
						//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
						БылОчищенВидВремениВыходного = Истина;
						//- СВЭЙ КДЯ 03.12.19 СВФР-004908
					КонецЕсли;
				КонецЦикла; // ТекПриставка Из МассивПриставок
				
				//+ СВЭЙ КДЯ 03.12.19 СВФР-004908
				Если БылОчищенВидВремениВыходного Тогда
					ОчиститьЯчейкуТабеля( СтрокаРасшифровкиПоДням, ИндексЯчейкиВыходного );
				КонецЕсли; 
				//- СВЭЙ КДЯ 03.12.19 СВФР-004908
				
			КонецЕсли; // ДатаПереносаВ < ВыборкаТабеля.Дата
			
		КонецЕсли; // НайденныеСтрокиПереноса.Количество() > 0
		
	КонецЕсли; // МассивБуквОтменыПереноса.Найти( БукваЧасы.Буква ) <> Неопределено 
	
	Возврат БукваЧасы;
	
КонецФункции	
//- СВЭЙ КДЯ 19.11.19 СВФР-004908


//+ СВЭЙ КДЯ 28.09.19 СВФР-004571
Функция ПолучитьТаблицуПереносов( ДатаНач, ДатаКон )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ISNULL( ПеренесенныеРабочиеДни.РабочийДень, ДАТАВРЕМЯ( 1,1,1 ) ) КАК РабочийДень,
	|	ISNULL( ПеренесенныеРабочиеДни.ВыходнойДень, ДАТАВРЕМЯ( 1,1,1 ) ) КАК ВыходнойДень
	|ИЗ
	|	РегистрСведений.ПеренесенныеРабочиеДни КАК ПеренесенныеРабочиеДни
	|ГДЕ
	|	ПеренесенныеРабочиеДни.РабочийДень МЕЖДУ &ДатаНач И &ДатаКон
	|	ИЛИ  //Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (замена И на ИЛИ)
	|	ПеренесенныеРабочиеДни.ВыходнойДень МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	
	ТаблицаПереносов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПереносов;
	
КонецФункции // ПолучитьТаблицуПереносов()

//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
//Функция ПолучитьБуквуЧасы( ВыборкаТабеля, ТЗ_Табель, ТЗ_Переносы, МассивБуквОтменыПереноса, СтрокаРасшифровкиПоДням  )
//	Перем БукваЧасы, СтрокаПереноса, БукваЯвка;
//	
//	БукваЧасы = Новый Структура( "Буква, Часы", ВыборкаТабеля.БукваВидаВремени, ВыборкаТабеля.ОсновноеЗначение );
//	БукваЯвка = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
//	
//	Если БукваЧасы.Буква = БукваЯвка Тогда
//			
//		НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки( Новый Структура( "ВыходнойДень", ВыборкаТабеля.Дата ) );
//		Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
//			СтрокаПереноса = НайденныеСтрокиПереноса[ 0 ];
//			ДатаПереносаИз = СтрокаПереноса.РабочийДень;
//		
//		    НайдСтрокиТабеля = ТЗ_Табель.НайтиСтроки( Новый Структура( "Сотрудник, Дата", 
//									ВыборкаТабеля.Сотрудник, ДатаПереносаИз ) );
//			Если НайдСтрокиТабеля.Количество() > 0 Тогда
//				СтрокаТабеля = НайдСтрокиТабеля[ 0 ];
//				Если МассивБуквОтменыПереноса.Найти( СтрокаТабеля.БукваВидаВремени ) <> Неопределено Тогда
//					БукваЧасы.Буква	= Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
//					БукваЧасы.Часы	= 0;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли; // НайденныеСтрокиПереноса.Количество() > 0 
//			
//	КонецЕсли;
//	
//	Если МассивБуквОтменыПереноса.Найти( БукваЧасы.Буква ) <> Неопределено Тогда
//		
//		НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки( Новый Структура( "РабочийДень", ВыборкаТабеля.Дата ) );
//		Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
//			СтрокаПереноса = НайденныеСтрокиПереноса[ 0 ];
//			ДатаПереносаВ = СтрокаПереноса.ВыходнойДень;
//				
//		    НайдСтрокиТабеля = ТЗ_Табель.НайтиСтроки( Новый Структура( "Сотрудник, Дата", 
//									ВыборкаТабеля.Сотрудник, ДатаПереносаВ ) );
//			Если НайдСтрокиТабеля.Количество() > 0 Тогда
//				СтрокаТабеля = НайдСтрокиТабеля[ 0 ];
//				Если СтрокаТабеля.БукваВидаВремени = БукваЯвка Тогда
//					БукваЧасы.Часы	= СтрокаТабеля.ОсновноеЗначение;
//				КонецЕсли; 
//			КонецЕсли;						
//		
//		КонецЕсли; // НайденныеСтрокиПереноса.Количество() > 0
//		
//	КонецЕсли; // МассивБуквОтменыПереноса.Найти( БукваЧасы.Буква ) <> Неопределено 
//	
//	Возврат БукваЧасы;
//	
//КонецФункции	
//- СВЭЙ КДЯ 19.11.19 СВФР-004908

Функция	ПолучитьМассивБуквОтменыПереноса()
	Перем МассивБуквОтменыПереноса;
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	КлассификаторИспользованияРабочегоВремени.Ссылка КАК БукваОтменыПереноса
	|ИЗ
	|	Справочник.КлассификаторИспользованияРабочегоВремени КАК КлассификаторИспользованияРабочегоВремени
	|ГДЕ
	|	(КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%Отпуск%""
	|			ИЛИ КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%отпуск%""
	|			ИЛИ КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%Болезнь%""
	|			ИЛИ КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%болезнь%""
	|			ИЛИ КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%Больнич%""
	|			ИЛИ КлассификаторИспользованияРабочегоВремени.Наименование ПОДОБНО ""%больнич%"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлассификаторИспользованияРабочегоВремени.Наименование" );
	МассивБуквОтменыПереноса = 
	Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "БукваОтменыПереноса" );
	Возврат МассивБуквОтменыПереноса;
КонецФункции // ПолучитьМассивБуквОтменыПереноса
//- СВЭЙ КДЯ 28.09.19 СВФР-004571

Функция КолВоЧасовПраздниковПоСотр(Сотрудник,ДатаВыхода)
	//Аверсон 03.06.2021 КВВ СВФР-007334 (
	КолвоЧасов = 0;
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|СУММА(РО.ОтработаноЧасов) КАК Часов 
	|ИЗ ДОкумент.ПриказНаРаботуВПраздничныеИВыходныеДни.РаботникиОрганизации КАК РО
	|ГДЕ РО.Ссылка.Проведен
	|И РО.Сотрудник = &Сотрудник
	|И РО.ДатаВыхода = &ДатаВыхода";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("ДатаВыхода",НачалоДня(ДатаВыхода));
	РезЗ = З.Выполнить().Выгрузить();
	Если РезЗ.Количество() > 0 Тогда
		КолвоЧасов = РезЗ[0].Часов;
	КонецЕсли;
	Возврат КолвоЧасов;
	//Аверсон 03.06.2021 КВВ СВФР-007334 )
КонецФункции

// Функция предназначена для автозаполнения документа
// если заполнен параметр сотрудники, то в табличную часть будут добавлены
// строки по данным сотрудникам.
Функция Автозаполнение(ПостроительЗапроса = Неопределено, Сотрудники = Неопределено, ТекущаяСтрокаТабличнойЧасти = Неопределено,ТолькоСравнениеТабелей = Ложь, ВключатьУволенных = Ложь) Экспорт  //Аверсон 12.07.2019 КВВ СВФР-004487 (ТолькоСравнениеТабелей)  //Аверсон 30.06.2021 КВВ СВФР-007657 (ВключатьУволенных )
	
	СписокКатегорий = Новый СписокЗначений;
	
	РезультатВыбора = ПрочиеПроцедуры.СформироватьМассивДоступныхКатегорийСотрудника(НачалоМесяца(ПериодРегистрации), ПодразделениеОрганизации).Выбрать();
	
	Пока РезультатВыбора.Следующий() Цикл
		
		Если РезультатВыбора.Категория.ТипДокумента = 1 Тогда
			СписокКатегорий.Добавить(РезультатВыбора.Категория);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнениеНеВыодить = Ложь;
	
	СписокВидовРасчетов = Новый СписокЗначений;
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	
	//Аверсон 28.01.2022 СВФР-008561 (пункт 5) (
	Для Каждого Стр Из Справочники.ГруппыРасчетов.ДопВидыНачисленийДляТабеля.Основные Цикл 
		СписокВидовРасчетов.Добавить(Стр.ВидРасчета);
	КонецЦикла;
	//Аверсон 28.01.2022 СВФР-008561 (пункт 5) ) 
	
	
	//О.Т. Аверсон 04.04.2018 № 1816
	СпособыРасчета = Новый СписокЗначений;
	СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	//О.Т. Аверсон 04.04.2018 № 1816
	
	//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (
	СостояниеПроверкиПереноса = Новый СписокЗначений;
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ГосударственныеОбязанности);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДеньДонора);
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам);
	//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) )
	СостояниеПроверкиПереноса.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком); //Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 4)
	
	
	ЗапросАвтоЗаполнения = Новый Запрос;
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	ЗапросАвтоЗаполнения.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ТрудовойДоговор", Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
	ЗапросАвтоЗаполнения.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
	ЗапросАвтоЗаполнения.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц", ПериодРегистрации);
	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц1", КонецМесяца(ПериодРегистрации));//Островская Татьяна 31.07.2013 № 16675
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоДням", ВидУчетаВремениПоДням);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоЧасам", ВидУчетаВремениПоЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоВечернимЧасам", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоНочнымЧасам", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторЯ", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторВЧ", КлассификаторВечернееВремя);
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторНЧ", КлассификаторНочноеВремя);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ЗапросАвтоЗаполнения.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойДокумент", Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка());
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("СверхНормы", Перечисления.ВидыВремени.ОтработанноеСверхНормы);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойКлассификатор", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоЧасам", Перечисления.ВидыУчетаВремени.ПоЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоВечерним", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам); 
	
	ВидыВремениУчитываемыеВВыходные = Новый Массив(2);
	ВидыВремениУчитываемыеВВыходные[0] = Перечисления.ВидыВремени.ОтработанноеСверхНормы;
	ВидыВремениУчитываемыеВВыходные[1] = Перечисления.ВидыВремени.ЦелодневноеНеотработанное;
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидыВремениУчитываемыеВВыходные", ВидыВремениУчитываемыеВВыходные);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидРасчета", СписокВидовРасчетов);
	ЗапросАвтоЗаполнения.УстановитьПараметр("СпособыРасчета", СпособыРасчета);//О.Т. Аверсон 04.04.2018 № 1816
	//О.Т. 23.03.2015 № 
	Простой = Новый СписокЗначений;
	Простой.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Простой);
	Простой.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника);
	Простой.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("Простой", Простой);
	//О.Т. 23.03.2015 № 
	//Островская 15.03.2014 №
	СписокВакансий = Новый СписокЗначений;
	СписокВакансий.Добавить("Вакансия");
	СписокВакансий.Добавить("вакансия");
	СписокВакансий.Добавить("ВАКАНСИЯ");
	СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
	СписокВакансий.Добавить("вакансия 1 1");
	ЗапросАвтоЗаполнения.УстановитьПараметр("Наименование", СписокВакансий);
	//Островская 15.03.2014 №
	
	Если ПостроительЗапроса = Неопределено Тогда 
		
		Если Сотрудники = Неопределено Тогда
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СписокКатегорий = Новый СписокЗначений;
				Для Каждого СтрТЧКат Из Категории Цикл
					СписокКатегорий.Добавить(СтрТЧКат.Категория);
				КонецЦикла;
				ЗапросАвтоЗаполнения.УстановитьПараметр("СписокКатегорий", СписокКатегорий);
			КонецЕсли;
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			//Аверсон 07.09.2020 КВВ СВФР-006526 (
			СотрудникиТекст = "ВЫБРАТЬ 0 КАК Цифра 
			|ПОМЕСТИТЬ Цифры 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 1 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 2 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 3 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 4 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 5 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 6 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 7 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 8 
			|ОБЪЕДИНИТЬ ВЫБРАТЬ 9
			|; 
			|
			|ВЫБРАТЬ 
			|    ДОБАВИТЬКДАТЕ(&НачалоМесяца, ДЕНЬ, СписокДней.Дней) КАК Период
			|ПОМЕСТИТЬ ВтДат
			|ИЗ
			|    (ВЫБРАТЬ 
			|        СотниТысяч.Цифра * 100000 + ДесяткиТысяч.Цифра * 10000 + Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра КАК Дней
			|    ИЗ
			|        Цифры КАК СотниТысяч
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК ДесяткиТысяч
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Тысячи
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Сотни
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Десятки
			|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цифры КАК Единицы
			|        ПО (Десятки.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|            И (Единицы.Цифра <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|        ПО (Сотни.Цифра * 100 <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|        ПО (Тысячи.Цифра * 1000 <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|        ПО (ДесяткиТысяч.Цифра * 10000 <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|        ПО (СотниТысяч.Цифра * 100000 <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ))
			|    ГДЕ
			|        СотниТысяч.Цифра * 100000 + ДесяткиТысяч.Цифра * 10000 + Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра <= РАЗНОСТЬДАТ(&НачалоМесяца, &КонецМесяца, ДЕНЬ)) КАК СписокДней
			|;
			|
			|ВЫБРАТЬ *,
			|&НачалоМесяца КАК ПериодЗапроса,
			|&НачалоМесяца 
			|ПОМЕСТИТЬ ВтРаботникиОрганизацийНаКаждуюДатуПериода
			|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца) КАК РаботникиОрганизаций1
			|ГДЕ ВЫБОР КОГДА &Подразделение = &ПустоеПодразделение ТОГДА ИСТИНА
			|ИНАЧЕ РаботникиОрганизаций1.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение) КОНЕЦ
			|И РаботникиОрганизаций1.Организация = &ГоловнаяОрганизация
			|
			|ОБЪЕДИНИТЬ 
			|
			|
			|ВЫБРАТЬ *,
			|ВтДат.Период КАК ПериодЗапроса 
			|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций2
			|
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтДат КАК ВтДат
			|ПО РаботникиОрганизаций2.Период = ВтДат.Период
			|ГДЕ 
			|ВЫБОР КОГДА &Подразделение = &ПустоеПодразделение ТОГДА ИСТИНА
			|ИНАЧЕ РаботникиОрганизаций2.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение) КОНЕЦ
			|И ВтДат.Период <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|И РаботникиОрганизаций2.Организация = &ГоловнаяОрганизация
			|;
			|";
			//Аверсон 07.09.2020 КВВ СВФР-006526 )
			
			СотрудникиТекст = СотрудникиТекст + 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОрганизаций.Сотрудник КАК Ссылка,
			|	РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
			|Поместить ВТСотрудники // ПСА 11-01-2021 СВФР-007034 +++
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
			|		КОНЕЦ = &ОбособленноеПодразделение
			|	И (ВЫБОР
			|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
			|			КОНЕЦ В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|	И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	РаботникиОрганизаций.Сотрудник,
			|	РаботникиОрганизаций.Сотрудник.Код
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	РаботникиОрганизаций.Период > &НачалоМесяца
			|	И РаботникиОрганизаций.Период <= &КонецМесяца
			|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
			|	И (РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)";
			
			
			Если НЕ ВключатьУволенных Тогда   //Аверсон 30.06.2021 КВВ СВФР-007657
				СотрудникиТекст = СотрудникиТекст + "
				//Аверсон 08.06.2021 КВВ СВФР-007657 (
				|И ВЫБОР
				|	КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
				|			И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|		ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
				|	ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
				|КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)"; 
				//Аверсон 08.06.2021 КВВ СВФР-007657 )
			КонецЕсли;
			
			СотрудникиТекст = СотрудникиТекст + "
			|	И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	Работники.Сотрудник,
			|	Работники.Сотрудник.Код
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК Работники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
			|		ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
			|			И (ПериодыПерекрытия.Период > Работники.Период)
			|			И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
			|			И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
			|ГДЕ
			|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И Работники.ПериодЗавершения > &НачалоМесяца
			|	И Работники.ПериодЗавершения <= &КонецМесяца
			|	И Работники.Организация = &ГоловнаяОрганизация
			|	И Работники.ОбособленноеПодразделениеЗавершения = &ОбособленноеПодразделение
			|	И (Работники.ПодразделениеОрганизацииЗавершения В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
			|	И НЕ Работники.Сотрудник.Физлицо.Наименование В (&Наименование)";
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И Работники.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ //О.Т. Аверсон 10.06.2016 Учитывать кадровое перемещение, если меняется подразделение.
			|	РаботникиОрганизаций.Сотрудник,
			|	РаботникиОрганизаций.Сотрудник.Код
			|ИЗ";
			
			//Аверсон 07.09.2020 КВВ СВФР-006526 (  (стало для всех)
			////Аверсон 16.03.2020 КВВ СВФР-005632 (
			//Если Организация.ИНН = "690662297" Тогда
			СотрудникиТекст = СотрудникиТекст + "
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних 
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
			|		ВтРаботникиОрганизацийНаКаждуюДатуПериода"; //Аверсон 07.09.2020 КВВ СВФР-006526 Срез добавлен
			//|		РегистрСведений.РаботникиОрганизаций";  
			//Иначе
			//	//Аверсон 16.03.2020 КВВ СВФР-005632 )
			//	СотрудникиТекст = СотрудникиТекст + "
			//	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			//	|				&КонецМесяца,
			//	|				Организация = &ГоловнаяОрганизация
			//	|					И НЕ регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций)";
			//КонецЕсли;
			//Аверсон 07.09.2020 КВВ СВФР-006526 )  (стало для всех)
			
			СотрудникиТекст = СотрудникиТекст + "
			|		КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|			РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
			|		ИЗ
			|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|				ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|		ГДЕ
			|			ВЫБОР
			|					КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|							И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
			|					ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
			|				КОНЕЦ = &ОбособленноеПодразделение
			|			И (НЕ ВЫБОР
			|							КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|									И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|								ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
			|							ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
			|						КОНЕЦ В ИЕРАРХИИ (&Подразделение)
			|					ИЛИ &Подразделение = &ПустоеПодразделение)
			|			И ВЫБОР
			|					КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|							И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
			|					ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
			|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|			И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|			И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			|			И НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &НачалоМесяца
			|			И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК ВложенныйЗапрос
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
			|		КОНЕЦ = &ОбособленноеПодразделение
			|	И (ВЫБОР
			|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
			|			КОНЕЦ В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|	И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
			
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			//Аверсон 07.09.2020 КВВ СВФР-006526 (  (стало для всех)
			////Аверсон 16.03.2020 КВВ СВФР-005632 (
			//Если Организация.ИНН = "690662297" Тогда
			СотрудникиТекст = СотрудникиТекст + "
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период Между &НачалоМесяца и &КонецМесяца  
			|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация";  
			//|	И РаботникиОрганизаций.Период Между &НачалоМесяца и &КонецМесяца"; //Аверсон 18.03.2020 КВВ СВФР-005708
			//КонецЕсли;
			////Аверсон 16.03.2020 КВВ СВФР-005632 )
			//Аверсон 07.09.2020 КВВ СВФР-006526 )  (стало для всех)
			
			СотрудникиТекст = СотрудникиТекст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РаботникиОрганизаций.Сотрудник,
			|	РаботникиОрганизаций.Сотрудник.Код
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|				&КонецМесяца,
			|				Организация = &ГоловнаяОрганизация
			|					И НЕ регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|			РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
			|		ИЗ
			|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|				ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|		ГДЕ
			|			РаботникиОрганизаций.Период > &НачалоМесяца
			|			И РаботникиОрганизаций.Период <= &КонецМесяца
			|			И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|			И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
			|			И (НЕ РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
			|					ИЛИ &Подразделение = &ПустоеПодразделение)";
			
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			|	И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
			|			И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
			|			И НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &НачалоМесяца
			|			И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК ВложенныйЗапрос
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
			|ГДЕ
			|	РаботникиОрганизаций.Период > &НачалоМесяца
			|	И РаботникиОрганизаций.Период <= &КонецМесяца
			|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
			|	И (РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
			
			//Аверсон 14.01.2021 КВВ СВФР-006517 (
			Если Организация.ИНН = "700067572" И ПоКатегориям И Категории.Количество() > 0 Тогда
				СотрудникиТекст = СотрудникиТекст + "
				|	И РаботникиОрганизаций.Должность.Категория В(&СписокКатегорий)";				
			КонецЕсли;
			СотрудникиТекст = СотрудникиТекст + "
			//Аверсон 14.01.2021 КВВ СВФР-006517 )
			
			// ПСА 11-01-2021 СВФР-007034 +++
			|; 
			|
			|Выбрать Различные
			|	ВТСотрудники.Ссылка КАК Ссылка,
			|	ВТСотрудники.СотрудникКод КАК СотрудникКод
			|Из ВТСотрудники КАК ВТСотрудники  
			// +++ПСА 11-01-2021 СВФР-007034
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникКод"; //О.Т. Аверсон 10.06.2016 Учитывать кадровое перемещение, если меняется подразделение.
			
			ЗапросАвтоЗаполнения.Текст = СотрудникиТекст;
			СписокСотрудников = ЗапросАвтоЗаполнения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Ложь);
		Иначе
			СписокСотрудников = Сотрудники;
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Истина);
		КонецЕсли;
	Иначе
		//Островская Татьяна 24.10.2013 № 16872
		ИсходныйТекстПостроителя = ПостроительЗапроса.Текст;
		
		//Аверсон 03.12.2022 КВВ СВФР-009933 (
		Если Организация.ИНН ="100765738"  Тогда 
			НайтиУсловиеПоТНСотрудникаВсе = "";  
			НайтиПараметр1 = 0; НайтиПараметр2 = 0;
			ЗначениеПараметра1 = ""; ЗначениеПараметра2 = "";
			НайтиУсловиеПоТНСотрудникаПервое = Найти(ИсходныйТекстПостроителя, "И РаботникиОрганизации.Сотрудник.Код ");
			Если НайтиУсловиеПоТНСотрудникаПервое <> 0 Тогда
				НайтиУсловиеПоТНСотрудникаВсе = Сред(ИсходныйТекстПостроителя,НайтиУсловиеПоТНСотрудникаПервое+1,Найти(ИсходныйТекстПостроителя, "ИНДЕКСИРОВАТЬ ПО")-НайтиУсловиеПоТНСотрудникаПервое-3) + " ";
				НайтиПараметр1 = Число(Сред(НайтиУсловиеПоТНСотрудникаВсе,Найти(НайтиУсловиеПоТНСотрудникаВсе,"&Параметр")+9,2));
				ОбезатьСтр = Сред(НайтиУсловиеПоТНСотрудникаВсе,Найти(НайтиУсловиеПоТНСотрудникаВсе,"&Параметр")+11);
				УсловиеДальше = Найти(НайтиУсловиеПоТНСотрудникаВсе,"И ПлановыеНачислениия.ВидРасчетаОклад");				
				Если УсловиеДальше > 0 Тогда
					НайтиУсловиеПоТНСотрудникаВсе = Лев(НайтиУсловиеПоТНСотрудникаВсе,УсловиеДальше-1);
				КонецЕсли;
				Если СтрДлина(ОбезатьСтр) > 11 Тогда
					НайтиПараметр2 = Число(Сред(ОбезатьСтр,Найти(ОбезатьСтр,"&Параметр")+9,2));
				КонецЕсли;
			КонецЕсли;
			Если НайтиПараметр1 <> 0 Тогда
				Для АА = 1 По 12 Цикл
					Если АА = НайтиПараметр1 Тогда
						ЗначениеПараметра1 = ?(АА=1,ПостроительЗапроса.Параметры.Параметр1,?(АА=2,ПостроительЗапроса.Параметры.Параметр2,?(АА=3,ПостроительЗапроса.Параметры.Параметр3,?(АА=4,ПостроительЗапроса.Параметры.Параметр4,?(АА=5,ПостроительЗапроса.Параметры.Параметр5,?(АА=6,ПостроительЗапроса.Параметры.Параметр6,?(АА=7,ПостроительЗапроса.Параметры.Параметр7,?(АА=8,ПостроительЗапроса.Параметры.Параметр8,?(АА=9,ПостроительЗапроса.Параметры.Параметр9,?(АА=10,ПостроительЗапроса.Параметры.Параметр10,?(АА=11,ПостроительЗапроса.Параметры.Параметр11,ПостроительЗапроса.Параметры.Параметр12)))))))))));
						Прервать;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если НайтиПараметр2 <> 0 Тогда
				Для АА = 1 По 12 Цикл
					Если АА = НайтиПараметр2 Тогда
						ЗначениеПараметра2 = ?(АА=1,ПостроительЗапроса.Параметры.Параметр1,?(АА=2,ПостроительЗапроса.Параметры.Параметр2,?(АА=3,ПостроительЗапроса.Параметры.Параметр3,?(АА=4,ПостроительЗапроса.Параметры.Параметр4,?(АА=5,ПостроительЗапроса.Параметры.Параметр5,?(АА=6,ПостроительЗапроса.Параметры.Параметр6,?(АА=7,ПостроительЗапроса.Параметры.Параметр7,?(АА=8,ПостроительЗапроса.Параметры.Параметр8,?(АА=9,ПостроительЗапроса.Параметры.Параметр9,?(АА=10,ПостроительЗапроса.Параметры.Параметр10,?(АА=11,ПостроительЗапроса.Параметры.Параметр11,ПостроительЗапроса.Параметры.Параметр12)))))))))));
						Прервать;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 03.12.2022 КВВ СВФР-009933 )
		
		ТекстЗапросаПоСпискуРаботников = СтрЗаменить(ИсходныйТекстПостроителя,"РАЗРЕШЕННЫЕ","");
		//ТекстЗапросаПоСпискуРаботников = Лев(ТекстЗапросаПоСпискуРаботников, Найти(ТекстЗапросаПоСпискуРаботников,"УПОРЯДОЧИТЬ") - 1);
		ПостроительЗапроса.Текст = ТекстЗапросаПоСпискуРаботников;
		ПостроительЗапроса.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ПостроительЗапроса.Выполнить();
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРаботников.Сотрудник КАК Ссылка
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Сотрудник
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&КонецМесяца,
		|				Организация = &ГоловнаяОрганизация
		|					И НЕ регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК РаботникиОрганизаций
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
		|				ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|							И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
		|					ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
		|				КОНЕЦ = &ОбособленноеПодразделение
		|			И (НЕ ВЫБОР
		|							КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|									И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		|							ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		|						КОНЕЦ В ИЕРАРХИИ (&Подразделение)
		|					ИЛИ &Подразделение = &ПустоеПодразделение)
		|			И ВЫБОР
		|					КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|							И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
		|					ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
		|			И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
		|			И НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &НачалоМесяца
		|			И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК ВложенныйЗапрос
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
		|		КОНЕЦ = &ОбособленноеПодразделение
		|	И (ВЫБОР
		|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		|				ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		|			КОНЕЦ В ИЕРАРХИИ (&Подразделение)
		|			ИЛИ &Подразделение = &ПустоеПодразделение)
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
		|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
		|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&КонецМесяца,
		|				Организация = &ГоловнаяОрганизация
		|					И НЕ регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК РаботникиОрганизаций
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
		|				ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
		|		ГДЕ
		|			РаботникиОрганизаций.Период > &НачалоМесяца
		|			И РаботникиОрганизаций.Период <= &КонецМесяца
		|			И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
		|			И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|			И (НЕ РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
		|					ИЛИ &Подразделение = &ПустоеПодразделение)
		|			И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
		|			И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
		|			И НАЧАЛОПЕРИОДА(РаботникиОрганизаций.Период, МЕСЯЦ) = &НачалоМесяца
		|			И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций) КАК ВложенныйЗапрос
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
		|ГДЕ
		|	РаботникиОрганизаций.Период > &НачалоМесяца
		|	И РаботникиОрганизаций.Период <= &КонецМесяца
		|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
		|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|	И (РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
		|			ИЛИ &Подразделение = &ПустоеПодразделение)
		|			И (ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|	  ИЛИ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета В (&СпособыРасчета))
		|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)";
		ПостроительЗапроса.Текст = СотрудникиТекст;
		ПостроительЗапроса.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
		ПостроительЗапроса.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		ПостроительЗапроса.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		ПостроительЗапроса.УстановитьПараметр("ВидРасчета", СписокВидовРасчетов);
		ПостроительЗапроса.УстановитьПараметр("СпособыРасчета", СпособыРасчета);//О.Т. Аверсон 04.04.2018 № 1816
		ПостроительЗапроса.УстановитьПараметр("Наименование", СписокВакансий);
		ПостроительЗапроса.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
		ПостроительЗапроса.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
		
		ПостроительЗапроса.Выполнить();
		СписокСотрудников = ПостроительЗапроса.Выполнить().Выгрузить();//.ВыгрузитьКолонку("Ссылка");
		
		//Аверсон 03.12.2022 КВВ СВФР-009933 (
		Если Организация.ИНН ="100765738" И СписокСотрудников.Количество() > 0 И НайтиУсловиеПоТНСотрудникаВсе <> "" 
			И (НайтиПараметр1 <> 0 ИЛИ НайтиПараметр2 <> 0) Тогда
			ТЗСотрудников = Новый ТаблицаЗначений;	 
			ТЗСотрудников.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
			ЗПоТЗСотрудников = Новый Запрос;
			ЗПоТЗСотрудников.Текст = 
			"ВЫБРАТЬ
			|ТЗСотрудников.Ссылка КАК Сотрудник
			|ПОМЕСТИТЬ ВтТЗСотрудников
			|ИЗ &ТЗСотрудников КАК ТЗСотрудников
			|;
			|ВЫБРАТЬ
			|РаботникиОрганизации.Сотрудник КАК Ссылка
			|ИЗ ВтТЗСотрудников КАК РаботникиОрганизации
			|ГДЕ " + НайтиУсловиеПоТНСотрудникаВсе;
			ЗПоТЗСотрудников.УстановитьПараметр("ТЗСотрудников",СписокСотрудников);	
			ЗПоТЗСотрудников.УстановитьПараметр("Параметр" + Строка(НайтиПараметр1),ЗначениеПараметра1);	
			ЗПоТЗСотрудников.УстановитьПараметр("Параметр" + Строка(НайтиПараметр2),ЗначениеПараметра2);	
			РезЗПоТЗСотрудников = ЗПоТЗСотрудников.Выполнить().Выгрузить();
			СписокСотрудников = РезЗПоТЗСотрудников; 
		КонецЕсли;
		//Аверсон 03.12.2022 КВВ СВФР-009933 )
		
		//Островская Татьяна 24.10.2013 № 16872
		ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Ложь);
	КонецЕсли;
	//----------------------------
	//Аверсон-софт, Плиско Ю.А. 11.11.2014   Начало:      (для Госпиталь)
	ОсновноеМестоРаботыИлиСовместительство_ДобавляемИлиУдаляемСотрудника(СписокСотрудников);
	//Аверсон-софт, Плиско Ю.А. 11.11.2014  конец
	//----------------------------
	ЗапросАвтоЗаполнения.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросАвтоЗаполнения.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ГодПериода = Формат(Год(ПериодРегистрации), "ЧГ=4");
	МесяцПериода = Месяц(ПериодРегистрации);
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДатаТабеля
	|	
	|ПОМЕСТИТЬ ВТДатыТабеля 
	|	ИЗ (
	|	ВЫБРАТЬ
	|	ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " , " + День(ДатаНачалаПериода) + ") КАК ДатаТабеля
	|	";           
	Для НомерДня = День(ДатаНачалаПериода) + 1 По День(ДатаОкончанияПериода) Цикл
		ТекстЗапроса = ТекстЗапроса + 
		"ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|  ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " ," + НомерДня + ")
		|	";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
	ЗапросАвтоЗаполнения.Текст = ТекстЗапроса;
	ЗапросАвтоЗаполнения.Выполнить();
	
	//ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ
	//|	ДатыТабеля.ДатаТабеля,
	//|	Начисления.Сотрудник,
	//|	Начисления.ГрафикРаботы,
	//|	Начисления.ВидРасчета,
	//|	Начисления.ВидУчетаВремени,
	//|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
	//|	Начисления.ПериодДействияНачало,
	//|	Начисления.ПериодДействияКонец,
	//|	ВЫБОР КОГДА (Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)) ТОГДА
	//|		ВЫБОР КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало ТОГДА
	//|			Начисления.ОтработаноЧасов
	//|		ИНАЧЕ
	//|			0
	//|		КОНЕЦ
	//|	ИНАЧЕ 
	//|		NULL
	//|	КОНЕЦ КАК ВремяЗаДень
	//|ПОМЕСТИТЬ ВТОсновныеНачисления
	//|ИЗ 
	//|	ВТДатыТабеля КАК ДатыТабеля
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
	//|ПО
	//|	ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец
	//|	И НЕ Начисления.Сторно
	//|	И Начисления.ПериодДействия = &Месяц
	//|	И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	//|	И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
	//|ПО
	//|	ДатыТабеля.ДатаТабеля МЕЖДУ СторноНачисления.ПериодДействияНачало И СторноНачисления.ПериодДействияКонец
	//|	И СторноНачисления.Сторно
	//|	И СторноНачисления.Сотрудник = Начисления.Сотрудник
	//|	И СторноНачисления.ВидРасчета = Начисления.ВидРасчета
	//|	И СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации
	//|	И СторноНачисления.ПериодДействия = &Месяц
	//|	И СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	//|	И НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))
	//|ГДЕ
	//|	СторноНачисления.Сотрудник Есть NULL
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Начисления.Сотрудник,
	//|	ДатыТабеля.ДатаТабеля,
	//|	Начисления.ВидРасчета";
	
	//Аверсон 12.07.2019 КВВ СВФР-004487 (
	Если НЕ ТолькоСравнениеТабелей Тогда
		ЗначениеФлага_ЗаполнитьПоКадровымДокументам = ЗаполнитьПоКадровымДокументам;
	Иначе
		ЗначениеФлага_ЗаполнитьПоКадровымДокументам = ?(ЗаполнитьПоКадровымДокументам,Ложь,Истина);
	КонецЕсли;
	//Аверсон 12.07.2019 КВВ СВФР-004487 )
	
	Если не ЗначениеФлага_ЗаполнитьПоКадровымДокументам Тогда 
		ЗапросАвтоЗаполнения.Текст = "
		//Аверсон 01.07.2021 КВВ СВФР-007795 (
		|ВЫБРАТЬ 
		|СторноНачисления.Сотрудник,
		|СторноНачисления.ВидРасчета как ВидРасчета,
		|СторноНачисления.ПериодРегистрации,
		|СторноНачисления.ПериодДействия,
		|МИНИМУМ(СторноНачисления.ПериодДействияНачало) КАК От,
		|МАКСИМУМ(СторноНачисления.ПериодДействияКонец) КАК До
		|ПОМЕСТИТЬ Интервалы
		|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
		|ГДЕ  СторноНачисления.ПериодДействия = &Месяц
		|И СторноНачисления.Сторно
		|И (СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор)
		|И (НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы)))	
		|СГРУППИРОВАТЬ ПО 
		|Сотрудник,
		|ВидРасчета,
		|ПериодРегистрации,
		|ПериодДействия
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|Край.От,
		|Край.Сотрудник,
		|Край.ВидРасчета,
		|Край.ПериодРегистрации,
		|Край.ПериодДействия
		|ПОМЕСТИТЬ ЛевыеКрая
		|ИЗ
		|Интервалы КАК Край
		|ЛЕВОЕ СОЕДИНЕНИЕ Интервалы КАК Интервалы
		|ПО (Интервалы.От < Край.От)
		|И Край.От <= Интервалы.До
		|ГДЕ
		|Интервалы.От ЕСТЬ NULL 
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|Край.До
		|ПОМЕСТИТЬ ПравыеКрая
		|ИЗ
		|Интервалы КАК Край
		|ЛЕВОЕ СОЕДИНЕНИЕ Интервалы КАК Интервалы
		|ПО (Интервалы.От <= Край.До)
		|И Край.До < Интервалы.До
		|ГДЕ
		|Интервалы.От ЕСТЬ NULL 
		|;
		|ВЫБРАТЬ
		|ЛевыеКрая.От как ПериодДействияНачало,
		|МИНИМУМ(ПравыеКрая.До) КАК ПериодДействияКонец,
		|ЛевыеКрая.Сотрудник,
		|ЛевыеКрая.ВидРасчета,
		|ЛевыеКрая.ПериодРегистрации,
		|ЛевыеКрая.ПериодДействия
		|ПОМЕСТИТЬ ВтСторноЗаписей
		|ИЗ
		|ЛевыеКрая КАК ЛевыеКрая
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравыеКрая КАК ПравыеКрая
		|ПО ЛевыеКрая.От <= ПравыеКрая.До
		|СГРУППИРОВАТЬ ПО
		|ЛевыеКрая.От,
		|ЛевыеКрая.Сотрудник,
		|ЛевыеКрая.ВидРасчета,
		|ЛевыеКрая.ПериодРегистрации,
		|ЛевыеКрая.ПериодДействия
		|;
		//Аверсон 01.07.2021 КВВ СВФР-007795 )
		
		|
		|ВЫБРАТЬ
		|	ДатыТабеля.ДатаТабеля,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	ВЫБОР
		|		КОГДА Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
		|			ТОГДА ВЫБОР
		|					КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало
		|						ТОГДА ВЫБОР
		|								КОГДА Начисления.ОтработаноЧасов = 0
		|									ТОГДА Начисления.ОплаченоДнейЧасов
		|								ИНАЧЕ Начисления.ОтработаноЧасов
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ
		
		//Аверсон ЕАЕ 02.05.2025 СВФР-015198
		|       КОГДА Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
		|       ТОГДА ВЫБОР
		|             КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало
		|             ТОГДА Начисления.ОплаченоДнейЧасов
		|             ИНАЧЕ 0
		|             КОНЕЦ
		//Аверсон СВФР-015198
		
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (&Простой)
		|					ТОГДА Начисления.ОплаченоДнейЧасов
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ВремяЗаДень,
		|	Начисления.ОплаченоДнейЧасов,
		|	Начисления.ОплаченоДней
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	ВТДатыТабеля КАК ДатыТабеля
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Начисления.Сотрудник КАК Сотрудник,
		|			Начисления.Сотрудник.Код КАК СотрудникКод,
		|			Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|			Начисления.ВидРасчета КАК ВидРасчета,
		|			Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|			Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|			Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|			Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|			Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов,
		|			Начисления.ОплаченоДней КАК ОплаченоДней,
		|			СторноНачисления.Сотрудник КАК СторноСотрудник,
		|			СторноНачисления.ПериодДействияНачало КАК СторноПериодНачало,
		|			СторноНачисления.ПериодДействияКонец КАК СторноПериодКонец
		|		ИЗ
		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
		|				ЛЕВОЕ СОЕДИНЕНИЕ 
		
		//Аверсон 01.07.2021 КВВ СВФР-007795 (
		|				ВтСторноЗаписей
		//|РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) 
		//Аверсон 01.07.2021 КВВ СВФР-007795 )
		
		|				КАК СторноНачисления
		|				ПО 
		//|					(СторноНачисления.Сторно) И //Аверсон 01.07.2021 КВВ СВФР-007795 (закомментировано)
		|					(НЕ Начисления.Сторно)
		|					И (СторноНачисления.Сотрудник = Начисления.Сотрудник)
		|					И (СторноНачисления.ВидРасчета = Начисления.ВидРасчета)
		|					И (СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации)
		|					И (СторноНачисления.ПериодДействия = &Месяц)
		//|					И (СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор)   //Аверсон 01.07.2021 КВВ СВФР-007795 (закомментировано)
		//|					И (НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))) //Аверсон 01.07.2021 КВВ СВФР-007795 (закомментировано)
		|		ГДЕ
		//|			СторноНачисления.Сотрудник ЕСТЬ NULL //О.Т. Аверсон 14.05.2018 № 1962
		|			 НЕ Начисления.Сторно
		|			И Начисления.ПериодДействия = &Месяц
		|			И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
		|			И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))) КАК Начисления
		|		ПО (ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
		|ГДЕ
		|	НЕ Начисления.Сотрудник.Физлицо.Наименование В (&Наименование)
		//О.Т. Аверсон 14.05.2018 № 1962 
		|	И ВЫБОР
		|			КОГДА ДатыТабеля.ДатаТабеля >= Начисления.СторноПериодНачало
		|					И ДатыТабеля.ДатаТабеля <= Начисления.СторноПериодКонец
		|				ТОГДА ЕСТЬNULL(Начисления.СторноСотрудник, 0) = 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//О.Т. Аверсон 14.05.2018 № 1962
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ДатыТабеля.ДатаТабеля,
		|	ВидРасчета";
		ЗапросАвтоЗаполнения.Выполнить();
		
		ЗапросАвтоЗаполнения.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.Месяц,
		|	ГрафикиРаботыПоВидамВремени.Дата,
		|	ГрафикиРаботыПоВидамВремени.План,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
		|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
		|	ГрафикиРаботыПоВидамВремени.Документ
		|ПОМЕСТИТЬ ВТГрафикиРаботыПоВидамВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
		|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник В (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
		|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
		|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
		|			КОНЕЦ <> &ПустойГрафик
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.ГрафикРаботы
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
		|		И РаботникиОрганизаций.Период > &НачалоМесяца
		|		И РаботникиОрганизаций.Период <= &КонецМесяца
		|		И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Работники.ГрафикРаботыЗавершения
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК Работники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
		|			ПО ПериодыПерекрытия.Период <= Работники.ПериодЗавершения
		|				И ПериодыПерекрытия.Период > Работники.Период
		|				И ПериодыПерекрытия.Сотрудник = Работники.Сотрудник
		|	ГДЕ
		|		Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		И Работники.ПериодЗавершения > &НачалоМесяца
		|		И Работники.ПериодЗавершения <= &КонецМесяца
		|		И Работники.ГрафикРаботыЗавершения <> &ПустойГрафик
		|		И ПериодыПерекрытия.Период ЕСТЬ NULL 
		|		И Работники.Сотрудник В(&СписокСотрудников)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВыбранныеСотрудники.Ссылка
		|	ИЗ
		|		Справочник.СотрудникиОрганизаций КАК ВыбранныеСотрудники
		|	ГДЕ
		|		ВыбранныеСотрудники.Ссылка В(&СписокСотрудников)) КАК ГрафикиРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ГрафикиРаботы.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка)
		|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ПустойДокумент)
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
		|			И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
		|			И ((НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ))
		|ГДЕ
		|	(НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL )
		|ИНДЕКСИРОВАТЬ ПО
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.Месяц,
		|	ГрафикиРаботыПоВидамВремени.Дата,
		|	ГрафикиРаботыПоВидамВремени.План,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
		ЗапросАвтоЗаполнения.Выполнить();
		
		ТекстГрафики = ЗапросАвтоЗаполнения.Текст; //Островская Татьяна 01.04.2014 № 17
		
		Если СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ВЦеломЗаПериод Тогда
			
			
			ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТОсновныеНачисления.ДатаТабеля,
			|	ВТОсновныеНачисления.Сотрудник,
			|	ВТОсновныеНачисления.ГрафикРаботы,
			|	ВТОсновныеНачисления.ВидРасчета,
			|	ВТОсновныеНачисления.ВидВремени,
			|	ВТОсновныеНачисления.ПериодДействияНачало,
			|	ВТОсновныеНачисления.ПериодДействияКонец,
			|	ВТОсновныеНачисления.ВремяЗаДень,
			|	ВТОсновныеНачисления.ОплаченоДнейЧасов,
			|	ВТОсновныеНачисления.ОплаченоДней
			|ПОМЕСТИТЬ ВТОтредактированныеНачисления
			|ИЗ
			|	ВТОсновныеНачисления КАК ВТОсновныеНачисления
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВТОсновныеНачисления.ДатаТабеля,
			|	ВТОсновныеНачисления.Сотрудник,
			|	ВТОсновныеНачисления.ГрафикРаботы,
			|	""ПланируемаяЯвка"",
			|	NULL,
			|	ВТОсновныеНачисления.ПериодДействияНачало,
			|	ВТОсновныеНачисления.ПериодДействияКонец,
			|	ВТОсновныеНачисления.ВремяЗаДень,
			|	ВТОсновныеНачисления.ОплаченоДнейЧасов,
			|	ВТОсновныеНачисления.ОплаченоДней
			|ИЗ
			|	ВТОсновныеНачисления КАК ВТОсновныеНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеНачисления КАК Явки
			|		ПО (Явки.ДатаТабеля = ВТОсновныеНачисления.ДатаТабеля)
			|			И (Явки.Сотрудник = ВТОсновныеНачисления.Сотрудник)
			|			И (Явки.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы)
			|			И (Явки.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеВПределахНормы))
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
			|		ПО (ГрафикиРаботы.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы)
			|			И (ГрафикиРаботы.Дата = ВТОсновныеНачисления.ДатаТабеля)
			|			И (ГрафикиРаботы.ВидУчетаВремени = ВТОсновныеНачисления.ВидУчетаВремени)
			|ГДЕ
			|	Явки.Сотрудник ЕСТЬ NULL 
			|	И ГрафикиРаботы.ОсновноеЗначение > 0
			|	И ВТОсновныеНачисления.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)";
			
			ЗапросАвтоЗаполнения.Выполнить();
			
			// Заполнение за целый период.
			ЗапросАвтоЗаполненияТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|	СотрудникиОрганизаций.Код Как СотрудникКод,
			|	ЕСТЬNULL(ПосчитанноеВремя.Дней, 0) КАК Дней,
			|	ЕСТЬNULL(ПосчитанноеВремя.Часов, 0) КАК Часов,
			|	ЕСТЬNULL(ПосчитанноеВремя.ЧасовВечерних, 0) КАК ЧасовВечерних,
			|	ЕСТЬNULL(ПосчитанноеВремя.ЧасовНочных, 0) КАК ЧасовНочных,
			|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
			|	Значение(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники) иначе
			|	ПосчитанноеВремя.ВидВремени конец КАК ВидВремени,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
				|	""Праздник"" иначе
				|	ЕстьNull(ПосчитанноеВремя.ВидВремени.Наименование,""Я1"") конец  КАК ВидВремениСтрока,
				|	ПосчитанноеВремя.Праздник,
				|	ПосчитанноеВремя.Регистратор,
				|	ПосчитанноеВремя.ДатаНачала,
				|	ПосчитанноеВремя.ДатаОкончания";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
				|	""Праздник"" иначе
				|	ЕстьNull(ПосчитанноеВремя.ВидВремени.Наименование,""Я1"") конец  КАК ВидВремениСтрока,
				|	ПосчитанноеВремя.Праздник";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|			ЕСТЬNULL(СводныеИндивидуальныеГрафики.Дней, ПосчитаннаяНормаВремени.ОсновноеЗначениеПоДням) КАК Дней,
			|			ЕСТЬNULL(СводныеИндивидуальныеГрафики.Часов, ПосчитаннаяНормаВремени.ОсновноеЗначениеПоЧасам) КАК Часов,
			|			ЕСТЬNULL(СводныеИндивидуальныеГрафики.ЧасовВечерних, ПосчитаннаяНормаВремени.ОсновноеЗначениеПоВечерним) КАК ЧасовВечерних,
			|			ЕСТЬNULL(СводныеИндивидуальныеГрафики.ЧасовНочных, ПосчитаннаяНормаВремени.ОсновноеЗначениеПоНочным) КАК ЧасовНочных,
			|			ПосчитаннаяНормаВремени.Праздник КАК Праздник,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|			ПосчитаннаяНормаВремени.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидВремени,
				|			ПосчитаннаяНормаВремени.Регистратор,
				|			ПосчитаннаяНормаВремени.ДатаНачала,
				|			ПосчитаннаяНормаВремени.ДатаОкончания";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|			ПосчитаннаяНормаВремени.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидВремени";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
			|		ИЗ
			|			Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ (
			|				ВЫБРАТЬ
			|	ДниСотрудников.Сотрудник КАК Сотрудник,
			|	СУММА(ВЫБОР
			|			КОГДА ДневныеНеявки.ВидВремени = 1
			|				ТОГДА 0
			|			КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|				ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ДополнительноеЗначение, ОбщиеГрафики.ДополнительноеЗначение)
			|		КОНЕЦ) КАК ОсновноеЗначениеПоДням,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ ДневныеНеявки.ВремяЗаДень ЕСТЬ NULL 
			|					И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|					И ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|					И ДневныеНеявки.ВремяЗаДень > 0
			|				ТОГДА ДневныеНеявки.ВремяЗаДень
			|			КОГДА ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
			|					И ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|				ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение)
			|			КОГДА ДневныеНеявки.ВидВремени = 1
			|					И ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|				ТОГДА ЕСТЬNULL(ДневныеНеявки.ВремяЗаДень, 0)
			|			КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|				ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) - ЕСТЬNULL(ДневныеНеявки.ВремяЗаДень, 0)
			|		КОНЕЦ) КАК ОсновноеЗначениеПоЧасам,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ ДневныеНеявки.Сотрудник ЕСТЬ NULL 
			|					И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|				ТОГДА 0
			|			КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоВечерним
			|				ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение)
			|		КОНЕЦ) КАК ОсновноеЗначениеПоВечерним,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ ДневныеНеявки.Сотрудник ЕСТЬ NULL 
			|					И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|				ТОГДА 0
			|			КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоНочным
			|				ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение)
			|		КОНЕЦ) КАК ОсновноеЗначениеПоНочным,
			|	КОЛИЧЕСТВО(ВведенныеТабеля.ГрафикРаботы) КАК ВведенныеТабеля,
			|	ВЫБОР
			|		КОГДА ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
			|			ТОГДА NULL
			|		ИНАЧЕ ДневныеНеявки.ВидРасчета
			|	КОНЕЦ КАК ВидРасчета,
			|	ЕСТЬNULL(ЛОЖЬ, ИСТИНА) КАК ДействуетВесьПериод,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР
				|		КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|			ТОГДА ""Праздник""
				|	КОНЕЦ КАК Праздник,
				|	РаботникиОрганизаций.Регистратор,
				|	МИНИМУМ(ДниСотрудников.Дата) КАК ДатаНачала,
				|	МАКСИМУМ(ДниСотрудников.Дата) КАК ДатаОкончания,
				|	ВЫБОР
				|	КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|		ТОГДА ДниСотрудников.Дата
				|	КОНЕЦ КАК Поле1";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР
				|		КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|			ТОГДА ""Праздник""
				|	КОНЕЦ КАК Праздник";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДатыПериода.ДатаТабеля КАК Дата,
			|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаИзменения
			|	ИЗ
			|		ВТДатыТабеля КАК ДатыПериода
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ПО (РаботникиОрганизаций.Сотрудник В (&СписокСотрудников))
			|				И (РаботникиОрганизаций.Период <= ДатыПериода.ДатаТабеля)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиОрганизаций.Сотрудник,
			|		ДатыПериода.ДатаТабеля) КАК ДниСотрудников
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|		ПО (РаботникиОрганизаций.Сотрудник = ДниСотрудников.Сотрудник)
			|			И (РаботникиОрганизаций.Период = ДниСотрудников.ДатаИзменения)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВведенныеТабеля
			|		ПО (ВведенныеТабеля.ГрафикРаботы = ДниСотрудников.Сотрудник)
			|			И (НЕ ВведенныеТабеля.План)
			|			И (ВведенныеТабеля.Документ <> &ДокументСсылка)
			|			И (ВведенныеТабеля.Документ <> &ПустойДокумент)
			|			И (ВведенныеТабеля.Дата = ДниСотрудников.Дата)
			|			И (ВведенныеТабеля.ВидУчетаВремени = &ПоЧасам)
			|			И (ВведенныеТабеля.Документ ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			
			//СВЭЙ 27.05.2024 КВВ СВФР-013107 (
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК УжеВведенныеТабеля
			|ПО УжеВведенныеТабеля.Сотрудник = ДниСотрудников.Сотрудник
			|И УжеВведенныеТабеля.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации 
			|И УжеВведенныеТабеля.ВЦеломЗаПериод
			|И УжеВведенныеТабеля.Регистратор <> &ДокументСсылка
			|И УжеВведенныеТабеля.Период МЕЖДУ &Месяц И &Месяц1
			//СВЭЙ 27.05.2024 КВВ СВФР-013107 )
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныеГрафики
			|		ПО (ИндивидуальныеГрафики.ГрафикРаботы = ДниСотрудников.Сотрудник)
			|			И (ИндивидуальныеГрафики.План)
			|			И (ИндивидуальныеГрафики.Дата = ДниСотрудников.Дата)
			|			И (ИндивидуальныеГрафики.ВидУчетаВремени В (&ПоЧасам, &ПоВечерним, &ПоНочным))
			|			И (ИндивидуальныеГрафики.Документ ССЫЛКА Документ.ВводИндивидуальныхГрафиковРаботыОрганизации)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ОбщиеГрафики
			|		ПО (ОбщиеГрафики.ГрафикРаботы = ВЫБОР
			|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= ДниСотрудников.Дата
			|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизаций.ГрафикРаботыЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ГрафикРаботы
			|			КОНЕЦ)
			|			И (ОбщиеГрафики.План)
			|			И (ОбщиеГрафики.Дата = ДниСотрудников.Дата)
			|			И (ОбщиеГрафики.ВидУчетаВремени В (&ПоЧасам, &ПоВечерним, &ПоНочным))
			|			И (ИндивидуальныеГрафики.ГрафикРаботы ЕСТЬ NULL )
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтредактированныеНачисления КАК ДневныеНеявки
			|		ПО (ДневныеНеявки.Сотрудник = ДниСотрудников.Сотрудник)
			|			И ДниСотрудников.Дата = ДневныеНеявки.ДатаТабеля
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
			|		ПО (РаботникиОрганизацийУвольнения.Сотрудник = ДниСотрудников.Сотрудник)
			|			И (РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|		ПО ДниСотрудников.Дата = РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
			|ГДЕ
			|	(РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL 
			|			ИЛИ РаботникиОрганизацийУвольнения.Период > ДниСотрудников.Дата)
			
			//СВЭЙ 27.05.2024 КВВ СВФР-013107 (
			|И УжеВведенныеТабеля.НомерСтроки ЕСТЬ NULL
			//СВЭЙ 27.05.2024 КВВ СВФР-013107 )
			
			|
			|СГРУППИРОВАТЬ ПО
			|	ДниСотрудников.Сотрудник,
			|	ВЫБОР
			|		КОГДА ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
			|			ТОГДА NULL
			|		ИНАЧЕ ДневныеНеявки.ВидРасчета
			|	КОНЕЦ,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР
				|		КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|			ТОГДА ""Праздник""
				|	КОНЕЦ,
				|	РаботникиОрганизаций.Регистратор,
				|	ВЫБОР
				|	КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|		ТОГДА ДниСотрудников.Дата
				|	КОНЕЦ) КАК ПосчитаннаяНормаВремени";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР
				|		КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
				|			ТОГДА ""Праздник""
				|	КОНЕЦ) КАК ПосчитаннаяНормаВремени";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 
			|					
			|				ПО ПосчитаннаяНормаВремени.Сотрудник = СотрудникиОрганизаций.Ссылка
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
			|				ПО СводныеИндивидуальныеГрафики.Сотрудник = СотрудникиОрганизаций.Ссылка
			|					И (СводныеИндивидуальныеГрафики.Месяц = &Месяц)
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК СводныеТабеля
			|				ПО СводныеТабеля.Сотрудник = СотрудникиОрганизаций.Ссылка
			|					И (СводныеТабеля.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			|					И (СводныеТабеля.Регистратор <> &ДокументСсылка)";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	И СводныеТабеля.ДатаНачала МЕЖДУ ПосчитаннаяНормаВремени.ДатаНачала И ПосчитаннаяНормаВремени.ДатаОкончания";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	И (СводныеТабеля.Период Между &Месяц и &Месяц1)";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 
			|		ГДЕ
			|			СотрудникиОрганизаций.Ссылка В(&СписокСотрудников)
			|			И ПосчитаннаяНормаВремени.ВведенныеТабеля = 0
			|			И СводныеТабеля.Сотрудник ЕСТЬ NULL 
			|			И (СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ NULL 
			|					ИЛИ ПосчитаннаяНормаВремени.ДействуетВесьПериод)
			|					) КАК ПосчитанноеВремя
			|		ПО ПосчитанноеВремя.Сотрудник = СотрудникиОрганизаций.Ссылка
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка В(&СписокСотрудников)
			|	И (&ВключатьВРезультатПустыеЗаписи
			|			ИЛИ (НЕ ПосчитанноеВремя.Часов ЕСТЬ NULL ))
			|Сгруппировать по
			|	СотрудникиОрганизаций.Ссылка,
			|	СотрудникиОрганизаций.Код,
			|	ЕСТЬNULL(ПосчитанноеВремя.Дней, 0),
			|	ЕСТЬNULL(ПосчитанноеВремя.Часов, 0),
			|	ЕСТЬNULL(ПосчитанноеВремя.ЧасовВечерних, 0),
			|	ЕСТЬNULL(ПосчитанноеВремя.ЧасовНочных, 0),
			|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
			|	Значение(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники) иначе
			|	ПосчитанноеВремя.ВидВремени конец,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
				|	""Праздник"" иначе
				|	ЕстьNull(ПосчитанноеВремя.ВидВремени.Наименование,""Я1"") конец,
				|	ПосчитанноеВремя.Праздник,
				|	ПосчитанноеВремя.Регистратор,
				|	ПосчитанноеВремя.ДатаНачала,
				|	ПосчитанноеВремя.ДатаОкончания";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +" 	
				|	ВЫБОР КОГДА ПосчитанноеВремя.Праздник = ""Праздник"" ТОГДА 
				|	""Праздник"" иначе
				|	ЕстьNull(ПосчитанноеВремя.ВидВремени.Наименование,""Я1"") конец,
				|	ПосчитанноеВремя.Праздник";
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникКод ВОЗР,
			|	Сотрудник ВОЗР,";
			Если Организация.ИНН="100765738" Тогда 
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
				|	ПосчитанноеВремя.ДатаНачала,
				|	ВидВремениСтрока УБЫВ";
			иначе
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст +"
				|	ВидВремениСтрока УБЫВ";    //Островская Татьяна 31.07.2013 № 16675
			КонецЕсли;
			
			
			
		Иначе
			// Заполнение с разбивкой по дням.
			
			ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТОсновныеНачисления.ДатаТабеля,
			|	ВТОсновныеНачисления.Сотрудник,
			|	ВТОсновныеНачисления.ГрафикРаботы,
			|	ВТОсновныеНачисления.ВидРасчета,
			|	ВТОсновныеНачисления.ВидВремени,
			|	ВТОсновныеНачисления.ПериодДействияНачало,
			|	ВТОсновныеНачисления.ПериодДействияКонец,
			|	ВТОсновныеНачисления.ВремяЗаДень
			|ПОМЕСТИТЬ ВТОтредактированныеНачисления
			|ИЗ
			|	ВТОсновныеНачисления
			|	
			|ОБЪЕДИНИТЬ 
			|
			|
			|ВЫБРАТЬ
			|	ВТОсновныеНачисления.ДатаТабеля,
			|	ВТОсновныеНачисления.Сотрудник,
			|	ВТОсновныеНачисления.ГрафикРаботы,
			|	""ПланируемаяЯвка"", 
			|	NULL,
			|	ВТОсновныеНачисления.ПериодДействияНачало,
			|	ВТОсновныеНачисления.ПериодДействияКонец,
			|	ВТОсновныеНачисления.ВремяЗаДень
			|ИЗ
			|	ВТОсновныеНачисления
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	ВТОсновныеНачисления КАК Явки
			|ПО
			|	Явки.ДатаТабеля = ВТОсновныеНачисления.ДатаТабеля
			|	И Явки.Сотрудник = ВТОсновныеНачисления.Сотрудник
			|	И (Явки.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы 
			|		ИЛИ Явки.ГрафикРаботы = ВТОсновныеНачисления.Сотрудник)
			|	И Явки.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеВПределахНормы)
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	ВТГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
			|ПО
			|	ГрафикиРаботы.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
			|	И ГрафикиРаботы.Дата = ВТОсновныеНачисления.ДатаТабеля
			|	И ГрафикиРаботы.ВидУчетаВремени = ВТОсновныеНачисления.ВидУчетаВремени
			|ГДЕ
			|	Явки.Сотрудник ЕСТЬ NULL
			|	И ГрафикиРаботы.ОсновноеЗначение > 0 
			|	И ВТОсновныеНачисления.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)";
			ЗапросАвтоЗаполнения.Выполнить();
			
			
			ЗапросАвтоЗаполненияТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сотрудники.Ссылка КАК Сотрудник,
			|	Сотрудники.Код КАК СотрудникКод,
			|	ДниСотрудников.Дата,
			|	ДЕНЬ(ДниСотрудников.Дата) КАК День,
			|	ДниСотрудников.ВидВремени КАК БукваВидаВремени,
			|	ДниСотрудников.ОсновноеЗначение,
			|	ВЫБОР
			|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторЯ
			|			ТОГДА 1
			|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторВЧ
			|			ТОГДА 2
			|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторНЧ
			|			ТОГДА 3
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК ПорядокСортировки,
			|	ДниСотрудников.ОсновноеЗначение1,
			|	ДниСотрудников.ЗначениеДляПростоя
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК Сотрудники
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ДниСотрудников.Сотрудник КАК Сотрудник,
			|			ДниСотрудников.Дата КАК Дата,
			|			ВЫБОР
			|				КОГДА НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|						И (ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
			|							ИЛИ ДневныеНеявки.ВидРасчета.ВидВремени В (&ВидыВремениУчитываемыеВВыходные))
			|					ТОГДА ДневныеНеявки.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени
			|				КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
			|					ТОГДА ВЫБОР
			|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
			|								ТОГДА &КлассификаторЯ
			|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоВечерним
			|								ТОГДА &КлассификаторВЧ
			|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоНочным
			|								ТОГДА &КлассификаторНЧ
			|						КОНЕЦ
			|			КОНЕЦ КАК ВидВремени,
			|			ВЫБОР
			|				КОГДА НЕ ДневныеНеявки.ВремяЗаДень ЕСТЬ NULL 
			|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|						И (ДневныеНеявки.ВремяЗаДень > 0
			|							ИЛИ ДневныеНеявки.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
			|					ТОГДА ДневныеНеявки.ВремяЗаДень
			|				КОГДА ДневныеНеявки.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (&Простой)
			|					ТОГДА ДневныеНеявки.ВремяЗаДень
			|				КОГДА НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
			|						И (ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
			|							ИЛИ ДневныеНеявки.ВидРасчета.ВидВремени В (&ВидыВремениУчитываемыеВВыходные))
			|					ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ЕСТЬNULL(ОбщиеГрафики.ОсновноеЗначение, 0))
			|				КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
			|					ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение)
			|			КОНЕЦ КАК ОсновноеЗначение,
			|			ВЫБОР
			|				КОГДА ИндивидуальныеГрафики.ОсновноеЗначение > 0
			|					ТОГДА ИндивидуальныеГрафики.ОсновноеЗначение
			|				ИНАЧЕ 0
			|			КОНЕЦ КАК ОсновноеЗначение1,
			|			ИндивидуальныеГрафики.ОсновноеЗначение КАК ОсновноеЗначение2,
			|			ЕстьNull(ИндивидуальныеГрафики.ОсновноеЗначение,ОбщиеГрафики.ОсновноеЗначение) КАК ЗначениеДляПростоя
			|		ИЗ
			|			(ВЫБРАТЬ
			|				ДатыПериода.ДатаТабеля КАК Дата,
			|				РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|				МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаИзменения
			|			ИЗ
			|				ВТДатыТабеля КАК ДатыПериода
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|					ПО (РаботникиОрганизаций.Сотрудник В (&СписокСотрудников))
			|						И (РаботникиОрганизаций.Период <= ДатыПериода.ДатаТабеля)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РаботникиОрганизаций.Сотрудник,
			|				ДатыПериода.ДатаТабеля) КАК ДниСотрудников
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|				ПО (РаботникиОрганизаций.Сотрудник = ДниСотрудников.Сотрудник)
			|					И (РаботникиОрганизаций.Период = ДниСотрудников.ДатаИзменения)
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВведенныеТабеля
			|				ПО (ВведенныеТабеля.ГрафикРаботы = ДниСотрудников.Сотрудник)
			|					И (НЕ ВведенныеТабеля.План)
			|					И (ВведенныеТабеля.Дата = ДниСотрудников.Дата)
			|					И (ВведенныеТабеля.ВидУчетаВремени = &ПоЧасам)
			|					И (ВведенныеТабеля.Документ ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
			|				ПО (СводныеИндивидуальныеГрафики.Сотрудник = ДниСотрудников.Сотрудник)
			|					И (СводныеИндивидуальныеГрафики.Месяц = &Месяц)";
			
			//Аверсон 07.09.2020 КВВ СВФР-006526 (  (убрано для всех)
			//Если НЕ Организация.ИНН = "690662297" Тогда  //Аверсон 16.03.2020 КВВ СВФР-005632
			//	ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			//	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК СводныеТабеля
			//	|				ПО (СводныеТабеля.Сотрудник = ДниСотрудников.Сотрудник)
			//	|					И (СводныеТабеля.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			//	|					И (СводныеТабеля.Регистратор <> &ДокументСсылка)
			//	|					И (СводныеТабеля.Период МЕЖДУ &Месяц И &Месяц1)";
			//КонецЕсли;
			//Аверсон 07.09.2020 КВВ СВФР-006526 )  (убрано для всех)
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОтредактированныеНачисления КАК ДневныеНеявки
			|				ПО (ДневныеНеявки.Сотрудник = ДниСотрудников.Сотрудник)
			|					И ДниСотрудников.Дата = ДневныеНеявки.ДатаТабеля
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныеГрафики
			|				ПО (ИндивидуальныеГрафики.ГрафикРаботы = ДниСотрудников.Сотрудник)
			|					И (ИндивидуальныеГрафики.План)
			|					И (ИндивидуальныеГрафики.Дата = ДниСотрудников.Дата)
			|					И (ИндивидуальныеГрафики.ВидУчетаВремени = &ПоЧасам
			|						ИЛИ ИндивидуальныеГрафики.ВидУчетаВремени В (&ПоВечерним, &ПоНочным)
			|							И ИндивидуальныеГрафики.ОсновноеЗначение > 0)
			|					И (ИндивидуальныеГрафики.Документ ССЫЛКА Документ.ВводИндивидуальныхГрафиковРаботыОрганизации)
			|					И (ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|						ИЛИ ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
			|						ИЛИ ИндивидуальныеГрафики.ВидУчетаВремени = &ПоЧасам)
			|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ОбщиеГрафики
			|				ПО (ОбщиеГрафики.ГрафикРаботы = ВЫБОР
			|						КОГДА РаботникиОрганизаций.ПериодЗавершения <= ДниСотрудников.Дата
			|								И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизаций.ГрафикРаботыЗавершения
			|						ИНАЧЕ РаботникиОрганизаций.ГрафикРаботы
			|					КОНЕЦ)
			|					И (ОбщиеГрафики.План)
			|					И (ОбщиеГрафики.Дата = ДниСотрудников.Дата)
			|					И (ОбщиеГрафики.ВидУчетаВремени = &ПоЧасам
			|						ИЛИ ОбщиеГрафики.ВидУчетаВремени В (&ПоВечерним, &ПоНочным)
			|							И ОбщиеГрафики.ОсновноеЗначение > 0)
			|					И (ИндивидуальныеГрафики.ГрафикРаботы ЕСТЬ NULL )
			|					И (ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|						ИЛИ ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
			|						ИЛИ ОбщиеГрафики.ВидУчетаВремени = &ПоЧасам)
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
			|				ПО (РаботникиОрганизацийУвольнения.Сотрудник = ДниСотрудников.Сотрудник)
			|					И (РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))//О.Т. Аверсон 10.06.2016 № 
			|		ГДЕ
			|			(РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL 
			|					ИЛИ РаботникиОрганизацийУвольнения.Период > ДниСотрудников.Дата)
			|			И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик";
			
			//Аверсон 07.09.2020 КВВ СВФР-006526 (  (убрано для всех)
			//Если НЕ Организация.ИНН = "690662297" Тогда  //Аверсон 16.03.2020 КВВ СВФР-005632
			//	ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			//	|			И СводныеТабеля.НомерСтроки ЕСТЬ NULL"; 
			//КонецЕсли;
			//Аверсон 07.09.2020 КВВ СВФР-006526 )  (убрано для всех)
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|			И ВведенныеТабеля.ГрафикРаботы ЕСТЬ NULL 
			|			И СводныеИндивидуальныеГрафики.НомерСтроки ЕСТЬ NULL 
			|			И (НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|					ИЛИ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
			|						И ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0)
			|			) КАК ДниСотрудников
			
			|		ПО (НЕ ДниСотрудников.ВидВремени ЕСТЬ NULL )
			|			И (ДниСотрудников.Сотрудник = Сотрудники.Ссылка)
			|ГДЕ
			|	Сотрудники.Ссылка В(&СписокСотрудников)
			|	И (&ВключатьВРезультатПустыеЗаписи
			|			ИЛИ НЕ ДниСотрудников.ВидВремени ЕСТЬ NULL )
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникКод,
			|	Сотрудник,
			|	День,
			|	ПорядокСортировки";
		КонецЕсли;  //Островская Татьяна 31.07.2013 № 16675
		
		ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполненияТекст;
		РезультатЗапроса = ЗапросАвтоЗаполнения.Выполнить();
	иначе  // вкл флаг "ЗаполнитьПоКадровымДокументам"
		
		Если СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ПоДням Тогда
			
			ЗапросАвтоЗаполнения.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	ГрафикиРаботыПоВидамВремени.Месяц,
			|	ГрафикиРаботыПоВидамВремени.Дата,
			|	ГрафикиРаботыПоВидамВремени.План,
			|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
			|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
			|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
			|	ГрафикиРаботыПоВидамВремени.Документ
			|ПОМЕСТИТЬ ВТГрафикиРаботыПоВидамВремени
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВЫБОР
			|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
			|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
			|		КОНЕЦ КАК ГрафикРаботы
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник В (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних
			|	ГДЕ
			|		ВЫБОР
			|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
			|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
			|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
			|			КОНЕЦ <> &ПустойГрафик
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		РаботникиОрганизаций.ГрафикРаботы
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|	ГДЕ
			|		РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
			|		И РаботникиОрганизаций.Период > &НачалоМесяца
			|		И РаботникиОрганизаций.Период <= &КонецМесяца
			|		И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Работники.ГрафикРаботыЗавершения
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций КАК Работники
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
			|			ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
			|				И (ПериодыПерекрытия.Период > Работники.Период)
			|				И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
			|	ГДЕ
			|		Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		И Работники.ПериодЗавершения > &НачалоМесяца
			|		И Работники.ПериодЗавершения <= &КонецМесяца
			|		И Работники.ГрафикРаботыЗавершения <> &ПустойГрафик
			|		И ПериодыПерекрытия.Период ЕСТЬ NULL 
			|		И Работники.Сотрудник В(&СписокСотрудников)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ВыбранныеСотрудники.Ссылка
			|	ИЗ
			|		Справочник.СотрудникиОрганизаций КАК ВыбранныеСотрудники
			|	ГДЕ
			|		ВыбранныеСотрудники.Ссылка В(&СписокСотрудников)) КАК ГрафикиРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|		ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ГрафикиРаботы.ГрафикРаботы)
			|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка)
			|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ПустойДокумент)
			|			И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
			|			И (НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL )
			|			И (ГрафикиРаботыПоВидамВремени.Месяц МЕЖДУ &Месяц И &Месяц1)
			|ГДЕ
			|	НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL 
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	ГрафикиРаботыПоВидамВремени.Месяц,
			|	ГрафикиРаботыПоВидамВремени.Дата,
			|	ГрафикиРаботыПоВидамВремени.План,
			|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
			ЗапросАвтоЗаполнения.Выполнить();
			
			ЗапросАвтоЗаполненияТекст = 
			"ВЫБРАТЬ
			|	ПериодыСостоянийРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|	ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания КАК ДатаОкончания,
			|	ПериодыСостоянийРаботниковОрганизаций.ДатаНачала КАК ДатаНачала
			|ПОМЕСТИТЬ ЗавершенияОкончание
			|ИЗ
			|	РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
			|ГДЕ
			|	ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций";
			
			//Аверсон 26.05.2021 КВВ СВФР-007334 (
			Если Организация.ИНН = "700067572" ИЛИ Организация.ИНН = "806000046" Тогда  //Аверсон 01.12.2021 КВВ СВФР-008430 (пункт 1, Стравита)
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|СостояниеРаботниковОрганизаций.Сотрудник КАК Сотрудник,
				|ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.Период,ДЕНЬ,-1) КАК ДатаОкончания,
				|ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаНачала
				|ИЗ
				|РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
				|ГДЕ
				|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
				|И СостояниеРаботниковОрганизаций.Сотрудник  В(&СписокСотрудников) 
				|И СостояниеРаботниковОрганизаций.Регистратор.ОтражатьИзмененияПоПродлению
				|И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)";
				
			КонецЕсли;
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			//Аверсон 26.05.2021 КВВ СВФР-007334 )
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПериодыСостоянийРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.ДатаНачала < &Месяц
			|			ТОГДА &Месяц
			|		ИНАЧЕ ПериодыСостоянийРаботниковОрганизаций.ДатаНачала
			|	КОНЕЦ КАК ДатаНачала,
			|	МИНИМУМ(ВЫБОР
			|			КОГДА ЗавершенияОкончание.ДатаОкончания >= &Месяц
			|					И ЗавершенияОкончание.ДатаОкончания <= &Месяц1
			|				ТОГДА ЗавершенияОкончание.ДатаОкончания
			|			ИНАЧЕ &Месяц1
			|		КОНЕЦ) КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
			//Аверсон 17.12.2020 КВВ СВФР-006517 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные)
			//Аверсон 17.12.2020 КВВ СВФР-006517 )
			//Аверсон 25.01.2021 КВВ СВФР-007084 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньОтдыхаЗаСверхрочные)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньОтдыхаЗаСверхрочные)
			//Аверсон 25.01.2021 КВВ СВФР-007084 )
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СправкаПоУходуЗаРебенком)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньДонора)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньДонора)
			//Аверсон 05.01.2021 КВВ СВФР-006517 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньДонораБезОплаты)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.АлкогольноеНаркотическоеОпьянение)
			
			//Аверсон ЕАЕ 04.09.2025 СВФР-014651
			//|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
			//Аверсон СВФР-014651 
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Медкомиссия)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Медкомиссия)
			//Аверсон 05.01.2021 КВВ СВФР-006517 )
			
			//СВЭЙ 27.05.2024 КВВ СВФР-012926 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньОтдыха)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньОтдыха)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПрохождениеДиспансеризации)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПрохождениеДиспансеризации)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Обучение)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
			//СВЭЙ 27.05.2024 КВВ СВФР-012926 )
			
			//Аверсон 09.03.2021 КВВ СВФР-007310 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку)
			//Аверсон 09.03.2021 КВВ СВФР-007310 )
			
			//Аверсон 23.08.2023 КВВ СВФР-011294 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработкуСоревнования)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования)
			//Аверсон 23.08.2023 КВВ СВФР-011294 )
			
			//Аверсон 18.04.2023 КВВ СВФР-010714 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствиеПоИнициативеНанимателя)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтсутствиеПоИнициативеНанимателя)
			//Аверсон 18.04.2023 КВВ СВФР-010714 )
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоКоллДоговору)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			//Аверсон 22.03.2021 КВВ СВФР-007331 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоСостояниюЗдоровья) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья) 	
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускСамоизоляция) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция) 			
			//Аверсон 22.03.2021 КВВ СВФР-007331 )
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйОтРаботыДень)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень)
			
			//Аверсон ЕАЕ 19.03.2025 СВФР-015200
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДопСвободныйДеньОтРаботы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид)
			//Аверсон СВФР-015200
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПодСледствием)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПодСледствием)
			// ПСА 29.01.2021 СВФР-007141+++
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Ремонт)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Ремонт)
			//+++ПСА 29.01.2021 СВФР-007141
			// ПСА 26.03.2021 СВФР-007366+++
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
			//+++ПСА 26.03.2021 СВФР-007366
			
			//Аверсон ЕАЕ 09.06.2025 СВФР-015971
			|       КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПрочийНевыход)
			|       	ТОГДА ЕСТЬNULL(ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.БуквенныйКод, ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка))
			//Аверсон СВФР-015971
			
			//Аверсон ЕАЕ 07.08.2025 СВФР-016396
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйДеньВНеделю)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйДеньВНеделю)
			//Аверсон СВФР-016396
			
			|	КОНЕЦ КАК БукваВидаВремени, ";
			
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) (
			Если Организация.ИНН = "700067572" 
				И ПодразделениеТранспортногоЦеха() Тогда
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|	ВЫБОР
				|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
				|			ТОГДА 2 ИНАЧЕ 1
				|	КОНЕЦ КАК БукваВидаВремениПриоритет, ";
			КонецЕсли;
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) )
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|	0 КАК ДокПраздничный,
			|	0 КАК ДокКомандировка,
			|	ВЫБОР
			|		КОГДА (СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
			|		или СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СправкаПоУходуЗаРебенком))
			|				И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ как ДокБЛ,
			|	Null как ДокПоУходу,
			|	Null как ДокОтпуска,
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007311
			|	0 КАК ДокОтзыв,
			//Аверсон СВФР-007311
			|	0 КАК ДокОтзывПеренос //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
			
			|ИЗ
			|	РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Месяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ПО ПериодыСостоянийРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
			|		ПО ПериодыСостоянийРаботниковОрганизаций.Регистратор = СостояниеРаботниковОрганизаций.Регистратор
			|			И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = СостояниеРаботниковОрганизаций.Сотрудник
			|			И ПериодыСостоянийРаботниковОрганизаций.НомерСтроки = СостояниеРаботниковОрганизаций.НомерСтроки //Аверсон 26.05.2021 КВВ СВФР-007334
			
			//Аверсон ЕАЕ 09.06.2025 СВФР-015971
			|       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации
			|       ПО ПериодыСостоянийРаботниковОрганизаций.Регистратор = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Ссылка
			|       	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Сотрудник
			|           И ПериодыСостоянийРаботниковОрганизаций.НомерСтроки = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.НомерСтроки
			//Аверсон СВФР-015971
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЗавершенияОкончание КАК ЗавершенияОкончание
			|		ПО ПериодыСостоянийРаботниковОрганизаций.Сотрудник = ЗавершенияОкончание.Сотрудник
			|			И (ЗавершенияОкончание.ДатаОкончания В
			|				(ВЫБРАТЬ
			|					МИНИМУМ(т.ДатаОкончания)
			|				ИЗ
			|					ЗавершенияОкончание КАК т
			|				ГДЕ
			|					т.Сотрудник = ПериодыСостоянийРаботниковОрганизаций.Сотрудник
			|					И ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <= т.ДатаОкончания)),
			|	(ВЫБРАТЬ
			|		ПериодыСостоянийРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|		ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания КАК ДатаОкончания,
			|		ПериодыСостоянийРаботниковОрганизаций.ДатаНачала КАК ДатаНачала
			|	ИЗ
			|		РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
			|	ГДЕ
			|		ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ПериодыСостоянийРаботниковОрганизаций.Сотрудник,
			|		ПериодыСостоянийРаботниковОрганизаций.ДатаОкончания,
			|		ПериодыСостоянийРаботниковОрганизаций.ДатаНачала
			|	ИЗ
			|		РегистрСведений.ПериодыСостоянийРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации
			|			ПО ПериодыСостоянийРаботниковОрганизаций.Регистратор = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Ссылка
			|				И ПериодыСостоянийРаботниковОрганизаций.Сотрудник = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Сотрудник
			|	ГДЕ
			|		ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			|		И ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.ПричинаОтсутствия = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)) КАК ДатаОкончанияСостояния
			|ГДЕ
			|	ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			|	И СостояниеРаботниковОрганизаций.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
			|	И (ПериодыСостоянийРаботниковОрганизаций.ДатаНачала МЕЖДУ &Месяц И &Месяц1
			|			ИЛИ ЗавершенияОкончание.ДатаОкончания МЕЖДУ &Месяц И &Месяц1
			|			ИЛИ ВЫБОР
			|				КОГДА (ЕСТЬNULL(ЗавершенияОкончание.ДатаОкончания, 0) = 0
			|						ИЛИ ЗавершенияОкончание.ДатаОкончания = НЕОПРЕДЕЛЕНО)
			|						И ПериодыСостоянийРаботниковОрганизаций.ДатаНачала <= &Месяц1
			|					ТОГДА ИСТИНА
			|			КОНЕЦ
			//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 2 (
			|			ИЛИ ВЫБОР КОГДА
			|						НЕ (ЕСТЬNULL(ЗавершенияОкончание.ДатаОкончания, 0) = 0
			|						ИЛИ ЗавершенияОкончание.ДатаОкончания = НЕОПРЕДЕЛЕНО)
			|						И ЗавершенияОкончание.ДатаОкончания > &Месяц1
			|					ТОГДА ИСТИНА
			|			КОНЕЦ
			//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 2 )			
			|)
			|	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник В(&СписокСотрудников)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПериодыСостоянийРаботниковОрганизаций.Сотрудник,
			|	ПериодыСостоянийРаботниковОрганизаций.ДатаНачала,
			|	ВЫБОР
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
			//Аверсон 17.12.2020 КВВ СВФР-006517 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные)
			//Аверсон 17.12.2020 КВВ СВФР-006517 )
			//Аверсон 25.01.2021 КВВ СВФР-007084 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньОтдыхаЗаСверхрочные)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньОтдыхаЗаСверхрочные)
			//Аверсон 25.01.2021 КВВ СВФР-007084 )
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СправкаПоУходуЗаРебенком)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньДонора)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньДонора)
			//Аверсон 05.01.2021 КВВ СВФР-006517 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньДонораБезОплаты)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньДонораБезОплаты)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.АлкогольноеНаркотическоеОпьянение)
			
			//Аверсон ЕАЕ 04.09.2025 СВФР-014651
			//|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
			//Аверсон СВФР-014651
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Медкомиссия)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Медкомиссия)
			//Аверсон 05.01.2021 КВВ СВФР-006517 )
			
			//СВЭЙ 27.05.2024 КВВ СВФР-012926 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньОтдыха)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньОтдыха)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПрохождениеДиспансеризации)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПрохождениеДиспансеризации)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Обучение)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
			//СВЭЙ 27.05.2024 КВВ СВФР-012926 )
			
			//Аверсон 09.03.2021 КВВ СВФР-007310 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку)
			//Аверсон 09.03.2021 КВВ СВФР-007310 )
			
			//Аверсон 23.08.2023 КВВ СВФР-011294 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработкуСоревнования)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования)
			//Аверсон 23.08.2023 КВВ СВФР-011294 )
			
			
			//Аверсон 18.04.2023 КВВ СВФР-010714 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствиеПоИнициативеНанимателя)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтсутствиеПоИнициативеНанимателя)
			//Аверсон 18.04.2023 КВВ СВФР-010714 )
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоКоллДоговору)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			//Аверсон 22.03.2021 КВВ СВФР-007331 (
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоСостояниюЗдоровья) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья) 	
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускСамоизоляция) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция) 			
			//Аверсон 22.03.2021 КВВ СВФР-007331 )
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйОтРаботыДень)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень)
			
			//Аверсон ЕАЕ 19.03.2025 СВФР-015200
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДопСвободныйДеньОтРаботы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид)
			//Аверсон СВФР-015200
			
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
			|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПодСледствием)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПодСледствием)
			// ПСА 29.01.2021 СВФР-007141+++
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Ремонт)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Ремонт)
			//+++ ПСА 29.01.2021 СВФР-007141
			// ПСА 26.03.2021 СВФР-007366+++
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
			//+++ПСА 26.03.2021 СВФР-007366
			
			//Аверсон ЕАЕ 09.06.2025 СВФР-015971
			|       КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПрочийНевыход)
			|       	ТОГДА ЕСТЬNULL(ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.БуквенныйКод, ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка))
			//Аверсон СВФР-015971
			
			//Аверсон ЕАЕ 07.08.2025 СВФР-016396
			|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйДеньВНеделю)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйДеньВНеделю)
			//Аверсон СВФР-016396
			
			|	КОНЕЦ,";
			
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) (
			Если Организация.ИНН = "700067572" 
				И ПодразделениеТранспортногоЦеха() Тогда
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|	ВЫБОР
				|		КОГДА СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
				|			ТОГДА 2 ИНАЧЕ 1
				|	КОНЕЦ , ";  //КАК БукваВидаВремениПриоритет
			КонецЕсли;
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) )
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|	ВЫБОР
			|		КОГДА (СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
			|		или СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СправкаПоУходуЗаРебенком))
			|				И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007311
			|	0,
			//Аверсон СВФР-007311
			|	0 //КАК ДокОтзывПеренос //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПериодыСостоянийРаботниковОрганизаций.Сотрудник,
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Период < &Месяц
			|			ТОГДА &Месяц
			|		ИНАЧЕ ПериодыСостоянийРаботниковОрганизаций.Период
			|	КОНЕЦ,
			|	ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1),
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
			|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоКоллДоговору)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя) //Аверсон 11.05.2020 КВВ СВФР-005970
			//Аверсон 22.03.2021 КВВ СВФР-007331 (
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоСостояниюЗдоровья) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья) 	
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускСамоизоляция) 
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция) 			
			//Аверсон 22.03.2021 КВВ СВФР-007331 )
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйОтРаботыДень)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень)
			
			//Аверсон ЕАЕ 19.03.2025 СВФР-015200
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДопСвободныйДеньОтРаботы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид)
			//Аверсон СВФР-015200
			
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПодСледствием)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПодСледствием)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)
			//Аверсон 17.12.2020 КВВ СВФР-006517 (
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные)
			//Аверсон 17.12.2020 КВВ СВФР-006517 )
			//Аверсон 25.01.2021 КВВ СВФР-007084 (
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньОтдыхаЗаСверхрочные)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньОтдыхаЗаСверхрочные)
			//Аверсон 25.01.2021 КВВ СВФР-007084 )
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
			|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
			// ПСА 29.01.2021 СВФР-007141+++
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Ремонт)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Ремонт)
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку)
			//+++ПСА 29.01.2021 СВФР-007141
			
			//Аверсон ЕАЕ 07.08.2025 СВФР-016396
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СвободныйДеньВНеделю)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СвободныйДеньВНеделю)
			//Аверсон СВФР-016396
			
			|	КОНЕЦ,";
			
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) (
			Если Организация.ИНН = "700067572" 
				И ПодразделениеТранспортногоЦеха() Тогда
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|	ВЫБОР
				|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни)
				|			ТОГДА 2 ИНАЧЕ 1
				|	КОНЕЦ , ";  //КАК БукваВидаВремениПриоритет
			КонецЕсли;
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) )
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
			|				И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ПриказНаРаботуВПраздничныеИВыходныеДни
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
			|				И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.КомандировкиОрганизаций
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	Null,
			|	ВЫБОР
			|		КОГДА ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
			|				И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА (ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный) или
			|		ПериодыСостоянийРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный))
			
			|				И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007311
			|   ВЫБОР
			|	КОГДА НЕ Отзывы.Регистратор ЕСТЬ NULL
			|	ТОГДА 1
			|	ИНАЧЕ 0
			|	КОНЕЦ ,
			//Аверсон СВФР-007311
			
			//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 3)
			|   ВЫБОР
			|	КОГДА НЕ Отзывы.Регистратор ЕСТЬ NULL
			|	ТОГДА 
			|ВЫБОР КОГДА Отзывы.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
			|ТОГДА 1 
			|ИНАЧЕ 0
			|КОНЕЦ
			|	ИНАЧЕ 0
			|	КОНЕЦ //КАК ДокОтзывПеренос
			//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 3)
			
			|ИЗ
			|	РегистрСведений.СостояниеРаботниковОрганизаций КАК ПериодыСостоянийРаботниковОрганизаций
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007311
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК Отзывы
			|	ПО Отзывы.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
			|		И ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
			|		И Отзывы.Сотрудник = ПериодыСостоянийРаботниковОрганизаций.Сотрудник
			|		И ВЫБОР 
			|			КОГДА ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
			|			И Отзывы.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
			|			ТОГДА ВЫРАЗИТЬ(Отзывы.Регистратор КАК Документ.ОтзывИзОтпуска).Приказ = ВЫРАЗИТЬ(ПериодыСостоянийРаботниковОрганизаций.Регистратор КАК Документ.ОтпускаОрганизаций)
			|				ИНАЧЕ ЛОЖЬ
			|			КОНЕЦ
			//Аверсон СВФР-007311
			
			|ГДЕ
			|	(ПериодыСостоянийРаботниковОрганизаций.Период МЕЖДУ &Месяц И &Месяц1
			
			//СВЭЙ 15.03.2024 КВВ СВФР-012396 (
			//|			ИЛИ ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения МЕЖДУ &Месяц И &Месяц1
			//|			ИЛИ &Месяц МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.Период И ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения
			//|			ИЛИ &Месяц1 МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.Период И ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения
			
			|			ИЛИ ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1) МЕЖДУ &Месяц И &Месяц1
			|			ИЛИ &Месяц МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.Период И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
			|			ИЛИ &Месяц1 МЕЖДУ ПериодыСостоянийРаботниковОрганизаций.Период И ДОБАВИТЬКДАТЕ(ПериодыСостоянийРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
			//СВЭЙ 15.03.2024 КВВ СВФР-012396 )
			
			|)
			|	И НЕ ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			|	И НЕ ПериодыСостоянийРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
			|	И ПериодыСостоянийРаботниковОрганизаций.Сотрудник В(&СписокСотрудников)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОбучениеИПереподготовка.Сотрудник,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.ДатаНачала < &Месяц
			|			ТОГДА &Месяц
			|		ИНАЧЕ ОбучениеИПереподготовка.ДатаНачала
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.Период >= &Месяц
			|				И ОбучениеИПереподготовка.Период <= &Месяц1
			|			ТОГДА ОбучениеИПереподготовка.Период
			|		ИНАЧЕ &Месяц1
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.ПовышениеКвалификации)
			|				ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.Переподготовка)
			//Аверсон 24.01.2022 КВВ СВФР-008645 (
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ЦелевыеКурсы)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаБезПрофесии)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаПоПрофесииРабочего)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.СмежнаяПрофессия)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Стажировка)
			//Аверсон 24.01.2022 КВВ СВФР-008645 )
			|			ТОГДА 
			
			//Аверсон ЕАЕ 06.12.2021 СВФР-008419
			//|&БукваПереподготовка
			|ВЫБОР
			|КОГДА ОбучениеИПереподготовка.НеОтражатьВТабеле
			|ТОГДА &БукваЯвка
			|ИНАЧЕ
			
			//Аверсон 24.01.2022 КВВ СВФР-008645 (
			//	|&БукваПереподготовка";
			|ВЫБОР 
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПовышениеКвалификации)
			|ТОГДА &БукваПереподготовка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Переподготовка)
			|ТОГДА &БукваПереподготовкаПереподготовка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Стажировка)
			|ТОГДА &БукваСтажировка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ЦелевыеКурсы)
			|ТОГДА &БукваЦелевыеКурсы
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаБезПрофесии)
			|ТОГДА &БукваПрофПодготовкаБезПрофесии
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаПоПрофесииРабочего)
			|ТОГДА &БукваПрофПодготовкаПоПрофесииРабочего
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.СмежнаяПрофессия)
			|ТОГДА &БукваСмежнаяПрофессия
			|КОНЕЦ
			//Аверсон 24.01.2022 КВВ СВФР-008645 )
			
			|КОНЕЦ
			//Аверсон СВФР-008419
			
			|		КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.Семинар)
			|			ТОГДА 
			
			//Аверсон ЕАЕ 06.12.2021 СВФР-008419
			//|&БукваСеминар
			|ВЫБОР
			|КОГДА ОбучениеИПереподготовка.НеОтражатьВТабеле
			|ТОГДА &БукваЯвка
			|ИНАЧЕ &БукваСеминар
			|КОНЕЦ
			//Аверсон СВФР-008419
			
			|	КОНЕЦ,  ";
			
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) (
			Если Организация.ИНН = "700067572" 
				И ПодразделениеТранспортногоЦеха() Тогда
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|	1 , ";  //КАК БукваВидаВремениПриоритет
			КонецЕсли;
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) )
			
			ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
			|	0,
			|	0,
			|	0,
			|	0,
			|	0,
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007311
			|	0,
			//Аверсон СВФР-007311
			|	0 //КАК ДокОтзывПеренос //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
			|ИЗ
			|	РегистрСведений.ОбучениеИПереподготовка КАК ОбучениеИПереподготовка
			|ГДЕ
			|	(ОбучениеИПереподготовка.ДатаНачала МЕЖДУ &Месяц И &Месяц1
			|			ИЛИ ОбучениеИПереподготовка.Период МЕЖДУ &Месяц И &Месяц1
			|			ИЛИ &Месяц МЕЖДУ ОбучениеИПереподготовка.ДатаНачала И ОбучениеИПереподготовка.Период
			|			ИЛИ &Месяц1 МЕЖДУ ОбучениеИПереподготовка.ДатаНачала И ОбучениеИПереподготовка.Период)
			|	И ОбучениеИПереподготовка.Сотрудник В(&СписокСотрудников)
			
			//Аверсон ЕАЕ 18.12.2025 СВФР-017630
			|И ОбучениеИПереподготовка.НеОтражатьВТабеле = Ложь
			//Аверсон СВФР-017630
			
			|
			|СГРУППИРОВАТЬ ПО
			|	ОбучениеИПереподготовка.Сотрудник,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.ДатаНачала < &Месяц
			|			ТОГДА &Месяц
			|		ИНАЧЕ ОбучениеИПереподготовка.ДатаНачала
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.ПовышениеКвалификации)
			|				ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.Переподготовка)
			//Аверсон 24.01.2022 КВВ СВФР-008645 (
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ЦелевыеКурсы)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаБезПрофесии)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаПоПрофесииРабочего)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.СмежнаяПрофессия)
			|               ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Стажировка)
			//Аверсон 24.01.2022 КВВ СВФР-008645 )
			|			ТОГДА                                                                             
			
			//Аверсон ЕАЕ 06.12.2021 СВФР-008419
			//|&БукваПереподготовка
			|ВЫБОР
			|КОГДА ОбучениеИПереподготовка.НеОтражатьВТабеле
			|ТОГДА &БукваЯвка
			|ИНАЧЕ 
			
			//Аверсон 24.01.2022 КВВ СВФР-008645 (
			//	|&БукваПереподготовка";
			|ВЫБОР 
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПовышениеКвалификации)
			|ТОГДА &БукваПереподготовка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Переподготовка)
			|ТОГДА &БукваПереподготовкаПереподготовка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Стажировка)
			|ТОГДА &БукваСтажировка
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ЦелевыеКурсы)
			|ТОГДА &БукваЦелевыеКурсы
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаБезПрофесии)
			|ТОГДА &БукваПрофПодготовкаБезПрофесии
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаПоПрофесииРабочего)
			|ТОГДА &БукваПрофПодготовкаПоПрофесииРабочего
			|КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.СмежнаяПрофессия)
			|ТОГДА &БукваСмежнаяПрофессия
			|КОНЕЦ
			//Аверсон 24.01.2022 КВВ СВФР-008645 )
			
			|КОНЕЦ
			//Аверсон СВФР-008419
			
			|		КОГДА ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(перечисление.ТипыОбучения.Семинар)
			|			ТОГДА 
			
			//Аверсон ЕАЕ 06.12.2021 СВФР-008419
			//|&БукваСеминар
			|ВЫБОР
			|КОГДА ОбучениеИПереподготовка.НеОтражатьВТабеле
			|ТОГДА &БукваЯвка
			|ИНАЧЕ &БукваСеминар
			|КОНЕЦ
			//Аверсон СВФР-008419
			
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ОбучениеИПереподготовка.Период >= &Месяц
			|				И ОбучениеИПереподготовка.Период <= &Месяц1
			|			ТОГДА ОбучениеИПереподготовка.Период
			|		ИНАЧЕ &Месяц1
			|	КОНЕЦ";
			
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) (
			Если Организация.ИНН = "700067572" 
				И ПодразделениеТранспортногоЦеха() Тогда
				ЗапросАвтоЗаполненияТекст = ЗапросАвтоЗаполненияТекст + "
				|УПОРЯДОЧИТЬ ПО 
				|Сотрудник,ДатаНачала,БукваВидаВремениПриоритет,БукваВидаВремени";
			КонецЕсли;
			//Аверсон 04.08.2021 КВВ СВФР-007942 (пункт 8) )
			
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваПереподготовка",Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации);
			
			//Аверсон 24.01.2022 КВВ СВФР-008645 (
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваПереподготовкаПереподготовка",?(Организация.ИНН = "806000046",Справочники.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации,Справочники.КлассификаторИспользованияРабочегоВремени.Переподготовка)); 
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваСтажировка",Справочники.КлассификаторИспользованияРабочегоВремени.Стажировка);
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваЦелевыеКурсы",Справочники.КлассификаторИспользованияРабочегоВремени.КурсыЦелевогоНазначения);
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваПрофПодготовкаБезПрофесии",Справочники.КлассификаторИспользованияРабочегоВремени.ПрофПодготовкаНеРабочих);
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваПрофПодготовкаПоПрофесииРабочего",Справочники.КлассификаторИспользованияРабочегоВремени.ПрофПодготовкаРабочих);
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваСмежнаяПрофессия",Справочники.КлассификаторИспользованияРабочегоВремени.СмежнаяПрофессия);
			//Аверсон 24.01.2022 КВВ СВФР-008645 )
			
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваСеминар",Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Семинар"));
			
			ЗапросАвтоЗаполнения.УстановитьПараметр("БукваЯвка",Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
			
			ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполненияТекст;
			РезультатЗапроса = ЗапросАвтоЗаполнения.Выполнить().Выгрузить();
			
			//Аверсон 03.05.2020 КВВ СВФР-005809 (
			Если РезультатЗапроса.Количество() <> 0 Тогда 
				//Аверсон 03.06.2021 КВВ СВФР-007334 (
				Для Каждого СтрТЗОбщ Из РезультатЗапроса Цикл
					Если СтрТЗОбщ.ДатаНачала = НачалоДня(СтрТЗОбщ.ДатаНачала) Тогда
						Продолжить;
					КонецЕсли;
					СтрТЗОбщ.ДатаНачала = НачалоДня(СтрТЗОбщ.ДатаНачала);
				КонецЦикла;
				//Аверсон 03.06.2021 КВВ СВФР-007334 )
				
				//Аверсон ЕАЕ 11.03.2021 СВФР-007311
				//РезультатЗапроса.Свернуть("Сотрудник,ДокПраздничный,ДокПоУходу,ДокОтпуска,ДокКомандировка,ДокБЛ,ДатаОкончания,ДатаНачала,БукваВидаВремени"); //Аверсон 18.06.2020 КВВ СВФР-005946
				РезультатЗапроса.Свернуть("Сотрудник,ДокПраздничный,ДокПоУходу,ДокОтпуска,ДокОтзыв,ДокОтзывПеренос,ДокКомандировка,ДокБЛ,ДатаОкончания,ДатаНачала,БукваВидаВремени"); //Аверсон 18.06.2020 КВВ СВФР-005946 //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3) ДокОтзывПеренос
				//Аверсон ЕАЕ 11.03.2021
				
				//Аверсон 30.12.2020 КВВ СВФР-005809 (
				//СчДокБЛ1 = 0; СчВесьМес = 0; //Аверсон 12.01.2023 КВВ СВФР-010030 (закомментировано) 
				ТЗ22 = РезультатЗапроса.Скопировать();
				ТЗ22.Сортировать("ДокБЛ УБЫВ,ДатаОкончания УБЫВ");
				
				//Аверсон 12.01.2023 КВВ СВФР-010030 (закомментировано) (
				//Для Каждого СтрТЗ22 ИЗ ТЗ22 Цикл
				//	Если СтрТЗ22.ДатаОкончания = КонецМесяца(СтрТЗ22.ДатаОкончания) И СтрТЗ22.ДатаНачала = НачалоМесяца(СтрТЗ22.ДатаНачала) Тогда
				//		СчВесьМес = СчВесьМес + 1;
				//	КонецЕсли;
				//	Если СтрТЗ22.ДокБЛ = 1 Тогда
				//		СчДокБЛ1 = СчДокБЛ1 + 1;
				//	КонецЕсли;
				//КонецЦикла;
				//Аверсон 12.01.2023 КВВ СВФР-010030 (закомментировано) )
				
				//Аверсон 30.12.2020 КВВ СВФР-005809 )
				
				Для Каждого СтрТЗОбщ Из РезультатЗапроса Цикл
					Если СтрТЗОбщ.ДокБЛ = 1 Тогда
						//Аверсон 08.06.2020 КВВ СВФР-005946 (
						ДатаНачБЛ = СтрТЗОбщ.ДатаНачала;
						ДатаКонБЛ = СтрТЗОбщ.ДатаОкончания; 
						
						З_БЛ = Новый Запрос;
						З_БЛ.Текст = "ВЫБРАТЬ 
						|СостояниеРаботниковОрганизаций.Регистратор, 
						|СостояниеРаботниковОрганизаций.Состояние,
						|СостояниеРаботниковОрганизаций.Период   
						|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
						|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
						|И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
						|УПОРЯДОЧИТЬ ПО 
						|СостояниеРаботниковОрганизаций.Период УБЫВ";
						З_БЛ.УстановитьПараметр("Сотрудник",СтрТЗОбщ.Сотрудник);
						РезЗ_БЛ = З_БЛ.Выполнить().Выбрать();
						Если РезЗ_БЛ.Следующий() Тогда
							ДатаНачБЛ = Мин(ДатаНачБЛ,НачалоДня(РезЗ_БЛ.Период));
						КонецЕсли;
						
						ОтзывИспользован = Ложь;  //Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10)
						УдаленаСтрока = Ложь; //Аверсон 27.08.2021 КВВ СВФР-007942 (пункт 12)
						
						//Аверсон ЕАЕ 03.09.2025 СВФР-016588
						//Свернем периоды отпусков одного документа, если они идут друг за другом непрерывно
						З_Отпуск = Новый Запрос;
						З_Отпуск.Текст = "ВЫБРАТЬ 
						|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала КАК НачалоОтпуск,
						|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания КАК ОкончаниеОтпуск,
						|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка КАК СсылкаОтпуск
						|ИЗ  Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
						|ГДЕ ОтпускаОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник
						|	И ОтпускаОрганизацийРаботникиОрганизации.Ссылка.Проведен
						|   И ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала МЕЖДУ ДОБАВИТЬКДАТЕ(&Нач, МЕСЯЦ, -3) И ДОБАВИТЬКДАТЕ(&Кон, МЕСЯЦ, 3)
						|УПОРЯДОЧИТЬ ПО
						|	СсылкаОтпуск,
						|	НачалоОтпуск
						|";  
						З_Отпуск.УстановитьПараметр("Сотрудник", СтрТЗОбщ.Сотрудник);
						З_Отпуск.УстановитьПараметр("Нач", НачалоМесяца(ПериодРегистрации));
						З_Отпуск.УстановитьПараметр("Кон", КонецМесяца(ПериодРегистрации));
						ТЗОтпуска = З_Отпуск.Выполнить().Выгрузить();
						
						ТЗОтпускаРезультат = ТЗОтпуска.Скопировать();
						ТЗОтпускаРезультат.Очистить();
						
						ПредДок = "";
						ПредКонОтпуска = Дата(1,1,1);
						Для Каждого Стр Из ТЗОтпуска Цикл
							Если Стр.СсылкаОтпуск <> ПредДок ИЛИ Стр.НачалоОтпуск <> КонецДня(ПредКонОтпуска) + 1 Тогда
								НоваяСтр = ТЗОтпускаРезультат.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
							Иначе
								НоваяСтр.ОкончаниеОтпуск = Стр.ОкончаниеОтпуск;
							КонецЕсли;
							ПредДок = Стр.СсылкаОтпуск;
							ПредКонОтпуска = Стр.ОкончаниеОтпуск;
						КонецЦикла;
						//Аверсон СВФР-016588
						
						З_Отзыв = Новый Запрос;
						З_Отзыв.Текст = "ВЫБРАТЬ 
						
						//Аверсон ЕАЕ 03.09.2025 СВФР-016588
						//Возмем отпуска из ТЗ со свернутыми периодами
						//|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала КАК НачалоОтпуск,
						//|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания КАК ОкончаниеОтпуск,
						//|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка КАК СсылкаОтпуск
						//|	ПОМЕСТИТЬ ВТ_Отпусков
						//|	ИЗ  Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
						//|	ГДЕ ОтпускаОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник
						|	ОтпускаОрганизацийРаботникиОрганизации.НачалоОтпуск КАК НачалоОтпуск,
						|	ОтпускаОрганизацийРаботникиОрганизации.ОкончаниеОтпуск КАК ОкончаниеОтпуск,
						|	ОтпускаОрганизацийРаботникиОрганизации.СсылкаОтпуск КАК СсылкаОтпуск
						|ПОМЕСТИТЬ ВТ_Отпусков
						|ИЗ  &ТЗОтпуска КАК ОтпускаОрганизацийРаботникиОрганизации
						|;
						//Аверсон СВФР-016588
						
						|ВЫБРАТЬ *
						|	ИЗ Документ.ОтзывИЗОтпуска КАК ОтзывИЗОтпуска
						|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отпусков КАК ВТ_Отпусков
						|	ПО ВТ_Отпусков.СсылкаОтпуск = ОтзывИЗОтпуска.Приказ
						|	ГДЕ ОтзывИЗОтпуска.Проведен
						|	И ОтзывИЗОтпуска.Сотрудник = &Сотрудник
						|	И ОтзывИЗОтпуска.ОтражатьИзмененияПоПродлению
						|	И ОтзывИЗОтпуска.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Продление)
						|	И ((&ДатаНачалаБЛ МЕЖДУ ОтзывИЗОтпуска.ДатаНачала И ОтзывИЗОтпуска.ДатаОкончания)
						|	ИЛИ (&ДатаНачалаБЛ МЕЖДУ ОтзывИЗОтпуска.ПродлениеС И ОтзывИЗОтпуска.ПродлениеПо))
						|УПОРЯДОЧИТЬ ПО ОтзывИЗОтпуска.Ссылка";
						З_Отзыв.УстановитьПараметр("Сотрудник",СтрТЗОбщ.Сотрудник);
						З_Отзыв.УстановитьПараметр("ДатаНачалаБЛ",ДатаНачБЛ);
						
						//Аверсон ЕАЕ 03.09.2025 СВФР-016588
						З_Отзыв.УстановитьПараметр("ТЗОтпуска", ТЗОтпускаРезультат);
						//Аверсон СВФР-016588
						
						РезЗ_Отзыв = З_Отзыв.Выполнить().Выбрать();
						ПродлениеПООкончательное = Дата(1,1,1);
						Пока РезЗ_Отзыв.Следующий() Цикл 
							
							//Аверсон ЕАЕ 13.10.2025 СВФР-017010
							Если Не ЗначениеЗаполнено(РезЗ_Отзыв.ОкончаниеОтпуск) Тогда
								Продолжить;
							КонецЕсли;
							//Аверсон СВФР-017010
							
							СравнениеОкончанияОтпуска = Макс(РезЗ_Отзыв.ОкончаниеОтпуск,ПродлениеПООкончательное);
							Если РезЗ_Отзыв.ДатаОкончания = СравнениеОкончанияОтпуска Тогда
								ДатаКонБЛ = НачалоДня(РезЗ_Отзыв.ПродлениеС - 1);
							ИначеЕсли РезЗ_Отзыв.ДатаОкончания < СравнениеОкончанияОтпуска Тогда
								ДатаКонБЛ = РезЗ_Отзыв.ДатаОкончания;
							КонецЕсли;
							ПродлениеПООкончательное = РезЗ_Отзыв.ПродлениеПо;
						КонецЦикла;
						СтрТЗОбщ.ДатаОкончания = КонецДня(ДатаКонБЛ);
						Если НачалоДня(СтрТЗОбщ.ДатаНачала) > НачалоДня(СтрТЗОбщ.ДатаОкончания) Тогда
							РезультатЗапроса.Удалить(СтрТЗОбщ);
							УдаленаСтрока = Истина; //Аверсон 27.08.2021 КВВ СВФР-007942 (пункт 12)
						КонецЕсли;
						//Аверсон 08.06.2020 КВВ СВФР-005946 )
						
						//Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10) (
						Если НЕ ОтзывИспользован И НЕ УдаленаСтрока Тогда  //Аверсон 27.08.2021 КВВ СВФР-007942 (пункт 12)  (УдаленаСтрока)
							З_Отзыв = Новый Запрос;
							З_Отзыв.Текст = "ВЫБРАТЬ 
							|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала КАК НачалоОтпуск,
							|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания КАК ОкончаниеОтпуск,
							|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка КАК СсылкаОтпуск
							|	ПОМЕСТИТЬ ВТ_Отпусков
							|	ИЗ  Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
							|	ГДЕ ОтпускаОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник;
							|ВЫБРАТЬ 
							|	ОтзывИЗОтпуска.ДатаНачала,
							|	ОтзывИЗОтпуска.ДатаОкончания,
							|	ОтзывИЗОтпуска.ПродлениеС,
							|	ОтзывИЗОтпуска.Ссылка
							|	ИЗ Документ.ОтзывИЗОтпуска КАК ОтзывИЗОтпуска
							|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отпусков КАК ВТ_Отпусков
							|	ПО ВТ_Отпусков.СсылкаОтпуск = ОтзывИЗОтпуска.Приказ
							|	ГДЕ ОтзывИЗОтпуска.Проведен
							|	И ОтзывИЗОтпуска.Сотрудник = &Сотрудник
							|	И ОтзывИЗОтпуска.ОтражатьИзмененияПоПродлению
							|	И ОтзывИЗОтпуска.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Продление)
							|	И &ДатаКонБЛ = ОтзывИЗОтпуска.ДатаНачала";
							
							//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) (
							Если Организация.ИНН = "700067572" Тогда
								З_Отзыв.Текст = З_Отзыв.Текст + "
								|	И ОтзывИЗОтпуска.НомерБЛ = &Пустота"; 
							КонецЕсли;
							//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) )
							
							З_Отзыв.Текст = З_Отзыв.Текст + "
							|УПОРЯДОЧИТЬ ПО ОтзывИЗОтпуска.Ссылка";
							З_Отзыв.УстановитьПараметр("Сотрудник",СтрТЗОбщ.Сотрудник);
							З_Отзыв.УстановитьПараметр("ДатаКонБЛ",КонецДня(ДатаКонБЛ)+1);
							З_Отзыв.УстановитьПараметр("Пустота",""); //Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1)
							РезЗ_Отзыв = З_Отзыв.Выполнить().Выбрать();
							Пока РезЗ_Отзыв.Следующий() Цикл 
								//ДатаКонБЛ = РезЗ_Отзыв.ПродлениеС-1;
								ДатаКонБЛ = КонецДня(РезЗ_Отзыв.ДатаОкончания);
							КонецЦикла;
							СтрТЗОбщ.ДатаОкончания = КонецДня(ДатаКонБЛ);
						КонецЕсли;
						
						//Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10) )
						
					КонецЕсли;
				КонецЦикла;
				
				//Аверсон 30.12.2020 КВВ СВФР-005809 (
				Для Каждого СтрТЗОбщ Из РезультатЗапроса Цикл
					Если СтрТЗОбщ.ДокБЛ = 1 Тогда
						
						//Аверсон 12.01.2023 КВВ СВФР-010030 (
						СчДокБЛ1 = 0; СчВесьМес = 0;
						ОтборТЗ22 = Новый Структура;
						ОтборТЗ22.Вставить("Сотрудник", СтрТЗОбщ.Сотрудник);
						СтрокиТЗ22 = ТЗ22.НайтиСтроки(ОтборТЗ22);
						Для Каждого СтрТЗ22 Из СтрокиТЗ22 Цикл
							Если СтрТЗ22.ДатаОкончания = КонецМесяца(СтрТЗ22.ДатаОкончания) И СтрТЗ22.ДатаНачала = НачалоМесяца(СтрТЗ22.ДатаНачала) Тогда
								СчВесьМес = СчВесьМес + 1;
							КонецЕсли;
							Если СтрТЗ22.ДокБЛ = 1 Тогда
								СчДокБЛ1 = СчДокБЛ1 + 1;
							КонецЕсли;
						КонецЦикла;
						//Аверсон 12.01.2023 КВВ СВФР-010030 )
						
						Если СчДокБЛ1 > 1 И СчВесьМес > 0 И 
							СтрТЗОбщ.ДатаОкончания = КонецМесяца(СтрТЗОбщ.ДатаОкончания) И СтрТЗОбщ.ДатаНачала = НачалоМесяца(СтрТЗОбщ.ДатаНачала) Тогда
							
							З_ = Новый Запрос;
							З_.Текст = "
							|ВЫБРАТЬ ПЕРВЫЕ 1
							|СостояниеРаботниковОрганизаций.Регистратор, 
							|СостояниеРаботниковОрганизаций.Состояние,
							|СостояниеРаботниковОрганизаций.Период   
							|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
							|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
							|И НЕ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
							|И СостояниеРаботниковОрганизаций.ПЕРИОД МЕЖДУ &Д1 И &Д2
							|УПОРЯДОЧИТЬ ПО 
							|СостояниеРаботниковОрганизаций.Период ВОЗР";
							З_.УстановитьПараметр("Сотрудник",СтрТЗОбщ.Сотрудник);
							З_.УстановитьПараметр("Д1",НачалоМесяца(СтрТЗОбщ.ДатаНачала));
							З_.УстановитьПараметр("Д2",КонецМесяца(СтрТЗОбщ.ДатаОкончания));
							РезЗ_ = З_.Выполнить().Выбрать();
							Если РезЗ_.Следующий() Тогда 
								СтрТЗОбщ.ДатаОкончания = РезЗ_.Период - 1;
								//РезультатЗапроса.Удалить(СтрТЗОбщ);
							КонецЕсли;
						Иначе
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				//Аверсон 30.12.2020 КВВ СВФР-005809 )
				
				//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) (
				Если Организация.ИНН = "700067572" Тогда
					Отбор1 = Новый Структура;
					Отбор1.Вставить("ДокОтзыв", 1);
					Отбор1.Вставить("ДокОтпуска", 1);
					Отбор1.Вставить("ДокОтзывПеренос", 0);
					Отбор1.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
					
					РезультатЗапросаТЗПроверка = Новый ТаблицаЗначений;
					РезультатЗапросаТЗПроверка = РезультатЗапроса.Скопировать();
					
					Строки_ТЗ_Неявки_Отбор1 = РезультатЗапросаТЗПроверка.НайтиСтроки(Отбор1);
					Если Строки_ТЗ_Неявки_Отбор1.Количество() > 0 Тогда
						
						РезультатЗапросаТЗПроверка.Колонки.Добавить("НадоУдалить");
						НадоУдалить = Ложь;
						Для Каждого Стр_Строки_ТЗ_Неявки ИЗ Строки_ТЗ_Неявки_Отбор1 Цикл
							Отбор2 = Новый Структура;
							Отбор2.Вставить("Сотрудник", Стр_Строки_ТЗ_Неявки.Сотрудник);
							Отбор2.Вставить("ДатаНачала", Стр_Строки_ТЗ_Неявки.ДатаНачала);
							Отбор2.Вставить("ДатаОкончания", Стр_Строки_ТЗ_Неявки.ДатаОкончания);
							Отбор2.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
							Строки_ТЗ_Неявки_Отбор2 = РезультатЗапроса.НайтиСтроки(Отбор2);
							Если Строки_ТЗ_Неявки_Отбор2.Количество() > 0 Тогда
								Стр_Строки_ТЗ_Неявки.НадоУдалить = Истина;
								НадоУдалить = Истина;
							КонецЕсли;
						КонецЦикла;
						Если НадоУдалить Тогда
							НадоУдалитьСтроки = РезультатЗапросаТЗПроверка.НайтиСтроки(Новый Структура("НадоУдалить",Истина));
							Для каждого СтрокаТаблицыНадоУдалитьСтроки Из НадоУдалитьСтроки Цикл
								РезультатЗапросаТЗПроверка.Удалить(СтрокаТаблицыНадоУдалитьСтроки);
							КонецЦикла;
							РезультатЗапроса = РезультатЗапросаТЗПроверка.Скопировать();
						КонецЕсли;
						
						//Аверсон 17.08.2023 КВВ СВФР-011229 (
						Колонка1 = РезультатЗапроса.Колонки.Найти("НадоУдалить");
						Если НЕ Колонка1 = Неопределено Тогда
							РезультатЗапроса.Колонки.Удалить(Колонка1);
						КонецЕсли;
						//Аверсон 17.08.2023 КВВ СВФР-011229 )
						
					КонецЕсли;
					
					//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) (
					Отбор11 = Новый Структура;
					Отбор11.Вставить("ДокОтзыв", 0);
					Отбор11.Вставить("ДокОтпуска", 0);
					Отбор11.Вставить("ДокОтзывПеренос", 0);
					Отбор11.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
					
					РезультатЗапросаТЗПроверка11 = Новый ТаблицаЗначений;
					РезультатЗапросаТЗПроверка11 = РезультатЗапроса.Скопировать();
					
					Строки_ТЗ_Неявки_Отбор11 = РезультатЗапросаТЗПроверка11.НайтиСтроки(Отбор11);
					Если Строки_ТЗ_Неявки_Отбор11.Количество() > 0 Тогда
						
						РезультатЗапросаТЗПроверка11.Колонки.Добавить("НадоУдалить");
						НадоУдалить = Ложь;
						Для Каждого Стр_Строки_ТЗ_Неявки11 ИЗ Строки_ТЗ_Неявки_Отбор11 Цикл
							ДН = Стр_Строки_ТЗ_Неявки11.ДатаНачала;
							ДК = Стр_Строки_ТЗ_Неявки11.ДатаОкончания;
							
							ЗНов = Новый Запрос;
							ЗНов.Текст = "ВЫБРАТЬ 
							|СостояниеРаботниковОрганизаций.Регистратор, 
							|СостояниеРаботниковОрганизаций.Состояние,
							|СостояниеРаботниковОрганизаций.Период ,
							|СостояниеРаботниковОрганизаций.ПериодЗавершения  
							|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
							|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
							|И НЕ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
							|И СостояниеРаботниковОрганизаций.Период = &Д1 
							|И СостояниеРаботниковОрганизаций.ПериодЗавершения = &Д2
							|И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
							|И СостояниеРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
							|И СостояниеРаботниковОрганизаций.Регистратор.НомерБЛ <> &Пустота";
							ЗНов.УстановитьПараметр("Сотрудник",Стр_Строки_ТЗ_Неявки11.Сотрудник);
							ЗНов.УстановитьПараметр("Д1",ДН);
							ЗНов.УстановитьПараметр("Д2",КонецДня(КонецДня(ДК)+1));
							ЗНов.УстановитьПараметр("Пустота","");
							РезЗНов = ЗНов.Выполнить().Выгрузить();
							Если РезЗНов.Количество() > 0 Тогда
								
								Отбор22 = Новый Структура;
								Отбор22.Вставить("Сотрудник",Стр_Строки_ТЗ_Неявки11.Сотрудник);
								Отбор22.Вставить("ДокБЛ",1);
								Отбор22.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
								Отбор22.Вставить("ДатаОкончания",НачалоДня(ДН)-1);
								
								Строки_ТЗ_Неявки_Отбор22 = РезультатЗапросаТЗПроверка11.НайтиСтроки(Отбор22);
								Если Строки_ТЗ_Неявки_Отбор22.Количество() > 0 Тогда
									Для Каждого Стр22 ИЗ Строки_ТЗ_Неявки_Отбор22 Цикл
										Стр22.ДатаОкончания = ДК;
									КонецЦикла;
									
									Отбор33 = Новый Структура;
									Отбор33.Вставить("Сотрудник",Стр_Строки_ТЗ_Неявки11.Сотрудник);
									Отбор33.Вставить("ДокОтзыв", 1);
									Отбор33.Вставить("ДокОтпуска", 1);
									Отбор33.Вставить("ДокОтзывПеренос", 0);
									Отбор33.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
									
									Строки_ТЗ_Неявки_Отбор33 = РезультатЗапросаТЗПроверка11.НайтиСтроки(Отбор33);
									Если Строки_ТЗ_Неявки_Отбор33.Количество() > 0 Тогда
										Для Каждого Стр33 ИЗ Строки_ТЗ_Неявки_Отбор33 Цикл
											Если Стр33.ДатаНачала < ДК Тогда
												Стр33.ДатаНачала = КонецДня(ДК) + 1;
												Если Стр33.ДатаОкончания < Стр33.ДатаНачала Тогда
													Стр33.НадоУдалить = Истина;
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
									
									Стр_Строки_ТЗ_Неявки11.НадоУдалить = Истина;
									НадоУдалить = Истина;
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
						Если НадоУдалить Тогда
							НадоУдалитьСтроки = РезультатЗапросаТЗПроверка11.НайтиСтроки(Новый Структура("НадоУдалить",Истина));
							Для каждого СтрокаТаблицыНадоУдалитьСтроки Из НадоУдалитьСтроки Цикл
								РезультатЗапросаТЗПроверка11.Удалить(СтрокаТаблицыНадоУдалитьСтроки);
							КонецЦикла;
							РезультатЗапроса = РезультатЗапросаТЗПроверка11.Скопировать();
						КонецЕсли;
						
						//Аверсон 17.08.2023 КВВ СВФР-011229 (
						Колонка1 = РезультатЗапроса.Колонки.Найти("НадоУдалить");
						Если НЕ Колонка1 = Неопределено Тогда
							РезультатЗапроса.Колонки.Удалить(Колонка1);
						КонецЕсли;
						//Аверсон 17.08.2023 КВВ СВФР-011229 )
						
					КонецЕсли;
					//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) )
				КонецЕсли;
				//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) )
				
				
			КонецЕсли;
			//Аверсон 03.05.2020 КВВ СВФР-005809 )
			
			//Аверсон 24.01.2022 КВВ СВФР-008495 (
			сзСотрудникиОИП = Новый СписокЗначений;
			Если (Организация.ИНН = "100010315"
				ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
				И РезультатЗапроса.Количество() > 0 Тогда  
				сзСотрудникиОИП_ = Новый СписокЗначений;
				сзСотрудникиОИП_.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("Сотрудник"));
				ЗапросОИП = Новый Запрос;
				ЗапросОИП.Текст = "ВЫБРАТЬ
				|ОИП.ДатаНачала КАК ДатаНачала,
				|ОИП.Период КАК ДатаОкончания,
				|ОИП.Сотрудник КАК Сотрудник
				|ИЗ РегистрСведений.ОбучениеИПереподготовка КАК ОИП
				|ГДЕ ОИП.Сотрудник В (&СписокСотрудников)
				|И ОИП.НеОтражатьВТабеле = ИСТИНА
				|И (ОИП.ДатаНачала МЕЖДУ &ДатаНач И &ДатаКон
				|ИЛИ ОИП.Период МЕЖДУ &ДатаНач И &ДатаКон)";
				ЗапросОИП.УстановитьПараметр("СписокСотрудников",сзСотрудникиОИП_);
				ЗапросОИП.УстановитьПараметр("ДатаНач",ДатаНачалаПериода);
				ЗапросОИП.УстановитьПараметр("ДатаКон",ДатаОкончанияПериода);
				РезЗапросОИП = ЗапросОИП.Выполнить().Выгрузить();
				Если РезЗапросОИП.Количество() > 0 Тогда
					Для Каждого СтрРезЗапросОИП ИЗ РезЗапросОИП Цикл
						ОтборОИП = Новый Структура;
						ОтборОИП.Вставить("Сотрудник", СтрРезЗапросОИП.Сотрудник);
						ОтборОИП.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
						СтрокиОИП = РезультатЗапроса.НайтиСтроки(ОтборОИП);
						Для Каждого СтрОИП Из СтрокиОИП Цикл
							Если СтрОИП.ДатаНачала > СтрРезЗапросОИП.ДатаОкончания ИЛИ СтрОИП.ДатаОкончания < СтрРезЗапросОИП.ДатаНачала Тогда
								Продолжить;
							КонецЕсли;
							сзСотрудникиОИП.Добавить(СтрРезЗапросОИП.Сотрудник);
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//Аверсон 24.01.2022 КВВ СВФР-008495 )
			
			//Аверсон 17.08.2023 КВВ СВФР-011229 (
			ЗПереносы = Новый Запрос;
			ЗПереносы.Текст = "ВЫБРАТЬ 
			|СостояниеРаботниковОрганизаций.Сотрудник,
			|СостояниеРаботниковОрганизаций.Регистратор, 
			|СостояниеРаботниковОрганизаций.Состояние,
			|СостояниеРаботниковОрганизаций.Период,
			|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ),ДЕНЬ,-1) КАК ПериодЗавершения 
			|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
			|ГДЕ 
			|СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
			|И (&Д1 МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период,МЕСЯЦ) 
			|И КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения,МЕСЯЦ))
			|И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
			|И СостояниеРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|И СостояниеРаботниковОрганизаций.Регистратор.НомерБЛ = &Пустота
			|И (СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
			|ИЛИ СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Компенсация))";
			ЗПереносы.УстановитьПараметр("Д1", НачалоМесяца(ПериодРегистрации));
			//ЗПереносы.УстановитьПараметр("Д2", КонецМесяца(ПериодРегистрации));
			ЗПереносы.УстановитьПараметр("Пустота", "");
			РезЗПереносы = ЗПереносы.Выполнить().Выгрузить();
			Если РезЗПереносы.Количество() > 0 Тогда
				РезультатЗапроса.Колонки.Добавить("НадоУдалить");
				НадоУдалить = Ложь;
				Для Каждого СтрРезЗПереносы ИЗ РезЗПереносы Цикл
					ДНачПер = СтрРезЗПереносы.Период;
					ДКонПер = СтрРезЗПереносы.ПериодЗавершения;
					ОтборПеренос = Новый Структура;
					ОтборПеренос.Вставить("Сотрудник", СтрРезЗПереносы.Сотрудник);
					ОтборПеренос.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
					СтрокиОтборПеренос = РезультатЗапроса.НайтиСтроки(ОтборПеренос);
					Для Каждого СтрСтрокиОтборПеренос ИЗ СтрокиОтборПеренос Цикл
						Если НачалоДня(ДНачПер) > НачалоДня(СтрСтрокиОтборПеренос.ДатаОкончания)
							ИЛИ КонецДня(ДКонПер) < КонецДня(СтрСтрокиОтборПеренос.ДатаНачала) Тогда
							Продолжить;
						КонецЕсли;
						Если НачалоДня(ДНачПер) = НачалоДня(СтрСтрокиОтборПеренос.ДатаНачала)
							И КонецДня(ДКонПер) = КонецДня(СтрСтрокиОтборПеренос.ДатаОкончания) Тогда
							НадоУдалить = ИСТИНА;
							СтрСтрокиОтборПеренос.НадоУдалить = Истина;
						Иначе
							Если КонецДня(ДКонПер) < КонецДня(СтрСтрокиОтборПеренос.ДатаОкончания) Тогда
								
								//СВЭЙ 18.09.2023 КВВ СВФР-011448 (
								//Если СтрРезЗПереносы.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация Тогда //СВЭЙ 15.03.2024 КВВ СВФР-012396 (закомментировано этой заявкой, т.к. и для Переноса нужна такая же проверка)
								Если НачалоДня(ДНачПер) > НачалоДня(СтрСтрокиОтборПеренос.ДатаНачала) Тогда
									НовСтрр = РезультатЗапроса.Добавить();
									ЗаполнитьЗначенияСвойств(НовСтрр,СтрСтрокиОтборПеренос);
									НовСтрр.НадоУдалить = Ложь;
									НовСтрр.ДатаОкончания = НачалоДня(ДНачПер) - 1;
								КонецЕсли;
								//	КонецЕсли;
								//СВЭЙ 18.09.2023 КВВ СВФР-011448 )
								
								СтрСтрокиОтборПеренос.ДатаНачала = КонецДня(ДКонПер) + 1;
							ИначеЕсли НачалоДня(ДНачПер) > НачалоДня(СтрСтрокиОтборПеренос.ДатаНачала) Тогда
								СтрСтрокиОтборПеренос.ДатаОкончания = НачалоДня(ДНачПер) - 1;
							Иначе
								НадоУдалить = ИСТИНА;
								СтрСтрокиОтборПеренос.НадоУдалить = Истина;
							КонецЕсли;
						КонецЕсли; 
						
					КонецЦикла;
					
					//СВЭЙ 11.04.2024 КВВ СВФР-012809 (
					Если СтрРезЗПереносы.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация Тогда 
						//проверим, есть ли БЛ в период отзыва + Явка
						ОтборБЛ = Новый Структура;
						ОтборБЛ.Вставить("Сотрудник", СтрРезЗПереносы.Сотрудник);
						ОтборБЛ.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);  
						ОтборБЛ.Вставить("ДокБЛ", 1);
						
						СтрокиОтборБЛ = РезультатЗапроса.НайтиСтроки(ОтборБЛ);
						Если СтрокиОтборБЛ.Количество() > 0 Тогда
							Для Каждого СтрБЛ ИЗ СтрокиОтборБЛ Цикл
								Если НачалоДня(СтрБЛ.ДатаНачала) > НачалоДня(ДКонПер) 
									ИЛИ НачалоДня(СтрБЛ.ДатаОкончания) < НачалоДня(ДНачПер) Тогда
									Продолжить;
								КонецЕсли;
								Если (НачалоДня(СтрБЛ.ДатаНачала) > НачалоДня(ДНачПер) 
									И НачалоДня(СтрБЛ.ДатаНачала) < НачалоДня(ДКонПер))
									И НачалоДня(СтрБЛ.ДатаОкончания) > НачалоДня(ДКонПер) Тогда
									//Ищем Явку из-за Отзыва 
									ОтборЯвка = Новый Структура;
									ОтборЯвка.Вставить("Сотрудник", СтрРезЗПереносы.Сотрудник);
									ОтборЯвка.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа); 
									ОтборЯвка.Вставить("ДатаОкончания", ДКонПер);
									СтрокиОтборЯвка = РезультатЗапроса.НайтиСтроки(ОтборЯвка);
									Если СтрокиОтборЯвка.Количество() > 0 Тогда
										Для Каждого СтрЯвка ИЗ СтрокиОтборЯвка Цикл
											Если НачалоДня(СтрБЛ.ДатаНачала) > НачалоДня(СтрЯвка.ДатаНачала) 
												И НачалоДня(СтрБЛ.ДатаНачала) < НачалоДня(СтрЯвка.ДатаОкончания) 
												И НачалоДня(СтрЯвка.ДатаНачала) <= НачалоДня(НачалоДня(СтрБЛ.ДатаНачала)-1) Тогда 
												СтрЯвка.ДатаОкончания = НачалоДня(СтрБЛ.ДатаНачала)-1;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					//СВЭЙ 11.04.2024 КВВ СВФР-012809 )
					
				КонецЦикла;
				
				Если НадоУдалить Тогда
					НадоУдалитьСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("НадоУдалить",Истина));
					Для каждого СтрокаТаблицыНадоУдалитьСтроки Из НадоУдалитьСтроки Цикл
						РезультатЗапроса.Удалить(СтрокаТаблицыНадоУдалитьСтроки);
					КонецЦикла;
				КонецЕсли;
				
				Колонка1 = РезультатЗапроса.Колонки.Найти("НадоУдалить");
				Если НЕ Колонка1 = Неопределено Тогда
					РезультатЗапроса.Колонки.Удалить(Колонка1);
				КонецЕсли;
				
			КонецЕсли;
			//Аверсон 17.08.2023 КВВ СВФР-011229 )
			
			
			//СВЭЙ 20.10.2023 КВВ СВФР-011646 (
			ОтборОЖ = Новый Структура;
			ОтборОЖ.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам);
			
			РезультатЗапросаТЗПроверкаОЖ = Новый ТаблицаЗначений;
			РезультатЗапросаТЗПроверкаОЖ = РезультатЗапроса.Скопировать();
			
			Строки_ТЗ_Неявки_ОтборОЖ = РезультатЗапросаТЗПроверкаОЖ.НайтиСтроки(ОтборОЖ);
			Если Строки_ТЗ_Неявки_ОтборОЖ.Количество() > 0 Тогда
				
				РезультатЗапросаТЗПроверкаОЖ.Колонки.Добавить("НадоУдалить");
				НадоУдалить = Ложь;
				Для Каждого Стр_Строки_ТЗ_НеявкиОЖ ИЗ Строки_ТЗ_Неявки_ОтборОЖ Цикл
					ДН = Стр_Строки_ТЗ_НеявкиОЖ.ДатаНачала;
					ДК = Стр_Строки_ТЗ_НеявкиОЖ.ДатаОкончания;
					ОтборОЖ2 = Новый Структура;
					ОтборОЖ2.Вставить("Сотрудник",Стр_Строки_ТЗ_НеявкиОЖ.Сотрудник);
					ОтборОЖ2.Вставить("ДокПоУходу", 1);
					ОтборОЖ2.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком);
					
					Строки_ТЗ_Неявки_ОтборОЖ2 = РезультатЗапросаТЗПроверкаОЖ.НайтиСтроки(ОтборОЖ2);
					Если Строки_ТЗ_Неявки_ОтборОЖ2.Количество() > 0 Тогда
						Для Каждого СтрОЖ2 ИЗ Строки_ТЗ_Неявки_ОтборОЖ2 Цикл
							Если СтрОЖ2.ДатаОкончания >= ДК И СтрОЖ2.ДатаНачала >= ДН Тогда
								
								//СВЭЙ 24.10.2023 КВВ СВФР-011646 (
								Если НачалоМесяца(ПериодРегистрации) = НачалоМесяца(СтрОЖ2.ДатаНачала) 
									И НачалоМесяца(ПериодРегистрации) = НачалоМесяца(ДН)
									И НачалоДня(СтрОЖ2.ДатаНачала) <> НачалоДня(ДН) Тогда
									Стр_Строки_ТЗ_НеявкиОЖ.ДатаОкончания = НачалоДня(СтрОЖ2.ДатаНачала)-1;
								Иначе
									//СВЭЙ 24.10.2023 КВВ СВФР-011646 )
									
									Стр_Строки_ТЗ_НеявкиОЖ.НадоУдалить = Истина;
									НадоУдалить = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				Если НадоУдалить Тогда
					НадоУдалитьСтроки = РезультатЗапросаТЗПроверкаОЖ.НайтиСтроки(Новый Структура("НадоУдалить",Истина));
					Для каждого СтрокаТаблицыНадоУдалитьСтроки Из НадоУдалитьСтроки Цикл
						РезультатЗапросаТЗПроверкаОЖ.Удалить(СтрокаТаблицыНадоУдалитьСтроки);
					КонецЦикла;
					РезультатЗапроса = РезультатЗапросаТЗПроверкаОЖ.Скопировать();
				КонецЕсли;
				
				Колонка1 = РезультатЗапроса.Колонки.Найти("НадоУдалить");
				Если НЕ Колонка1 = Неопределено Тогда
					РезультатЗапроса.Колонки.Удалить(Колонка1);
				КонецЕсли;								
			КонецЕсли;
			//СВЭЙ 20.10.2023 КВВ СВФР-011646 )
			
			
			//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
			ТЗ_Неявки = РезультатЗапроса;
			
			//Аверсон ЕАЕ 29.08.2025 СВФР-016583
			ТЗ_НеявкиКопия = ТЗ_Неявки.Скопировать();
			//Аверсон СВФР-016583

			
			//Аверсон 09.02.2023 КВВ СВФР-010327 ( //серверная база Бобруйскагромаш сортирует ТЗ не так, как файловая версия их базы
			//Если Организация.ИНН = "700067572" И ТЗ_Неявки.Количество() > 0 Тогда
			Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() И ТЗ_Неявки.Количество() > 0 Тогда //Аверсон 02.07.2023 КВВ СВФР-011067
				
				//Аверсон 04.07.2023 КВВ СВФР-011067 (
				ОтборОтзыва = Новый Структура;
				ОтборОтзыва.Вставить("ДокОтпуска", 1);   
				ОтборОтзыва.Вставить("ДокОтзыв", 1);
				ОтборОтзыва.Вставить("ДокОтзывПеренос", 0);
				ОтборОтзыва.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
				СтрокиОтзыва = ТЗ_Неявки.НайтиСтроки(ОтборОтзыва);
				Для Каждого СтрСтрокиОтзыва Из СтрокиОтзыва Цикл  
					ОтборЯвки = Новый Структура;
					ОтборЯвки.Вставить("Сотрудник", СтрСтрокиОтзыва.Сотрудник);
					ОтборЯвки.Вставить("ДатаНачала", СтрСтрокиОтзыва.ДатаНачала);
					ОтборЯвки.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
					СтрокиЯвки = ТЗ_Неявки.НайтиСтроки(ОтборЯвки);
					Для Каждого СтрСтрокиЯвки Из СтрокиЯвки Цикл 
						СтрСтрокиЯвки.ДатаНачала = СтрСтрокиЯвки.ДатаНачала + 1;
					КонецЦикла;
				КонецЦикла;
				//Аверсон 04.07.2023 КВВ СВФР-011067 )
				
				//Аверсон ЕАЕ 08.07.2025 СВФР-016188
				//ТЗ_Неявки.Сортировать("Сотрудник,ДатаНачала");
				ТЗ_Неявки.Сортировать("Сотрудник,ДокБЛ Убыв,ДатаНачала,ДокПраздничный"); //Аверсон ЕАЕ 09.07.2025 СВФР-016199
				//Аверсон СВФР-016188
			КонецЕсли;
			//Аверсон 09.02.2023 КВВ СВФР-010327 )
			
			МассивПраздников = ПолучитьМассивПраздников();
			МассивБуквОтменыПереноса = ПолучитьМассивБуквОтменыПереноса();
			ТЗ_Переносы = ПолучитьТаблицуПереносов( ДатаНачалаПериода, ДатаОкончанияПериода );
			//- СВЭЙ КДЯ 19.11.19 СВФР-004908
			
			ТЗДниКомандировок = Новый ТаблицаЗначений;
			ТЗДниКомандировок.Колонки.Добавить("ДатаС");
			ТЗДниКомандировок.Колонки.Добавить("ДатаНаКакую");
			ТЗДниКомандировок.Колонки.Добавить("Доплачивать");
			ТЗДниКомандировок.Колонки.Добавить("ОтработаноЧасов");
			
			
			
			
			ЗапросАвтоЗаполнения.Текст = 
			"ВЫБРАТЬ
			|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	ВТГрафикиРаботыПоВидамВремени.Месяц,
			|	ВТГрафикиРаботыПоВидамВремени.Дата,
			|	ВТГрафикиРаботыПоВидамВремени.План,
			|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
			|	ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
			|	ВТГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
			|	ВТГрафикиРаботыПоВидамВремени.Документ
			|ИЗ
			|	ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
			|ГДЕ";
			
			//ПСА 28-12-2020 СВФР-006989+++
			//Аверсон 17.07.2019 КВВ СВФР-004479 (
			//Если Организация.ИНН = "100010315" Тогда
			//	ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			//	|	(ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени В (&ВидУчетаВремени, &ПоНочным)
			//	|	И ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0)";
			//Иначе
			//	ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			//	|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени";
			//КонецЕсли;
			//Аверсон 17.07.2019 КВВ СВФР-004479 )
			
			ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			|	(ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени В (&ВидУчетаВремени, &ПоНочным)
			|	И ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0)";
			//+++ПСА 28-12-2020 СВФР-006989
			
			
			ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			|	И ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы В(&ГрафикРаботы)
			|	И ВТГрафикиРаботыПоВидамВремени.Документ <> НЕОПРЕДЕЛЕНО
			|	И ВТГрафикиРаботыПоВидамВремени.Документ ССЫЛКА Документ.ВводИндивидуальныхГрафиковРаботыОрганизации";
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
			//ПСА 28-12-2020 СВФР-006989+++
			//Аверсон 17.07.2019 КВВ СВФР-004479 (
			//Если Организация.ИНН = "100010315" Тогда
			//	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
			//КонецЕсли;
			//Аверсон 17.07.2019 КВВ СВФР-004479 )
			ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
			//+++ПСА 28-12-2020 СВФР-006989
			
			ЗапросАвтоЗаполнения.УстановитьПараметр("ГрафикРаботы", СписокСотрудников);
			ТаблицаИндГрафики = ЗапросАвтоЗаполнения.Выполнить().Выгрузить();
			
			ЗапросАвтоЗаполнения.Текст = 
			"ВЫБРАТЬ
			|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	ВТГрафикиРаботыПоВидамВремени.Месяц,
			|	ВТГрафикиРаботыПоВидамВремени.Дата КАК Дата,
			|	ВТГрафикиРаботыПоВидамВремени.План,
			|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
			|	ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
			|	ВТГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
			|	ВТГрафикиРаботыПоВидамВремени.Документ,
			|	ДниСотрудников.Сотрудник.Наименование КАК СотрудникНаименование,
			|	ДниСотрудников.Сотрудник
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДатыПериода.ДатаТабеля КАК Дата,
			|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаИзменения
			|	ИЗ
			|		ВТДатыТабеля КАК ДатыПериода
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ПО (РаботникиОрганизаций.Сотрудник В (&СписокСотрудников))
			|				И (РаботникиОрганизаций.Период <= ДатыПериода.ДатаТабеля)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиОрганизаций.Сотрудник,
			|		ДатыПериода.ДатаТабеля) КАК ДниСотрудников
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|		ПО ДниСотрудников.Сотрудник = РаботникиОрганизаций.Сотрудник
			|			И ДниСотрудников.ДатаИзменения = РаботникиОрганизаций.Период
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
			|		ПО (ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВЫБОР
			|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= ДниСотрудников.Дата
			|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизаций.ГрафикРаботыЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ГрафикРаботы
			|			КОНЕЦ)
			|			И (ВТГрафикиРаботыПоВидамВремени.План)
			|			И (ВТГрафикиРаботыПоВидамВремени.Дата = ДниСотрудников.Дата)
			|			И (ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ПоЧасам
			|				ИЛИ ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени В (&ПоВечерним, &ПоНочным)
			|					И ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0)
			|			И (ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ПоЧасам)
			
			//Аверсон ЕАЕ 02.02.2021 СВФР-007075
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВведенныеТабеля
			|		ПО (ВведенныеТабеля.ГрафикРаботы = ДниСотрудников.Сотрудник)
			|			И (НЕ ВведенныеТабеля.План)
			|			И (ВведенныеТабеля.Дата = ДниСотрудников.Дата)
			|			И (ВведенныеТабеля.ВидУчетаВремени = &ПоЧасам)
			|			И (ВведенныеТабеля.Документ ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
			|		
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
			|		ПО (РаботникиОрганизацийУвольнения.Сотрудник = ДниСотрудников.Сотрудник)
			|			И (РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
			//Аверсон
			
			|ГДЕ";
			//ПСА 28-12-2020 СВФР-006989+++
			//Аверсон 17.07.2019 КВВ СВФР-004479 (
			//Если Организация.ИНН = "100010315" Тогда
			//	ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			//	|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени В (&ВидУчетаВремени, &ПоНочным)";
			//Иначе
			//	ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			//	|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени";
			//КонецЕсли;
			//Аверсон 17.07.2019 КВВ СВФР-004479 )
			ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени В (&ВидУчетаВремени, &ПоНочным)";
			//+++ПСА 28-12-2020 СВФР-006989
			ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполнения.Текст + "
			|	И НЕ ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы В (&ГрафикРаботы)
			|	И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
			
			//Аверсон ЕАЕ 02.02.2021 СВФР-007075
			|	И	(РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL 
			|	ИЛИ РаботникиОрганизацийУвольнения.Период > ДниСотрудников.Дата)
			|	И ВведенныеТабеля.ГрафикРаботы ЕСТЬ NULL
			|	И (ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0 ИЛИ ВТГрафикиРаботыПоВидамВремени.ДополнительноеЗначение > 0)
			//Аверсон
			
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникНаименование,
			|	Дата";
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
			//ПСА 28-12-2020 СВФР-006989+++
			//Аверсон 17.07.2019 КВВ СВФР-004479 (
			//Если Организация.ИНН = "100010315" Тогда
			//	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
			//КонецЕсли;
			//Аверсон 17.07.2019 КВВ СВФР-004479 )
			ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
			//+++ПСА 28-12-2020 СВФР-006989
			
			ЗапросАвтоЗаполнения.УстановитьПараметр("ГрафикРаботы", СписокСотрудников);
			ТаблицаОбщиеГрафики = ЗапросАвтоЗаполнения.Выполнить().Выгрузить();
			Если ТипЗнч(СписокСотрудников) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда 
				ТЗДниКомандировок.Очистить();
				
				стрСотрудник = СписокСотрудников;
				
				ЕстьСокращенныеДниВМесяце = ПроизводительностьПовторноеИспользование.ПроверкаСокращенныхДнейВМесяце(стрСотрудник,ПериодРегистрации); //Аверсон 21.08.2020 КВВ СВФР-006439 //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
				
				ЗапросПр = Новый Запрос;
				ЗапросПр.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Сотрудник = &Сотрудник
				|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
				|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
				
				ЗапросПр.УстановитьПараметр("Организация", Организация);
				ЗапросПр.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
				ЗапросПр.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
				
				ЗапросПр.УстановитьПараметр("Сотрудник", стрСотрудник);
				
				РезультатЗапросаПр = ЗапросПр.Выполнить().Выбрать();
				ДатаПр = ПериодРегистрации;
				Пока РезультатЗапросаПр.Следующий() Цикл
					ДатаПр = РезультатЗапросаПр.Период; 					
				КонецЦикла;
				ЗапросУв = Новый Запрос;
				ЗапросУв.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Сотрудник = &Сотрудник
				|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
				
				ЗапросУв.УстановитьПараметр("Сотрудник", стрСотрудник);
				
				РезультатЗапросаУв = ЗапросУв.Выполнить().Выбрать();
				ДатаУв = КонецМесяца(ПериодРегистрации);
				Пока РезультатЗапросаУв.Следующий() Цикл
					ДатаУв = РезультатЗапросаУв.Период; 					
				КонецЦикла;
				
				
				
				Если РезультатЗапросаПр.Количество()> 0 Тогда 
					РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПр,Новый Структура("Сотрудник",стрСотрудник));
				иначе
					РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",стрСотрудник)); 	
				КонецЕсли; 
				//О.Т. Аверсон 28.02.2019 № нет заявки
				ЗапросИзменения = Новый Запрос;
				ЗапросИзменения.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Период,
				|	РаботникиОрганизаций.ГрафикРаботы
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Сотрудник = &Сотрудник
				|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
				
				ЗапросИзменения.УстановитьПараметр("Период", ПериодРегистрации);
				ЗапросИзменения.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
				ЗапросИзменения.УстановитьПараметр("Сотрудник", стрСотрудник);
				
				РезультатЗапросаИзменения = ЗапросИзменения.Выполнить().Выбрать();
				ТЗГрафикРаботыИзменения = Новый ТаблицаЗначений;
				ТЗГрафикРаботыИзменения.Колонки.Добавить("График");
				СтрТЗГрафикРаботыИзменения = ТЗГрафикРаботыИзменения.Добавить();
				СтрТЗГрафикРаботыИзменения.График = РегистрРаботники.ГрафикРаботы;
				
				ЕстьИзменения = Ложь;
				Пока РезультатЗапросаИзменения.Следующий() Цикл
					СтрТЗГрафикРаботыИзменения = ТЗГрафикРаботыИзменения.Добавить();
					СтрТЗГрафикРаботыИзменения.График = РезультатЗапросаИзменения.ГрафикРаботы;
					ЕстьИзменения = Истина;
				КонецЦикла;
				ТЗГрафикРаботыИзменения.Свернуть("График");
				//О.Т. Аверсон 28.02.2019 № нет заявки
				
				
				ИндексМассиваПриставок = 0;
				
				Если ТекущаяСтрокаТабличнойЧасти = Неопределено Тогда
					Если НЕ ТолькоСравнениеТабелей Тогда  //Аверсон 12.07.2019 КВВ СВФР-004487
						СтрокаРасшифровкиПоДням = ОтработанноеВремя.Добавить();
					Иначе
						СтрокаРасшифровкиПоДням = ОтработанноеВремя1.Добавить(); //Аверсон 12.07.2019 КВВ СВФР-004487
					КонецЕсли;
				Иначе
					СтрокаРасшифровкиПоДням = ТекущаяСтрокаТабличнойЧасти;
					Для ИндексДня = 1 По 31 Цикл
						ТекущаяСтрокаТабличнойЧасти["ПервыйВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
						ТекущаяСтрокаТабличнойЧасти["ВторойВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
						ТекущаяСтрокаТабличнойЧасти["ТретийВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
						ТекущаяСтрокаТабличнойЧасти["ПервыйЧасов" + Строка(ИндексДня)] = 0;
						ТекущаяСтрокаТабличнойЧасти["ВторойЧасов" + Строка(ИндексДня)] = 0;
						ТекущаяСтрокаТабличнойЧасти["ТретийЧасов" + Строка(ИндексДня)] = 0;
					КонецЦикла;
				КонецЕсли;
				СтрокаРасшифровкиПоДням.Сотрудник = стрСотрудник;
				
				мТаблицаИндГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы",стрСотрудник));
				
				//Аверсон 09.09.2020 КВВ СВФР-006526 (
				Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
					И мТаблицаИндГрафики.Количество() > 0 И ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
					ТекущийИндекс = 0; 
					ВсегоЭлементов = мТаблицаИндГрафики.Количество(); 
					Пока ТекущийИндекс < ВсегоЭлементов Цикл 
						Индекс2 = ТекущийИндекс + 1; 
						Пока Индекс2 < ВсегоЭлементов Цикл 
							ПодрДок = мТаблицаИндГрафики[Индекс2].Документ.ПодразделениеОрганизации;
							Если ЗначениеЗаполнено(ПодрДок) И ПодрДок <> ПодразделениеОрганизации И НЕ ПодрДок.ПринадлежитЭлементу(ПодразделениеОрганизации) Тогда  //Аверсон 02.10.2020 КВВ СВФР-006634 (третье условие)
								мТаблицаИндГрафики.Удалить(Индекс2); 
								ВсегоЭлементов = ВсегоЭлементов - 1; 
							Иначе 
								Индекс2 = Индекс2 + 1; 
							КонецЕсли; 
						КонецЦикла; 
						ТекущийИндекс = ТекущийИндекс + 1; 
					КонецЦикла; 
					Если мТаблицаИндГрафики.Количество() > 0 Тогда
						ПодрДок = мТаблицаИндГрафики[0].Документ.ПодразделениеОрганизации;
						Если ЗначениеЗаполнено(ПодрДок) И ПодрДок <> ПодразделениеОрганизации И НЕ ПодрДок.ПринадлежитЭлементу(ПодразделениеОрганизации) Тогда  //Аверсон 02.10.2020 КВВ СВФР-006634 (третье условие)
							мТаблицаИндГрафики.Удалить(0); 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
				//Аверсон 09.09.2020 КВВ СВФР-006526 )
				
				Если мТаблицаИндГрафики.Количество()=0 Тогда
					
					для Каждого стрИзм из ТЗГрафикРаботыИзменения Цикл 
						ОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Сотрудник",стрИзм.График,стрСотрудник));
						
						
						Если ОбщиеГрафики.Количество()>0 Тогда 
							Для Каждого стрГрафик из ОбщиеГрафики Цикл 
								БылаКомандировкаВДате = Ложь;   //Аверсон 03.05.2021 КВВ СВФР-007537
								ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
								Если стрГрафик.Дата < ДатаПр Тогда 
									Продолжить;
								КонецЕсли;
								Если стрГрафик.Дата >= ДатаУв Тогда 
									Продолжить;
								КонецЕсли;
								
								//СВЭЙ 29.09.2023 КВВ СВФР-011538 (
								ЕстьСокращенныеДниВДате = Ложь; 
								Если ЕстьСокращенныеДниВМесяце Тогда
									ЕстьСокращенныеДниВДате = ПроизводительностьПовторноеИспользование.ПроверкаСокращенныхДнейВПериод(стрГрафик.Сотрудник,стрГрафик.Дата);
								КонецЕсли;
								//СВЭЙ 29.09.2023 КВВ СВФР-011538 )
								
								Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
									//О.Т. Аверсон 29.06.2016 № 
									ЗапросПеремещениеВременное = Новый Запрос;
									ЗапросПеремещениеВременное.Текст = 
									"ВЫБРАТЬ
									|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
									|	РаботникиОрганизацийСрезПоследних.Сотрудник
									|ИЗ
									|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
									|ГДЕ
									|	РаботникиОрганизацийСрезПоследних.Период <= &Дата";
									
									ЗапросПеремещениеВременное.УстановитьПараметр("Дата", КонецДня(стрГрафик.Дата));
									ЗапросПеремещениеВременное.УстановитьПараметр("Сотрудник", стрСотрудник);
									
									РезультатПеремещениеВр = ЗапросПеремещениеВременное.Выполнить().Выгрузить();
									Для Каждого стр из РезультатПеремещениеВр Цикл 
										ПодразделениеИзРегистра = стр.ПодразделениеОрганизации;
									КонецЦикла;
									
									ЗапросПодразд = Новый Запрос;
									ЗапросПодразд.Текст = 
									"ВЫБРАТЬ
									|	ПодразделенияОрганизаций.Ссылка
									|ИЗ
									|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
									|ГДЕ
									|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Ссылка)";
									
									ЗапросПодразд.УстановитьПараметр("Ссылка", ПодразделениеОрганизации);
									
									ТЗПодразделения = ЗапросПодразд.Выполнить().Выгрузить();
									Если ТЗПодразделения.НайтиСтроки(Новый Структура("Ссылка",ПодразделениеИзРегистра)).Количество()=0 Тогда  
										Продолжить;
									КонецЕсли;
								КонецЕсли;
								
								
								
								Запрос = Новый Запрос;
								Запрос.Текст = 
								"ВЫБРАТЬ
								|	РегламентированныйПроизводственныйКалендарь.ВидДня
								|ИЗ
								|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
								|ГДЕ
								|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
								
								Запрос.УстановитьПараметр("ДатаКалендаря", стрГрафик.Дата);
								
								РезультатЗапроса1 = Запрос.Выполнить().Выбрать();
								Выходной = Ложь;
								ЕстьНевыход = Ложь;
								ЕстьКомандировка = Ложь;
								ЕстьПраздник = Ложь;
								ЕстьБЛ = Ложь;
								ЕстьПоУходу = Ложь;
								ЕстьОтп = Ложь;
								//Аверсон 18.01.2021 КВВ СВФР-007084 (
								Если (Организация.ИНН = "700067572" 
									ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
									ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
									ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
									И
									стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
									//стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
									стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени Тогда
								Иначе
									//Аверсон 18.01.2021 КВВ СВФР-007084 )
									Пока РезультатЗапроса1.Следующий() Цикл
										Если (РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота или РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье)
											и не ЗначениеЗаполнено(стрГрафик.ОсновноеЗначение) Тогда 
											Выходной = Истина;
											МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
											Если не МассивРезультатЗапроса.Количество()=0 Тогда
												Для Каждого стрНеявки из МассивРезультатЗапроса Цикл   
													
													//				ЕстьНевыход = Ложь;
													//ЕстьКомандировка = Ложь;
													//ЕстьПраздник = Ложь;
													//ЕстьБЛ = Ложь;
													//ЕстьПоУходу = Ложь;
													//ЕстьОтп = Ложь;
													//				
													
													МассивРезультатЗапроса = стрНеявки;
													Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда
													иначе 											
														Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда
															Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
																ЕстьНевыход = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокКомандировка = 1 Тогда 
																ЕстьКомандировка = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокБЛ = 1 Тогда 
																ЕстьБЛ = Истина; 
															ИначеЕсли МассивРезультатЗапроса.ДокПоУходу = 1 Тогда 
																ЕстьПоУходу = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокОтпуска = 1 Тогда 
																ЕстьОтп = Истина;
															КонецЕсли;
															
														КонецЕсли; 
													КонецЕсли;    											
												КонецЦикла;  										
											КонецЕсли;
											Если не (ЕстьНевыход или ЕстьКомандировка или ЕстьБЛ или ЕстьПоУходу или ЕстьОтп) Тогда 
												Прервать;
											КонецЕсли;
										ИначеЕсли РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
											ЕстьПраздник = Истина;
											КакаяБукваВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка(); //Аверсон 17.07.2019 КВВ СВФР-004535
											МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
											Если не МассивРезультатЗапроса.Количество()=0 Тогда
												Для Каждого стрНеявки из МассивРезультатЗапроса Цикл       											
													МассивРезультатЗапроса = стрНеявки;
													Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда
													иначе 											
														Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда
															КакаяБукваВремени = МассивРезультатЗапроса.БукваВидаВремени; //Аверсон 17.07.2019 КВВ СВФР-004535
															Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
																ЕстьНевыход = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокКомандировка = 1 Тогда 
																ЕстьКомандировка = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокБЛ = 1 Тогда 
																ЕстьБЛ = Истина;
															ИначеЕсли МассивРезультатЗапроса.ДокПоУходу = 1 Тогда 
																ЕстьПоУходу = Истина; 
															ИначеЕсли МассивРезультатЗапроса.ДокОтпуска = 1 Тогда 
																//ЕстьОтп = Истина;
															КонецЕсли;
															
														КонецЕсли; 
													КонецЕсли;    											
												КонецЦикла;  
												
												//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) (
											Иначе //если нет неявок 
												Если стрГрафик.ОсновноеЗначение <> 0 И ИндексМассиваПриставок = 0 Тогда
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;  
													
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;  
													
													
													Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
													Если Ночч.Количество() > 0 Тогда
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
													КонецЕсли;
													
													ИндексМассиваПриставок = 0;
												КонецЕсли;
												//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) )
												
											КонецЕсли;
										КонецЕсли;
										
									КонецЦикла; 
								КонецЕсли;
								МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
								Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) и МассивРезультатЗапроса.Количество()=0 Тогда 
									Продолжить;
								КонецЕсли;
								
								Если ЕстьПраздник Тогда 
									ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									//СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
									
									//Аверсон 17.07.2019 КВВ СВФР-004535 (
									Если КакаяБукваВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам;
									КонецЕсли;
									//Аверсон 17.07.2019 КВВ СВФР-004535 )
									
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
									Если не (ЕстьНевыход или ЕстьКомандировка или ЕстьБЛ или ЕстьПоУходу или ЕстьОтп) Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;
								
								ЧасовСверхрУрПоПриказу = 0;//Аверсон 18.01.2021 КВВ СВФР-007084
								РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
								РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
								РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
								РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
								
								МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник)); 
								Если МассивРезультатЗапроса.Количество()=0 или стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда  //ПСА 25.02.2021 СВФР-007248+++
									//Аверсон 18.01.2021 КВВ СВФР-007084 (
									СчитатьДальше = Истина;  Сменный = Ложь;
									Если (Организация.ИНН = "700067572" 
										ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
										ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
										ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
										И
										стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
										//	стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
										стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени И
										ОбщиеГрафики.Количество()>0 Тогда 
										МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрГрафик.Дата,стрСотрудник));
										Если МассивОбщиеГрафики.Количество()>0 Тогда 
											Сменный = Истина;
											ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
											Если ЗначениеЧасов = 0 Тогда
												СчитатьДальше = Ложь;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;     
									
									//Аверсон 24.05.2022 КВВ СВФР-009102 (
									НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
									Если НачалоМесяца(ДатаПр) = НачалоМесяца(стрГрафик.Дата) И ДатаПр <> НачалоМесяца(стрГрафик.Дата) Тогда
										//НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
										Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
											КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
											Если КакойДеньПереносим < ДатаПр Тогда
												СчитатьДальше = Ложь;
											КонецЕсли;
										КонецЕсли;	
									КонецЕсли;
									//Аверсон 24.05.2022 КВВ СВФР-009102 )
									
									//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (
									Если СчитатьДальше И НайденныеСтрокиПереноса.Количество() > 0 Тогда
										НаКакойДеньПереносим = НайденныеСтрокиПереноса[0].ВыходнойДень;
										КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
										Если НачалоМесяца(НаКакойДеньПереносим) = НачалоМесяца(ДатаПр) И НаКакойДеньПереносим >= ДатаПр И НаКакойДеньПереносим = стрГрафик.Дата Тогда
											РезЗ_Перенос = ПроверкаДняНаКоторыйПереносим(стрСотрудник,НачалоДня(КакойДеньПереносим));
											Если РезЗ_Перенос.Количество() > 0 Тогда
												СчитатьДальше = Ложь;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) )
									
									Если СчитатьДальше Тогда
										//Аверсон 18.01.2021 КВВ СВФР-007084 )
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										
										//Аверсон 21.08.2020 КВВ СВФР-006439 (
										Если (НЕ ЕстьСокращенныеДниВМесяце 
											ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										Иначе
											СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546  ПроизводительностьПовторноеИспользование
											ЗначениеЧасов = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);    
										КонецЕсли;
										//Аверсон 21.08.2020 КВВ СВФР-006439 )
										
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
										//дексМассиваПриставок = ИндексМассиваПриставок + 1;
										
										//Аверсон 18.01.2021 КВВ СВФР-007084 (
										Если Сменный Тогда    
											Пока РезультатЗапроса1.Следующий() Цикл
												Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
												КонецЕсли;
											КонецЦикла;
											
											Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
											Если Ночч.Количество() > 0 Тогда
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 18.01.2021 КВВ СВФР-007084 )
									КонецЕсли;
								иначе
									БукваВидаВремени = "";
									ЗначениеЧасов = "";
									ЗначЕстьВИнтервале = Ложь;
									ЭтоОтпуск = Ложь;
									ЕстьПредыдБЛ = Ложь;  //Аверсон 06.04.2020 КВВ СВФР-005776
									ЕстьПродлениеВОтзыве = Ложь; //Аверсон 14.04.2020 КВВ СВФР-005809
									ВДатеСокращенноеВремя = Ложь; //Аверсон 04.06.2021 КВВ СВФР-007642 
									//Аверсон 05.12.2019 КВВ СВФР-005153 (
									ЕстьОтзывИзОтпуска = Ложь;
									ЗОтзыв = Новый Запрос;
									ЗОтзыв.Текст = 
									"ВЫБРАТЬ
									|	СостояниеРаботниковОрганизаций.Регистратор, //Аверсон 14.04.2020 КВВ СВФР-005809
									|	СостояниеРаботниковОрганизаций.Состояние,
									|	СостояниеРаботниковОрганизаций.Период   //Аверсон 03.04.2020 КВВ СВФР-005776
									
									//Аверсон ЕАЕ 10.03.2021 СВФР-007311
									//|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаПроверки) КАК СостояниеРаботниковОрганизаций
									|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
									//Аверсон СВФР-007311
									
									|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
									|	И &ДатаПроверки МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ,-1), ДЕНЬ)
									|	И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска";
									
									//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) (
									Если Организация.ИНН = "700067572" Тогда
										ЗОтзыв.Текст = ЗОтзыв.Текст + "
										|	И СостояниеРаботниковОрганизаций.Регистратор.НомерБЛ = &Пустота"; 
									КонецЕсли;
									//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) )
									
									ЗОтзыв.Текст = ЗОтзыв.Текст + "
									|	И (СостояниеРаботниковОрганизаций.Регистратор.ОтражатьИзмененияПоПродлению //Аверсон 21.04.2021 КВВ СВФР-007454
									
									//Аверсон 17.08.2023 КВВ СВФР-011229 (
									|ИЛИ (СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
									|ИЛИ СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Компенсация)))";
									//Аверсон 17.08.2023 КВВ СВФР-011229 )
									
									ЗОтзыв.УстановитьПараметр("ДатаПроверки", стрГрафик.Дата);
									ЗОтзыв.УстановитьПараметр("Сотрудник", стрСотрудник);
									ЗОтзыв.УстановитьПараметр("Пустота", ""); //Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1)
									РезультатОтзыв = ЗОтзыв.Выполнить().Выбрать();
									Пока РезультатОтзыв.Следующий() Цикл
										ЕстьОтзывИзОтпуска = Истина;
										//Аверсон 14.04.2020 КВВ СВФР-005809 (
										Если РезультатОтзыв.Регистратор.ОтражатьИзмененияПоПродлению И ЗначениеЗаполнено(РезультатОтзыв.Регистратор.ПродлениеС) И ЗначениеЗаполнено(РезультатОтзыв.Регистратор.ПродлениеПо) И
											((НачалоДня(стрГрафик.Дата) >= НачалоДня(РезультатОтзыв.Регистратор.ПродлениеС)) и (НачалоДня(стрГрафик.Дата) <= НачалоДня(РезультатОтзыв.Регистратор.ПродлениеПо))) Тогда
											ЕстьПродлениеВОтзыве = Истина;
											
											//Аверсон 17.08.2023 КВВ СВФР-011229 (
										ИначеЕсли ЕстьПродлениеВОтзыве 
											И (РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Перенос 
											ИЛИ РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация) Тогда
											ЕстьПродлениеВОтзыве = Ложь;
											//Аверсон 17.08.2023 КВВ СВФР-011229 )
											
										Иначе
											//Аверсон 14.04.2020 КВВ СВФР-005809 )
											//Аверсон 03.04.2020 КВВ СВФР-005776 (
											ЕстьПредыдБЛ = Ложь;
											ЗПредыдСост = Новый Запрос;
											ЗПредыдСост.Текст = 
											"	ВЫБРАТЬ
											|	СостояниеРаботниковОрганизаций.Состояние,
											|	СостояниеРаботниковОрганизаций.Регистратор
											|	ИЗ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаПроверки) КАК СостояниеРаботниковОрганизаций
											|	ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник";
											ЗПредыдСост.УстановитьПараметр("ДатаПроверки", НачалоДня(РезультатОтзыв.Период)-86400);
											ЗПредыдСост.УстановитьПараметр("Сотрудник", стрСотрудник);
											РезультатЗПредыдСост = ЗПредыдСост.Выполнить().Выбрать();
											Пока РезультатЗПредыдСост.Следующий() Цикл
												Если РезультатЗПредыдСост.Состояние = Перечисления.СостоянияРаботникаОрганизации.Заболевание Тогда
													ЕстьПредыдБЛ = Истина;
												КонецЕсли;
											КонецЦикла;
											Если НЕ ЕстьПредыдБЛ Тогда
												ЗПредыдСост.Текст =
												"ВЫБРАТЬ
												|СостояниеРаботниковОрганизаций.Состояние,
												|СостояниеРаботниковОрганизаций.Регистратор
												|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
												|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
												|И СостояниеРаботниковОрганизаций.Период = &ДатаПроверки //не исправлять, ниже изменение кода по поиску
												|И СостояниеРаботниковОрганизаций.Состояние = &СостояниеБЛ";
												ЗПредыдСост.УстановитьПараметр("ДатаПроверки", НачалоДня(РезультатОтзыв.Период));
												ЗПредыдСост.УстановитьПараметр("Сотрудник", стрСотрудник);
												ЗПредыдСост.УстановитьПараметр("СостояниеБЛ", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
												
												//СВЭЙ 11.04.2024 КВВ СВФР-012809 (
												Если РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация 
													И НачалоДня(стрГрафик.Дата) >= НачалоДня(РезультатОтзыв.Период)
													И НачалоДня(стрГрафик.Дата) <= НачалоДня(РезультатОтзыв.Регистратор.ДатаОкончания) Тогда 
													ЗПредыдСост.Текст = СтрЗаменить(ЗПредыдСост.Текст," = &ДатаПроверки"," МЕЖДУ &ДатаПроверки И &ДатаПроверкиКон");
													ЗПредыдСост.Текст = ЗПредыдСост.Текст + "
													|И СостояниеРаботниковОрганизаций.Период <= &ТекДатаПроверки";
													ЗПредыдСост.УстановитьПараметр("ДатаПроверкиКон", КонецДня(РезультатОтзыв.Регистратор.ДатаОкончания));
													ЗПредыдСост.УстановитьПараметр("ТекДатаПроверки", НачалоДня(стрГрафик.Дата));
												КонецЕсли;
												//СВЭЙ 11.04.2024 КВВ СВФР-012809 )
												
												РезультатЗПредыдСост = ЗПредыдСост.Выполнить().Выбрать();
												Пока РезультатЗПредыдСост.Следующий() Цикл
													ЕстьПредыдБЛ = Истина;
												КонецЦикла;
											КонецЕсли;
											//Аверсон 03.04.2020 КВВ СВФР-005776 )
										КонецЕсли;
										Если Выходной И НЕ ЕстьПродлениеВОтзыве И НЕ ЕстьПредыдБЛ Тогда  //Аверсон 14.04.2020 КВВ СВФР-005809 ( условие на НЕ ЕстьПродлениеВОтзыве, НЕ ЕстьПредыдБЛ )
											БукваВидаВремени = "";
											ЗначениеЧасов = "";
										Иначе
											//Аверсон 03.04.2020 КВВ СВФР-005776 (
											Если ЕстьПредыдБЛ Тогда
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
												//Аверсон 03.04.2020 КВВ СВФР-005776 )
												//Аверсон 14.04.2020 КВВ СВФР-005809 (
											ИначеЕсли ЕстьПродлениеВОтзыве Тогда
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск;
												//Аверсон 14.04.2020 КВВ СВФР-005809 )
											Иначе	
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											КонецЕсли; 
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										КонецЕсли;
									КонецЦикла;
									//Аверсон 05.12.2019 КВВ СВФР-005153 )
									
									Для Каждого стрНеявки из МассивРезультатЗапроса Цикл
										
										МассивРезультатЗапроса = стрНеявки; 
										Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка или ЕстьОтзывИзОтпуска) и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь //Аверсон 05.12.2019 КВВ СВФР-005153 (ЕстьОтзывИзОтпуска)
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком //Аверсон 15.07.2019 КВВ СВФР-004528
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя //Аверсон 11.05.2020 КВВ СВФР-005970
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты
											//Аверсон 22.03.2021 КВВ СВФР-007331 (
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья
											и МассивРезультатЗапроса.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция
											//Аверсон 22.03.2021 КВВ СВФР-007331 )
											Тогда
											Продолжить;	
										КонецЕсли;
										Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
											БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										иначе 
											Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда 
												//Аверсон 05.12.2019 КВВ СВФР-005153 (
												
												//Аверсон 21.04.2021 КВВ СВФР-007454 (
												Если ЕстьОтзывИзОтпуска Тогда
													////Аверсон ЕАЕ 11.03.2021 СВФР-007311
													////Если ЕстьОтзывИзОтпуска Тогда
													//Если МассивРезультатЗапроса.ДокОтпуска = 1 И МассивРезультатЗапроса.ДокОтзыв = 1 И ЕстьОтзывИзОтпуска Тогда 
													////Аверсон СВФР-007311
													//Аверсон 21.04.2021 КВВ СВФР-007454 )
													
													//Аверсон ЕАЕ 10.10.2024 СВФР-013739
													Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования ИЛИ
														
														//Аверсон ЕАЕ 05.12.2024 СВФР-014326
														МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя ИЛИ
														//Аверсон СВФР-014326
														
														//Аверсон ЕАЕ 17.12.2025 СВФР-017589
														МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПрохождениеДиспансеризации Тогда
														//Аверсон СВФР-017589
														
														БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
														ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
														Прервать;
													КонецЕсли;
													//Аверсон СВФР-013739
													
													//Аверсон ЕАЕ 04.11.2024 СВФР-013897
													//Посчитаем сверхурочные
													ЧасовСверхрУрПоПриказу = 0;
													РаботаСверхурочныеКакЯвка = Ложь; 
													РаботаСверхурочныеКакКомандировка = Ложь; 
													РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; 
													РаботаВПраздникКакЯвка = Ложь; 
													РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; 
													Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
														ЗСверхУ = Новый Запрос;
														ЗСверхУ.Текст = "ВЫБРАТЬ 
														|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
														|ТЧДок.ОплачиватьВОдинарномРазмере
														|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
														|ГДЕ
														|ТЧДок.Ссылка.Проведен
														|И ТЧДок.Сотрудник = &Сотрудник
														|И ТЧДок.Дата = &Дата
														|СГРУППИРОВАТЬ ПО ТЧДок.ОплачиватьВОдинарномРазмере";
														ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
														ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
														РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
														Если РезЗСверхУ.Количество() > 0 Тогда
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														КонецЕсли;
													КонецЕсли;
													//Аверсон СВФР-013897
													
													Продолжить;
												КонецЕсли;
												//Аверсон 05.12.2019 КВВ СВФР-005153 )
												Если ЗначЕстьВИнтервале Тогда 
													//Если не ЭтоОтпуск Тогда 
													//	Продолжить;
													//КонецЕсли;
													
													Если не МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты Тогда  
														если не ЭтоОтпуск Тогда 
															//Аверсон 05.12.2019 КВВ СВФР-005153 (
															Если (МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя //Аверсон 11.05.2020 КВВ СВФР-005970
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя  //Аверсон 28.02.2021 КВВ СВФР-007260
																//Аверсон 22.03.2021 КВВ СВФР-007331 (
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция
																//Аверсон 22.03.2021 КВВ СВФР-007331 )
																или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение) 
																И  (БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
																БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																
																//Аверсон ЕАЕ 10.03.2021 СВФР-007311
																Продолжить;
																//Аверсон СВФР-007311
															КонецЕсли;
															//Аверсон 05.12.2019 КВВ СВФР-005153 )
															
															//Аверсон ЕАЕ 10.03.2021 СВФР-007311
															//Продолжить;
															//Аверсон СВФР-007311
														КонецЕсли;
													КонецЕсли;												
												КонецЕсли;
												
												//Аверсон 03.05.2021 КВВ СВФР-007537 (
												Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
													БылаКомандировкаВДате = Истина;
												КонецЕсли;
												Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И БылаКомандировкаВДате Тогда
													Продолжить;
												КонецЕсли;
												//Аверсон 03.05.2021 КВВ СВФР-007537 )
												
												//Аверсон 26.05.2021 КВВ СВФР-007567 (
												Если ЗначениеЗаполнено(БукваВидаВремени) 
													И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь 
													И (МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
													ИЛИ МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск) Тогда
													Продолжить;
												КонецЕсли;
												//Аверсон 26.05.2021 КВВ СВФР-007567 )
												
												
												БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
												ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
												
												//Аверсон 28.01.2021 КВВ СВФР-007084 (
												ЧасовСверхрУрПоПриказу = 0; 
												//ПСА 12.02.2021 СВФР-007197+++
												РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
												РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
												РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 01.04.2021 СВФР-007413
												РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
												РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; //Аверсон 03.06.2021 КВВ СВФР-007334
												
												//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
												Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
													или БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
													//+++ПСА 12.02.2021 СВФР-007197	
													ЗСверхУ = Новый Запрос;
													ЗСверхУ.Текст = "ВЫБРАТЬ 
													|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
													|ТЧДок.ОплачиватьВОдинарномРазмере,
													
													//Аверсон ЕАЕ 09.09.2025 СВФР-016610
													//Бобруйскводоканал
													|ТЧДок.ЯвкаВТабель
													//Аверсон СВФР-016610
													
													|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
													|ГДЕ
													|ТЧДок.Ссылка.Проведен
													|И ТЧДок.Сотрудник = &Сотрудник
													|И ТЧДок.Дата = &Дата
													|СГРУППИРОВАТЬ ПО 
													|ТЧДок.ОплачиватьВОдинарномРазмере,
													
													//Аверсон ЕАЕ 09.09.2025 СВФР-016610
													//Бобруйскводоканал
													|	ТЧДок.ЯвкаВТабель
													//Аверсон СВФР-016610
													
													|";
													ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
													ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
													РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
													Если РезЗСверхУ.Количество() > 0 Тогда
														Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда //ПСА 12.02.2021 СВФР-007197+++
															//ПСА 12.03.2021+++
															Если БылаКомандировка(стрСотрудник,стрГрафик.Дата) Тогда
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
															Иначе
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															КонецЕсли;	
															//+++ПСА 12.03.2021
															
															//Аверсон ЕАЕ 01.04.2021 СВФР-007413
															//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
															Если Организация.ИНН = "700067572" Тогда
																//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 4)
																Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																	РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																	ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
																Иначе
																	//Аверсон 02.07.2021 КВВ СВФР-007801 )
																	//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
																	Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																		РаботаСверхурочныеВКомандировкеКакЯвка = Истина;
																	КонецЕсли;
																	
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																	//Аверсон СВФР-007413
																КонецЕсли;
																
															//Аверсон ЕАЕ 09.09.2025 СВФР-016610
															//Бобруйскводоканал
															ИначеЕсли Организация.ИНН = "790041382" Тогда
																Если РезЗСверхУ[0].ЯвкаВТабель И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																	//РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																	ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																Иначе
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																КонецЕсли;
															//Аверсон СВФР-016610
															
															Иначе
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															КонецЕсли;
															//ПСА 12.02.2021 СВФР-007197+++	
															//ПСА 05.03.2021 СВФР-007298+++ 
															
															Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
																И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) Тогда
																
																//ПСА 12.03.2021+++
																//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка и ПодразделениеТранспортногоЦеха() Тогда
																//	РаботаСверхурочныеКакКомандировка = Истина;
																//Иначе
																//	РаботаСверхурочныеКакЯвка = Истина;
																//КонецЕсли;
																
																
																Если ПодразделениеТранспортногоЦеха() Тогда
																	РаботаСверхурочныеКакЯвка = Ложь;
																Иначе
																	РаботаСверхурочныеКакЯвка = Истина;
																КонецЕсли;
																
																
																//+++ПСА 12.03.2021
															КонецЕсли;	
															//+++ПСА 05.03.2021 СВФР-007298
														Иначе
															//Аверсон ЕАЕ 01.04.2021 СВФР-007413
															//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
															Если Организация.ИНН = "700067572" Тогда
																//Аверсон СВФР-007413
																
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																
																//Аверсон ЕАЕ 01.04.2021 СВФР-007413
																//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																//Аверсон СВФР-007413
																
																//Аверсон 03.06.2021 КВВ СВФР-007334 (
																Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																	РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																КонецЕсли;
																//Аверсон 03.06.2021 КВВ СВФР-007334 )
																
															Иначе
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															КонецЕсли;
															//ПСА 11.03.2021 СВФР-007321+++      
															//Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
															//	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) и ПодразделениеТранспортногоЦеха() Тогда
															//	РаботаСверхурочныеКакКомандировка = Истина;
															//КонецЕсли;	
															//+++ПСА 11.03.2021 СВФР-007321
															
														КонецЕсли;
														//+++ПСА 12.02.2021 СВФР-007197	
													КонецЕсли;	
												КонецЕсли;
												//Аверсон 28.01.2021 КВВ СВФР-007084 )
												
												Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
													ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
													РезультатСост = ЗЗ.Выполнить().Выбрать();
													
													//Аверсон ЕАЕ 04.08.2025 СВФР-016362
													//Бобруйскводоканал
													Если Организация.ИНН = "790041382" Тогда
														//БукваВидаВремени (Праздники)
														//ЗначениеЧасов (8)
														
														СтруктураПраздники = Новый Структура;
														СтруктураПраздники.Вставить("Праздники", 0);
														СтруктураПраздники.Вставить("Работа", 0);
														
														
														Пока РезультатСост.Следующий() Цикл
															Для Каждого Стр Из РезультатСост.Регистратор.РаботникиОрганизации Цикл
																Если Стр.Сотрудник = стрСотрудник Тогда
																	Если ЗначениеЗаполнено(Стр.ДеньОтдыха) Тогда
																		СтруктураПраздники.Работа = СтруктураПраздники.Работа + Стр.ОтработаноЧасов;	
																	ИначеЕсли не стр.Доплачивать и не ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																		СтруктураПраздники.Работа = СтруктураПраздники.Работа + Стр.ОтработаноЧасов;
																	ИначеЕсли стр.Доплачивать и ЗначениеЗаполнено(стр.ДатаВыхода) Тогда
																		Если Стр.ЯвкаВТабель И (НачалоДня(МассивРезультатЗапроса.ДатаНачала) = НачалоДня(стр.ДатаВыхода)) Тогда
																			СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + Стр.ОтработаноЧасов;
																			СтруктураПраздники.Работа = СтруктураПраздники.Работа + Стр.ОтработаноЧасов;
																		Иначе
																			СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + Стр.ОтработаноЧасов;	
																		КонецЕсли;
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
														КонецЦикла;
														
														Если ЗначениеЗаполнено(СтруктураПраздники.Работа) И ЗначениеЗаполнено(СтруктураПраздники.Праздники) Тогда
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтруктураПраздники.Праздники;
															
															ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
															
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															ЗначениеЧасов = СтруктураПраздники.Работа;
															
														ИначеЕсли ЗначениеЗаполнено(СтруктураПраздники.Работа) Тогда
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															ЗначениеЧасов = СтруктураПраздники.Работа;	
														ИначеЕсли ЗначениеЗаполнено(СтруктураПраздники.Праздники) Тогда
															ЗначениеЧасов = СтруктураПраздники.Праздники;
														КонецЕсли;
														
													Иначе
													//Аверсон СВФР-016362
														
														Пока РезультатСост.Следующий() Цикл
															для Каждого стр из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																Если стр.Сотрудник = стрСотрудник Тогда  
																	Если ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																		БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		ЗначениеЧасов = стр.ОтработаноЧасов;  
																	ИначеЕсли не стр.Доплачивать и не ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																		БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		ЗначениеЧасов = стр.ОтработаноЧасов;
																	ИначеЕсли стр.Доплачивать и ЗначениеЗаполнено(стр.ДатаВыхода) Тогда 
																		ЗначениеЧасов = стр.ОтработаноЧасов;
																		//Аверсон 03.01.2020 КВВ СВФР-005271 (
																		Если Стр.ЯвкаВТабель И (НачалоДня(МассивРезультатЗапроса.ДатаНачала) = НачалоДня(стр.ДатаВыхода)) Тогда
																			НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
																			СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
																			НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
																			СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
																			
																			ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
																			
																			БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			ЗначениеЧасов = стр.ОтработаноЧасов;
																		КонецЕсли;
																		//Аверсон 03.01.2020 КВВ СВФР-005271 )
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
															
														КонецЦикла;
													КонецЕсли;
													
												КонецЕсли;
												Если МассивРезультатЗапроса.ДокКомандировка = 1 Тогда
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
													ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
													РезультатСост = ЗЗ.Выполнить().Выбрать();
													Пока РезультатСост.Следующий() Цикл
														для Каждого стр из РезультатСост.Регистратор.ПереносДней Цикл
															Если стр.Сотрудник = стрСотрудник и стр.ДатаС = НачалоДня(стрГрафик.Дата) Тогда
																МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стр.ДатаНаКакую,стрСотрудник));
																Если МассивОбщиеГрафики.Количество()>0 Тогда 
																	ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
																КонецЕсли;                
																МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стрГрафик.Дата)));
																Если МассивТЗДниКомандировок.Количество()=0 Тогда 
																	СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																	СтрТЗДниКомандировок.ДатаС = НачалоДня(стрГрафик.Дата);
																	СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																	СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																	СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
																КонецЕсли;
																//ПСА 09.02.2021 СВФР-007152 +++	
															ИначеЕсли стр.Сотрудник = стрСотрудник Тогда
																МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стр.ДатаС,стрСотрудник));
																Если МассивОбщиеГрафики.Количество() = 0 Тогда
																	МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стр.ДатаС)));
																	Если МассивТЗДниКомандировок.Количество()=0 Тогда
																		СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																		СтрТЗДниКомандировок.ДатаС = НачалоДня(стр.ДатаС);
																		СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																		СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																		СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
																	КонецЕсли;
																КонецЕсли;
																//+++ПСА 09.02.2021 СВФР-007152	
															КонецЕсли;
															
														КонецЦикла;
														
													КонецЦикла; 
												КонецЕсли;
												Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
													ЭтоОтпуск = Истина;
												иначе
													ЭтоОтпуск = Ложь;
												КонецЕсли;
												
												ЗначЕстьВИнтервале = Истина;
												
												
												//Прервать; //брать последнее всегда значение, которое входит. БЛ бует всегда после отпуска
											иначе
												Если ((Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка)) ИЛИ ЕстьПредыдБЛ ИЛИ ЕстьПродлениеВОтзыве Тогда //Аверсон 06.04.2020 КВВ СВФР-005776 (ЕстьПредыдБЛ)  //Аверсон 14.04.2020 КВВ СВФР-005809 (ЕстьПродлениеВОтзыве)
													Продолжить;
												КонецЕсли;
												
												Если не ЗначЕстьВИнтервале Тогда 
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													//	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
													//Аверсон 21.08.2020 КВВ СВФР-006439 (
													Если (НЕ ЕстьСокращенныеДниВМесяце 
														ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
														ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
													Иначе
														СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
														ЗначениеЧасов = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);   
														//Аверсон 04.06.2021 КВВ СВФР-007642 (
														ВДатеСокращенноеВремя = ?(СокращЧасы=0,Ложь,Истина); 
														Если ВДатеСокращенноеВремя Тогда
															Пока РезультатЗапроса1.Следующий() Цикл
																Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
																	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
																	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
																	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
																КонецЕсли;
															КонецЦикла;
														КонецЕсли;
														//Аверсон 04.06.2021 КВВ СВФР-007642 )
													КонецЕсли;
													//Аверсон 21.08.2020 КВВ СВФР-006439 ) 
												КонецЕсли;
												
											КонецЕсли;
											
										КонецЕсли;
									КонецЦикла;
									
									Если БукваВидаВремени="" Тогда 
										Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) Тогда 
											Продолжить;
										КонецЕсли;
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
									КонецЕсли;
									
									//Аверсон 10.10.2019 КВВ СВФР-004896 (
									Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень Тогда
										ЗапросСвДн = Новый Запрос;
										ЗапросСвДн.Текст = 
										"ВЫБРАТЬ
										|ДокСвобДня.Сотрудник,
										|ДокСвобДня.НеоплачиваемыйДень КАК НеоплачиваемыйДень //Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2)
										|ИЗ Документ.ПредоставлениеСвободногоОтРаботыДня.РаботникиОрганизации КАК ДокСвобДня
										|ГДЕ ДокСвобДня.Сотрудник = &Сотрудник
										|И ДокСвобДня.Дата = &ДатаПроверки
										//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) (
										|И (ДокСвобДня.НеоплачиваемыйДень = ИСТИНА
										|ИЛИ
										//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) )
										|(ДокСвобДня.ПериодПредоставленияСвобДня = ЗНАЧЕНИЕ(Перечисление.ПериодПредоставленияСвободногоДня.ДеньВМесяц) //Аверсон 30.10.2019 КВВ СВФР-004896
										|И ДокСвобДня.СоставСемьи = ЗНАЧЕНИЕ(Перечисление.СоставСемьиДляСвободногоДня.РебенокИнвалид)))";
										ЗапросСвДн.УстановитьПараметр("ДатаПроверки", стрГрафик.Дата);
										ЗапросСвДн.УстановитьПараметр("Сотрудник", стрСотрудник);      
										
										РезультатСвДн = ЗапросСвДн.Выполнить().Выгрузить();
										Если РезультатСвДн.Количество() > 0 Тогда	
											//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) (
											Если РезультатСвДн[0].НеоплачиваемыйДень = ИСТИНА Тогда
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДеньМатери;
											Иначе 
												//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) )
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 10.10.2019 КВВ СВФР-004896 )
									
									//Аверсон 18.01.2021 КВВ СВФР-007084 (
									СчитатьДальше = Истина; Сменный = Ложь; 
									Если (Организация.ИНН = "700067572" 
										ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
										ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
										ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
										И
										стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
										//	стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
										стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени И
										ОбщиеГрафики.Количество()>0 И
										НЕ ВДатеСокращенноеВремя И //Аверсон 04.06.2021 КВВ СВФР-007642
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа	Тогда 
										Сменный = Истина;
										МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрГрафик.Дата,стрСотрудник));
										Если МассивОбщиеГрафики.Количество()>0 Тогда 
											ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
											Если ЗначениеЧасов = 0 Тогда
												СчитатьДальше = Ложь;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;  
									
									//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) ( 
									НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
									БудетЯвкаПоПереносу = Ложь;
									Если СчитатьДальше И НайденныеСтрокиПереноса.Количество() > 0 Тогда
										НаКакойДеньПереносим = НайденныеСтрокиПереноса[0].ВыходнойДень;
										КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
										Если НачалоМесяца(НаКакойДеньПереносим) = НачалоМесяца(ДатаПр) И НаКакойДеньПереносим >= ДатаПр И НаКакойДеньПереносим = стрГрафик.Дата 
											И НачалоМесяца(КакойДеньПереносим) <> НачалоМесяца(НаКакойДеньПереносим) Тогда
											РезЗ_Перенос = ПроверкаДняНаКоторыйПереносим(стрСотрудник,НачалоДня(КакойДеньПереносим));
											Если РезЗ_Перенос.Количество() > 0 Тогда
												СчитатьДальше = Ложь;
											Иначе
												БудетЯвкаПоПереносу = Истина;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) )									
									
									Если СчитатьДальше Тогда
										//Аверсон 18.01.2021 КВВ СВФР-007084 )	
										
										//ПСА 02.02.2021 СВФР-007136 +++
										ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
										СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, ЗначениеЧасов );
										БукваЧасы = ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки  );
										БукваВидаВремени = БукваЧасы.Буква;
										ЗначениеЧасов = БукваЧасы.Часы;
										//+++ПСА 02.02.2021 СВФР-007136
										
										//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) (
										Если БудетЯвкаПоПереносу = Истина И НЕ ЗначениеЗаполнено(БукваВидаВремени) Тогда
											Если (НЕ ЕстьСокращенныеДниВМесяце 
												ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
												ЗначениеЧасов_ = стрГрафик.ОсновноеЗначение;
											Иначе
												СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); 
												ЗначениеЧасов_ = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);    
											КонецЕсли;
											Если ЗначениеЧасов_ <> 0 Тогда
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												ЗначениеЧасов = ЗначениеЧасов_;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) )
										
										//Аверсон 30.06.2021 КВВ СВФР-007774 (
										Если ТЗ_Неявки <> Неопределено И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности Тогда    
											Для Каждого СтрСС Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник )) Цикл
												Если (СтрСС.ДатаНачала <= стрГрафик.Дата И стрГрафик.Дата <= СтрСС.ДатаОкончания) 
													И СтрСС.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь
													И СтрСС.ДокБЛ = 1 Тогда
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
										//Аверсон 30.06.2021 КВВ СВФР-007774 )
										
										//Аверсон 25.06.2021 КВВ СВФР-007774 (
										Если (НЕ ЕстьСокращенныеДниВМесяце 
											ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) //СВЭЙ 29.09.2023 КВВ СВФР-011538
											И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
											И ТЗ_Неявки <> Неопределено Тогда    
											
											Для каждого СтрСС Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник )) Цикл
												Если (СтрСС.ДатаНачала <= стрГрафик.Дата И стрГрафик.Дата <= СтрСС.ДатаОкончания) 
													И СтрСС.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
													И СтрСС.ДокКомандировка = 1 Тогда
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
													
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
										//Аверсон 25.06.2021 КВВ СВФР-007774 )
										
										
										//Аверсон 04.06.2021 КВВ СВФР-007642 (
										Если ЕстьСокращенныеДниВМесяце 
											И ЕстьСокращенныеДниВДате Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
											СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата);
											Если СокращЧасы <> 0 Тогда 
												ЗначениеЧасов = СокращЧасы;
												Пока РезультатЗапроса1.Следующий() Цикл
													Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 04.06.2021 КВВ СВФР-007642 )
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										
										//Аверсон 16.12.2022 КВВ СВФР-010038 (пункт 2) (
										Если Организация.ИНН = "100194961" 
											И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
											И ЧасовСверхрУрПоПриказу <> 0 
											И стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
											ЗначениеЧасов = ЗначениеЧасов + ЧасовСверхрУрПоПриказу;
										КонецЕсли;
										//Аверсон 16.12.2022 КВВ СВФР-010038 (пункт 2) )
										
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
										
										//Аверсон 18.01.2021 КВВ СВФР-007084 ( 
										Если ЧасовСверхрУрПоПриказу <> 0 и стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам Тогда //ПСА 25.02.2021 СВФР-007248+++
											ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											
											//Аверсон 03.06.2021 КВВ СВФР-007334 (
											Если РаботаВМЕСТОСверхурочныеКакЯвка Тогда
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											Иначе
												//Аверсон 03.06.2021 КВВ СВФР-007334 )
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;     
											КонецЕсли;
											
											//Аверсон ЕАЕ 01.04.2021 СВФР-007413
											Если РаботаСверхурочныеВКомандировкеКакЯвка Тогда
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;	
											КонецЕсли;
											//Аверсон СВФР-007413
											
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
											//ПСА 05.03.2021 СВФР-007298+++  
											Если РаботаСверхурочныеКакЯвка Тогда
												Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
													НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
													НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
													НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												Иначе
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
												КонецЕсли;	
											КонецЕсли;	
											//+++ПСА 05.03.2021 СВФР-007298
											//ПСА 11.03.2021 СВФР-007321+++  
											Если РаботаСверхурочныеКакКомандировка Тогда
												Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
													НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
													НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
													НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
												Иначе
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
												КонецЕсли;	
											КонецЕсли;	
											//+++ПСА 11.03.2021 СВФР-007321
										КонецЕсли;
										//Аверсон 18.01.2021 КВВ СВФР-007084 )
										
										//Аверсон 18.01.2021 КВВ СВФР-007084 (
										Если Сменный Тогда    
											Пока РезультатЗапроса1.Следующий() Цикл
												Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
												КонецЕсли;
											КонецЦикла;
											
											Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
											Если Ночч.Количество() > 0 Тогда
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 18.01.2021 КВВ СВФР-007084 )
									КонецЕсли;
								КонецЕсли;
								
								Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) Тогда 
									Продолжить;
								КонецЕсли;
								
								
								ЗапросПереносКоманд = Новый Запрос;
								ЗапросПереносКоманд.Текст = 
								"ВЫБРАТЬ
								|	ПереносДнейКомандировок.Сотрудник
								|ИЗ
								|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
								|ГДЕ
								|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
								|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
								
								ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", стрГрафик.Дата);
								ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", стрСотрудник);
								
								РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
								
								Пока РезультатПереносКоманд.Следующий() Цикл
									ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
									
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0; 
								КонецЦикла;
								
								//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) (
								Если стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам И ИндексМассиваПриставок < 2 Тогда
									Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата); 
									Если Ночч.Количество() > 0 Тогда   
										НазваниеЯчейкиВБазе0 = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										НазваниеЯчейкиВБазе1 = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										
										//СВЭЙ 24.06.2024 КВВ СВФР-013142 (
										ДальшеПоВидуВремени = Истина;
										
										Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0]) Тогда 
											ВВР1 = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0];
											НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(ВВР1);
											Если НайдЭл <> Неопределено Тогда
												ДальшеПоВидуВремени = Ложь;	
											КонецЕсли; 
											
											Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1]) Тогда 
												ВВР2 = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1];
												НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(ВВР2);
												Если НайдЭл <> Неопределено Тогда
													ДальшеПоВидуВремени = Ложь;	
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;		
										
										Если ДальшеПоВидуВремени Тогда     
											//СВЭЙ 24.06.2024 КВВ СВФР-013142 )
											
											Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] <> Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы
												И СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1] <> Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы
												Тогда    
												Если ИндексМассиваПриставок = 0 
													И СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() Тогда
												Иначе
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												КонецЕсли;
												
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли; 
								КонецЕсли; 
								//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) )
								
								ИндексМассиваПриставок = 0; //Аверсон 07.10.2020 КВВ СВФР-006669
								
							КонецЦикла; 
							
							
							Для Каждого стрКоманд из ТЗДниКомандировок Цикл 
								Если НачалоМесяца(стрКоманд.ДатаНаКакую) = ПериодРегистрации Тогда 
									Если ЗначениеЗаполнено(стрКоманд.ДатаНаКакую) Тогда 
										ИндексЯчейкиВТаблице = День(стрКоманд.ДатаНаКакую);
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;   
									КонецЕсли; 
								КонецЕсли;
								Если НачалоМесяца(стрКоманд.ДатаС) = ПериодРегистрации Тогда
									ИндексЯчейкиВТаблице = День(стрКоманд.ДатаС);
									ПоискРаботыВПраздник = Ложь;
									Если стрКоманд.Доплачивать Тогда 
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
										ПоискРаботыВПраздник = Истина;
									КонецЕсли;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
									//ПСА 27.04.2021 СВФР-007513 +++
									ЕстьРаботаВПраздник = Ложь;
									Если ПоискРаботыВПраздник Тогда
										Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
											Если Стр.ДокПраздничный = 1 и НачалоДня(Стр.ДатаНачала) = стрКоманд.ДатаС Тогда 
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
												ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
												РезультатСост = ЗЗ.Выполнить().Выбрать();
												Пока РезультатСост.Следующий() Цикл
													//ПСА 27.04.2021 СВФР-007513 +++
													//Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
													Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
														ЕстьРаботаВПраздник = Истина;
														//+++ПСА 27.04.2021 СВФР-007513	
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
													КонецЕсли;
												КонецЦикла;	
											КонецЕсли;
										КонецЦикла;
										//ПСА 27.04.2021 СВФР-007513 +++
										Если Не ЕстьРаботаВПраздник И НЕ Организация.ИНН = "700067572" Тогда //Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 3) (внесено унп Бобруйска)
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
										КонецЕсли;	
										//+++ПСА 27.04.2021 СВФР-007513
									КонецЕсли;
								КонецЕсли;						
								
								
							КонецЦикла;
							//ПСА 16.02.2021 СВФР-007197 +++
							//Аверсон 25.02.2020 КВВ СВФР-005565 (
							Если ТЗ_Неявки <> Неопределено Тогда
								ТекДень = Дата(1,1,1,0,0,0);
								//Аверсон 26.05.2021 КВВ СВФР-007334 (
								ТЗНеявокПоСотр = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)); 
								//Если Организация.ИНН = "700067572" Тогда  //СВЭЙ 30.07.2024 КВВ СВФР-013315 (закомментировано)
									ТЗНеявокПоСотр1 = ТЗНеявокПоСотр;
									Если ТЗНеявокПоСотр1.Количество() > 1 Тогда
										ВсегоКолвоТЗНеявокПоСотр = ТЗНеявокПоСотр1.Количество();
										Счч = 0;
										Для Каждого СтрТЗНеявокПоСотр ИЗ ТЗНеявокПоСотр1 Цикл
											Счч = Счч + 1;
											Если Счч <> ВсегоКолвоТЗНеявокПоСотр Тогда
												
												//Аверсон ЕАЕ 24.04.2025 СВФР-015227
												//Если ТЗНеявокПоСотр[Счч].ДатаНачала > СтрТЗНеявокПоСотр.ДатаНачала И
												Если НачалоДня(ТЗНеявокПоСотр[Счч].ДатаНачала) > СтрТЗНеявокПоСотр.ДатаНачала И
												//Аверсон СВФР-015227
												
													НачалоДня(ТЗНеявокПоСотр[Счч].ДатаНачала) < НачалоДня(СтрТЗНеявокПоСотр.ДатаОкончания) Тогда
													Если НЕ (СтрТЗНеявокПоСотр.ДокБЛ = 1 И ТЗНеявокПоСотр[Счч].ДокОтзыв = 1 И ТЗНеявокПоСотр[Счч].ДокОтпуска = 1)   //Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10)
														И ТЗНеявокПоСотр[Счч].ДокПраздничный = 0 //Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2)
														И СтрТЗНеявокПоСотр.ДокОтзывПеренос = 0 Тогда //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
														
														//Аверсон ЕАЕ 24.04.2025 СВФР-015227
														//СтрТЗНеявокПоСотр.ДатаОкончания = ТЗНеявокПоСотр[Счч].ДатаНачала-1;
														СтрТЗНеявокПоСотр.ДатаОкончания = НачалоДня(ТЗНеявокПоСотр[Счч].ДатаНачала) - 1;
														//Аверсон СВФР-015227
														
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								//КонецЕсли;
								
								Для Каждого Стр Из ТЗНеявокПоСотр Цикл
									//Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
									//Аверсон 26.05.2021 КВВ СВФР-007334 )
									
									Если Стр.ДатаНачала <= Стр.ДатаОкончания Тогда
										
										//Аверсон 02.10.2020 КВВ СВФР-006634 (
										ДатаВИндГрафике = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,Стр.ДатаНачала));
										Если (Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
											ИЛИ Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) //Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2)
											И ДатаВИндГрафике.Количество() = 0 
											И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
											
											//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) (
											Продолжать = Истина;
											ТЗНеявокПоСотрПроверка = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник,БукваВидаВремени,ДокОтпуска,ДокОтзыв,ДокОтзывПеренос", стрСотрудник,Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск,1,1,1));
											Если ТЗНеявокПоСотрПроверка.Количество() > 0 Тогда
												Для Каждого СтрТЗНеявокПоСотрПроверка ИЗ ТЗНеявокПоСотрПроверка Цикл
													Если НачалоДня(Стр.ДатаНачала) >= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаНачала) И НачалоДня(Стр.ДатаНачала) <= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаОкончания) Тогда
														СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Стр.БукваВидаВремени;
														
														//Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2) (
														Если Стр.ДокПраздничный = 1 и Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
															ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
															РезультатСост = ЗЗ.Выполнить().Выбрать();
															Пока РезультатСост.Следующий() Цикл
																Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																	ОтборД = Новый Структура();
																	ОтборД.Вставить("Сотрудник", стрСотрудник);
																	ОтборД.Вставить("ДатаВыхода", ТекДень);
																	
																	НайденноеЗначение_ = РезультатСост.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																	
																	Если НайденноеЗначение_.Количество() > 0 Тогда
																		Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																			ЗнЧ = ЭлМасс.ОтработаноЧасов;
																			Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + День(Стр.ДатаНачала)] = ЗнЧ;
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + День(Стр.ДатаНачала)] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + День(Стр.ДатаНачала)] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																			КонецЕсли;
																		КонецЦикла;
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
														КонецЕсли;
														//Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2) )
														
														Если НЕ ЗначениеЗаполнено(ТекДень) Тогда 
															ТекДень = НачалоДня(Стр.ДатаНачала);
														КонецЕсли;
														
														ТекДень = ТекДень + 24*60*60; 
														Продолжать = Ложь;
														
														Продолжить;
													КонецЕсли;
												КонецЦикла;								
											КонецЕсли;
											
											Если Продолжать Тогда
												//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) )
												
												СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
												Продолжить;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 02.10.2020 КВВ СВФР-006634 )
										
										//Аверсон 18.03.2021 КВВ СВФР-007187 (
										ДатаОкончанияПериода_Проверка = ДатаОкончанияПериода;
										Если КонецДня(ДатаУв) <> КонецМесяца(ДатаУв) Тогда 
											ДатаОкончанияПериода_Проверка = НачалоДня(ДатаУв-1);  
										КонецЕсли;
										//Аверсон 18.03.2021 КВВ СВФР-007187 )
										
										БукваНеявки = Стр.БукваВидаВремени;
										ТекДень = Стр.ДатаНачала;
										КонечныйДень = Стр.ДатаОкончания;
										Пока ТекДень<= КонечныйДень Цикл
											//Аверсон 14.08.2020 КВВ СВФР-006426 (
											//Аверсон 18.03.2021 КВВ СВФР-007187 (
											//Если ТекДень > ДатаОкончанияПериода Тогда
											Если ТекДень > ДатаОкончанияПериода_Проверка Тогда 
												//Аверсон 18.03.2021 КВВ СВФР-007187 )
												Прервать;
											КонецЕсли;
											//Аверсон 14.08.2020 КВВ СВФР-006426 )
											Если МассивПраздников.Найти(ТекДень) <> Неопределено И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) = 0 Тогда
												//Аверсон 08.06.2021 КВВ СВФР-007627 (
												Если (Организация.ИНН = "700067572" 
													ИЛИ Организация.ИНН = "192240370") //СВЭЙ 30.06.2024 КВВ СВФР-013212
													И НЕ ПодразделениеТранспортногоЦеха() 
													И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Командировка")) <> 0 Тогда
												Иначе
													//Аверсон 08.06.2021 КВВ СВФР-007627 )
													//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 3(     
													ИндексЯчейкиНеявки = День(ТекДень);
													Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
														
														//Аверсон 16.02.2023 КВВ СВФР-010274 (
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком
														//Аверсон 16.02.2023 КВВ СВФР-010274 )
														
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
														ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
														//Аверсон 07.01.2023 КВВ СВФР-010108 (
														Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
															ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
															И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
														Иначе
															//Аверсон 07.01.2023 КВВ СВФР-010108 )
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
															СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
														КонецЕсли;
													Иначе
														//Аверсон 23.07.2021 КВВ СВФР-007876 )
														//Аверсон 22.07.2021 КВВ СВФР-007876 пункт 1(
														Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
															ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
															РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
															Пока РезРабВПраздИВых.Следующий() Цикл
																Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																	ОтборД = Новый Структура();
																	ОтборД.Вставить("Сотрудник", стрСотрудник);
																	ОтборД.Вставить("ДатаВыхода", ТекДень);
																	
																	НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																	
																	Если НайденноеЗначение_.Количество() > 0 Тогда
																		Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																			ЗнЧ = ЭлМасс.ОтработаноЧасов;
																			Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																				
																				//СВЭЙ 15.04.2024 КВВ СВФР-012843 (
																				//СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = ?(БукваНеявки=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка,БукваНеявки,Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
																				//СВЭЙ 15.04.2024 КВВ СВФР-012843 )
																				
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																					СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																					СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																					//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																					СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																					СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																				Иначе
																					Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																						СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																						СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																					КонецЕсли;
																					//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																				КонецЕсли;
																			ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																			ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																				//Аверсон 13.01.2022 КВВ СВФР-008598 (
																				СостРаб = Новый СписокЗначений;
																				СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
																				ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
																				РезультатСост = ЗЗ.Выполнить().Выбрать();      
																				ЕстьКомандировкаПоЗапросу = Ложь; 
																				Пока РезультатСост.Следующий() Цикл
																					ЕстьКомандировкаВТЧПереносДнейСДоплачивать = Ложь;
																					Для Каждого стрДок ИЗ РезультатСост.Регистратор.ПереносДней Цикл
																						Если стрДок.Сотрудник <> стрСотрудник Тогда
																							Продолжить;
																						КонецЕсли;
																						Если НачалоДня(стрДок.ДатаС) <> НачалоДня(ТекДень) Тогда
																							Продолжить;
																						КонецЕсли;
																						Если НЕ стрДок.Доплачивать Тогда
																							Продолжить;
																						КонецЕсли;
																						ЕстьКомандировкаВТЧПереносДнейСДоплачивать = Истина;
																					КонецЦикла;
																					ЕстьКомандировкаПоЗапросу = ?(ЕстьКомандировкаВТЧПереносДнейСДоплачивать, Ложь, Истина);
																					Если ЕстьКомандировкаПоЗапросу Тогда	
																						СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
																						СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																					КонецЕсли;
																				КонецЦикла;				
																				//Аверсон 13.01.2022 КВВ СВФР-008598 ) 
																				СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ПервыйВидВремени","ВторойВидВремени") + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																				СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ПервыйЧасов","ВторойЧасов") + ИндексЯчейкиНеявки] = ЗнЧ; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ВторойВидВремени","ТретийВидВремени") + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																					СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ВторойЧасов","ТретийЧасов") + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу) 
																				КонецЕсли;
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																				
																			КонецЕсли;
																		КонецЦикла;
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
														КонецЕсли;
													КонецЕсли;
													//Аверсон 22.07.2021 КВВ СВФР-007876 )
													
													ТекДень = ТекДень + 24*60*60; 	
													Продолжить;	
												КонецЕсли;
											КонецЕсли; 
											ИндексЯчейкиНеявки = День(ТекДень);
											ВидВремениЗаполнен = Ложь;
											Для Каждого ТекПриставка Из МассивПриставок Цикл 
												НазваниеЯчейкиВидаВремениНеявки = ТекПриставка + "ВидВремени" + ИндексЯчейкиНеявки;
												ВидВремениЗаполнен = ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки]);
												Если ВидВремениЗаполнен Тогда
													//Аверсон 21.04.2020 КВВ СВФР-005904 (
													Если ТекПриставка = "Первый" и СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]) Тогда
															//Аверсон 28.01.2021 КВВ СВФР-007084 (
															Если Организация.ИНН = "700067572" И 
																(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
																или СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда  //ПСА 08.02.2021 СВФР-007152+++
															Иначе
																//Аверсон 28.01.2021 КВВ СВФР-007084 )
																СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
																СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
															КонецЕсли;
														КонецЕсли;	
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]) Тогда
															СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
															СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
														КонецЕсли;
														
														//СВЭЙ 08.12.2023 КВВ СВФР-011914 (
													ИначеЕсли ТЗ_Переносы.Количество() > 0 
														И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0
														И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] 
														И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]
														И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] 
														И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] Тогда
														ВидВремениЗаполнен = Ложь;
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
														//СВЭЙ 08.12.2023 КВВ СВФР-011914 )
														
														//Аверсон 03.06.2021 КВВ СВФР-007334 (
													Иначе
														Если Организация.ИНН = "700067572" И
															ТекПриставка = "Первый" И
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
															И НЕ (ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]))
															И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
															СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
															СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = КолВоЧасовПраздниковПоСотр(стрСотрудник,ТекДень);
														КонецЕсли;
														//Аверсон 03.06.2021 КВВ СВФР-007334 )
													КонецЕсли;
													//Аверсон 21.04.2020 КВВ СВФР-005904 )
													Прервать;	
												КонецЕсли; 
											КонецЦикла;
											Если НЕ ВидВремениЗаполнен И
												(ТекДень >= НачалоМесяца(Стр.ДатаНачала) И ТекДень <= КонецМесяца(Стр.ДатаНачала)) Тогда  //Аверсон 16.04.2020 КВВ СВФР-005876
												//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) (
												Продолжать = Истина;
												Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
													//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) (
													//Если ПодразделениеОрганизации <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации Тогда	
													//	Продолжать = Ложь;
													//КонецЕсли;
													ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
													Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
														Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
															Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
																Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																	Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																		Продолжать = Ложь;
																	КонецЕсли;	
																Иначе
																	//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																	Продолжать = Ложь;
																КонецЕсли;
															КонецЕсли;
														Иначе
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
													//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) )
												КонецЕсли;
												
												//Аверсон 02.12.2021 КВВ СВФР-008409 (пункт 3) (
												Если //Организация.ИНН = "700067572" И
													Продолжать 
													И НЕ ВидВремениЗаполнен 
													И 
													(
													Найти(ВРЕГ(БукваНеявки),ВРЕГ("Прогул")) <> 0 
													
													//Аверсон 07.01.2023 КВВ СВФР-010108 (
													ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Оплата по среднему заработку")) <> 0 
													ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Ремонт")) <> 0
													//Аверсон 07.01.2023 КВВ СВФР-010108 )
													
													)
													И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 ) Тогда
													Продолжать = Ложь;
												КонецЕсли;
												//Аверсон 02.12.2021 КВВ СВФР-008409 (пункт 3) )
												
												//Аверсон 01.03.2022 КВВ СВФР-008748 (
												Если (Организация.ИНН = "100010315"
													ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628")
													И Продолжать
													И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
													ДатаВИндГрафике_ТекДень = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,ТекДень));
													Если ДатаВИндГрафике_ТекДень.Количество() = 0 Тогда
														НайденПереносКомандировки = Ложь;
														НайденРаботаВВых = Ложь;
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень); 
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																НайденРаботаВВых = Истина;
																Прервать;
															КонецЕсли;
														КонецЦикла;
														
														Если НЕ НайденРаботаВВых Тогда
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
															ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень); 
															РезультатСост = ЗЗ.Выполнить().Выбрать();
															Пока РезультатСост.Следующий() Цикл
																Отб = Новый Структура;
																Отб.Вставить("Сотрудник", стрСотрудник);
																НЗ = РезультатСост.Регистратор.ПереносДней.НайтиСтроки(Отб);
																Если НЗ.Количество() > 0 Тогда
																	Для Каждого СтрНЗ Из НЗ Цикл
																		Если СтрНЗ.ДатаС = ТекДень Тогда
																			НайденПереносКомандировки = Истина;
																			Прервать;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
																Если НайденПереносКомандировки Тогда
																	Прервать;
																КонецЕсли;
															КонецЦикла;
															Если НЕ НайденПереносКомандировки Тогда
																Продолжать = Ложь;
															КонецЕсли;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 01.03.2022 КВВ СВФР-008748 )
												
												//Аверсон 12.01.2023 КВВ СВФР-010030 (
												Если Продолжать 
													И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Медкомиссия")) <> 0 
													И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
													ОтборНовПоСотрНеявок = Новый Структура;
													ОтборНовПоСотрНеявок.Вставить("Сотрудник", стрСотрудник);
													ОтборНовПоСотрНеявок.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
													СтрокиНовПоСотрНеявок = ТЗ_Неявки.НайтиСтроки(ОтборНовПоСотрНеявок);
													ЕстьБЛВТекДень = Ложь;
													Для Каждого СтрНовПоСотрНеявок Из СтрокиНовПоСотрНеявок Цикл
														Если НачалоДня(ТекДень) >= НачалоДня(СтрНовПоСотрНеявок.ДатаНачала)
															И НачалоДня(ТекДень) <= НачалоДня(СтрНовПоСотрНеявок.ДатаОкончания) Тогда
															ЕстьБЛВТекДень = Истина;
														КонецЕсли;
													КонецЦикла;
													Если ЕстьБЛВТекДень Тогда
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 12.01.2023 КВВ СВФР-010030 )
												
												//Аверсон 02.08.2023 КВВ СВФР-011200 (
												Если Продолжать
													И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0
													ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Явка")) <> 0)
													И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Работает);
													ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник,ТекДень); 
													РезРабота = ЗЗ.Выполнить().Выбрать();
													Пока РезРабота.Следующий() Цикл
														Если ТипЗнч(РезРабота.Регистратор) = Тип("ДокументСсылка.ОтзывИзОтпуска") Тогда
															Продолжать = Ложь;
														КонецЕсли;
													КонецЦикла;
												КонецЕсли;
												//Аверсон 02.08.2023 КВВ СВФР-011200 )
												
												Если Продолжать Тогда
													//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) )
													НазваниеЯчейкиВидаВремениНеявки = "ПервыйВидВремени" + ИндексЯчейкиНеявки;
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = БукваНеявки;
													//ПСА 12.02.2021 СВФР-007197+++
													Если Стр.ДокПраздничный = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														ЗначениеЧасов = 0;
														ЧасовНочныхПоПриказуВПраздник = 0;
														РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
														
														//Аверсон ЕАЕ 04.08.2025 СВФР-016362
														//Бобруйскводоканал
														ЧасовЯвкаВПраздник = 0;
														//Аверсон СВФР-016362
														
														Если Стр.ДокПраздничный = 1 Тогда 
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
															ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
															РезультатСост = ЗЗ.Выполнить().Выбрать();
															
															//Аверсон ЕАЕ 05.08.2025 СВФР-016362
															//Бобруйскводоканал
															Если Организация.ИНН = "790041382" Тогда
																СтруктураПраздники = Новый Структура;
																СтруктураПраздники.Вставить("Праздники", 0);
																СтруктураПраздники.Вставить("Работа",    0);
																СтруктураПраздники.Вставить("Ночные",    0);
																//ПоискЯвкиВПраздники = Истина;
																Пока РезультатСост.Следующий() Цикл
																	Для Каждого стрДок Из РезультатСост.Регистратор.РаботникиОрганизации Цикл
																		Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																			Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И 
																				РезультатСост.Регистратор.НочныеЧасы Тогда
																				СтруктураПраздники.Ночные = СтруктураПраздники.Ночные + стрДок.ОтработаноНочныхЧасов;
																			КонецЕсли;
																			Если НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																				СтруктураПраздники.Работа = СтруктураПраздники.Работа + стрДок.ОтработаноЧасов;
																			Иначе
																				Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																					СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;	
																				ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																					СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;
																				ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда
																					СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;
																				КонецЕсли;
																			КонецЕсли;
																			Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																				РаботаВПраздникКакЯвка = Истина;
																				СтруктураПраздники.Работа = СтруктураПраздники.Работа + стрДок.ОтработаноЧасов;	
																			КонецЕсли;
																		КонецЕсли;
																	КонецЦикла;
																КонецЦикла;
																ЧасовНочныхПоПриказуВПраздник = СтруктураПраздники.Ночные;
																ЗначениеЧасов                 = СтруктураПраздники.Праздники;
																ЧасовЯвкаВПраздник            = СтруктураПраздники.Работа;
																РаботаВМЕСТОПраздникКакЯвка   = Ложь;
																РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;
															Иначе
															//Аверсон СВФР-016362
																
																Пока РезультатСост.Следующий() Цикл
																	//ПСА 08.02.2021 СВФР-007152+++
																	ПоискНочныхВПраздничныйДень = Ложь;
																	Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
																		ПоискНочныхВПраздничныйДень = Истина;
																	КонецЕсли;
																	//+++ПСА 08.02.2021 СВФР-007152
																	
																	//ПСА 26.02.2021 СВФР-007248+++
																	ПоискЯвкиВПразники = Ложь;
																	РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;	//Аверсон 22.06.2021 КВВ СВФР-007755
																	РаботаВМЕСТОПраздникКакЯвка = Ложь;  //Аверсон 05.07.2021 КВВ СВФР-007801 (пункт 2)
																	//Аверсон 09.04.2021 КВВ СВФР-007434 (
																	Если НЕ (Организация.ИНН = "700067572") Тогда
																		ПоискЯвкиВПразники = Истина;
																	Иначе
																		//Аверсон 09.04.2021 КВВ СВФР-007434 )
																		Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
																			И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,Стр.ДатаНачала) Тогда
																			ПоискЯвкиВПразники = Истина;
																		КонецЕсли;
																	КонецЕсли;
																	//+++ПСА 26.02.2021 СВФР-007248
																	
																	для Каждого стрДок из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																		Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																			Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																				ЗначениеЧасов = стрДок.ОтработаноЧасов;  
																			ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																				ЗначениеЧасов = стрДок.ОтработаноЧасов;
																			ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда 
																				ЗначениеЧасов = стрДок.ОтработаноЧасов;
																			КонецЕсли;
																			//ПСА 08.02.2021 СВФР-007152+++
																			Если ПоискНочныхВПраздничныйДень и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																				ЧасовНочныхПоПриказуВПраздник = стрДок.ОтработаноНочныхЧасов;
																			КонецЕсли;
																			//+++ПСА 08.02.2021 СВФР-007152
																			//ПСА 26.02.2021 СВФР-007248+++
																			Если ПоискЯвкиВПразники Тогда
																				Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																					РаботаВПраздникКакЯвка = Истина;
																					//Аверсон 22.06.2021 КВВ СВФР-007755 (
																				ИначеЕсли НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И НЕ Организация.ИНН = "700067572" Тогда
																					РаботаВПраздникКакЯвкаНЕДоплачивать = Истина;
																					//Аверсон 22.06.2021 КВВ СВФР-007755 )
																					//Аверсон 05.07.2021 КВВ СВФР-007801 ( (пункт 2)
																				ИначеЕсли НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И Организация.ИНН = "700067572" Тогда
																					РаботаВМЕСТОПраздникКакЯвка = Истина;
																					//Аверсон 05.07.2021 КВВ СВФР-007801 )
																				КонецЕсли;	
																				//Аверсон 02.02.2022 КВВ СВФР-008561 (пункт 8) (
																			ИНАЧЕ
																				Если НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И Организация.ИНН = "700067572" Тогда
																					РаботаВМЕСТОПраздникКакЯвка = Истина;
																				КонецЕсли;	
																				//Аверсон 02.02.2022 КВВ СВФР-008561 (пункт 8) )
																			КонецЕсли;
																			//+++ПСА 26.02.2021 СВФР-007248
																		КонецЕсли;
																	КонецЦикла;
																КонецЦикла;
															КонецЕсли;
														КонецЕсли;
														НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
														//ПСА 08.02.2021 СВФР-007152 +++
														Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
															Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
																ИндексМассиваПриставок = 2;	
															Иначе
																ИндексМассиваПриставок = 1;	
															КонецЕсли;	
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
															ЧасовНочныхПоПриказуВПраздник = 0;
														КонецЕсли;
														//+++ПСА 08.02.2021 СВФР-007152
														//ПСА 26.02.2021 СВФР-007248+++
														Если РаботаВПраздникКакЯвка Тогда
															Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
																ИндексМассиваПриставок = 2;	
															Иначе
																ИндексМассиваПриставок = 1;	
															КонецЕсли;	
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
															
															
															//Аверсон ЕАЕ 05.08.2025 СВФР-016362
															//Бобруйскводоканал
															Если Организация.ИНН = "790041382" Тогда
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовЯвкаВПраздник;
															Иначе
															//Аверсон СВФР-016362
															
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
															КонецЕсли;
															РаботаВПраздникКакЯвка = Ложь;
														КонецЕсли;	
														//+++ПСА 26.02.2021 СВФР-007248
														
														//Аверсон 05.07.2021 КВВ СВФР-007801 ( (пункт 2)
														Если РаботаВМЕСТОПраздникКакЯвка Тогда
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
															Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																
																//СВЭЙ 09.10.2023 КВВ СВФР-011595 (
															ИначеЕсли ИндексМассиваПриставок <> 0 И Организация.ИНН = "700067572" Тогда
																НазваниеЯчейкиВБазе0 = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
																Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
																	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																КонецЕсли;
																//СВЭЙ 09.10.2023 КВВ СВФР-011595 )
																
															КонецЕсли;
														КонецЕсли;
														//Аверсон 05.07.2021 КВВ СВФР-007801 )
														
														//Аверсон 22.06.2021 КВВ СВФР-007755 (
														Если РаботаВПраздникКакЯвкаНЕДоплачивать Тогда
															Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) 
																И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
																СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;
															КонецЕсли;	
														КонецЕсли;
														//Аверсон 22.06.2021 КВВ СВФР-007755 )
														
														//Аверсон ЕАЕ 05.08.2025 СВФР-016362
														//Бобруйскводоканал
														//Нет праздничных, есть явка
														Если Организация.ИНН = "790041382" Тогда
															Если ЗначениеЧасов = 0 И ЧасовЯвкаВПраздник <> 0 Тогда
																Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) 
																	И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
																	СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																	//РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;
																	СтрокаРасшифровкиПоДням[МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиНеявки)] = ЧасовЯвкаВПраздник;
																КонецЕсли;		
															КонецЕсли;
														КонецЕсли;
														//Аверсон СВФР-016362
														
														//ПСА 03.03.2021 СВФР-007291 +++	
													ИначеЕсли Стр.ДокКомандировка = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
														НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
														ВвелиКомандировкаВВыходной = Ложь;  ВвелиКомандировкаВВыходной2Вар = Ложь;
														//Аверсон 08.06.2021 КВВ СВФР-007627 (
														Если Организация.ИНН = "700067572" 
															И НЕ ПодразделениеТранспортногоЦеха() Тогда
															НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("РабочийДень", Стр.ДатаНачала));
															Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
																СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
																ВвелиКомандировкаВВыходной = Истина;
															КонецЕсли;
														КонецЕсли;
														//Аверсон 08.06.2021 КВВ СВФР-007627 )
														
														//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) (
														ОбнулятьСноваЧасы = Истина;
														ЗначениеЧасов_ = 0; 
														//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) )
														
														//Аверсон 06.07.2021 КВВ СВФР-007801 ( (пункт 3)
														Если Организация.ИНН = "700067572"
															И НЕ ВвелиКомандировкаВВыходной Тогда
															ЗЗЗ = Новый Запрос;
															ЗЗЗ.Текст = "
															|ВЫБРАТЬ
															|СостояниеРаботниковОрганизаций.Регистратор ,
															|СостояниеРаботниковОрганизаций.Сотрудник,
															|СостояниеРаботниковОрганизаций.Период,
															|СостояниеРаботниковОрганизаций.ПериодЗавершения ,
															|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1) как кон
															|ПОМЕСТИТЬ ВтДок
															|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
															|ГДЕ
															|СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
															|И &Период МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1)
															|И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
															|;
															|
															|ВЫБРАТЬ 
															|ПД.Сотрудник,
															|ПД.Доплачивать,
															|ПД.ОтработаноЧасов,
															|ПД.ДатаС,
															|ПД.ДатаНаКакую
															|ИЗ Документ.КомандировкиОрганизаций.ПереносДней КАК ПД
															|ЛЕВОЕ СОЕДИНЕНИЕ ВтДок
															|ПО ПД.Ссылка = ВтДок.Регистратор
															|И ПД.Сотрудник = ВтДок.Сотрудник
															|ГДЕ ПД.Ссылка = ВтДок.Регистратор
															|И ПД.Сотрудник = ВтДок.Сотрудник
															|И ПД.ДатаС = &Период
															|И ПД.ОтработаноЧасов > 0 
															|И ПД.Доплачивать
															|И ПД.Ссылка.Проведен
															|И ПД.ДатаНаКакую = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
															ЗЗЗ.УстановитьПараметр("Период",ТекДень);
															ЗЗЗ.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
															ЗЗЗ.УстановитьПараметр("Состояние", СостРаб);
															РезЗЗЗ = ЗЗЗ.Выполнить().Выгрузить();
															Если РезЗЗЗ.Количество() > 0 Тогда
																СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
																СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = РезЗЗЗ[0].ОтработаноЧасов;
																ВвелиКомандировкаВВыходной = Истина;
																ВвелиКомандировкаВВыходной2Вар = Истина;
																ЗначениеЧасов = 0;
																ЗначениеЧасов_ = РезЗЗЗ[0].ОтработаноЧасов; //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6)
																ЕстьКомандировкаПоЗапросу = Истина;
															КонецЕсли;
															
														КонецЕсли;
														//Аверсон 06.07.2021 КВВ СВФР-007801 )
														Если НЕ ВвелиКомандировкаВВыходной2Вар Тогда
															ЕстьКомандировкаПоЗапросу = Ложь; //Аверсон 22.06.2021 КВВ СВФР-007627
															
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
															ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
															
															//СВЭЙ 08.01.2024 КВВ СВФР-012085 (
															//РезультатСост = ЗЗ.Выполнить().Выбрать();      
															//Пока РезультатСост.Следующий() Цикл
															РезультатСостТЗ = ЗЗ.Выполнить().Выгрузить();
															Если РезультатСостТЗ.Количество() = 0 И Организация.ИНН <> "700067572" Тогда
																ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень);	
																РезультатСостТЗ = ЗЗ.Выполнить().Выгрузить();
															КонецЕсли;	
															Для Каждого РезультатСост ИЗ РезультатСостТЗ Цикл
																//СВЭЙ 08.01.2024 КВВ СВФР-012085 )
																
																ЗначениеЧасов = 0; 
																ЕстьКомандировкаПоЗапросу = Истина; //Аверсон 22.06.2021 КВВ СВФР-007627
																Для Каждого стрДок из РезультатСост.Регистратор.ПереносДней Цикл
																	//Аверсон 28.04.2022 КВВ СВФР-008892 (пункт 2) (
																	//Если стрДок.Сотрудник = стрСотрудник и стрДок.ДатаС = НачалоДня(Стр.ДатаНачала) Тогда
																	Если стрДок.Сотрудник = стрСотрудник и стрДок.ДатаС = НачалоДня(ТекДень) Тогда
																		//Аверсон 28.04.2022 КВВ СВФР-008892 (пункт 2) )	
																		МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрДок.ДатаНаКакую,стрСотрудник));
																		Если МассивОбщиеГрафики.Количество()>0 Тогда 
																			ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
																		Иначе                
																			ЗначениеЧасов = стрДок.ОтработаноЧасов;
																		КонецЕсли;
																		//ПСА 09.02.2021 СВФР-007152 +++	
																	КонецЕсли;
																КонецЦикла;														
															КонецЦикла;
														КонецЕсли;
														//Аверсон 22.06.2021 КВВ СВФР-007627 (
														Если (НЕ Организация.ИНН = "700067572"
															ИЛИ (Организация.ИНН = "700067572" И ВвелиКомандировкаВВыходной2Вар)) 
															И ЗначениеЧасов = 0 
															И ЕстьКомандировкаПоЗапросу Тогда
															НадоДобавлятьРВ = Ложь;
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
															ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
															РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
															Пока РезРабВПраздИВых.Следующий() Цикл
																Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																	ОтборД = Новый Структура();
																	ОтборД.Вставить("Сотрудник", стрСотрудник);
																	ОтборД.Вставить("ДатаВыхода", ТекДень);
																	ОтборД.Вставить("ЯвкаВТабель", Истина);
																	
																	НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																	
																	Если НайденноеЗначение_.Количество() > 0 Тогда
																		Для Каждого ЭлМасс из НайденноеЗначение_ Цикл
																			ЗначениеЧасов = ЗначениеЧасов + ЭлМасс.ОтработаноЧасов;
																			Если ЭлМасс.Доплачивать Тогда 
																				НадоДобавлятьРВ = Истина;
																			КонецЕсли;
																		КонецЦикла;
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
															Если НадоДобавлятьРВ И ЗначениеЧасов <> 0 Тогда
																СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗначениеЧасов;
																//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) (
															ИначеЕсли ЗначениеЧасов = 0 И Организация.ИНН = "700067572" И ЗначениеЧасов_ <> 0 Тогда
																СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗначениеЧасов_;
																ОбнулятьСноваЧасы = Ложь;
																//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) )
															КонецЕсли;
														КонецЕсли;
														//Аверсон 22.06.2021 КВВ СВФР-007627 )
														Если ОбнулятьСноваЧасы Тогда //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6)
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
														КонецЕсли;
														//+++ПСА 03.03.2021 СВФР-007291	
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;	
											//+++ПСА 12.02.2021 СВФР-007197
											
											//ПСА 02.02.2021 СВФР-007136 +++
											Если ВидВремениЗаполнен Тогда
												Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
													И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
													СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
												КонецЕсли;										
											КонецЕсли;	
											//+++ПСА 02.02.2021 СВФР-007136
											
											//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
											Если Организация.ИНН = "700067572" Тогда     
												ИндексЯчейкиНеявки = День(ТекДень);
												//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) (
												Продолжать = ПроверкаНаПодразделениеВТекущийДень(ПодразделениеОрганизации,ТекДень,СтрСотрудник); 
												Если Продолжать Тогда
													//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) )
													Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
														ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
														
														//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ( (закомментировано, вынесено в отдельную функцию выше)
														////Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) (
														//Продолжать = Истина;
														//Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
														//	ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
														//	Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
														//		Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
														//			Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
														//				//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
														//				Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
														//					Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
														//						Продолжать = Ложь;
														//					КонецЕсли;	
														//				Иначе
														//					//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
														//					Продолжать = Ложь;
														//				КонецЕсли;
														//				
														//			КонецЕсли;
														//		Иначе
														//			Продолжать = Ложь;
														//		КонецЕсли;
														//	КонецЕсли;
														//КонецЕсли;
														//
														//Если Продолжать Тогда
														//	//Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) )
														//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ) (закомментировано, вынесено в отдельную функцию выше)
														ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
														
														//Аверсон 07.01.2023 КВВ СВФР-010108 (
														Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
															ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
															И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
														Иначе
															//Аверсон 07.01.2023 КВВ СВФР-010108 )
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
															СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
															ВидВремениЗаполнен = Истина;
														КонецЕсли;
													Иначе
														Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
															СостРаб = Новый СписокЗначений;
															СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
															ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
															РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
															Пока РезРабВПраздИВых.Следующий() Цикл
																Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																	ОтборД = Новый Структура();
																	ОтборД.Вставить("Сотрудник", стрСотрудник);
																	ОтборД.Вставить("ДатаВыхода", ТекДень);
																	
																	НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																	
																	Если НайденноеЗначение_.Количество() > 0 Тогда
																		Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																			ЗнЧ = ЭлМасс.ОтработаноЧасов;
																			Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																					СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																					СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																					СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																					СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																				Иначе
																					Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																						СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																						СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																					КонецЕсли;
																				КонецЕсли;
																				ВидВремениЗаполнен = Истина;
																			ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																				ВидВремениЗаполнен = Истина;
																			ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																				ВидВремениЗаполнен = Истина;
																			КонецЕсли;
																		КонецЦикла;
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
											
											//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 1)
											Если Организация.ИНН = "700067572"
												И НЕ ВидВремениЗаполнен 
												И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) <> 0 ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0)
												И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 )Тогда
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) (
												Продолжать = Истина;
												Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
													ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
													Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
														Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
															Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
																Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																	Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																		Продолжать = Ложь;
																	КонецЕсли;	
																Иначе
																	//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																	Продолжать = Ложь;
																КонецЕсли;
																
															КонецЕсли;
														Иначе
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
												Если Продолжать Тогда
													//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) )
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
												КонецЕсли;
											КонецЕсли;
											//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 1)
											
											//Аверсон 24.01.2022 КВВ СВФР-008495 (
											Если (Организация.ИНН = "100010315"
												ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
												И сзСотрудникиОИП.Количество() > 0 Тогда
												НайдЭлт = сзСотрудникиОИП.НайтиПоЗначению(СтрСотрудник);
												Если НЕ НайдЭлт = Неопределено Тогда
													Если СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
														И НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки]) 
														Тогда  
														ЗапросОИП = Новый Запрос;
														ЗапросОИП.Текст = "ВЫБРАТЬ
														|ОИП.ДатаНачала КАК ДатаНачала,
														|ОИП.Период КАК ДатаОкончания,
														|ОИП.Сотрудник КАК Сотрудник
														|ИЗ РегистрСведений.ОбучениеИПереподготовка КАК ОИП
														|ГДЕ ОИП.Сотрудник = &Сотрудник
														|И ОИП.НеОтражатьВТабеле = ИСТИНА
														|И &ТекДень МЕЖДУ ОИП.ДатаНачала И ОИП.Период";
														ЗапросОИП.УстановитьПараметр("Сотрудник",СтрСотрудник);
														ЗапросОИП.УстановитьПараметр("ТекДень",ТекДень);
														РезЗапросОИП = ЗапросОИП.Выполнить().Выгрузить();
														Если РезЗапросОИП.Количество() > 0 Тогда
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
														КонецЕсли;
													КонецЕсли;	
												КонецЕсли;
											КонецЕсли;
											//Аверсон 24.01.2022 КВВ СВФР-008495 )
											
											//Аверсон ЕАЕ 18.08.2025 СВФР-016459 
											//п.1
											Если Не ВидВремениЗаполнен И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
												И Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
												Если ТЗ_Переносы.Количество() > 0 И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0 Тогда
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
												КонецЕсли;
											КонецЕсли;
											//п.4
											Если ВидВремениЗаполнен И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
												И Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
												Если ТЗ_Переносы.Количество() > 0 И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0 Тогда
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + День(ТекДень)] = 0;	
												КонецЕсли;
											КонецЕсли;
											//Аверсон СВФР-016459
											
											ТекДень = ТекДень + 24*60*60; 	
										КонецЦикла;
									КонецЕсли; 	
								КонецЦикла; 		
							КонецЕсли; 
							//Аверсон 25.02.2020 КВВ СВФР-005565 )
							//+++ПСА 16.02.2021 СВФР-007197
							
						КонецЕсли;
					КонецЦикла;
					
				иначе    //есть индивид.графи
					ВыбранныйДень=Дата(1, 1, 1, 0, 0, 0);  //Аверсон 17.07.2019 КВВ СВФР-004479
					Для Каждого стрГрафик из мТаблицаИндГрафики Цикл
						//ПСА 11.03.2021 СВФР-007321+++
						Если стрГрафик.ВидУчетаВремени	= Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда
							Если ЗапретВыводаНочныхЧасов(стрСотрудник,стрГрафик.Дата) Тогда
								продолжить;
							КонецЕсли;	
						КонецЕсли;
						//+++ПСА 11.03.2021 СВФР-007321
						//ПСА 25.02.2021 СВФР-007248+++
						Если ВыбранныйДень = стрГрафик.Дата Тогда
							ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
						Иначе
							ИндексМассиваПриставок = 0;
						КонецЕсли;                 
						ВыбранныйДень = стрГрафик.Дата; 
						//+++ПСА 25.02.2021 СВФР-007248
						//ПСА 15.02.2021 +++
						Если ИндексМассиваПриставок > 2 Тогда
							ИндексМассиваПриставок = 0;
						КонецЕсли;	
						//+++ПСА 15.02.2021
						ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
						Если стрГрафик.Дата < ДатаПр Тогда 
							Продолжить;
						КонецЕсли;
						Если стрГрафик.Дата >= ДатаУв Тогда 
							Продолжить;
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
							//О.Т. Аверсон 29.06.2016 № 
							ЗапросПеремещениеВременное = Новый Запрос;
							ЗапросПеремещениеВременное.Текст = 
							"ВЫБРАТЬ
							|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
							|	РаботникиОрганизацийСрезПоследних.Сотрудник
							|ИЗ
							|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
							|ГДЕ
							|	РаботникиОрганизацийСрезПоследних.Период <= &Дата";
							
							ЗапросПеремещениеВременное.УстановитьПараметр("Дата", КонецДня(стрГрафик.Дата));
							ЗапросПеремещениеВременное.УстановитьПараметр("Сотрудник", стрСотрудник);
							
							РезультатПеремещениеВр = ЗапросПеремещениеВременное.Выполнить().Выгрузить();
							Для Каждого стр из РезультатПеремещениеВр Цикл 
								ПодразделениеИзРегистра = стр.ПодразделениеОрганизации;
							КонецЦикла;
							
							ЗапросПодразд = Новый Запрос;
							ЗапросПодразд.Текст = 
							"ВЫБРАТЬ
							|	ПодразделенияОрганизаций.Ссылка
							|ИЗ
							|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
							|ГДЕ
							|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Ссылка)";
							
							ЗапросПодразд.УстановитьПараметр("Ссылка", ПодразделениеОрганизации);
							
							ТЗПодразделения = ЗапросПодразд.Выполнить().Выгрузить();
							Если ТЗПодразделения.НайтиСтроки(Новый Структура("Ссылка",ПодразделениеИзРегистра)).Количество()=0 Тогда  
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
						
						//Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6) (
						ЕстьВхожденияВИнтервал = Ложь;
						Если МассивРезультатЗапроса.Количество() <> 0 Тогда
							Для Каждого стрНеявки_ из МассивРезультатЗапроса Цикл
								Если НачалоДня(стрГрафик.Дата) >= НачалоДня(стрНеявки_.ДатаНачала) И КонецДня(стрГрафик.Дата) <= КонецДня(стрНеявки_.ДатаОкончания) Тогда
									ЕстьВхожденияВИнтервал = Истина;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						//Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6) )
						
						Если МассивРезультатЗапроса.Количество()=0 или стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам   //ПСА 25.02.2021 СВФР-007248+++
							ИЛИ (МассивРезультатЗапроса.Количество() <> 0 И ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН <> "700067572" И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено) //Аверсон 17.04.2022 КВВ СВФР-008959
							ИЛИ (МассивРезультатЗапроса.Количество() <> 0 И ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН = "700067572") Тогда //Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6)
							НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							
							//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
							////Аверсон 17.07.2019 КВВ СВФР-004479 (
							//Если Организация.ИНН = "100010315" Тогда
							//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
							//Иначе
							//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
							//КонецЕсли;
							////Аверсон 17.07.2019 КВВ СВФР-004479 )
							//- СВЭЙ КДЯ 19.11.19 СВФР-004908
							
							//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
							
							//ПСА 28-12-2020 СВФР-006989+++
							//Аверсон 17.07.2019 КВВ СВФР-004479 (
							//Если Организация.ИНН = "100010315" Тогда
							//	БукваВидаВремени = ?( стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам,
							//	Справочники.КлассификаторИспользованияРабочегоВремени.Работа,
							//	Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы );
							//Иначе
							//	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
							//КонецЕсли;
							БукваВидаВремени = ?( стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам,
							Справочники.КлассификаторИспользованияРабочегоВремени.Работа,
							Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы );
							//+++ПСА 28-12-2020 СВФР-006989
							ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
							СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, стрГрафик.ОсновноеЗначение );
							ЭтоИндивидГрафик = ?(ТипЗнч(стрГрафик.Документ) = Тип("ДокументСсылка.ВводИндивидуальныхГрафиковРаботыОрганизации"),Истина,Ложь); //Аверсон 08.06.2023 КВВ СВФР-010920
							БукваЧасы = ПолучитьБуквуЧасы(ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки, ЭтоИндивидГрафик); //Аверсон 08.06.2023 КВВ СВФР-010920 (ЭтоИндивидГрафик)
							БукваВидаВремени = БукваЧасы.Буква;
							//Аверсон 29.10.2020 КВВ СВФР-006756 (
							Если НЕ ЕстьСокращенныеДниВМесяце Тогда
								ЗначениеЧасов = БукваЧасы.Часы;
							Иначе
								//ПСА 11.03.2021 СВФР-007321+++
								Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
									СокращЧасы = СокращенныеНочныеЧасыВДате(СтрСотрудник,стрГрафик.Дата);
								Иначе	
									СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(СтрСотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
								КонецЕсли;
								//+++ПСА 11.03.2021 СВФР-007321
								ЗначениеЧасов = ?(СокращЧасы=0,БукваЧасы.Часы,СокращЧасы);    
							КонецЕсли;
							//Аверсон 29.10.2020 КВВ СВФР-006756 )
							
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
							//Аверсон 17.07.2019 КВВ СВФР-004479 )
							//- СВЭЙ КДЯ 19.11.19 СВФР-004908
							
							НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							
							//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
							//СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
							//- СВЭЙ КДЯ 19.11.19 СВФР-004908
							//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
							//- СВЭЙ КДЯ 19.11.19 СВФР-004908
							
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 5) (
							Если (Организация.ИНН = "700067572" 
								ИЛИ ( //МассивРезультатЗапроса.Количество() <> 0 И  //Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 2) (закомментировано)
								ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН <> "700067572" И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено) //Аверсон 17.04.2022 КВВ СВФР-008959
								)
								И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
								И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено Тогда
								Если НЕ РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(стрГрафик.Дата,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата 
									И (ИндексМассиваПриставок = 0 ИЛИ ИндексМассиваПриставок = 1) Тогда //Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 7) (добавлено "ИЛИ ИндексМассиваПриставок = 1" ) 
									ИндексМассиваПриставок = ИндексМассиваПриставок +1;
									БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
								КонецЕсли;
							КонецЕсли;
							//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 5) )
							
							
							//дексМассиваПриставок = ИндексМассиваПриставок + 1;
							//ПСА 28-12-2020 СВФР-006989+++
							//Аверсон 17.07.2019 КВВ СВФР-004479 (  
							//Если Организация.ИНН = "100010315" Тогда
							//	ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
							//	Если ВыбранныйДень = стрГрафик.Дата Тогда
							//		ИндексМассиваПриставок = 1;
							//	Иначе
							//		Если ИндексМассиваПриставок = 2 Тогда
							//			ИндексМассиваПриставок = 0;
							//		КонецЕсли; 
							//	КонецЕсли;                 
							//	ВыбранныйДень = стрГрафик.Дата; 
							//КонецЕсли;
							//Аверсон 17.07.2019 КВВ СВФР-004479 )
							//ПСА 25.02.2021 СВФР-007248---
							//ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
							//Если ВыбранныйДень = стрГрафик.Дата Тогда
							//	ИндексМассиваПриставок = 1;
							//Иначе
							//	Если ИндексМассиваПриставок = 2 Тогда
							//		ИндексМассиваПриставок = 0;
							//	КонецЕсли; 
							//КонецЕсли;                 
							//ВыбранныйДень = стрГрафик.Дата; 
							//---ПСА 25.02.2021 СВФР-007248
							//+++ПСА 28-12-2020 СВФР-006989
							
							
						иначе
							БукваВидаВремени = "";
							ЗначениеЧасов = "";
							ЗначЕстьВИнтервале = Ложь;
							ЭтоОтпуск = Ложь;
							ЧасовСверхрУрПоПриказу = 0; //Аверсон 28.01.2021 КВВ СВФР-007084
							ЧасовНочныхПоПриказуВПраздник = 0; //ПСА 08.02.2021 СВФР-007152+++
							РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
							РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
							РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
							РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
							РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
							
							Для Каждого стрНеявки из МассивРезультатЗапроса Цикл 
								НочныеВОтп = Ложь;  //Аверсон 14.11.2019 КВВ СВФР-005040
								МассивРезультатЗапроса = стрНеявки;
								Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
									БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
									ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
								иначе 
									Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда 
										Если ЗначЕстьВИнтервале Тогда 
											//Если не ЭтоОтпуск Тогда
											//	Продолжить;
											//КонецЕсли;
											
											//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 6, 8) (
											КодДальше = Истина; 
											Если Организация.ИНН = "700067572"  
												И МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
												ОтборКодДальше = Новый Структура();
												ОтборКодДальше.Вставить("Сотрудник", стрСотрудник);
												ОтборКодДальше.Вставить("ДокКомандировка", 1);
												ОтборКодДальше.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Командировка);
												Строки_ТЗ_Неявки_ОтборКодДальше = ТЗ_Неявки.НайтиСтроки(ОтборКодДальше);
												Если Строки_ТЗ_Неявки_ОтборКодДальше.Количество() = 0 Тогда
													КодДальше = Ложь;
												Иначе
													Для Каждого Стр_ОтборКодДальше ИЗ Строки_ТЗ_Неявки_ОтборКодДальше Цикл
														Если НачалоДня(стрГрафик.Дата) >= НачалоДня(Стр_ОтборКодДальше.ДатаНачала)
															И НачалоДня(стрГрафик.Дата) <= НачалоДня(Стр_ОтборКодДальше.ДатаОкончания) Тогда
															КодДальше = Истина;
															Прервать;
														КонецЕсли;
													КонецЦикла;
												КонецЕсли;
											КонецЕсли;
											Если КодДальше Тогда
												//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 6, 8) )
												Если не МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты Тогда 
													если не ЭтоОтпуск Тогда 
														Продолжить;
													КонецЕсли;
												КонецЕсли;	
											КонецЕсли;
										КонецЕсли;
										//Аверсон 14.11.2019 КВВ СВФР-005040 (  
										Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") Тогда //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
											Если стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда
												НочныеВОтп = Истина;
												Продолжить;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 14.11.2019 КВВ СВФР-005040 )
										БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
										ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										
										//Аверсон 28.01.2021 КВВ СВФР-007084 (
										ЧасовСверхрУрПоПриказу = 0; 
										//ПСА 12.02.2021 СВФР-007197+++
										РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
										РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
										РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
										РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
										РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; //Аверсон 03.06.2021 КВВ СВФР-007334
										
										//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
										Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
											или БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
											//+++ПСА 12.02.2021 СВФР-007197	
											ЗСверхУ = Новый Запрос;
											ЗСверхУ.Текст = "ВЫБРАТЬ 
											|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
											|ТЧДок.ОплачиватьВОдинарномРазмере,
											
											//Аверсон ЕАЕ 09.09.2025 СВФР-016610
											//Бобруйскводоканал
											|	ТЧДок.ЯвкаВТабель
											//Аверсон СВФР-016610
											
											|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
											|ГДЕ
											|ТЧДок.Ссылка.Проведен
											|И ТЧДок.Сотрудник = &Сотрудник
											|И ТЧДок.Дата = &Дата
											|СГРУППИРОВАТЬ ПО 
											|ТЧДок.ОплачиватьВОдинарномРазмере,
											
											//Аверсон ЕАЕ 09.09.2025 СВФР-016610
											//Бобруйскводоканал
											|	ТЧДок.ЯвкаВТабель
											//Аверсон СВФР-016610
											
											|";
											ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
											ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
											РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
											Если РезЗСверхУ.Количество() > 0 Тогда
												Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда //ПСА 12.02.2021 СВФР-007197+++
													//ПСА 12.03.2021+++
													Если БылаКомандировка(стрСотрудник,стрГрафик.Дата) Тогда
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
													Иначе
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													КонецЕсли;	
													//+++ПСА 12.03.2021
													
													//Аверсон ЕАЕ 02.04.2021 СВФР-007413
													//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
													Если Организация.ИНН = "700067572" Тогда
														//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 4)
														Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
															РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
															ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
														Иначе
															//Аверсон 02.07.2021 КВВ СВФР-007801 )
															//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
															Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																РаботаСверхурочныеВКомандировкеКакЯвка = Истина;
															КонецЕсли;
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															
															//Аверсон СВФР-007413
														КонецЕсли;
														
													//Аверсон ЕАЕ 09.09.2025 СВФР-016610
													//Бобруйскводоканал
													ИначеЕсли Организация.ИНН = "790041382" Тогда
														Если РезЗСверхУ[0].ЯвкаВТабель И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
															//РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
															ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														Иначе
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														КонецЕсли;
													//Аверсон СВФР-016610
														
													Иначе
														ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
													КонецЕсли;
													//ПСА 12.02.2021 СВФР-007197+++	
													//ПСА 05.03.2021 СВФР-007298+++      
													Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
														И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) Тогда
														//ПСА 12.03.2021+++
														//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка и ПодразделениеТранспортногоЦеха() Тогда
														//	РаботаСверхурочныеКакКомандировка = Истина;
														//Иначе
														//	РаботаСверхурочныеКакЯвка = Истина;
														//КонецЕсли;
														Если ПодразделениеТранспортногоЦеха() Тогда
															РаботаСверхурочныеКакЯвка = Ложь;
														Иначе
															РаботаСверхурочныеКакЯвка = Истина;
														КонецЕсли;
														//+++ПСА 12.03.2021
													КонецЕсли;	
													//+++ПСА 05.03.2021 СВФР-007298
													
												Иначе
													//Аверсон ЕАЕ 02.04.2021 СВФР-007413
													//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
													Если Организация.ИНН = "700067572" Тогда
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
														//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
														
														ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														//Аверсон СВФР-007413
														
														//Аверсон 03.06.2021 КВВ СВФР-007334 (
														Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
															РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
														КонецЕсли;
														//Аверсон 03.06.2021 КВВ СВФР-007334 )
														
													Иначе
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
														ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
													КонецЕсли;
													//ПСА 11.03.2021 СВФР-007321+++      
													//Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
													//	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) и ПодразделениеТранспортногоЦеха() Тогда
													//	РаботаСверхурочныеКакКомандировка = Истина;
													//КонецЕсли;	
													//+++ПСА 11.03.2021 СВФР-007321
													
												КонецЕсли;
												//+++ПСА 12.02.2021 СВФР-007197	
											КонецЕсли;	
										КонецЕсли;
										//Аверсон 28.01.2021 КВВ СВФР-007084 )
										
										Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
											СостРаб = Новый СписокЗначений;
											СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
											ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
											РезультатСост = ЗЗ.Выполнить().Выбрать();
											Пока РезультатСост.Следующий() Цикл
												//ПСА 08.02.2021 СВФР-007152+++
												ПоискНочныхВПраздничныйДень = Ложь;
												Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
													ПоискНочныхВПраздничныйДень = Истина;
												КонецЕсли;
												//+++ПСА 08.02.2021 СВФР-007152
												
												//ПСА 26.02.2021 СВФР-007248+++
												ПоискЯвкиВПразники = Ложь;
												//Аверсон 09.04.2021 КВВ СВФР-007434 (
												Если НЕ (Организация.ИНН = "700067572") Тогда
													ПоискЯвкиВПразники = Истина;
												Иначе
													//Аверсон 09.04.2021 КВВ СВФР-007434 )
													Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
														И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,МассивРезультатЗапроса.ДатаНачала) Тогда
														ПоискЯвкиВПразники = Истина;
													КонецЕсли;
												КонецЕсли;
												//+++ПСА 26.02.2021 СВФР-007248
												
												для Каждого стр из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
													Если стр.Сотрудник = стрСотрудник и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала)Тогда
														Если ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															ЗначениеЧасов = стр.ОтработаноЧасов;  
														ИначеЕсли не стр.Доплачивать и не ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															ЗначениеЧасов = стр.ОтработаноЧасов;
														ИначеЕсли стр.Доплачивать и ЗначениеЗаполнено(стр.ДатаВыхода) Тогда 
															ЗначениеЧасов = стр.ОтработаноЧасов;
														КонецЕсли;
														//ПСА 08.02.2021 СВФР-007152+++
														Если ПоискНочныхВПраздничныйДень и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала) Тогда
															ЧасовНочныхПоПриказуВПраздник = стр.ОтработаноНочныхЧасов;
														КонецЕсли;
														//+++ПСА 08.02.2021 СВФР-007152
														//ПСА 26.02.2021 СВФР-007248+++
														Если ПоискЯвкиВПразники Тогда
															Если стр.Доплачивать и стр.ЯвкаВТабель Тогда
																РаботаВПраздникКакЯвка = Истина;
															КонецЕсли;	
														КонецЕсли;
														//+++ПСА 26.02.2021 СВФР-007248
														
													КонецЕсли;
												КонецЦикла;
											КонецЦикла;
										КонецЕсли;
										
										Если МассивРезультатЗапроса.ДокКомандировка = 1 Тогда
											СостРаб = Новый СписокЗначений;
											СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
											ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
											РезультатСост = ЗЗ.Выполнить().Выбрать();
											Пока РезультатСост.Следующий() Цикл
												для Каждого стр из РезультатСост.Регистратор.ПереносДней Цикл
													Если стр.Сотрудник = стрСотрудник и стр.ДатаС = НачалоДня(стрГрафик.Дата) Тогда
														МассивОбщиеГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,стр.ДатаНаКакую));
														Если МассивОбщиеГрафики.Количество()>0 Тогда 
															ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
														КонецЕсли;                
														МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стрГрафик.Дата)));
														Если МассивТЗДниКомандировок.Количество()=0 Тогда 
															СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
															СтрТЗДниКомандировок.ДатаС = НачалоДня(стрГрафик.Дата);
															СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
															СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
															СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
														КонецЕсли;
														//ПСА 09.02.2021 СВФР-007152 +++	
													ИначеЕсли стр.Сотрудник = стрСотрудник Тогда
														МассивОбщиеГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,стр.ДатаС));
														Если МассивОбщиеГрафики.Количество() = 0 Тогда
															МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стр.ДатаС)));
															Если МассивТЗДниКомандировок.Количество()=0 Тогда
																СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																СтрТЗДниКомандировок.ДатаС = НачалоДня(стр.ДатаС);
																СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
															КонецЕсли;
														КонецЕсли;
														//+++ПСА 09.02.2021 СВФР-007152	
													КонецЕсли;
												КонецЦикла;
											КонецЦикла; 
										КонецЕсли;
										Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
											ЭтоОтпуск = Истина;
										иначе
											ЭтоОтпуск = Ложь;
										КонецЕсли;
										
										ЗначЕстьВИнтервале = Истина;
										//Прервать; //брать последнее всегда значение, которое входит. БЛ бует всегда после отпуска
									иначе
										Если не ЗначЕстьВИнтервале Тогда
											//ПСА 03.02.2021 СВФР-007135 +++
											//Аверсон 14.11.2019 КВВ СВФР-005040 (
											//Если Организация.ИНН = "100010315" Тогда
											//	БукваВидаВремени =  ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
											//	//Аверсон 14.11.2019 КВВ СВФР-005040 )
											//Иначе
											//	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											//КонецЕсли;
											БукваВидаВремени =  ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
											//+++ПСА 03.02.2021 СВФР-007135
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
							Если НЕ НочныеВОтп Тогда  //Аверсон 14.11.2019 КВВ СВФР-005040
								Если БукваВидаВремени="" Тогда 
									БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
									ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
								КонецЕсли;
								
								//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
								ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
								СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, ЗначениеЧасов );
								ЭтоИндивидГрафик = ?(ТипЗнч(стрГрафик.Документ) = Тип("ДокументСсылка.ВводИндивидуальныхГрафиковРаботыОрганизации"),Истина,Ложь); //Аверсон 08.06.2023 КВВ СВФР-010920
								БукваЧасы = ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки, ЭтоИндивидГрафик );  //Аверсон 08.06.2023 КВВ СВФР-010920 (ЭтоИндивидГрафик)
								БукваВидаВремени = БукваЧасы.Буква;
								ЗначениеЧасов = БукваЧасы.Часы;
								//- СВЭЙ КДЯ 19.11.19 СВФР-004908
								//Аверсон 29.10.2020 КВВ СВФР-006756 (
								Если НЕ ЕстьСокращенныеДниВМесяце Тогда
									ЗначениеЧасов = БукваЧасы.Часы;
								Иначе
									СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(СтрСотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
									ЗначениеЧасов = ?(СокращЧасы=0,БукваЧасы.Часы,СокращЧасы);    
								КонецЕсли;
								//Аверсон 29.10.2020 КВВ СВФР-006756 )
								
								//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 2) (
								Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
									И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено Тогда
									
									//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) (
									Если Организация.ИНН = "700067572" 
										И НЕ РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(стрГрафик.Дата,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата 
										И ИндексМассиваПриставок = 0 Тогда
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
										ИндексМассиваПриставок = ИндексМассиваПриставок +1;
									КонецЕсли;
									//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) )
									
									БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) (
								ИначеЕсли БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
									ЕстьОтпускВБР = ПроверкаОтзываИзОтпускаВОтпускеПоБерИРодам(СтрСотрудник,стрГрафик.Дата).Количество();
									Если ЕстьОтпускВБР > 0 Тогда
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск;
									КонецЕсли;
									//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) )
								КонецЕсли;
								//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 2) )
								
								//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 3)
								Если Организация.ИНН = "700067572" 
									И ИндексМассиваПриставок = 1 
									И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
									НазваниеЯчейкиВБазе_ = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									БукваВидаВремени_ = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе_];
									Если БукваВидаВремени_ = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
										ИндексМассиваПриставок = 0;
									КонецЕсли;
								КонецЕсли;
								//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 3)
								
								
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
								
								//Аверсон 28.01.2021 КВВ СВФР-007084 ( 
								Если ЧасовСверхрУрПоПриказу <> 0 и стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам Тогда //ПСА 25.02.2021 СВФР-007248+++
									ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									//Аверсон 03.06.2021 КВВ СВФР-007334 (
									Если РаботаВМЕСТОСверхурочныеКакЯвка Тогда
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
									Иначе
										//Аверсон 03.06.2021 КВВ СВФР-007334 )
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
									КонецЕсли;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
									//ПСА 05.03.2021 СВФР-007298+++  
									Если РаботаСверхурочныеКакЯвка Тогда
										Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
											НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
											НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
											НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										Иначе
											ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
										КонецЕсли;	
									КонецЕсли;	
									//+++ПСА 05.03.2021 СВФР-007298
									//ПСА 11.03.2021 СВФР-007321+++  
									Если РаботаСверхурочныеКакКомандировка Тогда
										Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
											НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
											НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
											НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
										Иначе
											ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
										КонецЕсли;	
									КонецЕсли;	
									//+++ПСА 11.03.2021 СВФР-007321
								КонецЕсли;
								//Аверсон 28.01.2021 КВВ СВФР-007084 )
								
								//ПСА 08.02.2021 СВФР-007152 +++
								Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
									Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
										ИндексМассиваПриставок = 2;	
									Иначе
										ИндексМассиваПриставок = 1;	
									КонецЕсли;	
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
									ЧасовНочныхПоПриказуВПраздник = 0;
								КонецЕсли;
								//+++ПСА 08.02.2021 СВФР-007152
								//ПСА 26.02.2021 СВФР-007248+++
								Если РаботаВПраздникКакЯвка Тогда
									Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
										ИндексМассиваПриставок = 2;	
									Иначе
										ИндексМассиваПриставок = 1;	
									КонецЕсли;	
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
									РаботаВПраздникКакЯвка = Ложь;
								КонецЕсли;	
								//+++ПСА 26.02.2021 СВФР-007248
								
								БылИндексДо = ИндексМассиваПриставок; //Аверсон 20.05.2020 КВВ СВФР-006013
								//ПСА 03.02.2021 СВФР-007135 +++
								//Аверсон 14.11.2019 КВВ СВФР-005040 (  
								//Если Организация.ИНН = "100010315" Тогда
								//	ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
								//	Если ВыбранныйДень = стрГрафик.Дата Тогда
								//		ИндексМассиваПриставок = 1;
								//	Иначе
								//		Если ИндексМассиваПриставок = 2 Тогда
								//			ИндексМассиваПриставок = 0;
								//		КонецЕсли; 
								//	КонецЕсли;                 
								//	ВыбранныйДень = стрГрафик.Дата; 
								//КонецЕсли;
								//Аверсон 14.11.2019 КВВ СВФР-005040 )
								//ПСА 25.02.2021 СВФР-007248---
								//ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
								//Если ВыбранныйДень = стрГрафик.Дата Тогда
								//	ИндексМассиваПриставок = 1;
								//Иначе
								//	Если ИндексМассиваПриставок = 2 Тогда
								//		ИндексМассиваПриставок = 0;
								//	КонецЕсли; 
								//КонецЕсли;                 
								//ВыбранныйДень = стрГрафик.Дата; 
								//---ПСА 25.02.2021 СВФР-007248
								//+++ ПСА 03.02.2021 СВФР-007135
								//Аверсон 20.05.2020 КВВ СВФР-006013 (
								Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь 
									И ИндексМассиваПриставок = 1 И БылИндексДо = 1 Тогда
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок-1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок-1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
									
									//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 4) (
									ТекИндексВВ = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[ТекИндексВВ]) И СтрокаРасшифровкиПоДням[ТекИндексВВ] = БукваВидаВремени Тогда
										СтрокаРасшифровкиПоДням[ТекИндексВВ] = "";
										СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = "";
									КонецЕсли;
									//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 4) )
									
								КонецЕсли;	
								//Аверсон 20.05.2020 КВВ СВФР-006013 )
							КонецЕсли;
							
						КонецЕсли;
						
						ЗапросПереносКоманд = Новый Запрос;
						ЗапросПереносКоманд.Текст = 
						"ВЫБРАТЬ
						|	ПереносДнейКомандировок.Сотрудник
						|ИЗ
						|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
						|ГДЕ
						|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
						|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
						
						ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", стрГрафик.Дата);
						ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", стрСотрудник);
						
						РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
						
						Пока РезультатПереносКоманд.Следующий() Цикл
							ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
							НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
							НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0; 
						КонецЦикла;
					КонецЦикла;
					
					//Аверсон 25.02.2020 КВВ СВФР-005565 (
					Если ТЗ_Неявки <> Неопределено Тогда
						ТекДень = Дата(1,1,1,0,0,0);
						//Аверсон 26.05.2021 КВВ СВФР-007334 (
						ТЗНеявокПоСотр = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)); 
						Если Организация.ИНН = "700067572" Тогда
							ТЗНеявокПоСотр1 = ТЗНеявокПоСотр;
							Если ТЗНеявокПоСотр1.Количество() > 1 Тогда
								ВсегоКолвоТЗНеявокПоСотр = ТЗНеявокПоСотр1.Количество();
								Счч = 0;
								Для Каждого СтрТЗНеявокПоСотр ИЗ ТЗНеявокПоСотр1 Цикл
									Счч = Счч + 1;
									Если Счч <> ВсегоКолвоТЗНеявокПоСотр Тогда
										Если ТЗНеявокПоСотр[Счч].ДатаНачала > СтрТЗНеявокПоСотр.ДатаНачала И
											НачалоДня(ТЗНеявокПоСотр[Счч].ДатаНачала) < НачалоДня(СтрТЗНеявокПоСотр.ДатаОкончания) Тогда
											Если НЕ (СтрТЗНеявокПоСотр.ДокБЛ = 1 И ТЗНеявокПоСотр[Счч].ДокОтзыв = 1 И ТЗНеявокПоСотр[Счч].ДокОтпуска = 1)  //Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10)
												И СтрТЗНеявокПоСотр.ДокОтзывПеренос = 0 Тогда //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
												СтрТЗНеявокПоСотр.ДатаОкончания = ТЗНеявокПоСотр[Счч].ДатаНачала-1; 
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;         
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						
						Для Каждого Стр Из ТЗНеявокПоСотр Цикл
							//Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
							//Аверсон 26.05.2021 КВВ СВФР-007334 )
							
							Если Стр.ДатаНачала <= Стр.ДатаОкончания Тогда
								
								//Аверсон 02.10.2020 КВВ СВФР-006634 (
								ДатаВИндГрафике = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,Стр.ДатаНачала));
								Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
									И ДатаВИндГрафике.Количество() = 0 
									И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
									
									//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) (
									Продолжать = Истина;
									ТЗНеявокПоСотрПроверка = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник,БукваВидаВремени,ДокОтпуска,ДокОтзыв,ДокОтзывПеренос", стрСотрудник,Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск,1,1,1));
									Если ТЗНеявокПоСотрПроверка.Количество() > 0 Тогда
										Для Каждого СтрТЗНеявокПоСотрПроверка ИЗ ТЗНеявокПоСотрПроверка Цикл
											Если НачалоДня(Стр.ДатаНачала) >= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаНачала) И НачалоДня(Стр.ДатаНачала) <= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаОкончания) Тогда
												СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Стр.БукваВидаВремени;
												
												Если НЕ ЗначениеЗаполнено(ТекДень) Тогда 
													ТекДень = НачалоДня(Стр.ДатаНачала);
												КонецЕсли;
												
												ТекДень = ТекДень + 24*60*60; 
												Продолжать = Ложь;
												
												Продолжить;
											КонецЕсли;
										КонецЦикла;								
									КонецЕсли;
									
									Если Продолжать Тогда
										//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) )
										СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
										Продолжить;
									КонецЕсли;
								КонецЕсли;
								//Аверсон 02.10.2020 КВВ СВФР-006634 )
								
								//Аверсон 18.03.2021 КВВ СВФР-007187 (
								ДатаОкончанияПериода_Проверка = ДатаОкончанияПериода;
								Если КонецДня(ДатаУв) <> КонецМесяца(ДатаУв) Тогда 
									ДатаОкончанияПериода_Проверка = НачалоДня(ДатаУв-1);  
								КонецЕсли;
								//Аверсон 18.03.2021 КВВ СВФР-007187 )
								
								БукваНеявки = Стр.БукваВидаВремени;
								ТекДень = Стр.ДатаНачала;
								КонечныйДень = Стр.ДатаОкончания;
								Пока ТекДень<= КонечныйДень Цикл
									//Аверсон 14.08.2020 КВВ СВФР-006426 (
									//Аверсон 18.03.2021 КВВ СВФР-007187 (
									//Если ТекДень > ДатаОкончанияПериода Тогда
									Если ТекДень > ДатаОкончанияПериода_Проверка Тогда 
										//Аверсон 18.03.2021 КВВ СВФР-007187 )
										Прервать;
									КонецЕсли;
									//Аверсон 14.08.2020 КВВ СВФР-006426 )
									Если МассивПраздников.Найти(ТекДень) <> Неопределено И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) = 0 Тогда
										//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 3(     
										ИндексЯчейкиНеявки = День(ТекДень);
										Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
											ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
											ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
											ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
											ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
											СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
											СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
										Иначе
											//Аверсон 23.07.2021 КВВ СВФР-007876 )
											//Аверсон 22.07.2021 КВВ СВФР-007876 пункт 1(
											Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
												ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
												РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
												Пока РезРабВПраздИВых.Следующий() Цикл
													Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
														ОтборД = Новый Структура();
														ОтборД.Вставить("Сотрудник", стрСотрудник);
														ОтборД.Вставить("ДатаВыхода", ТекДень);
														
														НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
														
														Если НайденноеЗначение_.Количество() > 0 Тогда
															Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																ЗнЧ = ЭлМасс.ОтработаноЧасов;
																
																Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																	
																	//Аверсон ЕАЕ 12.12.2025 СВФР-017530
																	Если Стр.ДокКомандировка = 1 Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																	Иначе
																	//Аверсон СВФР-017530
																		
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																	КонецЕсли;
																	
																	СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																	СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																	Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																		СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																		СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																	Иначе
																		Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																			СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																			СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																		КонецЕсли;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																	КонецЕсли;
																ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																	СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																	СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																	//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																	Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																		СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																		СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																	КонецЕсли;
																	//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																	СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																	СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																	//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																	Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																		СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																		СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																	КонецЕсли;
																	//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																КонецЕсли;
															КонецЦикла;
														КонецЕсли;
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 22.07.2021 КВВ СВФР-007876 )
										ТекДень = ТекДень + 24*60*60; 	
										Продолжить;	
									КонецЕсли; 
									ИндексЯчейкиНеявки = День(ТекДень);
									ВидВремениЗаполнен = Ложь;
									Для Каждого ТекПриставка Из МассивПриставок Цикл 
										НазваниеЯчейкиВидаВремениНеявки = ТекПриставка + "ВидВремени" + ИндексЯчейкиНеявки;
										ВидВремениЗаполнен = ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки]);
										Если ВидВремениЗаполнен Тогда
											//Аверсон 21.04.2020 КВВ СВФР-005904 (
											Если ТекПриставка = "Первый" и СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
												Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]) Тогда
													//Аверсон 28.01.2021 КВВ СВФР-007084 (
													Если Организация.ИНН = "700067572" И 
														(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
														или СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда  //ПСА 08.02.2021 СВФР-007152+++
													Иначе
														//Аверсон 28.01.2021 КВВ СВФР-007084 )
														СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
													КонецЕсли;
												КонецЕсли;	
												Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]) Тогда
													СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
												КонецЕсли;
												
												//СВЭЙ 08.12.2023 КВВ СВФР-011914 (
											ИначеЕсли ТЗ_Переносы.Количество() > 0 
												И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0
												И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] 
												И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]
												И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] 
												И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] Тогда
												ВидВремениЗаполнен = Ложь;
												СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
												СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
												СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
												СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
												СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
												СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
												//СВЭЙ 08.12.2023 КВВ СВФР-011914 )
												
												//Аверсон 03.06.2021 КВВ СВФР-007334 (
											Иначе
												Если Организация.ИНН = "700067572"
													И ТекПриставка = "Первый"
													И (СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
													ИЛИ СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) //Аверсон 02.07.2021 КВВ СВФР-007801 (пункт 5 )
													И НЕ (ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]))
													И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
													СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = КолВоЧасовПраздниковПоСотр(стрСотрудник,ТекДень);
												КонецЕсли;
												//Аверсон 03.06.2021 КВВ СВФР-007334 )
											КонецЕсли;
											//Аверсон 21.04.2020 КВВ СВФР-005904 )
											Прервать;	
										КонецЕсли; 
									КонецЦикла;
									Если НЕ ВидВремениЗаполнен И
										(ТекДень >= НачалоМесяца(Стр.ДатаНачала) И ТекДень <= КонецМесяца(Стр.ДатаНачала)) Тогда  //Аверсон 16.04.2020 КВВ СВФР-005876
										//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) (
										Продолжать = Истина;
										Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
											//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) (
											//Если ПодразделениеОрганизации <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации Тогда	
											//	Продолжать = Ложь;
											//КонецЕсли;
											ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
											Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
												Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
													Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
														//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
														Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
															Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																Продолжать = Ложь;
															КонецЕсли;	
														Иначе
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
												Иначе
													Продолжать = Ложь;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) )
										КонецЕсли;
										
										//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) (
										Если Организация.ИНН = "700067572" Тогда
											Если НЕ ВидВремениЗаполнен И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Явка")) <> 0
												И ЗначениеЗаполнено(стрГрафик.Документ) Тогда
												ОтборГр = Новый Структура();
												ОтборГр.Вставить("Сотрудник", стр.Сотрудник);
												НайденноеЗначениегр = стрГрафик.Документ.ГрафикРаботы.НайтиСтроки(ОтборГр);
												Если НайденноеЗначениеГр.Количество() > 0 Тогда
													ЧасовДень = "Часов"+СокрЛП(День(Стр.ДатаНачала));
													ЧасовПоГр = НайденноеЗначениеГр[0][ЧасовДень];
													Если ЧасовПоГр = 0 Тогда
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли; 
										КонецЕсли;
										//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) )
										
										Если Продолжать Тогда
											//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) )
											НазваниеЯчейкиВидаВремениНеявки = "ПервыйВидВремени" + ИндексЯчейкиНеявки;
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = БукваНеявки;
											//ПСА 12.02.2021 СВФР-007197+++
											Если Стр.ДокПраздничный = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
												ЗначениеЧасов = 0;
												ЧасовНочныхПоПриказуВПраздник = 0;
												РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
												
												//Аверсон ЕАЕ 04.08.2025 СВФР-016362
												//Бобруйскводоканал
												ЧасовЯвкаВПраздник = 0;
												//Аверсон СВФР-016362
												
												Если Стр.ДокПраздничный = 1 Тогда 
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
													ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
													РезультатСост = ЗЗ.Выполнить().Выбрать();
													
													//Аверсон ЕАЕ 04.08.2025 СВФР-016362
													//Бобруйскводоканал
													Если Организация.ИНН = "790041382" Тогда
														СтруктураПраздники = Новый Структура;
														СтруктураПраздники.Вставить("Праздники", 0);
														СтруктураПраздники.Вставить("Работа",    0);
														СтруктураПраздники.Вставить("Ночные",    0);
														//ПоискЯвкиВПраздники = Истина;
														Пока РезультатСост.Следующий() Цикл
															Для Каждого стрДок Из РезультатСост.Регистратор.РаботникиОрганизации Цикл
																Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																	Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И 
																		РезультатСост.Регистратор.НочныеЧасы Тогда
																		СтруктураПраздники.Ночные = СтруктураПраздники.Ночные + стрДок.ОтработаноНочныхЧасов;
																	КонецЕсли;
																	Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;	
																	ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;
																	ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда
																		СтруктураПраздники.Праздники = СтруктураПраздники.Праздники + стрДок.ОтработаноЧасов;
																	КонецЕсли;
																	Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																		РаботаВПраздникКакЯвка = Истина;
																		СтруктураПраздники.Работа = СтруктураПраздники.Работа + стрДок.ОтработаноЧасов;	
																	КонецЕсли;
																КонецЕсли;
															КонецЦикла;
														КонецЦикла;
														ЧасовНочныхПоПриказуВПраздник = СтруктураПраздники.Ночные;
														ЗначениеЧасов                 = СтруктураПраздники.Праздники;
														ЧасовЯвкаВПраздник            = СтруктураПраздники.Работа;
													Иначе
													//Аверсон СВФР-016362
														
														Пока РезультатСост.Следующий() Цикл
															//ПСА 08.02.2021 СВФР-007152+++
															ПоискНочныхВПраздничныйДень = Ложь;
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
																ПоискНочныхВПраздничныйДень = Истина;
															КонецЕсли;
															//+++ПСА 08.02.2021 СВФР-007152
															
															//ПСА 26.02.2021 СВФР-007248+++
															ПоискЯвкиВПразники = Ложь;
															//Аверсон 09.04.2021 КВВ СВФР-007434 (
															Если НЕ (Организация.ИНН = "700067572") Тогда
																ПоискЯвкиВПразники = Истина;
															Иначе
																//Аверсон 09.04.2021 КВВ СВФР-007434 )
																Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
																	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,Стр.ДатаНачала) Тогда
																	ПоискЯвкиВПразники = Истина;
																КонецЕсли;
															КонецЕсли;
															//+++ПСА 26.02.2021 СВФР-007248
															
															для Каждого стрДок из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала)Тогда
																	Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;  
																	ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда 
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	КонецЕсли;
																	//ПСА 08.02.2021 СВФР-007152+++
																	Если ПоискНочныхВПраздничныйДень и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																		ЧасовНочныхПоПриказуВПраздник = стрДок.ОтработаноНочныхЧасов;
																	КонецЕсли;
																	//+++ПСА 08.02.2021 СВФР-007152
																	//ПСА 26.02.2021 СВФР-007248+++
																	Если ПоискЯвкиВПразники Тогда
																		Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																			РаботаВПраздникКакЯвка = Истина;
																		КонецЕсли;	
																	КонецЕсли;
																	//+++ПСА 26.02.2021 СВФР-007248
																КонецЕсли;
															КонецЦикла;
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
												НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
												//ПСА 08.02.2021 СВФР-007152 +++
												Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
														ИндексМассиваПриставок = 2;	
													Иначе
														ИндексМассиваПриставок = 1;	
													КонецЕсли;	
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
													ЧасовНочныхПоПриказуВПраздник = 0;
												КонецЕсли;
												//+++ПСА 08.02.2021 СВФР-007152
												//ПСА 26.02.2021 СВФР-007248+++
												Если РаботаВПраздникКакЯвка Тогда
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
														ИндексМассиваПриставок = 2;	
													Иначе
														ИндексМассиваПриставок = 1;	
													КонецЕсли;	
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
													
													//Аверсон ЕАЕ 04.08.2025 СВФР-016362
													//Бобруйскводоканал
													Если Организация.ИНН = "790041382" Тогда
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовЯвкаВПраздник;
													Иначе
													//Аверсон СВФР-016362
														
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
													КонецЕсли;
													РаботаВПраздникКакЯвка = Ложь;
												КонецЕсли;	
												//+++ПСА 26.02.2021 СВФР-007248
												//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 5 )
											Иначе
												Если Организация.ИНН = "700067572" 
													И Стр.ДокКомандировка = 1  
													И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка 
													И (ИндексМассиваПриставок = 0 ИЛИ ИндексМассиваПриставок = 1) Тогда
													ЗЗЗ = Новый Запрос;
													ЗЗЗ.Текст = "
													|ВЫБРАТЬ
													|СостояниеРаботниковОрганизаций.Регистратор ,
													|СостояниеРаботниковОрганизаций.Сотрудник,
													|СостояниеРаботниковОрганизаций.Период,
													|СостояниеРаботниковОрганизаций.ПериодЗавершения ,
													|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1) как кон
													|ПОМЕСТИТЬ ВтДок
													|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
													|ГДЕ
													|СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
													|И &Период МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1)
													|И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
													|;
													|
													|ВЫБРАТЬ 
													|ПД.Сотрудник,
													|ПД.Доплачивать,
													|ПД.ОтработаноЧасов,
													|ПД.ДатаС,
													|ПД.ДатаНаКакую
													|ИЗ Документ.КомандировкиОрганизаций.ПереносДней КАК ПД
													|ЛЕВОЕ СОЕДИНЕНИЕ ВтДок
													|ПО ПД.Ссылка = ВтДок.Регистратор
													|И ПД.Сотрудник = ВтДок.Сотрудник
													|ГДЕ ПД.Ссылка = ВтДок.Регистратор
													|И ПД.Сотрудник = ВтДок.Сотрудник
													|И ПД.ДатаС = &Период
													|И ПД.ОтработаноЧасов > 0 
													|И ПД.Доплачивать
													|И ПД.Ссылка.Проведен
													|И ПД.ДатаНаКакую = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
													ЗЗЗ.УстановитьПараметр("Период",ТекДень);
													ЗЗЗ.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
													ЗЗЗ.УстановитьПараметр("Состояние", СостРаб);
													РезЗЗЗ = ЗЗЗ.Выполнить().Выгрузить();
													Если РезЗЗЗ.Количество() > 0 Тогда
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
														СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = РезЗЗЗ[0].ОтработаноЧасов;
														
													КонецЕсли;
												КонецЕсли;
												
												//Аверсон 02.07.2021 КВВ СВФР-007801 )
											КонецЕсли;
											//+++ПСА 12.02.2021 СВФР-007197
										КонецЕсли;
									КонецЕсли; 
									//ПСА 02.02.2021 СВФР-007136 +++
									Если ВидВремениЗаполнен Тогда
										Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
											И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
											СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
										КонецЕсли;										
									КонецЕсли;	
									//+++ПСА 02.02.2021 СВФР-007136
									
									//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
									Если Организация.ИНН = "700067572" Тогда     
										ИндексЯчейкиНеявки = День(ТекДень);
										//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) (
										Продолжать = ПроверкаНаПодразделениеВТекущийДень(ПодразделениеОрганизации,ТекДень,СтрСотрудник); 
										Если Продолжать Тогда
											//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) )
											Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
												//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ( (закомментировано, вынесено в отдельную функцию выше)
												////Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) (
												//Продолжать = Истина;
												//Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
												//	ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
												//	Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
												//		Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
												//			Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
												//				//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
												//				Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
												//					Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
												//						Продолжать = Ложь;
												//					КонецЕсли;	
												//				Иначе
												//					//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
												//					Продолжать = Ложь;
												//				КонецЕсли;
												//			КонецЕсли;
												//		Иначе
												//			Продолжать = Ложь;
												//		КонецЕсли;
												//	КонецЕсли;
												//КонецЕсли;
												//
												//Если Продолжать Тогда
												//	//Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) )
												//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ) (закомментировано, вынесено в отдельную функцию выше)
												ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник,,,Истина).НормаЧасов; //Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) 6 параметр Истина
												ВидВремениЗаполнен = Истина;
												//Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) (
												Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку 
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования) //Аверсон 23.08.2023 КВВ СВФР-011294
													И ЗнЧ = 0 Тогда
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
												Иначе
													//Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) )
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
												КонецЕсли;
												
												//КонецЕсли;
											Иначе
												Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
													ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
													РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
													Пока РезРабВПраздИВых.Следующий() Цикл
														Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
															ОтборД = Новый Структура();
															ОтборД.Вставить("Сотрудник", стрСотрудник);
															ОтборД.Вставить("ДатаВыхода", ТекДень);
															
															НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
															
															Если НайденноеЗначение_.Количество() > 0 Тогда
																Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																	ЗнЧ = ЭлМасс.ОтработаноЧасов;
																	Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																		Иначе
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																		КонецЕсли;
																		ВидВремениЗаполнен = Истина;
																	ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																		КонецЕсли;
																		ВидВремениЗаполнен = Истина;
																	ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																		КонецЕсли;
																		ВидВремениЗаполнен = Истина;
																	КонецЕсли;
																КонецЦикла;
															КонецЕсли;
														КонецЕсли;
													КонецЦикла;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
									
									//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 1)
									Если Организация.ИНН = "700067572"
										И НЕ ВидВремениЗаполнен 
										И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) <> 0 ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0)
										И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 )Тогда
										//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) (
										Продолжать = Истина;
										Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
											ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
											Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
												Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
													Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
														//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
														Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
															Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																Продолжать = Ложь;
															КонецЕсли;	
														Иначе
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
												Иначе
													Продолжать = Ложь;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										Если Продолжать Тогда
											//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) )
											СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
											СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
										КонецЕсли;
									КонецЕсли;
									//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 1)
									
									ТекДень = ТекДень + 24*60*60; 	
								КонецЦикла;
							КонецЕсли; 	
						КонецЦикла; 		
					КонецЕсли; 
					//Аверсон 25.02.2020 КВВ СВФР-005565 )
					
					Для Каждого стрКоманд из ТЗДниКомандировок Цикл 
						Если НачалоМесяца(стрКоманд.ДатаНаКакую) = ПериодРегистрации Тогда
							Если ЗначениеЗаполнено(стрКоманд.ДатаНаКакую) Тогда
								ИндексЯчейкиВТаблице = День(стрКоманд.ДатаНаКакую);
								
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
							КонецЕсли;  
						КонецЕсли;
						Если НачалоМесяца(стрКоманд.ДатаС) = ПериодРегистрации Тогда
							ИндексЯчейкиВТаблице = День(стрКоманд.ДатаС); 
							НадоЧтотоВставлять = Истина;  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
							Если стрКоманд.Доплачивать Тогда 
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 1)
								НадоРВ = Ложь;          
								Если Организация.ИНН = "700067572" Тогда
									Если ИндексМассиваПриставок = 1 Тогда
										Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
											ИндексМассиваПриставок = 0;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										Иначе
											Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
												НадоРВ = Истина;
												//Аверсон 07.07.2021 КВВ СВФР-007801 ( (пункт 10)
											ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
												СтрокаРасшифровкиПоДням[МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = стрКоманд.ОтработаноЧасов;
												НадоРВ = Истина;
												//Аверсон 07.07.2021 КВВ СВФР-007801 )		
											КонецЕсли;
										КонецЕсли;
										//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4) (
									ИначеЕсли ИндексМассиваПриставок = 0 
										И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) 
										И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
										//перенесем праздники во второй индекс
										СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
										СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = стрКоманд.ОтработаноЧасов;
										НадоРВ = Ложь;
									ИначеЕсли ИндексМассиваПриставок = 2
										И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)])
										И (СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники
										ИЛИ СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
										И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)])
										И (СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники
										ИЛИ СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
										И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] <> СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] Тогда
										НадоЧтотоВставлять = Ложь;
										//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4) )
									КонецЕсли;
								КонецЕсли;
								Если НадоЧтотоВставлять Тогда  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
									Если НадоРВ Тогда  
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									Иначе
										//Аверсон 02.07.2021 КВВ СВФР-007801 )
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							Если НадоЧтотоВставлять Тогда  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
							КонецЕсли;
						КонецЕсли;					
					КонецЦикла;
					
				КонецЕсли;
				
			иначе
				Для Каждого стр из СписокСотрудников Цикл 
					ТЗДниКомандировок.Очистить();
					
					стрСотрудник = стр;
					
					ЕстьСокращенныеДниВМесяце = ПроизводительностьПовторноеИспользование.ПроверкаСокращенныхДнейВМесяце(стрСотрудник,ПериодРегистрации); //Аверсон 21.08.2020 КВВ СВФР-006439 //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
					
					ЗапросПр = Новый Запрос;
					ЗапросПр.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Сотрудник = &Сотрудник
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
					
					ЗапросПр.УстановитьПараметр("Организация", Организация);
					ЗапросПр.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПр.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));				
					ЗапросПр.УстановитьПараметр("Сотрудник", стрСотрудник);
					
					РезультатЗапросаПр = ЗапросПр.Выполнить().Выбрать();
					ДатаПр = ПериодРегистрации;
					Пока РезультатЗапросаПр.Следующий() Цикл
						ДатаПр = РезультатЗапросаПр.Период; 					
					КонецЦикла;
					ЗапросУв = Новый Запрос;
					ЗапросУв.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Сотрудник = &Сотрудник
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
					
					ЗапросУв.УстановитьПараметр("Сотрудник", стрСотрудник);
					
					РезультатЗапросаУв = ЗапросУв.Выполнить().Выбрать();
					ДатаУв = КонецМесяца(ПериодРегистрации);
					Пока РезультатЗапросаУв.Следующий() Цикл
						ДатаУв = РезультатЗапросаУв.Период; 					
					КонецЦикла;
					
					
					Если РезультатЗапросаПр.Количество()> 0 Тогда 
						РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПр,Новый Структура("Сотрудник",стрСотрудник));
					иначе
						РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",стрСотрудник)); 	
					КонецЕсли; 
					//О.Т. Аверсон 28.02.2019 № нет заявки
					ЗапросИзменения = Новый Запрос;
					ЗапросИзменения.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период,
					|	РаботникиОрганизаций.ГрафикРаботы
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Сотрудник = &Сотрудник
					|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
					
					ЗапросИзменения.УстановитьПараметр("Период", ПериодРегистрации);
					ЗапросИзменения.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросИзменения.УстановитьПараметр("Сотрудник", стрСотрудник);
					
					РезультатЗапросаИзменения = ЗапросИзменения.Выполнить().Выбрать();
					ТЗГрафикРаботыИзменения = Новый ТаблицаЗначений;
					ТЗГрафикРаботыИзменения.Колонки.Добавить("График");
					СтрТЗГрафикРаботыИзменения = ТЗГрафикРаботыИзменения.Добавить();
					СтрТЗГрафикРаботыИзменения.График = РегистрРаботники.ГрафикРаботы;
					
					ЕстьИзменения = Ложь;
					Пока РезультатЗапросаИзменения.Следующий() Цикл
						СтрТЗГрафикРаботыИзменения = ТЗГрафикРаботыИзменения.Добавить();
						СтрТЗГрафикРаботыИзменения.График = РезультатЗапросаИзменения.ГрафикРаботы;
						ЕстьИзменения = Истина;
					КонецЦикла;
					ТЗГрафикРаботыИзменения.Свернуть("График");
					//О.Т. Аверсон 28.02.2019 № нет заявки
					
					
					ИндексМассиваПриставок = 0;
					
					Если ТекущаяСтрокаТабличнойЧасти = Неопределено Тогда
						Если НЕ ТолькоСравнениеТабелей Тогда  //Аверсон 12.07.2019 КВВ СВФР-004487
							СтрокаРасшифровкиПоДням = ОтработанноеВремя.Добавить();
						Иначе
							СтрокаРасшифровкиПоДням = ОтработанноеВремя1.Добавить();  //Аверсон 12.07.2019 КВВ СВФР-004487
						КонецЕсли;
					Иначе
						СтрокаРасшифровкиПоДням = ТекущаяСтрокаТабличнойЧасти;
						Для ИндексДня = 1 По 31 Цикл
							ТекущаяСтрокаТабличнойЧасти["ПервыйВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ВторойВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ТретийВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ПервыйЧасов" + Строка(ИндексДня)] = 0;
							ТекущаяСтрокаТабличнойЧасти["ВторойЧасов" + Строка(ИндексДня)] = 0;
							ТекущаяСтрокаТабличнойЧасти["ТретийЧасов" + Строка(ИндексДня)] = 0;
						КонецЦикла;
					КонецЕсли;
					СтрокаРасшифровкиПоДням.Сотрудник = стрСотрудник;
					
					мТаблицаИндГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы",стрСотрудник));
					
					//Аверсон 09.09.2020 КВВ СВФР-006526 (
					Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
						И мТаблицаИндГрафики.Количество() > 0 И ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
						ТекущийИндекс = 0; 
						ВсегоЭлементов = мТаблицаИндГрафики.Количество(); 
						Пока ТекущийИндекс < ВсегоЭлементов Цикл 
							Индекс2 = ТекущийИндекс + 1; 
							Пока Индекс2 < ВсегоЭлементов Цикл 
								ПодрДок = мТаблицаИндГрафики[Индекс2].Документ.ПодразделениеОрганизации;
								Если ЗначениеЗаполнено(ПодрДок) И ПодрДок <> ПодразделениеОрганизации И НЕ ПодрДок.ПринадлежитЭлементу(ПодразделениеОрганизации) Тогда  //Аверсон 02.10.2020 КВВ СВФР-006634 (третье условие)
									мТаблицаИндГрафики.Удалить(Индекс2); 
									ВсегоЭлементов = ВсегоЭлементов - 1; 
								Иначе 
									Индекс2 = Индекс2 + 1; 
								КонецЕсли; 
							КонецЦикла; 
							ТекущийИндекс = ТекущийИндекс + 1; 
						КонецЦикла; 
						Если мТаблицаИндГрафики.Количество() > 0 Тогда
							ПодрДок = мТаблицаИндГрафики[0].Документ.ПодразделениеОрганизации;
							Если ЗначениеЗаполнено(ПодрДок) И ПодрДок <> ПодразделениеОрганизации И НЕ ПодрДок.ПринадлежитЭлементу(ПодразделениеОрганизации) Тогда  //Аверсон 02.10.2020 КВВ СВФР-006634 (третье условие)
								мТаблицаИндГрафики.Удалить(0); 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
					//Аверсон 09.09.2020 КВВ СВФР-006526 )
					
					Если мТаблицаИндГрафики.Количество()=0 Тогда 
						для Каждого стрИзм из ТЗГрафикРаботыИзменения Цикл
							ОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Сотрудник",стрИзм.График,стрСотрудник));
							Если ОбщиеГрафики.Количество()>0 Тогда 
								Для Каждого стрГрафик из ОбщиеГрафики Цикл 
									БылаКомандировкаВДате = Ложь;   //Аверсон 03.05.2021 КВВ СВФР-007537
									ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
									Если стрГрафик.Дата < ДатаПр Тогда 
										Продолжить;
									КонецЕсли;
									Если стрГрафик.Дата >= ДатаУв Тогда 
										Продолжить;
									КонецЕсли;
									
									//СВЭЙ 29.09.2023 КВВ СВФР-011538 (
									ЕстьСокращенныеДниВДате = Ложь; 
									Если ЕстьСокращенныеДниВМесяце Тогда
										ЕстьСокращенныеДниВДате = ПроизводительностьПовторноеИспользование.ПроверкаСокращенныхДнейВПериод(стрГрафик.Сотрудник,стрГрафик.Дата);
									КонецЕсли;
									//СВЭЙ 29.09.2023 КВВ СВФР-011538 )
									
									Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
										//О.Т. Аверсон 29.06.2016 № 
										ЗапросПеремещениеВременное = Новый Запрос;
										ЗапросПеремещениеВременное.Текст = 
										"ВЫБРАТЬ
										|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
										|	РаботникиОрганизацийСрезПоследних.Сотрудник
										|ИЗ
										|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
										|ГДЕ
										|	РаботникиОрганизацийСрезПоследних.Период <= &Дата";
										
										ЗапросПеремещениеВременное.УстановитьПараметр("Дата", КонецДня(стрГрафик.Дата));
										ЗапросПеремещениеВременное.УстановитьПараметр("Сотрудник", стрСотрудник);
										
										РезультатПеремещениеВр = ЗапросПеремещениеВременное.Выполнить().Выгрузить();
										Для Каждого стр из РезультатПеремещениеВр Цикл 
											ПодразделениеИзРегистра = стр.ПодразделениеОрганизации;
										КонецЦикла;
										
										ЗапросПодразд = Новый Запрос;
										ЗапросПодразд.Текст = 
										"ВЫБРАТЬ
										|	ПодразделенияОрганизаций.Ссылка
										|ИЗ
										|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
										|ГДЕ
										|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Ссылка)";
										
										ЗапросПодразд.УстановитьПараметр("Ссылка", ПодразделениеОрганизации);
										
										ТЗПодразделения = ЗапросПодразд.Выполнить().Выгрузить();
										Если ТЗПодразделения.НайтиСтроки(Новый Структура("Ссылка",ПодразделениеИзРегистра)).Количество()=0 Тогда  
											Продолжить;
										КонецЕсли;
									КонецЕсли;
									
									
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
									"ВЫБРАТЬ
									|	РегламентированныйПроизводственныйКалендарь.ВидДня
									|ИЗ
									|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
									|ГДЕ
									|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
									
									Запрос.УстановитьПараметр("ДатаКалендаря", стрГрафик.Дата);
									
									РезультатЗапроса1 = Запрос.Выполнить().Выбрать();
									Выходной = Ложь;
									ЕстьНевыход = Ложь;
									ЕстьКомандировка = Ложь;
									ЕстьПраздник = Ложь;
									ЕстьБЛ = Ложь;
									ЕстьПоУходу = Ложь;
									ЕстьОтп = Ложь;
									
									//Аверсон 18.01.2021 КВВ СВФР-007084 (
									Если (Организация.ИНН = "700067572" 
										ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
										ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
										ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
										И
										стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
										//стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
										стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени Тогда
									Иначе
										//Аверсон 18.01.2021 КВВ СВФР-007084 )
										Пока РезультатЗапроса1.Следующий() Цикл
											Если (РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота или РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье)
												и не ЗначениеЗаполнено(стрГрафик.ОсновноеЗначение) Тогда 
												Выходной = Истина;
												МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
												Если не МассивРезультатЗапроса.Количество()=0 Тогда
													Для Каждого стрНеявки из МассивРезультатЗапроса Цикл   
														//				ЕстьНевыход = Ложь;
														//ЕстьКомандировка = Ложь;
														//ЕстьПраздник = Ложь;
														//ЕстьБЛ = Ложь;
														//ЕстьПоУходу = Ложь;
														//ЕстьОтп = Ложь;
														
														МассивРезультатЗапроса = стрНеявки;
														Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда
														иначе 											
															Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда
																Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
																	ЕстьНевыход = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокКомандировка = 1 Тогда 
																	ЕстьКомандировка = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокБЛ = 1 Тогда 
																	ЕстьБЛ = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокПоУходу = 1 Тогда 
																	ЕстьПоУходу = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокОтпуска = 1 Тогда 
																	ЕстьОтп = Истина;
																КонецЕсли;
																
															КонецЕсли; 
														КонецЕсли;    											
													КонецЦикла;  										
												КонецЕсли;
												Если не (ЕстьНевыход или ЕстьКомандировка или ЕстьБЛ или ЕстьПоУходу или ЕстьОтп) Тогда 
													Прервать;
												КонецЕсли;
											ИначеЕсли РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
												ЕстьПраздник = Истина;
												КакаяБукваВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка(); //Аверсон 17.07.2019 КВВ СВФР-004535
												МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
												Если не МассивРезультатЗапроса.Количество()=0 Тогда
													Для Каждого стрНеявки из МассивРезультатЗапроса Цикл       											
														МассивРезультатЗапроса = стрНеявки;
														Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда
														иначе 											
															Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда
																КакаяБукваВремени = МассивРезультатЗапроса.БукваВидаВремени; //Аверсон 17.07.2019 КВВ СВФР-004535
																Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
																	ЕстьНевыход = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокКомандировка = 1 Тогда 
																	ЕстьКомандировка = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокБЛ = 1 Тогда 
																	ЕстьБЛ = Истина;
																ИначеЕсли МассивРезультатЗапроса.ДокПоУходу = 1 Тогда 
																	ЕстьПоУходу = Истина; 
																ИначеЕсли МассивРезультатЗапроса.ДокОтпуска = 1 Тогда 
																	//ЕстьОтп = Истина;
																КонецЕсли;
																
															КонецЕсли; 
														КонецЕсли;    											
													КонецЦикла;  
													
													//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) (
												Иначе //если нет неявок 
													Если стрГрафик.ОсновноеЗначение <> 0 И ИндексМассиваПриставок = 0 Тогда
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;  
														
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;  
														
														
														Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
														Если Ночч.Количество() > 0 Тогда
															ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
														КонецЕсли;
														
														ИндексМассиваПриставок = 0;
													КонецЕсли;
													//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) )
													
												КонецЕсли;
											КонецЕсли;
											
										КонецЦикла; 
									КонецЕсли;
									
									//Аверсон 22.01.2021 КВВ СВФР-007084 (
									Сменный = Ложь;
									Если (Организация.ИНН = "700067572" 
										ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
										ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
										ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
										И
										стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
										//	стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
										стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени И
										ОбщиеГрафики.Количество()>0 Тогда 
										Сменный = Истина;
									КонецЕсли;
									//Аверсон 22.01.2021 КВВ СВФР-007084 )
									
									МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник));
									Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) и МассивРезультатЗапроса.Количество()=0 
										И НЕ Сменный Тогда  //Аверсон 22.01.2021 КВВ СВФР-007084
										Продолжить;
									КонецЕсли;
									Если ЕстьПраздник Тогда 
										ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
										
										//Аверсон 17.07.2019 КВВ СВФР-004535 (
										Если КакаяБукваВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам;
										КонецЕсли;
										//Аверсон 17.07.2019 КВВ СВФР-004535 )
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
										Если не (ЕстьНевыход или ЕстьКомандировка или ЕстьБЛ или ЕстьПоУходу или ЕстьОтп) Тогда
											Продолжить;
										КонецЕсли;
									КонецЕсли;
									ЧасовСверхрУрПоПриказу = 0; //Аверсон 18.01.2021 КВВ СВФР-007084
									ЧасовНочныхПоПриказуВПраздник = 0; //ПСА 08.02.2021 СВФР-007152
									РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
									РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
									РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
									РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
									
									МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник)); 
									Если МассивРезультатЗапроса.Количество()=0 или стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда //ПСА 25.02.2021 СВФР-007248+++
										//Аверсон 18.01.2021 КВВ СВФР-007084 (
										СчитатьДальше = Истина; Сменный = Ложь;
										Если (Организация.ИНН = "700067572" 
											ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
											ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
											ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
											И
											стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
											//	стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
											стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени И
											ОбщиеГрафики.Количество()>0 Тогда 
											МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрГрафик.Дата,стрСотрудник));
											Если МассивОбщиеГрафики.Количество()>0 Тогда 
												Сменный = Истина;
												ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
												Если ЗначениеЧасов = 0 Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;    
										
										//Аверсон 24.05.2022 КВВ СВФР-009102 (
										НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
										Если НачалоМесяца(ДатаПр) = НачалоМесяца(стрГрафик.Дата) И ДатаПр <> НачалоМесяца(стрГрафик.Дата) Тогда
											//НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
											Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
												КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
												Если КакойДеньПереносим < ДатаПр Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
											КонецЕсли;	
										КонецЕсли;
										//Аверсон 24.05.2022 КВВ СВФР-009102 )
										
										//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (
										Если СчитатьДальше И НайденныеСтрокиПереноса.Количество() > 0 Тогда
											НаКакойДеньПереносим = НайденныеСтрокиПереноса[0].ВыходнойДень;
											КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
											Если НачалоМесяца(НаКакойДеньПереносим) = НачалоМесяца(ДатаПр) И НаКакойДеньПереносим >= ДатаПр И НаКакойДеньПереносим = стрГрафик.Дата 
												
												//Аверсон ЕАЕ 18.08.2025 СВФР-016459 (п.2)
												И НачалоМесяца(НаКакойДеньПереносим) <> НачалоМесяца(КакойДеньПереносим) Тогда
												//Аверсон СВФР-016459
												
												РезЗ_Перенос = ПроверкаДняНаКоторыйПереносим(стрСотрудник,НачалоДня(КакойДеньПереносим));
												Если РезЗ_Перенос.Количество() > 0 Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) )
										
										Если СчитатьДальше Тогда
											//Аверсон 18.01.2021 КВВ СВФР-007084 )	
											
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											
											//Аверсон 21.08.2020 КВВ СВФР-006439 (
											Если (НЕ ЕстьСокращенныеДниВМесяце 
												ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
												ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
											Иначе
												СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
												ЗначениеЧасов = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);    
											КонецЕсли;
											//Аверсон 21.08.2020 КВВ СВФР-006439 )
											
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
											//дексМассиваПриставок = ИндексМассиваПриставок + 1;
											
											//Аверсон 18.01.2021 КВВ СВФР-007084 (
											Если Сменный Тогда
												Пока РезультатЗапроса1.Следующий() Цикл
													Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
													КонецЕсли;
												КонецЦикла;
												
												Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
												Если Ночч.Количество() > 0 Тогда
													ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 18.01.2021 КВВ СВФР-007084 )
											
										КонецЕсли;
									иначе
										
										БукваВидаВремени = "";
										ЗначениеЧасов = "";
										ЗначЕстьВИнтервале = Ложь;
										ЭтоОтпуск = Ложь;
										ЕстьПредыдБЛ = Ложь;  //Аверсон 06.04.2020 КВВ СВФР-005776
										ЕстьПродлениеВОтзыве = Ложь; //Аверсон 14.04.2020 КВВ СВФР-005809
										ЧасовНочныхПоПриказуВПраздник = 0; //ПСА 08.02.2021 СВФР-007152
										РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
										ВДатеСокращенноеВремя = Ложь; //Аверсон 04.06.2021 КВВ СВФР-007642 
										//Аверсон 05.12.2019 КВВ СВФР-005153 (
										ЕстьОтзывИзОтпуска = Ложь;
										ЗОтзыв = Новый Запрос;
										ЗОтзыв.Текст = 
										"ВЫБРАТЬ
										|	СостояниеРаботниковОрганизаций.Регистратор, //Аверсон 14.04.2020 КВВ СВФР-005809
										|	СостояниеРаботниковОрганизаций.Состояние,
										|	СостояниеРаботниковОрганизаций.Период   //Аверсон 03.04.2020 КВВ СВФР-005776
										
										//Аверсон ЕАЕ 11.03.2021 СВФР-007311
										//|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаПроверки) КАК СостояниеРаботниковОрганизаций
										|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
										//Аверсон СВФР-007311
										
										|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
										|	И &ДатаПроверки МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ,-1), ДЕНЬ)
										|	И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска";
										
										//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) (
										Если Организация.ИНН = "700067572" Тогда
											ЗОтзыв.Текст = ЗОтзыв.Текст + "
											|	И СостояниеРаботниковОрганизаций.Регистратор.НомерБЛ = &Пустота"; 
										КонецЕсли;
										//Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1) )
										
										ЗОтзыв.Текст = ЗОтзыв.Текст + "
										|	И (СостояниеРаботниковОрганизаций.Регистратор.ОтражатьИзмененияПоПродлению //Аверсон 21.04.2021 КВВ СВФР-007454
										
										//Аверсон 17.08.2023 КВВ СВФР-011229 (
										|ИЛИ (СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Перенос)
										|ИЛИ СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Компенсация)))";
										//Аверсон 17.08.2023 КВВ СВФР-011229 )
										
										ЗОтзыв.УстановитьПараметр("ДатаПроверки", стрГрафик.Дата);
										ЗОтзыв.УстановитьПараметр("Сотрудник", стрСотрудник);
										ЗОтзыв.УстановитьПараметр("Пустота", ""); //Аверсон 01.08.2023 КВВ СВФР-011168 (пункт 1)
										РезультатОтзыв = ЗОтзыв.Выполнить().Выбрать();
										Пока РезультатОтзыв.Следующий() Цикл
											ЕстьОтзывИзОтпуска = Истина;
											//Аверсон 14.04.2020 КВВ СВФР-005809 (
											Если РезультатОтзыв.Регистратор.ОтражатьИзмененияПоПродлению И ЗначениеЗаполнено(РезультатОтзыв.Регистратор.ПродлениеС) И ЗначениеЗаполнено(РезультатОтзыв.Регистратор.ПродлениеПо) И
												((НачалоДня(стрГрафик.Дата) >= НачалоДня(РезультатОтзыв.Регистратор.ПродлениеС)) и (НачалоДня(стрГрафик.Дата) <= НачалоДня(РезультатОтзыв.Регистратор.ПродлениеПо))) Тогда
												ЕстьПродлениеВОтзыве = Истина;
												
												//Аверсон 17.08.2023 КВВ СВФР-011229 (
											ИначеЕсли ЕстьПродлениеВОтзыве 
												И (РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Перенос 
												ИЛИ РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация) Тогда
												ЕстьПродлениеВОтзыве = Ложь;
												//Аверсон 17.08.2023 КВВ СВФР-011229 )
												
											Иначе
												//Аверсон 14.04.2020 КВВ СВФР-005809 )
												//Аверсон 03.04.2020 КВВ СВФР-005776 (
												ЕстьПредыдБЛ = Ложь;
												ЗПредыдСост = Новый Запрос;
												ЗПредыдСост.Текст = 
												"	ВЫБРАТЬ
												|	СостояниеРаботниковОрганизаций.Состояние,
												|	СостояниеРаботниковОрганизаций.Регистратор
												|	ИЗ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаПроверки) КАК СостояниеРаботниковОрганизаций
												|	ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник";
												ЗПредыдСост.УстановитьПараметр("ДатаПроверки", НачалоДня(РезультатОтзыв.Период)-86400);
												ЗПредыдСост.УстановитьПараметр("Сотрудник", стрСотрудник);
												РезультатЗПредыдСост = ЗПредыдСост.Выполнить().Выбрать();
												Пока РезультатЗПредыдСост.Следующий() Цикл
													Если РезультатЗПредыдСост.Состояние = Перечисления.СостоянияРаботникаОрганизации.Заболевание Тогда
														ЕстьПредыдБЛ = Истина;
													КонецЕсли;
												КонецЦикла;
												Если НЕ ЕстьПредыдБЛ Тогда
													ЗПредыдСост.Текст =
													"ВЫБРАТЬ
													|СостояниеРаботниковОрганизаций.Состояние,
													|СостояниеРаботниковОрганизаций.Регистратор
													|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
													|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
													|И СостояниеРаботниковОрганизаций.Период = &ДатаПроверки //не исправлять, ниже изменение кода по поиску
													|И СостояниеРаботниковОрганизаций.Состояние = &СостояниеБЛ";
													ЗПредыдСост.УстановитьПараметр("ДатаПроверки", НачалоДня(РезультатОтзыв.Период));
													ЗПредыдСост.УстановитьПараметр("Сотрудник", стрСотрудник);
													ЗПредыдСост.УстановитьПараметр("СостояниеБЛ", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
													
													//СВЭЙ 11.04.2024 КВВ СВФР-012809 (
													Если РезультатОтзыв.Регистратор.ТипОтзыва = Перечисления.ТипыОтзываИзОтпуска.Компенсация 
														И НачалоДня(стрГрафик.Дата) >= НачалоДня(РезультатОтзыв.Период)
														И НачалоДня(стрГрафик.Дата) <= НачалоДня(РезультатОтзыв.Регистратор.ДатаОкончания) Тогда 
														ЗПредыдСост.Текст = СтрЗаменить(ЗПредыдСост.Текст," = &ДатаПроверки"," МЕЖДУ &ДатаПроверки И &ДатаПроверкиКон");
														ЗПредыдСост.Текст = ЗПредыдСост.Текст + "
														|И СостояниеРаботниковОрганизаций.Период <= &ТекДатаПроверки";
														ЗПредыдСост.УстановитьПараметр("ДатаПроверкиКон", КонецДня(РезультатОтзыв.Регистратор.ДатаОкончания));
														ЗПредыдСост.УстановитьПараметр("ТекДатаПроверки", НачалоДня(стрГрафик.Дата));
													КонецЕсли;
													//СВЭЙ 11.04.2024 КВВ СВФР-012809 )
													
													РезультатЗПредыдСост = ЗПредыдСост.Выполнить().Выбрать();
													Пока РезультатЗПредыдСост.Следующий() Цикл
														ЕстьПредыдБЛ = Истина;
													КонецЦикла;
												КонецЕсли;
												//Аверсон 03.04.2020 КВВ СВФР-005776 )
											КонецЕсли;
											Если Выходной И НЕ ЕстьПродлениеВОтзыве И НЕ ЕстьПредыдБЛ Тогда  //Аверсон 14.04.2020 КВВ СВФР-005809 ( условие на НЕ ЕстьПродлениеВОтзыве, НЕ ЕстьПредыдБЛ )
												БукваВидаВремени = "";
												ЗначениеЧасов = "";
											Иначе
												//Аверсон 03.04.2020 КВВ СВФР-005776 (
												Если ЕстьПредыдБЛ Тогда
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
													//Аверсон 03.04.2020 КВВ СВФР-005776 )
													//Аверсон 14.04.2020 КВВ СВФР-005809 (
												ИначеЕсли ЕстьПродлениеВОтзыве Тогда
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск;
													//Аверсон 14.04.2020 КВВ СВФР-005809 )
												Иначе	
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												КонецЕсли; 
												ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
											КонецЕсли;											
										КонецЦикла;
										//Аверсон 05.12.2019 КВВ СВФР-005153 )
										
										Для Каждого стрНеявки из МассивРезультатЗапроса Цикл 
											МассивРезультатЗапроса = стрНеявки;
											
											Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
												БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
											иначе 
												Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда 
													//Аверсон 05.12.2019 КВВ СВФР-005153 (
													
													//Аверсон 21.04.2021 КВВ СВФР-007454 (
													Если ЕстьОтзывИзОтпуска Тогда
														////Аверсон ЕАЕ 11.03.2021 СВФР-007311
														////Если ЕстьОтзывИзОтпуска Тогда
														//Если МассивРезультатЗапроса.ДокОтпуска = 1 И МассивРезультатЗапроса.ДокОтзыв = 1 И ЕстьОтзывИзОтпуска Тогда 
														////Аверсон СВФР-007311
														//Аверсон 21.04.2021 КВВ СВФР-007454 )
														
														//Аверсон ЕАЕ 10.10.2024 СВФР-013739
														Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования ИЛИ 
															
															//Аверсон ЕАЕ 05.12.2024 СВФР-014326
															МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя ИЛИ
															//Аверсон СВФР-014326
															
															//Аверсон ЕАЕ 17.12.2025 СВФР-017589
															МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПрохождениеДиспансеризации Тогда
															//Аверсон СВФР-017589

															
															БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
															Прервать;
														КонецЕсли;
														//Аверсон СВФР-013739
														
														//Аверсон ЕАЕ 04.11.2024 СВФР-013897
														//Посчитаем сверхурочные
														ЧасовСверхрУрПоПриказу = 0;
														РаботаСверхурочныеКакЯвка = Ложь; 
														РаботаСверхурочныеКакКомандировка = Ложь; 
														РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; 
														РаботаВПраздникКакЯвка = Ложь; 
														РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; 
														Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
															ЗСверхУ = Новый Запрос;
															ЗСверхУ.Текст = "ВЫБРАТЬ 
															|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
															|ТЧДок.ОплачиватьВОдинарномРазмере
															|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
															|ГДЕ
															|ТЧДок.Ссылка.Проведен
															|И ТЧДок.Сотрудник = &Сотрудник
															|И ТЧДок.Дата = &Дата
															|СГРУППИРОВАТЬ ПО 
															|ТЧДок.ОплачиватьВОдинарномРазмере
															|";
															ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
															ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
															РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
															Если РезЗСверхУ.Количество() > 0 Тогда
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															КонецЕсли;
														КонецЕсли;
														//Аверсон СВФР-013897
														
														Продолжить;
													КонецЕсли;
													//Аверсон 05.12.2019 КВВ СВФР-005153 )
													
													Если ЗначЕстьВИнтервале Тогда
														//Если не ЭтоОтпуск Тогда 
														//	Продолжить;
														//КонецЕсли;
														Если не МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты Тогда 
															если не ЭтоОтпуск Тогда 
																//Аверсон 05.12.2019 КВВ СВФР-005153 (
																Если (МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя //Аверсон 11.05.2020 КВВ СВФР-005970
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя  //Аверсон 28.02.2021 КВВ СВФР-007260
																	//Аверсон 22.03.2021 КВВ СВФР-007331 (
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция
																	//Аверсон 22.03.2021 КВВ СВФР-007331 )
																	или МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение) 
																	И  (БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа) Тогда
																	БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	
																	//Аверсон ЕАЕ 11.03.2021 СВФР-007311
																	Продолжить;
																	//Аверсон СВФР-007311
																КонецЕсли;
																//Аверсон 05.12.2019 КВВ СВФР-005153 )
																
																//Аверсон ЕАЕ 11.03.2021 СВФР-007311
																//Продолжить;
																//Аверсон СВФР-007311
															КонецЕсли;
															
														КонецЕсли;												
													КонецЕсли;
													
													//Аверсон 26.05.2021 КВВ СВФР-007567 (
													Если ЗначениеЗаполнено(БукваВидаВремени) 
														И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь 
														И (МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
														ИЛИ МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск) Тогда
														Продолжить;
													КонецЕсли;
													//Аверсон 26.05.2021 КВВ СВФР-007567 )
													
													БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
													ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
													
													//Аверсон 03.05.2021 КВВ СВФР-007537 (
													Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
														БылаКомандировкаВДате = Истина;
													КонецЕсли;
													Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И БылаКомандировкаВДате Тогда
														Продолжить;
													КонецЕсли;
													//Аверсон 03.05.2021 КВВ СВФР-007537 )
													
													//Аверсон 28.01.2021 КВВ СВФР-007084 (
													ЧасовСверхрУрПоПриказу = 0; 
													//ПСА 12.02.2021 СВФР-007197+++
													РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
													РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
													РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413 
													РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
													РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; //Аверсон 03.06.2021 КВВ СВФР-007334
													
													//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
													Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
														или БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
														//+++ПСА 12.02.2021 СВФР-007197	
														ЗСверхУ = Новый Запрос;
														ЗСверхУ.Текст = "ВЫБРАТЬ 
														|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
														|ТЧДок.ОплачиватьВОдинарномРазмере,
														
														//Аверсон ЕАЕ 10.09.2025 СВФР-016610
														|	ТЧДок.ЯвкаВТабель
														//Аверсон СВФР-016610
														
														|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
														|ГДЕ
														|ТЧДок.Ссылка.Проведен
														|И ТЧДок.Сотрудник = &Сотрудник
														|И ТЧДок.Дата = &Дата
														|СГРУППИРОВАТЬ ПО 
														|ТЧДок.ОплачиватьВОдинарномРазмере,
														
														//Аверсон ЕАЕ 10.09.2025 СВФР-016610
														|	ТЧДок.ЯвкаВТабель
														//Аверсон СВФР-016610
														
														|";
														ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
														ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
														РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
														Если РезЗСверхУ.Количество() > 0 Тогда
															Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда //ПСА 12.02.2021 СВФР-007197+++
																//ПСА 12.03.2021+++
																Если БылаКомандировка(стрСотрудник,стрГрафик.Дата) Тогда
																	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																Иначе
																	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																КонецЕсли;	
																//+++ПСА 12.03.2021
																
																//Аверсон ЕАЕ 02.04.2021 СВФР-007413
																//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																Если Организация.ИНН = "700067572" Тогда
																	//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 4)
																	Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																		РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																		ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
																	Иначе
																		//Аверсон 02.07.2021 КВВ СВФР-007801 )
																		//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
																		Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																			РаботаСверхурочныеВКомандировкеКакЯвка = Истина;
																		КонецЕсли;
																		ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																		ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																		
																		//Аверсон СВФР-007413
																	КонецЕсли;
																	
																//Аверсон ЕАЕ 10.09.2025 СВФР-016610
																//Бобруйскводоканал
																ИначеЕсли Организация.ИНН = "790041382" Тогда
																	Если РезЗСверхУ[0].ЯвкаВТабель И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																		//РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																		ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
																		ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																	Иначе
																		ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																		ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																	КонецЕсли;	
																//Аверсон СВФР-016610	
																	
																Иначе
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																КонецЕсли;
																
																//ПСА 12.02.2021 СВФР-007197+++	
																//ПСА 05.03.2021 СВФР-007298+++      
																Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
																	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) Тогда
																	//ПСА 12.03.2021+++
																	//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка и ПодразделениеТранспортногоЦеха() Тогда
																	//	РаботаСверхурочныеКакКомандировка = Истина;
																	//Иначе
																	//	РаботаСверхурочныеКакЯвка = Истина;
																	//КонецЕсли;
																	Если ПодразделениеТранспортногоЦеха() Тогда
																		РаботаСверхурочныеКакЯвка = Ложь;
																	Иначе
																		РаботаСверхурочныеКакЯвка = Истина;
																	КонецЕсли;
																	//+++ПСА 12.03.2021
																КонецЕсли;	
																//+++ПСА 05.03.2021 СВФР-007298
																
															Иначе
																//Аверсон ЕАЕ 02.04.2021 СВФР-007413
																//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																Если Организация.ИНН = "700067572" Тогда
																	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																	//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																	//Аверсон СВФР-007413
																	
																	//Аверсон 03.06.2021 КВВ СВФР-007334 (
																	Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																		РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																	КонецЕсли;
																	//Аверсон 03.06.2021 КВВ СВФР-007334 )
																Иначе
																	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																	ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																	ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																КонецЕсли;
																//ПСА 11.03.2021 СВФР-007321+++      
																//Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
																//	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) и ПодразделениеТранспортногоЦеха() Тогда
																//	РаботаСверхурочныеКакКомандировка = Истина;
																//КонецЕсли;	
																//+++ПСА 11.03.2021 СВФР-007321
																
															КонецЕсли;
															//+++ПСА 12.02.2021 СВФР-007197	
														КонецЕсли;	
													КонецЕсли;
													//Аверсон 28.01.2021 КВВ СВФР-007084 )
													
													Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);	
														ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															//ПСА 08.02.2021 СВФР-007152+++
															ПоискНочныхВПраздничныйДень = Ложь;
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
																ПоискНочныхВПраздничныйДень = Истина;
															КонецЕсли;
															//+++ПСА 08.02.2021 СВФР-007152
															
															//ПСА 26.02.2021 СВФР-007248+++
															ПоискЯвкиВПразники = Ложь;
															//Аверсон 09.04.2021 КВВ СВФР-007434 (
															Если НЕ (Организация.ИНН = "700067572") Тогда
																ПоискЯвкиВПразники = Истина;
															Иначе
																//Аверсон 09.04.2021 КВВ СВФР-007434 )
																Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
																	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,МассивРезультатЗапроса.ДатаНачала) Тогда
																	ПоискЯвкиВПразники = Истина;
																КонецЕсли;
															КонецЕсли;
															//+++ПСА 26.02.2021 СВФР-007248
															
															для Каждого стр из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																Если стр.Сотрудник = стрСотрудник и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала) Тогда
																	Если ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																		БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		ЗначениеЧасов = стр.ОтработаноЧасов;  
																	ИначеЕсли не стр.Доплачивать и не ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																		БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		ЗначениеЧасов = стр.ОтработаноЧасов;
																	ИначеЕсли стр.Доплачивать и ЗначениеЗаполнено(стр.ДатаВыхода) Тогда 
																		ЗначениеЧасов = стр.ОтработаноЧасов;
																		//Аверсон 03.01.2020 КВВ СВФР-005271 (
																		Если Стр.ЯвкаВТабель И (НачалоДня(МассивРезультатЗапроса.ДатаНачала) = НачалоДня(стр.ДатаВыхода)) Тогда
																			НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
																			СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
																			НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
																			СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
																			
																			ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
																			
																			БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			ЗначениеЧасов = стр.ОтработаноЧасов;
																		КонецЕсли;
																		//Аверсон 03.01.2020 КВВ СВФР-005271 )
																	КонецЕсли;
																	//ПСА 08.02.2021 СВФР-007152+++
																	Если ПоискНочныхВПраздничныйДень и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала) Тогда
																		ЧасовНочныхПоПриказуВПраздник = стр.ОтработаноНочныхЧасов;
																	КонецЕсли;
																	//+++ПСА 08.02.2021 СВФР-007152
																	//ПСА 26.02.2021 СВФР-007248+++
																	Если ПоискЯвкиВПразники Тогда
																		Если стр.Доплачивать и стр.ЯвкаВТабель Тогда
																			РаботаВПраздникКакЯвка = Истина;
																		КонецЕсли;	
																	КонецЕсли;
																	//+++ПСА 26.02.2021 СВФР-007248
																КонецЕсли;
															КонецЦикла;
															
														КонецЦикла;
														
														
													КонецЕсли;
													Если МассивРезультатЗапроса.ДокКомандировка = 1 Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);	
														ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															для Каждого стр из РезультатСост.Регистратор.ПереносДней Цикл
																Если стр.Сотрудник = стрСотрудник и стр.ДатаС = НачалоДня(стрГрафик.Дата) Тогда
																	МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стр.ДатаНаКакую,стрСотрудник));
																	Если МассивОбщиеГрафики.Количество()>0 Тогда 
																		ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
																	КонецЕсли;                
																	МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стрГрафик.Дата)));
																	Если МассивТЗДниКомандировок.Количество()=0 Тогда 
																		СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																		СтрТЗДниКомандировок.ДатаС = НачалоДня(стрГрафик.Дата);
																		СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																		СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																		СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
																	КонецЕсли;
																	//ПСА 09.02.2021 СВФР-007152 +++	
																ИначеЕсли стр.Сотрудник = стрСотрудник Тогда
																	МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стр.ДатаС,стрСотрудник));
																	Если МассивОбщиеГрафики.Количество() = 0 Тогда
																		МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стр.ДатаС)));
																		Если МассивТЗДниКомандировок.Количество()=0 Тогда
																			СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																			СтрТЗДниКомандировок.ДатаС = НачалоДня(стр.ДатаС);
																			СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																			СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																			СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
																		КонецЕсли;
																	КонецЕсли;	
																	//+++ПСА 09.02.2021 СВФР-007152	
																КонецЕсли;
																
															КонецЦикла;
															
														КонецЦикла; 
													КонецЕсли;
													Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
														ЭтоОтпуск = Истина;
													иначе
														ЭтоОтпуск = Ложь;
													КонецЕсли;
													
													ЗначЕстьВИнтервале = Истина;
													
													
													//Прервать; //брать последнее всегда значение, которое входит. БЛ бует всегда после отпуска
												иначе
													Если ((Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка)) ИЛИ ЕстьПредыдБЛ ИЛИ ЕстьПродлениеВОтзыве Тогда //Аверсон 06.04.2020 КВВ СВФР-005776 (ЕстьПредыдБЛ)  //Аверсон 14.04.2020 КВВ СВФР-005809 (ЕстьПродлениеВОтзыве) 
														Продолжить;
													КонецЕсли;
													Если не ЗначЕстьВИнтервале Тогда 
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														//ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														//Аверсон 21.08.2020 КВВ СВФР-006439 (
														Если (НЕ ЕстьСокращенныеДниВМесяце 
															ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
														Иначе
															СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
															ЗначениеЧасов = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);  
															//Аверсон 04.06.2021 КВВ СВФР-007642 (
															ВДатеСокращенноеВремя = ?(СокращЧасы=0,Ложь,Истина); 
															Если ВДатеСокращенноеВремя Тогда
																Пока РезультатЗапроса1.Следующий() Цикл
																	Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
																		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
																		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
																		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
																	КонецЕсли;
																КонецЦикла;
															КонецЕсли;
															//Аверсон 04.06.2021 КВВ СВФР-007642 )
															
														КонецЕсли;
														//Аверсон 21.08.2020 КВВ СВФР-006439 )
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
										КонецЦикла;
										
										//Аверсон 03.05.2021 КВВ СВФР-007537 ( 
										Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа И БылаКомандировкаВДате Тогда
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
											ИндексМассиваПриставок = 0; //Аверсон 08.05.2023 КВВ СВФР-010813
											Продолжить;
										КонецЕсли;
										//Аверсон 03.05.2021 КВВ СВФР-007537 )
										
										Если БукваВидаВремени="" Тогда 
											Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) Тогда 
												Продолжить;
											КонецЕсли;
											БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
										КонецЕсли;
										
										//Аверсон 01.11.2019 КВВ СВФР-004896 (
										Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДень Тогда
											ЗапросСвДн = Новый Запрос;
											ЗапросСвДн.Текст = 
											"ВЫБРАТЬ
											|ДокСвобДня.Сотрудник,
											|ДокСвобДня.НеоплачиваемыйДень КАК НеоплачиваемыйДень //Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2)
											|ИЗ Документ.ПредоставлениеСвободногоОтРаботыДня.РаботникиОрганизации КАК ДокСвобДня
											|ГДЕ ДокСвобДня.Сотрудник = &Сотрудник
											|И ДокСвобДня.Дата = &ДатаПроверки
											//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) (
											|И (ДокСвобДня.НеоплачиваемыйДень = ИСТИНА
											|ИЛИ
											//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) )
											|(ДокСвобДня.ПериодПредоставленияСвобДня = ЗНАЧЕНИЕ(Перечисление.ПериодПредоставленияСвободногоДня.ДеньВМесяц) 
											|И ДокСвобДня.СоставСемьи = ЗНАЧЕНИЕ(Перечисление.СоставСемьиДляСвободногоДня.РебенокИнвалид)))";
											ЗапросСвДн.УстановитьПараметр("ДатаПроверки", стрГрафик.Дата);
											ЗапросСвДн.УстановитьПараметр("Сотрудник", стрСотрудник);      
											
											РезультатСвДн = ЗапросСвДн.Выполнить().Выгрузить();
											Если РезультатСвДн.Количество() > 0 Тогда
												//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) (
												Если РезультатСвДн[0].НеоплачиваемыйДень = ИСТИНА Тогда
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДеньМатери;
												Иначе 
													//Аверсон 26.12.2021 КВВ СВФР-008495 (пункт 3.2) )
													БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.СвободныйОтРаботыДеньРебИнвалид;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 01.11.2019 КВВ СВФР-004896 )
										
										//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
										ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
										СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, ЗначениеЧасов );
										ЭтоИндивидГрафик = ?(ТипЗнч(стрГрафик.Документ) = Тип("ДокументСсылка.ВводИндивидуальныхГрафиковРаботыОрганизации"),Истина,Ложь); //Аверсон 08.06.2023 КВВ СВФР-010920
										БукваЧасы = ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки, ЭтоИндивидГрафик  ); //Аверсон 08.06.2023 КВВ СВФР-010920
										БукваВидаВремени = БукваЧасы.Буква;
										ЗначениеЧасов = БукваЧасы.Часы;
										//- СВЭЙ КДЯ 19.11.19 СВФР-004908
										
										//Аверсон 18.01.2021 КВВ СВФР-007084 (
										СчитатьДальше = Истина;  Сменный = Ложь;
										Если (Организация.ИНН = "700067572" 
											ИЛИ Организация.ИНН = "100422074" //СВЭЙ 11.03.2024 КВВ СВФР-012504
											ИЛИ Организация.ИНН = "192240370" //СВЭЙ 19.09.2023 КВВ СВФР-011481
											ИЛИ Организация.ИНН = "100194961") //Аверсон 09.12.2022 КВВ СВФР-009983
											И
											стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный И
											//стрГрафик.ГрафикРаботы.ВыходныеПоСкользящемуГрафику И
											стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени И
											ОбщиеГрафики.Количество()>0 И
											НЕ ВДатеСокращенноеВремя И //Аверсон 04.06.2021 КВВ СВФР-007642
											БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа	Тогда 
											Сменный = Истина;
											МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрГрафик.Дата,стрСотрудник));
											Если МассивОбщиеГрафики.Количество()>0 Тогда 
												ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
												Если ЗначениеЧасов = 0 Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;    
										
										//Аверсон 24.05.2022 КВВ СВФР-009102 (
										НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
										Если НачалоМесяца(ДатаПр) = НачалоМесяца(стрГрафик.Дата) И ДатаПр <> НачалоМесяца(стрГрафик.Дата) Тогда
											//НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("ВыходнойДень", стрГрафик.Дата));
											Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
												КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
												Если КакойДеньПереносим < ДатаПр Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
											КонецЕсли;	
										КонецЕсли;
										//Аверсон 24.05.2022 КВВ СВФР-009102 )
										
										//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (
										Если СчитатьДальше И НайденныеСтрокиПереноса.Количество() > 0 Тогда
											НаКакойДеньПереносим = НайденныеСтрокиПереноса[0].ВыходнойДень;
											КакойДеньПереносим = НайденныеСтрокиПереноса[0].РабочийДень;
											Если НачалоМесяца(НаКакойДеньПереносим) = НачалоМесяца(ДатаПр) И НаКакойДеньПереносим >= ДатаПр И НаКакойДеньПереносим = стрГрафик.Дата Тогда
												РезЗ_Перенос = ПроверкаДняНаКоторыйПереносим(стрСотрудник,НачалоДня(КакойДеньПереносим));
												Если РезЗ_Перенос.Количество() > 0 Тогда
													СчитатьДальше = Ложь;
												КонецЕсли;
												
												//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) (
												Если СчитатьДальше 
													И НачалоМесяца(КакойДеньПереносим) <> НачалоМесяца(НаКакойДеньПереносим) 
													И НЕ ЗначениеЗаполнено(БукваВидаВремени) Тогда
													Если (НЕ ЕстьСокращенныеДниВМесяце 
														ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
														ЗначениеЧасов_ = стрГрафик.ОсновноеЗначение;
													Иначе
														СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата); 
														ЗначениеЧасов_ = ?(СокращЧасы=0,стрГрафик.ОсновноеЗначение,СокращЧасы);    
													КонецЕсли;
													Если ЗначениеЧасов_ <> 0 Тогда
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														ЗначениеЧасов = ЗначениеЧасов_;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 3) )
												
											КонецЕсли;
										КонецЕсли;
										//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) )
										
										Если СчитатьДальше Тогда
											//Аверсон 18.01.2021 КВВ СВФР-007084 )
											
											//Аверсон 30.06.2021 КВВ СВФР-007774 (
											Если ТЗ_Неявки <> Неопределено И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности Тогда    
												Для Каждого СтрСС Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник )) Цикл
													Если (СтрСС.ДатаНачала <= стрГрафик.Дата И стрГрафик.Дата <= СтрСС.ДатаОкончания) 
														И СтрСС.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь
														И СтрСС.ДокБЛ = 1 Тогда
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
											//Аверсон 30.06.2021 КВВ СВФР-007774 )
											
											//Аверсон 25.06.2021 КВВ СВФР-007774 (
											Если (НЕ ЕстьСокращенныеДниВМесяце 
												ИЛИ (ЕстьСокращенныеДниВМесяце И НЕ ЕстьСокращенныеДниВДате)) //СВЭЙ 29.09.2023 КВВ СВФР-011538
												И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
												И ТЗ_Неявки <> Неопределено Тогда    
												
												Для каждого СтрСС Из ТЗ_Неявки.НайтиСтроки( Новый Структура( "Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник )) Цикл
													Если (СтрСС.ДатаНачала <= стрГрафик.Дата И стрГрафик.Дата <= СтрСС.ДатаОкончания) 
														И СтрСС.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
														И СтрСС.ДокКомандировка = 1 Тогда
														БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
														
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
											//Аверсон 25.06.2021 КВВ СВФР-007774 )
											
											
											//Аверсон 04.06.2021 КВВ СВФР-007642  (
											Если ЕстьСокращенныеДниВМесяце 
												И ЕстьСокращенныеДниВДате Тогда //СВЭЙ 29.09.2023 КВВ СВФР-011538
												СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(стрГрафик.Сотрудник,стрГрафик.Дата);
												Если СокращЧасы <> 0 Тогда 
													ЗначениеЧасов = СокращЧасы;
													Пока РезультатЗапроса1.Следующий() Цикл
														Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
															НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+ 1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
														КонецЕсли;
													КонецЦикла;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 04.06.2021 КВВ СВФР-007642 )
											
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											
											//Аверсон 16.12.2022 КВВ СВФР-010038 (пункт 2) (
											Если Организация.ИНН = "100194961" 
												И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
												И ЧасовСверхрУрПоПриказу <> 0 
												И стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
												ЗначениеЧасов = ЗначениеЧасов + ЧасовСверхрУрПоПриказу;
											КонецЕсли;
											//Аверсон 16.12.2022 КВВ СВФР-010038 (пункт 2) )
											
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
											
											//Аверсон 18.01.2021 КВВ СВФР-007084 ( 
											Если ЧасовСверхрУрПоПриказу <> 0 и стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам Тогда //ПСА 25.02.2021 СВФР-007248+++
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												//Аверсон 03.06.2021 КВВ СВФР-007334 (
												Если РаботаВМЕСТОСверхурочныеКакЯвка Тогда
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												Иначе
													//Аверсон 03.06.2021 КВВ СВФР-007334 )
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
												КонецЕсли;
												
												//Аверсон ЕАЕ 02.04.2021 СВФР-007413
												Если РаботаСверхурочныеВКомандировкеКакЯвка Тогда
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												КонецЕсли;
												//Аверсон СВФР-007413
												
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
												//ПСА 05.03.2021 СВФР-007298+++  
												Если РаботаСверхурочныеКакЯвка Тогда
													Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
														НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
														НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
														НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													Иначе
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
													КонецЕсли;	
												КонецЕсли;	
												//+++ПСА 05.03.2021 СВФР-007298
												//ПСА 11.03.2021 СВФР-007321+++  
												Если РаботаСверхурочныеКакКомандировка Тогда
													Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
														НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
														НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
														НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
													Иначе
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
													КонецЕсли;	
												КонецЕсли;	
												//+++ПСА 11.03.2021 СВФР-007321												
											КонецЕсли;
											//Аверсон 18.01.2021 КВВ СВФР-007084 )
											
											//ПСА 08.02.2021 СВФР-007152 +++
											Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
												Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
													ИндексМассиваПриставок = 2;	
												Иначе
													ИндексМассиваПриставок = 1;	
												КонецЕсли;	
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
												ЧасовНочныхПоПриказуВПраздник = 0;
											КонецЕсли;
											//+++ПСА 08.02.2021 СВФР-007152
											//ПСА 26.02.2021 СВФР-007248+++
											Если РаботаВПраздникКакЯвка Тогда
												Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
													ИндексМассиваПриставок = 2;	
												Иначе
													ИндексМассиваПриставок = 1;	
												КонецЕсли;	
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
												РаботаВПраздникКакЯвка = Ложь;
											КонецЕсли;	
											//+++ПСА 26.02.2021 СВФР-007248
											
											//Аверсон 18.01.2021 КВВ СВФР-007084 (
											Если Сменный Тогда    
												Пока РезультатЗапроса1.Следующий() Цикл
													Если РезультатЗапроса1.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
													КонецЕсли;
												КонецЦикла;
												
												Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата);	
												Если Ночч.Количество() > 0 Тогда
													Если ИндексМассиваПриставок + 1 < 3 Тогда //СВЭЙ 11.03.2024 КВВ СВФР-012504
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 18.01.2021 КВВ СВФР-007084 )
											
											
										КонецЕсли;
										//МассивРезультатЗапроса = МассивРезультатЗапроса[0];
										//Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
										//	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										//	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
										//иначе                    										
										//	Если стрГрафик.Дата >= МассивРезультатЗапроса.ДатаНачала и стрГрафик.Дата <= МассивРезультатЗапроса.ДатаОкончания Тогда 
										//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = МассивРезультатЗапроса.БукваВидаВремени;
										//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
										//	иначе
										//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;  											
										//	КонецЕсли;
										//КонецЕсли;
										
										
										
									КонецЕсли;
									
									Если (Выходной или ЕстьПраздник) и не (ЕстьНевыход или ЕстьКомандировка) Тогда 
										Продолжить;
									КонецЕсли;
									
									ЗапросПереносКоманд = Новый Запрос;
									ЗапросПереносКоманд.Текст = 
									"ВЫБРАТЬ
									|	ПереносДнейКомандировок.Сотрудник
									|ИЗ
									|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
									|ГДЕ
									|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
									|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
									
									ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", стрГрафик.Дата);
									ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", стрСотрудник);
									
									РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
									
									Пока РезультатПереносКоманд.Следующий() Цикл
										ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0; 
									КонецЦикла;
									
									//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) (
									Если стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам И ИндексМассиваПриставок < 2 Тогда
										Ночч = ПроверкаНочныхВСменном(стрГрафик.ГрафикРаботы,стрГрафик.Дата); 
										Если Ночч.Количество() > 0 Тогда   
											НазваниеЯчейкиВБазе0 = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											НазваниеЯчейкиВБазе1 = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											
											//СВЭЙ 24.06.2024 КВВ СВФР-013142 (
											ДальшеПоВидуВремени = Истина;
											
											Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0]) Тогда 
												ВВР1 = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0];
												НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(ВВР1);
												Если НайдЭл <> Неопределено Тогда
													ДальшеПоВидуВремени = Ложь;	
												КонецЕсли; 
												
												Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1]) Тогда 
													ВВР2 = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1];
													НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(ВВР2);
													Если НайдЭл <> Неопределено Тогда
														ДальшеПоВидуВремени = Ложь;	
													КонецЕсли;
												КонецЕсли;  
											ИначеЕсли  НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0]) 
												И НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1]) 
												И ЗначениеЗаполнено(БукваВидаВремени) Тогда
												НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(БукваВидаВремени);
												Если НайдЭл <> Неопределено Тогда
													ДальшеПоВидуВремени = Ложь;	
												КонецЕсли;
												
											КонецЕсли;		
											
											Если ДальшеПоВидуВремени Тогда  
												//СВЭЙ 24.06.2024 КВВ СВФР-013142 )
												
												Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] <> Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы
													И СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе1] <> Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы
													Тогда    
													Если ИндексМассиваПриставок = 0 
														И СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() Тогда
													Иначе
														ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
													КонецЕсли;
													
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Ночч[0].ОсновноеЗначение;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли; 
									КонецЕсли; 
									//СВЭЙ 21.03.2024 КВВ СВФР-012526 (пункт 2) )
									
									ИндексМассиваПриставок = 0; //Аверсон 07.10.2020 КВВ СВФР-006669
								КонецЦикла;
								Для Каждого стрКоманд из ТЗДниКомандировок Цикл 
									
									Если НачалоМесяца(стрКоманд.ДатаНаКакую) = ПериодРегистрации Тогда
										Если ЗначениеЗаполнено(стрКоманд.ДатаНаКакую) Тогда
											ИндексЯчейкиВТаблице = День(стрКоманд.ДатаНаКакую);
											
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;     
										КонецЕсли;  
									КонецЕсли;
									Если НачалоМесяца(стрКоманд.ДатаС) = ПериодРегистрации Тогда
										Если НачалоМесяца(стрКоманд.ДатаС) = ПериодРегистрации Тогда
											ИндексЯчейкиВТаблице = День(стрКоманд.ДатаС);
											ПоискРаботыВПраздник = Ложь;
											Если стрКоманд.Доплачивать Тогда 
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
												ПоискРаботыВПраздник = Истина;
											КонецЕсли;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
											Если ПоискРаботыВПраздник Тогда
												//ПСА 27.04.2021 СВФР-007513 +++
												ЕстьРаботаВПраздник = Ложь;
												Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
													Если Стр.ДокПраздничный = 1 и НачалоДня(Стр.ДатаНачала) = стрКоманд.ДатаС Тогда 
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															//ПСА 27.04.2021 СВФР-007513 +++
															//Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ЕстьРаботаВПраздник = Истина;
																//+++ПСА 27.04.2021 СВФР-007513	
																НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
															КонецЕсли;
														КонецЦикла;	
													КонецЕсли;
												КонецЦикла;
												//ПСА 27.04.2021 СВФР-007513 +++
												Если Не ЕстьРаботаВПраздник И НЕ Организация.ИНН = "700067572" Тогда //Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 3) (внесено унп Бобруйска)
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
												КонецЕсли;	
												//+++ПСА 27.04.2021 СВФР-007513
											КонецЕсли;
										КонецЕсли;	
									КонецЕсли;
									
								КонецЦикла;
								
							КонецЕсли;
						КонецЦикла;
						//ПСА 16.02.2021 СВФР-007197 +++
						//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
						Если ТЗ_Неявки <> Неопределено Тогда
							//Аверсон 26.05.2021 КВВ СВФР-007334 (
							ТЗНеявокПоСотр = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)); 
							//Если Организация.ИНН = "700067572" Тогда //СВЭЙ 30.07.2024 КВВ СВФР-013315 (закомментировано)
								ТЗНеявокПоСотр1 = ТЗНеявокПоСотр;
								Если ТЗНеявокПоСотр1.Количество() > 1 Тогда
									ВсегоКолвоТЗНеявокПоСотр = ТЗНеявокПоСотр1.Количество();
									Счч = 0;
									Для Каждого СтрТЗНеявокПоСотр ИЗ ТЗНеявокПоСотр1 Цикл
										Счч = Счч + 1;
										Если Счч <> ВсегоКолвоТЗНеявокПоСотр Тогда
											Если ТЗНеявокПоСотр[Счч].ДатаНачала > СтрТЗНеявокПоСотр.ДатаНачала И
												НачалоДня(ТЗНеявокПоСотр[Счч].ДатаНачала) < НачалоДня(СтрТЗНеявокПоСотр.ДатаОкончания) Тогда
												Если НЕ (СтрТЗНеявокПоСотр.ДокБЛ = 1 И ТЗНеявокПоСотр[Счч].ДокОтзыв = 1 И ТЗНеявокПоСотр[Счч].ДокОтпуска = 1) //Аверсон 12.08.2021 КВВ СВФР-007942 (пункт 10)
													И ТЗНеявокПоСотр[Счч].ДокПраздничный = 0 //Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2)
													И СтрТЗНеявокПоСотр.ДокОтзывПеренос = 0 Тогда //Аверсон 31.08.2021 КВВ СВФР-008054 (пункт 3)
													СтрТЗНеявокПоСотр.ДатаОкончания = ТЗНеявокПоСотр[Счч].ДатаНачала-1;  
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							//КонецЕсли;
							
							Для Каждого Стр Из ТЗНеявокПоСотр Цикл
								//Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
								//Аверсон 26.05.2021 КВВ СВФР-007334 )
								
								Если Стр.ДатаНачала <= Стр.ДатаОкончания Тогда
									
									//Аверсон 02.10.2020 КВВ СВФР-006634 (
									ДатаВИндГрафике = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,Стр.ДатаНачала));
									Если (Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
										ИЛИ Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) //Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2)
										И ДатаВИндГрафике.Количество() = 0 
										И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
										
										//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) (
										Продолжать = Истина;
										ТЗНеявокПоСотрПроверка = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник,БукваВидаВремени,ДокОтпуска,ДокОтзыв,ДокОтзывПеренос", стрСотрудник,Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск,1,1,1));
										Если ТЗНеявокПоСотрПроверка.Количество() > 0 Тогда
											Для Каждого СтрТЗНеявокПоСотрПроверка ИЗ ТЗНеявокПоСотрПроверка Цикл
												Если НачалоДня(Стр.ДатаНачала) >= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаНачала) И НачалоДня(Стр.ДатаНачала) <= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаОкончания) Тогда
													СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Стр.БукваВидаВремени;
													
													//Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2) (
													Если Стр.ДокПраздничный = 1 и Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																
																НайденноеЗначение_ = РезультатСост.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																		ЗнЧ = ЭлМасс.ОтработаноЧасов;
																		Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + День(Стр.ДатаНачала)] = ЗнЧ;
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + День(Стр.ДатаНачала)] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + День(Стр.ДатаНачала)] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
													//Аверсон 14.03.2023 КВВ СВФР-010141 (пункт 2) )
													
													Если НЕ ЗначениеЗаполнено(ТекДень) Тогда 
														ТекДень = НачалоДня(Стр.ДатаНачала);
													КонецЕсли;
													
													ТекДень = ТекДень + 24*60*60; 
													Продолжать = Ложь;
													
													Продолжить;
												КонецЕсли;
											КонецЦикла;								
										КонецЕсли;
										
										Если Продолжать Тогда
											//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) )
											СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											Продолжить;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 02.10.2020 КВВ СВФР-006634 )
									
									//Аверсон 18.03.2021 КВВ СВФР-007187 (
									ДатаОкончанияПериода_Проверка = ДатаОкончанияПериода;
									Если КонецДня(ДатаУв) <> КонецМесяца(ДатаУв) Тогда 
										ДатаОкончанияПериода_Проверка = НачалоДня(ДатаУв-1);  
									КонецЕсли;
									//Аверсон 18.03.2021 КВВ СВФР-007187 )
									
									БукваНеявки = Стр.БукваВидаВремени;
									ТекДень = Стр.ДатаНачала;
									КонечныйДень = Стр.ДатаОкончания;
									Пока ТекДень<= КонечныйДень Цикл
										//Аверсон 14.08.2020 КВВ СВФР-006426 (
										//Аверсон 18.03.2021 КВВ СВФР-007187 (
										//Если ТекДень > ДатаОкончанияПериода Тогда
										Если ТекДень > ДатаОкончанияПериода_Проверка Тогда
											//Аверсон 18.03.2021 КВВ СВФР-007187 )
											Прервать;
										КонецЕсли;
										//Аверсон 14.08.2020 КВВ СВФР-006426 )
										Если МассивПраздников.Найти( ТекДень ) <> Неопределено 
											И Найти( ВРЕГ( БукваНеявки ), ВРЕГ( "Больнич" ) ) = 0  // и это - не больничный
											Тогда
											//Аверсон 08.06.2021 КВВ СВФР-007627 (
											Если (Организация.ИНН = "700067572"
												ИЛИ Организация.ИНН = "192240370") //СВЭЙ 30.06.2024 КВВ СВФР-013212
												И НЕ ПодразделениеТранспортногоЦеха() 
												И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Командировка")) <> 0 Тогда
											Иначе
												//Аверсон 08.06.2021 КВВ СВФР-007627 )
												//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 3(     
												ИндексЯчейкиНеявки = День(ТекДень);
												Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
													
													//Аверсон 16.02.2023 КВВ СВФР-010274 (
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком
													//Аверсон 16.02.2023 КВВ СВФР-010274 )
													
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
													ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
													
													//Аверсон 07.01.2023 КВВ СВФР-010108 (
													Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
														ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
														И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
													Иначе
														//Аверсон 07.01.2023 КВВ СВФР-010108 )
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
														СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
													КонецЕсли;
												Иначе
													//Аверсон 23.07.2021 КВВ СВФР-007876 )
													//Аверсон 22.07.2021 КВВ СВФР-007876 пункт 1(
													Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
														Пока РезРабВПраздИВых.Следующий() Цикл
															Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																
																НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																		ЗнЧ = ЭлМасс.ОтработаноЧасов;
																		
																		Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			
																			//СВЭЙ 15.04.2024 КВВ СВФР-012843 (
																			//СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = ?(БукваНеявки=Справочники.КлассификаторИспользованияРабочегоВремени.Командировка,БукваНеявки,Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
																			//СВЭЙ 15.04.2024 КВВ СВФР-012843 )
																			
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																			Иначе
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																				//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																			КонецЕсли;
																		ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																		ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			//Аверсон 13.01.2022 КВВ СВФР-008598 (
																			СостРаб = Новый СписокЗначений;
																			СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
																			ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
																			РезультатСост = ЗЗ.Выполнить().Выбрать();      
																			ЕстьКомандировкаПоЗапросу = Ложь; 
																			Пока РезультатСост.Следующий() Цикл
																				ЕстьКомандировкаВТЧПереносДнейСДоплачивать = Ложь;
																				Для Каждого стрДок ИЗ РезультатСост.Регистратор.ПереносДней Цикл
																					Если стрДок.Сотрудник <> стрСотрудник Тогда
																						Продолжить;
																					КонецЕсли;
																					Если НачалоДня(стрДок.ДатаС) <> НачалоДня(ТекДень) Тогда
																						Продолжить;
																					КонецЕсли;
																					Если НЕ стрДок.Доплачивать Тогда
																						Продолжить;
																					КонецЕсли;
																					ЕстьКомандировкаВТЧПереносДнейСДоплачивать = Истина;
																				КонецЦикла;
																				ЕстьКомандировкаПоЗапросу = ?(ЕстьКомандировкаВТЧПереносДнейСДоплачивать, Ложь, Истина);
																				Если ЕстьКомандировкаПоЗапросу Тогда	
																					СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
																					СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				КонецЕсли;
																			КонецЦикла;				
																			//Аверсон 13.01.2022 КВВ СВФР-008598 ) 
																			СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ПервыйВидВремени","ВторойВидВремени") + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																			СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ПервыйЧасов","ВторойЧасов") + ИндексЯчейкиНеявки] = ЗнЧ; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ВторойВидВремени","ТретийВидВремени") + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу)
																				СтрокаРасшифровкиПоДням[?(НЕ ЕстьКомандировкаПоЗапросу,"ВторойЧасов","ТретийЧасов") + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов; //Аверсон 13.01.2022 КВВ СВФР-008598 (ЕстьКомандировкаПоЗапросу) 
																			КонецЕсли;
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 22.07.2021 КВВ СВФР-007876 )
												ТекДень = ТекДень + 24*60*60; 	
												Продолжить;	
											КонецЕсли;
										КонецЕсли; 
										ИндексЯчейкиНеявки = День( ТекДень );
										
										ВидВремениЗаполнен = Ложь;
										Для каждого ТекПриставка Из МассивПриставок Цикл 
											НазваниеЯчейкиВидаВремениНеявки = ТекПриставка + "ВидВремени" + ИндексЯчейкиНеявки;
											ВидВремениЗаполнен = ЗначениеЗаполнено( СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениНеявки ] );
											Если ВидВремениЗаполнен Тогда
												//Аверсон 21.04.2020 КВВ СВФР-005904 (
												Если ТекПриставка = "Первый" и СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]) Тогда
														//Аверсон 28.01.2021 КВВ СВФР-007084 (
														Если Организация.ИНН = "700067572" И 
															(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные 
															или СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда  //ПСА 08.02.2021 СВФР-007152+++
														Иначе
															//Аверсон 28.01.2021 КВВ СВФР-007084 )
															СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
															СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
														КонецЕсли;
													КонецЕсли;	
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]) Тогда
														СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
													КонецЕсли;
													
													//СВЭЙ 08.12.2023 КВВ СВФР-011914 (
												ИначеЕсли ТЗ_Переносы.Количество() > 0 
													И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0
													И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] 
													И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]
													И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] 
													И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] Тогда
													ВидВремениЗаполнен = Ложь;
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
													//СВЭЙ 08.12.2023 КВВ СВФР-011914 )
													
													//Аверсон 03.06.2021 КВВ СВФР-007334 (
												Иначе
													Если Организация.ИНН = "700067572" И
														ТекПриставка = "Первый" И
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
														И НЕ (ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]))
														И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = КолВоЧасовПраздниковПоСотр(стрСотрудник,ТекДень);
													КонецЕсли;
													//Аверсон 03.06.2021 КВВ СВФР-007334 )
												КонецЕсли;
												//Аверсон 21.04.2020 КВВ СВФР-005904 )
												Прервать;	
											КонецЕсли; 
										КонецЦикла;
										
										Если НЕ ВидВремениЗаполнен И
											(ТекДень >= НачалоМесяца(Стр.ДатаНачала) И ТекДень <= КонецМесяца(Стр.ДатаНачала)) Тогда  //Аверсон 16.04.2020 КВВ СВФР-005876
											//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) (
											Продолжать = Истина;
											Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) (
												//Если ПодразделениеОрганизации <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации Тогда	
												//	Продолжать = Ложь;
												//КонецЕсли;
												ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
												Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
														Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
															Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																	Продолжать = Ложь;
																КонецЕсли;	
															Иначе
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																Продолжать = Ложь;
															КонецЕсли;
														КонецЕсли;
													Иначе
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) )
											КонецЕсли;
											
											//Аверсон 02.12.2021 КВВ СВФР-008409 (пункт 3) (
											Если //Организация.ИНН = "700067572" И
												Продолжать 
												И НЕ ВидВремениЗаполнен 
												И 
												(
												Найти(ВРЕГ(БукваНеявки),ВРЕГ("Прогул")) <> 0 
												
												//Аверсон 07.01.2023 КВВ СВФР-010108 (
												ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Оплата по среднему заработку")) <> 0 
												ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Ремонт")) <> 0
												//Аверсон 07.01.2023 КВВ СВФР-010108 )
												
												)
												И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 ) Тогда
												Продолжать = Ложь;
											КонецЕсли;
											//Аверсон 02.12.2021 КВВ СВФР-008409 (пункт 3) )
											
											//Аверсон 01.03.2022 КВВ СВФР-008748 (
											Если (Организация.ИНН = "100010315"
												ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628")
												И Продолжать
												И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												ДатаВИндГрафике_ТекДень = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,ТекДень));
												Если ДатаВИндГрафике_ТекДень.Количество() = 0 Тогда
													НайденПереносКомандировки = Ложь;
													НайденРаботаВВых = Ложь;
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
													ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень); 
													РезультатСост = ЗЗ.Выполнить().Выбрать();
													Пока РезультатСост.Следующий() Цикл
														Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
															НайденРаботаВВых = Истина;
															Прервать;
														КонецЕсли;
													КонецЦикла;
													
													Если НЕ НайденРаботаВВых Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень); 
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															Отб = Новый Структура;
															Отб.Вставить("Сотрудник", стрСотрудник);
															НЗ = РезультатСост.Регистратор.ПереносДней.НайтиСтроки(Отб);
															Если НЗ.Количество() > 0 Тогда
																Для Каждого СтрНЗ Из НЗ Цикл
																	Если СтрНЗ.ДатаС = ТекДень Тогда
																		НайденПереносКомандировки = Истина;
																		Прервать;
																	КонецЕсли;
																КонецЦикла;
															КонецЕсли;
															Если НайденПереносКомандировки Тогда
																Прервать;
															КонецЕсли;
														КонецЦикла;
														Если НЕ НайденПереносКомандировки Тогда
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 01.03.2022 КВВ СВФР-008748 )
											
											//Аверсон 12.01.2023 КВВ СВФР-010030 (
											Если Продолжать 
												И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Медкомиссия")) <> 0 
												И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
												ОтборНовПоСотрНеявок = Новый Структура;
												ОтборНовПоСотрНеявок.Вставить("Сотрудник", стрСотрудник);
												ОтборНовПоСотрНеявок.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
												СтрокиНовПоСотрНеявок = ТЗ_Неявки.НайтиСтроки(ОтборНовПоСотрНеявок);
												ЕстьБЛВТекДень = Ложь;
												Для Каждого СтрНовПоСотрНеявок Из СтрокиНовПоСотрНеявок Цикл
													Если НачалоДня(ТекДень) >= НачалоДня(СтрНовПоСотрНеявок.ДатаНачала)
														И НачалоДня(ТекДень) <= НачалоДня(СтрНовПоСотрНеявок.ДатаОкончания) Тогда
														ЕстьБЛВТекДень = Истина;
													КонецЕсли;
												КонецЦикла;
												Если ЕстьБЛВТекДень Тогда
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь;
													Продолжать = Ложь;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 12.01.2023 КВВ СВФР-010030 )
											
											//Аверсон 02.08.2023 КВВ СВФР-011200 (
											Если Продолжать
												И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0
												ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Явка")) <> 0)
												И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Работает);
												ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник,ТекДень); 
												РезРабота = ЗЗ.Выполнить().Выбрать();
												Пока РезРабота.Следующий() Цикл
													Если ТипЗнч(РезРабота.Регистратор) = Тип("ДокументСсылка.ОтзывИзОтпуска") Тогда
														Продолжать = Ложь;
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
											//Аверсон 02.08.2023 КВВ СВФР-011200 )
											
											Если Продолжать Тогда
												//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) )
												НазваниеЯчейкиВидаВремениНеявки = "ПервыйВидВремени" + ИндексЯчейкиНеявки;
												СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениНеявки ] = БукваНеявки;
												//ПСА 12.02.2021 СВФР-007197+++
												Если Стр.ДокПраздничный = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													ЗначениеЧасов = 0;
													ЧасовНочныхПоПриказуВПраздник = 0;
													РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
													Если Стр.ДокПраздничный = 1 Тогда 
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															//ПСА 08.02.2021 СВФР-007152+++
															ПоискНочныхВПраздничныйДень = Ложь;
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
																ПоискНочныхВПраздничныйДень = Истина;
															КонецЕсли;
															//+++ПСА 08.02.2021 СВФР-007152
															
															//ПСА 26.02.2021 СВФР-007248+++
															ПоискЯвкиВПразники = Ложь;
															РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;	//Аверсон 22.06.2021 КВВ СВФР-007755
															РаботаВМЕСТОПраздникКакЯвка = Ложь;  //Аверсон 05.07.2021 КВВ СВФР-007801 (пункт 2)
															//Аверсон 09.04.2021 КВВ СВФР-007434 (
															Если НЕ (Организация.ИНН = "700067572") Тогда
																ПоискЯвкиВПразники = Истина;
															Иначе
																//Аверсон 09.04.2021 КВВ СВФР-007434 )
																Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
																	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,Стр.ДатаНачала) Тогда
																	ПоискЯвкиВПразники = Истина;
																КонецЕсли;
															КонецЕсли;
															//+++ПСА 26.02.2021 СВФР-007248
															
															для Каждого стрДок из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала)Тогда
																	Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;  
																	ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда 
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	КонецЕсли;
																	//ПСА 08.02.2021 СВФР-007152+++
																	Если ПоискНочныхВПраздничныйДень и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																		ЧасовНочныхПоПриказуВПраздник = стрДок.ОтработаноНочныхЧасов;
																	КонецЕсли;
																	//+++ПСА 08.02.2021 СВФР-007152
																	//ПСА 26.02.2021 СВФР-007248+++
																	Если ПоискЯвкиВПразники Тогда
																		Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																			РаботаВПраздникКакЯвка = Истина;
																			//Аверсон 22.06.2021 КВВ СВФР-007755 (
																		ИначеЕсли НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И НЕ Организация.ИНН = "700067572" Тогда
																			РаботаВПраздникКакЯвкаНЕДоплачивать = Истина;
																			//Аверсон 22.06.2021 КВВ СВФР-007755 )
																			//Аверсон 05.07.2021 КВВ СВФР-007801 ( (пункт 2)
																		ИначеЕсли НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И Организация.ИНН = "700067572" Тогда
																			РаботаВМЕСТОПраздникКакЯвка = Истина;
																			//Аверсон 05.07.2021 КВВ СВФР-007801 )
																		КонецЕсли;	
																		//Аверсон 02.02.2022 КВВ СВФР-008561 (пункт 8) (
																	ИНАЧЕ
																		Если НЕ стрДок.Доплачивать и стрДок.ЯвкаВТабель И Организация.ИНН = "700067572" Тогда
																			РаботаВМЕСТОПраздникКакЯвка = Истина;
																		КонецЕсли;	
																		//Аверсон 02.02.2022 КВВ СВФР-008561 (пункт 8) )
																	КонецЕсли;
																	//+++ПСА 26.02.2021 СВФР-007248	
																КонецЕсли;
															КонецЦикла;
														КонецЦикла;
													КонецЕсли;
													НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
													//ПСА 08.02.2021 СВФР-007152 +++
													Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
															ИндексМассиваПриставок = 2;	
														Иначе
															ИндексМассиваПриставок = 1;	
														КонецЕсли;	
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
														ЧасовНочныхПоПриказуВПраздник = 0;
													КонецЕсли;
													//+++ПСА 08.02.2021 СВФР-007152
													//ПСА 26.02.2021 СВФР-007248+++
													Если РаботаВПраздникКакЯвка Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
															ИндексМассиваПриставок = 2;	
														Иначе
															ИндексМассиваПриставок = 1;	
														КонецЕсли;	
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
														РаботаВПраздникКакЯвка = Ложь;
													КонецЕсли;	
													//+++ПСА 26.02.2021 СВФР-007248
													
													//Аверсон 05.07.2021 КВВ СВФР-007801 ( (пункт 2)
													Если РаботаВМЕСТОПраздникКакЯвка Тогда
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
														Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
															СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															
															//СВЭЙ 09.10.2023 КВВ СВФР-011595 (
														ИначеЕсли ИндексМассиваПриставок <> 0 И Организация.ИНН = "700067572" Тогда
															НазваниеЯчейкиВБазе0 = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
															Если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
																СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе0] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															КонецЕсли;
															//СВЭЙ 09.10.2023 КВВ СВФР-011595 )
															
														КонецЕсли;
													КонецЕсли;
													//Аверсон 05.07.2021 КВВ СВФР-007801 )
													
													
													//Аверсон 22.06.2021 КВВ СВФР-007755 (
													Если РаботаВПраздникКакЯвкаНЕДоплачивать Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) 
															И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
															СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															РаботаВПраздникКакЯвкаНЕДоплачивать = Ложь;
														КонецЕсли;	
													КонецЕсли;
													//Аверсон 22.06.2021 КВВ СВФР-007755 )
													
													//ПСА 03.03.2021 СВФР-007291 +++
												ИначеЕсли Стр.ДокКомандировка = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
													НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
													ВвелиКомандировкаВВыходной = Ложь;  ВвелиКомандировкаВВыходной2Вар = Ложь;
													//Аверсон 08.06.2021 КВВ СВФР-007627 (
													Если Организация.ИНН = "700067572" 
														И НЕ ПодразделениеТранспортногоЦеха() Тогда
														НайденныеСтрокиПереноса = ТЗ_Переносы.НайтиСтроки(Новый Структура("РабочийДень", Стр.ДатаНачала));
														Если НайденныеСтрокиПереноса.Количество() > 0 Тогда
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
															ВвелиКомандировкаВВыходной = Истина;
														КонецЕсли;
													КонецЕсли;
													//Аверсон 08.06.2021 КВВ СВФР-007627 )
													
													//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) (
													ОбнулятьСноваЧасы = Истина;
													ЗначениеЧасов_ = 0; 
													//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) )
													
													//Аверсон 06.07.2021 КВВ СВФР-007801 ( (пункт 3)
													Если Организация.ИНН = "700067572"
														И НЕ ВвелиКомандировкаВВыходной Тогда
														ЗЗЗ = Новый Запрос;
														ЗЗЗ.Текст = "
														|ВЫБРАТЬ
														|СостояниеРаботниковОрганизаций.Регистратор ,
														|СостояниеРаботниковОрганизаций.Сотрудник,
														|СостояниеРаботниковОрганизаций.Период,
														|СостояниеРаботниковОрганизаций.ПериодЗавершения ,
														|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1) как кон
														|ПОМЕСТИТЬ ВтДок
														|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
														|ГДЕ
														|СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
														|И &Период МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1)
														|И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
														|;
														|
														|ВЫБРАТЬ 
														|ПД.Сотрудник,
														|ПД.Доплачивать,
														|ПД.ОтработаноЧасов,
														|ПД.ДатаС,
														|ПД.ДатаНаКакую
														|ИЗ Документ.КомандировкиОрганизаций.ПереносДней КАК ПД
														|ЛЕВОЕ СОЕДИНЕНИЕ ВтДок
														|ПО ПД.Ссылка = ВтДок.Регистратор
														|И ПД.Сотрудник = ВтДок.Сотрудник
														|ГДЕ ПД.Ссылка = ВтДок.Регистратор
														|И ПД.Сотрудник = ВтДок.Сотрудник
														|И ПД.ДатаС = &Период
														|И ПД.ОтработаноЧасов > 0 
														|И ПД.Доплачивать
														|И ПД.Ссылка.Проведен
														|И ПД.ДатаНаКакую = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
														ЗЗЗ.УстановитьПараметр("Период",ТекДень);
														ЗЗЗ.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
														ЗЗЗ.УстановитьПараметр("Состояние", СостРаб);
														РезЗЗЗ = ЗЗЗ.Выполнить().Выгрузить();
														Если РезЗЗЗ.Количество() > 0 Тогда
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
															СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = РезЗЗЗ[0].ОтработаноЧасов;
															ВвелиКомандировкаВВыходной = Истина;
															ВвелиКомандировкаВВыходной2Вар = Истина;
															ЗначениеЧасов = 0;
															ЗначениеЧасов_ = РезЗЗЗ[0].ОтработаноЧасов; //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6)
															ЕстьКомандировкаПоЗапросу = Истина;
														КонецЕсли;
														
													КонецЕсли;
													//Аверсон 06.07.2021 КВВ СВФР-007801 )
													Если НЕ ВвелиКомандировкаВВыходной2Вар Тогда  
														ЕстьКомандировкаПоЗапросу = Ложь; //Аверсон 22.06.2021 КВВ СВФР-007627
														
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														
														//СВЭЙ 08.01.2024 КВВ СВФР-012085 (
														//РезультатСост = ЗЗ.Выполнить().Выбрать();      
														//Пока РезультатСост.Следующий() Цикл
														РезультатСостТЗ = ЗЗ.Выполнить().Выгрузить();
														Если РезультатСостТЗ.Количество() = 0 И Организация.ИНН <> "700067572" Тогда
															ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник,ТекДень);	
															РезультатСостТЗ = ЗЗ.Выполнить().Выгрузить();
														КонецЕсли;	
														Для Каждого РезультатСост ИЗ РезультатСостТЗ Цикл
															//СВЭЙ 08.01.2024 КВВ СВФР-012085 )
															
															ЗначениеЧасов = 0; 
															ЕстьКомандировкаПоЗапросу = Истина; //Аверсон 22.06.2021 КВВ СВФР-007627
															Для Каждого стрДок из РезультатСост.Регистратор.ПереносДней Цикл
																//Аверсон 28.04.2022 КВВ СВФР-008892 (пункт 2) (
																//Если стрДок.Сотрудник = стрСотрудник и стрДок.ДатаС = НачалоДня(Стр.ДатаНачала) Тогда
																Если стрДок.Сотрудник = стрСотрудник и стрДок.ДатаС = НачалоДня(ТекДень) Тогда
																	//Аверсон 28.04.2022 КВВ СВФР-008892 (пункт 2) )	
																	МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,стрДок.ДатаНаКакую,стрСотрудник));
																	Если МассивОбщиеГрафики.Количество()>0 Тогда 
																		ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
																	Иначе                
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	КонецЕсли;
																	//ПСА 09.02.2021 СВФР-007152 +++	
																КонецЕсли;
															КонецЦикла;														
														КонецЦикла;
													КонецЕсли;
													//Аверсон 22.06.2021 КВВ СВФР-007627 (
													Если (НЕ Организация.ИНН = "700067572"
														ИЛИ (Организация.ИНН = "700067572" И ВвелиКомандировкаВВыходной2Вар)) 
														И ЗначениеЧасов = 0 
														И ЕстьКомандировкаПоЗапросу Тогда
														НадоДобавлятьРВ = Ложь;     
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
														Пока РезРабВПраздИВых.Следующий() Цикл
															Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																ОтборД.Вставить("ЯвкаВТабель", Истина);
																
																НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл
																		ЗначениеЧасов = ЗначениеЧасов + ЭлМасс.ОтработаноЧасов;
																		Если ЭлМасс.Доплачивать Тогда 
																			НадоДобавлятьРВ = Истина;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
														Если НадоДобавлятьРВ И ЗначениеЧасов <> 0 Тогда
															СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
															СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗначениеЧасов;
															//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) (
														ИначеЕсли ЗначениеЧасов = 0 И Организация.ИНН = "700067572" И ЗначениеЧасов_ <> 0 Тогда
															СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
															СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗначениеЧасов_;
															ОбнулятьСноваЧасы = Ложь;
															//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6) )
														КонецЕсли;
													КонецЕсли;
													//Аверсон 22.06.2021 КВВ СВФР-007627 )
													Если ОбнулятьСноваЧасы Тогда //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 6)
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
													КонецЕсли;
													
													//+++ПСА 03.03.2021 СВФР-007291	
												КонецЕсли;
												//+++ПСА 12.02.2021 СВФР-007197
											КонецЕсли;
										КонецЕсли; 
										//ПСА 02.02.2021 СВФР-007136 +++
										Если ВидВремениЗаполнен Тогда
											Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
												И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
												СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											КонецЕсли;										
										КонецЕсли;	
										//+++ПСА 02.02.2021 СВФР-007136
										
										//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
										Если Организация.ИНН = "700067572" Тогда     
											ИндексЯчейкиНеявки = День(ТекДень);
											
											//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) (
											Продолжать = ПроверкаНаПодразделениеВТекущийДень(ПодразделениеОрганизации,ТекДень,СтрСотрудник); 
											Если Продолжать Тогда
												//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) )
												Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
													//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ( (закомментировано, вынесено в отдельную функцию выше)
													////Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) (
													//Продолжать = Истина;
													//Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
													//	ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
													//	Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													//		Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
													//			Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
													//				//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
													//				Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
													//					Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
													//						Продолжать = Ложь;
													//					КонецЕсли;	
													//				Иначе
													//					//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
													//					Продолжать = Ложь;
													//				КонецЕсли;
													//			КонецЕсли;
													//		Иначе
													//			Продолжать = Ложь;
													//		КонецЕсли;
													//	КонецЕсли;
													//КонецЕсли;
													//
													//Если Продолжать Тогда
													//	//Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) )
													//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ) (закомментировано, вынесено в отдельную функцию выше) 
													ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
													
													//Аверсон 07.01.2023 КВВ СВФР-010108 (
													Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
														ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
														И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
													Иначе
														//Аверсон 07.01.2023 КВВ СВФР-010108 )
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
														СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
														ВидВремениЗаполнен = Истина;
													КонецЕсли;
												Иначе
													Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
														РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
														Пока РезРабВПраздИВых.Следующий() Цикл
															Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																
																НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																		ЗнЧ = ЭлМасс.ОтработаноЧасов;
																		Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																			Иначе
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
										
										//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 1)
										Если Организация.ИНН = "700067572"
											И НЕ ВидВремениЗаполнен 
											И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) <> 0 ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0)
											И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 )Тогда
											//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) (
											Продолжать = Истина;
											Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
												ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
												Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
														Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
															Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																	Продолжать = Ложь;
																КонецЕсли;	
															Иначе
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																Продолжать = Ложь;
															КонецЕсли;
														КонецЕсли;
													Иначе
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											Если Продолжать Тогда
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) )
												СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
												СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
												
												//СВЭЙ 24.06.2024 КВВ СВФР-013142 (	     
												Если стрГрафик.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный 
													И стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам 
													И стрГрафик.ГрафикРаботы.СуммированныйУчетРабочегоВремени 
													И ОбщиеГрафики.Количество()>0 
													И НЕ ВДатеСокращенноеВремя Тогда  
													
													НайдЭл = СпЗн_ВидыВремениОтсутствия.НайтиПоЗначению(БукваНеявки);
													Если НайдЭл <> Неопределено Тогда  
														
														ЗначениеЧасов = 0;
														МассивОбщиеГрафики = ТаблицаОбщиеГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата,Сотрудник",стрГрафик.ГрафикРаботы,ТекДень,стрСотрудник));
														Если МассивОбщиеГрафики.Количество()>0 Тогда 
															ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
															Если ЗначениеЧасов <> 0 Тогда
																СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗначениеЧасов;
															КонецЕсли;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли;												
												//СВЭЙ 24.06.2024 КВВ СВФР-013142 )
											КонецЕсли;
										КонецЕсли;
										//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 1)
										
										//Аверсон 24.01.2022 КВВ СВФР-008495 (
										Если (Организация.ИНН = "100010315"
											ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
											И сзСотрудникиОИП.Количество() > 0 Тогда
											НайдЭлт = сзСотрудникиОИП.НайтиПоЗначению(СтрСотрудник);
											Если НЕ НайдЭлт = Неопределено Тогда
												Если СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
													И НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки]) 
													Тогда  
													ЗапросОИП = Новый Запрос;
													ЗапросОИП.Текст = "ВЫБРАТЬ
													|ОИП.ДатаНачала КАК ДатаНачала,
													|ОИП.Период КАК ДатаОкончания,
													|ОИП.Сотрудник КАК Сотрудник
													|ИЗ РегистрСведений.ОбучениеИПереподготовка КАК ОИП
													|ГДЕ ОИП.Сотрудник = &Сотрудник
													|И ОИП.НеОтражатьВТабеле = ИСТИНА
													|И &ТекДень МЕЖДУ ОИП.ДатаНачала И ОИП.Период";
													ЗапросОИП.УстановитьПараметр("Сотрудник",СтрСотрудник);
													ЗапросОИП.УстановитьПараметр("ТекДень",ТекДень);
													РезЗапросОИП = ЗапросОИП.Выполнить().Выгрузить();
													Если РезЗапросОИП.Количество() > 0 Тогда
														СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
													КонецЕсли;
												КонецЕсли;	
											КонецЕсли;
										КонецЕсли;
										//Аверсон 24.01.2022 КВВ СВФР-008495 )
										
										//Аверсон ЕАЕ 18.08.2025 СВФР-016459 
										//п.1
										Если Не ВидВремениЗаполнен И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
											И Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
											Если ТЗ_Переносы.Количество() > 0 И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0 Тогда
												СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											КонецЕсли;
										КонецЕсли;
										//п.4
										Если ВидВремениЗаполнен И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск
											И Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
											Если ТЗ_Переносы.Количество() > 0 И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0 Тогда
												СтрокаРасшифровкиПоДням["ПервыйЧасов" + День(ТекДень)] = 0;	
											КонецЕсли;
										КонецЕсли;
										//Аверсон СВФР-016459
										
										ТекДень = ТекДень + 24*60*60; 	
									КонецЦикла;
								КонецЕсли; 	
							КонецЦикла; 		
							
						КонецЕсли; 
						//- СВЭЙ КДЯ 27.11.19 СВФР-004908
						//+++ ПСА 16.02.2021 СВФР-007197
						
					иначе //есть индивид.графики
						ВыбранныйДень=Дата(1, 1, 1, 0, 0, 0);  //Аверсон 17.07.2019 КВВ СВФР-004479
						Для Каждого стрГрафик из мТаблицаИндГрафики Цикл
							//ПСА 11.03.2021 СВФР-007321+++
							Если стрГрафик.ВидУчетаВремени	= Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда
								Если ЗапретВыводаНочныхЧасов(стрСотрудник,стрГрафик.Дата) Тогда
									продолжить;
								КонецЕсли;	
							КонецЕсли;
							//+++ПСА 11.03.2021 СВФР-007321
							//ПСА 25.02.2021 СВФР-007248+++
							Если ВыбранныйДень = стрГрафик.Дата Тогда
								ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
							Иначе
								ИндексМассиваПриставок = 0;
							КонецЕсли;                 
							ВыбранныйДень = стрГрафик.Дата; 
							//+++ПСА 25.02.2021 СВФР-007248
							//ПСА 15.02.2021 +++
							Если ИндексМассиваПриставок > 2 Тогда
								ИндексМассиваПриставок = 0;
							КонецЕсли;	
							//+++ПСА 15.02.2021
							
							ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
							Если стрГрафик.Дата < ДатаПр Тогда 
								Продолжить;
							КонецЕсли;
							Если стрГрафик.Дата >= ДатаУв Тогда 
								Продолжить;
							КонецЕсли;
							
							
							Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
								//О.Т. Аверсон 29.06.2016 № 
								ЗапросПеремещениеВременное = Новый Запрос;
								ЗапросПеремещениеВременное.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
								|	РаботникиОрганизацийСрезПоследних.Сотрудник
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
								|ГДЕ
								|	РаботникиОрганизацийСрезПоследних.Период <= &Дата";
								
								ЗапросПеремещениеВременное.УстановитьПараметр("Дата", КонецДня(стрГрафик.Дата));
								ЗапросПеремещениеВременное.УстановитьПараметр("Сотрудник", стрСотрудник);
								
								РезультатПеремещениеВр = ЗапросПеремещениеВременное.Выполнить().Выгрузить();
								Для Каждого стр из РезультатПеремещениеВр Цикл 
									ПодразделениеИзРегистра = стр.ПодразделениеОрганизации;
								КонецЦикла;
								
								ЗапросПодразд = Новый Запрос;
								ЗапросПодразд.Текст = 
								"ВЫБРАТЬ
								|	ПодразделенияОрганизаций.Ссылка
								|ИЗ
								|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
								|ГДЕ
								|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Ссылка)";
								
								ЗапросПодразд.УстановитьПараметр("Ссылка", ПодразделениеОрганизации);
								
								ТЗПодразделения = ЗапросПодразд.Выполнить().Выгрузить();
								Если ТЗПодразделения.НайтиСтроки(Новый Структура("Ссылка",ПодразделениеИзРегистра)).Количество()=0 Тогда  
									Продолжить;
								КонецЕсли;
							КонецЕсли;
							
							МассивРезультатЗапроса = РезультатЗапроса.НайтиСтроки(Новый Структура("Сотрудник",стрСотрудник)); 
							
							//Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6) (
							ЕстьВхожденияВИнтервал = Ложь;
							Если МассивРезультатЗапроса.Количество() <> 0 Тогда
								Для Каждого стрНеявки_ из МассивРезультатЗапроса Цикл
									Если НачалоДня(стрГрафик.Дата) >= НачалоДня(стрНеявки_.ДатаНачала) И КонецДня(стрГрафик.Дата) <= КонецДня(стрНеявки_.ДатаОкончания) Тогда
										ЕстьВхожденияВИнтервал = Истина;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							//Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6) )
							
							Если МассивРезультатЗапроса.Количество()=0 или стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам  //ПСА 25.02.2021 СВФР-007248+++
								ИЛИ (МассивРезультатЗапроса.Количество() <> 0 И ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН <> "700067572" И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено) //Аверсон 17.04.2022 КВВ СВФР-008959
								ИЛИ (МассивРезультатЗапроса.Количество() <> 0 И ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН = "700067572") Тогда //Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 6)
								
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								
								//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
								////Аверсон 17.07.2019 КВВ СВФР-004479 (
								//Если Организация.ИНН = "100010315" Тогда
								//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
								//Иначе
								//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
								//КонецЕсли;
								////Аверсон 17.07.2019 КВВ СВФР-004479 )
								//- СВЭЙ КДЯ 19.11.19 СВФР-004908
								
								//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
								//ПСА 28-12-2020 СВФР-006989+++
								//Аверсон 17.07.2019 КВВ СВФР-004479 (
								//Если Организация.ИНН = "100010315" Тогда
								//	БукваВидаВремени = ?( стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам,
								//	Справочники.КлассификаторИспользованияРабочегоВремени.Работа,
								//	Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы );
								//Иначе
								//	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
								//КонецЕсли;
								БукваВидаВремени = ?( стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам,
								Справочники.КлассификаторИспользованияРабочегоВремени.Работа,
								Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы );
								//+++ПСА 28-12-2020 СВФР-006989	
								ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
								СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, стрГрафик.ОсновноеЗначение );
								ЭтоИндивидГрафик = ?(ТипЗнч(стрГрафик.Документ) = Тип("ДокументСсылка.ВводИндивидуальныхГрафиковРаботыОрганизации"),Истина,Ложь); //Аверсон 08.06.2023 КВВ СВФР-010920
								БукваЧасы = ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки, ЭтоИндивидГрафик  ); //Аверсон 08.06.2023 КВВ СВФР-010920 (ЭтоИндивидГрафик)
								БукваВидаВремени = БукваЧасы.Буква;
								
								//Аверсон 29.10.2020 КВВ СВФР-006756 (
								Если НЕ ЕстьСокращенныеДниВМесяце Тогда
									ЗначениеЧасов = БукваЧасы.Часы;
								Иначе
									//ПСА 11.03.2021 СВФР-007321+++
									Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
										СокращЧасы = СокращенныеНочныеЧасыВДате(СтрСотрудник,стрГрафик.Дата);
									Иначе	
										СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(СтрСотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
									КонецЕсли;
									//+++ПСА 11.03.2021 СВФР-007321
									ЗначениеЧасов = ?(СокращЧасы=0,БукваЧасы.Часы,СокращЧасы);    
								КонецЕсли;
								//Аверсон 29.10.2020 КВВ СВФР-006756 )
								
								СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВБазе ] = БукваВидаВремени;
								//Аверсон 17.07.2019 КВВ СВФР-004479 )
								//- СВЭЙ КДЯ 19.11.19 СВФР-004908
								
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								
								//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
								//СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
								//- СВЭЙ КДЯ 19.11.19 СВФР-004908
								//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
								СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВБазе ] = ЗначениеЧасов;
								//- СВЭЙ КДЯ 19.11.19 СВФР-004908
								
								//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 5) (
								Если (Организация.ИНН = "700067572" 
									ИЛИ (//МассивРезультатЗапроса.Количество() <> 0 И  //Аверсон 30.03.2023 КВВ СВФР-010566 (пункт 2) (закомментировано) 
									ЕстьВхожденияВИнтервал = Ложь И Организация.ИНН <> "700067572" И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено) //Аверсон 17.04.2022 КВВ СВФР-008959
									)
									И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
									И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено Тогда
									Если НЕ РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(стрГрафик.Дата,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата 
										И (ИндексМассиваПриставок = 0 ИЛИ ИндексМассиваПриставок = 1) Тогда //Аверсон 31.01.2022 КВВ СВФР-008561 (пункт 7) (добавлено "ИЛИ ИндексМассиваПриставок = 1" )  
										ИндексМассиваПриставок = ИндексМассиваПриставок +1;
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
									КонецЕсли;
								КонецЕсли;
								//Аверсон 01.12.2021 КВВ СВФР-008409 (пункт 5) )
								
								
								//дексМассиваПриставок = ИндексМассиваПриставок + 1;
								//ПСА 28-12-2020 СВФР-006989+++
								
								//Аверсон 17.07.2019 КВВ СВФР-004479 (  
								//Если Организация.ИНН = "100010315" Тогда
								//	ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
								//	Если ВыбранныйДень = стрГрафик.Дата Тогда
								//		ИндексМассиваПриставок = 1;
								//	Иначе
								//		Если ИндексМассиваПриставок = 2 Тогда
								//			ИндексМассиваПриставок = 0;
								//		КонецЕсли; 
								//	КонецЕсли;                 
								//	ВыбранныйДень = стрГрафик.Дата; 
								//КонецЕсли;
								//Аверсон 17.07.2019 КВВ СВФР-004479 )
								//ПСА 25.02.2021 СВФР-007248---
								//ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
								//Если ВыбранныйДень = стрГрафик.Дата Тогда
								//	ИндексМассиваПриставок = 1;
								//Иначе
								//	Если ИндексМассиваПриставок = 2 Тогда
								//		ИндексМассиваПриставок = 0;
								//	КонецЕсли; 
								//КонецЕсли;                 
								//ВыбранныйДень = стрГрафик.Дата;
								//---ПСА 25.02.2021 СВФР-007248
								//+++ПСА 28-12-2020 СВФР-006989
								
							иначе
								
								БукваВидаВремени = "";
								ЗначениеЧасов = "";
								ЗначЕстьВИнтервале = Ложь;
								ЭтоОтпуск = Ложь;
								ЧасовСверхрУрПоПриказу = 0; //Аверсон 28.01.2021 КВВ СВФР-007084
								РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
								РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
								РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
								РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
								ЧасовНочныхПоПриказуВПраздник = 0; //Аверсон 06.04.2021 КВВ СВФР-007152
								
								Для Каждого стрНеявки из МассивРезультатЗапроса Цикл 
									НочныеВОтп = Ложь; //Аверсон 14.11.2019 КВВ СВФР-005040
									МассивРезультатЗапроса = стрНеявки;
									Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
									иначе 
										Если НачалоДня(стрГрафик.Дата) >= НачалоДня(МассивРезультатЗапроса.ДатаНачала) и КонецДня(стрГрафик.Дата) <= КонецДня(МассивРезультатЗапроса.ДатаОкончания) Тогда 
											Если ЗначЕстьВИнтервале Тогда 
												//Если не ЭтоОтпуск Тогда 
												//	Продолжить;
												//КонецЕсли;
												//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 6, 8) (
												КодДальше = Истина; 
												Если Организация.ИНН = "700067572"  
													И МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
													ОтборКодДальше = Новый Структура();
													ОтборКодДальше.Вставить("Сотрудник", стрСотрудник);
													ОтборКодДальше.Вставить("ДокКомандировка", 1);
													ОтборКодДальше.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Командировка);
													Строки_ТЗ_Неявки_ОтборКодДальше = ТЗ_Неявки.НайтиСтроки(ОтборКодДальше);
													Если Строки_ТЗ_Неявки_ОтборКодДальше.Количество() = 0 Тогда
														КодДальше = Ложь;
													Иначе
														Для Каждого Стр_ОтборКодДальше ИЗ Строки_ТЗ_Неявки_ОтборКодДальше Цикл
															Если НачалоДня(стрГрафик.Дата) >= НачалоДня(Стр_ОтборКодДальше.ДатаНачала)
																И НачалоДня(стрГрафик.Дата) <= НачалоДня(Стр_ОтборКодДальше.ДатаОкончания) Тогда
																КодДальше = Истина;
																Прервать;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
												Если КодДальше Тогда
													//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 6, 8) )
													Если не МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты Тогда 
														если не ЭтоОтпуск Тогда 
															Продолжить;
														КонецЕсли;
													КонецЕсли;	
												КонецЕсли;
											КонецЕсли;
											//Аверсон 14.11.2019 КВВ СВФР-005040 (  
											Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") Тогда //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
												Если стрГрафик.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам Тогда
													НочныеВОтп = Истина;
													Продолжить;
												КонецЕсли;
											КонецЕсли;
											//Аверсон 14.11.2019 КВВ СВФР-005040 )
											БукваВидаВремени = МассивРезультатЗапроса.БукваВидаВремени;
											ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
											
											//Аверсон 28.01.2021 КВВ СВФР-007084 (
											ЧасовСверхрУрПоПриказу = 0; 
											//ПСА 12.02.2021 СВФР-007197+++
											РаботаСверхурочныеКакЯвка = Ложь; //ПСА 05.03.2021 СВФР-007298
											РаботаСверхурочныеКакКомандировка = Ложь; //ПСА 11.03.2021 СВФР-007321
											РаботаСверхурочныеВКомандировкеКакЯвка = Ложь; //Аверсон ЕАЕ 02.04.2021 СВФР-007413
											РаботаВПраздникКакЯвка = Ложь; //Аверсон ЕАЕ 06.04.2021
											РаботаВМЕСТОСверхурочныеКакЯвка = Ложь; //Аверсон 03.06.2021 КВВ СВФР-007334
											
											//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
											Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
												или БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
												//+++ПСА 12.02.2021 СВФР-007197	
												ЗСверхУ = Новый Запрос;
												ЗСверхУ.Текст = "ВЫБРАТЬ 
												|СУММА(ТЧДок.ОтработаноЧасов) КАК Часов,
												|ТЧДок.ОплачиватьВОдинарномРазмере,
												
												//Аверсон ЕАЕ 10.09.2025 СВФР-016610
												|	ТЧДок.ЯвкаВТабель
												//Аверсон СВФР-016610
												
												|ИЗ Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ТЧДок
												|ГДЕ
												|ТЧДок.Ссылка.Проведен
												|И ТЧДок.Сотрудник = &Сотрудник
												|И ТЧДок.Дата = &Дата
												|СГРУППИРОВАТЬ ПО 
												|ТЧДок.ОплачиватьВОдинарномРазмере,
												
												//Аверсон ЕАЕ 10.09.2025 СВФР-016610
												|	ТЧДок.ЯвкаВТабель
												//Аверсон СВФР-016610
												
												|";
												ЗСверхУ.УстановитьПараметр("Сотрудник",стрСотрудник);
												ЗСверхУ.УстановитьПараметр("Дата",стрГрафик.Дата);
												РезЗСверхУ = ЗСверхУ.Выполнить().Выгрузить();
												Если РезЗСверхУ.Количество() > 0 Тогда
													Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда //ПСА 12.02.2021 СВФР-007197+++
														//ПСА 12.03.2021+++
														Если БылаКомандировка(стрСотрудник,стрГрафик.Дата) Тогда
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
														Иначе
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														КонецЕсли;	
														//+++ПСА 12.03.2021
														
														//Аверсон ЕАЕ 02.04.2021 СВФР-007413
														//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
														Если Организация.ИНН = "700067572" Тогда
															//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 4)
															Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
															Иначе
																//Аверсон 02.07.2021 КВВ СВФР-007801 )
																//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
																Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																	РаботаСверхурочныеВКомандировкеКакЯвка = Истина;	
																КонецЕсли;
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
																//Аверсон СВФР-007413
															КонецЕсли;
															
														//Аверсон ЕАЕ 10.09.2025 СВФР-016610
														//Бобруйскводоканал
														ИначеЕсли Организация.ИНН = "790041382" Тогда
															Если РезЗСверхУ[0].ЯвкаВТабель И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
																//РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
																ЗначениеЧасов = ЗначениеЧасов + РезЗСверхУ[0].Часов;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															Иначе
																ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
																ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															КонецЕсли;	
														//Аверсон СВФР-016610	
															
														Иначе
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														КонецЕсли;
														//ПСА 12.02.2021 СВФР-007197+++	
														//ПСА 05.03.2021 СВФР-007298+++      
														Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
															И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) Тогда
															//ПСА 12.03.2021+++
															//Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка и ПодразделениеТранспортногоЦеха() Тогда
															//	РаботаСверхурочныеКакКомандировка = Истина;
															//Иначе
															//	РаботаСверхурочныеКакЯвка = Истина;
															//КонецЕсли;
															Если ПодразделениеТранспортногоЦеха() Тогда
																РаботаСверхурочныеКакЯвка = Ложь;
															Иначе
																РаботаСверхурочныеКакЯвка = Истина;
															КонецЕсли;
															
															//+++ПСА 12.03.2021
														КонецЕсли;	
														//+++ПСА 05.03.2021 СВФР-007298
														
													Иначе
														//Аверсон ЕАЕ 02.04.2021 СВФР-007413
														//Если Организация.ИНН = "700067572" И РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
														Если Организация.ИНН = "700067572" Тогда
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
															//ЗначениеЧасов = стрГрафик.ОсновноеЗначение + РезЗСверхУ[0].Часов;
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
															//Аверсон СВФР-007413
															
															//Аверсон 03.06.2021 КВВ СВФР-007334 (
															Если РезЗСверхУ[0].ОплачиватьВОдинарномРазмере Тогда
																РаботаВМЕСТОСверхурочныеКакЯвка = Истина;
															КонецЕсли;
															//Аверсон 03.06.2021 КВВ СВФР-007334 )
															
														Иначе
															БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
															ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
															ЧасовСверхрУрПоПриказу = РезЗСверхУ[0].Часов;
														КонецЕсли;
														//ПСА 11.03.2021 СВФР-007321+++      
														//Если Организация.ИНН = "700067572" И Не РезЗСверхУ[0].ОплачиватьВОдинарномРазмере
														//	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,стрГрафик.Дата) и ПодразделениеТранспортногоЦеха() Тогда
														//	РаботаСверхурочныеКакКомандировка = Истина;
														//КонецЕсли;	
														//+++ПСА 11.03.2021 СВФР-007321
														
													КонецЕсли;
													//+++ПСА 12.02.2021 СВФР-007197	
												КонецЕсли;	
											КонецЕсли;
											//Аверсон 28.01.2021 КВВ СВФР-007084 )
											
											Если МассивРезультатЗапроса.ДокПраздничный = 1 Тогда 
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
												ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
												РезультатСост = ЗЗ.Выполнить().Выбрать();
												Пока РезультатСост.Следующий() Цикл
													//ПСА 08.02.2021 СВФР-007152+++
													ПоискНочныхВПраздничныйДень = Ложь;
													Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
														ПоискНочныхВПраздничныйДень = Истина;
													КонецЕсли;
													//+++ПСА 08.02.2021 СВФР-007152
													
													//ПСА 26.02.2021 СВФР-007248+++
													ПоискЯвкиВПразники = Ложь;
													//Аверсон 09.04.2021 КВВ СВФР-007434 (
													Если НЕ (Организация.ИНН = "700067572") Тогда
														ПоискЯвкиВПразники = Истина;
													Иначе
														//Аверсон 09.04.2021 КВВ СВФР-007434 )
														Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
															И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,МассивРезультатЗапроса.ДатаНачала) Тогда
															ПоискЯвкиВПразники = Истина;
														КонецЕсли;
													КонецЕсли;
													//+++ПСА 26.02.2021 СВФР-007248
													
													для Каждого стр из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
														Если стр.Сотрудник = стрСотрудник и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала)Тогда
															Если ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																ЗначениеЧасов = стр.ОтработаноЧасов;  
															ИначеЕсли не стр.Доплачивать и не ЗначениеЗаполнено(стр.ДеньОтдыха) Тогда
																БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																ЗначениеЧасов = стр.ОтработаноЧасов;
															ИначеЕсли стр.Доплачивать и ЗначениеЗаполнено(стр.ДатаВыхода) Тогда 
																ЗначениеЧасов = стр.ОтработаноЧасов;
															КонецЕсли;
															//ПСА 08.02.2021 СВФР-007152+++
															Если ПоискНочныхВПраздничныйДень и НачалоДня(стр.ДатаВыхода) = НачалоДня(МассивРезультатЗапроса.ДатаНачала) Тогда
																ЧасовНочныхПоПриказуВПраздник = стр.ОтработаноНочныхЧасов;
															КонецЕсли;
															//+++ПСА 08.02.2021 СВФР-007152
															//ПСА 26.02.2021 СВФР-007248+++
															Если ПоискЯвкиВПразники Тогда
																Если стр.Доплачивать и стр.ЯвкаВТабель Тогда
																	РаботаВПраздникКакЯвка = Истина;
																КонецЕсли;	
															КонецЕсли;
															//+++ПСА 26.02.2021 СВФР-007248
														КонецЕсли;
													КонецЦикла;
													
												КонецЦикла;
												
												
											КонецЕсли;
											Если МассивРезультатЗапроса.ДокКомандировка = 1 Тогда
												СостРаб = Новый СписокЗначений;
												СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
												ЗЗ = ЗапросПоСостояниюСотрудника(МассивРезультатЗапроса.ДатаНачала,МассивРезультатЗапроса.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
												РезультатСост = ЗЗ.Выполнить().Выбрать();
												Пока РезультатСост.Следующий() Цикл
													для Каждого стр из РезультатСост.Регистратор.ПереносДней Цикл
														Если стр.Сотрудник = стрСотрудник и стр.ДатаС = НачалоДня(стрГрафик.Дата) Тогда
															МассивОбщиеГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,стр.ДатаНаКакую));
															Если МассивОбщиеГрафики.Количество()>0 Тогда 
																ЗначениеЧасов = МассивОбщиеГрафики[0].ОсновноеЗначение;
															КонецЕсли;                
															МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стрГрафик.Дата)));
															Если МассивТЗДниКомандировок.Количество()=0 Тогда 
																СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																СтрТЗДниКомандировок.ДатаС = НачалоДня(стрГрафик.Дата);
																СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
															КонецЕсли;
															//ПСА 09.02.2021 СВФР-007152 +++	
														ИначеЕсли стр.Сотрудник = стрСотрудник Тогда
															МассивОбщиеГрафики = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,стр.ДатаС));
															Если МассивОбщиеГрафики.Количество() = 0 Тогда
																МассивТЗДниКомандировок = ТЗДниКомандировок.НайтиСтроки(Новый Структура("ДатаС",НачалоДня(стр.ДатаС)));
																Если МассивТЗДниКомандировок.Количество()=0 Тогда
																	СтрТЗДниКомандировок = ТЗДниКомандировок.Добавить();
																	СтрТЗДниКомандировок.ДатаС = НачалоДня(стр.ДатаС);
																	СтрТЗДниКомандировок.ДатаНаКакую = стр.ДатаНаКакую;
																	СтрТЗДниКомандировок.Доплачивать = стр.Доплачивать;
																	СтрТЗДниКомандировок.ОтработаноЧасов = стр.ОтработаноЧасов;
																КонецЕсли;
															КонецЕсли;
															//+++ПСА 09.02.2021 СВФР-007152	
														КонецЕсли;
														
													КонецЦикла;
													
												КонецЦикла; 
											КонецЕсли;
											Если МассивРезультатЗапроса.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
												ЭтоОтпуск = Истина;
											иначе
												ЭтоОтпуск = Ложь;
											КонецЕсли;
											
											ЗначЕстьВИнтервале = Истина;
											//Прервать; //брать последнее всегда значение, которое входит. БЛ будет всегда после отпуска
										иначе
											Если не ЗначЕстьВИнтервале Тогда 
												// ПСА 28.01.2021 СВФР-007135 +++
												//Аверсон 14.11.2019 КВВ СВФР-005040 (
												//Если Организация.ИНН = "100010315" Тогда
												//	БукваВидаВремени =  ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
												//	//Аверсон 14.11.2019 КВВ СВФР-005040 )
												//Иначе
												//	БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												//КонецЕсли;
												БукваВидаВремени =  ?(стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам,Справочники.КлассификаторИспользованияРабочегоВремени.Работа,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
												// +++ПСА 28.01.2021 СВФР-007135
												ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								
								Если НЕ НочныеВОтп Тогда//Аверсон 14.11.2019 КВВ СВФР-005040
									Если БукваВидаВремени="" Тогда 
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										ЗначениеЧасов = стрГрафик.ОсновноеЗначение;
									КонецЕсли;
									
									//+ СВЭЙ КДЯ 19.11.19 СВФР-004908
									ВыборкаТабеля = Новый Структура( "Сотрудник, Дата, БукваВидаВремени, ОсновноеЗначение", 
									СтрСотрудник, стрГрафик.Дата, БукваВидаВремени, ЗначениеЧасов );
									ЭтоИндивидГрафик = ?(ТипЗнч(стрГрафик.Документ) = Тип("ДокументСсылка.ВводИндивидуальныхГрафиковРаботыОрганизации"),Истина,Ложь); //Аверсон 08.06.2023 КВВ СВФР-010920
									БукваЧасы = ПолучитьБуквуЧасы( ВыборкаТабеля, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок, ТЗ_Неявки, ЭтоИндивидГрафик );  //Аверсон 08.06.2023 КВВ СВФР-010920 (ЭтоИндивидГрафик)
									БукваВидаВремени = БукваЧасы.Буква;
									ЗначениеЧасов = БукваЧасы.Часы;
									//- СВЭЙ КДЯ 19.11.19 СВФР-004908
									//Аверсон 29.10.2020 КВВ СВФР-006756 (
									Если НЕ ЕстьСокращенныеДниВМесяце Тогда
										ЗначениеЧасов = БукваЧасы.Часы;
									Иначе
										СокращЧасы = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВДате(СтрСотрудник,стрГрафик.Дата); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
										ЗначениеЧасов = ?(СокращЧасы=0,БукваЧасы.Часы,СокращЧасы);    
									КонецЕсли;
									//Аверсон 29.10.2020 КВВ СВФР-006756 )
									
									//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 2) (
									Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
										И МассивПраздников.Найти(стрГрафик.Дата) <> Неопределено Тогда
										
										//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) (
										Если Организация.ИНН = "700067572" 
											И НЕ РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(стрГрафик.Дата,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата 
											И ИндексМассиваПриставок = 0 Тогда
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
											ИндексМассиваПриставок = ИндексМассиваПриставок +1;
										КонецЕсли;
										//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) )
										
										БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
										//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) (
									ИначеЕсли БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
										ЕстьОтпускВБР = ПроверкаОтзываИзОтпускаВОтпускеПоБерИРодам(СтрСотрудник,стрГрафик.Дата).Количество();
										Если ЕстьОтпускВБР > 0 Тогда
											БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск;
										КонецЕсли;
										//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) )
									КонецЕсли;
									//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 2) )
									
									//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 3)
									Если Организация.ИНН = "700067572" 
										И ИндексМассиваПриставок = 1 
										И БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
										НазваниеЯчейкиВБазе_ = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										БукваВидаВремени_ = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе_];
										Если БукваВидаВремени_ = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
											ИндексМассиваПриставок = 0;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 3)
									
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
									
									//Аверсон 28.01.2021 КВВ СВФР-007084 ( 
									Если ЧасовСверхрУрПоПриказу <> 0 и стрГрафик.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам Тогда //ПСА 25.02.2021 СВФР-007248+++
										ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//Аверсон 03.06.2021 КВВ СВФР-007334 (
										Если РаботаВМЕСТОСверхурочныеКакЯвка Тогда
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										Иначе
											//Аверсон 03.06.2021 КВВ СВФР-007334 )
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
										КонецЕсли;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
										//ПСА 05.03.2021 СВФР-007298+++  
										Если РаботаСверхурочныеКакЯвка Тогда
											Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
												НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
												НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда	
												НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											Иначе
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
											КонецЕсли;	
										КонецЕсли;	
										//+++ПСА 05.03.2021 СВФР-007298
										//ПСА 11.03.2021 СВФР-007321+++  
										Если РаботаСверхурочныеКакКомандировка Тогда
											Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
												НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
												НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда	
												НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] + ЧасовСверхрУрПоПриказу;
											Иначе
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовСверхрУрПоПриказу;
											КонецЕсли;	
										КонецЕсли;	
										//+++ПСА 11.03.2021 СВФР-007321
									КонецЕсли;
									//Аверсон 28.01.2021 КВВ СВФР-007084 )
									//ПСА 08.02.2021 СВФР-007152 +++
									Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
										Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
											ИндексМассиваПриставок = 2;	
										Иначе
											ИндексМассиваПриставок = 1;	
										КонецЕсли;	
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
										ЧасовНочныхПоПриказуВПраздник = 0;
									КонецЕсли;
									//+++ПСА 08.02.2021 СВФР-007152
									//ПСА 26.02.2021 СВФР-007248+++
									Если РаботаВПраздникКакЯвка Тогда
										Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
											ИндексМассиваПриставок = 2;	
										Иначе
											ИндексМассиваПриставок = 1;	
										КонецЕсли;	
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
										РаботаВПраздникКакЯвка = Ложь;
									КонецЕсли;	
									//+++ПСА 26.02.2021 СВФР-007248
									
									БылИндексДо = ИндексМассиваПриставок; //Аверсон 20.05.2020 КВВ СВФР-006013
									// ПСА 28.01.2021 СВФР-007135 +++
									//Аверсон 14.11.2019 КВВ СВФР-005040 (  
									//Если Организация.ИНН = "100010315" Тогда
									//	ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									//	Если ВыбранныйДень = стрГрафик.Дата Тогда
									//		ИндексМассиваПриставок = 1;
									//	Иначе
									//		Если ИндексМассиваПриставок = 2 Тогда
									//			ИндексМассиваПриставок = 0;
									//		КонецЕсли; 
									//	КонецЕсли;                 
									//	ВыбранныйДень = стрГрафик.Дата; 
									//КонецЕсли;
									//---ПСА 25.02.2021 СВФР-007248
									//ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									//Если ВыбранныйДень = стрГрафик.Дата Тогда
									//	ИндексМассиваПриставок = 1;
									//Иначе
									//	//Если ИндексМассиваПриставок = 2 Тогда
									//	Если ИндексМассиваПриставок >= 2 Тогда // ПСА 29.01.2021
									//		ИндексМассиваПриставок = 0;
									//	КонецЕсли; 
									//КонецЕсли;                 
									//ВыбранныйДень = стрГрафик.Дата;
									//---ПСА 25.02.2021 СВФР-007248
									//+++ПСА 28.01.2021 СВФР-007135 +++
									//Аверсон 14.11.2019 КВВ СВФР-005040 )
									
									//Аверсон 20.05.2020 КВВ СВФР-006013 (
									Если БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь 
										И ИндексМассиваПриставок = 1 И БылИндексДо = 1 Тогда
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок-1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = БукваВидаВремени;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок-1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
										
										//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 4) (
										ТекИндексВВ = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[ТекИндексВВ]) И СтрокаРасшифровкиПоДням[ТекИндексВВ] = БукваВидаВремени Тогда
											СтрокаРасшифровкиПоДням[ТекИндексВВ] = "";
											СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = "";
										КонецЕсли;
										//Аверсон 28.01.2022 КВВ СВФР-008561 (пункт 4) )
										
									КонецЕсли;	
									//Аверсон 20.05.2020 КВВ СВФР-006013 )
									
								КонецЕсли;
								
								//МассивРезультатЗапроса = МассивРезультатЗапроса[0];
								//Если МассивРезультатЗапроса.ДатаОкончания = Неопределено или МассивРезультатЗапроса.ДатаОкончания = Null Тогда 
								//	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
								//	НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
								//иначе 
								//	Если стрГрафик.Дата >= МассивРезультатЗапроса.ДатаНачала и стрГрафик.Дата <= МассивРезультатЗапроса.ДатаОкончания Тогда 
								//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = МассивРезультатЗапроса.БукваВидаВремени;
								//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
								//	иначе
								//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
								//		НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								//		СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрГрафик.ОсновноеЗначение;
								//		
								//	КонецЕсли;
								//КонецЕсли;
								
								
							КонецЕсли;
							ЗапросПереносКоманд = Новый Запрос;
							ЗапросПереносКоманд.Текст = 
							"ВЫБРАТЬ
							|	ПереносДнейКомандировок.Сотрудник
							|ИЗ
							|	РегистрСведений.ПереносДнейКомандировок КАК ПереносДнейКомандировок
							|ГДЕ
							|	ПереносДнейКомандировок.ДатаНаКакую = &ДатаНаКакую
							|	И ПереносДнейКомандировок.Сотрудник = &Сотрудник";
							
							ЗапросПереносКоманд.УстановитьПараметр("ДатаНаКакую", стрГрафик.Дата);
							ЗапросПереносКоманд.УстановитьПараметр("Сотрудник", стрСотрудник);
							
							РезультатПереносКоманд = ЗапросПереносКоманд.Выполнить().Выбрать();
							
							Пока РезультатПереносКоманд.Следующий() Цикл
								ИндексЯчейкиВТаблице = День(стрГрафик.Дата);
								
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
								НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0; 
							КонецЦикла;
							
							Для Каждого стрКоманд из ТЗДниКомандировок Цикл 
								Если НачалоМесяца(стрКоманд.ДатаНаКакую) = ПериодРегистрации Тогда
									Если ЗначениеЗаполнено(стрКоманд.ДатаНаКакую) Тогда
										ИндексЯчейкиВТаблице = День(стрКоманд.ДатаНаКакую);
										
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
									КонецЕсли;      
								КонецЕсли;
								Если НачалоМесяца(стрКоманд.ДатаС) = ПериодРегистрации Тогда
									ИндексЯчейкиВТаблице = День(стрКоманд.ДатаС);   
									НадоЧтотоВставлять = Истина;  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
									Если стрКоманд.Доплачивать Тогда 
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 1)
										НадоРВ = Ложь;          
										Если Организация.ИНН = "700067572" Тогда
											Если ИндексМассиваПриставок = 1 Тогда
												Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) Тогда
													ИндексМассиваПриставок = 0;
													НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												Иначе
													Если СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
														НадоРВ = Истина;
														//Аверсон 07.07.2021 КВВ СВФР-007801 ( (пункт 10)
													ИначеЕсли СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
														СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
														СтрокаРасшифровкиПоДням[МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = стрКоманд.ОтработаноЧасов;
														НадоРВ = Истина;
														//Аверсон 07.07.2021 КВВ СВФР-007801 )
													КонецЕсли;
												КонецЕсли;
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4) (
											ИначеЕсли ИндексМассиваПриставок = 0 
												И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)]) 
												И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
												//перенесем праздники во второй индекс
												СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок+1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
												СтрокаРасшифровкиПоДням[МассивПриставок[ИндексМассиваПриставок+1]+"Часов"+Строка(ИндексЯчейкиВТаблице)] = стрКоманд.ОтработаноЧасов;
												НадоРВ = Ложь;
											ИначеЕсли ИндексМассиваПриставок = 2
												И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)])
												И (СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники
												ИЛИ СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
												И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)])
												И (СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники
												ИЛИ СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной)
												И СтрокаРасшифровкиПоДням[МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] <> СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице)] Тогда
												НадоЧтотоВставлять = Ложь;
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4) )
											КонецЕсли;
										КонецЕсли; 
										Если НадоЧтотоВставлять Тогда  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
											Если НадоРВ Тогда  
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
											Иначе
												//Аверсон 02.07.2021 КВВ СВФР-007801 )
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									Если НадоЧтотоВставлять Тогда  //Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 4)
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = стрКоманд.ОтработаноЧасов;
									КонецЕсли;
								КонецЕсли;	
								
							КонецЦикла; // стрКоманд из ТЗДниКомандировок
							
						КонецЦикла; // стрГрафик из мТаблицаИндГрафики
						
						//+ СВЭЙ КДЯ 27.11.19 СВФР-004908
						Если ТЗ_Неявки <> Неопределено Тогда
							Для Каждого Стр Из ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник)) Цикл
								Если Стр.ДатаНачала <= Стр.ДатаОкончания Тогда
									
									//Аверсон 02.10.2020 КВВ СВФР-006634 (
									ДатаВИндГрафике = ТаблицаИндГрафики.НайтиСтроки(Новый Структура("ГрафикРаботы,Дата",стрСотрудник,Стр.ДатаНачала));
									Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
										И ДатаВИндГрафике.Количество() = 0 
										И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
										
										//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) (
										Продолжать = Истина;
										ТЗНеявокПоСотрПроверка = ТЗ_Неявки.НайтиСтроки(Новый Структура("Сотрудник,БукваВидаВремени,ДокОтпуска,ДокОтзыв,ДокОтзывПеренос", стрСотрудник,Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск,1,1,1));
										Если ТЗНеявокПоСотрПроверка.Количество() > 0 Тогда
											Для Каждого СтрТЗНеявокПоСотрПроверка ИЗ ТЗНеявокПоСотрПроверка Цикл
												Если НачалоДня(Стр.ДатаНачала) >= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаНачала) И НачалоДня(Стр.ДатаНачала) <= НачалоДня(СтрТЗНеявокПоСотрПроверка.ДатаОкончания) Тогда
													СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Стр.БукваВидаВремени;
													Если НЕ ЗначениеЗаполнено(ТекДень) Тогда 
														ТекДень = НачалоДня(Стр.ДатаНачала);
													КонецЕсли;
													
													ТекДень = ТекДень + 24*60*60; 
													Продолжать = Ложь;
													
													Продолжить;
												КонецЕсли;
											КонецЦикла;								
										КонецЕсли;
										
										Если Продолжать Тогда
											//Аверсон 17.01.2023 КВВ СВФР-010141 (пункт 1) )
											СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(Стр.ДатаНачала)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											Продолжить;
										КонецЕсли;
									КонецЕсли;
									//Аверсон 02.10.2020 КВВ СВФР-006634 )
									
									//Аверсон 18.03.2021 КВВ СВФР-007187 (
									ДатаОкончанияПериода_Проверка = ДатаОкончанияПериода;
									Если КонецДня(ДатаУв) <> КонецМесяца(ДатаУв) Тогда 
										ДатаОкончанияПериода_Проверка = НачалоДня(ДатаУв-1);  
									КонецЕсли;
									//Аверсон 18.03.2021 КВВ СВФР-007187 )
									
									БукваНеявки = Стр.БукваВидаВремени;
									ТекДень = Стр.ДатаНачала;
									КонечныйДень = Стр.ДатаОкончания;
									Пока ТекДень<= КонечныйДень Цикл
										//Аверсон 14.08.2020 КВВ СВФР-006426 (
										//Аверсон 18.03.2021 КВВ СВФР-007187 (
										//	Если ТекДень > ДатаОкончанияПериода Тогда
										Если ТекДень > ДатаОкончанияПериода_Проверка Тогда
											
											//Аверсон 18.03.2021 КВВ СВФР-007187 )
											Прервать;
										КонецЕсли;
										//Аверсон 14.08.2020 КВВ СВФР-006426 )
										Если МассивПраздников.Найти( ТекДень ) <> Неопределено 
											И Найти( ВРЕГ( БукваНеявки ), ВРЕГ( "Больнич" ) ) = 0  // и это - не больничный
											Тогда
											//Аверсон 23.07.2021 КВВ СВФР-007876 пункт 3(     
											ИндексЯчейкиНеявки = День(ТекДень);
											Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
												
												//Аверсон 16.02.2023 КВВ СВФР-010274 (
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком
												//Аверсон 16.02.2023 КВВ СВФР-010274 )
												
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
												ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
												ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник).НормаЧасов;
												
												//Аверсон 07.01.2023 КВВ СВФР-010108 (
												Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
													ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
													И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
												Иначе
													//Аверсон 07.01.2023 КВВ СВФР-010108 )
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
												КонецЕсли;
											Иначе
												//Аверсон 23.07.2021 КВВ СВФР-007876 )
												//Аверсон 22.07.2021 КВВ СВФР-007876 пункт 1(
												Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
													СостРаб = Новый СписокЗначений;
													СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
													ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
													РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
													Пока РезРабВПраздИВых.Следующий() Цикл
														Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
															ОтборД = Новый Структура();
															ОтборД.Вставить("Сотрудник", стрСотрудник);
															ОтборД.Вставить("ДатаВыхода", ТекДень);
															
															НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
															
															Если НайденноеЗначение_.Количество() > 0 Тогда
																Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																	ЗнЧ = ЭлМасс.ОтработаноЧасов;
																	
																	Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																		
																		//Аверсон ЕАЕ 12.12.2025 СВФР-017530
																		Если Стр.ДокКомандировка = 1 Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		Иначе
																		//Аверсон СВФР-017530
																			
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		КонецЕсли;
																		
																		СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																		Иначе
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																		КонецЕсли;
																	ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																		Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																		КонецЕсли;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																	ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																		СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																		СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) (
																		Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																		КонецЕсли;
																		//Аверсон 05.08.2021 КВВ СВФР-007942 (пункт 1) )
																	КонецЕсли;
																КонецЦикла;
															КонецЕсли;
														КонецЕсли;
													КонецЦикла;
													//Аверсон 30.07.2021 КВВ СВФР-007801 (пункт 12) (
												Иначе
													Если Организация.ИНН = "700067572" 
														И ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) 
														И ПодразделениеТранспортногоЦеха() 
														И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
														Пока РезРабВПраздИВых.Следующий() Цикл
															Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																
																НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																		ЗнЧ = ЭлМасс.ОтработаноЧасов;
																		
																		Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
													//Аверсон 30.07.2021 КВВ СВФР-007801 (пункт 12) )
												КонецЕсли;
											КонецЕсли;
											//Аверсон 22.07.2021 КВВ СВФР-007876 )
											ТекДень = ТекДень + 24*60*60; 	
											Продолжить;	
										КонецЕсли; 
										ИндексЯчейкиНеявки = День( ТекДень );
										
										ВидВремениЗаполнен = Ложь;
										Для каждого ТекПриставка Из МассивПриставок Цикл 
											НазваниеЯчейкиВидаВремениНеявки = ТекПриставка + "ВидВремени" + ИндексЯчейкиНеявки;
											ВидВремениЗаполнен = ЗначениеЗаполнено( СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениНеявки ] );
											Если ВидВремениЗаполнен Тогда
												//Аверсон 21.04.2020 КВВ СВФР-005904 (
												Если ТекПриставка = "Первый" и СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]) Тогда
														//Аверсон 28.01.2021 КВВ СВФР-007084 (
														Если Организация.ИНН = "700067572" И 
															(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные 
															или СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда  //ПСА 08.02.2021 СВФР-007152+++
														Иначе
															//Аверсон 28.01.2021 КВВ СВФР-007084 )
															СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
															СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
														КонецЕсли;
													КонецЕсли;	
													Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]) Тогда
														СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
														СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
													КонецЕсли;
													
													//СВЭЙ 08.12.2023 КВВ СВФР-011914 (
												ИначеЕсли ТЗ_Переносы.Количество() > 0 
													И ТЗ_Переносы.НайтиСтроки(Новый Структура( "РабочийДень", ТекДень)).Количество() > 0
													И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] 
													И СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки]
													И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] 
													И СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] Тогда
													ВидВремениЗаполнен = Ложь;
													СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = "";
													СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = "";
													//СВЭЙ 08.12.2023 КВВ СВФР-011914 )
													
													//Аверсон 03.06.2021 КВВ СВФР-007334 (
												Иначе
													Если Организация.ИНН = "700067572"
														И ТекПриставка = "Первый"
														И (СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка
														ИЛИ СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной) //Аверсон 02.07.2021 КВВ СВФР-007801 (пункт 5 )
														И НЕ (ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки]))
														И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
														СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
														СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = КолВоЧасовПраздниковПоСотр(стрСотрудник,ТекДень);
													КонецЕсли;
													//Аверсон 03.06.2021 КВВ СВФР-007334 )
												КонецЕсли;
												//Аверсон 21.04.2020 КВВ СВФР-005904 )
												Прервать;	
											КонецЕсли; 
										КонецЦикла;
										
										Если НЕ ВидВремениЗаполнен И
											(ТекДень >= НачалоМесяца(Стр.ДатаНачала) И ТекДень <= КонецМесяца(Стр.ДатаНачала)) Тогда  //Аверсон 16.04.2020 КВВ СВФР-005876
											//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) (
											Продолжать = Истина;
											Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) (
												//Если ПодразделениеОрганизации <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации Тогда	
												//	Продолжать = Ложь;
												//КонецЕсли;
												ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
												Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
														Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
															Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																	Продолжать = Ложь;
																КонецЕсли;	
															Иначе
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																Продолжать = Ложь;
															КонецЕсли;
														КонецЕсли;
													Иначе
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 3) )
											КонецЕсли;
											
											//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) (
											Если Организация.ИНН = "700067572" Тогда
												Если НЕ ВидВремениЗаполнен И Найти(ВРЕГ(БукваНеявки),ВРЕГ("Явка")) <> 0
													И ЗначениеЗаполнено(стрГрафик.Документ) Тогда
													ОтборГр = Новый Структура();
													ОтборГр.Вставить("Сотрудник", стр.Сотрудник);
													НайденноеЗначениегр = стрГрафик.Документ.ГрафикРаботы.НайтиСтроки(ОтборГр);
													Если НайденноеЗначениеГр.Количество() > 0 Тогда
														ЧасовДень = "Часов"+СокрЛП(День(ТекДень));
														ЧасовПоГр = НайденноеЗначениеГр[0][ЧасовДень];
														Если ЧасовПоГр = 0 Тогда
															Продолжать = Ложь;
														КонецЕсли;
													КонецЕсли;
												КонецЕсли; 
											КонецЕсли;
											//Аверсон 30.11.2021 КВВ СВФР-008409 (пункт 1,2) )
											
											Если Продолжать Тогда
												//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 3) )
												НазваниеЯчейкиВидаВремениНеявки = "ПервыйВидВремени" + ИндексЯчейкиНеявки;
												СтрокаРасшифровкиПоДням[ НазваниеЯчейкиВидаВремениНеявки ] = БукваНеявки;
												//ПСА 12.02.2021 СВФР-007197+++
												Если Стр.ДокПраздничный = 1 и БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													ЗначениеЧасов = 0;
													ЧасовНочныхПоПриказуВПраздник = 0;
													РаботаВПраздникКакЯвка = Ложь; //ПСА 26.02.2021 СВФР-007248+++
													Если Стр.ДокПраздничный = 1 Тогда 
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(Стр.ДатаНачала,Стр.ДатаОкончания,СостРаб,стрСотрудник); //Аверсон 22.07.2021 КВВ СВФР-007876
														РезультатСост = ЗЗ.Выполнить().Выбрать();
														Пока РезультатСост.Следующий() Цикл
															//ПСА 08.02.2021 СВФР-007152+++
															ПоискНочныхВПраздничныйДень = Ложь;
															Если ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") И РезультатСост.Регистратор.НочныеЧасы Тогда
																ПоискНочныхВПраздничныйДень = Истина;
															КонецЕсли;
															//+++ПСА 08.02.2021 СВФР-007152
															
															//ПСА 26.02.2021 СВФР-007248+++
															ПоискЯвкиВПразники = Ложь;
															//Аверсон 09.04.2021 КВВ СВФР-007434 (
															Если НЕ (Организация.ИНН = "700067572") Тогда
																ПоискЯвкиВПразники = Истина;
															Иначе
																//Аверсон 09.04.2021 КВВ СВФР-007434 )
																Если Организация.ИНН = "700067572" и ТипЗнч(РезультатСост.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни")
																	И ПроверкаКатегорииСотрудникаДляРаботы(стрСотрудник,Стр.ДатаНачала) Тогда
																	ПоискЯвкиВПразники = Истина;
																КонецЕсли;
															КонецЕсли;
															//+++ПСА 26.02.2021 СВФР-007248
															
															для Каждого стрДок из РезультатСост.Регистратор.РаботникиОрганизации Цикл 
																Если стрДок.Сотрудник = стрСотрудник и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																	Если ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;  
																	ИначеЕсли не стрДок.Доплачивать и не ЗначениеЗаполнено(стрДок.ДеньОтдыха) Тогда
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	ИначеЕсли стрДок.Доплачивать и ЗначениеЗаполнено(стрДок.ДатаВыхода) Тогда 
																		ЗначениеЧасов = стрДок.ОтработаноЧасов;
																	КонецЕсли;
																	//ПСА 08.02.2021 СВФР-007152+++
																	Если ПоискНочныхВПраздничныйДень и НачалоДня(стрДок.ДатаВыхода) = НачалоДня(Стр.ДатаНачала) Тогда
																		ЧасовНочныхПоПриказуВПраздник = стрДок.ОтработаноНочныхЧасов;
																	КонецЕсли;
																	//+++ПСА 08.02.2021 СВФР-007152
																	//ПСА 26.02.2021 СВФР-007248+++
																	Если ПоискЯвкиВПразники Тогда
																		Если стрДок.Доплачивать и стрДок.ЯвкаВТабель Тогда
																			РаботаВПраздникКакЯвка = Истина;
																		КонецЕсли;	
																	КонецЕсли;
																	//+++ПСА 26.02.2021 СВФР-007248
																КонецЕсли;
															КонецЦикла;
														КонецЦикла;
													КонецЕсли;
													НазваниеЯчейкиВидаВремениНеявки = "ПервыйЧасов" + ИндексЯчейкиНеявки;
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВидаВремениНеявки] = ЗначениеЧасов;
													//ПСА 08.02.2021 СВФР-007152 +++
													Если ЧасовНочныхПоПриказуВПраздник <> 0 Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
															ИндексМассиваПриставок = 2;	
														Иначе
															ИндексМассиваПриставок = 1;	
														КонецЕсли;	
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЧасовНочныхПоПриказуВПраздник;
														ЧасовНочныхПоПриказуВПраздник = 0;
													КонецЕсли;
													//+++ПСА 08.02.2021 СВФР-007152
													//ПСА 26.02.2021 СВФР-007248+++
													Если РаботаВПраздникКакЯвка Тогда
														Если ЗначениеЗаполнено(СтрокаРасшифровкиПоДням[МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиНеявки)]) Тогда
															ИндексМассиваПриставок = 2;	
														Иначе
															ИндексМассиваПриставок = 1;	
														КонецЕсли;	
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
														НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиНеявки);
														СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ЗначениеЧасов;
														РаботаВПраздникКакЯвка = Ложь;
													КонецЕсли;	
													//+++ПСА 26.02.2021 СВФР-007248
													//Аверсон 02.07.2021 КВВ СВФР-007801 ( (пункт 5 )
												Иначе
													Если Организация.ИНН = "700067572" 
														И Стр.ДокКомандировка = 1  
														И БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка 
														И (ИндексМассиваПриставок = 0 ИЛИ ИндексМассиваПриставок = 1) Тогда
														ЗЗЗ = Новый Запрос;
														ЗЗЗ.Текст = "
														|ВЫБРАТЬ
														|СостояниеРаботниковОрганизаций.Регистратор ,
														|СостояниеРаботниковОрганизаций.Сотрудник,
														|СостояниеРаботниковОрганизаций.Период,
														|СостояниеРаботниковОрганизаций.ПериодЗавершения ,
														|ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1) как кон
														|ПОМЕСТИТЬ ВтДок
														|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
														|ГДЕ
														|СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
														|И &Период МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ),ДЕНЬ,-1)
														|И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
														|;
														|
														|ВЫБРАТЬ 
														|ПД.Сотрудник,
														|ПД.Доплачивать,
														|ПД.ОтработаноЧасов,
														|ПД.ДатаС,
														|ПД.ДатаНаКакую
														|ИЗ Документ.КомандировкиОрганизаций.ПереносДней КАК ПД
														|ЛЕВОЕ СОЕДИНЕНИЕ ВтДок
														|ПО ПД.Ссылка = ВтДок.Регистратор
														|И ПД.Сотрудник = ВтДок.Сотрудник
														|ГДЕ ПД.Ссылка = ВтДок.Регистратор
														|И ПД.Сотрудник = ВтДок.Сотрудник
														|И ПД.ДатаС = &Период
														|И ПД.ОтработаноЧасов > 0 
														|И ПД.Доплачивать
														|И ПД.Ссылка.Проведен
														|И ПД.ДатаНаКакую = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
														ЗЗЗ.УстановитьПараметр("Период",ТекДень);
														ЗЗЗ.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
														ЗЗЗ.УстановитьПараметр("Состояние", СостРаб);
														РезЗЗЗ = ЗЗЗ.Выполнить().Выгрузить();
														Если РезЗЗЗ.Количество() > 0 Тогда
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.КомандировкаВВыходной;
															СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = РезЗЗЗ[0].ОтработаноЧасов;
															
														КонецЕсли;
													КонецЕсли;
													
													//Аверсон 02.07.2021 КВВ СВФР-007801 )	
												КонецЕсли;
												//+++ПСА 12.02.2021 СВФР-007197
											КонецЕсли;
										КонецЕсли; 
										//ПСА 02.02.2021 СВФР-007136 +++
										Если ВидВремениЗаполнен Тогда
											Если Стр.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
												И СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
												СтрокаРасшифровкиПоДням["ПервыйВидВремени"+ День(ТекДень)] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
											КонецЕсли;										
										КонецЕсли;	
										//+++ПСА 02.02.2021 СВФР-007136
										
										//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
										Если Организация.ИНН = "700067572" Тогда     
											ИндексЯчейкиНеявки = День(ТекДень);
											//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) (
											Продолжать = ПроверкаНаПодразделениеВТекущийДень(ПодразделениеОрганизации,ТекДень,СтрСотрудник); 
											Если Продолжать Тогда
												//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) )
												Если БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
													ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
													//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ( (закомментировано, вынесено в отдельную функцию выше)
													////Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) (
													//Продолжать = Истина;
													//Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
													//	ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
													//	Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													//		Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
													//			Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
													//				//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
													//				Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
													//					Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
													//						Продолжать = Ложь;
													//					КонецЕсли;	
													//				Иначе
													//					//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
													//					Продолжать = Ложь;
													//				КонецЕсли;
													//			КонецЕсли;
													//		Иначе
													//			Продолжать = Ложь;
													//		КонецЕсли;
													//	КонецЕсли;
													//КонецЕсли;
													//
													//Если Продолжать Тогда
													//	//Аверсон 26.10.2021 КВВ СВФР-008152 (пункт 9) )
													//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) ) (закомментировано, вынесено в отдельную функцию выше)
													ЗнЧ = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(ТекДень,КонецДня(ТекДень),стрСотрудник,,,Истина).НормаЧасов;  //Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) 6 параметр Истина
													
													//Аверсон 07.01.2023 КВВ СВФР-010108 (
													Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
														ИЛИ (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования И Организация.ИНН <> "700067572")) //Аверсон 23.08.2023 КВВ СВФР-011294
														И ЗнЧ = 0 И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7) Тогда
													Иначе
														//Аверсон 07.01.2023 КВВ СВФР-010108 )
														
														ВидВремениЗаполнен = Истина;
														//Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) (
														Если (БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработку
															ИЛИ БукваНеявки = Справочники.КлассификаторИспользованияРабочегоВремени.ОплатаПоСреднемуЗаработкуСоревнования) //Аверсон 23.08.2023 КВВ СВФР-011294
															И ЗнЧ = 0 Тогда
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = "";
														Иначе
															//Аверсон 28.10.2021 КВВ СВФР-008152 (пункт 11) )
															СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
															СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
														КонецЕсли;
														
													КонецЕсли;
												Иначе
													Если НЕ ЗначениеЗаполнено(СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки]) Тогда
														СостРаб = Новый СписокЗначений;
														СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
														ЗЗ = ЗапросПоСостояниюСотрудника(ТекДень,ТекДень,СостРаб,стрСотрудник); 
														РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
														Пока РезРабВПраздИВых.Следующий() Цикл
															Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
																ОтборД = Новый Структура();
																ОтборД.Вставить("Сотрудник", стрСотрудник);
																ОтборД.Вставить("ДатаВыхода", ТекДень);
																
																НайденноеЗначение_ = РезРабВПраздИВых.Регистратор.РаботникиОрганизации.НайтиСтроки(ОтборД);
																
																Если НайденноеЗначение_.Количество() > 0 Тогда
																	Для Каждого ЭлМасс из НайденноеЗначение_ Цикл      
																		ЗнЧ = ЭлМасс.ОтработаноЧасов;
																		Если ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если Организация.ИНН = "700067572" И РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).Должность.СдельнаяОплата Тогда
																				СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																				СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы,""); 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ?(ЭлМасс.ОтработаноНочныхЧасов>0,ЭлМасс.ОтработаноНочныхЧасов,"");  
																			Иначе
																				Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																					СтрокаРасшифровкиПоДням["ТретийВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																					СтрокаРасшифровкиПоДням["ТретийЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																				КонецЕсли;
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		ИначеЕсли ЭлМасс.ЯвкаВТабель И НЕ ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		ИначеЕсли НЕ ЭлМасс.ЯвкаВТабель И ЭлМасс.Доплачивать Тогда
																			СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
																			СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = ЗнЧ;
																			Если ЭлМасс.ОтработаноНочныхЧасов>0 Тогда
																				СтрокаРасшифровкиПоДням["ВторойВидВремени" + ИндексЯчейкиНеявки] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы; 
																				СтрокаРасшифровкиПоДням["ВторойЧасов" + ИндексЯчейкиНеявки] = ЭлМасс.ОтработаноНочныхЧасов;  
																			КонецЕсли;
																			ВидВремениЗаполнен = Истина;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
										//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 2,3)  (по заявке СВФР-007876 пункт 1,3; СВФР-007942 пункт 1)
										
										//Аверсон 31.08.2021 КВВ СВФР-008054 ( (пункт 1)
										Если Организация.ИНН = "700067572"
											И НЕ ВидВремениЗаполнен 
											И (Найти(ВРЕГ(БукваНеявки),ВРЕГ("Больнич")) <> 0 ИЛИ Найти(ВРЕГ(БукваНеявки),ВРЕГ("Отпуск")) <> 0)
											И (ДеньНедели(ТекДень) = 6 ИЛИ ДеньНедели(ТекДень) = 7 )Тогда
											//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) (
											Продолжать = Истина;
											Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
												ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
												Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
													Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
														Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
															//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) (
															Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
																Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
																	Продолжать = Ложь;
																КонецЕсли;	
															Иначе
																//Аверсон 27.10.2021 КВВ СВФР-008152 (пункт 10) )
																Продолжать = Ложь;
															КонецЕсли;
														КонецЕсли;
													Иначе
														Продолжать = Ложь;
													КонецЕсли;
												КонецЕсли;
											КонецЕсли;
											Если Продолжать Тогда
												//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 7) )
												СтрокаРасшифровкиПоДням["ПервыйВидВремени" + ИндексЯчейкиНеявки] = БукваНеявки;
												СтрокаРасшифровкиПоДням["ПервыйЧасов" + ИндексЯчейкиНеявки] = "";
											КонецЕсли;
										КонецЕсли;
										//Аверсон 31.08.2021 КВВ СВФР-008054 ) (пункт 1)
										ТекДень = ТекДень + 24*60*60; 	
									КонецЦикла;
								КонецЕсли; 	
							КонецЦикла; 		
							
						КонецЕсли; 
						//- СВЭЙ КДЯ 27.11.19 СВФР-004908
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ЗаполнениеНеВыодить = Истина;
		иначе
			ЗаполнениеНеВыодить = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если не ЗаполнениеНеВыодить Тогда
		РезультатЗапросаДляПроверки = РезультатЗапроса.Выгрузить();
		
		//Аверсон 06.12.2021 КВВ СВФР-008456 (
		Если Сотрудники = Неопределено И НЕ ЗаполнитьПоКадровымДокументам И РезультатЗапросаДляПроверки.Количество() <> 0 Тогда
			РезультатЗапросаДляПроверки2 = РезультатЗапросаДляПроверки.Скопировать();
			НадоУдалить = Ложь;
			РезультатЗапросаДляПроверки.Колонки.Добавить("НадоУдалить");
			Отбор_ДляПроверки = Новый Структура;
			Отбор_ДляПроверки.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
			Попытка
				Строки_ДляПроверки = РезультатЗапросаДляПроверки2.НайтиСтроки(Отбор_ДляПроверки);
				Для Каждого Стр_ДляПроверки Из Строки_ДляПроверки Цикл
					Отбор_ДляПроверки2 = Новый Структура;
					Отбор_ДляПроверки2.Вставить("Сотрудник", Стр_ДляПроверки.Сотрудник);
					Отбор_ДляПроверки2.Вставить("Дата", Стр_ДляПроверки.Дата);
					Строки_ДляПроверки2 = РезультатЗапросаДляПроверки.НайтиСтроки(Отбор_ДляПроверки2);
					Для Каждого Стр_ДляПроверки2 Из Строки_ДляПроверки2 Цикл
						Если Стр_ДляПроверки2.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда
							Стр_ДляПроверки2.НадоУдалить = Истина;
							НадоУдалить = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
			Если НадоУдалить Тогда
				НадоУдалитьСтроки = РезультатЗапросаДляПроверки.НайтиСтроки(Новый Структура("НадоУдалить",Истина));
				Для Каждого СтрокаТаблицыНадоУдалитьСтроки Из НадоУдалитьСтроки Цикл       
					РезультатЗапросаДляПроверки.Удалить(СтрокаТаблицыНадоУдалитьСтроки);
				КонецЦикла;
			КонецЕсли;
			
			КолонкаНаУдаление = РезультатЗапросаДляПроверки.Колонки.Найти("НадоУдалить");
			Если НЕ КолонкаНаУдаление = Неопределено Тогда
				РезультатЗапросаДляПроверки.Колонки.Удалить(КолонкаНаУдаление);
			КонецЕсли;
			
			З_ТЗ = Новый Запрос;
			З_ТЗ.Текст = "
			|ВЫБРАТЬ *
			|ПОМЕСТИТЬ ВтВнешняя
			|ИЗ &ВнешняяТЗ КАК ВнешняяТЗ
			|;
			|ВЫБРАТЬ *
			|ИЗ ВтВнешняя КАК ВтВнешняя";
			З_ТЗ.УстановитьПараметр("ВнешняяТЗ", РезультатЗапросаДляПроверки);
			РезультатЗапроса = З_ТЗ.Выполнить();
		КонецЕсли;
		//Аверсон 06.12.2021 КВВ СВФР-008456 )
		
		//+ СВЭЙ КДЯ 28.09.19 СВФР-004571
		МассивБуквОтменыПереноса = ПолучитьМассивБуквОтменыПереноса();
		ТЗ_Переносы = ПолучитьТаблицуПереносов( ДатаНачалаПериода, ДатаОкончанияПериода );
		//ТЗ_Табель = РезультатЗапросаДляПроверки.Скопировать(); //+ СВЭЙ КДЯ 19.11.19 СВФР-004908
		//- СВЭЙ КДЯ 28.09.19 СВФР-004571
		Если Сотрудники = Неопределено Тогда
			ОтработанноеВремя.Очистить();
			ОтработанноеВремяВЦеломЗаПериод.Очистить();
		КонецЕсли;
		//ПСА 14-12-2020 СВФР-006909 +++
		Если СписокКатегорий.Количество() = 0 Тогда
			РезультатВыбора = СформироватьМассивДоступныхКатегорийСотрудникаЗаПериод(ПериодРегистрации, ПодразделениеОрганизации).Выбрать();
			Пока РезультатВыбора.Следующий() Цикл
				Если РезультатВыбора.Категория.ТипДокумента = 1 Тогда
					СписокКатегорий.Добавить(РезультатВыбора.Категория);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		//+++ ПСА 14-12-2020 СВФР-006909
		
		ТЗ_ВыборкиПОСотр = РезультатЗапроса.Выгрузить(); //СВЭЙ 10.09.2023 КВВ СВФР-011413
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			Если СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ПоДням Тогда
				// по дням.
				ВведенныеТабеляПоДнямПоСотруднику = Новый Соответствие;
				Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
					
					//О.Т. Аверсон 20.08.2018 № 2270
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Сотрудник = &Сотрудник
					|	И РаботникиОрганизаций.Организация = &Организация
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию 
					|			
					|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
					
					Запрос.УстановитьПараметр("Организация", Организация);
					Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					Запрос.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
					
					РезПрием = Запрос.Выполнить().Выгрузить();
					Если РезПрием.Количество()> 0 Тогда 
						СтавкаСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(РезПрием[0].Период,Новый Структура("Сотрудник",Выборка.Сотрудник)).ЗанимаемыхСтавок;
					иначе
						СтавкаСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Выборка.Сотрудник)).ЗанимаемыхСтавок; 	
					КонецЕсли;  			
					//О.Т. Аверсон 20.08.2018 № 2270
					
					Если ЗначениеЗаполнено(ПризнакФормированияТабеля) Тогда
						ВыборкаПризнака = СформироватьЗапросПоКатегорииОбъекта(Выборка.Сотрудник.Ссылка);
						Если ВыборкаПризнака.Следующий() = Ложь Тогда
							Продолжить;
						КонецЕсли;
					Иначе
						ВыборкаРезультат = ПрочиеПроцедуры.ПолучитьКатегориюПоСотруднику(Выборка.Сотрудник).Выбрать();
						Если Не ВыборкаРезультат.Следующий() Тогда
							Продолжить;
						Иначе
							Если СписокКатегорий.НайтиПоЗначению(ВыборкаРезультат.Категория) = Неопределено Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ВведенныеТабеляПоДнямПоСотруднику.Очистить();
					Если ТекущаяСтрокаТабличнойЧасти = Неопределено Тогда
						Если НЕ ТолькоСравнениеТабелей Тогда  //Аверсон 12.07.2019 КВВ СВФР-004487
							СтрокаРасшифровкиПоДням = ОтработанноеВремя.Добавить();
						Иначе
							СтрокаРасшифровкиПоДням = ОтработанноеВремя1.Добавить(); //Аверсон 12.07.2019 КВВ СВФР-004487
						КонецЕсли;
					Иначе
						СтрокаРасшифровкиПоДням = ТекущаяСтрокаТабличнойЧасти;
						Для ИндексДня = 1 По 31 Цикл
							ТекущаяСтрокаТабличнойЧасти["ПервыйВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ВторойВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ТретийВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
							ТекущаяСтрокаТабличнойЧасти["ПервыйЧасов" + Строка(ИндексДня)] = 0;
							ТекущаяСтрокаТабличнойЧасти["ВторойЧасов" + Строка(ИндексДня)] = 0;
							ТекущаяСтрокаТабличнойЧасти["ТретийЧасов" + Строка(ИндексДня)] = 0;
						КонецЦикла;
					КонецЕсли;
					СтрокаРасшифровкиПоДням.Сотрудник = Выборка.Сотрудник;
					Если Выборка.День <> NULL Тогда
						Заполнен_ОЖ_Вых = 0; //Аверсон 15.07.2019 КВВ СВФР-004528
						Пока Выборка.СледующийПоЗначениюПоля("День") Цикл
							ОбработкаПрерыванияПользователя();
							ЕстьРабота = Ложь;
							ЕстьПраздник = Ложь;
							ИндексЯчейкиВТаблице = Выборка.День;
							//Островская Татьяна 18.12.2012 № 16065
							ЯвкуНеДобавлять = Ложь;
							//Островская Татьяна 18.12.2012 № 16065
							ИндексМассиваПриставок = 0;
							
							//О.Т. Аверсон 29.06.2016 № Учитывать перемещение и исключать если другое подразделение
							Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
								//О.Т. Аверсон 29.06.2016 № 
								ЗапросПеремещениеВременное = Новый Запрос;
								ЗапросПеремещениеВременное.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
								|	РаботникиОрганизацийСрезПоследних.Сотрудник
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
								|ГДЕ
								|	РаботникиОрганизацийСрезПоследних.Период <= &Дата";
								
								ЗапросПеремещениеВременное.УстановитьПараметр("Дата", КонецДня(Выборка.Дата));
								ЗапросПеремещениеВременное.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
								
								РезультатПеремещениеВр = ЗапросПеремещениеВременное.Выполнить().Выгрузить();
								Для Каждого стр из РезультатПеремещениеВр Цикл 
									ПодразделениеИзРегистра = стр.ПодразделениеОрганизации;
								КонецЦикла;
								
								ЗапросПодразд = Новый Запрос;
								ЗапросПодразд.Текст = 
								"ВЫБРАТЬ
								|	ПодразделенияОрганизаций.Ссылка
								|ИЗ
								|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
								|ГДЕ
								|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Ссылка)";
								
								ЗапросПодразд.УстановитьПараметр("Ссылка", ПодразделениеОрганизации);
								
								ТЗПодразделения = ЗапросПодразд.Выполнить().Выгрузить();
								Если ТЗПодразделения.НайтиСтроки(Новый Структура("Ссылка",ПодразделениеИзРегистра)).Количество()=0 Тогда  
									Продолжить;
								КонецЕсли;
							КонецЕсли;
							//О.Т. Аверсон 29.06.2016 № Учитывать перемещение и исключать если другое подразделение			
							
							
							Пока Выборка.Следующий() Цикл 
								
								Если ИндексМассиваПриставок > 2 Тогда
									// На данный момент мы можем вводить только 3 вида времени в один день
									Прервать;
								КонецЕсли;
								
								//СВЭЙ 10.09.2023 КВВ СВФР-011413 (
								ИдтиДальше = Истина;
								Если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
									Отбор_ = Новый Структура;
									Отбор_.Вставить("Сотрудник", Выборка.Сотрудник);
									Отбор_.Вставить("Дата", Выборка.Дата);									
									Строки_ = ТЗ_ВыборкиПОСотр.НайтиСтроки(Отбор_);
									Если Строки_.Количество() > 1 Тогда
										Для Каждого ССтроки_ Из Строки_ Цикл
											Если ССтроки_.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя Тогда
												ИдтиДальше = Ложь;
												Продолжить;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
									
								КонецЕсли;
								Если ИдтиДальше Тогда
									//СВЭЙ 10.09.2023 КВВ СВФР-011413 )
									
									//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
									запросДок = Новый запрос;
									//Островская Татьяна 13.05.2014 № 17349
									запросДок.Текст =
									"ВЫБРАТЬ
									|	ОтпускаФактическиеПоСотрудникам.Регистратор КАК Ссылка
									|ИЗ
									|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
									|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
									|		ПО ОтпускаФактическиеПоСотрудникам.Регистратор = ОтпускПоУходуЗаРебенком.Ссылка
									|ГДЕ
									
									//Аверсон ЕАЕ 08.01.2026 СВФР-017716
									//|	ОтпускПоУходуЗаРебенком.Сотрудник = &Сотрудник
									|   ОтпускаФактическиеПоСотрудникам.Сотрудник = &Сотрудник
									//Аверсон СВФР-017716
									
									|	И ВЫБОР
									|			КОГДА ОтпускПоУходуЗаРебенком.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
									|					И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
									|				ТОГДА &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания
									|			ИНАЧЕ &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачалаФакт И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт
									|		КОНЕЦ";
									//Островская Татьяна 13.05.2014 № 17349
									запросДок.УстановитьПараметр("ДатаФакт",Выборка.Дата);
									запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
									Результ = запросДок.Выполнить();
									
									//Аверсон 15.07.2019 КВВ СВФР-004528 (
									Если НЕ Результ.Пустой() И НЕ Заполнен_ОЖ_Вых Тогда
										Заполнен_ОЖ_Вых = 1;
										РезЗ = запросДок.Выполнить().Выбрать();
										Пока РезЗ.Следующий() Цикл
											ДНач_ОЖ = ?(РезЗ.Ссылка.ДатаНачалаФакт=Дата(1, 1, 1, 0, 0, 0),РезЗ.Ссылка.ДатаНачала,РезЗ.Ссылка.ДатаНачалаФакт);
											ДКон_ОЖ = ?(РезЗ.Ссылка.ДатаОкончанияФакт=Дата(1, 1, 1, 0, 0, 0),РезЗ.Ссылка.ДатаОкончания,РезЗ.Ссылка.ДатаОкончанияФакт);
										КонецЦикла;
										ЗаполнениеОЖ_С = Макс(ДНач_ОЖ,НачалоМесяца(Выборка.Дата));
										ЗаполнениеОЖ_По = Мин(ДКон_ОЖ,НачалоДня(КонецМесяца(Выборка.Дата)));
										
										КолвоДнМежду = (ЗаполнениеОЖ_По - ЗаполнениеОЖ_С) / 60 / 60 / 24 + 1 ;
										СледДень = ЗаполнениеОЖ_С;
										Для А = 1 По КолвоДнМежду Цикл
											ЗапросВыхПразд = Новый Запрос;
											ЗапросВыхПразд.Текст = 
											"ВЫБРАТЬ
											|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
											|	РегламентированныйПроизводственныйКалендарь.ВидДня
											|	ИЗ
											|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
											|	ГДЕ
											|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
											ЗапросВыхПразд.УстановитьПараметр("ДатаКалендаря",НачалоДня(СледДень));
											РезВыхПразд = ЗапросВыхПразд.Выполнить().Выбрать();
											Пока РезВыхПразд.Следующий() Цикл 
												ВД = РезВыхПразд.ВидДня;
											КонецЦикла;
											
											ВноситьВТЧ = Ложь; //СВЭЙ 26.01.2024 КВВ СВФР-012186
											Если (ВД = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник) ИЛИ 
												(ВД = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота) ИЛИ
												(ВД = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье) Тогда
												
												//СВЭЙ 26.01.2024 КВВ СВФР-012186 (
												//ИндексЯчейкиВТаблицеВых = СокрЛП(День(СледДень));											
												//НазваниеЯчейкиВБазеВых = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблицеВых);
												//СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазеВых] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;												
												
												ВноситьВТЧ = Истина;
											Иначе
												ЧД = ПроизводительностьПовторноеИспользование.ПолучитьНормуПоГрафику(НачалоДня(СледДень), КонецДня(СледДень), Выборка.Сотрудник);
												Если ЧД[0].НормаДней = 0 И ЧД[0].НормаЧасов = 0 Тогда  
													ВноситьВТЧ = Истина;
												КонецЕсли;
											КонецЕсли;	 
											
											Если ВноситьВТЧ Тогда
												ИндексЯчейкиВТаблицеВых = СокрЛП(День(СледДень));											
												НазваниеЯчейкиВБазеВых = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблицеВых);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазеВых] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;												
											КонецЕсли;
											//СВЭЙ 26.01.2024 КВВ СВФР-012186 )
											
											СледДень = СледДень + 86400;
										КонецЦикла;
									КонецЕсли;
									//Аверсон 15.07.2019 КВВ СВФР-004528 )							
									
									//+ СВЭЙ КДЯ 28.09.19 СВФР-004571
									БукваЧасы = ПолучитьБуквуЧасы( Выборка, СтрокаРасшифровкиПоДням, ИндексМассиваПриставок );
									ВыборкаБукваВидаВремени = БукваЧасы.Буква;
									ВыборкаОсновноеЗначение = БукваЧасы.Часы;
									//- СВЭЙ КДЯ 28.09.19 СВФР-004571
									
									//Аверсон-софт, Островская Татьяна 17.08.2012 № 15704
									ВидДня = Неопределено;
									запросПраздники = Новый Запрос;
									запросПраздники.Текст = 
									"ВЫБРАТЬ
									|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
									|	РегламентированныйПроизводственныйКалендарь.Год,
									|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
									|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
									|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
									|	РегламентированныйПроизводственныйКалендарь.ВидДня
									|ИЗ
									|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
									|ГДЕ
									|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
									запросПраздники.УстановитьПараметр("ДатаКалендаря",Выборка.Дата);
									РезПраздники = запросПраздники.Выполнить().Выбрать();
									Пока РезПраздники.Следующий() Цикл 
										ВидДня = РезПраздники.ВидДня;
									КонецЦикла;
									
									если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник 
										и ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										Продолжить;								
									КонецЕсли;
									
									//Аверсон-софт, Островская Татьяна 17.08.2012 № 15704
									
									//О.Т. 20.03.2015 № 397
									если ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Простой или
										ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника или
										ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										если Выборка.ЗначениеДляПростоя - ВыборкаОсновноеЗначение > 0 Тогда // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
											НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ЗначениеДляПростоя - ВыборкаОсновноеЗначение; // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
											ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
										КонецЕсли;
									КонецЕсли;
									//О.Т. 20.03.2015 № 397
									
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									если  не Результ.Пустой() тогда
										если ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
										иначе
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаБукваВидаВремени; // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										КонецЕсли;
									иначе
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаБукваВидаВремени; // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
									КонецЕсли;
									
									//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
									НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаОсновноеЗначение; // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
									
									//Островская Татьяна 18.12.2012 № 16065
									если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
										если Выборка.ОсновноеЗначение1 = 0 Тогда 
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаОсновноеЗначение; // ВыборкаОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										иначе
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
										КонецЕсли;
										
									КонецЕсли;
									//Островская Татьяна 18.12.2012 № 16065
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									
									если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
										если ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
											если ЕстьПраздник = Ложь Тогда 
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												если Выборка.ОсновноеЗначение1 = 0 Тогда 
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаОсновноеЗначение; // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
												иначе
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												ЕстьРабота = Истина;
											КонецЕсли;
										ИначеЕсли  ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
											если ЕстьРабота = Ложь Тогда 
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
												СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
												НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
												если Выборка.ОсновноеЗначение1 = 0 Тогда 
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаОсновноеЗначение; // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
												иначе
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
												КонецЕсли; 
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
												ЕстьПраздник = Истина;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									
									//Толик
									Если ПрочиеПроцедуры.ПроверкаНаДействиеВидаНачисления( ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду( "085" ), 
										Выборка.Сотрудник, Организация, ДатаНачалаПериода, ДатаОкончанияПериода ) 
										И ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда  // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										Если ИндексМассиваПриставок > 2 Тогда
											// На данный момент мы можем вводить только 3 вида времени в один день
											Прервать;
										КонецЕсли;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
										НазваниеЯчейкиВБазе = МассивПриставок[ИндексМассиваПриставок]+"Часов"+Строка(ИндексЯчейкиВТаблице);
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = ВыборкаОсновноеЗначение; // Выборка.ОсновноеЗначение - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										//Островская Татьяна 15.04.2014 № 17276
										если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
											СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
										КонецЕсли;
										//Островская Татьяна 15.04.2014 № 17276
										ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									КонецЕсли;
									//Островская Татьяна 01.02.2013 № 16
									
									//О.Т. 19.06.2015 № Убрали обнуление (цифра не обнуляется для отчета ведомость отработанного времени)
									//если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя Тогда
									//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
									//КонецЕсли;
									//О.Т. 19.06.2015 № Убрали обнуление
									
									//Островская Татьяна 22.02.2013 № 15797
									если ВыборкаБукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда // Выборка.БукваВидаВремени - убрана точка. СВЭЙ КДЯ 28.09.19 СВФР-004571
										СтрокаРасшифровкиПоДням.ИтогоВредность = СтрокаРасшифровкиПоДням.ИтогоВредность+ СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе];
									КонецЕсли;
									//Островская Татьяна 22.02.2013 № 15797
									
									//енд	
									ОбработкаПрерыванияПользователя();
									
								КонецЕсли; //СВЭЙ 10.09.2023 КВВ СВФР-011413
								
							КонецЦикла; // Выборка.Следующий()
							ОбработкаПрерыванияПользователя();
						КонецЦикла; // Выборка.СледующийПоЗначениюПоля("День") начало: строка 
					КонецЕсли;
					// О.Т. 05.12.2014 311
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
					|ИЗ
					|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
					|ГДЕ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
					|	И ВЫБОР
					|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &Период
					|					И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|				ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
					|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
					|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
					
					Запрос.УстановитьПараметр("Период", ПериодРегистрации);
					Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
					
					ЕстьВредность = Запрос.Выполнить().Выгрузить();
					
					если ЕстьВредность.Количество()>0 Тогда 
						ЕстьИндивидуальный = Ложь;
						ЗапросАвтоЗаполнения.Текст = 
						"ВЫБРАТЬ
						|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
						|	СУММА(ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
						|	ВТГрафикиРаботыПоВидамВремени.План,
						|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени
						|ИЗ
						|	ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
						|ГДЕ
						|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
						|	И ВТГрафикиРаботыПоВидамВремени.План = &План
						|
						|СГРУППИРОВАТЬ ПО
						|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
						|	ВТГрафикиРаботыПоВидамВремени.План,
						|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
						
						ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
						ЗапросАвтоЗаполнения.УстановитьПараметр("План", Истина);
						
						РезультатГрафик = ЗапросАвтоЗаполнения.Выполнить().Выбрать();
						РегистрГрафикРаботы = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Выборка.Сотрудник)).ГрафикРаботы;//О.Т. Аверсон 29.06.2016
						Пока РезультатГрафик.Следующий() Цикл
							если ТипЗнч(РезультатГрафик.ГрафикРаботы) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
								Если РезультатГрафик.ГрафикРаботы = Выборка.Сотрудник Тогда
									ЕстьИндивидуальный = Истина;
									ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
								КонецЕсли;
							КонецЕсли;
							если не ЕстьИндивидуальный Тогда 
								Если РегистрГрафикРаботы = РезультатГрафик.ГрафикРаботы Тогда //О.Т. Аверсон 29.06.2016
									ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
								КонецЕсли;
							КонецЕсли;
							
							
						КонецЦикла;
						если СтрокаРасшифровкиПоДням.ИтогоВредность > ГрафикЧасов и СтрокаРасшифровкиПоДням.ИтогоВредность > 0 Тогда 
							СтрокаРасшифровкиПоДням.ИтогоВредность = ГрафикЧасов;
						КонецЕсли;
						
					иначе
						СтрокаРасшифровкиПоДням.ИтогоВредность = 0;
						
					КонецЕсли;
					// О.Т. 05.12.2014 311
					
					ОбработкаПрерыванияПользователя();//О.Т. 22.05.2015 № 	
				КонецЦикла;
			Иначе
				// в целом за период
				СотрудникПрошлый = "";
				СтрокаТабличнойЧасти = Неопределено;
				КоличествоЗаписей = Неопределено;
				ВидВремени = 0;
				//Островская Татьяна 04.07.2013 № 16581
				НочныеДобавлены = Ложь;
				ЯвкаДобавлены = Ложь;
				ВредностьДобавлены = Ложь;
				ПраздникиДобавлены = Ложь;
				СверхурочноДобавлены = Ложь; //Островская Татьяна 12.03.2014 № 17200
				
				Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
					ДатаНачПрошл = Дата(1,1,1);
					ДатаКонПрошл = Дата(1,1,1);
					РегистраторПрошл = "";
					ПеремДляСнятия = 1;
					Пока ?(Организация.ИНН="100765738",Выборка.СледующийПоЗначениюПоля("ДатаНачала"),ПеремДляСнятия < 2)  Цикл //О.Т. Аверсон 16.12.2016 № 100
						//Островская Татьяна 16.04.2014 № 17276
						СоздаватьНовуюСтроку = Истина;
						Если Организация.ИНН="100765738" Тогда //О.Т. Аверсон 16.12.2016 № 100
							Если Выборка.ДатаНачала >= ДатаНачПрошл и Выборка.ДатаНачала <= ДатаКонПрошл Тогда 
								СоздаватьНовуюСтроку = Ложь;
							иначе
								Если Выборка.Регистратор <> РегистраторПрошл Тогда 
									ДатаНачПрошл = Выборка.ДатаНачала;
									ДатаКонПрошл = Выборка.ДатаОкончания;
								иначе
									СоздаватьНовуюСтроку = Ложь;
								КонецЕсли;
								
								
							КонецЕсли;
							
							СтавкаСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Выборка.ДатаНачала,Новый Структура("Сотрудник",Выборка.Сотрудник)).ЗанимаемыхСтавок;
							Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
								ПодразделениеОрг = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Выборка.ДатаНачала,Новый Структура("Сотрудник",Выборка.Сотрудник)).ПодразделениеОрганизации;
								Если ПодразделениеОрг <> ПодразделениеОрганизации Тогда 
									Продолжить;
								КонецЕсли;
							КонецЕсли;
						иначе
							СтавкаСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Выборка.Сотрудник)).ЗанимаемыхСтавок;
						КонецЕсли;
						//Островская Татьяна 16.04.2014 № 17276
						если не СоздаватьНовуюСтроку Тогда 
							Если СтрокаТабличнойЧасти.ДатаОкончания < Выборка.ДатаОкончания Тогда 
								СтрокаТабличнойЧасти.ДатаОкончания = Выборка.ДатаОкончания;
							КонецЕсли;
						КонецЕсли;
						
						Если СоздаватьНовуюСтроку Тогда 
							если ВидВремени = 1 и Организация.ИНН = "100765738" Тогда 
								КлассифНочные = Ложь;
								КлассифЯвка = Ложь;
								КлассифВрДоп = Ложь;
								КлассифПраздники = Ложь;//Островская Татьяна 22.07.2013 № 16636
								КлассифСверхурочно = Ложь;//Островская Татьяна 12.03.2014 № 17200
								Отбор1 = Новый Структура();
								Отбор1.Вставить("Сотрудник",СтрокаТабличнойЧасти.Сотрудник);
								РезДоп = РезультатЗапроса.Выгрузить().НайтиСтроки(Отбор1);
								для Каждого стрДоп из РезДоп Цикл 
									если  стрДоп.ВидВремени = КлассификаторНочныеЧасы Тогда 
										КлассифНочные = истина;
									ИначеЕсли  стрДоп.ВидВремени = КлассификаторЯвка Тогда 
										КлассифЯвка = истина;
									ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.") Тогда 
										КлассифВрДоп = истина;
									ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда 
										КлассифПраздники = истина;  //Островская Татьяна 22.07.2013 № 16636
									ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда 
										КлассифСверхурочно = истина;//Островская Татьяна 12.03.2014 № 17200	
									КонецЕсли;
								КонецЦикла;
								если не КлассифНочные и Ночные Тогда 
									Если КоличествоЗаписей < 7 и не НочныеДобавлены Тогда
										СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторНочныеЧасы;
										КоличествоЗаписей = КоличествоЗаписей + 1;
										НочныеДобавлены = Истина;
									КонецЕсли;
								КонецЕсли;
								если не КлассифЯвка и Явка Тогда 
									Если КоличествоЗаписей < 7 и не ЯвкаДобавлены Тогда
										СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторЯвка;
										КоличествоЗаписей = КоличествоЗаписей + 1;
										ЯвкаДобавлены = Истина;
									КонецЕсли;
								КонецЕсли;
								если не КлассифВрДоп  и ВредностьДоп Тогда 
									Если КоличествоЗаписей < 7 и не ВредностьДобавлены Тогда
										СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.");
										КоличествоЗаписей = КоличествоЗаписей + 1;
										ВредностьДобавлены = Истина;
									КонецЕсли;
								КонецЕсли;
								если не КлассифПраздники  и Праздники Тогда 
									Если КоличествоЗаписей < 7 и не ПраздникиДобавлены Тогда
										СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
										КоличествоЗаписей = КоличествоЗаписей + 1;
										ПраздникиДобавлены = Истина;
									КонецЕсли;
								КонецЕсли; //Островская Татьяна 22.07.2013 № 16636
								//Островская Татьяна 12.03.2014 № 17200
								если не КлассифСверхурочно и Сверхурочные Тогда 
									Если КоличествоЗаписей < 7 и не СверхурочноДобавлены Тогда
										СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
										КоличествоЗаписей = КоличествоЗаписей + 1;
										СверхурочноДобавлены = Истина;
									КонецЕсли;
								КонецЕсли;
								//Островская Татьяна 12.03.2014 № 17200
							КонецЕсли;
							//Островская Татьяна 04.07.2013 № 16581
							если Выборка.Сотрудник <> СотрудникПрошлый Тогда 
								НочныеДобавлены = Ложь;
								ЯвкаДобавлены = Ложь;
								ВредностьДобавлены = Ложь;
								ПраздникиДобавлены = Ложь;
								СверхурочноДобавлены = Ложь;
							КонецЕсли;
							
							ВидВремени = 0;
							//Островская Татьяна 04.07.2013 № 16581
							
							Если ЗначениеЗаполнено(ПризнакФормированияТабеля) Тогда
								ВыборкаПризнака = СформироватьЗапросПоКатегорииОбъекта(Выборка.Сотрудник.Ссылка);
								Если ВыборкаПризнака.Следующий() = Ложь Тогда
									Продолжить;
								КонецЕсли;
							Иначе
								ВыборкаРезультат = ПрочиеПроцедуры.ПолучитьКатегориюПоСотруднику(Выборка.Сотрудник).Выбрать();
								Если Не ВыборкаРезультат.Следующий() Тогда
									Продолжить;
								Иначе
									Если СписокКатегорий.НайтиПоЗначению(ВыборкаРезультат.Категория) = Неопределено Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
							КоличествоЗаписей = 1;
							Если ТекущаяСтрокаТабличнойЧасти = Неопределено Тогда
								СтрокаТабличнойЧасти = ОтработанноеВремяВЦеломЗаПериод.Добавить();
							Иначе
								СтрокаТабличнойЧасти = ТекущаяСтрокаТабличнойЧасти;
							КонецЕсли;
							СтрокаТабличнойЧасти.Сотрудник = Выборка.Сотрудник;
							//О.Т. Аверсон 16.12.2016 № 100
							Если Организация.ИНН="100765738" Тогда //О.Т. Аверсон 16.12.2016 № 100
								СтрокаТабличнойЧасти.ДатаНачала = Выборка.ДатаНачала;
								СтрокаТабличнойЧасти.ДатаОкончания = Выборка.ДатаОкончания;
							КонецЕсли;
							//О.Т. Аверсон 16.12.2016 № 100
							//Островская Татьяна 23.07.2013 № 16636
							Отбор1 = Новый Структура();
							Отбор1.Вставить("Сотрудник",СтрокаТабличнойЧасти.Сотрудник);
							РезДоп = РезультатЗапроса.Выгрузить().НайтиСтроки(Отбор1);
						КонецЕсли;
						//Островская Татьяна 23.07.2013 № 16636
						Пока Выборка.Следующий() Цикл
							ОбработкаПрерыванияПользователя();
							Если Выборка.ВидВремени = NULL Тогда
								//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
								запросДок = Новый запрос;
								запросДок.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								запросДок.Текст = ТекстГрафики;
								запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
								запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
								запросДок.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
								запросДок.УстановитьПараметр("Месяц", ПериодРегистрации);
								запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
								запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);						
								запросДок.УстановитьПараметр("ДокументСсылка", Ссылка);
								запросДок.УстановитьПараметр("ПустойДокумент", Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка());
								запросДок.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
								запросДок.Выполнить();
								//Островская Татьяна 13.05.2014 № 17349
								запросДок.Текст = 
								"ВЫБРАТЬ
								|	ОтпускаФактическиеПоСотрудникам.Регистратор КАК Ссылка,
								|	СУММА(ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
								|	СУММА(ВТГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение
								|ИЗ
								|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
								|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
								|		ПО ОтпускаФактическиеПоСотрудникам.Регистратор = ОтпускПоУходуЗаРебенком.Ссылка
								|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
								|			ВЫБОР
								|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
								|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
								|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
								|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
								|			КОНЕЦ КАК ГрафикРаботы,
								|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник1
								|		ИЗ
								|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
								|		ГДЕ
								|			ВЫБОР
								|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
								|							И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
								|						ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
								|					ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
								|				КОНЕЦ <> &ПустойГрафик
								|		
								|		ОБЪЕДИНИТЬ ВСЕ
								|		
								|		ВЫБРАТЬ
								|			РаботникиОрганизаций.ГрафикРаботы,
								|			РаботникиОрганизаций.Сотрудник
								|		ИЗ
								|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|		ГДЕ
								|			РаботникиОрганизаций.Сотрудник = &Сотрудник
								|			И РаботникиОрганизаций.Период > &НачалоМесяца
								|			И РаботникиОрганизаций.Период <= &КонецМесяца
								|			И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
								|		
								|		ОБЪЕДИНИТЬ ВСЕ
								|		
								|		ВЫБРАТЬ
								|			Работники.ГрафикРаботыЗавершения,
								|			Работники.Сотрудник
								|		ИЗ
								|			РегистрСведений.РаботникиОрганизаций КАК Работники
								|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
								|				ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
								|					И (ПериодыПерекрытия.Период > Работники.Период)
								|					И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
								|		ГДЕ
								|			Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
								|			И Работники.ПериодЗавершения > &НачалоМесяца
								|			И Работники.ПериодЗавершения <= &КонецМесяца
								|			И Работники.ГрафикРаботыЗавершения <> &ПустойГрафик
								|			И ПериодыПерекрытия.Период ЕСТЬ NULL 
								|			И Работники.Сотрудник = &Сотрудник
								|		
								|		ОБЪЕДИНИТЬ ВСЕ
								|		
								|		ВЫБРАТЬ
								|			ВыбранныеСотрудники.Ссылка,
								|			ВыбранныеСотрудники.Ссылка
								|		ИЗ
								|			Справочник.СотрудникиОрганизаций КАК ВыбранныеСотрудники
								|		ГДЕ
								|			ВыбранныеСотрудники.Ссылка = &Сотрудник) КАК ГрафикРаботы1
								|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
								|			ПО ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы = ГрафикРаботы1.ГрафикРаботы
								|		ПО ОтпускаФактическиеПоСотрудникам.Сотрудник = ГрафикРаботы1.Сотрудник1
								|ГДЕ
								|	ОтпускПоУходуЗаРебенком.Сотрудник = &Сотрудник
								|	И ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(перечисление.ВидыУчетаВремени.ПоЧасам)
								|	И ВЫБОР
								|			КОГДА ОтпускПоУходуЗаРебенком.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
								|					И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
								|				ТОГДА ВТГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания
								|			ИНАЧЕ ВТГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачалаФакт И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт
								|		КОНЕЦ
								|
								|СГРУППИРОВАТЬ ПО
								|	ОтпускаФактическиеПоСотрудникам.Регистратор";
								//Островская Татьяна 13.05.2014 № 17349
								запросДок.УстановитьПараметр("ДатаФакт",Дата);
								запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
								запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
								запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
								запросДок.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
								Результ = запросДок.Выполнить();
								//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
								
								//О.Т. Аверсон 02.02.2017 № 248
								ЕстьОтпускПоУходуЗаРеб = Ложь;
								счВидВремени = 1;
								Пока счВидВремени <= 6 Цикл 
									
									Если СтрокаТабличнойЧасти["ВидВремени"+Строка(счВидВремени)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда 
										ЕстьОтпускПоУходуЗаРеб = Истина;
									КонецЕсли;     								
									
									счВидВремени = счВидВремени + 1;
								КонецЦикла;
								//О.Т. Аверсон 02.02.2017 № 248
								
								Если ((КоличествоЗаписей < 7 и не Организация.ИНН = "100765738") или не Результ.Пустой()) и не ЕстьОтпускПоУходуЗаРеб Тогда 
									
									//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
									если Результ.Пустой() тогда
										СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = КлассификаторЯвка;
										СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов; //Островская Татьяна 22.02.2013 № 15797
									иначе
										СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
									КонецЕсли;
									//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
									ВыборкаРез = Результ.Выбрать();
									если ВыборкаРез.Следующий() Тогда  
										если ВыборкаРез.ОсновноеЗначение = Выборка.Часов Тогда 
											если не СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
											иначе//Если не Организация.ИНН = "100765738" Тогда
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;											
											КонецЕсли;
											если не ЯвкаДобавлены и Явка Тогда //О.Т. Аверсон 03.02.2017 № 248
												КоличествоЗаписей = КоличествоЗаписей + 1;
												СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = КлассификаторЯвка;
												ЯвкаДобавлены = Истина;
											КонецЕсли;
										иначе
											если не СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = ВыборкаРез.ДополнительноеЗначение;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = ВыборкаРез.ОсновноеЗначение;
											иначе//Если не Организация.ИНН = "100765738" Тогда
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = ВыборкаРез.ДополнительноеЗначение;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = ВыборкаРез.ОсновноеЗначение;
											КонецЕсли;
											КоличествоЗаписей = КоличествоЗаписей + 1;
											СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = КлассификаторЯвка;
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней - ВыборкаРез.ДополнительноеЗначение;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов - ВыборкаРез.ОсновноеЗначение;
											ЯвкаДобавлены = Истина;
										КонецЕсли;
									иначе
										если не СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
										иначе//Если не Организация.ИНН = "100765738" Тогда
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
										КонецЕсли;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										если не СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
										иначе//Если не Организация.ИНН = "100765738" Тогда
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
										КонецЕсли;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
									//Островская Татьяна 01.04.2014 включение док. ОтпускаПоУходуЗаРебенком
									//Островская Татьяна 04.07.2013 № 16581	
								ИначеЕсли КоличествоЗаписей < 7 и Явка и Организация.ИНН = "100765738" и не ЯвкаДобавлены Тогда 
									СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = КлассификаторЯвка;
									СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
									СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
									ЯвкаДобавлены = Истина;
								КонецЕсли;
								//Островская Татьяна 04.07.2013 № 16581
								//толик					                                          
								Если КоличествоЗаписей < 7 И ПрочиеПроцедуры.ПроверкаНаДействиеВидаНачисления(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("085"), Выборка.Сотрудник, Организация, ДатаНачалаПериода, ДатаОкончанияПериода) Тогда
									СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
									СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
									СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
								КонецЕсли;
								//енд						
								Если КоличествоЗаписей < 7  И Выборка.ЧасовВечерних > 0 Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторВечерниеЧасы;
									СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовВечерних;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
								КонецЕсли;
								//Островская Татьяна 04.07.2013 № 16581	
								Если КоличествоЗаписей < 7  И Выборка.ЧасовНочных > 0 и не Организация.ИНН = "100765738" Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторНочныеЧасы;
									СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовНочных;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
									НочныеДобавлены = Истина;
								ИначеЕсли КоличествоЗаписей < 7  И Ночные и Организация.ИНН = "100765738" и не НочныеДобавлены Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторНочныеЧасы;
									СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовНочных;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									КоличествоЗаписей = КоличествоЗаписей + 1;
									НочныеДобавлены = Истина;
								КонецЕсли;
								Если КоличествоЗаписей < 7  И  ВредностьДоп и Организация.ИНН = "100765738" и не ВредностьДобавлены Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.");
									//СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовВечерних;
									КоличествоЗаписей = КоличествоЗаписей + 1;
									ВредностьДобавлены = Истина;
								КонецЕсли;
								//Островская Татьяна 04.07.2013 № 16581
								Если КоличествоЗаписей < 7  И  Праздники и Организация.ИНН = "100765738" и не ПраздникиДобавлены Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									//СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовВечерних;
									КоличествоЗаписей = КоличествоЗаписей + 1;
									ПраздникиДобавлены = Истина;
								КонецЕсли;  //Островская Татьяна 22.07.2013 № 16636
								//Островская Татьяна 12.03.2014 № 17200
								Если КоличествоЗаписей < 7  И  Сверхурочные и Организация.ИНН = "100765738" и не СверхурочноДобавлены Тогда
									СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
									//СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.ЧасовВечерних;
									КоличествоЗаписей = КоличествоЗаписей + 1;
									СверхурочноДобавлены = Истина;
								КонецЕсли;
								//Островская Татьяна 12.03.2014 № 17200
							Иначе
								
								
								
								
								
								
								
								
								
								ВидВремени = 1;
								//Островская Татьяна 20.03.2014
								
								//О.Т. Аверсон 21.01.2017 № Убрала, когда отпуск весь месяц ставил и явку и отпуск.
								
								//если не Выборка.ВидВремени = КлассификаторЯвка и не ЯвкаДобавлены и ?(Организация.ИНН="100765738",не Выборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники,Истина) Тогда 
								//	если Явка Тогда
								//		СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторЯвка;
								//		СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
								//		СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
								//		//Островская Татьяна 15.04.2014 № 17276
								//		если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
								//			СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
								//		КонецЕсли;
								//		//Островская Татьяна 15.04.2014 № 17276
								//		КоличествоЗаписей = КоличествоЗаписей + 1;
								//		СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
								//		//Островская Татьяна 15.04.2014 № 17276
								//		если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
								//			СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
								//		КонецЕсли;
								//		//Островская Татьяна 15.04.2014 № 17276
								//		ЯвкаДобавлены = Истина;
								//	КонецЕсли;
								//	
								//КонецЕсли;
								
								если не Выборка.ВидВремени = КлассификаторЯвка и не ЯвкаДобавлены Тогда 
									Если Явка Тогда 
										МассивЯвка = РезультатЗапросаДляПроверки.НайтиСтроки(Новый Структура("Сотрудник,Регистратор,ВидВремениСтрока",Выборка.Сотрудник,Выборка.Регистратор,"Я1")); 
										Если МассивЯвка.Количество()> 0 Тогда 
											
											//О.Т. Аверсон 02.02.2017 № 248
											//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
											запросДок = Новый запрос;
											запросДок.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
											запросДок.Текст = ТекстГрафики;
											запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
											запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
											запросДок.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
											запросДок.УстановитьПараметр("Месяц", ПериодРегистрации);
											запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
											запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);						
											запросДок.УстановитьПараметр("ДокументСсылка", Ссылка);
											запросДок.УстановитьПараметр("ПустойДокумент", Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка());
											запросДок.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
											запросДок.Выполнить();
											//Островская Татьяна 13.05.2014 № 17349
											запросДок.Текст = 
											"ВЫБРАТЬ
											|	ОтпускаФактическиеПоСотрудникам.Регистратор КАК Ссылка,
											|	СУММА(ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
											|	СУММА(ВТГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение
											|ИЗ
											|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
											|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
											|		ПО ОтпускаФактическиеПоСотрудникам.Регистратор = ОтпускПоУходуЗаРебенком.Ссылка
											|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
											|			ВЫБОР
											|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
											|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
											|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
											|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
											|			КОНЕЦ КАК ГрафикРаботы,
											|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник1
											|		ИЗ
											|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
											|		ГДЕ
											|			ВЫБОР
											|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
											|							И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
											|						ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
											|					ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
											|				КОНЕЦ <> &ПустойГрафик
											|		
											|		ОБЪЕДИНИТЬ ВСЕ
											|		
											|		ВЫБРАТЬ
											|			РаботникиОрганизаций.ГрафикРаботы,
											|			РаботникиОрганизаций.Сотрудник
											|		ИЗ
											|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
											|		ГДЕ
											|			РаботникиОрганизаций.Сотрудник = &Сотрудник
											|			И РаботникиОрганизаций.Период > &НачалоМесяца
											|			И РаботникиОрганизаций.Период <= &КонецМесяца
											|			И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
											|		
											|		ОБЪЕДИНИТЬ ВСЕ
											|		
											|		ВЫБРАТЬ
											|			Работники.ГрафикРаботыЗавершения,
											|			Работники.Сотрудник
											|		ИЗ
											|			РегистрСведений.РаботникиОрганизаций КАК Работники
											|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
											|				ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
											|					И (ПериодыПерекрытия.Период > Работники.Период)
											|					И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
											|		ГДЕ
											|			Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
											|			И Работники.ПериодЗавершения > &НачалоМесяца
											|			И Работники.ПериодЗавершения <= &КонецМесяца
											|			И Работники.ГрафикРаботыЗавершения <> &ПустойГрафик
											|			И ПериодыПерекрытия.Период ЕСТЬ NULL 
											|			И Работники.Сотрудник = &Сотрудник
											|		
											|		ОБЪЕДИНИТЬ ВСЕ
											|		
											|		ВЫБРАТЬ
											|			ВыбранныеСотрудники.Ссылка,
											|			ВыбранныеСотрудники.Ссылка
											|		ИЗ
											|			Справочник.СотрудникиОрганизаций КАК ВыбранныеСотрудники
											|		ГДЕ
											|			ВыбранныеСотрудники.Ссылка = &Сотрудник) КАК ГрафикРаботы1
											|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
											|			ПО ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы = ГрафикРаботы1.ГрафикРаботы
											|		ПО ОтпускаФактическиеПоСотрудникам.Сотрудник = ГрафикРаботы1.Сотрудник1
											|ГДЕ
											|	ОтпускПоУходуЗаРебенком.Сотрудник = &Сотрудник
											|	И ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(перечисление.ВидыУчетаВремени.ПоЧасам)
											|	И ВЫБОР
											|			КОГДА ОтпускПоУходуЗаРебенком.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
											|					И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
											|				ТОГДА ВТГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания
											|			ИНАЧЕ ВТГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачалаФакт И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт
											|		КОНЕЦ
											|
											|СГРУППИРОВАТЬ ПО
											|	ОтпускаФактическиеПоСотрудникам.Регистратор";
											//Островская Татьяна 13.05.2014 № 17349
											запросДок.УстановитьПараметр("ДатаФакт",Дата);
											запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
											запросДок.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
											запросДок.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
											запросДок.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
											Результ = запросДок.Выполнить();
											//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
											
											Если не Результ.Пустой() Тогда
												ЕстьОтпускПоУходуЗаРеб = Ложь;
												счВидВремени = 1;
												Пока счВидВремени <= 6 Цикл 
													
													Если СтрокаТабличнойЧасти["ВидВремени"+Строка(счВидВремени)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда 
														ЕстьОтпускПоУходуЗаРеб = Истина;
													КонецЕсли;     								
													
													счВидВремени = счВидВремени + 1;
												КонецЦикла;
												Если не ЕстьОтпускПоУходуЗаРеб Тогда 
													
													//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
													
													СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
													//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
													ВыборкаРез = Результ.Выбрать();
													если ВыборкаРез.Следующий() Тогда  
														если ВыборкаРез.ОсновноеЗначение = МассивЯвка[0].Часов Тогда 
															СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Дней;
															СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Часов;											
															
														иначе
															СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = ВыборкаРез.ДополнительноеЗначение;
															СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = ВыборкаРез.ОсновноеЗначение;
															
															КоличествоЗаписей = КоличествоЗаписей + 1;
															СтрокаТабличнойЧасти["ВидВремени" + Строка(КоличествоЗаписей)] = КлассификаторЯвка;
															СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Дней - ВыборкаРез.ДополнительноеЗначение;
															СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Часов - ВыборкаРез.ОсновноеЗначение;
															ЯвкаДобавлены = Истина;
														КонецЕсли;
													КонецЕсли;
													//Островская Татьяна 15.04.2014 № 17276
													если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
														СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
														
													КонецЕсли;
													//Островская Татьяна 15.04.2014 № 17276
													КоличествоЗаписей = КоличествоЗаписей + 1;
													//Островская Татьяна 01.04.2014 включение док. ОтпускаПоУходуЗаРебенком
													//Островская Татьяна 04.07.2013 № 16581	
												КонецЕсли;
											КонецЕсли;
											//О.Т. Аверсон 02.02.2017 № 248						
											счВидВремени = 1;
											ЕстьОтпускПоУходуЗаРеб = Ложь;
											Пока счВидВремени <= 6 Цикл 
												
												Если СтрокаТабличнойЧасти["ВидВремени"+Строка(счВидВремени)] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда 
													ЕстьОтпускПоУходуЗаРеб = Истина;
												КонецЕсли;     								
												
												счВидВремени = счВидВремени + 1;
											КонецЦикла;    
											Если не ЯвкаДобавлены Тогда 
												СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторЯвка;
												
												Если не ЕстьОтпускПоУходуЗаРеб Тогда  											
													СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Дней;
													СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = МассивЯвка[0].Часов;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												КоличествоЗаписей = КоличествоЗаписей + 1;
												СтрокаТабличнойЧасти.ИтогоВредность = МассивЯвка[0].Часов;//Островская Татьяна 22.02.2013 № 15797
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												ЯвкаДобавлены = Истина;
											КонецЕсли;
											
										иначе
											СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторЯвка;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											КоличествоЗаписей = КоличествоЗаписей + 1;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											ЯвкаДобавлены = Истина;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								
								
								//Островская Татьяна 20.03.2014
								
								Если КоличествоЗаписей < 7 Тогда
									//для Каждого стрДоп из РезДоп Цикл 
									если  Выборка.ВидВремени = КлассификаторНочныеЧасы  Тогда 
										если Ночные и не НочныеДобавлены Тогда 
											СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											КоличествоЗаписей = КоличествоЗаписей + 1;
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											НочныеДобавлены = Истина;
										КонецЕсли;
									ИначеЕсли  Выборка.ВидВремени = КлассификаторЯвка Тогда
										если Явка и не ЯвкаДобавлены Тогда
											СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											КоличествоЗаписей = КоличествоЗаписей + 1;
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											ЯвкаДобавлены = Истина;
										КонецЕсли;
									ИначеЕсли  Выборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.") Тогда 
										если ВредностьДоп и не ВредностьДобавлены Тогда
											СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											КоличествоЗаписей = КоличествоЗаписей + 1;
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											ВредностьДобавлены = Истина;
										КонецЕсли;
									ИначеЕсли  Выборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
										если Праздники и не ПраздникиДобавлены Тогда
											Если не (Выборка.Дней = 0 и Выборка.Часов = 0) Тогда //О.Т. Аверсон 20.01.2017 № 192
												СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												КоличествоЗаписей = КоличествоЗаписей + 1;
												СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
												//Островская Татьяна 15.04.2014 № 17276
												если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
													СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
												КонецЕсли;
												//Островская Татьяна 15.04.2014 № 17276
												ПраздникиДобавлены = Истина;
											КонецЕсли;
										иначе
											СтрКолЗаписей = 1;
											Пока СтрКолЗаписей < КоличествоЗаписей Цикл 
												Если СтрокаТабличнойЧасти["ВидВремени"+Строка(СтрКолЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
													СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] + Выборка.Дней;
													СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] + Выборка.Часов;
												КонецЕсли;
												СтрКолЗаписей = СтрКолЗаписей+1;
											КонецЦикла;
											
										КонецЕсли;
										//Островская Татьяна 12.03.2014 № 17200	
									ИначеЕсли  Выборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда
										если Сверхурочные и не СверхурочноДобавлены Тогда
											СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
											СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
											СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											КоличествоЗаписей = КоличествоЗаписей + 1;
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
											//Островская Татьяна 15.04.2014 № 17276
											СверхурочноДобавлены = Истина;
										КонецЕсли;
										//Островская Татьяна 12.03.2014 № 17200
									иначе
										если не Выборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком Тогда 
											СтрКолЗаписей = 1;
											ЗаписьЕсть = Ложь;
											Пока СтрКолЗаписей < КоличествоЗаписей Цикл 
												Если СтрокаТабличнойЧасти["ВидВремени"+Строка(СтрКолЗаписей)] = Выборка.ВидВремени Тогда
													СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] + Выборка.Дней;
													СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] + Выборка.Часов;
													ЗаписьЕсть = Истина;
												КонецЕсли;
												СтрКолЗаписей = СтрКолЗаписей+1;
											КонецЦикла;
											
											Если не ЗаписьЕсть Тогда 
												СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
												КоличествоЗаписей = КоличествоЗаписей + 1;
											КонецЕсли;
											
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли; 
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
										иначеЕсли не Организация.ИНН = "100765738" Тогда
											СтрКолЗаписей = 1;
											ЗаписьЕсть = Ложь;
											Пока СтрКолЗаписей < КоличествоЗаписей Цикл 
												Если СтрокаТабличнойЧасти["ВидВремени"+Строка(СтрКолЗаписей)] = Выборка.ВидВремени Тогда
													СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Дней" + Строка(СтрКолЗаписей)] + Выборка.Дней;
													СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(СтрКолЗаписей)] + Выборка.Часов;
													ЗаписьЕсть = Истина;
												КонецЕсли;
												СтрКолЗаписей = СтрКолЗаписей+1;
											КонецЦикла;
											
											Если не ЗаписьЕсть Тогда
												СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Выборка.ВидВремени;
												СтрокаТабличнойЧасти["Дней" + Строка(КоличествоЗаписей)] = Выборка.Дней;
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = Выборка.Часов;
												КоличествоЗаписей = КоличествоЗаписей + 1;
											КонецЕсли;
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)] = СтрокаТабличнойЧасти["Часов" + Строка(КоличествоЗаписей)]*СтавкаСотрудника;
											КонецЕсли; 
											СтрокаТабличнойЧасти.ИтогоВредность = Выборка.Часов;//Островская Татьяна 22.02.2013 № 15797
											//Островская Татьяна 15.04.2014 № 17276
											если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
												СтрокаТабличнойЧасти.ИтогоВредность = СтрокаТабличнойЧасти.ИтогоВредность*СтавкаСотрудника;
											КонецЕсли;
										КонецЕсли;	
										//Островская Татьяна 15.04.2014 № 17276
										//Островская Татьяна 15.04.2014 № 17276
										
										
										//Островская Татьяна 15.04.2014 № 17276
									КонецЕсли;
									//КонецЦикла;
								КонецЕсли;
							КонецЕсли;
							ОбработкаПрерыванияПользователя();
						КонецЦикла;
						
						// О.Т. 05.12.2014 311
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
						|ИЗ
						|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
						|ГДЕ
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
						|	И ВЫБОР
						|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &Период
						|					И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						|				ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
						|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
						|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
						
						Запрос.УстановитьПараметр("Период", ПериодРегистрации);
						Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
						
						ЕстьВредность = Запрос.Выполнить().Выгрузить();
						
						если ЕстьВредность.Количество()>0 Тогда 
							ЕстьИндивидуальный = Ложь;
							ЗапросАвтоЗаполнения.Текст = 
							"ВЫБРАТЬ
							|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
							|	СУММА(ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
							|	ВТГрафикиРаботыПоВидамВремени.План,
							|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени
							|ИЗ
							|	ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
							|ГДЕ
							|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
							|	И ВТГрафикиРаботыПоВидамВремени.План = &План
							|
							|СГРУППИРОВАТЬ ПО
							|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
							|	ВТГрафикиРаботыПоВидамВремени.План,
							|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
							
							ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
							ЗапросАвтоЗаполнения.УстановитьПараметр("План", Истина);
							
							РезультатГрафик = ЗапросАвтоЗаполнения.Выполнить().Выбрать();
							
							Пока РезультатГрафик.Следующий() Цикл
								если ТипЗнч(РезультатГрафик.ГрафикРаботы) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда 
									ЕстьИндивидуальный = Истина;
									ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
								КонецЕсли;
								если не ЕстьИндивидуальный Тогда 
									ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
								КонецЕсли;
								
								
							КонецЦикла;
							если не(СтрокаТабличнойЧасти.ИтогоВредность < ГрафикЧасов и СтрокаТабличнойЧасти.ИтогоВредность > 0) Тогда 
								СтрокаТабличнойЧасти.ИтогоВредность = ГрафикЧасов;
							КонецЕсли;
							
						иначе
							СтрокаТабличнойЧасти.ИтогоВредность = 0;
							
						КонецЕсли;
						// О.Т. 05.12.2014 311
						ПеремДляСнятия = ПеремДляСнятия+1;
						Если Организация.ИНН="100765738" Тогда
							РегистраторПрошл = Выборка.Регистратор;
						КонецЕсли;
					КонецЦикла;
					СотрудникПрошлый = Выборка.Сотрудник; //Островская Татьяна 30.07.2013 № 16636
					ОбработкаПрерыванияПользователя();//О.Т. 22.05.2015 №
				КонецЦикла;
				//Островская Татьяна 04.07.2013 № 16581
				если ВидВремени = 1 и Организация.ИНН = "100765738" Тогда 
					КлассифНочные = Ложь;
					КлассифЯвка = Ложь;
					КлассифВрДоп = Ложь;
					КлассифПраздники = Ложь;
					КлассифСверхурочно = Ложь; //Островская Татьяна 12.03.2014 № 17200
					
					Отбор1 = Новый Структура();
					Отбор1.Вставить("Сотрудник",СтрокаТабличнойЧасти.Сотрудник);
					РезДоп = РезультатЗапроса.Выгрузить().НайтиСтроки(Отбор1);
					для Каждого стрДоп из РезДоп Цикл 
						если  стрДоп.ВидВремени = КлассификаторНочныеЧасы Тогда 
							КлассифНочные = истина;
						ИначеЕсли  стрДоп.ВидВремени = КлассификаторЯвка Тогда 
							КлассифЯвка = истина;
						ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.") Тогда 
							КлассифВрДоп = истина;
						ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда 
							КлассифПраздники = истина;
						ИначеЕсли  стрДоп.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные Тогда 
							КлассифСверхурочно = истина; //Островская Татьяна 12.03.2014 № 17200
							
						КонецЕсли;
					КонецЦикла;
					если не КлассифНочные и Ночные Тогда 
						Если КоличествоЗаписей < 7 и не НочныеДобавлены Тогда
							СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторНочныеЧасы;
							КоличествоЗаписей = КоличествоЗаписей + 1;
							НочныеДобавлены = Истина;
						КонецЕсли;
					КонецЕсли;
					если не КлассифЯвка и Явка Тогда 
						Если КоличествоЗаписей < 7 и не ЯвкаДобавлены Тогда
							СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = КлассификаторЯвка;
							КоличествоЗаписей = КоличествоЗаписей + 1;
							ЯвкаДобавлены = Истина;
						КонецЕсли;
					КонецЕсли;
					если не КлассифВрДоп  и ВредностьДоп Тогда 
						Если КоличествоЗаписей < 7 и не ВредностьДобавлены Тогда
							СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.");
							КоличествоЗаписей = КоличествоЗаписей + 1;
							ВредностьДобавлены = Истина;
						КонецЕсли;
					КонецЕсли;
					если не КлассифПраздники  и Праздники Тогда 
						Если КоличествоЗаписей < 7 и не ПраздникиДобавлены Тогда
							СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
							КоличествоЗаписей = КоличествоЗаписей + 1;
							ПраздникиДобавлены = Истина;
						КонецЕсли;
					КонецЕсли; //Островская Татьяна 22.07.2013 № 16636
					//Островская Татьяна 12.03.2014 № 17200
					если не КлассифСверхурочно  и Сверхурочные Тогда 
						Если КоличествоЗаписей < 7 и не СверхурочноДобавлены Тогда
							СтрокаТабличнойЧасти["ВидВремени"+Строка(КоличествоЗаписей)] = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные;
							КоличествоЗаписей = КоличествоЗаписей + 1;
							СверхурочноДобавлены = Истина;
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 12.03.2014 № 17200
				КонецЕсли;
				//Островская Татьяна 04.07.2013 № 16581
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	//ПСА 14-12-2020 СВФР-006930 +++
	ОтборПустыхСтрок = Новый Структура;
	Для йй = 1 по 31 Цикл
		ОтборПустыхСтрок.Вставить("ПервыйЧасов"+йй,0); 
		ОтборПустыхСтрок.Вставить("ВторойЧасов"+йй,0);
		ОтборПустыхСтрок.Вставить("ТретийЧасов"+йй,0);
	КонецЦикла;	
	НайденныеСтроки = ОтработанноеВремя.НайтиСтроки(ОтборПустыхСтрок);
	Если НайденныеСтроки.Количество()> 0 Тогда
		Для Каждого СтрокаТЧ из НайденныеСтроки Цикл
			ОтработанноеВремя.Удалить(СтрокаТЧ);			      
		КонецЦикла;	
	КонецЕсли;	
	//+++ПСА 14-12-2020 СВФР-006930 
	
	//Аверсон 07.07.2021 КВВ СВФР-007801 ( (пункт 8)
	Если Организация.ИНН = "700067572" И НЕ ВключатьУволенных Тогда	
		ЗпоУв = Новый Запрос;
		ЗпоУв.Текст = "ВЫБРАТЬ
		|РаботникиОрганизаций.Период,
		|РаботникиОрганизаций.Сотрудник
		|ПОМЕСТИТЬ ВтУволенные
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)
		|И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
		|И РаботникиОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаПроверки,МЕСЯЦ),ДЕНЬ,1) И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаПроверки,МЕСЯЦ),ДЕНЬ,1)
		|;
		|ВЫБРАТЬ 
		|Табель.Сотрудник,
		|Табель.Ссылка
		|ИЗ Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК Табель
		|ГДЕ 
		|Табель.Ссылка.Проведен
		|И Табель.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.СтатусДокумента.Проверен)
		|И Табель.Ссылка.ПериодРегистрации = &ДатаПроверки
		|И Табель.Сотрудник В (ВЫБРАТЬ
		|ВтУволенные.Сотрудник
		|ИЗ ВтУволенные)";
		ЗпоУв.УстановитьПараметр("ДатаПроверки",НачалоМесяца(ПериодРегистрации));
		ЗпоУв.УстановитьПараметр("СписокСотрудников",СписокСотрудников);
		ТЗЗпоУв = ЗпоУв.Выполнить().Выгрузить();
		Для Каждого СтрТЗЗпоУв ИЗ ТЗЗпоУв Цикл
			НайденныеСтроки = ОтработанноеВремя.НайтиСтроки(Новый Структура("Сотрудник", СтрТЗЗпоУв.Сотрудник));
			Если НайденныеСтроки.Количество()> 0 Тогда
				Для Каждого СтрокаТЧ из НайденныеСтроки Цикл
					ОтработанноеВремя.Удалить(СтрокаТЧ);			      
				КонецЦикла;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон 07.07.2021 КВВ СВФР-007801 )
	
	//Аверсон ЕАЕ 14.11.2024 СВФР-013927
	//Боруйскводоканал
	Если Организация.ИНН = "790041382" Тогда
		ЗаполнитьНочныеСверхурочные();
	КонецЕсли;
	//Аверсон СВФР-013927
	
	//Аверсон ЕАЕ 10.02.2025 СВФР-014831
	//Командировки в выходной день
	ЗаполнитьПраздничныеВДниКомандировки();
	//Аверсон СВФР-014831
	
	//Аверсон ЕАЕ 29.08.2025 СВФР-016583
	Если ТЗ_НеявкиКопия <> Неопределено Тогда
		ЗаполнитьОтпускВВыходныеДни(ТаблицаОбщиеГрафики, ТЗ_НеявкиКопия, МассивПраздников); //Аверсон ЕАЕ 16.01.2026 СВФР-017761 параметр МассивПраздников
	КонецЕсли;
	//Аверсон СВФР-016583
	
КонецФункции // Автозаполнение()

#Если Клиент Тогда
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	// Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//	НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		НужноОтменятьПроведениеДока = Ложь;
		
		//Аверсон 06.09.2021 КВВ СВФР-007989 (
		Печатать_ТабельНовИзДок = Ложь;
		Если ИмяМакета = "ТабельНовИзДок" Тогда
			Если ЭтоНовый() Тогда
				Предупреждение("Перед печатью документ должен быть записан!");
			Иначе
				Печатать_ТабельНовИзДок = Истина;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 06.09.2021 КВВ СВФР-007989 )
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Табель" или ИмяМакета = "ТабельРасшифровка" или ИмяМакета = "ТабельНов" ИЛИ Печатать_ТабельНовИзДок Тогда  //Аверсон 06.09.2021 КВВ СВФР-007989 (Печатать_ТабельНовИзДок)
			Если НЕ Печатать_ТабельНовИзДок Тогда //Аверсон 06.09.2021 КВВ СВФР-007989
				Если Не Проведен И СтатусДокумента = Перечисления.СтатусДокумента.Проверен Тогда   
					Предупреждение("Документ можно распечатать только после его проведения!");
					Возврат Неопределено;
					//Аверсон 03.10.2019 КВВ СВФР-004817 (
				ИначеЕсли Не Проведен И СтатусДокумента = Перечисления.СтатусДокумента.Заполнение Тогда
					Состояние("Формируются предварительные данные для вывода на печать (создаются движения по регистрам)  . . . ");
					Записать(РежимЗаписиДокумента.Проведение);
					НужноОтменятьПроведениеДока = Истина;
				КонецЕсли;
				//Аверсон 03.10.2019 КВВ СВФР-004817 )
			КонецЕсли;
			
			ФильтрСоответствия = Новый Соответствие;
			
			ФильтрСоответствия.Вставить("Организация", Организация);
			ФильтрСоответствия.Вставить("Подразделение", ПодразделениеОрганизации);
			ФильтрСоответствия.Вставить("ДатаАктуальности", ПериодРегистрации);
			ФильтрСоответствия.Вставить("ДокументТабель", Ссылка);
			Если ИмяМакета = "ТабельРасшифровка" Тогда
				ФильтрСоответствия.Вставить("ПечатьНеявок", Истина);
			КонецЕсли;
			
			ТабДокумент = Новый ТабличныйДокумент;	
			
			Отчет = Отчеты.ТабельУчетаРабочегоВремени.Создать();
			Отчет.УстановитьФильтр(ФильтрСоответствия);
			Отчет.СформироватьОтчет(ТабДокумент,,ИмяМакета);
			
			ФормаПечати = ПолучитьОбщуюФорму("ПечатьДокументовЛандшафт",, ТабДокумент);
			ФормаПечати.ПечатныйДокумент = ТабДокумент;
			
			//Аверсон 03.10.2019 КВВ СВФР-004817 (
			Если НужноОтменятьПроведениеДока Тогда
				Состояние("Формируются предварительные данные для вывода на печать (удаляются движения по регистрам) . . . ");
				Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			//Аверсон 03.10.2019 КВВ СВФР-004817 )
			
			ФормаПечати.Открыть();
			Возврат ФормаПечати;
			
		КонецЕсли;
		
	КонецФункции // Печать()
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	//Аверсон 12.02.2021 КВВ СВФР-007187 (
	Организация_ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если Организация_.ИНН = "700067572" Тогда
		//Аверсон 06.09.2021 КВВ СВФР-007989 (
		//СтруктураМакетов.Вставить("ТабельНов",	"Табель Бобруйск");   
		СтруктураМакетов.Вставить("ТабельНовИзДок",	"Табель Бобруйск");
		Если СокрЛП(глЗначениеПеременной("глТекущийПользователь")) = "averson" Тогда
			СтруктураМакетов.Вставить("ТабельНов",	"Табель Бобруйск из регистров");
		КонецЕсли;
		//Аверсон 06.09.2021 КВВ СВФР-007989 )
		
	Иначе	
		//Аверсон 12.02.2021 КВВ СВФР-007187 )
		//Если СтатусДокумента = Перечисления.СтатусДокумента.Проверен Тогда 
		//	СтруктураМакетов.Вставить("Табель",	"Табель");
		//	СтруктураМакетов.Вставить("ТабельНов",	"Табель 2");
		//	СтруктураМакетов.Вставить("ТабельРасшифровка",	"Табель (неявок)");
		//Иначе
		//	СтруктураМакетов.Вставить("Табель",	"Табель"); //Аверсон 03.10.2019 КВВ СВФР-004817
		//	//Аверсон 31.12.2021 КВВ СВФР-008495 (
		//	Если Организация_.ИНН = "100010315"  //Ортопеды
		//		ИЛИ Организация_.ИНН = "700176068" ИЛИ Организация_.ИНН = "400230097" ИЛИ Организация_.ИНН = "300000265" ИЛИ Организация_.ИНН = "500158130" ИЛИ Организация_.ИНН = "200400628" Тогда //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
		//		СтруктураМакетов.Вставить("ТабельНов",	"Табель 2");
		//	КонецЕсли;
		//	//Аверсон 31.12.2021 КВВ СВФР-008495 )
		//КонецЕсли;
		
		//Аверсон ЕАЕ 23.10.2025 СВФР-017024
		Если Организация_.ИНН = "500036445" ИЛИ Организация_.ИНН = "500826909" Тогда
			СтруктураМакетов.Вставить("ТабельСНастройкой", "Табель (с настройкой)");
		иначе
			Если СтатусДокумента = Перечисления.СтатусДокумента.Проверен Тогда 
				СтруктураМакетов.Вставить("Табель",	"Табель");
				СтруктураМакетов.Вставить("ТабельНов",	"Табель 2");
				СтруктураМакетов.Вставить("ТабельРасшифровка",	"Табель (неявок)");
			Иначе
				СтруктураМакетов.Вставить("Табель",	"Табель"); //Аверсон 03.10.2019 КВВ СВФР-004817
				//Аверсон 31.12.2021 КВВ СВФР-008495 (
				Если Организация_.ИНН = "100010315"  //Ортопеды
					ИЛИ Организация_.ИНН = "700176068" ИЛИ Организация_.ИНН = "400230097" ИЛИ Организация_.ИНН = "300000265" ИЛИ Организация_.ИНН = "500158130" ИЛИ Организация_.ИНН = "200400628" Тогда //Аверсон 30.05.2022 КВВ СВФР-009137 (пункт 1) + 5 УНП Ортопедов
					СтруктураМакетов.Вставить("ТабельНов",	"Табель 2");
				КонецЕсли;
				//Аверсон 31.12.2021 КВВ СВФР-008495 )
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-017024
		
	КонецЕсли;
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция возвращает значение перечислеиня ВидыУчетаВремени, соответствующее 
// справочнику КлассификаторИспользованияРабочегоВремени.
Функция ПолучитьВидУчетаВремениПоКлассификатору(ВидВремени)
	
	Если ВидВремени.Пустая() Тогда
		Возврат ВидУчетаВремениПоЧасам;
	ИначеЕсли ВидВремени = КлассификаторВечернееВремя Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
	ИначеЕсли ВидВремени = КлассификаторНочноеВремя Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
		//толик
	ИначеЕсли ВидВремени = КлассификаторВредность Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоВредность;
	Иначе
		Возврат ВидУчетаВремениПоЧасам;
	КонецЕсли;
	
КонецФункции

// процедура проверяет, нет ли уже аналогичных записей с ключевыми полями в регистре сведений
// ГрафикиРаботыПоВидамВремени.
// Возвращает Истина если проведение возможно, иначе Ложь.
Процедура ПроверитьУникальностьЗаписи(Отказ, Заголовок = "")
	
	ЗапросПроверкаУникальности = Новый Запрос;
	
	ЗапросПроверкаУникальности.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросПроверкаУникальности.УстановитьПараметр("Месяц", ПериодРегистрации);
	ЗапросПроверкаУникальности.УстановитьПараметр("НачалоМесяца", ДатаНачалаПериода);
	ЗапросПроверкаУникальности.УстановитьПараметр("КонецМесяца", ДатаОкончанияПериода);
	
	ЗапросПроверкаУникальности.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(РабочееВремяРаботниковОрганизаций.Регистратор, ГрафикиРаботыПоВидамВремени.Документ)) КАК ДокументПредставление,
	|	ЕСТЬNULL(СотрудникиТабеля.Сотрудник.Наименование, ГрафикиРаботыПоВидамВремени.ГрафикРаботы.Наименование) КАК СотрудникНаименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПоДням.Сотрудник КАК Сотрудник
	|	ИЗ
	|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТаблицаПоДням
	|	ГДЕ
	|		ТаблицаПоДням.Ссылка = &ДокументСсылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВЦеломЗаПериод.Сотрудник
	|	ИЗ
	|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТаблицаВЦеломЗаПериод
	|	ГДЕ
	|		ТаблицаВЦеломЗаПериод.Ссылка = &ДокументСсылка) КАК СотрудникиТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО РабочееВремяРаботниковОрганизаций.Сотрудник = СотрудникиТабеля.Сотрудник
	|			И (РабочееВремяРаботниковОрганизаций.Регистратор <> &ДокументСсылка)
	|			И (РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод
	|					И РабочееВремяРаботниковОрганизаций.Период = &Месяц
	|				ИЛИ (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
	|					И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоМесяца И &КонецМесяца))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СотрудникиТабеля.Сотрудник
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
	|			И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка)
	|			И (НЕ ГрафикиРаботыПоВидамВремени.План)
	|			И (НЕ ГрафикиРаботыПоВидамВремени.Документ В (ЗНАЧЕНИЕ(Документ.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.СдельныйНаряд.ПустаяСсылка)))
	|ГДЕ
	|	((НЕ РабочееВремяРаботниковОрганизаций.НомерСтроки ЕСТЬ NULL )
	|			ИЛИ (НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ))";
	
	ВыборкаРезультата = ЗапросПроверкаУникальности.Выполнить().Выбрать();
	Если ВыборкаРезультата.Количество() > 0 Тогда
		СтрокаСотрудников = "";
		
		Пока ВыборкаРезультата.Следующий() Цикл
			СтрокаСотрудников = СтрокаСотрудников + Символы.ПС + ВыборкаРезультата.СотрудникНаименование+ " ("+ВыборкаРезультата.ДокументПредставление+")";
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьОбОшибке("На следующих сотрудников уже введены документы учета отработанного времени в этом периоде" + СтрокаСотрудников,Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьУникальностьЗаписи()	

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ГоловнаяОрганизация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой вводится табель!", Отказ, Заголовок);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	// Статус документа
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.СтатусДокумента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан статус!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура удаляет все записи из регистра за ПериодРегистрации,
// если документ последний в этом периоде, в разрезе сотрудников
Процедура УдалитьЗаписиЗаПериодДокумента()
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботы.ГрафикРаботы,
	|	ГрафикиРаботы.Месяц
	|ПОМЕСТИТЬ ВТСотрудникоМесяц
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.Документ = &Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|СотрудникоМесяц.ГрафикРаботы КАК Сотрудник,
	|СотрудникоМесяц.Месяц КАК Месяц,
	|ВЫБОР 
	|	КОГДА ВведенныеДокументы.ГрафикРаботы ЕСТЬ NULL 
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК УдалятьЗаписиЗаПериод
	|
	|ИЗ
	|	ВТСотрудникоМесяц КАК СотрудникоМесяц
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	(ВЫБРАТЬ
	|	СотрудникоМесяц.ГрафикРаботы,
	|	СотрудникоМесяц.Месяц
	|	ИЗ
	|		ВТСотрудникоМесяц КАК СотрудникоМесяц
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|	ПО
	|		ГрафикиРаботы.ГрафикРаботы = СотрудникоМесяц.ГрафикРаботы
	|		И НЕ ГрафикиРаботы.План
	|		И ГрафикиРаботы.Месяц = СотрудникоМесяц.Месяц
	|		И ГрафикиРаботы.Документ <> &Документ
	|		И ГрафикиРаботы.Документ <> ЗНАЧЕНИЕ(Документ.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка)
	|	)КАК ВведенныеДокументы
	|ПО
	|	ВведенныеДокументы.ГрафикРаботы = СотрудникоМесяц.ГрафикРаботы
	|	И ВведенныеДокументы.Месяц = СотрудникоМесяц.Месяц";
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		НаборЗаписей.Отбор.План.Установить(Ложь);
		НаборЗаписей.Отбор.ГрафикРаботы.Установить(ВыборкаЗапроса.Сотрудник);
		НаборЗаписей.Отбор.Месяц.Установить(ВыборкаЗапроса.Месяц);
		
		Если ВыборкаЗапроса.УдалятьЗаписиЗаПериод Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		Иначе
			
			НаборЗаписей.Прочитать();
			Для Каждого Запись Из НаборЗаписей Цикл
				Если (Запись.Документ = Ссылка) Тогда
					Запись.ОсновноеЗначениеПолное = 0;
					Запись.ДополнительноеЗначениеПолное = 0;
					Запись.Документ = Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка();
				КонецЕсли;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  // УдалитьЗаписиЗаПериодДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизации.Дата,
	|	ТабельУчетаРабочегоВремениОрганизации.ПериодРегистрации,
	|	ТабельУчетаРабочегоВремениОрганизации.СпособВводаДанных,
	|	ТабельУчетаРабочегоВремениОрганизации.ДатаНачалаПериода,
	|	ТабельУчетаРабочегоВремениОрганизации.ДатаОкончанияПериода,
	|	ТабельУчетаРабочегоВремениОрганизации.ПодразделениеОрганизации,
	|	ТабельУчетаРабочегоВремениОрганизации.СтатусДокумента,
	|	ВЫБОР
	|		КОГДА ТабельУчетаРабочегоВремениОрганизации.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА ТабельУчетаРабочегоВремениОрганизации.Организация
	|		ИНАЧЕ ТабельУчетаРабочегоВремениОрганизации.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ТабельУчетаРабочегоВремениОрганизации.Организация Как Организация,
	|	ТабельУчетаРабочегоВремениОрганизации.Ссылка КАК Документ
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации КАК ТабельУчетаРабочегоВремениОрганизации
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "ОтработанноеВремя" документа
//
// Параметры:
//	ВыборкаПоШапкеДокумента
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДокументСсылка",			 Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	 ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Месяц", 					 ВыборкаПоШапкеДокумента.ПериодРегистрации);
	
	ИндексНачальногоДня = День(ВыборкаПоШапкеДокумента.ДатаНачалаПериода);
	СтрИндексДня = Строка(ИндексНачальногоДня);
	//Островская Татьяна 13.02.2013 № 15797
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки КАК НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" КАК ВидВремени,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов"+СтрИндексДня+" КАК Часов,
	|		"+СтрИндексДня+" КАК ИндексДня,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|ПОМЕСТИТЬ ВТДанныеТабеляПоДням
	|	ИЗ
	|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность))
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов"+СтрИндексДня+",
	|		"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|	ИЗ
	|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+" НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+",
	|		"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|	ИЗ
	|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+"  НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
	|";
	
	ИндексКонечногоДня = День(ВыборкаПоШапкеДокумента.ДатаОкончанияПериода);
	Для ИндексДня = ИндексНачальногоДня + 1 По ИндексКонечногоДня Цикл
		СтрИндексДня = Строка(ИндексДня);
		Запрос.Текст = Запрос.Текст + 
		"	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка))
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+"  НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+"  НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
		|
		|";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + 
	"ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	
	Запрос.Выполнить();
	ДанныеТабеляПоДнямТекст = "ВТДанныеТабеляПоДням";
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбщийЗапрос.Сотрудник,
	|	ОбщийЗапрос.ДеньМесяца,
	|	ЕСТЬNULL(ОбщийЗапрос.ВидВремени, ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)) КАК ВидВремени,
	|	СУММА(ЕСТЬNULL(ОбщийЗапрос.Часов, 0)) КАК Часов,
	|	МАКСИМУМ(ВЫБОР 
	|				КОГДА ОбщийЗапрос.ЗаписатьПустогоСотрудника ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ЗаписатьПустоеЗначение,
	|	МАКСИМУМ(ЕСТЬNULL(ОбщийЗапрос.НомерСтроки, 0)) КАК НомерСтроки,
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА ОбщийЗапрос.ПроверкаСотрудникаИОрганизации ЕСТЬ NULL 
	|					ТОГДА ЛОЖЬ
	|				КОГДА ОбщийЗапрос.ПроверкаСотрудникаИОрганизации.Организация = &ГоловнаяОрганизация
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	МАКСИМУМ(ЕСТЬNULL(ОбщийЗапрос.КоличествоДублей, 0)) КАК КоличествоДублей,
	|	СУММА(ЕСТЬNULL(ОбщийЗапрос.ИтогоВредность, 0)) как ИтогоВредность
	
	|	ИЗ
	|	(
	|		ВЫБРАТЬ
	|			СотрудникиДокумента.Сотрудник,
	|			ДанныеТабеляПоДням.ИндексДня КАК ДеньМесяца,
	|			ДанныеТабеляПоДням.ВидВремени КАК ВидВремени,
	|			ДанныеТабеляПоДням.Часов КАК Часов,
	|			ДанныеТабеляПоДням.Сотрудник КАК ЗаписатьПустогоСотрудника,
	|			ДанныеТабеляПоДням.НомерСтроки КАК НомерСтроки,
	|			СотрудникиДокумента.Сотрудник КАК ПроверкаСотрудникаИОрганизации,
	|			СотрудникиДокумента.КоличествоДублей КАК КоличествоДублей,
	|			ДанныеТабеляПоДням.ИтогоВредность КАК ИтогоВредность
	|		ИЗ
	|			(ВЫБРАТЬ
	|			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник,
	|			КОЛИЧЕСТВО(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник) КАК КоличествоДублей,
	|			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|		ГДЕ
	|			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка) КАК СотрудникиДокумента
	|				ЛЕВОЕ СОЕДИНЕНИЕ " + ДанныеТабеляПоДнямТекст + " КАК ДанныеТабеляПоДням
	|				ПО ДанныеТабеляПоДням.Сотрудник = СотрудникиДокумента.Сотрудник		
	|		 	
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			Сотрудники.Сотрудник КАК Сотрудник,
	|			Даты.ИндексДня КАК ИндексДня,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL,
	|			NULL
	|		ИЗ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|					ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник
	|						И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
	|						И ((НЕ ГрафикиРаботыПоВидамВремени.План))
	|			ГДЕ
	|				ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|				И ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ) КАК Сотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ (";
	
	Для ИндексДня = День(НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)) По День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)) Цикл
		ТекстЗапроса = ТекстЗапроса + 
		"	ВЫБРАТЬ " + Строка(ИндексДня) + " КАК ИндексДня
		|	ОБЪЕДИНИТЬ ВСЕ";
	КонецЦикла;
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-14) + " ) КАК Даты
	|			ПО (ИСТИНА)
	|	) КАК ОбщийЗапрос
	|	СГРУППИРОВАТЬ ПО Сотрудник, ДеньМесяца, ВидВремени
	|	УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДеньМесяца";
	//Островская Татьяна 13.02.2013 № 15797
	
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтработанноеВремя()

// Формирует запрос по таблице "ОтработанноеВремяВЦеломЗаПериод" документа
//
// Параметры:
//	ВыборкаПоШапкеДокумента
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоОтработанноеВремяВЦеломЗаПериод(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	//Островская Татьяна 13.02.2013 № 15797
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник КАК Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация КАК Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени1 КАК ВидИспользованияРабочегоВремени,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней1 КАК Дней,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов1 КАК Часов,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ПОМЕСТИТЬ ВТОтработанноеВремяВЦеломЗаПериод
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени1 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени2 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени3 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени4 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени5 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Сотрудник.Организация,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ФизЛицо,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Дней6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Часов6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ИтогоВредность,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаНачала,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ДатаОкончания
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремяВЦеломЗаПериод КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремяВЦеломЗаПериод.ВидВремени6 <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ВидИспользованияРабочегоВремени";
	Запрос.Выполнить();
	ТаблицаДокументаТекст = "ВТОтработанноеВремяВЦеломЗаПериод";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Сотрудник,
	|	ТаблицаДокумента.ВидИспользованияРабочегоВремени,
	|	ТаблицаДокумента.Дней,
	|	ТаблицаДокумента.Часов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	Дубли.КоличествоДублей,
	|	ТаблицаДокумента.ИтогоВредность,
	|	ТаблицаДокумента.ДатаНачала,
	|	ТаблицаДокумента.ДатаОкончания
	|ИЗ " + ТаблицаДокументаТекст + " КАК ТаблицаДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		Дубли.Сотрудник КАК Сотрудник,";
	Если Организация.ИНН = "100765738" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|		Дубли.ДатаНачала как ДатаНачала,";	
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		Дубли.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|		КОЛИЧЕСТВО(Дубли.Сотрудник) КАК КоличествоДублей
	|	ИЗ
	|		" + ТаблицаДокументаТекст + " КАК Дубли
	|
	|	СГРУППИРОВАТЬ ПО
	|		Дубли.Сотрудник,";
	Если Организация.ИНН = "100765738" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|		Дубли.ДатаНачала,";	
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	
	|		Дубли.ВидИспользованияРабочегоВремени) КАК Дубли
	|	ПО Дубли.Сотрудник = ТаблицаДокумента.Сотрудник
	|		И Дубли.ВидИспользованияРабочегоВремени = ТаблицаДокумента.ВидИспользованияРабочегоВремени";
	Если Организация.ИНН = "100765738" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|		И ТаблицаДокумента.ДатаНачала = Дубли.ДатаНачала";	
	КонецЕсли;
	
	
	//Островская Татьяна 13.02.2013 № 15797
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтработанноеВремяВЦеломЗаПериод()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтработанноеВремя" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа,
//	Отказ						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "")
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Отработанное время"": ";
	
	Если ВыборкаПоСтрокамДокумента.НомерСтроки = 0 Тогда // это строка-дополнение
		Возврат
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка дублирования сотрудников
	Если ВыборкаПоСтрокамДокумента.КоличествоДублей > 1 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "обнаружен сотрудник, который введен второй раз!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиОтработанноеВремя()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтработанноеВремяВЦеломЗаПериод" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа,
//	Отказ						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиОтработанноеВремяВЦеломЗаПериод(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "")
	СтрокаНачалаСообщенияОбОшибке = "В строке табл. части ""Отработанное время"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка дублирования сотрудников
	Если ВыборкаПоСтрокамДокумента.КоличествоДублей > 1 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "обнаружен сотрудник, который введен второй раз!", Отказ, Заголовок);
	КонецЕсли;
	
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидИспользованияРабочегоВремени
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано использование рабочего времени!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиОтработанноеВремяВЦеломЗаПериод()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.Период								= ВыборкаПоШапкеДокумента.ПериодРегистрации;
	
	//О.Т. Аверсон 13.12.2016 № 100
	Если Организация.ИНН = "100765738" Тогда 
		Движение.ДатаНачала                         = ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.ДатаОкончания                      = ВыборкаПоСтрокамДокумента.ДатаОкончания;  		
	иначе
		Движение.ДатаНачала                     = НачалоМесяца(ПериодРегистрации);
		Движение.ДатаОкончания                  = КонецМесяца(ПериодРегистрации);
	КонецЕсли;
	//О.Т. Аверсон 13.12.2016 № 100
	
	// Измерения
	Движение.Сотрудник							= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.ВидИспользованияРабочеговремени	= ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени;
	
	// Ресурсы
	Движение.Дней								= ВыборкаПоСтрокамДокумента.Дней;
	Движение.Часов								= ВыборкаПоСтрокамДокумента.Часов;
	
	// Реквизиты
	Движение.ВЦеломЗаПериод						= Истина;
	
КонецПроцедуры // ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРабочееВремяРаботниковОрганизацийПоДням(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей,Часов,ВыборкаПоОтработанноеВремяТЗ, ТЗСокращенноеВремя, ТЗСтавки=Неопределено) //Аверсон 22.10.2020 КВВ СВФР-006708 (пятый параметр) //Аверсон 03.06.2021 КВВ СВФР-007546 (6 и 7 параметры)
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	
	//О.Т. Аверсон 13.12.2016 № 100
	Движение.ДатаНачала                         = НачалоДня(Движение.Период);
	Движение.ДатаОкончания                      = КонецДня(Движение.Период);
	//О.Т. Аверсон 13.12.2016 № 100
	
	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоСтрокамДокумента.ВидВремени;
	
	// Ресурсы
	Если ВыборкаПоСтрокамДокумента.ВидВремени.УчитыватьТолькоДни Тогда
		//Аверсон 28.09.2021 КВВ СВФР-008198 (
		//Движение.Дней = ?(ВыборкаПоСтрокамДокумента.Часов=0, ВыборкаПоСтрокамДокумента.Дней, ВыборкаПоСтрокамДокумента.Часов);
		Если ВыборкаПоСтрокамДокумента.Часов=0 Тогда
			Попытка
				Движение.Дней = ВыборкаПоСтрокамДокумента.Дней;
			Исключение
				Движение.Дней = 0;
			КонецПопытки;
		Иначе
			Движение.Дней = ВыборкаПоСтрокамДокумента.Часов;
		КонецЕсли;
		//Аверсон 28.09.2021 КВВ СВФР-008198 )
		
	Иначе
		//заявка №1979 (база заявок Кристалла) Дмитрук О.Г. 
		Если НачалоМесяца(ПериодРегистрации) >= Дата('20110601') Тогда
			//Аверсон 03.06.2021 КВВ СВФР-007546 ( (закомментировано) 
			////Аверсон-софт, Островская Татьяна 12.03.2012
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			//|	ГрафикиРаботыПоВидамВремени.Месяц,
			//|	ГрафикиРаботыПоВидамВремени.План,
			//|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение КАК ОснЗначение,
			//|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК ДопЗначение,
			//|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
			//|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
			//|	ГрафикиРаботыПоВидамВремени.ВидВремени КАК ВидВремени
			//|ИЗ
			//|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			//|ГДЕ
			//|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
			//|	И ГрафикиРаботыПоВидамВремени.План = &Истина
			//|	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
			//|	И ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение <> 0
			//|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> &ВидУчетаВремени";
			//
			//Запрос.УстановитьПараметр("ГрафикРаботы", ВыборкаПоСтрокамДокумента.Сотрудник);
			//Запрос.УстановитьПараметр("Истина", Истина);
			//Запрос.УстановитьПараметр("Месяц",ВыборкаПоШапкеДокумента.ПериодРегистрации);
			//Запрос.УстановитьПараметр("ВидУчетаВремени",Перечисления.ВидыУчетаВремени.ПоДням);
			//
			//Результат = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = Результат.Выбрать();
			//Аверсон 03.06.2021 КВВ СВФР-007546 ) (закомментировано)
			
			//Аверсон 03.06.2021 КВВ СВФР-007546 (
			ТЗДетальныеЗаписи = ПроизводительностьПовторноеИспользование.ПолучитьГрафикиПоСотрудникам(ВыборкаПоСтрокамДокумента.Сотрудник, ВыборкаПоШапкеДокумента.ПериодРегистрации); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
			
			//если Результат.Пустой() тогда 
			Если ТЗДетальныеЗаписи.Количество()=0 Тогда
				//Ставка = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Движение.Период,Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник)).ЗанимаемыхСтавок;//О.Т. Аверсон 06.12.2017 № 1322
				Ставка = ПроизводительностьПовторноеИспользование.ПолучитьСтавкуСотрудника(Движение.Период, ВыборкаПоСтрокамДокумента.Сотрудник);
				
				//Аверсон 21.08.2020 КВВ СВФР-006439 (
				НормаЧ = Часов.НормаЧасов;
				//СокращЧ = СокращенныеЧасыВДате(ВыборкаПоСтрокамДокумента.Сотрудник,НачалоДня(Движение.Период)); 
				СтрокиСокращенногоВремени = ТЗСокращенноеВремя.НайтиСтроки(Новый Структура("Сотрудник, Период", ВыборкаПоСтрокамДокумента.Сотрудник,НачалоДня(Движение.Период)));
				Если  СтрокиСокращенногоВремени.Количество()>0 Тогда
					СокращЧ=СтрокиСокращенногоВремени[0].КоличествоЧасов;
				Иначе
					СокращЧ=0;
				КонецЕсли;
				//Аверсон 03.06.2021 КВВ СВФР-007546 )
				
				Если Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "200400628" ИЛИ Организация.ИНН = "500158130" ИЛИ
					Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "700176068" Тогда //Аверсон ЕАЕ 06.11.2025 СВФР-017169 (пересчет нормы оставляем только под УНП)	
					НормаЧ = ?(СокращЧ=0,НормаЧ,СокращЧ);
					//Аверсон 21.08.2020 КВВ СВФР-006439 )
				КонецЕсли;
				
				Движение.Дней = ?(НормаЧ <> 0, ВыборкаПоСтрокамДокумента.Часов / НормаЧ/?(Организация.ЗаполнениеТабелейСУчетомСтавки,Ставка,1), ВыборкаПоСтрокамДокумента.Часов / 8); //О.Т. Аверсон 06.12.2017 № 1322 ставка
				
				//Аверсон 21.08.2020 КВВ СВФР-006439 (
				Если СокращЧ <> 0 И Движение.Дней <> 1 Тогда
					Сообщить("У сотрудника " + ВыборкаПоСтрокамДокумента.Сотрудник.Наименование + " сокращенный день " + Формат(Движение.Период,"ДЛФ=Д") + ", но Дней <> 1");
				КонецЕсли;
				//Аверсон 21.08.2020 КВВ СВФР-006439 )
				
				//заявка №1979
				
			иначе
				//Аверсон 03.06.2021 КВВ СВФР-007546 (
				//ЕстьСокращенныеДниВМесяце = ПроверкаСокращенныхДнейВМесяце(ВыборкаПоСтрокамДокумента.Сотрудник,Движение.Период); //Аверсон 29.10.2020 КВВ СВФР-006756
				СтрокиСокращенногоВремени = ТЗСокращенноеВремя.НайтиСтроки(Новый Структура("Сотрудник", ВыборкаПоСтрокамДокумента.Сотрудник));
				ЕстьСокращенныеДниВМесяце=СтрокиСокращенногоВремени.Количество()>0;
				
				//Пока ВыборкаДетальныеЗаписи.Следующий() цикл 
				Для Каждого ВыборкаДетальныеЗаписи Из ТЗДетальныеЗаписи Цикл
					//Аверсон 03.06.2021 КВВ СВФР-007546 )
					если  ВыборкаДетальныеЗаписи.ДопЗначение <> 0 и  ВыборкаДетальныеЗаписи.Дата = Движение.Период 
						//и  ВыборкаПоСтрокамДокумента.ВидВремени = ВыборкаДетальныеЗаписи.ВидВремени тогда //Аверсон 11.07.2023 КВВ СВФР-011097 (закомментировано)
						Тогда
						
						//Аверсон 29.10.2020 КВВ СВФР-006756 (
						//	Движение.Дней = ?(ВыборкаДетальныеЗаписи.ОснЗначение <> 0, ВыборкаПоСтрокамДокумента.Часов / ВыборкаДетальныеЗаписи.ОснЗначение, ВыборкаПоСтрокамДокумента.Часов / 8);
						Если НЕ ЕстьСокращенныеДниВМесяце Тогда
							ОсновноеЗначение_ = ВыборкаДетальныеЗаписи.ОснЗначение;
							
							//СВЭЙ 01.09.2023 КВВ СВФР-011365 (
							Если ВыборкаДетальныеЗаписи.ВидВремени <> ВыборкаПоСтрокамДокумента.ВидВремени Тогда
								Продолжить;
							КонецЕсли;
							//СВЭЙ 01.09.2023 КВВ СВФР-011365 )
							
						Иначе
							//Аверсон 03.06.2021 КВВ СВФР-007546 (
							//СокращЧасы = СокращенныеЧасыВДате(ВыборкаПоСтрокамДокумента.Сотрудник,Движение.Период);
							СтрокиСокращенногоВремени = ТЗСокращенноеВремя.НайтиСтроки(Новый Структура("Сотрудник, Период", ВыборкаПоСтрокамДокумента.Сотрудник,Движение.Период));
							Если  СтрокиСокращенногоВремени.Количество()>0 Тогда
								СокращЧасы=СтрокиСокращенногоВремени[0].КоличествоЧасов;
							Иначе
								СокращЧасы=0;
								
								//СВЭЙ 29.09.2023 КВВ СВФР-011536 (
								Если ВыборкаДетальныеЗаписи.ВидВремени <> ВыборкаПоСтрокамДокумента.ВидВремени Тогда
									Продолжить;
								КонецЕсли;
								//СВЭЙ 29.09.2023 КВВ СВФР-011536 )
								
							КонецЕсли;
							//Аверсон 03.06.2021 КВВ СВФР-007546 )
							
							ОсновноеЗначение_ = ВыборкаДетальныеЗаписи.ОснЗначение; //Аверсон ЕАЕ 06.11.2025 СВФР-017169 (пересчет нормы оставляем только под УНП)
							
							Если Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "200400628" ИЛИ Организация.ИНН = "500158130" ИЛИ
								Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "700176068" Тогда //Аверсон ЕАЕ 06.11.2025 СВФР-017169 (пересчет нормы оставляем только под УНП)
								ОсновноеЗначение_ = ?(СокращЧасы=0,ВыборкаДетальныеЗаписи.ОснЗначение,СокращЧасы); 
							КонецЕсли;
							
						КонецЕсли; 
						Движение.Дней = ?(ОсновноеЗначение_ <> 0, ВыборкаПоСтрокамДокумента.Часов / ОсновноеЗначение_, ВыборкаПоСтрокамДокумента.Часов / 8);
						//Аверсон 29.10.2020 КВВ СВФР-006756 )
						
						Прервать;
					иначе 
						Движение.Дней = 1; // О.Т. 21.11.2014 277
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//Аверсон-софт, Островская Татьяна 12.03.2012
		Иначе
			Движение.Дней								= ?(ВыборкаПоСтрокамДокумента.Часов = 0, 0, 1);
		КонецЕсли;
		//Аверсон 03.06.2021 КВВ СВФР-007546 ( (закомментировано)
		////Островская Татьяна 18.12.2012 № 15
		//ВидДня = Неопределено;
		//запросПраздники = Новый Запрос;
		//запросПраздники.Текст = 
		//"ВЫБРАТЬ
		//|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		//|	РегламентированныйПроизводственныйКалендарь.Год,
		//|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
		//|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
		//|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
		//|	РегламентированныйПроизводственныйКалендарь.ВидДня
		//|ИЗ
		//|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		//|ГДЕ
		//|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
		//запросПраздники.УстановитьПараметр("ДатаКалендаря",Движение.Период);
		//РезПраздники = запросПраздники.Выполнить().Выбрать();
		//Пока РезПраздники.Следующий() Цикл 
		//	ВидДня = РезПраздники.ВидДня;
		//КонецЦикла;
		//Аверсон 03.06.2021 КВВ СВФР-007546 ) (закомментировано)
		
		ВидДня = ПроизводительностьПовторноеИспользование.ВидДняКалендаря(Движение.Период); //Аверсон 03.06.2021 КВВ СВФР-007546
		если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник и Движение.Дней = 0
			и Движение.ВидИспользованияРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
			Движение.Дней = 1;
		КонецЕсли;
		
		//Островская Татьяна 18.12.2012 № 15
		
		
		Движение.Часов								= ВыборкаПоСтрокамДокумента.Часов;
		
	КонецЕсли;
	
	//Аверсон 22.10.2020 КВВ СВФР-006708 (
	Если Справочники.ГруппыРасчетов.НормаДнейДляБЛПриНевыходах.КлассификаторИспользованияРВ.Количество() <> 0 Тогда
		Если ВыборкаПоСтрокамДокумента.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
			И (Движение.Дней > 0 И Движение.Дней <> 1) Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("ДеньМесяца", ВыборкаПоСтрокамДокумента.ДеньМесяца);
			Отбор.Вставить("Сотрудник", ВыборкаПоСтрокамДокумента.Сотрудник); //Аверсон 13.09.2022 КВВ СВФР-009541
			СтрокиТЗ = ВыборкаПоОтработанноеВремяТЗ.НайтиСтроки(Отбор);
			Для Каждого СтрТЗ Из СтрокиТЗ Цикл
				Если СтрТЗ.ВидВремени = ВыборкаПоСтрокамДокумента.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого СтрГрР Из Справочники.ГруппыРасчетов.НормаДнейДляБЛПриНевыходах.КлассификаторИспользованияРВ Цикл
					Если СтрГрР.ВидКлассификатора <> СтрТЗ.ВидВремени Тогда
						Продолжить;
					КонецЕсли;
					Движение.Дней = 1;
					Прервать;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 22.10.2020 КВВ СВФР-006708 )
	
	//Аверсон 19.06.2022 КВВ СВФР-009212 (
	Если Организация.ИНН <> "790041382" Тогда //Аверсон ЕАЕ 29.08.2025 СВФР-016574
		Если ВыборкаПоСтрокамДокумента.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа 
			И (Движение.Дней > 0 И Движение.Дней <> 1) Тогда
			СостРаб = Новый СписокЗначений;
			СостРаб.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
			ЗЗ = ЗапросПоСостояниюСотрудника(Движение.Период,Движение.Период,СостРаб,Движение.Сотрудник); 
			РезРабВПраздИВых = ЗЗ.Выполнить().Выбрать();
			Пока РезРабВПраздИВых.Следующий() Цикл
				Если ТипЗнч(РезРабВПраздИВых.Регистратор) = Тип("ДокументСсылка.ПриказНаРаботуВПраздничныеИВыходныеДни") Тогда
					Движение.Дней = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 19.06.2022 КВВ СВФР-009212 )
	
	// Реквизиты
	Движение.ВЦеломЗаПериод						= Ложь;
	
КонецПроцедуры // ДобавитьСтрокуРабочееВремяРаботниковОрганизацийПоДням()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуГрафикиРаботыПоВидамВремениДни(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, ТаблицаНабора)
	ОбрабатываемаяДата = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	
	СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоДням);
	СтруктураПоиска.Вставить("Дата", ОбрабатываемаяДата);
	
	МассивСтрок = ТаблицаНабора.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		Движение = МассивСтрок[0];
	Иначе
		
		Движение = ТаблицаНабора.Добавить();
		Движение.ГрафикРаботы = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремениПоДням;
		Движение.Дата = ОбрабатываемаяДата;
		Движение.План = Ложь;
		Движение.Месяц = ВыборкаПоШапкеДокумента.ПериодРегистрации;
		
	КонецЕсли;
	
	// Ресурсы
	Если ВремяЯвки > 0 Тогда
		Движение.ОсновноеЗначениеПолное = ?(ВремяЯвки = 0, 0, 1);
		Движение.ДополнительноеЗначениеПолное = ВремяЯвки;
	Иначе
		Движение.ОсновноеЗначениеПолное = ?(ВыборкаПоСтрокамДокумента.Часов = 0, 0, 1);
		Движение.ДополнительноеЗначениеПолное = ВыборкаПоСтрокамДокумента.Часов;
	КонецЕсли;
	
	// Реквизиты
	Движение.Документ 				= ВыборкаПоШапкеДокумента.Документ;
	
КонецПроцедуры // ДобавитьСтрокуГрафикиРаботыПоВидамВремениДни()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуГрафикиРаботыПоВидамВремениЧасы(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, ТаблицаНабора)
	
	ОбрабатываемаяДата = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	ВидУчетаВремени = ПолучитьВидУчетаВремениПоКлассификатору(ВыборкаПоСтрокамДокумента.ВидВремени);
	
	Если ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторВечерниеЧасы Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоВечернимЧасам);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторНочныеЧасы Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоНочнымЧасам);
		//толик	
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторВредность Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоВредность);
	Иначе
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоЧасам);
	КонецЕсли;
	СтруктураПоиска.Вставить("Дата", ОбрабатываемаяДата);
	
	МассивСтрок = ТаблицаНабора.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		Движение = МассивСтрок[0];
	Иначе
		
		Движение = ТаблицаНабора.Добавить();
		Движение.ГрафикРаботы = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.Дата = ОбрабатываемаяДата;
		Движение.План = Ложь;
		Движение.Месяц = ВыборкаПоШапкеДокумента.ПериодРегистрации;
		
	КонецЕсли;
	
	// Ресурсы
	//толик
	Если ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторЯвка Тогда
		Движение.ОсновноеЗначениеПолное = Движение.ОсновноеЗначениеПолное + ВыборкаПоСтрокамДокумента.Часов;
		Движение.ДополнительноеЗначениеПолное = ?((Движение.ДополнительноеЗначениеПолное > 0) ИЛИ (ВыборкаПоСтрокамДокумента.Часов > 0), 1, 0);
	КонецЕсли;
	//енд
	
	// Реквизиты
	Движение.Документ				= ВыборкаПоШапкеДокумента.Документ;
	
КонецПроцедуры // ДобавитьСтрокуГрафикиРаботыПоВидамВремениЧасы()

// Функция формирует запрос по таблице ОтработанноеВремя документа
// для получения периодов невыходов.
Функция СформироватьЗапросДляРегистраРасчета(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ВыборкаПоШапкеДокумента.ПериодРегистрации);
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	СписокПропусков = Новый Массив(6);
	СписокПропусков[0] = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя;
	СписокПропусков[1] = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству;
	СписокПропусков[2] = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск;
	СписокПропусков[3] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый;
	СписокПропусков[4] = Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам;
	СписокПропусков[5] = Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы;
	
	Запрос.УстановитьПараметр("СписокПропусков", СписокПропусков);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки КАК НомерСтроки,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени1 КАК ВидВремени,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов1 КАК Часов,
	|	1 КАК ДеньМесяца
	|ПОМЕСТИТЬ ПропущенныеДни
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени1 В(&СписокПропусков)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов1,
	|	1
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени1 В(&СписокПропусков)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов1,
	|	1
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|	И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени1 В(&СписокПропусков)";
	
	Для ИндексДня = 2 По День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)) Цикл
		СтрИндексДня = Строка(ИндексДня);
		Запрос.Текст = Запрос.Текст + "		
		|
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+"
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" В(&СписокПропусков)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+"
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+" В(&СписокПропусков)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+"
		|	ИЗ
		|		Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+" В(&СписокПропусков)";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	
	Запрос.Выполнить();
	ПропущенныеДниТекст = "ПропущенныеДни";
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СгруппированныеДанные.Сотрудник,
	|	СгруппированныеДанные.ВидВремени,
	|	СгруппированныеДанные.НачалоПериода,
	|	СгруппированныеДанные.КонецПериода,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= СгруппированныеДанные.НачалоПериода
	|			И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации	
	|ИЗ		
	|	(ВЫБРАТЬ
	|	НачальнаяДата.Сотрудник,
	|	НачальнаяДата.ВидВремени,
	|	НачальнаяДата.ДеньМесяца КАК НачалоПериода,
	|	МИНИМУМ(КонечнаяДата.ДеньМесяца) КАК КонецПериода,
	|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаПолученияПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачальнаяДата.Сотрудник КАК Сотрудник,
	|		НачальнаяДата.ВидВремени КАК ВидВремени,
	|		НачальнаяДата.Часов КАК Часов,
	|		НачальнаяДата.ДеньМесяца КАК ДеньМесяца,
	|		НачальнаяДата.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		" + ПропущенныеДниТекст + " КАК НачальнаяДата
	|			ЛЕВОЕ СОЕДИНЕНИЕ " + ПропущенныеДниТекст + " КАК ПредыдущаяНачальнаяДата
	|			ПО ПредыдущаяНачальнаяДата.НомерСтроки = НачальнаяДата.НомерСтроки
	|				И (ПредыдущаяНачальнаяДата.ДеньМесяца + 1 = НачальнаяДата.ДеньМесяца)
	|	ГДЕ
	|		(ПредыдущаяНачальнаяДата.НомерСтроки ЕСТЬ NULL 
	|				ИЛИ ПредыдущаяНачальнаяДата.ВидВремени <> НачальнаяДата.ВидВремени)) КАК НачальнаяДата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонечнаяДата.Сотрудник КАК Сотрудник,
	|			КонечнаяДата.ВидВремени КАК ВидВремени,
	|			КонечнаяДата.Часов КАК Часов,
	|			КонечнаяДата.ДеньМесяца КАК ДеньМесяца,
	|			КонечнаяДата.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			" + ПропущенныеДниТекст + " КАК КонечнаяДата
	|				ЛЕВОЕ СОЕДИНЕНИЕ " + ПропущенныеДниТекст + " КАК СледующаяКонечнаяДата
	|				ПО СледующаяКонечнаяДата.НомерСтроки = КонечнаяДата.НомерСтроки
	|					И (СледующаяКонечнаяДата.ДеньМесяца = КонечнаяДата.ДеньМесяца + 1)
	|		ГДЕ
	|			(СледующаяКонечнаяДата.НомерСтроки ЕСТЬ NULL 
	|					ИЛИ СледующаяКонечнаяДата.ВидВремени <> КонечнаяДата.ВидВремени)) КАК КонечнаяДата
	|		ПО КонечнаяДата.НомерСтроки = НачальнаяДата.НомерСтроки
	|			И КонечнаяДата.ВидВремени = НачальнаяДата.ВидВремени
	|			И КонечнаяДата.ДеньМесяца >= НачальнаяДата.ДеньМесяца
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО
	|			РаботникиОрганизаций.Сотрудник = НачальнаяДата.Сотрудник
	|			И РаботникиОрганизаций.Период <= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ), ДЕНЬ, НачальнаяДата.ДеньМесяца - 1)
	|СГРУППИРОВАТЬ ПО
	|	НачальнаяДата.Сотрудник,
	|	НачальнаяДата.ВидВремени,
	|	НачальнаяДата.ДеньМесяца
	|) КАК СгруппированныеДанные
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ПО
	|	РаботникиОрганизаций.Сотрудник = СгруппированныеДанные.Сотрудник
	|	И РаботникиОрганизаций.Период = СгруппированныеДанные.ДатаПолученияПодразделения
	|УПОРЯДОЧИТЬ ПО
	|	НачалоПериода";
	
	Возврат Запрос.Выполнить();	
	
КонецФункции // СформироватьЗапросДляРегистраРасчета()

// Процедура вводит в Регистр расчета ОсновныеНачисленияРаботниковОрганизаций
// ВР ДниНеоплачиваемыеСогласноТабелю 
Процедура ПроведениеПоРегиструРасчета(ВыборкаПоШапкеДокумента)
	
	НаборОсновныеНачисления = Движения.ОсновныеНачисленияРаботниковОрганизаций;
	ВыборкаПериодыПропусков = СформироватьЗапросДляРегистраРасчета(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПериодыПропусков.Следующий() Цикл
		Движение = НаборОсновныеНачисления.Добавить();
		
		// Свойства
		Движение.ПериодРегистрации = ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.ПериодДействияНачало = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПериодыПропусков.НачалоПериода);
		Движение.ПериодДействияКонец = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПериодыПропусков.КонецПериода);
		Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю;
		Движение.Сторно = Ложь;
		
		// Измерения
		Движение.Сотрудник = ВыборкаПериодыПропусков.Сотрудник;
		Движение.ФизЛицо = ВыборкаПериодыПропусков.Сотрудник.ФизЛицо;
		Движение.Организация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Реквизиты
		Движение.ПодразделениеОрганизации = ВыборкаПериодыПропусков.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение = ВыборкаПоШапкеДокумента.Организация;
		Движение.ГрафикРаботы = ВыборкаПериодыПропусков.Сотрудник;
		Движение.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало = 
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание = 
		Движение.ДатаНачалаСобытия = ВыборкаПоШапкеДокумента.ДатаНачалаПериода;
		Движение.Авторасчет = Истина;
		
	КонецЦикла;
	
КонецПроцедуры // ПроведениеПоРегиструРасчета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" документа.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Аверсон 05.05.2021 КВВ СВФР-007555 (
	Если ЗначениеЗаполнено(Ссылка) Тогда  //Аверсон 28.05.2021 КВВ СВФР-007627 
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		НастройкаПравДоступа.ПроверкаПериодаДокумента(ДокументОбъект,Отказ,РежимПроведения);
	КонецЕсли;
	Если Отказ Тогда
		Сообщить("Редактирование данных этого периода запрещено. Изменения не могут быть записаны...", СтатусСообщения.Важное);
	Иначе
		//Аверсон 05.05.2021 КВВ СВФР-007555 )
		
		Если СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ВЦеломЗаПериод Тогда
			//заявка №1605 (база заявок Кристалла) Дмитрук О.Г.
			//ОтработанноеВремя.Очистить();
			//завяка №1605 
			
			КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОтработанноеВремяВЦеломЗаПериод);
		Иначе
			//заявка №1605 (база заявок Кристалла) Дмитрук О.Г.
			//ОтработанноеВремяВЦеломЗаПериод.Очистить();
			//завяка №1605 
			
			КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОтработанноеВремя);
		КонецЕсли;
		
		УдалитьЗаписиЗаПериодДокумента();
	КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения" документа.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ВредностьЧасов = Неопределено;
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		//толик		ПроверитьУникальностьЗаписи(Отказ, Заголовок);
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			//Дмитрук О.Г. 02.02.2011
			//бедем делать движение, только когда Статус = Проверено
			//	Если СтатусДокумента = Перечисления.СтатусДокумента.Проверен Тогда //Аверсон 30.09.2019 КВВ СВФР-004817 //Закомментировано
			Если ВыборкаПоШапкеДокумента.СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ВЦеломЗаПериод Тогда
				// Данные введены в целом за период.
				
				////////////////////////////////////////////////////////////////////////
				// Отработанное время в целом за период
				//Островская Татьяна 01.03.2013 № 16797
				ТаблицаЗначенийДубли = Новый ТаблицаЗначений;
				ТаблицаЗначенийДубли.Колонки.Добавить("Сотрудник",,"Сотрудник");
				//Островская Татьяна 01.03.2013 № 16797
				// получим реквизиты табличной части
				ВыборкаПоОтработанноеВремяВЦеломЗаПериод = СформироватьЗапросПоОтработанноеВремяВЦеломЗаПериод(ВыборкаПоШапкеДокумента).Выбрать();
				Пока ВыборкаПоОтработанноеВремяВЦеломЗаПериод.СледующийПоЗначениюПоля("Сотрудник") Цикл
					Если Не Отказ Тогда
						Пока ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Следующий() Цикл
							
							// Проверим очередную строку табличной части
							ПроверитьЗаполнениеСтрокиОтработанноеВремяВЦеломЗаПериод(ВыборкаПоШапкеДокумента, ВыборкаПоОтработанноеВремяВЦеломЗаПериод, Отказ, Заголовок);
							Если Не Отказ Тогда
								// Заполним записи в наборах записей регистров
								//Островская Татьяна 26.06.2013 № 16581
								если ВыборкаПоШапкеДокумента.Организация.ИНН = "100765738" Тогда 
									если ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ВидИспользованияРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда 
										если ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Дней <>0 и ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Часов <>0 Тогда 
											ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоОтработанноеВремяВЦеломЗаПериод, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
										КонецЕсли;
									ИначеЕсли ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ВидИспользованияРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда 
										если ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Дней <>0 и ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Часов <>0 Тогда 
											ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоОтработанноеВремяВЦеломЗаПериод, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
										КонецЕсли;
									ИначеЕсли ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ВидИспользованияРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп.") Тогда 
										если ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Дней <>0 и ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Часов <>0 Тогда 
											ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоОтработанноеВремяВЦеломЗаПериод, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
										КонецЕсли;
									иначе
										ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоОтработанноеВремяВЦеломЗаПериод, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
									КонецЕсли;
								иначе
									ДобавитьСтрокуРабочееВремяРаботниковОрганизацийВЦеломЗаПериод(ВыборкаПоОтработанноеВремяВЦеломЗаПериод, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций);
								КонецЕсли;
								//Островская Татьяна 26.06.2013 № 16581
							Иначе
								Прервать;
							КонецЕсли;
							//Островская Татьяна 13.02.2013 № 15797
							если не ЗначениеЗаполнено(ВредностьЧасов) Тогда 
								ВредностьЧасов = ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ИтогоВредность;
							КонецЕсли;
							//Островская Татьяна 13.02.2013 № 15797
						КонецЦикла;
					Иначе
						Прервать;
					КонецЕсли;
					//Островская Татьяна 13.02.2013 № 15797
					если ОтличаютсяВредныеЧасы Тогда 
						//если ЗначениеЗаполнено(ВредностьЧасов) Тогда
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Сотрудник", ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Сотрудник);
						
						Массив = ТаблицаЗначенийДубли.НайтиСтроки(ПараметрыОтбора);
						если Массив.Количество() = 0 Тогда 
							ПоследнееЗапись = Движения.РабочееВремяРаботниковОрганизаций[Движения.РабочееВремяРаботниковОрганизаций.Количество()-1]; //ПСА 24-12-2020 СВФР-006985+++
							НаборЗаписей1 = Движения.РабочееВремяРаботниковОрганизаций;
							Движение = НаборЗаписей1.Добавить();
							
							// Свойства
							//ПСА 24-12-2020 СВФР-006985+++
							//Движение.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
							Движение.Период = ПоследнееЗапись.Период;
							//О.Т. Аверсон 13.12.2016 № 100
							//Движение.ДатаНачала                     = НачалоДня(Движение.Период);
							//Движение.ДатаОкончания                  = КонецДня(Движение.Период);
							Движение.ДатаНачала                     = ПоследнееЗапись.ДатаНачала;
							Движение.ДатаОкончания                  = ПоследнееЗапись.ДатаОкончания;
							//+++ПСА 24-12-2020 СВФР-006985
							
							ПоследнееЗапись = Движения.РабочееВремяРаботниковОрганизаций[Движения.РабочееВремяРаботниковОрганизаций.Количество()-1]; //ПСА 24-12-2020 СВФР-006985+++
							НаборЗаписей1 = Движения.РабочееВремяРаботниковОрганизаций;
							Движение = НаборЗаписей1.Добавить();
							
							// Свойства
							//ПСА 24-12-2020 СВФР-006985+++
							//Движение.Период							= ВыборкаПоШапкеДокумента.ПериодРегистрации;
							Движение.Период = ПоследнееЗапись.Период;
							//+++ПСА 24-12-2020 СВФР-006985
							
							//О.Т. Аверсон 13.12.2016 № 100
							Если Организация.ИНН = "100765738" Тогда 
								Движение.ДатаНачала                     = ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ДатаНачала;
								Движение.ДатаОкончания                  = ВыборкаПоОтработанноеВремяВЦеломЗаПериод.ДатаОкончания;
							иначе
								//ПСА 24-12-2020 СВФР-006985+++
								//Движение.ДатаНачала                     = НачалоМесяца(ПериодРегистрации);
								//Движение.ДатаОкончания                  = КонецМесяца(ПериодРегистрации);
								Движение.ДатаНачала                     = ПоследнееЗапись.ДатаНачала;
								Движение.ДатаОкончания                  = ПоследнееЗапись.ДатаОкончания;
								//+++ПСА 24-12-2020 СВФР-006985
								
							КонецЕсли;
							//О.Т. Аверсон 13.12.2016 № 100
							// Измерения
							Движение.Сотрудник						= ВыборкаПоОтработанноеВремяВЦеломЗаПериод.Сотрудник;
							Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
							
							Движение.ВидИспользованияРабочегоВремени= Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
							Движение.ЧасовВредность = ВредностьЧасов;
							Движение.ВЦеломЗаПериод					= Истина;
						КонецЕсли;
						//КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 13.02.2013 № 15797
					ВредностьЧасов = 0;	
				КонецЦикла;
			Иначе
				// Данные введены с разбивкой по дням.
				
				////////////////////////////////////////////////////////////////////////
				// Отработанное время
				Запрос = Новый Запрос;
				
				Запрос.УстановитьПараметр("Месяц", ВыборкаПоШапкеДокумента.ПериодРегистрации);
				
				// получим реквизиты табличной части
				
				//Аверсон 22.10.2020 КВВ СВФР-006708 (
				ВыборкаПоОтработанноеВремяИзЗапроса = СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента);
				ВыборкаПоОтработанноеВремяТЗ = ВыборкаПоОтработанноеВремяИзЗапроса.Выгрузить();
				ВыборкаПоОтработанноеВремя = ВыборкаПоОтработанноеВремяИзЗапроса.Выбрать();
				//Аверсон 22.10.2020 КВВ СВФР-006708 )
				
				//Аверсон 03.06.2021 КВВ СВФР-007546 ( (закомментировано)
				//НаборГрафикиРаботыПоВидамВремени = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
				//
				//НаборГрафикиРаботыПоВидамВремени.Отбор.Месяц.Установить(ВыборкаПоШапкеДокумента.ПериодРегистрации);
				//НаборГрафикиРаботыПоВидамВремени.Отбор.План.Установить(Ложь);
				//Аверсон 03.06.2021 КВВ СВФР-007546 ) (закомментировано)
				
				ДеньНачалаПериода = День(ДатаНачалаПериода);
				ДеньОкончанияПериода = День(ДатаОкончанияПериода);
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("План", Ложь);
				СтруктураПоиска.Вставить("Месяц", ВыборкаПоШапкеДокумента.ПериодРегистрации);
				
				ВидУчетаВремениПоДням = Перечисления.ВидыУчетаВремени.ПоДням;
				ВидУчетаВремениПоЧасам = Перечисления.ВидыУчетаВремени.ПоЧасам;
				ПустойДокумент = Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка();
				//Островская Татьяна 01.03.2013 № 16797
				ТаблицаЗначенийДубли = Новый ТаблицаЗначений;
				ТаблицаЗначенийДубли.Колонки.Добавить("Сотрудник",,"Сотрудник");
				//Островская Татьяна 01.03.2013 № 16797
				
				//Аверсон 03.06.2021 КВВ СВФР-007546 (
				ТЗСокращенногоВремени = ПроизводительностьПовторноеИспользование.СокращенныеЧасыВМесяце(ВыборкаПоШапкеДокумента.ПериодРегистрации);
				ТЗСтавки = Неопределено;
				//Аверсон 03.06.2021 КВВ СВФР-007546 )
				
				//Аверсон ЕАЕ 10.08.2022 СВФР-009418
				Если ОтличаютсяВредныеЧасы Тогда
					ТЗВредность = ПолучитьПериодыВредности(ОтработанноеВремя.ВыгрузитьКолонку("Сотрудник"), НачалоМесяца(ПериодРегистрации), КонецМесяца(ПериодРегистрации));
				КонецЕсли;
				//Аверсон СВФР-009418
				
				Пока ВыборкаПоОтработанноеВремя.СледующийПоЗначениюПоля("Сотрудник") Цикл
					// Проверим очередную строка табличной части
					ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоОтработанноеВремя, Отказ, Заголовок);
					Если НЕ Отказ Тогда
						//Островская Татьяна 30.07.2013 увеличение производительности
						// О.Т. 21.11.2014 293
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РаботникиОрганизаций.ГрафикРаботы
						|ИЗ
						|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
						|ГДЕ
						|	РаботникиОрганизаций.Сотрудник = &Сотрудник
						|	И РаботникиОрганизаций.Организация = &Организация
						|	И (РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
						|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию //О.Т. Аверсон 15.11.2017 № 1259
						|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов) //О.Т. Аверсон 15.11.2017 № 1259
						|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
						|
						|СГРУППИРОВАТЬ ПО
						|	РаботникиОрганизаций.ГрафикРаботы";
						
						Запрос.УстановитьПараметр("Организация", Организация);
						Запрос.УстановитьПараметр("Период", НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
						Запрос.УстановитьПараметр("Период1", КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
						Запрос.УстановитьПараметр("Сотрудник", ВыборкаПоОтработанноеВремя.Сотрудник);
						
						КоличествоГрафиков = Запрос.Выполнить().Выгрузить().Количество();
						// О.Т. 21.11.2014 293
						Часов1 = 0;
						Часов1 = ПроизводительностьПовторноеИспользование.ПолучитьНормуПоГрафику(ВыборкаПоШапкеДокумента.ДатаНачалаПериода, ВыборкаПоШапкеДокумента.ДатаОкончанияПериода, ВыборкаПоОтработанноеВремя.Сотрудник); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
						//Островская Татьяна 30.07.2013 увеличение производительности
						//НаборГрафикиРаботыПоВидамВремени.Отбор.ГрафикРаботы.Установить(ВыборкаПоОтработанноеВремя.Сотрудник); //Аверсон 03.06.2021 КВВ СВФР-007546 (закомментировано)
						СтруктураПоиска.Вставить("ГрафикРаботы", ВыборкаПоОтработанноеВремя.Сотрудник);
						//НаборГрафикиРаботыПоВидамВремени.Прочитать();  //Аверсон 03.06.2021 КВВ СВФР-007546 (закомментировано)
						//ТаблицаНабора = НаборГрафикиРаботыПоВидамВремени.Выгрузить();  //Аверсон 03.06.2021 КВВ СВФР-007546 (закомментировано)
						//Пока ВыборкаПоОтработанноеВремя.СледующийПоЗначениюПоля("ДеньМесяца") Цикл
						Пока ВыборкаПоОтработанноеВремя.Следующий() Цикл
							Если (ВыборкаПоОтработанноеВремя.ДеньМесяца <= ДеньОкончанияПериода)
								И (ВыборкаПоОтработанноеВремя.ДеньМесяца >= ДеньНачалаПериода)Тогда
								ВремяЯвки = 0;
								//Пока ВыборкаПоОтработанноеВремя.Следующий() Цикл
								// Заполним записи в наборах записей регистров
								
								Если НЕ ВыборкаПоОтработанноеВремя.ВидВремени.Пустая() Тогда
									//Островская Татьяна 30.07.2013 увеличение производительности
									ПараметрыОтбораВр = Новый Структура;
									ПараметрыОтбораВр.Вставить("Дата", Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоОтработанноеВремя.ДеньМесяца));
									// О.Т. 21.11.2014 293
									если КоличествоГрафиков > 0 Тогда 
										Часов1 = ПроизводительностьПовторноеИспользование.ПолучитьНормуПоГрафику(Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоОтработанноеВремя.ДеньМесяца), КонецДня(Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоОтработанноеВремя.ДеньМесяца)), ВыборкаПоОтработанноеВремя.Сотрудник); //Аверсон 03.06.2021 КВВ СВФР-007546 ПроизводительностьПовторноеИспользование
									КонецЕсли;
									// О.Т. 21.11.2014 293
									Часов = Часов1.НайтиСтроки(ПараметрыОтбораВр);
									Если Часов.количество()=0 Тогда                 // выдать по кому проблема
										сообщить(ВыборкаПоОтработанноеВремя.Сотрудник.наименование + " пустое значене нормы,  проверьте график работы сотрудника!!!");
									КонецЕсли;	
									Часов = Часов[0];
									//Островская Татьяна 30.07.2013 увеличение производительности
									ДобавитьСтрокуРабочееВремяРаботниковОрганизацийПоДням(ВыборкаПоОтработанноеВремя, ВыборкаПоШапкеДокумента, Движения.РабочееВремяРаботниковОрганизаций,Часов,ВыборкаПоОтработанноеВремяТЗ, ТЗСокращенногоВремени, ТЗСтавки); //Аверсон 22.10.2020 КВВ СВФР-006708 (пятый параметр) //Аверсон 03.06.2021 КВВ СВФР-007546 (6 и 7 параметры)
									Если ВыборкаПоОтработанноеВремя.ВидВремени = КлассификаторЯвка Тогда
										ВремяЯвки = ВыборкаПоОтработанноеВремя.Часов;
									КонецЕсли;
									//Островская Татьяна 13.02.2013 № 15797
									если не ЗначениеЗаполнено(ВредностьЧасов) Тогда 
										ВредностьЧасов = ВыборкаПоОтработанноеВремя.ИтогоВредность;
									КонецЕсли;
									//Островская Татьяна 13.02.2013 № 15797
								КонецЕсли;
								//КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						//Аверсон 03.06.2021 КВВ СВФР-007546 ( (закомментировано)
						//НаборГрафикиРаботыПоВидамВремени.Загрузить(ТаблицаНабора);
						//НаборГрафикиРаботыПоВидамВремени.Записать();
						//Аверсон 03.06.2021 КВВ СВФР-007546 ) (закомментировано)
					КонецЕсли;
					//Островская Татьяна 13.02.2013 № 15797
					если ОтличаютсяВредныеЧасы Тогда 
						//если ЗначениеЗаполнено(ВредностьЧасов) Тогда
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Сотрудник", ВыборкаПоОтработанноеВремя.Сотрудник);
						
						Массив = ТаблицаЗначенийДубли.НайтиСтроки(ПараметрыОтбора);
						если Массив.Количество() = 0 Тогда 
							ПоследнееЗапись = Движения.РабочееВремяРаботниковОрганизаций[Движения.РабочееВремяРаботниковОрганизаций.Количество()-1]; //ПСА 24-12-2020 СВФР-006985+++
							
							//Аверсон 08.06.2023 КВВ СВФР-010939 (закомментировано) (
							//	НаборЗаписей1 = Движения.РабочееВремяРаботниковОрганизаций; 
							//	Движение = НаборЗаписей1.Добавить();
							//Аверсон 08.06.2023 КВВ СВФР-010939 (закомментировано) )
							
							// Свойства
							//ПСА 24-12-2020 СВФР-006985+++
							//Движение.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
							
							//Аверсон ЕАЕ 10.08.2022 СВФР-009418
							//Движение.Период = ПоследнееЗапись.Период;
							СтруктураОтбора = Новый Структура;
							СтруктураОтбора.Вставить("Сотрудник", ВыборкаПоОтработанноеВремя.Сотрудник);
							НужныеСтроки = ТЗВредность.НайтиСтроки(СтруктураОтбора);
							Если НужныеСтроки.Количество() > 0 Тогда
								//	Движение.Период = НужныеСтроки[0].НачалоПериода;  //Аверсон 08.06.2023 КВВ СВФР-010939 (закомментировано)
								ДатаПериода =  НужныеСтроки[0].НачалоПериода;  //Аверсон 08.06.2023 КВВ СВФР-010939
							Иначе
								//	Движение.Период = ПоследнееЗапись.Период;  //Аверсон 08.06.2023 КВВ СВФР-010939 (закомментировано)
								ДатаПериода = ПоследнееЗапись.Период; //Аверсон 08.06.2023 КВВ СВФР-010939
							КонецЕсли;
							//Аверсон СВФР-009418
							
							//Аверсон 08.06.2023 КВВ СВФР-010939 (
							ВносимДанныеВРегистр = Истина;
							Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
								ТекПодр = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПериода,Новый Структура("Сотрудник",ВыборкаПоОтработанноеВремя.Сотрудник)).ПодразделениеОрганизации;
								Если ТекПодр <> ПодразделениеОрганизации И НЕ ТекПодр.ПринадлежитЭлементу(ПодразделениеОрганизации) Тогда
									ВносимДанныеВРегистр = Ложь;
								КонецЕсли;
							КонецЕсли;
							
							Если ВносимДанныеВРегистр Тогда
								НаборЗаписей1 = Движения.РабочееВремяРаботниковОрганизаций;
								Движение = НаборЗаписей1.Добавить();
								Движение.Период = ДатаПериода;
								//Аверсон 08.06.2023 КВВ СВФР-010939 )
								
								//О.Т. Аверсон 13.12.2016 № 100
								//Движение.ДатаНачала                     = НачалоДня(Движение.Период);
								//Движение.ДатаОкончания                  = КонецДня(Движение.Период);
								
								//Аверсон ЕАЕ 10.08.2022 СВФР-009418
								//Движение.ДатаНачала                     = ПоследнееЗапись.ДатаНачала;
								//Движение.ДатаОкончания                  = ПоследнееЗапись.ДатаОкончания;
								Если НужныеСтроки.Количество() > 0 Тогда
									Движение.ДатаНачала                     = НужныеСтроки[0].НачалоПериода;
									Движение.ДатаОкончания                  = НужныеСтроки[0].КонецПериода;
								Иначе
									Движение.ДатаНачала                     = ПоследнееЗапись.ДатаНачала;
									Движение.ДатаОкончания                  = ПоследнееЗапись.ДатаОкончания;
								КонецЕсли;
								//Аверсон СВФР-009418
								
								//+++ПСА 24-12-2020 СВФР-006985
								//О.Т. Аверсон 13.12.2016 № 100
								// Измерения
								Движение.Сотрудник						= ВыборкаПоОтработанноеВремя.Сотрудник;
								Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
								
								Движение.ВидИспользованияРабочегоВремени	= Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
								Движение.ЧасовВредность = ВредностьЧасов;
								Движение.ВЦеломЗаПериод						= Ложь;
								ТЗДубли = ТаблицаЗначенийДубли.Добавить();
								ТЗДубли.Сотрудник = ВыборкаПоОтработанноеВремя.Сотрудник;
							КонецЕсли;
							//КонецЕсли;
						КонецЕсли; //Аверсон 08.06.2023 КВВ СВФР-010939
					КонецЕсли;
					//Островская Татьяна 13.02.2013 № 15797
					ВредностьЧасов = 0;	
				КонецЦикла;
				//закомментарила Дмитрук О.Г. 17.02.2011
				//ПроведениеПоРегиструРасчета(ВыборкаПоШапкеДокумента);
				//ВредностьЧасов = 0;	
			КонецЕсли;	
			Движения.РабочееВремяРаботниковОрганизаций.Записать();
			Для Каждого мСтрока Из ЭтотОбъект.ОтработанноеВремя Цикл
				ПрочиеПроцедуры.ДобавитьГрафикиРаботыПоВидамВремени(ЭтотОбъект.ДатаНачалаПериода, ЭтотОбъект.ДатаОкончанияПериода, мСтрока.Сотрудник, ЭтотОбъект, Ложь);
			КонецЦикла;
			//	КонецЕсли;  //Аверсон 30.09.2019 КВВ СВФР-004817 //Закомментировано
		КонецЕсли;
	КонецЕСли;
КонецПроцедуры // ОбработкаПроведения()

//Островская Татьяна 30.07.2013 увеличение производительности
Функция ПолучитьНормуПоГрафику(парамНачало, парамКонец, Сотрудник) Экспорт
	//Функция ПолучитьНормуПоГраффику(парамНачало, парамКонец, Сотрудник) Экспорт  //Аверсон 03.06.2021 КВВ СВФР-007546 (закомментировано)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК НормаЧасов,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК НормаДней,
	|	ГрафикиРаботыПоВидамВремени.Дата
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
	|	И ГрафикиРаботыПоВидамВремени.План
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПоВидамВремени.Дата";
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	//мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
	//	Новый Структура("Организация, Сотрудник", Справочники.Организации.НайтиПоКоду("000000001"), Сотрудник));
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецДня(парамКонец),// О.Т. 21.11.2014 293
	Новый Структура("Организация, Сотрудник", Сотрудник.Организация, Сотрудник));
	Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
	мРезультат = Запрос.Выполнить().Выгрузить();
	Возврат мРезультат;
	
КонецФункции
//Островская Татьяна 30.07.2013 увеличение производительности

//толик
Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записать();
	
	КакаяТЧ = ?(ЭтотОбъект.СпособВводаДанных = Перечисления.СпособыВводаДанныхОВремени.ВЦеломЗаПериод,ЭтотОбъект.ОтработанноеВремяВЦеломЗаПериод,ЭтотОбъект.ОтработанноеВремя); //Аверсон 15.01.2020 КВВ СВФР-005359
	
	Если КакаяТЧ.Количество() <> 0 Тогда  //Аверсон 03.03.2020 КВВ СВФР-005618
		//О.Т. Аверсон 04.04.2019 № 4199	
		//Для Каждого мСтрока Из ЭтотОбъект.ОтработанноеВремя Цикл
		Для Каждого мСтрока Из КакаяТЧ Цикл	 //Аверсон 15.01.2020 КВВ СВФР-005359
			//Островская Татьяна 15.01.2014 № 17203
			Если Организация.ИНН = "100765738" Тогда 
				мЗапрос = Новый Запрос;
				мЗапрос.Текст = 
				"ВЫБРАТЬ
				|	РабочееВремяРаботниковОрганизаций.Сотрудник,
				|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
				|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
				|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
				|	МАКСИМУМ(РабочееВремяРаботниковОрганизаций.Регистратор) КАК Регистратор,
				|	РабочееВремяРаботниковОрганизаций.Период КАК Период1,
				|	ВложенныйЗапрос.ДатаКалендаря КАК Период
				|ИЗ
				|	(ВЫБРАТЬ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
				|ИЗ
				|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
				|ГДЕ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачДата И &КонДата
				|
				|СГРУППИРОВАТЬ ПО
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ВложенныйЗапрос
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
				|	ПО (НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаКалендаря, МЕСЯЦ) = РабочееВремяРаботниковОрганизаций.Период)
				|ГДЕ
				//|	(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
				|	(РабочееВремяРаботниковОрганизаций.ДатаНачала МЕЖДУ &НачДата И &КонДата или &НачДата МЕЖДУ РабочееВремяРаботниковОрганизаций.ДатаНачала и РабочееВремяРаботниковОрганизаций.ДатаОкончания)
				//|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
				|	И РабочееВремяРаботниковОрганизаций.Организация = &Организация
				|	И ВЫБОР
				|			КОГДА &ФлагПоТабелю
				|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации или РабочееВремяРаботниковОрганизаций.Регистратор = неопределено
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|СГРУППИРОВАТЬ ПО
				|	РабочееВремяРаботниковОрганизаций.Сотрудник,
				|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
				|	РабочееВремяРаботниковОрганизаций.Период,
				|	ВложенныйЗапрос.ДатаКалендаря";
			иначе
				мЗапрос = Новый Запрос;
				мЗапрос.Текст = 
				"ВЫБРАТЬ
				|	РабочееВремяРаботниковОрганизаций.Сотрудник,
				|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
				|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
				|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
				|	МАКСИМУМ(РабочееВремяРаботниковОрганизаций.Регистратор) КАК Регистратор,
				//|	РабочееВремяРаботниковОрганизаций.Период КАК Период1,  //Аверсон 05.03.2020 КВВ СВФР-005629 (закомментировала)
				|	ВложенныйЗапрос.ДатаКалендаря КАК Период
				|ИЗ
				|	(ВЫБРАТЬ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
				|ИЗ
				|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
				|ГДЕ
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачДата И &КонДата
				|
				|СГРУППИРОВАТЬ ПО
				|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ВложенныйЗапрос
				
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
				
				//Аверсон 05.03.2020 КВВ СВФР-005629 (
				|	ПО (НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаКалендаря, МЕСЯЦ) = НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ))
				//|	ПО (НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаКалендаря, МЕСЯЦ) = РабочееВремяРаботниковОрганизаций.Период)  //(закомментировала)
				//Аверсон 05.03.2020 КВВ СВФР-005629 )
				
				|ГДЕ
				//|	(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
				|	РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
				//|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
				|	И РабочееВремяРаботниковОрганизаций.Организация = &Организация
				|	И ВЫБОР
				|			КОГДА &ФлагПоТабелю
				|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации 
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|СГРУППИРОВАТЬ ПО
				|	РабочееВремяРаботниковОрганизаций.Сотрудник,
				|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
				
				//Аверсон 05.03.2020 КВВ СВФР-005629 (
				//|	РабочееВремяРаботниковОрганизаций.Период, //(закомментировала)
				|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.ДатаКалендаря, МЕСЯЦ),
				//Аверсон 05.03.2020 КВВ СВФР-005629 )
				
				|	ВложенныйЗапрос.ДатаКалендаря";
			КонецЕсли;
			мЗапрос.УстановитьПараметр("НачДата", ЭтотОбъект.ДатаНачалаПериода);
			мЗапрос.УстановитьПараметр("КонДата", ЭтотОбъект.ДатаОкончанияПериода);
			мЗапрос.УстановитьПараметр("Организация", Организация);
			УчетнаяПолитикаЗапрос = Новый Запрос;
			УчетнаяПолитикаЗапрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
			|ИЗ
			|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
			|ГДЕ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
			УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
			УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
			если УчетнаяПолитика.Количество()>0 Тогда 
				мЗапрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
			иначе
				мЗапрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
			КонецЕсли;
		КонецЦикла;
		РезПериоды = мЗапрос.Выполнить().Выгрузить();
		//О.Т. Аверсон 04.04.2019 № 4199
		
		Движения.РабочееВремяРаботниковОрганизаций.Очистить();
		Движения.РабочееВремяРаботниковОрганизаций.Записать();
		
		Для Каждого мСтрока Из ЭтотОбъект.ОтработанноеВремя Цикл
			ПрочиеПроцедуры.ДобавитьГрафикиРаботыПоВидамВремени(ЭтотОбъект.ДатаНачалаПериода, ЭтотОбъект.ДатаОкончанияПериода, мСтрока.Сотрудник, ЭтотОбъект, Ложь,РезПериоды); 
		КонецЦикла;
		//Аверсон 03.03.2020 КВВ СВФР-005618 (
	Иначе
		Движения.РабочееВремяРаботниковОрганизаций.Очистить();
		Движения.РабочееВремяРаботниковОрганизаций.Записать();
	КонецЕсли;
	//Аверсон 03.03.2020 КВВ СВФР-005618 )
КонецПроцедуры
//енд

Функция ЕстьИндивГрафикУСотрудника(Сотрудник,МесяцПроверки)
	//Аверсон 14.05.2020 КВВ СВФР-005980 (
	З = Новый Запрос;
	З.Текст = 
	"ВЫБРАТЬ 
	|ИндивГрафик.Ссылка.ПериодРегистрации как МесяцГрафика
	|ИЗ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ИндивГрафик
	|ГДЕ ИндивГрафик.Сотрудник = &Сотрудник
	|И ИндивГрафик.Ссылка.ПериодРегистрации = &МесяцПроверки";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("МесяцПроверки",НачалоМесяца(МесяцПроверки));
	ТЗРез = З.Выполнить().Выгрузить();
	Возврат ТЗРез.Количество();
	//Аверсон 14.05.2020 КВВ СВФР-005980 )
КонецФункции

Функция ПроверкаСокращенныхДнейВМесяце(Сотрудник,Месяц)
	//Аверсон 21.08.2020 КВВ СВФР-006439 (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|СокращенныеДни.Регистратор
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ СокращенныеДни.Сотрудник = &Сотрудник
	|И СокращенныеДни.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период,МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период,МЕСЯЦ)";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("Период",Месяц);
	РезЗ = З.Выполнить().Выгрузить();
	ЕстьСокращ = ?(РезЗ.Количество()=0,Ложь,Истина);
	Возврат ЕстьСокращ;
	//Аверсон 21.08.2020 КВВ СВФР-006439 )
КонецФункции

Функция СокращенныеЧасыВДате(Сотрудник,ДатаПроверки)
	//Аверсон 21.08.2020 КВВ СВФР-006439 (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|СокращенныеДни.КоличествоЧасов
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ СокращенныеДни.Сотрудник = &Сотрудник
	|И СокращенныеДни.Период = &Период";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("Период",ДатаПроверки);
	РезЗ = З.Выполнить().Выгрузить();
	КолвоЧасов = ?(РезЗ.Количество()=0,0,РезЗ[0].КоличествоЧасов);
	Возврат КолвоЧасов;
	//Аверсон 21.08.2020 КВВ СВФР-006439 )
КонецФункции

//ПСА 14-12-2020 СВФР-006909 +++
Функция СформироватьМассивДоступныхКатегорийСотрудникаЗаПериод(ПериодРегистрации, Подразделение) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник
	|ПОМЕСТИТЬ ВтРаботники
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
	|	И РаботникиОрганизаций.Период >= &НачалоМесяца
	|	И РаботникиОрганизаций.Период <= &КонецМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КатегорииОбъектов.Категория.Ссылка КАК Категория
	|ИЗ
	|	ВтРаботники КАК ВтРаботники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО ВтРаботники.Сотрудник = КатегорииОбъектов.Объект
	|
	|СГРУППИРОВАТЬ ПО
	|	КатегорииОбъектов.Категория.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КатегорииОбъектов.Категория.Ссылка.Наименование";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
	
	Возврат Запрос.Выполнить();
	
КонецФункции
//+++ ПСА 14-12-2020 СВФР-006909


Функция ПроверкаНочныхВСменном(График,ДатаПроверки) 
	//Аверсон 18.01.2021 КВВ СВФР-007084 (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|	isnull(СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение),0) КАК ОсновноеЗначение
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикиРаботы
	|	И ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка
	|	И ГрафикиРаботыПоВидамВремени.Документ <> &ПустойДокумент
	|	И ГрафикиРаботыПоВидамВремени.Дата = &ДатаПроверки
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам)
	//ПСА 19.02.2021 СВФР-007197+++
	|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вт.ОсновноеЗначение
	|ИЗ
	|	Вт КАК Вт
	|ГДЕ
	|	Вт.ОсновноеЗначение <> 0";
	//+++ПСА 19.02.2021 СВФР-007197
	З.УстановитьПараметр("ГрафикиРаботы",График);
	З.УстановитьПараметр("ДокументСсылка", Ссылка);
	З.УстановитьПараметр("ПустойДокумент", Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка());
	З.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Резз = З.Выполнить().Выгрузить();
	Возврат Резз;
	//Аверсон 18.01.2021 КВВ СВФР-007084 )
КонецФункции

//ПСА 26.02.2021 СВФР-007248 +++
Функция ПроверкаКатегорииСотрудникаДляРаботы(СотрудникПроверки,ДатаПроверки)
	Результат = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Должность.Категория
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&ДатаПроверки,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Должность.Категория В (&МассивКатегорийПроверки)
	|	И РаботникиОрганизацийСрезПоследних.Должность.СдельнаяОплата = ИСТИНА";   //Аверсон 14.04.2021 КВВ СВФР-007434
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);	
	МассивКатегорийПроверки = Новый Массив();
	МассивКатегорийПроверки.Добавить(Справочники.КатегорииРаботников.РабочиеВспомогательные);   //Аверсон 14.04.2021 КВВ СВФР-007434
	МассивКатегорийПроверки.Добавить(Справочники.КатегорииРаботников.РабочиеОсновные);
	Запрос.УстановитьПараметр("МассивКатегорийПроверки", МассивКатегорийПроверки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	
//+++ПСА 26.02.2021 СВФР-007248

//ПСА 11.03.2021 СВФР-007321 +++
Функция ЗапретВыводаНочныхЧасов(СотрудникПроверки,ДатаПроверки)
	Результат = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ, -1) >= НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ, -1) >= НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние В(&МассивСостояний)
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Состояние В(&МассивСостояний)
	|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ, -1) >= НАЧАЛОПЕРИОДА(&ДатаСреза, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ДатаПроверки));
	МассивСостояний = Новый Массив();
	МассивСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.Прогулы);
	МассивСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникПроверки);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция СокращенныеНочныеЧасыВДате(Сотрудник,ДатаПроверки)
	Результат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|СокращенныеДни.КоличествоНочныхЧасов
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ СокращенныеДни.Сотрудник = &Сотрудник
	|И СокращенныеДни.Период = &Период";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("Период",ДатаПроверки);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.КоличествоНочныхЧасов;
	КонецЕсли;
	Возврат Результат;
КонецФункции
//+++ПСА 11.03.2021 СВФР-007321

//ПСА 12.03.2021 СВФР-007321 +++
Функция БылаКомандировка(СотрудникПроверки,ДатаПроверки)
	Результат = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостояниеРаботниковОрганизаций.Регистратор
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ
	|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И СостояниеРаботниковОрганизаций.Состояние = &Состояние
	//|	И &ДатаПроверки МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения";
	|	И &ДатаПроверки МЕЖДУ СостояниеРаботниковОрганизаций.Период И ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ,-1)"; //Аверсон 28.04.2021 КВВ СВФР-007334
	
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботникаОрганизации.Командировка);
	Запрос.УстановитьПараметр("Сотрудник", СотрудникПроверки);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Истина;	
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция ПодразделениеТранспортногоЦеха()
	
	Результат = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ВтПодразделения
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Наименование = &Наименование
	|	И ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Родитель.Наименование = &Наименование
	|	И ПодразделенияОрганизаций.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПодразделения.Подразделение
	|ИЗ
	|	ВтПодразделения КАК ВтПодразделения
	|ГДЕ
	|	ВтПодразделения.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Наименование", "Транспортный цех");
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат
КонецФункции	
//+++ПСА 12.03.2021 СВФР-007321

Функция ЗапросПоСостояниюСотрудника(Начало,Окончание,СписокСостояний,Сотрудник,ТекДень=Неопределено) //Аверсон 01.03.2022 КВВ СВФР-008748 (ТекДень)
	//Аверсон 22.07.2021 КВВ СВФР-007876 (
	ЗЗ = Новый Запрос;
	ЗЗ.Текст = 
	"ВЫБРАТЬ
	|	СостояниеРаботниковОрганизаций.Регистратор
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ
	|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И СостояниеРаботниковОрганизаций.Состояние В (&Состояние)";
	Если ТекДень = Неопределено Тогда //Аверсон 01.03.2022 КВВ СВФР-008748
		
		//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 2) (
		Если Организация.ИНН = "101542412" И СписокСостояний.Количество() = 1 И СписокСостояний[0].Значение = Перечисления.СостоянияРаботникаОрганизации.Командировка Тогда 
			ЗЗ.Текст = ЗЗ.Текст + "
			|	И (НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
			|	ИЛИ (НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
			|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) < НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
			|	))";
			//Аверсон 04.11.2022 КВВ СВФР-009766 (пункт 2) )	
			
		Иначе 
			ЗЗ.Текст = ЗЗ.Текст + "
			|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";
		КонецЕсли;
		ЗЗ.Текст = ЗЗ.Текст + "
		|	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ПериодЗавершения, ДЕНЬ)";	
		
		//Аверсон 01.03.2022 КВВ СВФР-008748 (
	Иначе
		ЗЗ.Текст = ЗЗ.Текст + "
		
		//Аверсон ЕАЕ 10.10.2024 СВФР-013739
		//|	И &ТекДень МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ)	И НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ)";
		|	И &ТекДень МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ)	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ), СЕКУНДА, -1)";
		//Аверсон СВФР-013739
		
	КонецЕсли;
	ЗЗ.УстановитьПараметр("ТекДень", ТекДень);
	//Аверсон 01.03.2022 КВВ СВФР-008748 )
	ЗЗ.УстановитьПараметр("Период", Начало);
	ЗЗ.УстановитьПараметр("ПериодЗавершения", Окончание+86400);      
	ЗЗ.УстановитьПараметр("Состояние", СписокСостояний);
	ЗЗ.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат ЗЗ;
	//Аверсон 22.07.2021 КВВ СВФР-007876 )
КонецФункции

Функция ПроверкаОтзываИзОтпускаВОтпускеПоБерИРодам(Сотрудник,ДатаПроверки);
	//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|СостояниеРаботниковОрганизаций.Регистратор, 
	|СостояниеРаботниковОрганизаций.Состояние,
	|СостояниеРаботниковОрганизаций.Период   
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
	|И &ДатаПроверки МЕЖДУ НАЧАЛОПЕРИОДА(СостояниеРаботниковОрганизаций.Период, ДЕНЬ) И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ,-1), ДЕНЬ)
	|И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
	|И СостояниеРаботниковОрганизаций.Регистратор.ОтражатьИзмененияПоПродлению
	|И (СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть))
	|И СостояниеРаботниковОрганизаций.Регистратор.ТипОтзыва = ЗНАЧЕНИЕ(Перечисление.ТипыОтзываИзОтпуска.Продление)";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("ДатаПроверки",ДатаПроверки);
	РезЗ = З.Выполнить().Выгрузить();
	Возврат РезЗ;
	//Аверсон 06.08.2021 КВВ СВФР-007942 (пункт 4) )
КонецФункции

Функция ПроверкаНаПодразделениеВТекущийДень(ПодразделениеОрганизации,ТекДень,СтрСотрудник)
	//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) (
	Продолжать = Истина;
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ПодрНаТекДень = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекДень,Новый Структура("Сотрудник",СтрСотрудник)).ПодразделениеОрганизации;
		Если ПодразделениеОрганизации <> ПодрНаТекДень Тогда
			Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель) Тогда
				Если ПодрНаТекДень.Родитель <> ПодразделениеОрганизации Тогда
					Если ЗначениеЗаполнено(ПодрНаТекДень.Родитель.Родитель) Тогда
						Если ПодрНаТекДень.Родитель.Родитель <> ПодразделениеОрганизации Тогда
							Продолжать = Ложь;
						КонецЕсли;	
					Иначе
						Продолжать = Ложь;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Продолжать = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Продолжать;
	//Аверсон 27.04.2022 КВВ СВФР-008892 (пункт 3) )
КонецФункции

//Аверсон ЕАЕ 10.08.2022 СВФР-009418
Функция ПолучитьПериодыВредности(СписокСотрудников, Нач, Кон)
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие,
	|&НачДата КАК Период
	|ПОМЕСТИТЬ ВТВредность
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&НачДата, Сотрудник В (&Сотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
	|	И ВЫБОР
	|	КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &НачДата
	|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
	|	ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
	|	КОНЕЦ В (&СписокДействий)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизаций.Действие,
	|	ПлановыеНачисленияРаботниковОрганизаций.Период
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
	|	И ВЫБОР
	|	КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &НачДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
	|	ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
	|	КОНЕЦ В (&СписокДействий)
	|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В (&Сотрудники)
	|	И ПлановыеНачисленияРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата		
	|;
	|//////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВредность.Сотрудник,
	|	ВТВредность.Период КАК НачалоПериода,
	|	МАКСИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТВредностьБольше.Период,СЕКУНДА,-1), &КонДата)) КАК КонецПериода
	|ИЗ ВТВредность
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТВредность КАК ВТВредностьБольше
	|ПО ВТВредность.Сотрудник = ВТВредностьБольше.Сотрудник
	|	И ВТВредность.Период < ВТВредностьБольше.Период
	|	И ВТВредностьБольше.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|ГДЕ ВТВредность.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
	|СГРУППИРОВАТЬ ПО
	|	ВТВредность.Сотрудник,
	|	ВТВредность.Период
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Сотрудники", СписокСотрудников);
	Запрос.УстановитьПараметр("НачДата", Нач);
	Запрос.УстановитьПараметр("КонДата", Кон);
	
	СписокДействий = Новый Массив;
	СписокДействий.Добавить(Перечисления.ВидыДействияСНачислением.Начать);
	СписокДействий.Добавить(Перечисления.ВидыДействияСНачислением.Прекратить);
	Запрос.УстановитьПараметр("СписокДействий", СписокДействий);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции
//Аверсон СВФР-009418

Функция ПроверкаДняНаКоторыйПереносим(Сотрудник,КакойДеньПереносим)
	//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) (
	З_Перенос = Новый Запрос;
	З_Перенос.Текст = "
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) (
	|ВЫБРАТЬ
	|СостояниеРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.ПериодЗавершения,ДЕНЬ,-1) КАК ДатаОкончания,
	|СостояниеРаботниковОрганизаций.Период КАК ДатаНачала
	|ПОМЕСТИТЬ ВтОтзыв
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ
	|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
	|И СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник 
	|И СостояниеРаботниковОрганизаций.Регистратор.ОтражатьИзмененияПоПродлению
	|И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|И СостояниеРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
	|;
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) )
	
	|ВЫБРАТЬ 
	|СРО.Сотрудник,
	|СРО.Регистратор,
	|СРО.Период,
	|СРО.ПериодЗавершения,
	|СРО.Состояние
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СРО
	
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) (
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтОтзыв
	|ПО ВтОтзыв.Сотрудник = СРО.Сотрудник
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) )
	
	|ГДЕ СРО.Сотрудник = &Сотрудник
	|И (СРО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И СРО.ПериодЗавершения <> КОНЕЦПЕРИОДА(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),ДЕНЬ)) //Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 1)
	|И &ДатаПроверки МЕЖДУ НАЧАЛОПЕРИОДА(СРО.Период, ДЕНЬ) И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СРО.ПериодЗавершения,ДЕНЬ,-1), ДЕНЬ)
	|И СРО.Состояние В (&СостояниеПроверкиПереноса)
	
	////Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) (
	//|И (ВтОтзыв.Сотрудник ЕСТЬ NULL
	//|ИЛИ (НЕ ВтОтзыв.Сотрудник ЕСТЬ NULL 
	//|И НЕ (&ДатаПроверки МЕЖДУ ВтОтзыв.ДатаНачала И ВтОтзыв.ДатаОкончания)))
	////Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 5) )
	|";
	
	З_Перенос.УстановитьПараметр("Сотрудник", Сотрудник);
	З_Перенос.УстановитьПараметр("ДатаПроверки", КакойДеньПереносим);
	З_Перенос.УстановитьПараметр("СостояниеПроверкиПереноса", СостояниеПроверкиПереноса);
	РезЗ_Перенос = З_Перенос.Выполнить().Выгрузить();
	
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 3) (
	Если РезЗ_Перенос.Количество() = 0 Тогда //проверим дату приема
		З = Новый Запрос;
		З.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РаботникиОрганизаций.Период КАК ДатаПриема
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник = &Сотрудник
		|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию		
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		З.УстановитьПараметр("Сотрудник",Сотрудник);
		ВыборкаЗ = З.Выполнить().Выбрать();
		Если ВыборкаЗ.Следующий() Тогда
			ДатаПриемаСотрудника = ВыборкаЗ.ДатаПриема;	
			Если НачалоДня(ДатаПриемаСотрудника) > НачалоДня(КакойДеньПереносим) Тогда
				Стр = РезЗ_Перенос.Добавить();
				Стр.Сотрудник = Сотрудник;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 3) )
	
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 1) (
	Если РезЗ_Перенос.Количество() = 0 Тогда 
		З2 = Новый Запрос;
		З2.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|СРО.Сотрудник,
		|СРО.Регистратор,
		|СРО.Период,
		|СРО.ПериодЗавершения,
		|СРО.Состояние
		|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СРО
		|ГДЕ СРО.Сотрудник = &Сотрудник
		|И (СРО.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ СРО.ПериодЗавершения = КонецПериода(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),ДЕНЬ))
		|И СРО.Состояние = &СостояниеПроверкиПереноса
		|И СРО.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
		|И СРО.Период <= &ДатаПроверки
		|УПОРЯДОЧИТЬ ПО
		|СРО.Период УБЫВ";
		З2.УстановитьПараметр("Сотрудник", Сотрудник);
		З2.УстановитьПараметр("ДатаПроверки", КакойДеньПереносим);
		З2.УстановитьПараметр("СостояниеПроверкиПереноса", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
		РезЗ2 = З2.Выполнить().Выгрузить();
		Если РезЗ2.Количество() <> 0 Тогда
			ДатаНачБЛ = РезЗ2[0].Период;
			
			З3 = Новый Запрос;
			З3.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|СРО.Сотрудник,
			|СРО.Регистратор,
			|СРО.Период,
			|СРО.ПериодЗавершения,
			|СРО.Состояние
			|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СРО
			|ГДЕ СРО.Сотрудник = &Сотрудник
			|И СРО.Период > &ДатаПроверки
			|УПОРЯДОЧИТЬ ПО
			|Период ВОЗР";
			З3.УстановитьПараметр("Сотрудник", Сотрудник);
			З3.УстановитьПараметр("ДатаПроверки", ДатаНачБЛ);
			РезЗ3 = З3.Выполнить().Выгрузить();
			Если РезЗ3.Количество() = 0 Тогда //еще болеет
				Стр = РезЗ_Перенос.Добавить();
				Стр.Сотрудник = Сотрудник;
			ИначеЕсли РезЗ3[0].Состояние = Перечисления.СостоянияРаботникаОрганизации.Работает 
				ИЛИ РезЗ3[0].Состояние = Перечисления.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку //СВЭЙ 24.10.2023 КВВ СВФР-011689
				ИЛИ РезЗ3[0].Состояние = Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни Тогда
				ДатаКонБЛ = РезЗ3[0].Период;
				Если НачалоДня(КакойДеньПереносим) >= НачалоДня(ДатаНачБЛ) И НачалоДня(КакойДеньПереносим) <= НачалоДня(НачалоДня(ДатаКонБЛ)-1) Тогда
					Стр = РезЗ_Перенос.Добавить();
					Стр.Сотрудник = Сотрудник;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	//Аверсон 27.04.2023 КВВ СВФР-010731 (пункт 1) )
	
	Возврат РезЗ_Перенос;
	//Аверсон 22.03.2023 КВВ СВФР-010566 (пункт 1) )
КонецФункции

//Аверсон ЕАЕ 14.11.2024 СВФР-013927
Процедура ЗаполнитьНочныеСверхурочные()
	//Список сотрудников
	СписокСотрудников = ОтработанноеВремя.ВыгрузитьКолонку("Сотрудник");
	
	//Список состояний с регистраторами
	ТЗНочные = ПолучитьКоличествоНочныхСверхурочных(СписокСотрудников);
	
	//Заполняем в табель
	Для Каждого Стр Из ТЗНочные Цикл
		//ищем строку с сотрудником
		НужнаяСтр = ОтработанноеВремя.Найти(Стр.Сотрудник, "Сотрудник");
		Если НужнаяСтр <> Неопределено Тогда
			//ищем колонку с датой
			ДатаЧисло = Строка(День(Стр.Дата));
			Для н = 1 По 3 Цикл
				Если н = 1 Тогда
					Префикс = "Первый";
				ИначеЕсли н = 2 Тогда
					Префикс = "Второй";
				ИначеЕсли н = 3 Тогда
					Префикс = "Третий";
				КонецЕсли;
				ИмяКолонкиВидВремени = Префикс + "ВидВремени" + ДатаЧисло;
				ИмяКолонкиЧасов = Префикс + "Часов" + ДатаЧисло;
				Если ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиВидВремени]) ИЛИ ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиЧасов]) Тогда
					Продолжить;
				Иначе
					НужнаяСтр[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
					НужнаяСтр[ИмяКолонкиЧасов] = Стр.НочныхЧасов;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьКоличествоНочныхСверхурочных(СписокСотрудников)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник,
		|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Дата,
		|	СУММА(ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.НочныхЧасов) КАК НочныхЧасов
		|ИЗ
		|	Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации
		|ГДЕ
		|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|	И ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник В (&СписокСотрудников)
		|	И ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.НочныхЧасов > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник,
		|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Дата";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
 
КонецФункции
//Аверсон СВФР-013927

//Аверсон ЕАЕ 10.02.2025 СВФР-014831
Процедура ЗаполнитьПраздничныеВДниКомандировки()
	//Список сотрудников
	СписокСотрудников = ОтработанноеВремя.ВыгрузитьКолонку("Сотрудник");
	
	//Список состояний с регистраторами
	ТЗПраздничные = ПолучитьПраздничные(СписокСотрудников);
	
	//Заполняем в табель
	Для Каждого Стр Из ТЗПраздничные Цикл
		//ищем строку с сотрудником
		НужнаяСтр = ОтработанноеВремя.Найти(Стр.Сотрудник, "Сотрудник");
		Если НужнаяСтр <> Неопределено Тогда
			//ищем колонку с датой
			ДатаЧисло = Строка(День(Стр.Дата));
			
			БылаКомандировка = Ложь;
			УжеЕстьПраздничные = Ложь;
			
			Для н = 1 По 3 Цикл
				Если н = 1 Тогда
					Префикс = "Первый";
				ИначеЕсли н = 2 Тогда
					Префикс = "Второй";
				ИначеЕсли н = 3 Тогда
					Префикс = "Третий";
				КонецЕсли;
				ИмяКолонкиВидВремени = Префикс + "ВидВремени" + ДатаЧисло;
				ИмяКолонкиЧасов = Префикс + "Часов" + ДатаЧисло;
				
				Если ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиВидВремени]) Тогда
					Если НужнаяСтр[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
						БылаКомандировка = Истина;
						
						Если Не ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиЧасов]) Тогда
							НужнаяСтр[ИмяКолонкиЧасов] = Стр.ОтработаноЧасов;	
						КонецЕсли;
						
					ИначеЕсли НужнаяСтр[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
						УжеЕстьПраздничные = Истина;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если БылаКомандировка = Истина И НЕ УжеЕстьПраздничные Тогда
				Для н = 1 По 3 Цикл
					Если н = 1 Тогда
						Префикс = "Первый";
					ИначеЕсли н = 2 Тогда
						Префикс = "Второй";
					ИначеЕсли н = 3 Тогда
						Префикс = "Третий";
					КонецЕсли;
					ИмяКолонкиВидВремени = Префикс + "ВидВремени" + ДатаЧисло;
					ИмяКолонкиЧасов = Префикс + "Часов" + ДатаЧисло;
					
					Если ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиВидВремени]) ИЛИ ЗначениеЗаполнено(НужнаяСтр[ИмяКолонкиЧасов]) Тогда
						Продолжить;
					Иначе
						НужнаяСтр[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
						НужнаяСтр[ИмяКолонкиЧасов] = Стр.ОтработаноЧасов;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПраздничные(СписокСотрудников)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Сотрудник,
		|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ДатаВыхода КАК Дата,
		|	СУММА(ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ОтработаноЧасов) КАК ОтработаноЧасов
		|ИЗ
		|	Документ.ПриказНаРаботуВПраздничныеИВыходныеДни.РаботникиОрганизации КАК ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации
		|ГДЕ
		|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|	И ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Сотрудник В (&СписокСотрудников)
		|	И ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ОтработаноЧасов > 0
		|   И ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Сотрудник,
		|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ДатаВыхода";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
 
КонецФункции
//Аверсон СВФР-014831

//Аверсон ЕАЕ 29.08.2025 СВФР-016583
Процедура ЗаполнитьОтпускВВыходныеДни(ТаблицаОбщиеГрафики, ТЗ_НеявкиКопия, МассивПраздников) //Аверсон ЕАЕ 16.01.2026 СВФР-017761 МассивПраздников
	//Из таблицы ТаблицаОбщиеГрафики можно взять дни, не рабочие по графику
	//Из таблицы ТЗ_НеявкиКопия можно взять отпуска и отзывы
	
	//Строки сотрудников с отпусками
	СтруктураОтбораОтпуск = Новый Структура;
	СтруктураОтбораОтпуск.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
	СтруктураОтбораОтпуск.Вставить("ДокОтзыв", 1);
	НужныеСтрокиОтпуск = ТЗ_НеявкиКопия.НайтиСтроки(СтруктураОтбораОтпуск);
	
	Для Каждого Стр Из НужныеСтрокиОтпуск Цикл
		НачОтпуска = Стр.ДатаНачала;
		КонОтпуска = Мин(Стр.ДатаОкончания, КонецМесяца(ПериодРегистрации));
		ДатаПроверки = НачОтпуска;
		Пока ДатаПроверки <= КонОтпуска Цикл
			
			//Аверсон ЕАЕ 16.01.2026 СВФР-017761
			//Если это не праздник
			Если МассивПраздников.Найти(ДатаПроверки) <> Неопределено Тогда
				ДатаПроверки = КонецДня(ДатаПроверки) + 1;
				Продолжить;		
			КонецЕсли;
			//Аверсон СВФР-017761
			
			//Если у него был не рабочий день
			СтруктураОтбораРабочийДень = Новый Структура;
			СтруктураОтбораРабочийДень.Вставить("Сотрудник", Стр.Сотрудник);
			СтруктураОтбораРабочийДень.Вставить("Дата", ДатаПроверки);
			НужныеСтрокиРабочийДень = ТаблицаОбщиеГрафики.НайтиСтроки(СтруктураОтбораРабочийДень);
			Если НужныеСтрокиРабочийДень.Количество() > 0 Тогда
				ДатаПроверки = КонецДня(ДатаПроверки) + 1;
				Продолжить;
			КонецЕсли;
			
			//Если у него нет работы в этот день
			СтруктураОтбораРабота = Новый Структура;
			СтруктураОтбораРабота.Вставить("Сотрудник", Стр.Сотрудник);
			СтруктураОтбораРабота.Вставить("БукваВидаВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
			НужныеСтрокиРабота = ТЗ_НеявкиКопия.НайтиСтроки(СтруктураОтбораРабота);
			ЕстьРабота = Ложь;
			Для Каждого СтрРабота Из НужныеСтрокиРабота Цикл
				НачРабота = СтрРабота.ДатаНачала;
				КонРабота = Мин(СтрРабота.ДатаОкончания, КонецМесяца(ПериодРегистрации));
				Если ДатаПроверки >= НачРабота И ДатаПроверки <= КонРабота Тогда
					ЕстьРабота = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			//Запишем "О"
			Если ЕстьРабота = Ложь Тогда
				СтрСотрудника = ОтработанноеВремя.Найти(Стр.Сотрудник, "Сотрудник");
				День = День(ДатаПроверки);
				ИмяКолонкиВидВремени = "ПервыйВидВремени" + СокрЛП(День);
				ЗначениеВидВремени = СтрСотрудника[ИмяКолонкиВидВремени];
				ИмяКолонкиЧасов = "ПервыйЧасов" + СокрЛП(День);
				ЗначениеЧасов = СтрСотрудника[ИмяКолонкиЧасов];
				Если Не ЗначениеЗаполнено(ЗначениеВидВремени) И ЗначениеЧасов = 0 Тогда
					СтрСотрудника[ИмяКолонкиВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск;
				КонецЕсли;
			КонецЕсли;
			
			ДатаПроверки = КонецДня(ДатаПроверки) + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
//Аверсон СВФР-016583

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

КлассификаторНочноеВремя = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
КлассификаторВечернееВремя = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы;

ВидУчетаВремениПоДням  			= Перечисления.ВидыУчетаВремени.ПоДням;
ВидУчетаВремениПоЧасам 			= Перечисления.ВидыУчетаВремени.ПоЧасам;
ВидУчетаВремениПоВечернимЧасам 	= Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
ВидУчетаВремениПоНочнымЧасам 	= Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
//толик
ВидУчетаВремениПоВредность  	= Перечисления.ВидыУчетаВремени.ПоВредность;


МассивПриставок = Новый Массив(3);
МассивПриставок[0] = "Первый";
МассивПриставок[1] = "Второй";
МассивПриставок[2] = "Третий";

КлассификаторЯвка = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
КлассификаторВечерниеЧасы = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы;
КлассификаторНочныеЧасы = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
КлассификаторПустаяСсылка = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
//толик
КлассификаторВредность = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;

//СВЭЙ 24.06.2024 КВВ СВФР-013142 (
СпЗн_ВидыВремениОтсутствия = Новый СписокЗначений;
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоКоллДоговору);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоСостояниюЗдоровья);
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускСамоизоляция); 
СпЗн_ВидыВремениОтсутствия.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя);
//СВЭЙ 24.06.2024 КВВ СВФР-013142 ) 

//СВЭЙ 04.07.2024 КВВ СВФР-013374 (
Для Каждого СтрВР Из Справочники.ГруппыРасчетов.ИсключениеИзНочныхЧасовДляТабеля.КлассификаторИспользованияРВ Цикл 
	СпЗн_ВидыВремениОтсутствия.Добавить(СтрВР.ВидКлассификатора);
КонецЦикла;
//СВЭЙ 04.07.2024 КВВ СВФР-013374 )
