Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
Функция СформироватьЗапросПоБолееПозднейДате(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛицаСанитарноГигиеническоеОбучение.Ссылка,
	|	ФизическиеЛицаСанитарноГигиеническоеОбучение.НомерСтроки,
	|	ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения КАК ДатаОбучения
	|ИЗ
	|	Справочник.ФизическиеЛица.СанитарноГигиеническоеОбучение КАК ФизическиеЛицаСанитарноГигиеническоеОбучение
	|ГДЕ
	|	ФизическиеЛицаСанитарноГигиеническоеОбучение.Ссылка = &Ссылка

	|УПОРЯДОЧИТЬ ПО
	|	ДатаОбучения УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", НачПериод);
	
	Если ДатаОбучения = 2 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения КАК ДатаОбучения","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая КАК ДатаОбученияСледующая");
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И (ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения < &ДатаНачала ИЛИ ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения ЕСТЬ NULL)","И (ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая < &ДатаНачала ИЛИ ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая ЕСТЬ NULL)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ДатаОбучения УБЫВ","ДатаОбученияСледующая УБЫВ");			
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции

Функция СформироватьЗапросПоРаботникамВДекрете(Сотрудник)	
	Запрос = Новый Запрос;
	 ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение,
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.Период <= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения >= &РабочаяДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("РабочаяДата", РабочаяДата);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();	
	
	Возврат Результат;
КонецФункции

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокФлюрографии, ДокументРезультат)
  
	Пока ВыборкаСтрокФлюрографии.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокФлюрографии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		РезультаВыбораДекретниц = СформироватьЗапросПоРаботникамВДекрете(ВыборкаСтрокФлюрографии.Сотрудник).Выбрать();
		Если Не РезультаВыбораДекретниц.Следующий() Тогда
			Если Не БезОбучения Тогда
				Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда			
					мНомер = 0;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
					ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
					ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
					ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					мНомер = мНомер + 1;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
					ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
					ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
					ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
					ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
					Если ДатаОбучения = 1 Тогда
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаОбучения;
					ИначеЕсли ДатаОбучения = 2 Тогда
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаОбученияСледующая;				
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				Иначе
					мНомер = мНомер + 1;
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
					ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
					ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
					ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
					ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
					Если ДатаОбучения = 1 Тогда
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаОбучения;
					ИначеЕсли ДатаОбучения = 2 Тогда
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = ВыборкаСтрокФлюрографии.ДатаОбученияСледующая;				
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
					
					ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
				КонецЕсли;
			Иначе
				Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда			
					РезультатВыбора = СформироватьЗапросПоБолееПозднейДате(ВыборкаСтрокФлюрографии.Сотрудник.ФизЛицо).Выбрать();
					Если РезультатВыбора.Следующий() Тогда
						Если ДатаОбучения = 1 Тогда
							Если РезультатВыбора.ДатаОбучения < НачПериод Тогда
								мНомер = 0;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
								ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
								ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
								ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								мНомер = мНомер + 1;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
								ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
								ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
								ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
								ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
								ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаОбучения;
								
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
								
							КонецЕсли;
						ИначеЕсли ДатаОбучения = 2 Тогда
							Если РезультатВыбора.ДатаОбученияСледующая < НачПериод Тогда
								мНомер = 0;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
								ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
								ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
								ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								мНомер = мНомер + 1;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
								ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
								ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
								ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
								ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
								ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаОбученияСледующая;
								
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
								
							КонецЕсли;
						КонецЕсли;
					Иначе
						мНомер = 0;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
						ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииКод);
						ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
						ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизацииНаименование;				
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
						
						мНомер = мНомер + 1;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
						ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
						ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
						ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
						ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = "";
						
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
						
						ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
						
					КонецЕсли;	
				Иначе
					РезультатВыбора = СформироватьЗапросПоБолееПозднейДате(ВыборкаСтрокФлюрографии.Сотрудник.ФизЛицо).Выбрать();
					Если РезультатВыбора.Следующий() Тогда
						Если ДатаОбучения = 1 Тогда
							Если РезультатВыбора.ДатаОбучения < НачПериод Тогда
								
								мНомер = мНомер + 1;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
								ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
								ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
								ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
								ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
								ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаОбучения;
								
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
								
							КонецЕсли;
						ИначеЕсли ДатаОбучения = 2 Тогда
							Если РезультатВыбора.ДатаОбученияСледующая < НачПериод Тогда
								
								мНомер = мНомер + 1;
								ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
								ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
								ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
								ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
								ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
								ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = РезультатВыбора.ДатаОбученияСледующая;
								
								ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
								
								ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
								
							КонецЕсли;
						КонецЕсли;
						
					Иначе

						мНомер = мНомер + 1;
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
						ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
						ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
						ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
						ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокФлюрографии.Должность;
						ОбластьДетальныхЗаписей.Параметры.ДатаПрохождения = "";
						
						ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
						
						ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
						
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	ТекПодр = ""; 
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Наименование КАК СотрудникНаименование,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	|	//1 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,
	|	//2 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаОтчета, ) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.СанитарноГигиеническоеОбучение КАК ФизическиеЛицаСанитарноГигиеническоеОбучение
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛицаСанитарноГигиеническоеОбучение.Ссылка
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	|	//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала
	|	//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения <= &ДатаОкончания
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,
	|	//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииПриоритет Возр,
	|	СотрудникНаименование Возр,
	|	Должность";

	
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("ДатаОтчета",РабочаяДата);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("Состояние",      Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Если ДатаОбучения = 1 Тогда
		Если Не БезОбучения тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//2 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая");			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала","И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения <= &ДатаОкончания","И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения <= &ДатаОкончания");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая");						
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность КАК Должность,","РаботникиОрганизацийСрезПоследних.Должность КАК Должность");
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала","И (ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения < &ДатаНачала ИЛИ ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения ЕСТЬ NULL)");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность,","РаботникиОрганизацийСрезПоследних.Должность");			
		КонецЕсли;		
	ИначеЕсли ДатаОбучения = 2 Тогда
		Если Не БезОбучения тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//2 ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая");			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала","И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая >= &ДатаНачала");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения <= &ДатаОкончания","И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая <= &ДатаОкончания");		
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая","ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая");						
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность КАК Должность,","РаботникиОрганизацийСрезПоследних.Должность КАК Должность");			
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбучения >= &ДатаНачала","И (ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая < &ДатаНачала ИЛИ ФизическиеЛицаСанитарноГигиеническоеОбучение.ДатаОбученияСледующая ЕСТЬ NULL)");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Должность,","РаботникиОрганизацийСрезПоследних.Должность");			
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	Область.Параметры.Подразделение = ?(ЗначениеЗаполнено(Подразделение), СокрЛП(Подразделение.Наименование), "");	
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетСанГигиенОбучение");
#КонецЕсли

