//Островская Татьяна 20.11.2013 № 16927
Функция СохранитьФайлНаДиске(Хранилище, ИмяФайла, ТолькоЧтение, СпособПерезаписи, ВопросОПерезаписи = Истина, ИмяСправочника = "ХранилищеДополнительнойИнформации") Экспорт
	Попытка
		ФайлНаДиске = Новый Файл(ИмяФайла);
		КаталогНаДиске = Новый Файл(ФайлНаДиске.Путь);

		Если Не КаталогНаДиске.Существует() Тогда
			СоздатьКаталог(ФайлНаДиске.Путь);
		КонецЕсли;

		Если ФайлНаДиске.Существует() И ВопросОПерезаписи = Истина Тогда

			Если СпособПерезаписи = "" Или ВРег(СпособПерезаписи) = "ДА" Или ВРег(СпособПерезаписи) = "НЕТ" Тогда



				ФормаЗапросаПерезаписиФайлов = Справочники[ИмяСправочника].ПолучитьФорму("ФормаЗапросаПерезаписиФайлов");
				ФормаЗапросаПерезаписиФайлов.ТекстПредупреждения = "На локальном диске уже существует файл:
				|" + ИмяФайла + "
				|Перезаписать имеющийся файл?";

				СпособПерезаписи = ФормаЗапросаПерезаписиФайлов.ОткрытьМодально();

				Если СпособПерезаписи = Неопределено Или ВРег(СпособПерезаписи) = "НЕТ" Или ВРег(СпособПерезаписи) = "НЕТДЛЯВСЕХ" Тогда


					Возврат Ложь;
				КонецЕсли;

			ИначеЕсли ВРег(СпособПерезаписи) = "НЕТДЛЯВСЕХ" Тогда

				Возврат Ложь;

			КонецЕсли;


			Если ФайлНаДиске.ПолучитьТолькоЧтение() Тогда
				ФайлНаДиске.УстановитьТолькоЧтение(Ложь);
			КонецЕсли;

		КонецЕсли;




		Если ТипЗнч(Хранилище) <> Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные = Хранилище.Получить();
		Иначе
			ДвоичныеДанные = Хранилище;
		КонецЕсли;

		Если ТипЗнч(ДвоичныеДанные) = Тип("ИнтернетПочтовоеСообщение") Тогда
			Сообщить("Это вложение не может быть сохранено!");
			Возврат Ложь;
		КонецЕсли;

		ДвоичныеДанные.Записать(ИмяФайла);
		ФайлНаДиске.УстановитьТолькоЧтение(ТолькоЧтение);
	Исключение


		Предупреждение(ОписаниеОшибки());
		Возврат Ложь;

	КонецПопытки;

	Возврат Истина;

КонецФункции
