
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсновныеНачисленияРаботниковОрганизаций
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Движение = Движения.ОсновныеНачисленияРаботниковОрганизаций.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаРаботникиОрганизации.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаРаботникиОрганизации.ДатаОкончания;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.Сотрудник = ТекСтрокаРаботникиОрганизации.Сотрудник;
		Движение.ФизЛицо = ТекСтрокаРаботникиОрганизации.ФизЛицо;
		Движение.Организация = Организация;
		Движение.Результат = ТекСтрокаРаботникиОрганизации.Результат;
		Движение.ОтработаноДней = ТекСтрокаРаботникиОрганизации.Дни;
		Движение.ОтработаноЧасов = ТекСтрокаРаботникиОрганизации.Часы;
		Движение.ПодразделениеОрганизации = ТекСтрокаРаботникиОрганизации.ПодразделениеОрганизации;
		Движение.ДатаНачалаСобытия = ТекСтрокаРаботникиОрганизации.ДатаНачалаСобытия;
		Движение.ОбособленноеПодразделение = Организация;
		Движение.Авторасчет = ТекСтрокаРаботникиОрганизации.Авторасчет;
	КонецЦикла;

	// регистр ВзаиморасчетыСРаботникамиОрганизаций Приход
	
	//Аверсон ЕАЕ 22.07.2021 СВФР-007899
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	//Аверсон СВФР-007899
	
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записывать = Истина;
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Физлицо = ТекСтрокаРаботникиОрганизации.ФизЛицо;
		Движение.Организация = Организация;
		
		//Аверсон ЕАЕ 22.07.2021 СВФР-007899
		//Движение.ПериодВзаиморасчетов = ТекСтрокаРаботникиОрганизации.ДатаНачала;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов = ПериодРегистрации;
		КонецЕсли;
		//Аверсон СВФР-007899
		
		Движение.СуммаВзаиморасчетов = ТекСтрокаРаботникиОрганизации.Результат;
	КонецЦикла;

	// регистр НДФЛСведенияОДоходах 
	Движения.НДФЛСведенияОДоходах.Записывать = Истина;
	Движения.НДФЛСведенияОДоходах.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		Движение.Период = ПериодРегистрации;
		Движение.Организация = Организация;
		Движение.ФизЛицо = ТекСтрокаРаботникиОрганизации.ФизЛицо;
		Движение.КодДохода = ВидРасчета.КодДоходаНДФЛ;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Движение.СуммаДохода = ТекСтрокаРаботникиОрганизации.Результат;
		Движение.ОбособленноеПодразделение = Организация;
		Движение.ПодразделениеОрганизации = ТекСтрокаРаботникиОрганизации.ПодразделениеОрганизации;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
