////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мЗакрытыеДниРождения Экспорт;

Перем мСпособОтображенияЗадач;

Перем мСкрытыеГруппыЗадач Экспорт;

Перем мКоличествоЗадачВГруппе;

//Аверсон ЕАЕ 23.01.2025 СВФР-014363
Перем мЗакрытыеПенсионеры Экспорт;
//Аверсон СВФР-014363

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Автозаполнение(Организация, ЗакрытыеДниРождения, СкрытыеГруппыЗадач, ГруппаЗадач = Неопределено, ЗакрытыеПенсионеры) Экспорт //Аверсон ЕАЕ 23.01.2025 параметр ЗакрытыеПенсионеры СВФР-014363
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	Если ГруппаЗадач = Неопределено Тогда
		ЗадачиПользователя.Очистить();
		
	Иначе
		ОтборПоЗадачам = Новый Структура("ПриоритетГруппыЗадач", Перечисления.ГруппыЗадачПользователя.Индекс(ГруппаЗадач));
		НайденныеСтроки = ЗадачиПользователя.НайтиСтроки(ОтборПоЗадачам);
		Для Номер = 0 По НайденныеСтроки.Количество()-1 Цикл
			ЗадачиПользователя.Удалить(НайденныеСтроки.Получить(Номер));
		КонецЦикла;
		
	КонецЕсли;
	
	Если ГруппаЗадач <> Неопределено И СкрытыеГруппыЗадач.Получить(ГруппаЗадач) = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Для того, чтобы обработка корректно отбирала данные при RLS по организациям,
	// будем ограничивать список доступных пользователю организаций
	СписокОрганизаций = Неопределено;
	СписокГоловныхОрганизаций = Неопределено;
	Если Не Организация.Пустая() Тогда
		СписокОрганизаций = Новый Массив;
		СписокГоловныхОрганизаций = Новый Массив;
		СписокОрганизаций.Добавить(Организация);
		СписокГоловныхОрганизаций.Добавить(ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка,
		|	ВЫБОР
		|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА Организации.Ссылка
		|		ИНАЧЕ Организации.ГоловнаяОрганизация
		|	КОНЕЦ КАК ГоловнаяОрганизация
		|ИЗ
		|	Справочник.Организации КАК Организации";
		СписокОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		СписокГоловныхОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГоловнаяОрганизация");
	КонецЕсли;
	
	//заявка №1688 (база заявок Кристалла) Дмитрук О.Г.
	//текущие задачи пользователя
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ТекущиеЗадачиПользователя);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТекущиеЗадачиПользователей.Период,
	|	ТекущиеЗадачиПользователей.Пользователь,
	|	ТекущиеЗадачиПользователей.Задача
	|ИЗ
	|	РегистрСведений.ТекущиеЗадачиПользователей КАК ТекущиеЗадачиПользователей
	|ГДЕ
	|	ТекущиеЗадачиПользователей.Пользователь = &Пользователь
	|	И ДОБАВИТЬКДАТЕ(ТекущиеЗадачиПользователей.Период, ГОД, ГОД(&ТекущаяДата) - ГОД(ТекущиеЗадачиПользователей.Период)) >= &ДатаОтсчета
	|	И ДОБАВИТЬКДАТЕ(ТекущиеЗадачиПользователей.Период, ГОД, ГОД(&ТекущаяДата) - ГОД(ТекущиеЗадачиПользователей.Период)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчета, ДЕНЬ, 10)	
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ТекущаяДата", РабочаяДата);
	Запрос.УстановитьПараметр("ДатаОтсчета", РабочаяДата - 86400);
    Запрос.УстановитьПараметр("Пользователь", глЗначениеПеременной("глТекущийПользователь"));

	
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ТекущиеЗадачиПользователя) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ТекущиеЗадачиПользователя);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= Формат(Выборка.Период, "ДФ='дд.ММ.гггг'") + " - " + СокрЛП(Выборка.Задача);
			НоваяЗадача.ТекстДерева				= Формат(Выборка.Период, "ДФ='дд.ММ.гггг'") + " - " + СокрЛП(Выборка.Задача);
			НоваяЗадача.Действие1				= "Открыть напоминание";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ТекущиеЗадачиПользователя);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуНапоминания";
			НоваяЗадача.ТекстСписка				= "Показать все напоминания...";
			НоваяЗадача.ТекстДерева				= "Показать все напоминания...";
			НоваяЗадача.Действие1				= "Показать все напоминания";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ТекущиеЗадачиПользователя);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	//заявка №1688
	
	// Дни рождения
	//Островская Татьяна 10.03.2014 № 17184
	//если ЗначениеЗаполнено(Организация.МесяцаПериод) Тогда 
	//	ДатаОтсчетаДнейРождения = ДобавитьМесяц(ТекущаяДата,Организация.МесяцаПериод);
	//иначе
		
		ДатаОтсчетаДнейРождения = ТекущаяДата - (2*24*60*60);
	//КонецЕсли;
	//Островская Татьяна 10.03.2014 № 17184
	УстаревшиеСтроки = Новый Массив;
	ЗакрытыеФизлица = Новый Массив;
	
	//Аверсон ЕАЕ 23.01.2025 СВФР-014363
	ЗакрытыеПенсионерыФизлица = Новый Массив;
	//Аверсон СВФР-014363
	
	// Дни рождения
	Для Каждого ДеньРождения Из ЗакрытыеДниРождения Цикл
		Если ДеньРождения.ДеньРождения < ДатаОтсчетаДнейРождения Тогда
			// устаревшие строки
			УстаревшиеСтроки.Добавить(ДеньРождения);
		Иначе
			ЗакрытыеФизлица.Добавить(ДеньРождения.Физлицо);
		КонецЕсли;
	КонецЦикла;
	// удалить "устаревшие" строки
	Для Каждого Элемент Из УстаревшиеСтроки Цикл
		Для Индекс = 0 По ЗакрытыеДниРождения.Количество()-1 Цикл
			ДеньРождения = ЗакрытыеДниРождения.Получить(Индекс);
			Если ДеньРождения = Элемент Тогда
				ЗакрытыеДниРождения.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Аверсон ЕАЕ 23.01.2025 СВФР-014363
	//Удалим из массива физлица с проставленным флагом пенсионер
	Кол = ЗакрытыеПенсионеры.Количество();
	Если Кол > 0 Тогда
		ПослИнд = Кол - 1;
		Для н = -ПослИнд По 0 Цикл
			Инд = -н;
			НужныйЭл = ЗакрытыеПенсионеры[Инд];
			ФЛ = НужныйЭл.Физлицо;
			Если ЭтоПенсионер(ФЛ) Тогда
				ЗакрытыеПенсионеры.Удалить(Инд);
			Иначе
				ЗакрытыеПенсионерыФизлица.Добавить(НужныйЭл.Физлицо);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон СВФР-014363
	
    //Островская Татьяна 10.03.2014 № 17184
	Если День(ТекущаяДата) < 20 Тогда
		если ЗначениеЗаполнено(Организация.МесяцаПериод) Тогда 
			АктуальныйПериодРегистрации = ДобавитьМесяц(НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1)),Организация.МесяцаПериод);
		иначе
			АктуальныйПериодРегистрации = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
		КонецЕсли;
	Иначе
		если ЗначениеЗаполнено(Организация.МесяцаПериод) Тогда 
			АктуальныйПериодРегистрации = ДобавитьМесяц(НачалоМесяца(ТекущаяДата),Организация.МесяцаПериод);
		иначе 
			АктуальныйПериодРегистрации = НачалоМесяца(ТекущаяДата);
		КонецЕсли;
	КонецЕсли;
	//Островская Татьяна 10.03.2014 № 17184
	Если Организация.ИНН = "806000046" Тогда 		
		ДатаОтсчетаДнейРождения1 = ДатаОтсчетаДнейРождения + (2*24*60*60);
	иначе
		ДатаОтсчетаДнейРождения1 = ДатаОтсчетаДнейРождения;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокОрганизаций",				СписокОрганизаций);
	Запрос.УстановитьПараметр("СписокГоловныхОрганизаций",		СписокГоловныхОрганизаций);
	Запрос.УстановитьПараметр("АктуальныйПериодРегистрации",	АктуальныйПериодРегистрации);
	
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ДеньРождения);
	
	Запрос.УстановитьПараметр("ЗакрытыеФизлица",			ЗакрытыеФизлица);
	Запрос.УстановитьПараметр("ТекущаяДата",				ТекущаяДата);
	Запрос.УстановитьПараметр("ТекущаяДата1",				ТекущаяДата);
	Запрос.УстановитьПараметр("ДатаОтсчетаДнейРождения",	ДатаОтсчетаДнейРождения1);
	Запрос.УстановитьПараметр("МесяцДата",	Организация.МесяцаПериод);
	
	//Аверсон ЕАЕ 23.01.2025 СВФР-014363
	Запрос.УстановитьПараметр("ЗакрытыеПенсионеры", ЗакрытыеПенсионерыФизЛица);
	//Аверсон СВФР-014363
	
	ЗапросДни = Новый Запрос;
	ЗапросДни.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаОтсчета И &ДатаОтсчета1
	|	И не РегламентированныйПроизводственныйКалендарь.ВидДня В(&ВидыДней)";
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
	СписокВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
	СписокВидов.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
	ЗапросДни.УстановитьПараметр("ВидыДней", СписокВидов);
	ЗапросДни.УстановитьПараметр("ДатаОтсчета", ДатаОтсчетаДнейРождения1);
	ЗапросДни.УстановитьПараметр("ДатаОтсчета1", ДобавитьМесяц(ДатаОтсчетаДнейРождения1,3));
	
	РезультатЗапросаДни = ЗапросДни.Выполнить().Выбрать();
	ДниЮбилей = 1;
	ДниНеЮбилей = 1;
	ДатаКалЮбилей = ДатаОтсчетаДнейРождения1;
	ДатаКалНеЮбилей = ДатаОтсчетаДнейРождения1;
	Пока РезультатЗапросаДни.Следующий() Цикл
		Если ДниЮбилей <=20 Тогда
			ДатаКалЮбилей = РезультатЗапросаДни.ДатаКалендаря;
			ДниЮбилей = ДниЮбилей+1
		КонецЕсли;
		Если ДниНеЮбилей <=5 Тогда 			
			ДатаКалНеЮбилей = РезультатЗапросаДни.ДатаКалендаря;
			ДниНеЮбилей = ДниНеЮбилей+1;
		КонецЕсли;

	КонецЦикла;
	
	
	ЗапросДляЮбилей = Новый Запрос;
	ЗапросДляЮбилей.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КолДнейЮбилей
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаКалендаря И &ДатаКалендаря1";
	
	ЗапросДляЮбилей.УстановитьПараметр("ДатаКалендаря", ДатаОтсчетаДнейРождения1);
	ЗапросДляЮбилей.УстановитьПараметр("ДатаКалендаря1", ДатаКалЮбилей);
	
	РезультатЗапросаДляЮбилей = ЗапросДляЮбилей.Выполнить().Выбрать();
	ДниЮбилей = 20;
	Пока РезультатЗапросаДляЮбилей.Следующий() Цикл
		ДниЮбилей = РезультатЗапросаДляЮбилей.КолДнейЮбилей;
	КонецЦикла;
	
	ЗапросДляЮбилей = Новый Запрос;
	ЗапросДляЮбилей.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КолДнейЮбилей
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаКалендаря И &ДатаКалендаря1";
	
	ЗапросДляЮбилей.УстановитьПараметр("ДатаКалендаря", ДатаОтсчетаДнейРождения1);
	ЗапросДляЮбилей.УстановитьПараметр("ДатаКалендаря1", ДатаКалНеЮбилей);
	
	РезультатЗапросаДляЮбилей = ЗапросДляЮбилей.Выполнить().Выбрать();
	ДниНеЮбилей = 5;
	Пока РезультатЗапросаДляЮбилей.Следующий() Цикл
		ДниНеЮбилей = РезультатЗапросаДляЮбилей.КолДнейЮбилей;
	КонецЦикла;

	
	
	Запрос.УстановитьПараметр("ДниЮбилей",	ДниЮбилей);
	Запрос.УстановитьПараметр("ДниНеЮбилей",	ДниНеЮбилей);

	
	Запрос = СформироватьЗапросПоДнямРожденияИПенсионному(Запрос,СписокОрганизаций,"ВТ_Сотрудники",0);
	
	Если ((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ДеньРождения)) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФИОСотрудника = СокрЛП(Выборка.Наименование);
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 4, ФИОСотрудника);
			
			ФИОСотрудника2 = СокрЛП(Выборка.Наименование);
			ФИОСотрудника2 = СтрЗаменить(ФИОСотрудника2,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника2, 2, ФИОСотрудника2);
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ДеньРождения);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			//Островская Татьяна 02.04.2014
			если Число(Прав(Выборка.КоличествоЛет,1)) = 1 Тогда 
				ГодСтрока = "год";
			ИначеЕсли Число(Прав(Выборка.КоличествоЛет,1)) > 1 и Число(Прав(Выборка.КоличествоЛет,1)) < 5 Тогда 
				ГодСтрока = "года";
			иначе
				ГодСтрока = "лет";
			КонецЕсли;
	
			Если Выборка.ДополнительныеДанные Тогда
				НоваяЗадача.ТекстСписка				= "Поздравить " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " с юбилеем " + ФИОСотрудника + ". Исполнится "+Выборка.КоличествоЛет+" "+ГодСтрока;
				НоваяЗадача.ТекстДерева				= "Поздравить " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " с юбилеем " + ФИОСотрудника + ". Исполнится "+Выборка.КоличествоЛет+" "+ГодСтрока;
			Иначе
				НоваяЗадача.ТекстСписка				= "Поздравить " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " с днем рождения " + ФИОСотрудника + ". Исполнится "+Выборка.КоличествоЛет+" "+ГодСтрока;
				НоваяЗадача.ТекстДерева				= "Поздравить " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " " + ФИОСотрудника + ". Исполнится "+Выборка.КоличествоЛет+" "+ГодСтрока;
			КонецЕсли;
			//Островская Татьяна 02.04.2014
			НоваяЗадача.Действие1				= "Открыть форму " + ФИОСотрудника2;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ДеньРождения);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуДеньРождения";
			НоваяЗадача.ТекстСписка				= "Показать все дни рождения...";
			НоваяЗадача.ТекстДерева				= "Показать все дни рождения...";
			НоваяЗадача.Действие1				= "Показать все дни рождения";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ДеньРождения);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("ТекущаяДата1",				ДобавитьМесяц(ТекущаяДата,-6));
	Если Организация.ИНН = "806000046" Тогда 		
		Запрос.УстановитьПараметр("ДатаОтсчетаДнейРождения",ДобавитьМесяц(ДатаОтсчетаДнейРождения + (2*24*60*60),-6)); 
	иначе
		Запрос.УстановитьПараметр("ДатаОтсчетаДнейРождения",ДобавитьМесяц(ДатаОтсчетаДнейРождения,-6)); 
	КонецЕсли;
	Запрос = СформироватьЗапросПоДнямРожденияИПенсионному(Запрос,СписокОрганизаций,"ВТ_Сотрудники1",1);
	
	//достижение пенсионного возраста
	// для персионных, когда выходить на пенсию через полгода после ДР
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Пенсионеры) Тогда
		НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
		
		КоличествоЗадач = 1; КоличествоВыборка = 0;	
	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФИОСотрудника = СокрЛП(Выборка.Наименование);
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 4, ФИОСотрудника);
			ФИОСотрудника2 = СокрЛП(Выборка.Наименование);
			ФИОСотрудника2 = СтрЗаменить(ФИОСотрудника2,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника2, 2, ФИОСотрудника2);		
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ДобавитьМесяц(КонецМесяца(ТекущаяДата),Организация.МесяцаПериод), Выборка.Ссылка.ДатаРождения, Лет, Месяцев, Дней);
			Если Выборка.Ссылка.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
				Если Выборка.Ссылка.ДатаРождения >= Дата(1957,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1957,06,30) Тогда 
					ГодПенсионных = 60;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1957,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1957,12,31) Тогда 
					ГодПенсионных = 61;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1958,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1958,06,30) Тогда 
					ГодПенсионных = 61;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1958,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1958,12,31) Тогда 
					ГодПенсионных = 62;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1959,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1959,06,30) Тогда 
					ГодПенсионных = 62;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1959,07,01) Тогда 
					ГодПенсионных = 63;	
				иначе
					ГодПенсионных = 60;
				КонецЕсли;
				
				Если Лет = ГодПенсионных Тогда
					НоваяЗадача = ЗадачиПользователя.Добавить();
					НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					НоваяЗадача.БольшеНеНапоминать		= Истина;
					НоваяЗадача.ТекстСписка				= "Достижение пенсионного возраста " + Формат(ДобавитьМесяц(Выборка.Период,6), "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.ТекстДерева				= "Достижение пенсионного возраста " + Формат(ДобавитьМесяц(Выборка.Период,6), "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.Действие1				= "Открыть форму " + ФИОСотрудника2;
					НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
					КоличествоВыборка = КоличествоВыборка + 1;
					КоличествоЗадач = КоличествоЗадач + 1;
				КонецЕсли;
				
			ИначеЕсли Выборка.Ссылка.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Если Выборка.Ссылка.ДатаРождения >= Дата(1962,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1962,06,30) Тогда 
					ГодПенсионных = 55;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1962,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1962,12,31) Тогда 
					ГодПенсионных = 56;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1963,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1963,06,30) Тогда 
					ГодПенсионных = 56;	
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1963,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1963,12,31) Тогда 
					ГодПенсионных = 57;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1964,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1964,06,30) Тогда 
					ГодПенсионных = 57;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1964,07,01) Тогда 
					ГодПенсионных = 58;
				иначе
					ГодПенсионных = 55;
				КонецЕсли;
				
				Если Лет = ГодПенсионных Тогда
					НоваяЗадача = ЗадачиПользователя.Добавить();
					НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					НоваяЗадача.БольшеНеНапоминать		= Истина;
					НоваяЗадача.ТекстСписка				= "Достижение пенсионного возраста " + Формат(ДобавитьМесяц(Выборка.Период,6), "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.ТекстДерева				= "Достижение пенсионного возраста " + Формат(ДобавитьМесяц(Выборка.Период,6), "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.Действие1				= "Открыть форму " + ФИОСотрудника2;
					НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
					НоваяЗадача.Период = ДобавитьМесяц(Выборка.Период,6);
					КоличествоВыборка = КоличествоВыборка + 1;
					КоличествоЗадач = КоличествоЗадач + 1;
				КонецЕсли;	
				
			КонецЕсли;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуПенсионеров";
			НоваяЗадача.ТекстСписка				= "Показать всех пенсионеров...";
			НоваяЗадача.ТекстДерева				= "Показать всех пенсионеров...";
			НоваяЗадача.Действие1				= "Показать всех пенсионеров";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	// для персионных, когда выходить на пенсию в день ДР
	Запрос.УстановитьПараметр("ТекущаяДата1",				ТекущаяДата);
	Если Организация.ИНН = "806000046" Тогда 		
		Запрос.УстановитьПараметр("ДатаОтсчетаДнейРождения",ДатаОтсчетаДнейРождения + (2*24*60*60)); 
	иначе
		Запрос.УстановитьПараметр("ДатаОтсчетаДнейРождения",ДатаОтсчетаДнейРождения); 
	КонецЕсли;
	Запрос = СформироватьЗапросПоДнямРожденияИПенсионному(Запрос,СписокОрганизаций,"ВТ_Сотрудники2",2);
	
	//достижение пенсионного возраста
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Пенсионеры) Тогда
		НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
		
		КоличествоЗадач = 1; КоличествоВыборка = 0;
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФИОСотрудника = СокрЛП(Выборка.Наименование);
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 4, ФИОСотрудника);
			ФИОСотрудника2 = СокрЛП(Выборка.Наименование);
			ФИОСотрудника2 = СтрЗаменить(ФИОСотрудника2,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника2, 2, ФИОСотрудника2);		
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ДобавитьМесяц(КонецМесяца(ТекущаяДата),Организация.МесяцаПериод), Выборка.Ссылка.ДатаРождения, Лет, Месяцев, Дней);
			Если Выборка.Ссылка.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
				Если Выборка.Ссылка.ДатаРождения >= Дата(1957,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1957,06,30) Тогда 
					ГодПенсионных = 60;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1957,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1957,12,31) Тогда 
					ГодПенсионных = 61;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1958,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1958,06,30) Тогда 
					ГодПенсионных = 61;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1958,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1958,12,31) Тогда 
					ГодПенсионных = 62;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1959,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1959,06,30) Тогда 
					ГодПенсионных = 62;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1959,07,01) Тогда 
					ГодПенсионных = 63;	
				иначе
					ГодПенсионных = 60;
				КонецЕсли;

				Если Лет = ГодПенсионных Тогда
					НоваяЗадача = ЗадачиПользователя.Добавить();
					НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					НоваяЗадача.БольшеНеНапоминать		= Истина;
					НоваяЗадача.ТекстСписка				= "Достижение пенсионного возраста " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.ТекстДерева				= "Достижение пенсионного возраста " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.Действие1				= "Открыть форму " + ФИОСотрудника2;
					НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
					КоличествоВыборка = КоличествоВыборка + 1;
					КоличествоЗадач = КоличествоЗадач + 1;
				КонецЕсли;	
			ИначеЕсли Выборка.Ссылка.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Если Выборка.Ссылка.ДатаРождения >= Дата(1962,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1962,06,30) Тогда 
					ГодПенсионных = 55;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1962,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1962,12,31) Тогда 
					ГодПенсионных = 56;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1963,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1963,06,30) Тогда 
					ГодПенсионных = 56;	
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1963,07,01) и Выборка.Ссылка.ДатаРождения <= Дата(1963,12,31) Тогда 
					ГодПенсионных = 57;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1964,01,01) и Выборка.Ссылка.ДатаРождения <= Дата(1964,06,30) Тогда 
					ГодПенсионных = 57;
				ИначеЕсли Выборка.Ссылка.ДатаРождения >= Дата(1964,07,01) Тогда 
					ГодПенсионных = 58;
				иначе
					ГодПенсионных = 55;
				КонецЕсли;
				Если Лет = ГодПенсионных Тогда
					НоваяЗадача = ЗадачиПользователя.Добавить();
					НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					НоваяЗадача.БольшеНеНапоминать		= Истина;
					НоваяЗадача.ТекстСписка				= "Достижение пенсионного возраста " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.ТекстДерева				= "Достижение пенсионного возраста " + Формат(Выборка.Период, "ДФ=""д ММММ""") + " " + ФИОСотрудника;
					НоваяЗадача.Действие1				= "Открыть форму " + ФИОСотрудника2;
					НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
					ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
					НоваяЗадача.Период = ДобавитьМесяц(Выборка.Период,6);
					КоличествоВыборка = КоличествоВыборка + 1;
					КоличествоЗадач = КоличествоЗадач + 1;
				КонецЕсли;	
			КонецЕсли;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуПенсионеров";
			НоваяЗадача.ТекстСписка				= "Показать всех пенсионеров...";
			НоваяЗадача.ТекстДерева				= "Показать всех пенсионеров...";
			НоваяЗадача.Действие1				= "Показать всех пенсионеров";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Пенсионеры);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
		
	КонецЕсли;

		
	//истечение срока трудовых договоров / контрактов
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаДоговоров);
	
	//Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговора.Период,
	|	ТрудовыеДоговора.Регистратор,
	|	ТрудовыеДоговора.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговора.ВидДоговора,
	|	ТрудовыеДоговора.НомерТД,
	|	ТрудовыеДоговора.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговора.НачалоДоговора,
	|	ТрудовыеДоговора.ОкончаниеДоговора КАК ОкончаниеДоговора,
	|	ТрудовыеДоговора.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник";
	
	//СВЭЙ 27.05.2024 КВВ СВФР-012926 (
	Если Организация.ИНН = "700103211" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|		И РаботникиОрганизацийСрезПоследних.Сотрудник.ТрудовойДоговор = ТрудовыеДоговора.Регистратор
		
		//Аверсон ЕАЕ 08.04.2025 СВФР-015258
		//Климовичи
		|   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговораНовые
		|   ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораНовые.Сотрудник
		|   	И РаботникиОрганизацийСрезПоследних.Сотрудник.ТрудовойДоговор <> ТрудовыеДоговораНовые.Регистратор
		|       И ТрудовыеДоговораНовые.Регистратор.Проведен = Истина
		|   	И (ТрудовыеДоговора.ОкончаниеДоговора <> ДатаВремя(1,1,1) И ТрудовыеДоговора.ОкончаниеДоговора < ТрудовыеДоговораНовые.НачалоДоговора)
		//Аверсон СВФР-015258
		
		|";
	КонецЕсли; 
	
	 Запрос.Текст = Запрос.Текст + "
	//СВЭЙ 27.05.2024 КВВ СВФР-012926 )
	
	|ГДЕ
	|	((ТрудовыеДоговора.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.ОкончаниеДоговора <= &ОкончаниеПериода)
	
	//Аверсон ЕАЕ 08.04.2025 СВФР-015258
	//Климовичи
	|   ИЛИ %УсловиеНовыйДоговор%)
	//Аверсон СВФР-015258
	
	|	И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	|	И НЕ ТрудовыеДоговора.Регистратор.НеНапоминатьОСобытии
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОкончаниеДоговора";
	//|	Сотрудник";
	
	//Аверсон ЕАЕ 08.04.2025 СВФР-015258
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеНовыйДоговор%", "(ТрудовыеДоговора.ОкончаниеДоговора <> ДатаВремя(1,1,1) И ТрудовыеДоговора.ОкончаниеДоговора < &Период И ТрудовыеДоговораНовые.Сотрудник ЕСТЬ NULL)");		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеНовыйДоговор%", "ЛОЖЬ");		
	КонецЕсли;
	//Аверсон СВФР-015258
	
	Если Организация.ИНН = "806000046" Тогда
		Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);  
		Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата,2));
		Запрос.УстановитьПараметр("ОкончаниеПериода1",ТекущаяДата + (15*86400));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);
		
	иначе
		Запрос.УстановитьПараметр("НачалоПериода",?(Организация.ИНН = "700103211",НачалоДня(ТекущаяДата),ТекущаяДата - 86400)); //СВЭЙ 27.05.2024 КВВ СВФР-012926
		Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
		Запрос.УстановитьПараметр("ОкончаниеПериода1",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);     		
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаДоговоров) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаДоговоров);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			Если Выборка.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
				НоваяЗадача.ТекстСписка				= "Истекает срок контракта " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.ТекстДерева				= "Истекает срок контракта " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			Иначе
				НоваяЗадача.ТекстСписка				= "Истекает срок трудового договора " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.ТекстДерева				= "Истекает срок трудового договора " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			КонецЕсли;
			
			//Аверсон ЕАЕ 08.04.2025 СВФР-015258
			//Климовичи
			Если Организация.ИНН = "700103211" Тогда
				Если Выборка.ОкончаниеДоговора < ТекущаяДата Тогда
					НоваяЗадача.ТекстСписка = СтрЗаменить(НоваяЗадача.ТекстСписка, "Истекает", "Истек");
					НоваяЗадача.ТекстДерева = СтрЗаменить(НоваяЗадача.ТекстДерева, "Истекает", "Истек");
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-015258
			
			НоваяЗадача.Действие1				= "Открыть напоминание";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаДоговоров);
			НоваяЗадача.ДополнительныеДанные	= Ложь;
			//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
			НоваяЗадача.Период  				= Выборка.ОкончаниеДоговора;
			НоваяЗадача.Ссылка              	= Выборка.Сотрудник;
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуИстечениеСрокаДоговоров";
			НоваяЗадача.ТекстСписка				= "Показать все истечения сроков договоров...";
			НоваяЗадача.ТекстДерева				= "Показать все истечения сроков договоров...";
			НоваяЗадача.Действие1				= "Показать все истечения сроков договоров";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаДоговоров);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
//Аверсон ЕАЕ 03.06.2025 СВФР-015891
	//истечение срока договоров подряда
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорНаВыполнениеРаботСФизЛицом.Организация,
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаПУ КАК Период,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Ссылка КАК Регистратор,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Сотрудник,
	|	ДоговорНаВыполнениеРаботСФизЛицом.НомерДляПу КАК НомерДоговора,
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания КАК ОкончаниеДоговора
	|ИЗ
	|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|ГДЕ
	|	(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &НачалоПериода
	|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания <= &ОкончаниеПериода)
	|   И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОкончаниеДоговора";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата)); 
	Запрос.УстановитьПараметр("ОкончаниеПериода",ТекущаяДата + 86400 * 10);
	Запрос.УстановитьПараметр("Период",ТекущаяДата);     		
	Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= "Истекает срок договора подряда " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			НоваяЗадача.ТекстДерева				= "Истекает срок договора подряда " + Формат(Выборка.ОкончаниеДоговора, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			НоваяЗадача.Действие1				= "Открыть напоминание";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора);
			НоваяЗадача.ДополнительныеДанные	= Ложь;
			НоваяЗадача.Период  				= Выборка.ОкончаниеДоговора;
			НоваяЗадача.Ссылка              	= Выборка.Сотрудник;
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуЗавершениеДоговора";
			НоваяЗадача.ТекстСписка				= "Показать все завершения договоров...";
			НоваяЗадача.ТекстДерева				= "Показать все завершения договоров...";
			НоваяЗадача.Действие1				= "Показать все истечения завершения договоров";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-015891
	
	//О.Т. 04.08.2014 № 151
	//истечение срока декретных отпусков
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков);
	
	//Запрос = Новый Запрос;
	
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	СостояниеРаботниковОрганизаций.Сотрудник,
	 |	СостояниеРаботниковОрганизаций.Организация,
	 |	СостояниеРаботниковОрганизаций.ПериодЗавершения
	 |ИЗ
	 |	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	 |ГДЕ
	 |	СостояниеРаботниковОрганизаций.ПериодЗавершения >= &НачалоПериода
	 |	И СостояниеРаботниковОрганизаций.ПериодЗавершения <= &ОкончаниеПериода
	 |	И СостояниеРаботниковОрганизаций.Организация = &Организация
	 |	И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	 |	 УПОРЯДОЧИТЬ ПО
	 |	ПериодЗавершения";
	//|	Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
	Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
	Запрос.УстановитьПараметр("Период",ТекущаяДата);
	Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= "Истекает срок декретного отпуска " + Формат(Выборка.ПериодЗавершения, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			НоваяЗадача.ТекстДерева				= "Истекает срок декретного отпуска " + Формат(Выборка.ПериодЗавершения, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
			НоваяЗадача.Действие1				= "Открыть напоминание";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков);
			НоваяЗадача.ДополнительныеДанные	= Ложь;
			//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
			НоваяЗадача.Период  				= Выборка.ПериодЗавершения;
			НоваяЗадача.Ссылка              	= Выборка.Сотрудник.ФизЛицо;
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуОкончаниеДекретныхОтпусков";
			НоваяЗадача.ТекстСписка				= "Показать все истечения сроков декретного отпуска...";
			НоваяЗадача.ТекстДерева				= "Показать все истечения сроков декретного отпуска...";
			НоваяЗадача.Действие1				= "Показать все истечения сроков декретного отпуска";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
    //О.Т. 04.08.2014 № 151
	
	
	//истечение срока декретных отпусков
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ЗапланированныеОтпуска);
	
	//Запрос = Новый Запрос;
	
	//Если Организация.ИНН = "806000046" Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГрафикОтпусковОрганизаций.Сотрудник,
		|	ГрафикОтпусковОрганизаций.Организация,
		|	ГрафикОтпусковОрганизаций.Период как Период
		|ИЗ
		|	РегистрСведений.ГрафикОтпусковОрганизаций КАК ГрафикОтпусковОрганизаций
		|ГДЕ
		|	ГрафикОтпусковОрганизаций.Организация = &Организация
		|	И ГрафикОтпусковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.ТипыПериодическихЗадачРаботника.ОтпускЕжегодный)
		|	И ГрафикОтпусковОрганизаций.Период >= &НачалоПериода
		|	И ГрафикОтпусковОрганизаций.Период <= &ОкончаниеПериода";
		//|	Сотрудник";
		
		Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата);
		Запрос.УстановитьПараметр("ОкончаниеПериода",ТекущаяДата+(20*86400));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);
		Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ЗапланированныеОтпуска) Тогда
			КоличествоЗадач = 1;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ЗапланированныеОтпуска);
				НоваяЗадача.БольшеНеНапоминать		= Истина;
				НоваяЗадача.ТекстСписка				= "Запланирован отпуск с " + Формат(Выборка.Период, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.ТекстДерева				= "Запланирован отпуск с " + Формат(Выборка.Период, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.Действие1				= "Открыть напоминание";
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ЗапланированныеОтпуска);
				НоваяЗадача.ДополнительныеДанные	= Ложь;
				//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
				НоваяЗадача.Период  				= Выборка.Период;
				НоваяЗадача.Ссылка              	= Выборка.Сотрудник.ФизЛицо;
				
				КоличествоЗадач = КоличествоЗадач + 1;
				Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуОкончаниеОтпусков";
				НоваяЗадача.ТекстСписка				= "Показать все запланированные отпуска...";
				НоваяЗадача.ТекстДерева				= "Показать все запланированные отпуска...";
				НоваяЗадача.Действие1				= "Показать все запланированные отпуска";
				НоваяЗадача.Гиперссылка				= Истина;
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ЗапланированныеОтпуска);
				НоваяЗадача.Период					= ТекущаяДата;
			КонецЕсли;
		КонецЕсли;
		//О.Т. 04.08.2014 № 151
	//онецЕсли;	
	

	
	//О.Т. Аверсон 19.09.2018 № 2457
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если Организация.ИНН = "100092167" Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандировкиРаботниковОрганизаций.Сотрудник,
		|	КомандировкиРаботниковОрганизаций.Организация,
		|	КомандировкиРаботниковОрганизаций.ПериодЗавершения,
		|	КомандировкиРаботниковОрганизаций.Регистратор.Номер КАК НомерДок
		|ИЗ
		|	РегистрСведений.КомандировкиРаботниковОрганизаций КАК КомандировкиРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КомандировкиРаботниковОрганизаций КАК КомандировкиРаботниковОрганизаций1
		|		ПО КомандировкиРаботниковОрганизаций.Регистратор = КомандировкиРаботниковОрганизаций1.ДокументПриОтзыве
		|			И КомандировкиРаботниковОрганизаций.Сотрудник = КомандировкиРаботниковОрганизаций1.Сотрудник
		|			И КомандировкиРаботниковОрганизаций.Организация = КомандировкиРаботниковОрганизаций1.Организация
		|			И КомандировкиРаботниковОрганизаций.МестоНазначения = КомандировкиРаботниковОрганизаций1.МестоНазначения
		|ГДЕ
		|	КомандировкиРаботниковОрганизаций.ПериодЗавершения >= &НачалоПериода
		|	И КомандировкиРаботниковОрганизаций.ПериодЗавершения <= &ОкончаниеПериода
		|	И ЕСТЬNULL(КомандировкиРаботниковОрганизаций1.ДокументПриОтзыве, 0) = 0";

		
		Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
		Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);
		Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков) Тогда
			КоличествоЗадач = 1;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаКомандировок);
				НоваяЗадача.БольшеНеНапоминать		= Истина;
				НоваяЗадача.ТекстСписка				= "Истекает срок командировки № " + Выборка.НомерДок + " "+ Формат(Выборка.ПериодЗавершения, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.ТекстДерева				= "Истекает срок командировки № " + Выборка.НомерДок + " "+ Формат(Выборка.ПериодЗавершения, "ДФ='дд.ММ.гггг'") + " " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.Действие1				= "Открыть напоминание";
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаКомандировок);
				НоваяЗадача.ДополнительныеДанные	= Ложь;
				//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
				НоваяЗадача.Период  				= Выборка.ПериодЗавершения;
				НоваяЗадача.Ссылка              	= Выборка.Сотрудник.ФизЛицо;
				
				КоличествоЗадач = КоличествоЗадач + 1;
				Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуИстечениеСрокаКомандировок";
				НоваяЗадача.ТекстСписка				= "Показать все истечения сроков командировок...";
				НоваяЗадача.ТекстДерева				= "Показать все истечения сроков командировок...";
				НоваяЗадача.Действие1				= "Показать все истечения сроков командировок";
				НоваяЗадача.Гиперссылка				= Истина;
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ИстечениеСрокаКомандировок);
				НоваяЗадача.Период					= ТекущаяДата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//О.Т. Аверсон 19.09.2018 № 2457
	
	//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) (
	Если Организация.ИНН = "806000046" Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ 
		|Прием.ДатаПриема,
		|ДОБАВИТЬКДАТЕ(Прием.ДатаПриема,ДЕНЬ,4) КАК ПериодЗавершения,
		|Прием.Сотрудник,
		|Прием.Ссылка
		|ИЗ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Прием
		|ГДЕ Прием.Ссылка.Проведен = ИСТИНА
		|И Прием.Ссылка.Организация = &Организация
		|И Прием.ДатаПриема МЕЖДУ &ДатаНачала И &ДатаОкончания
		|УПОРЯДОЧИТЬ ПО
		|Прием.ДатаПриема";
		
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ТекущаяДата - 4*86400));
		Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ТекущаяДата + 4*86400));
		Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ОкончаниеДекретныхОтпусков) Тогда
			КоличествоЗадач = 1;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ПУ2Прием);
				НоваяЗадача.БольшеНеНапоминать		= Истина;
				НоваяЗадача.ТекстСписка				= "Необходимо подать Сведения о движении работников ПУ-2 до " + Формат(КонецДня(Выборка.ДатаПриема) + 4*86400, "ДФ='дд.ММ.гггг'") + " по сотруднику " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.ТекстДерева				= "Необходимо подать Сведения о движении работников ПУ-2 до " + Формат(КонецДня(Выборка.ДатаПриема) + 4*86400, "ДФ='дд.ММ.гггг'") + " по сотруднику " + Выборка.Сотрудник.Наименование;
				НоваяЗадача.Действие1				= "Открыть напоминание";
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПУ2Прием);
				НоваяЗадача.ДополнительныеДанные	= Ложь;
				//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
				НоваяЗадача.Период  				= Выборка.ПериодЗавершения;
				НоваяЗадача.Ссылка              	= Выборка.Сотрудник.ФизЛицо;
				
				КоличествоЗадач = КоличествоЗадач + 1;
				Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуПУ2Прием";
				НоваяЗадача.ТекстСписка				= "Показать все приемы...";
				НоваяЗадача.ТекстДерева				= "Показать все приемы...";
				НоваяЗадача.Действие1				= "Показать все приемы";
				НоваяЗадача.Гиперссылка				= Истина;
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПУ2Прием);
				НоваяЗадача.Период					= ТекущаяДата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) )

	
	//О.Т. 04.08.2014 № 158
	//истечение срока паспорта
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта);
	
	//Запрос = Новый Запрос;
	
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
	 |	ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия
	 |ИЗ
	 |	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ОкончаниеПериода, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	 |ГДЕ
	 
	 //Аверсон ЕАЕ 16.05.2025 СВФР-015710
	 //|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия >= &НачалоПериода
	 //|	И ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия <= &ОкончаниеПериода
	 |%УсловиеСрокДействия%
	 //Аверсон СВФР-015710
	 
	 |	И НЕ ПаспортныеДанныеФизЛицСрезПоследних.НеНапоминатьОСобытии";
	//|	Сотрудник";
	
	//Аверсон ЕАЕ 16.05.2025 СВФР-015710
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСрокДействия%", "ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия <= &ОкончаниеПериода И ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия <> ДатаВремя(1,1,1)");	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСрокДействия%", "ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия >= &НачалоПериода И ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия <= &ОкончаниеПериода");
	КонецЕсли;
	//Аверсон СВФР-015710
	
	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
	Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
	
	//Аверсон ЕАЕ 18.08.2025 СВФР-016410
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		СписокФЛ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
		СписокАктуальныхФЛ = ПолучитьСписокАктуальныхФЛ(СписокФЛ);
	КонецЕсли;
	//Аверсон СВФР-016410
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//О.Т. Аверсон 22.02.2019 № 3190
			ЗапросУвольнение = Новый Запрос;
			ЗапросУвольнение.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|	И РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = &Физлицо";
			
			ЗапросУвольнение.УстановитьПараметр("Период", Выборка.ДатаСрокДействия);
			ЗапросУвольнение.УстановитьПараметр("Физлицо", Выборка.ФизЛицо);
			
			РезультУвольнение = ЗапросУвольнение.Выполнить().Выбрать();
			ДатаУвольнения = Дата(1,1,1);
			Пока РезультУвольнение.Следующий() Цикл
				ДатаУвольнения = РезультУвольнение.Период;
			КонецЦикла;
			//О.Т. Аверсон 22.02.2019 № 3190
			
			//Аверсон ЕАЕ 18.08.2025 СВФР-016410
			//Климовичи
			АктуальностьФЛ = Истина;
			Если Организация.ИНН = "700103211" Тогда
				АктуальностьФЛ = (СписокАктуальныхФЛ.Найти(Выборка.ФизЛицо) <> Неопределено);
			КонецЕсли;
			//Аверсон СВФР-016410
			
			Если не(ДатаУвольнения <> Дата(1,1,1)  и ДатаУвольнения < Выборка.ДатаСрокДействия)  И АктуальностьФЛ Тогда //Аверсон ЕАЕ 18.08.2025 СВФР-016410 (АктуальностьФЛ)
				
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта);
				НоваяЗадача.БольшеНеНапоминать		= Истина;
				НоваяЗадача.ТекстСписка				= "Истекает срок действия паспорта " + Формат(Выборка.ДатаСрокДействия, "ДФ='дд.ММ.гггг'") + " " + Выборка.ФизЛицо.Наименование;
				НоваяЗадача.ТекстДерева				= "Истекает срок действия паспорта " + Формат(Выборка.ДатаСрокДействия, "ДФ='дд.ММ.гггг'") + " " + Выборка.ФизЛицо.Наименование;
				
				//Аверсон ЕАЕ 16.05.2025 СВФР-015710
				//Климовичи
				Если Организация.ИНН = "700103211" Тогда
					Если Выборка.ДатаСрокДействия < ТекущаяДата() Тогда
						НоваяЗадача.ТекстСписка = СтрЗаменить(НоваяЗадача.ТекстСписка, "Истекает", "Истек");
						НоваяЗадача.ТекстДерева = СтрЗаменить(НоваяЗадача.ТекстДерева, "Истекает", "Истек");
					КонецЕсли;
				КонецЕсли;
				//Аверсон СВФР-015710
				
				НоваяЗадача.Действие1				= "Открыть напоминание";
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта);
				НоваяЗадача.ДополнительныеДанные	= Ложь;
				//НоваяЗадача.Наименование        	= СокрЛП(Выборка.Сотрудник.Наименование);
				НоваяЗадача.Период  				= Выборка.ДатаСрокДействия;
				НоваяЗадача.Ссылка              	= Выборка.ФизЛицо;
				
				КоличествоЗадач = КоличествоЗадач + 1;
				Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуСрокДействияПаспорта";
			НоваяЗадача.ТекстСписка				= "Показать все истечения сроков действия паспорта...";
			НоваяЗадача.ТекстДерева				= "Показать все истечения сроков действия паспорта...";
			НоваяЗадача.Действие1				= "Показать все истечения сроков действия паспорта";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
    //О.Т. 04.08.2014 № 158
	Организации = Новый Соответствие;
	
	// Начисления зарплаты
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.РасчетЗарплаты);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(&АктуальныйПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(НачислениеЗарплатыРаботникамОрганизаций.Ссылка) КАК Ссылка,
	|			НачислениеЗарплатыРаботникамОрганизаций.Организация КАК Организация
	|		ИЗ
	|			Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
	|		ГДЕ
	|			НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации = &АктуальныйПериодРегистрации";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|			И НачислениеЗарплатыРаботникамОрганизаций.Организация В (&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|			И (НЕ НачислениеЗарплатыРаботникамОрганизаций.ПометкаУдаления)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			НачислениеЗарплатыРаботникамОрганизаций.Организация) КАК НачислениеЗарплатыРаботникамОрганизаций
	|		ПО Организации.Ссылка = НачислениеЗарплатыРаботникамОрганизаций.Организация
	|ГДЕ
	|	(НЕ 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Документ.НачислениеЗарплатыРаботникамОрганизаций КАК Док
	|				ГДЕ
	|					Док.Организация = Организации.Ссылка
	|					И Док.Проведен
	|					И Док.ПериодРегистрации = &АктуальныйПериодРегистрации))";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|	И Организации.Ссылка В(&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	НаименованиеОрганизации";
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.РасчетЗарплаты)) И
			ПравоДоступа("Проведение", Метаданные.Документы.НачислениеЗарплатыРаботникамОрганизаций) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Организации[Выборка.Организация] = 0;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.РасчетЗарплаты);
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Начислить зарплату за " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "За " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.Действие1				= "Начислить зарплату";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.РасчетЗарплаты);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуРасчетЗарплаты";
			НоваяЗадача.ТекстСписка				= "Показать все начисления зарплаты...";
			НоваяЗадача.ТекстДерева				= "Показать все начисления зарплаты...";
			НоваяЗадача.Действие1				= "Показать все начисления зарплаты";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.РасчетЗарплаты);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Начисления ЕСН
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.РасчетЕСН);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(&АктуальныйПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	РасчетЕСН.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РасчетЕСН.Ссылка) КАК Ссылка,
	|			РасчетЕСН.Организация КАК Организация
	|		ИЗ
	|			Документ.РасчетЕСН КАК РасчетЕСН
	|		ГДЕ
	|			(НЕ РасчетЕСН.Организация В (&Организации))
	|			И РасчетЕСН.ПериодРегистрации = &АктуальныйПериодРегистрации";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|			И РасчетЕСН.Организация В(&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|			И (НЕ РасчетЕСН.ПометкаУдаления)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РасчетЕСН.Организация) КАК РасчетЕСН
	|		ПО Организации.Ссылка = РасчетЕСН.Организация
	|ГДЕ
	|	(НЕ Организации.Ссылка В (&Организации))
	|	И (НЕ 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Документ.РасчетЕСН КАК Док
	|				ГДЕ
	|					Док.Организация = Организации.Ссылка
	|					И Док.Проведен
	|					И Док.ПериодРегистрации = &АктуальныйПериодРегистрации))";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|	И Организации.Ссылка В(&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	НаименованиеОрганизации";
	
	ОрганизацииМассив = Новый Массив;
	Для Каждого Элемент Из Организации Цикл
		ОрганизацииМассив.Добавить(Элемент.Ключ);
	КонецЦикла;
	Запрос.УстановитьПараметр("Организации",	ОрганизацииМассив);
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.РасчетЕСН)) И
			ПравоДоступа("Проведение", Метаданные.Документы.РасчетЕСН) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Организации[Выборка.Организация] = 0;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.РасчетЕСН);
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Рассчитать отчисления с ФОТ и ЗП за " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "За " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.Действие1				= "Рассчитать отчисления с ФОТ и ЗП";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.РасчетЕСН);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуРасчетЕСН";
			НоваяЗадача.ТекстСписка				= "Показать все расчеты отчислений с ФОТ и ЗП...";
			НоваяЗадача.ТекстДерева				= "Показать все расчеты отчислений с ФОТ и ЗП...";
			НоваяЗадача.Действие1				= "Показать все расчеты отчислений с ФОТ и ЗП";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.РасчетЕСН);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Отражение зарплаты в учете
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ОтражениеЗарплатыВУчете);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(&АктуальныйПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК НаименованиеОрганизации,
	|	ОтражениеЗарплатыВРеглУчете.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ОтражениеЗарплатыВРеглУчете.Ссылка) КАК Ссылка,
	|			ОтражениеЗарплатыВРеглУчете.Организация КАК Организация
	|		ИЗ
	|			Документ.ОтражениеЗарплатыВРеглУчете КАК ОтражениеЗарплатыВРеглУчете
	|		ГДЕ
	|			(НЕ ОтражениеЗарплатыВРеглУчете.Организация В (&Организации))
	|			И ОтражениеЗарплатыВРеглУчете.ПериодРегистрации = &АктуальныйПериодРегистрации";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|			И ОтражениеЗарплатыВРеглУчете.Организация В (&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|			И (НЕ ОтражениеЗарплатыВРеглУчете.ПометкаУдаления)
	|			
	|		СГРУППИРОВАТЬ ПО
	|			ОтражениеЗарплатыВРеглУчете.Организация) КАК ОтражениеЗарплатыВРеглУчете
	|		ПО Организации.Ссылка = ОтражениеЗарплатыВРеглУчете.Организация
	|ГДЕ
	|	(НЕ Организации.Ссылка В (&Организации))
	|	И (НЕ 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Документ.ОтражениеЗарплатыВРеглУчете КАК Док
	|				ГДЕ
	|					Док.Организация = Организации.Ссылка
	|					И Док.Проведен
	|					И Док.ПериодРегистрации = &АктуальныйПериодРегистрации))";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|	И Организации.Ссылка В (&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	НаименованиеОрганизации";
	
	ОрганизацииМассив = Новый Массив;
	Для Каждого Элемент Из Организации Цикл
		ОрганизацииМассив.Добавить(Элемент.Ключ);
	КонецЦикла;
	Запрос.УстановитьПараметр("Организации",	ОрганизацииМассив);
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ОтражениеЗарплатыВУчете)) И
			ПравоДоступа("Проведение", Метаданные.Документы.ОтражениеЗарплатыВРеглУчете) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Организации[Выборка.Организация] = 0;
			
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ОтражениеЗарплатыВУчете);
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Отразить зарплату в регл. учете за " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "За " + Формат(Выборка.Период, "ДФ='ММММ'");
			НоваяЗадача.Действие1				= "Отразить зарплату в регл. учете";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОтражениеЗарплатыВУчете);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуОтражениеЗарплатыВУчете";
			НоваяЗадача.ТекстСписка				= "Показать все отражения зарплаты...";
			НоваяЗадача.ТекстДерева				= "Показать все отражения зарплаты...";
			НоваяЗадача.Действие1				= "Показать все отражения зарплаты";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОтражениеЗарплатыВУчете);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// перерасчеты
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Перерасчет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Наименование КАК Наименование,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Организация.Наименование КАК НаименованиеОрганизации
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|		ЗаписиРегистровРасчета.Ссылка КАК Ссылка,
	|		ЗаписиРегистровРасчета.Ссылка.Представление КАК Наименование,
	|		ЗаписиРегистровРасчета.Ссылка.ПериодРегистрации КАК Период,
	|		ЗаписиРегистровРасчета.Ссылка.Организация КАК Организация
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПерерасчетОсновныхНачислений.ОбъектПерерасчета КАК Ссылка,
	|			ПерерасчетОсновныхНачислений.Организация КАК Организация
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК ПерерасчетОсновныхНачислений";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		ГДЕ
	|			ПерерасчетОсновныхНачислений.Организация В(&СписокГоловныхОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|		ОБЪЕДИНИТЬ
	|	
	|		ВЫБРАТЬ
	|			ПерерасчетДополнительныхНачислений.ОбъектПерерасчета,
	|			ПерерасчетДополнительныхНачислений.Организация
	|		ИЗ
	|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК ПерерасчетДополнительныхНачислений";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		ГДЕ
	|			ПерерасчетДополнительныхНачислений.Организация В(&СписокГоловныхОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|		ОБЪЕДИНИТЬ
	|	
	|		ВЫБРАТЬ
	|			ПерерасчетСреднегоЗаработка.ОбъектПерерасчета,
	|			ПерерасчетСреднегоЗаработка.Организация
	|		ИЗ
	|			РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработка";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		ГДЕ
	|			ПерерасчетСреднегоЗаработка.Организация В(&СписокГоловныхОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		) КАК ЗаписиРегистровРасчета
	|	ГДЕ
	|		ЗаписиРегистровРасчета.Ссылка.ПериодРегистрации ЕСТЬ НЕ NULL"; 
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|			И ЗаписиРегистровРасчета.Ссылка.Организация В(&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|		ЗаполнениеПлановыхНачислений.ОбъектЗаполнения,
	|		ЗаполнениеПлановыхНачислений.ОбъектЗаполнения.Представление,
	|		ЗаполнениеПлановыхНачислений.ПериодРегистрации,
	|		ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение
	|	ИЗ
	|		РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|	ГДЕ
	|		ЗаполнениеПлановыхНачислений.ПериодРегистрации < &АктуальныйПериодРегистрации";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|		И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение В(&СписокОрганизаций)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР";
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Перерасчет)) И
			ПравоДоступа("Изменение", Метаданные.РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций) И
			ПравоДоступа("Изменение", Метаданные.РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций) И
			ПравоДоступа("Изменение", Метаданные.РегистрыРасчета.РасчетСреднегоЗаработка) Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		КоличествоЗадач = 1;
		Пока Выборка.Следующий() Цикл
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Перерасчет);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Перерассчитать " + СокрЛП(Выборка.Наименование);
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "" + СокрЛП(Выборка.Наименование);
			НоваяЗадача.Действие3				= "Открыть";
			НоваяЗадача.Действие4				= "Обработать все перерасчеты организации " + СокрЛП(Выборка.НаименованиеОрганизации);
			Если НачалоМесяца(АктуальныйПериодРегистрации) <= Выборка.Период Тогда
				Месяц = Формат(Выборка.Период, "ДФ=MMMM");
				ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Месяц, 5, Месяц);
				НоваяЗадача.Действие1 = "Перерассчитать документ " + Месяц + Формат(Выборка.Период, "ДФ=' yyyy ""г.""'");
			Иначе
				МесяцПрошлый	= Формат(Выборка.Период, "ДФ=MMMM");
				ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцПрошлый, 5, МесяцПрошлый);
				НоваяЗадача.Действие1 = "Перерассчитать документ прошлым периодом (" + МесяцПрошлый + Формат(Выборка.Период, "ДФ=' yyyy ""г.""'") + ")";
				Если ТипЗнч(Выборка.Ссылка) <> Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
					МесяцТекущий = Формат(АктуальныйПериодРегистрации, "ДФ=MMMM");
					ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцТекущий, 5, МесяцТекущий);
					НоваяЗадача.Действие2 = "Перерассчитать документ текущим периодом (" + МесяцТекущий + Формат(АктуальныйПериодРегистрации, "ДФ=' yyyy ""г.""'") + ")";
				КонецЕсли;
			КонецЕсли;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Перерасчет);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуПерерасчет";
			НоваяЗадача.ТекстСписка				= "Показать все перерасчеты...";
			НоваяЗадача.ТекстДерева				= "Показать все перерасчеты...";
			НоваяЗадача.Действие1				= "Показать все перерасчеты";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Перерасчет);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// доначисления
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Доначисление);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	Доначисления.Сотрудник КАК Ссылка,
	|	Доначисления.Сотрудник.Организация.Наименование КАК НаименованиеОрганизации,
	|	Доначисления.Сотрудник.Организация КАК Организация,
	|	Доначисления.Сотрудник.Наименование КАК Наименование,
	|	Доначисления.ПериодДействия КАК Период,
	|	Доначисления.ДатаНачала КАК ДатаНачала,
	|	Доначисления.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ДоначисленияСотрудникам КАК Доначисления";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|ГДЕ
	|	Доначисления.Сотрудник.Организация В(&СписокГоловныхОрганизаций)";
	КонецЕсли;

	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Доначисление)) И
			ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДоначисленияСотрудникам) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			ФИОСотрудника = СокрЛП(Выборка.Наименование);
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 2, ФИОСотрудника);
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ДатаНачала",		Выборка.ДатаНачала);
			ДополнительныеДанные.Вставить("ДатаОкончания",	Выборка.ДатаОкончания);
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Доначисление);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + СокрЛП(Выборка.Наименование) + ". Доначислить зарплату за " + ОбщегоНазначения.ОписаниеПериода(Выборка.ДатаНачала, Выборка.ДатаОкончания, Ложь);
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + СокрЛП(Выборка.Наименование) + ". Зарплату за " + ОбщегоНазначения.ОписаниеПериода(Выборка.ДатаНачала, Выборка.ДатаОкончания, Ложь);
			НоваяЗадача.Действие1				= "Доначислить зарплату";
			НоваяЗадача.Действие2				= "Открыть форму " + ФИОСотрудника;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Доначисление);
			НоваяЗадача.ДополнительныеДанные	= ЗначениеВСтрокуВнутр(ДополнительныеДанные);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуДоначисление";
			НоваяЗадача.ТекстСписка				= "Показать все доначисления...";
			НоваяЗадача.ТекстДерева				= "Показать все доначисления...";
			НоваяЗадача.Действие1				= "Показать все доначисления";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Доначисление);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Перезаполнения
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Перезаполнение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(ЗаполнениеПлановыхНачислений.ОбъектЗаполнения) КАК Наименование,
	|	ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение.Наименование КАК НаименованиеОрганизации,
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации КАК Период
	|ИЗ
	|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|
	|ГДЕ
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации >= &АктуальныйПериодРегистрации";
	Если Не (СписокОрганизаций = Неопределено) Тогда
	Запрос.Текст = Запрос.Текст + "
	|	И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение В(&СписокОрганизаций)";
	КонецЕсли;
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Перезаполнение)) И
			ПравоДоступа("Изменение", Метаданные.Документы.НачислениеЗарплатыРаботникамОрганизаций) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.НаименованиеОрганизации) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.НаименованиеОрганизации) + ". ";
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Перезаполнение);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Перезаполнить " +СокрЛП(Выборка.Наименование);
			НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "" +СокрЛП(Выборка.Наименование);
			НоваяЗадача.Действие2				= "Открыть документ";
			НоваяЗадача.Действие1				= "Перезаполнить документ";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Перезаполнение);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуПерезаполнение";
			НоваяЗадача.ТекстСписка				= "Показать все перезаполнения...";
			НоваяЗадача.ТекстДерева				= "Показать все перезаполнения...";
			НоваяЗадача.Действие1				= "Показать все перезаполнения";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Перезаполнение);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Намеченные события по персоналу
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу);
	
	КоличествоЗадач = 1;
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу)) И
			ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СостояниеРаботниковОрганизаций) Тогда
			
		ДатаНачала				= Бюджетирование.ДобавитьИнтервал(ТекущаяДата,Перечисления.Периодичность.Неделя, -1);
		ДатаОкончания			= Бюджетирование.ДобавитьИнтервал(ТекущаяДата,Перечисления.Периодичность.Месяц, 1);
		КоличествоЗадачВГруппе	= ?(НеОграничиватьСписокЗадач = Истина, 0, мКоличествоЗадачВГруппе);
			
		Результат = Обработки.ПоказНамеченныхСобытийПоПерсоналу.Создать().СформироватьЗапрос(СписокОрганизаций, ДатаНачала, ДатаОкончания, КоличествоЗадачВГруппе);
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаименованиеОрганизации = "";
			Если Организация.Пустая() И Не ПустаяСтрока(Выборка.ОрганизацияНаименование) Тогда
				НаименованиеОрганизации = СокрЛП(Выборка.ОрганизацияНаименование) + ". ";
			КонецЕсли;
			ФИОСотрудника = СокрЛП(Выборка.СотрудникНаименование);	
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 4, ФИОСотрудника);
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ПланируемоеСобытие",	Выборка.ПланируемоеСобытие);
			ДополнительныеДанные.Вставить("Подразделение",		Выборка.Подразделение);
			ДополнительныеДанные.Вставить("Должность",			Выборка.Должность);
			ДополнительныеДанные.Вставить("ЗанимаемыхСтавок",	Выборка.ЗанимаемыхСтавок);
			ДополнительныеДанные.Вставить("ГрафикРаботы",		Выборка.ГрафикРаботы);
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу);
			НоваяЗадача.Период					= Выборка.ДатаИзменения;
			НоваяЗадача.ДополнительныеДанные	= ЗначениеВСтрокуВнутр(ДополнительныеДанные);
			НоваяЗадача.Организация				= Выборка.Организация;
			НоваяЗадача.НаименованиеОрганизации	= Выборка.ОрганизацияНаименование;
			НоваяЗадача.Ссылка					= Выборка.Сотрудник;
			НоваяЗадача.БольшеНеНапоминать      = Истина;

			Если Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Заболевание Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Выздоровление " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Выздоровление " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Командировка Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из командировки " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из командировки " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтгулВСчетЕжегодногоОтпуска Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из отгула " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из отгула " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из отпуска за свой счет (по сем.-быт. причинам) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из отпуска за свой счет (по сем.-быт. причинам) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускБезСохраненияЗарплатыУчебныеСборы Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из отпуска за свой счет (служба) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из отпуска за свой счет (служба) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодный Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из ежегодного отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из ежегодного отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускЕжегодныйЧасть Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из ежегодного отпуска (часть) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из ежегодного отпуска (часть) " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускПоУходуЗаРебенком Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из отпуска по уходу за ребенком " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из отпуска по уходу за ребенком " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускПрочий Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из прочего отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из прочего отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускУчебный Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из учебного отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из учебного отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтпускУчебныйНеоплачиваемый Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат из учебного неоплачиваемого отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат из учебного неоплачиваемого отпуска " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ОтсутствуетПоНевыясненнойПричине Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Возврат после прогула " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Возврат после прогула " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Переместить " + ФИОСотрудника + " в подразделение " + Выборка.Подразделение + " на должность " + Выборка.Должность;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Переместить " + ФИОСотрудника + " в подразделение " + Выборка.Подразделение + " на должность " + Выборка.Должность;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Истекает испытательный срок " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Истекает испытательный срок " + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Уволить "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Уволить "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Оканчивается испытательный срок "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Оканчивается испытательный срок "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ИстекаетСрокКонтракта Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Истекает срок контракта "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Истекает срок контракта "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			ИначеЕсли Выборка.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.ИстекаетСрокТрудовогоДоговора Тогда
				НоваяЗадача.ТекстСписка				= НаименованиеОрганизации + "Истекает срок трудового договора "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
				НоваяЗадача.ТекстДерева				= НаименованиеОрганизации + "Истекает срок трудового договора "  + Формат(Выборка.ДатаИзменения, "ДФ=dd.MM.yyyy") + " " + ФИОСотрудника;
			КонецЕсли;
			
			Если Выборка.УправленческийУчет Тогда
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу);
				НоваяЗадача.Действие1				= "Зарегистрировать " + Выборка.ПланируемоеСобытие;
				НоваяЗадача.Действие2				= "Обработать все предстоящие кадровые события по компании";
				
			Иначе
				НоваяЗадача.ГруппаЗадач				= "НамеченныеСобытияПоПерсоналуОрганизаций";
				НоваяЗадача.Действие1				= "Зарегистрировать " + Выборка.ПланируемоеСобытие;
				НоваяЗадача.Действие2				= "Обработать все предстоящие кадровые события по организации " + СокрЛП(Выборка.ОрганизацияНаименование);
				
			КонецЕсли;
		
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//ЗадачиПользователя.Сортировать("ГруппаЗадач,ТекстСписка,ТекстДерева");
	Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
		НоваяЗадача = ЗадачиПользователя.Добавить();
		НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуНамеченныеСобытияПоПерсоналу";
		НоваяЗадача.ТекстСписка				= "Показать все предстоящие кадровые события...";
		НоваяЗадача.ТекстДерева				= "Показать все предстоящие кадровые события...";
		НоваяЗадача.Действие1				= "Показать все предстоящие кадровые события";
		НоваяЗадача.Гиперссылка				= Истина;
		НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу);
		НоваяЗадача.Период					= ТекущаяДата;
 	КонецЕсли;
	
	// Напоминания
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.Напоминания);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ВЫБОР
	|		КОГДА Событие.ВремяНапоминания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА &текущаяДата
	|		ИНАЧЕ Событие.ВремяНапоминания
	|	КОНЕЦ КАК Период,
	|	Событие.Ссылка КАК Ссылка,
	|	Событие.ОписаниеСобытия,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА Событие.ВремяНапоминания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА &текущаяДата
	|					ИНАЧЕ Событие.ВремяНапоминания
	|				КОНЕЦ, &текущаяДата, ДЕНЬ) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДополнительныеДанные,
	|	Событие.ЗаявкаКандидата.Наименование КАК ЗаявкаКандидата
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ВидОбъекта = ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовСобытия.ЗаявкаКандидата)
	|	И (НЕ Событие.ЗаявкаКандидата = ЗНАЧЕНИЕ(Справочник.ЗаявкиКандидатов.ПустаяСсылка))
	|	И Событие.НапомнитьОСобытии
	|	И Событие.Проведен
	|	И Событие.СостояниеСобытия = ЗНАЧЕНИЕ(Перечисление.СостоянияСобытий.Запланировано)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Если	(ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.Напоминания) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.Напоминания);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= Выборка.ЗаявкаКандидата + " - " + Формат(Выборка.Период, "ДФ='дд.ММ.гггг ЧЧ:мм'") + " " + Выборка.ОписаниеСобытия;
			НоваяЗадача.ТекстДерева				= Выборка.ЗаявкаКандидата + " - " + Формат(Выборка.Период, "ДФ='дд.ММ.гггг ЧЧ:мм'") + " " + Выборка.ОписаниеСобытия;
			НоваяЗадача.Действие1				= "Открыть напоминание";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Напоминания);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуНапоминания";
			НоваяЗадача.ТекстСписка				= "Показать все напоминания...";
			НоваяЗадача.ТекстДерева				= "Показать все напоминания...";
			НоваяЗадача.Действие1				= "Показать все напоминания";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.Напоминания);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Ошибки кадровых перемещений
	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыЗанятостиПомещенийОшибки.Помещение КАК Ссылка,
	|	ПериодыЗанятостиПомещенийОшибки.Помещение.Наименование КАК Наименование,
	|	NULL КАК Организация,
	|	NULL КАК НаименованиеОрганизации,
	|	""ПериодыЗанятостиПомещенийОшибки"" КАК ДополнительныеДанные,
	|	&текущаяДата КАК Период
	|ИЗ
	|	РегистрСведений.ПериодыЗанятостиПомещенийОшибки КАК ПериодыЗанятостиПомещенийОшибки
	|ГДЕ
	|	(НЕ ПериодыЗанятостиПомещенийОшибки.Помещение.Наименование ЕСТЬ NULL )";
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки) Тогда
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки.Физлицо КАК Ссылка,
	|	ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки.Физлицо.Наименование КАК Наименование,
	|	NULL КАК Организация,
	|	NULL КАК НаименованиеОрганизации,
	|	""ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки"" КАК ДополнительныеДанные,
	|	&текущаяДата КАК Период
	|ИЗ
	|	РегистрСведений.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки КАК ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки
	|ГДЕ
	|	(НЕ ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки.Физлицо.Наименование ЕСТЬ NULL )";
	КонецЕсли;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки) Тогда
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Физлицо,
	|	ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Физлицо.Наименование,
	|	ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Организация,
	|	ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Организация.Наименование,
	|	""ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки"",
	|	&текущаяДата
	|ИЗ
	|	РегистрСведений.ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки КАК ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки
	|ГДЕ
	|	(НЕ ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Физлицо.Наименование ЕСТЬ NULL )";
		Если Не (СписокОрганизаций = Неопределено) Тогда
			Запрос.Текст = Запрос.Текст + "
	|	И ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.Организация В(&СписокОрганизаций)";
		КонецЕсли;
	КонецЕсли;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодыРаботыРаботниковОшибки) Тогда
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыРаботыРаботниковОшибки.Физлицо,
	|	ПериодыРаботыРаботниковОшибки.Физлицо.Наименование,
	|	NULL,
	|	NULL,
	|	""ПериодыРаботыРаботниковОшибки"",
	|	&текущаяДата
	|ИЗ
	|	РегистрСведений.ПериодыРаботыРаботниковОшибки КАК ПериодыРаботыРаботниковОшибки
	|ГДЕ
	|	(НЕ ПериодыРаботыРаботниковОшибки.Физлицо.Наименование ЕСТЬ NULL )";
	КонецЕсли;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодыСостоянийРаботниковОрганизацийОшибки) Тогда
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыСостоянийРаботниковОрганизацийОшибки.Сотрудник,
	|	ПериодыСостоянийРаботниковОрганизацийОшибки.Сотрудник.Наименование,
	|	NULL,
	|	NULL,
	|	""ПериодыСостоянийРаботниковОрганизацийОшибки"",
	|	&текущаяДата
	|ИЗ
	|	РегистрСведений.ПериодыСостоянийРаботниковОрганизацийОшибки КАК ПериодыСостоянийРаботниковОрганизацийОшибки";
		Если Не (СписокОрганизаций = Неопределено) Тогда
			Запрос.Текст = Запрос.Текст + "
	|ГДЕ
	|	ПериодыСостоянийРаботниковОрганизацийОшибки.Сотрудник.Организация В(&СписокГоловныхОрганизаций)";
		КонецЕсли;
	КонецЕсли;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодыСостоянийРаботниковОшибки) Тогда
	Запрос.Текст = Запрос.Текст + "
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
	|	ПериодыСостоянийРаботниковОшибки.Физлицо,
	|	ПериодыСостоянийРаботниковОшибки.Физлицо.Наименование,
	|	NULL,
	|	NULL,
	|	""ПериодыСостоянийРаботниковОшибки"",
	|	&текущаяДата
	|ИЗ
	|	РегистрСведений.ПериодыСостоянийРаботниковОшибки КАК ПериодыСостоянийРаботниковОшибки
	|ГДЕ
	|	(НЕ ПериодыСостоянийРаботниковОшибки.Физлицо.Наименование ЕСТЬ NULL )";
	КонецЕсли;
	
	Если	(ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений) Тогда
		КоличествоЗадач = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ФИОСотрудника = СокрЛП(Выборка.Наименование);
			ФИОСотрудника = СтрЗаменить(ФИОСотрудника,"Ё","Е");//О.Т. Аверсон 23.06.2016
			
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСотрудника, 2, ФИОСотрудника);
			
			Если Выборка.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки" Тогда
				Текст = "Ошибки в документах приема на основное место работы";
				
			ИначеЕсли Выборка.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки" Тогда
				Текст = "Ошибки в документах приема по внешнему совместительству";
				
			ИначеЕсли Выборка.ДополнительныеДанные = "ПериодыРаботыРаботниковОшибки" Тогда
				Текст = "Ошибки в документах приема без договора";
				
			ИначеЕсли Выборка.ДополнительныеДанные = "ПериодыСостоянийРаботниковОрганизацийОшибки" Тогда
				Текст = "Ошибки в документах-отклонениях";
				
			ИначеЕсли Выборка.ДополнительныеДанные = "ПериодыСостоянийРаботниковОшибки" Тогда
				Текст = "Ошибки в документах-отклонениях";
				
			ИначеЕсли Выборка.ДополнительныеДанные = "ПериодыЗанятостиПомещенийОшибки" Тогда
				Текст = "Ошибки в документах резервирования помещений";
				
			Иначе
				Текст = "";
				
			КонецЕсли;
			
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений);
			НоваяЗадача.БольшеНеНапоминать		= Истина;
			НоваяЗадача.ТекстСписка				= Текст + " у " + ФИОСотрудника;
			НоваяЗадача.ТекстДерева				= Текст + " у " + ФИОСотрудника;
			НоваяЗадача.Действие1				= "Открыть список конфликтующих документов";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений);
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка);
			
			КоличествоЗадач = КоличествоЗадач + 1;
			Если (НеОграничиватьСписокЗадач <> Истина) И (КоличествоЗадач > мКоличествоЗадачВГруппе-1) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если (НеОграничиватьСписокЗадач <> Истина) И (Выборка.Количество() > мКоличествоЗадачВГруппе-1) Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= "ПоказатьГруппуОшибкиКадровыхПеремещений";
			НоваяЗадача.ТекстСписка				= "Показать все ошибки кадровых перемещений...";
			НоваяЗадача.ТекстДерева				= "Показать все ошибки кадровых перемещений...";
			НоваяЗадача.Действие1				= "Показать все ошибки кадровых перемещений";
			НоваяЗадача.Гиперссылка				= Истина;
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений);
			НоваяЗадача.Период					= ТекущаяДата;
		КонецЕсли;
	КонецЕсли;
	
	// Производственный календарь
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегламентированныйПроизводственныйКалендарь.Год КАК Период
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.Год = ГОД(&АктуальныйПериодРегистрации)";
	
	Если	((ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ПроизводственныйКалендарь)) 
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РегламентированныйПроизводственныйКалендарь) Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			НоваяЗадача = ЗадачиПользователя.Добавить();
			НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ПроизводственныйКалендарь);
			НоваяЗадача.ТекстСписка				= "Заполнить производственный календарь за " + Формат(Год(АктуальныйПериодРегистрации),"ЧЦ=4; ЧГ=0") + " год";
			НоваяЗадача.ТекстДерева				= "Заполнить за " + Формат(Год(АктуальныйПериодРегистрации),"ЧЦ=4; ЧГ=0") + " год";
			НоваяЗадача.Действие1				= "Заполнить";
			НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПроизводственныйКалендарь);
			НоваяЗадача.Период					= НачалоГода(АктуальныйПериодРегистрации);
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон 30.10.2019 КВВ СВФР-004971 (
	Если (ГруппаЗадач = Неопределено) ИЛИ (ГруппаЗадач = Перечисления.ГруппыЗадачПользователя.ПроверкаВыплатыОтпускных) Тогда
		//НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.ПроверкаВыплатыОтпускных);
		Сообщить(НеОграничиватьСписокЗадач);
		ЗапросОтп = Новый Запрос;  ПП = 1;
		ЗапросОтп.Текст = 
		"ВЫБРАТЬ 
		|СостояниеРО.Сотрудник,
		|СостояниеРО.Период
		|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРО
		|ГДЕ (СостояниеРО.Состояние = &С1 ИЛИ СостояниеРО.Состояние = &С2)
		|И СостояниеРО.Период МЕЖДУ НачалоПериода(&НачПериода, День) И КонецПериода(&КонПериода, День)";
		ЗапросОтп.УстановитьПараметр("С1",Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
		ЗапросОтп.УстановитьПараметр("С2",Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть);
		ЗапросОтп.УстановитьПараметр("НачПериода",НачалоДня(ДобавитьМесяц(ТекущаяДата,-1)));
		ЗапросОтп.УстановитьПараметр("КонПериода",КонецДня(ДобавитьМесяц(ТекущаяДата,1)));
		ВыборкаОтп = ЗапросОтп.Выполнить().Выбрать();
		Пока ВыборкаОтп.Следующий() Цикл
			ЕстьВыплата = Ложь;
			ЗапросВыпл = Новый Запрос;
			ЗапросВыпл.Текст = 
			"ВЫБРАТЬ
			|Ссылка,
			|ДокЗПТЧ.ФизЛицо,
			|ДокЗПТЧ.ТабНомер
			|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ДокЗПТЧ
			|ГДЕ Ссылка.ПометкаУдаления = ЛОЖЬ И
			|Ссылка.ХарактерВыплаты = &Х И
			|ДокЗПТЧ.ФизЛицо = &ТН И
			|Ссылка.Дата МЕЖДУ &НачДата И &КонДата";
			ЗапросВыпл.УстановитьПараметр("Х",Перечисления.ХарактерВыплатыЗарплаты.Отпускные);
			ЗапросВыпл.УстановитьПараметр("НачДата",НачалоДня(ВыборкаОтп.Период - 21*86400));
			ЗапросВыпл.УстановитьПараметр("КонДата",КонецДня(ВыборкаОтп.Период));
			ЗапросВыпл.УстановитьПараметр("ТН",ВыборкаОтп.Сотрудник.ФизЛицо);
			ВыборкаВыпл = ЗапросВыпл.Выполнить().Выбрать();
			Пока ВыборкаВыпл.Следующий() Цикл
				ЕстьВыплата = Истина;
			КонецЦикла;
			Если НЕ ЕстьВыплата Тогда
				НоваяЗадача = ЗадачиПользователя.Добавить();
				НоваяЗадача.ГруппаЗадач				= ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(Перечисления.ГруппыЗадачПользователя.ПроверкаВыплатыОтпускных);
				НоваяЗадача.ТекстСписка				= "Нет выплаты отпускных " + Строка(ПП) + " " + СокрЛП(ВыборкаОтп.Сотрудник.Наименование) + " за отпуск от " + Формат(ВыборкаОтп.Период, "ДФ=dd.MM.yyyy");
				НоваяЗадача.ТекстДерева				= "Нет выплаты отпускных " + Строка(ПП) + " " + СокрЛП(ВыборкаОтп.Сотрудник.Наименование) + " за отпуск от " + Формат(ВыборкаОтп.Период, "ДФ=dd.MM.yyyy");
				НоваяЗадача.ПриоритетГруппыЗадач	= Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПроверкаВыплатыОтпускных); //9
				НоваяЗадача.Период					= ВыборкаОтп.Период;  ПП = ПП + 1;
				НоваяЗадача.ДополнительныеДанные	= Ложь;
				ТД = НачалоДня(ТекущаяДата);
				Д0 = НачалоДня(ВыборкаОтп.Период);
				Если Д0 = ТД ИЛИ (Д0 - 86400) = ТД ИЛИ (Д0 - 86400*2) = ТД ИЛИ (Д0 - 86400*3) = ТД Тогда
					НоваяЗадача.ДополнительныеДанные	= Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;                                     
	КонецЕсли;
	//Аверсон 30.10.2019 КВВ СВФР-004971 )
	
КонецПроцедуры // Автозаполнение()

//Аверсон ЕАЕ 23.01.2025 СВФР-014363
Функция ЭтоПенсионер(ФЛ)
	Пенс = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Пенсионеры.ФизЛицо
		|ИЗ
		|	РегистрСведений.Пенсионеры КАК Пенсионеры
		|ГДЕ
		|	Пенсионеры.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Пенс = Истина;
	КонецЕсли;
	
	Возврат Пенс;
КонецФункции
//Аверсон СВФР-014363

Функция ПерезаполнениеДействие1(ДанныеСтроки) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОбъектЗаполнения", ДанныеСтроки.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаполнениеПлановыхНачислений.Сотрудник Как Сотрудник,
	|	ЗаполнениеПлановыхНачислений.Сотрудник.Физлицо Как Физлицо
	|ИЗ
	|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|ГДЕ
	|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения = &ОбъектЗаполнения";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(ТаблицаЗапроса.ВыгрузитьКолонку("Сотрудник"));
	
	СписокФизЛиц = Новый СписокЗначений;
	СписокФизЛиц.ЗагрузитьЗначения(ТаблицаЗапроса.ВыгрузитьКолонку("Физлицо"));
	
	Объект = ДанныеСтроки.Ссылка.ПолучитьОбъект();
	Объект.ВыполнитьПерезаполнениеПоВыбраннымСотрудникам(СписокСотрудников, СписокФизЛиц);
	
	Форма = Объект.ПолучитьФорму();
	Форма.Открыть();
	
	Возврат Перечисления.ГруппыЗадачПользователя.Перезаполнение;
	
КонецФункции // ПерезаполнениеДействие1()

Функция ПерезаполнениеДействие2(ДанныеСтроки) Экспорт
	
	Форма = ДанныеСтроки.Ссылка.ПолучитьФорму();
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПерезаполнениеДействие1()

Функция ПерезаполнениеБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗаполнениеПлановыхНачислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектЗаполнения.Установить(ДанныеСтроки.Ссылка);
	НаборЗаписей.Записать();
	
	Возврат Перечисления.ГруппыЗадачПользователя.Перезаполнение;
	
КонецФункции


Функция ДоначислениеДействие1(ДанныеСтроки) Экспорт
	
	ДополнительныеДанные = ЗначениеИзСтрокиВнутр(ДанныеСтроки.ДополнительныеДанные);
	
	Если ТипЗнч(ДополнительныеДанные) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаНачала		= ДополнительныеДанные.ДатаНачала;
	ДатаОкончания	= ДополнительныеДанные.ДатаОкончания;
	
	Сотрудник = ДанныеСтроки.Ссылка;
	СписокСотрудников = Новый Массив;
	СписокСотрудников.Добавить(Сотрудник);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала",		ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доначисления.Сотрудник КАК Ссылка,
	|	Доначисления.ПериодДействия КАК Период,
	|	Доначисления.ДатаНачала КАК ДатаНачала,
	|	Доначисления.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ДоначисленияСотрудникам КАК Доначисления
	|ГДЕ
	|	Доначисления.Сотрудник = &Сотрудник
	|	И Доначисления.ДатаНачала = &ДатаНачала
	|	И Доначисления.ДатаОкончания = &ДатаОкончания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументДоначисление = Документы.НачислениеЗарплатыРаботникамОрганизаций.СоздатьДокумент();
	ДокументДоначисление.Организация					= Сотрудник.Организация;
	
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ДокументДоначисление, глЗначениеПеременной("глТекущийПользователь"));
	
	ДокументДоначисление.ПериодНачисления				= Перечисления.ПериодНачисленияЗарплаты.ПрошлыйПериод;
	ДокументДоначисление.ПериодНачисленияДатаНачала		= Выборка.ДатаНачала;
	ДокументДоначисление.ПериодНачисленияДатаОкончания	= Выборка.ДатаОкончания;
	ДокументДоначисление.ВыполнитьАвтозаполнение(
	ДокументДоначисление.ПериодНачисленияДатаНачала, 
	ДокументДоначисление.ПериодНачисленияДатаОкончания,,,,
	СписокСотрудников);
	
	ФормаДокумента = ДокументДоначисление.ПолучитьФорму();
	ФормаДокумента.Открыть();

	Возврат Неопределено;
	
КонецФункции // ДоначислениеДействие1(Ссылка)

Функция ДоначислениеДействие2(ДанныеСтроки) Экспорт
	
	Форма = ДанныеСтроки.Ссылка.ПолучитьФорму();
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПерезаполнениеДействие1()

Функция ДоначислениеБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	ДополнительныеДанные = ЗначениеИзСтрокиВнутр(ДанныеСтроки.ДополнительныеДанные);
	
	Если ТипЗнч(ДополнительныеДанные) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДоначисленияСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(ДанныеСтроки.Ссылка);
	НаборЗаписей.Отбор.ДатаНачала.Установить(ДополнительныеДанные.ДатаНачала);
	НаборЗаписей.Отбор.ДатаОкончания.Установить(ДополнительныеДанные.ДатаОкончания);
	Если НаборЗаписей.Отбор.Сотрудник.Значение <> Неопределено Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	Возврат Перечисления.ГруппыЗадачПользователя.Доначисление;
	
КонецФункции // ДоначислениеБольшеНеНапоминать()


Функция ПерерасчетДействие1(ДанныеСтроки) Экспорт
	
	ДокументОбъект = ДанныеСтроки.Ссылка.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументПерерасчета",	ДанныеСтроки.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 4
	|	ПерерассчитываемыеДокументы.Ссылка КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 4
	|		РасчетЕСНОсновныеНачисления.Ссылка КАК Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.Организация КАК Организация
	|		ИЗ
	|			Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
	|		ГДЕ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка = &ДокументПерерасчета) КАК УсловияДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
	|			ПО УсловияДокумента.Сотрудник = РасчетЕСНОсновныеНачисления.Сотрудник
	|				И УсловияДокумента.ПериодРегистрации = РасчетЕСНОсновныеНачисления.Ссылка.ПериодРегистрации
	|				И УсловияДокумента.Организация = РасчетЕСНОсновныеНачисления.Ссылка.Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 4
	|		ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.Организация КАК Организация
	|		ИЗ
	|			Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
	|		ГДЕ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка = &ДокументПерерасчета) КАК УсловияДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|			ПО УсловияДокумента.Организация = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация
	|				И УсловияДокумента.ФизЛицо = ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
	|				И УсловияДокумента.ПериодРегистрации = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ПериодРегистрации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 4
	|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка.Организация КАК Организация
	|		ИЗ
	|			Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
	|		ГДЕ
	|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка = &ДокументПерерасчета) КАК УсловияДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОтражениеЗарплатыВРеглУчетеОсновныеНачисления
	|			ПО УсловияДокумента.Сотрудник = ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник
	|				И УсловияДокумента.ПериодРегистрации = ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации
	|				И УсловияДокумента.Организация = ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Организация
	|	ГДЕ
	|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка <> NULL) КАК ПерерассчитываемыеДокументы
	|ГДЕ
	|	ПерерассчитываемыеДокументы.Ссылка ЕСТЬ НЕ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДокументыТекст = "";
	НомерЗначенияЗапроса = 1;
	Пока Выборка.Следующий() Цикл
		Если НомерЗначенияЗапроса < 4 Тогда
			ДокументыТекст = ДокументыТекст + Символы.ПС + Строка(Выборка.Документ);
			НомерЗначенияЗапроса = НомерЗначенияЗапроса + 1;
		ИначеЕсли НомерЗначенияЗапроса = 4 Тогда
			ДокументыТекст = ДокументыТекст + " и другие..."
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
		Если НачалоМесяца(ДанныеСтроки.Период) = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату()) Тогда
			ТекстСообщения = "Вы уверены в том, что хотите перерассчитать документ " + Строка(ДокументОбъект) + "?";
		Иначе
			ТекстСообщения = "Вы уверены в том, что хотите перерассчитать документ " + Строка(ДокументОбъект) + " прошлым периодом?";
		КонецЕсли;
		ТекстСообщения = ТекстСообщения +
		?(ПустаяСтрока(ДокументыТекст),"", символы.ПС + "Выполнение этой операции приведет к необходимости пересмотреть документы:" + ДокументыТекст);
		Ответ = Вопрос(ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Предупреждение");
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка
				ТекстСообщения = ПолучитьСообщениеОПерерасчетеСотрудников(ДанныеСтроки.Ссылка);
				ДокументОбъект.Перерассчитать();
				Если ТекстСообщения <> "" Тогда
					Предупреждение(ТекстСообщения,,"Перерасчет документа");
				КонецЕсли;
				Возврат Перечисления.ГруппыЗадачПользователя.Перерасчет;
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не может быть перерассчитан!
				|" + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	
	#Иначе
		Попытка
			ДокументОбъект.Перерассчитать();
			Возврат Перечисления.ГруппыЗадачПользователя.Перерасчет;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Документ " + Строка(ДокументОбъект) + " не может быть перерассчитан!
			|" + ОписаниеОшибки());
		КонецПопытки;
		
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции

// Процедура выполняет ввод нового документа в текущем периоде на основании документа перерасчета
//
Функция ПерерасчетДействие2(ДанныеСтроки) Экспорт
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	Если День(ТекущаяДата) < 20 Тогда
		ПериодРегистрации = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
	Иначе
		ПериодРегистрации = НачалоМесяца(ТекущаяДата);
	КонецЕсли;
	
	ФормаДокумента = Документы[Метаданные.НайтиПоТипу(ТипЗнч(ДанныеСтроки.Ссылка)).Имя].ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
	ФормаДокумента.Организация	= ДанныеСтроки.Организация;
	
	ОбщегоНазначения.ЗаполнитьШапкуДокумента(ФормаДокумента, глЗначениеПеременной("глТекущийПользователь"));
	
	ФормаДокумента.ПериодРегистрации				= ПериодРегистрации;
	ФормаДокумента.ПерерассчитываемыйДокумент		= ДанныеСтроки.Ссылка;
	Если ТипЗнч(ДанныеСтроки.Ссылка) = Тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций") Тогда
		ФормаДокумента.ПериодНачисления = Перечисления.ПериодНачисленияЗарплаты.ПрошлыйПериод;
		ФормаДокумента.ПериодНачисленияДатаНачала = ДанныеСтроки.Ссылка.ПериодНачисленияДатаНачала;
		ФормаДокумента.ПериодНачисленияДатаОкончания = ДанныеСтроки.Ссылка.ПериодНачисленияДатаОкончания;
	КонецЕсли;
	ФормаДокумента.ЗаполнитьПоПерерассчитываемомуДокументу();
	ТекстСообщения = ПолучитьСообщениеОПерерасчетеСотрудников(ДанныеСтроки.Ссылка);
	
	ФормаДокумента.Открыть();
	
	#Если Клиент Тогда
	Если Не ПустаяСтрока(ТекстСообщения)  Тогда
		Предупреждение(ТекстСообщения,,"Перерасчет документа");
	КонецЕсли;
	#КонецЕсли
	
	Возврат Неопределено;
	
КонецФункции // ПерерасчетДействие2()

Функция ПерерасчетДействие3(ДанныеСтроки) Экспорт
	
	Форма = ДанныеСтроки.Ссылка.ПолучитьФорму();
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПерезаполнениеДействие1()

Функция ПерерасчетДействие4(ДанныеСтроки) Экспорт
	
	Форма = Обработки.ПерерасчетЗарплатыОрганизаций.ПолучитьФорму();
	
	Форма.Организация	= ДанныеСтроки.Организация;
	
	Форма.ЗаполнитьДанныеПоОрганизации();
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПерерасчетЗарплатыОрганизацийДействие1()

Функция ПерерасчетБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	ТипРегистратора = ТипЗнч(ДанныеСтроки.Ссылка);
	
	// Удаление записи из таблицы перерасчета расчета основных начислений
	НаборПерерасчета = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетОсновныхНачислений.СоздатьНаборЗаписей();
	Если НаборПерерасчета.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
		НаборПерерасчета.Отбор.ОбъектПерерасчета.Установить(ДанныеСтроки.Ссылка);
		НаборПерерасчета.Записать(Истина);
	КонецЕсли;
	
	// Удалиение записи из таблицы перерасчета расчета дополнительный начислений
	НаборПерерасчета = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетДополнительныхНачислений.СоздатьНаборЗаписей();
	Если НаборПерерасчета.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
		НаборПерерасчета.Отбор.ОбъектПерерасчета.Установить(ДанныеСтроки.Ссылка);
		НаборПерерасчета.Записать(Истина);
	КонецЕсли;
	
	// Удаление записи из таблицы перерасчета расчета среднего заработка
	НаборПерерасчета = РегистрыРасчета.РасчетСреднегоЗаработка.Перерасчеты.ПерерасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	Если НаборПерерасчета.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
		НаборПерерасчета.Отбор.ОбъектПерерасчета.Установить(ДанныеСтроки.Ссылка);
		НаборПерерасчета.Записать(Истина);
	КонецЕсли;
	
	НаборПерерасчета = РегистрыСведений.ЗаполнениеПлановыхНачислений.СоздатьНаборЗаписей();
	Если НаборПерерасчета.Отбор.ОбъектЗаполнения.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
		НаборПерерасчета.Отбор.ОбъектЗаполнения.Установить(ДанныеСтроки.Ссылка);
		НаборПерерасчета.Записать(Истина);
	КонецЕсли;
	
	Возврат Перечисления.ГруппыЗадачПользователя.Перерасчет;
	
КонецФункции


Функция РасчетЗарплатыДействие1(ДанныеСтроки) Экспорт
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	Если День(ТекущаяДата) < 20 Тогда
		ПериодРегистрации	= ДобавитьМесяц(НачалоМесяца(ТекущаяДата), -1);
	Иначе
		ПериодРегистрации	= НачалоМесяца(ТекущаяДата);
	КонецЕсли;
	
	Если ДанныеСтроки.Ссылка = Неопределено Тогда
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("АктуальныйПериодРегистрации",	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация",					ДанныеСтроки.Организация);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(НачислениеЗарплатыРаботникамОрганизаций.Ссылка) КАК Ссылка,
		|	НачислениеЗарплатыРаботникамОрганизаций.Организация КАК Организация
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
		|ГДЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации = &АктуальныйПериодРегистрации
		|	И НачислениеЗарплатыРаботникамОрганизаций.Организация = &Организация
		|	И (НЕ НачислениеЗарплатыРаботникамОрганизаций.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыРаботникамОрганизаций.Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ФормаДокумента = Выборка.Ссылка.ПолучитьФорму();
			
		Иначе
			ФормаДокумента = Документы.НачислениеЗарплатыРаботникамОрганизаций.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
			ФормаДокумента.Организация	= ДанныеСтроки.Организация;
			ФормаДокумента.Дата			= КонецМесяца(ПериодРегистрации) + 3600*12;
			
			ОбщегоНазначения.ЗаполнитьШапкуДокумента(ФормаДокумента, глЗначениеПеременной("глТекущийПользователь"));
			
			ФормаДокумента.ПериодРегистрации				= ПериодРегистрации;
			ФормаДокумента.ВидОперации						= Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.ПолныйРасчет;
			ФормаДокумента.ПериодНачисления					= Перечисления.ПериодНачисленияЗарплаты.ТекущийМесяц;
			ФормаДокумента.ПериодНачисленияДатаНачала		= НачалоМесяца(ФормаДокумента.ПериодРегистрации);
			ФормаДокумента.ПериодНачисленияДатаОкончания	= КонецМесяца(ФормаДокумента.ПериодРегистрации);
			
		КонецЕсли;
		
	Иначе
		ФормаДокумента = ДанныеСтроки.Ссылка.ПолучитьФорму();
		
	КонецЕсли;
	
	ФормаДокумента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции


Функция ДеньРожденияДействие1(ДанныеСтроки) Экспорт
	
	ФормаЭлемента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаЭлемента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция ДеньРожденияБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	мЗакрытыеДниРождения.Добавить(Новый Структура("Физлицо,ДеньРождения", ДанныеСтроки.Ссылка, ДанныеСтроки.Период));
	
	Возврат Перечисления.ГруппыЗадачПользователя.ДеньРождения;
	
КонецФункции

Функция ПенсионерыДействие1(ДанныеСтроки) Экспорт
	
	ФормаЭлемента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаЭлемента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция ИстечениеСрокаДоговоровДействие1(ДанныеСтроки) Экспорт
	
	ФормаЭлемента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаЭлемента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция СрокДействияПаспортаДействие1(ДанныеСтроки) Экспорт //О.Т. Аверсон 22.02.2019 № 3190
	
	ФормаЭлемента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаЭлемента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция ПенсионерыБольшеНеНапоминать(ДанныеСтроки) Экспорт
	//Аверсон ЕАЕ 23.01.2025 СВФР-014363
	//мЗакрытыеДниРождения.Добавить(Новый Структура("Физлицо,ДеньРождения", ДанныеСтроки.Ссылка, ДанныеСтроки.Период));
	Если Организация.ИНН = "806000046" Тогда
		мЗакрытыеДниРождения.Добавить(Новый Структура("Физлицо,ДеньРождения", ДанныеСтроки.Ссылка, ДанныеСтроки.Период));
	Иначе
		мЗакрытыеПенсионеры.Добавить(Новый Структура("Физлицо,ДеньРождения", ДанныеСтроки.Ссылка, ДанныеСтроки.Период));
	КонецЕсли;
	//Аверсон СВФР-014363
	
	Возврат Перечисления.ГруппыЗадачПользователя.Пенсионеры;
	
КонецФункции

Функция РасчетЕСНДействие1(ДанныеСтроки) Экспорт
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	Если День(ТекущаяДата) < 20 Тогда
		ПериодРегистрации = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
	Иначе
		ПериодРегистрации = НачалоМесяца(ТекущаяДата);
	КонецЕсли;
	
	Если ДанныеСтроки.Ссылка = Неопределено Тогда
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("АктуальныйПериодРегистрации",	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация",					ДанныеСтроки.Организация);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(РасчетЕСН.Ссылка) КАК Ссылка,
		|	РасчетЕСН.Организация КАК Организация
		|ИЗ
		|	Документ.РасчетЕСН КАК РасчетЕСН
		|ГДЕ
		|	РасчетЕСН.ПериодРегистрации = &АктуальныйПериодРегистрации
		|	И РасчетЕСН.Организация = &Организация
		|	И (НЕ РасчетЕСН.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетЕСН.Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ФормаДокумента = Выборка.Ссылка.ПолучитьФорму();
			
		Иначе
			ФормаДокумента = Документы.РасчетЕСН.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
			ФормаДокумента.Организация	= ДанныеСтроки.Организация;
			ФормаДокумента.Дата			= КонецМесяца(ПериодРегистрации) + 3600*12;
			
			ОбщегоНазначения.ЗаполнитьШапкуДокумента(ФормаДокумента, глЗначениеПеременной("глТекущийПользователь"));
			
			ФормаДокумента.ПериодРегистрации	= ПериодРегистрации;
			
		КонецЕсли;
		
	Иначе
		ФормаДокумента = ДанныеСтроки.Ссылка.ПолучитьФорму();
		
	КонецЕсли;
	
	ФормаДокумента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции


Функция ОтражениеЗарплатыВУчетеДействие1(ДанныеСтроки) Экспорт
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	Если День(ТекущаяДата) < 20 Тогда
		ПериодРегистрации = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -1));
	Иначе
		ПериодРегистрации = НачалоМесяца(ТекущаяДата);
	КонецЕсли;
	
	Если ДанныеСтроки.Ссылка = Неопределено Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("АктуальныйПериодРегистрации",	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация",					ДанныеСтроки.Организация);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ОтражениеЗарплатыВРеглУчете.Ссылка) КАК Ссылка,
		|	ОтражениеЗарплатыВРеглУчете.Организация КАК Организация
		|ИЗ
		|	Документ.ОтражениеЗарплатыВРеглУчете КАК ОтражениеЗарплатыВРеглУчете
		|ГДЕ
		|	ОтражениеЗарплатыВРеглУчете.ПериодРегистрации = &АктуальныйПериодРегистрации
		|	И ОтражениеЗарплатыВРеглУчете.Организация = &Организация
		|	И (НЕ ОтражениеЗарплатыВРеглУчете.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтражениеЗарплатыВРеглУчете.Организация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ФормаДокумента = Выборка.Ссылка.ПолучитьФорму();
			
		Иначе
			ФормаДокумента = Документы.ОтражениеЗарплатыВРеглУчете.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
			ФормаДокумента.Организация	= ДанныеСтроки.Организация;
			ФормаДокумента.Дата			= КонецМесяца(ПериодРегистрации) + 3600*12;
			
			ОбщегоНазначения.ЗаполнитьШапкуДокумента(ФормаДокумента, глЗначениеПеременной("глТекущийПользователь"));
			
			ФормаДокумента.ПериодРегистрации	= ПериодРегистрации;
			
		КонецЕсли;
		
	Иначе
		ФормаДокумента = ДанныеСтроки.Ссылка.ПолучитьФорму();
		
	КонецЕсли;
	
	ФормаДокумента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции


Функция НамеченныеСобытияПоПерсоналуОрганизацийДействие1(ДанныеСтроки) Экспорт
	
	ДополнительныеДанные = ЗначениеИзСтрокиВнутр(ДанныеСтроки.ДополнительныеДанные);
	
	Если ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение 
	 ИЛИ ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока Тогда
		ФормаДокумента = Документы.УвольнениеИзОрганизаций.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		ФормаДокумента.Организация	= ДанныеСтроки.Организация;
		
		НоваяСтрока = ФормаДокумента.РаботникиОрганизации.Добавить();
		НоваяСтрока.Сотрудник		= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаУвольнения	= ДанныеСтроки.Период;
		НоваяСтрока.СтатьяТКРФ		= Справочники.ОснованияУвольненияИзОрганизации.НайтиПоНаименованию("п. 2 ст. 77 ТК");
		
		ФормаДокумента.Открыть();
		
	ИначеЕсли ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение Тогда
		ФормаДокумента = Документы.КадровоеПеремещениеОрганизаций.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		ФормаДокумента.Организация	= ДанныеСтроки.Организация;
		
		НоваяСтрока = ФормаДокумента.РаботникиОрганизации.Добавить();
		НоваяСтрока.Сотрудник					= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаНачала					= ДанныеСтроки.Период;
		НоваяСтрока.ПодразделениеОрганизации	= ДополнительныеДанные.Подразделение;
		НоваяСтрока.Должность					= ДополнительныеДанные.Должность;
		НоваяСтрока.ЗанимаемыхСтавок			= ДополнительныеДанные.ЗанимаемыхСтавок;
		НоваяСтрока.ГрафикРаботы				= ДополнительныеДанные.ГрафикРаботы;
		
		Сотрудники = ФормаДокумента.РаботникиОрганизации.ВыгрузитьКолонку("Сотрудник");
		ФормаДокумента.ДобавитьСтрокиНачисленийПоРаботнику(Сотрудники);
		
		ФормаДокумента.Открыть();
		
	ИначеЕсли ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока Тогда
		ФормаДокумента = Документы.РезультатИспытательногоСрока.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		ФормаДокумента.Сотрудник		= ДанныеСтроки.Ссылка;
		ФормаДокумента.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		ФормаДокумента.Результат		= Перечисления.РезультатыИспытательногоСрока.Положительный;
		ФормаДокумента.ДатаИзменения	= ДанныеСтроки.Период;
		
		ФормаДокумента.Открыть();
		
	Иначе
		ФормаДокумента = Документы.ВозвратНаРаботуОрганизаций.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		ФормаДокумента.Организация	= ДанныеСтроки.Организация;
		
		НоваяСтрока = ФормаДокумента.РаботникиОрганизации.Добавить();
		НоваяСтрока.Сотрудник		= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаВозврата	= ДанныеСтроки.Период;
		
		ФормаДокумента.Открыть();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // НамеченныеСобытияПоПерсоналуОрганизацийДействие1()

Функция НамеченныеСобытияПоПерсоналуОрганизацийДействие2(ДанныеСтроки) Экспорт
	
	Форма = Обработки.ПоказНамеченныхСобытийПоПерсоналу.ПолучитьФорму();
	
	Форма.Организация	= ДанныеСтроки.Организация;
	Форма.ДатаНачала	= Бюджетирование.ДобавитьИнтервал(ОбщегоНазначения.ПолучитьРабочуюДату(), Перечисления.Периодичность.Неделя, -1);
	Форма.ДатаОкончания	= Бюджетирование.ДобавитьИнтервал(ОбщегоНазначения.ПолучитьРабочуюДату(), Перечисления.Периодичность.Месяц, 1);
	
	Форма.Результаты.Очистить();
	Форма.Автозаполнение();
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПоказНамеченныхСобытийПоПерсоналуДействие1()


Функция НамеченныеСобытияПоПерсоналуДействие1(ДанныеСтроки) Экспорт
	
	ДополнительныеДанные = ЗначениеИзСтрокиВнутр(ДанныеСтроки.ДополнительныеДанные);
	
	Если ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение Тогда
		ФормаДокумента = Документы.КадровоеПеремещение.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		НоваяСтрока = ФормаДокумента.Работники.Добавить();
		НоваяСтрока.Сотрудник				= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо					= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаНачала				= ДанныеСтроки.Период;
		НоваяСтрока.НовоеПодразделение		= ДополнительныеДанные.Подразделение;
		НоваяСтрока.НоваяДолжность			= ДополнительныеДанные.Должность;
		НоваяСтрока.ЗанимаемыхСтавок		= ДополнительныеДанные.ЗанимаемыхСтавок;
		НоваяСтрока.ГрафикРаботы			= ДополнительныеДанные.ГрафикРаботы;
		
		ФормаДокумента.Открыть();
		
	ИначеЕсли ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока Тогда
		ФормаДокумента = Документы.РезультатИспытательногоСрока.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		ФормаДокумента.Сотрудник		= ДанныеСтроки.Ссылка;
		ФормаДокумента.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		ФормаДокумента.Результат		= Перечисления.РезультатыИспытательногоСрока.Положительный;
		ФормаДокумента.ДатаИзменения	= ДанныеСтроки.Период;
		
		ФормаДокумента.Открыть();
		
	ИначеЕсли ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение Тогда
		ФормаДокумента = Документы.Увольнение.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		НоваяСтрока = ФормаДокумента.Работники.Добавить();
		НоваяСтрока.Сотрудник			= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо				= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаУвольнения		= ДанныеСтроки.Период;
		НоваяСтрока.ПричинаУвольнения	= Справочники.ОснованияУвольнения.ПоСобственномуЖеланию;
		
		ФормаДокумента.Открыть();
		
	ИначеЕсли ДополнительныеДанные.ПланируемоеСобытие = Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока Тогда
		ФормаДокумента = Документы.Увольнение.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		НоваяСтрока = ФормаДокумента.Работники.Добавить();
		НоваяСтрока.Сотрудник			= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо				= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаУвольнения		= ДанныеСтроки.Период;
		НоваяСтрока.ПричинаУвольнения	= Справочники.ОснованияУвольнения.НеПрошелИспытательныйСрок;
		
		ФормаДокумента.Открыть();
		
	Иначе
		ФормаДокумента = Документы.ВозвратНаРаботу.ПолучитьФормуНовогоДокумента(, , ДанныеСтроки.Организация);
		
		НоваяСтрока = ФормаДокумента.Работники.Добавить();
		НоваяСтрока.Сотрудник		= ДанныеСтроки.Ссылка;
		НоваяСтрока.Физлицо			= ДанныеСтроки.Ссылка.Физлицо;
		НоваяСтрока.ДатаВозврата	= ДанныеСтроки.Период;
		
		ФормаДокумента.Открыть();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // НамеченныеСобытияПоПерсоналуДействие1()

Функция НамеченныеСобытияПоПерсоналуДействие2(ДанныеСтроки) Экспорт
	
	Форма = Обработки.ПоказНамеченныхСобытийПоПерсоналу.ПолучитьФорму();
	
	Форма.ДатаНачала	= Бюджетирование.ДобавитьИнтервал(ОбщегоНазначения.ПолучитьРабочуюДату(), Перечисления.Периодичность.Неделя, -1);
	Форма.ДатаОкончания	= Бюджетирование.ДобавитьИнтервал(ОбщегоНазначения.ПолучитьРабочуюДату(), Перечисления.Периодичность.Месяц, 1);
	
	Форма.Результаты.Загрузить(Форма.ВыбратьНамеченныеИзменения(Форма.ДатаНачала, Форма.ДатаОкончания));
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПоказНамеченныхСобытийПоПерсоналуДействие1()

Функция ПоказНамеченныхСобытийПоПерсоналуДействие1(ДанныеСтроки) Экспорт
	
	мСпособОтображенияЗадач.Вставить(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу, Истина);
	
	Возврат Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу;
	
КонецФункции // ПоказНамеченныхСобытийПоПерсоналуДействие1()


Функция НапоминанияДействие1(ДанныеСтроки) Экспорт
	
	ФормаДокумента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаДокумента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция НапоминанияБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	Док = ДанныеСтроки.Ссылка.ПолучитьОбъект();
	Док.НапомнитьОСобытии = Ложь;
	Док.Записать();
	
	Возврат Перечисления.ГруппыЗадачПользователя.Напоминания;
	
КонецФункции

Функция ИстечениеСрокаДоговоровБольшеНеНапоминать(ДанныеСтроки) Экспорт //О.Т. Аверсон 22.02.2019 № 3190
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТрудовыеДоговора.Регистратор
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник
	|ГДЕ
	|	ТрудовыеДоговора.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.ОкончаниеДоговора <= &ОкончаниеПериода
	|	И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	|	И НЕ ТрудовыеДоговора.Регистратор.НеНапоминатьОСобытии
	|	И РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	//|	Сотрудник";
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	Если Организация.ИНН = "806000046" Тогда
		Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
		Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата,2));
		Запрос.УстановитьПараметр("ОкончаниеПериода1",ТекущаяДата + (15*86400));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);
		
	иначе
		Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
		Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
		Запрос.УстановитьПараметр("ОкончаниеПериода1",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
		Запрос.УстановитьПараметр("Период",ТекущаяДата);     		
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	Запрос.УстановитьПараметр("Сотрудник",ДанныеСтроки.Ссылка);	
	
	Выборка = Запрос.Выполнить().Выбрать();

	пока Выборка.Следующий() Цикл 
		Док = Выборка.Регистратор.ПолучитьОбъект();
		Док.НеНапоминатьОСобытии = Истина;
		Док.Записать();
		
		
	КонецЦикла;
	
	
	Возврат Перечисления.ГруппыЗадачПользователя.ЗавершениеДоговора;
	
КонецФункции

Функция СрокДействияПаспортаБольшеНеНапоминать(ДанныеСтроки) Экспорт //О.Т. Аверсон 22.02.2019 № 3190
	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ОкончаниеПериода, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|ГДЕ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия >= &НачалоПериода
	|	И ПаспортныеДанныеФизЛицСрезПоследних.ДатаСрокДействия <= &ОкончаниеПериода
	|	И ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
	//|	Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
	Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
	Запрос.УстановитьПараметр("ФизЛицо",ДанныеСтроки.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	


	пока Выборка.Следующий() Цикл 
		
		ПаспортныеДанныеФизЛиц = РегистрыСведений.ПаспортныеДанныеФизЛиц.СоздатьНаборЗаписей();
		ПаспортныеДанныеФизЛиц.Отбор.Физлицо.Установить(ДанныеСтроки.Ссылка);
		ПаспортныеДанныеФизЛиц.Отбор.Период.Установить(Выборка.Период);
		ПаспортныеДанныеФизЛиц.Прочитать();
		Для каждого стр Из ПаспортныеДанныеФизЛиц Цикл
		  стр.НеНапоминатьОСобытии = Истина;	
		КонецЦикла; 
		ПаспортныеДанныеФизЛиц.Записать(Истина);

		
		
		
	КонецЦикла;
	
	
	Возврат Перечисления.ГруппыЗадачПользователя.СрокДействияПаспорта;
	
КонецФункции

Функция НамеченныеСобытияПоПерсоналуОрганизацийБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	СписокОрганизаций = Неопределено;
	СписокГоловныхОрганизаций = Неопределено;
	Если Не Организация.Пустая() Тогда
		СписокОрганизаций = Новый Массив;
		СписокГоловныхОрганизаций = Новый Массив;
		СписокОрганизаций.Добавить(Организация);
		СписокГоловныхОрганизаций.Добавить(ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка,
		|	ВЫБОР
		|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА Организации.Ссылка
		|		ИНАЧЕ Организации.ГоловнаяОрганизация
		|	КОНЕЦ КАК ГоловнаяОрганизация
		|ИЗ
		|	Справочник.Организации КАК Организации";
		СписокОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		СписокГоловныхОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГоловнаяОрганизация");
	КонецЕсли;

	
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();

	НеОграничиватьСписокЗадач = мСпособОтображенияЗадач.Получить(Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу);
	
	ДатаНачала				= Бюджетирование.ДобавитьИнтервал(ТекущаяДата,Перечисления.Периодичность.Неделя, -1);
	ДатаОкончания			= Бюджетирование.ДобавитьИнтервал(ТекущаяДата,Перечисления.Периодичность.Месяц, 1);
	КоличествоЗадачВГруппе	= ?(НеОграничиватьСписокЗадач = Истина, 0, мКоличествоЗадачВГруппе);
	
	Результат = Обработки.ПоказНамеченныхСобытийПоПерсоналу.Создать().СформироватьЗапрос(СписокОрганизаций, ДатаНачала, ДатаОкончания, КоличествоЗадачВГруппе,ДанныеСтроки.Ссылка);
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Док = Выборка.Регистратор.ПолучитьОбъект();
		
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.РезультатИспытательногоСрока") или ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда 
			Док.НеНапоминатьОСобытии = Истина;
		иначе
			МассивСтр = Док.РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник",ДанныеСтроки.Ссылка));
			Если МассивСтр.Количество() > 0 Тогда 
				МассивСтр[0].НеНапоминатьОСобытии = истина;
			КонецЕсли;
			
		КонецЕсли;
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;		
		
		
		
	КонецЦикла;
		
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//
	//
	//
	//ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	//Если Организация.ИНН = "806000046" Тогда
	//	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
	//	Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата,2));
	//	Запрос.УстановитьПараметр("ОкончаниеПериода1",ТекущаяДата + (15*86400));
	//	Запрос.УстановитьПараметр("Период",ТекущаяДата);
	//	
	//иначе
	//	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата - 86400);
	//	Запрос.УстановитьПараметр("ОкончаниеПериода",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
	//	Запрос.УстановитьПараметр("ОкончаниеПериода1",ДобавитьМесяц(ТекущаяДата, Организация.МесяцаПериод));
	//	Запрос.УстановитьПараметр("Период",ТекущаяДата);     		
	//КонецЕсли; 
	//Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	//Запрос.УстановитьПараметр("Сотрудник",ДанныеСтроки.Ссылка);	
	//
	//Выборка = Запрос.Выполнить().Выбрать();

	//пока Выборка.Следующий() Цикл 
	//	Док = Выборка.Регистратор.ПолучитьОбъект();
	//	Док.НеНапоминатьОСобытии = Истина;
	//	Док.Записать();
	//	
	//	
	//КонецЦикла;
	//
	//
	Возврат Перечисления.ГруппыЗадачПользователя.НамеченныеСобытияПоПерсоналу;
	
КонецФункции



Функция ОшибкиКадровыхПеремещенийДействие1(ДанныеСтроки) Экспорт
	
	Запрос = Новый Запрос;
	
	Форма = ПолучитьОбщуюФорму("ФормаОшибокКадровыхПеремещений", , ЭтотОбъект);
	Форма.Ошибки.Очистить();
	
	Если ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовРаботыСотрудникаПоОсновномуМестуРаботы(НеОпределено, Истина, МассивСотрудники, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовРаботыСотрудникаПоСовместительству(НеОпределено, Истина, МассивСотрудники, ДанныеСтроки.Организация, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовРаботыСотрудникаБезДоговора(НеОпределено, Истина, МассивСотрудники, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыСостоянийРаботниковОрганизацийОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовСостоянияСотрудника(НеОпределено, Истина, МассивСотрудники, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыСостоянийРаботниковОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовСостоянияСотрудникаБезДоговора(НеОпределено, Истина, МассивСотрудники, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыЗанятостиПомещенийОшибки" Тогда
		МассивСотрудники = Новый Массив;
		МассивСотрудники.Добавить(ДанныеСтроки.Ссылка);
		
		СообщенияОбОшибках = Новый Массив;
		
		ОбщегоНазначения.ПолучитьОшибкиПериодовЗанятостиПомещения(НеОпределено, Истина, МассивСотрудники, СообщенияОбОшибках, НеОпределено);
		Регистраторы = Новый Соответствие();
		Для Каждого Сообщение Из СообщенияОбОшибках Цикл
			Если Сообщение.Регистратор1Ссылка <> null И Регистраторы[Сообщение.Регистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаНачала;
			КонецЕсли;
			Если Сообщение.Регистратор2Ссылка <> null И Регистраторы[Сообщение.Регистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.Регистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.Регистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор1Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор1Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор1Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор1Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
			Если Сообщение.ПослРегистратор2Ссылка <> null И Регистраторы[Сообщение.ПослРегистратор2Ссылка] = НеОпределено Тогда
				Регистраторы[Сообщение.ПослРегистратор2Ссылка] = 0;
				Строка = Форма.Ошибки.Добавить();
				Строка.Документ = Сообщение.ПослРегистратор2Ссылка;
				Строка.ДатаСобытия = Сообщение.ДатаОкончания;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции

Функция ОшибкиКадровыхПеремещенийБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки" Тогда
		НаборОшибокПериодов = РегистрыСведений.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботыОшибки.СоздатьНаборЗаписей();
		НаборОшибокПериодов.Отбор.Физлицо.Установить(ДанныеСтроки.Ссылка);
		НаборОшибокПериодов.Записать(Истина);
	
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки" Тогда
		НаборОшибокПериодов = РегистрыСведений.ПериодыРаботыРаботниковОрганизацийПоСовместительствуОшибки.СоздатьНаборЗаписей();
		НаборОшибокПериодов.Отбор.Физлицо.Установить(ДанныеСтроки.Ссылка);
		НаборОшибокПериодов.Отбор.Организация.Установить(ДанныеСтроки.Организация);
		НаборОшибокПериодов.Записать(Истина);
	
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыРаботыРаботниковОшибки" Тогда
		НаборОшибокПериодов = РегистрыСведений.ПериодыРаботыРаботниковОшибки.СоздатьНаборЗаписей();
		НаборОшибокПериодов.Отбор.Физлицо.Установить(ДанныеСтроки.Ссылка);
		НаборОшибокПериодов.Записать(Истина);
	
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыСостоянийРаботниковОрганизацийОшибки" Тогда
		НаборОшибокПериодов = РегистрыСведений.ПериодыСостоянийРаботниковОрганизацийОшибки.СоздатьНаборЗаписей();
		НаборОшибокПериодов.Отбор.Сотрудник.Установить(ДанныеСтроки.Ссылка);
		НаборОшибокПериодов.Записать(Истина);
	
	ИначеЕсли ДанныеСтроки.ДополнительныеДанные = "ПериодыСостоянийРаботниковОшибки" Тогда
		НаборОшибокПериодов = РегистрыСведений.ПериодыСостоянийРаботниковОшибки.СоздатьНаборЗаписей();
		НаборОшибокПериодов.Отбор.Физлицо.Установить(ДанныеСтроки.Ссылка);
		НаборОшибокПериодов.Записать(Истина);
		
	КонецЕсли;
	
	Возврат Перечисления.ГруппыЗадачПользователя.ОшибкиКадровыхПеремещений;
	
КонецФункции


Функция ПроизводственныйКалендарьДействие1(ДанныеСтроки) Экспорт
	
	Форма = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.ПолучитьФормуСписка();
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ПоказНамеченныхСобытийПоПерсоналуДействие1()

Функция ПроизводственныйКалендарьБольшеНеНапоминать(ДанныеСтроки) Экспорт
	
	мСпособОтображенияЗадач.Вставить(Перечисления.ГруппыЗадачПользователя.ПроизводственныйКалендарь, Истина);
	
	Возврат Перечисления.ГруппыЗадачПользователя.ПроизводственныйКалендарь;
	
КонецФункции

Функция ТекущиеЗадачиПользователяДействие1(ДанныеСтроки) Экспорт
	
	Форма = РегистрыСведений.ТекущиеЗадачиПользователей.ПолучитьФормуСписка();
	
	Форма.Открыть();
	
	Возврат Неопределено;
	
КонецФункции // ТекущиеЗадачиПользователяДействие1()

Функция ПоказатьГруппу(ДанныеСтроки) Экспорт
	
	ГруппаЗадач = Перечисления.ГруппыЗадачПользователя[ДанныеСтроки.ПриоритетГруппыЗадач];
	
	мСпособОтображенияЗадач.Вставить(ГруппаЗадач, Истина);
	
	Возврат ГруппаЗадач;
	
КонецФункции // ПерерасчетЗарплатыОрганизацийДействие1()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// функция формирует сообщение с именами сотрудников, по которым произведен 
// перерасчет
Функция ПолучитьСообщениеОПерерасчетеСотрудников(ДокументПерерасчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументПерерасчета);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 4
	|	ПРЕДСТАВЛЕНИЕ(СотрудникиПерерасчета.ФизЛицо) КАК ПредставлениеФизЛица
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений
	|	ГДЕ
	|		ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений.ОбъектПерерасчета = &ДокументСсылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений.ФизЛицо
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений
	|	ГДЕ
	|		ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений.ОбъектПерерасчета = &ДокументСсылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.Физлицо
	|	ИЗ
	|		РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка
	|	ГДЕ
	|		РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.ОбъектПерерасчета = &ДокументСсылка) КАК СотрудникиПерерасчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоСотрудников = 0;
	ТекстСообщения = "Документ перерассчитан. Изменились результаты расчета сотрудников:";
	Пока Выборка.Следующий() И КоличествоСотрудников < 4 Цикл
		ТекстСообщения = ТекстСообщения + " " + Выборка.ПредставлениеФизЛица + ",";
		КоличествоСотрудников = КоличествоСотрудников + 1;
	КонецЦикла;
	ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения) - 1);
	Если Выборка.Количество() > 3 Тогда
		ТекстСообщения = ТекстСообщения + " и других...";
	КонецЕсли;
	Если Выборка.Количество() > 0 Тогда
		Возврат ТекстСообщения;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции // ПолучитьСообщениеОПерерасчетеСотрудников()


Функция СформироватьЗапросПоДнямРожденияИПенсионному(Запрос,СписокОрганизаций,ИмяТаблицы,Пенсионный)
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ФизЛица.Ссылка КАК Физлицо,
	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТрудовойДоговор";
	//Если Организация.ИНН = "100092167" Тогда //О.Т. Аверсон 20.04.2019 № 4266
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТрудовойДоговор1";
	//КонецЕсли;
	
	Если Организация.ИНН = "806000046" Тогда 
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ "+ИмяТаблицы+"
		|ИЗ
		|	(ВЫБРАТЬ
		|		ФизическиеЛица.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ФизическиеЛица КАК ФизическиеЛица
		|	ГДЕ
		|		(ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, День, ВЫБОР
		|							КОГДА (ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(ФизическиеЛица.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|					И ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, День, ВЫБОР
		|							КОГДА (ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(ФизическиеЛица.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, День, ВЫБОР
		|							КОГДА (ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)
		|				ИЛИ ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|					И ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, День, ВЫБОР
		|							КОГДА (ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|			КОГДА ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) < &ТекущаяДата
		|				ТОГДА ГОД(&ТекущаяДата) + 1
		|			ИНАЧЕ ГОД(&ТекущаяДата)
		|		КОНЕЦ - ГОД(ФизическиеЛица.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) //О.Т. Аверсон 18.11.2016 № 39
		|		И НЕ ФизическиеЛица.Ссылка В (&ЗакрытыеФизлица)";
		
		Если ИмяТаблицы = "ВТ_Сотрудники1" и Пенсионный = 1 Тогда
			Запрос.Текст = Запрос.Текст + "
			|		И Выбор когда ФизическиеЛица.Пол = Значение(Перечисление.ПолФизическихЛиц.Женский) тогда
			|			Выбор когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1962,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1962,06,30) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1963,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1963,06,30) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1964,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1964,06,30) тогда
			|			истина 
			|			иначе ЛОЖЬ Конец 
			|		ИНАЧЕ
			|			Выбор когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1957,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1957,06,30) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1958,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1958,06,30) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1959,01,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1959,06,30) тогда
			|			истина 
			|			иначе ЛОЖЬ Конец 
			|		КОНЕЦ";

		ИначеЕсли ИмяТаблицы = "ВТ_Сотрудники2" и Пенсионный = 2 Тогда
			Запрос.Текст = Запрос.Текст + "
			|		И Выбор когда ФизическиеЛица.Пол = Значение(Перечисление.ПолФизическихЛиц.Женский) тогда
			|			Выбор когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1962,07,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1962,12,31) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1963,07,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1963,12,31) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1964,07,01) тогда
			|			истина 
			|			иначе ЛОЖЬ Конец 
			|		ИНАЧЕ
			|			Выбор когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1957,07,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1957,12,31) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1958,07,01) и ФизическиеЛица.ДатаРождения <= ДатаВремя(1958,12,31) тогда
			|			истина
			|			когда ФизическиеЛица.ДатаРождения >= ДатаВремя(1959,07,01) тогда
			|			истина 
			|			иначе ЛОЖЬ Конец 
			|		КОНЕЦ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "		
		|		И ФизическиеЛица.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
		|			ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник
		|		ПО ФизЛица.Ссылка = СотрудникиОрганизаций.Физлицо
		|ГДЕ
		|	СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда)
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|И НАЧАЛОПЕРИОДА(&ТекущаяДата,ДЕНЬ) >= НАЧАЛОПЕРИОДА(РаботникиОрганизацийСрезПоследних.ПериодЗавершения,ДЕНЬ) //СВЭЙ 29.05.2024 КВВ СВФР-013128
		|				ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЭтоТрудовойДоговор";
		

	иначе
		
		Запрос.Текст = Запрос.Текст + "
		|ПОМЕСТИТЬ "+ИмяТаблицы+"
		|ИЗ
		|	(ВЫБРАТЬ
		|		ФизическиеЛица.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ФизическиеЛица КАК ФизическиеЛица
		|	ГДЕ
		|		(ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(ФизическиеЛица.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|					И ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(ФизическиеЛица.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|				ИЛИ ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|					И ДОБАВИТЬКДАТЕ(ФизическиеЛица.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(ФизическиеЛица.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)) //О.Т. Аверсон 18.11.2016 № 39
		|		И НЕ ФизическиеЛица.Ссылка В (&ЗакрытыеФизлица)
		|		И ФизическиеЛица.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
		|			ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник
		|		ПО ФизЛица.Ссылка = СотрудникиОрганизаций.Физлицо
		
		//Аверсон ЕАЕ 23.01.2025 СВФР-014363
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Пенсионеры КАК Пенсионеры
		|       ПО ФизЛица.Ссылка = Пенсионеры.ФизЛицо
		//Аверсон СВФР-014363
		
		|ГДЕ
		|	СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Подряда)
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|И НАЧАЛОПЕРИОДА(&ТекущаяДата,ДЕНЬ) >= НАЧАЛОПЕРИОДА(РаботникиОрганизацийСрезПоследних.ПериодЗавершения,ДЕНЬ) //СВЭЙ 29.05.2024 КВВ СВФР-013128
		|				ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		
		//Аверсон ЕАЕ 23.01.2025 СВФР-014363
		|И Пенсионеры.ФизЛицо ЕСТЬ NULL
		//Аверсон СВФР-014363
		
		|ИНДЕКСИРОВАТЬ ПО
		|	ЭтоТрудовойДоговор"; //О.Т. 12.12.2014 № 17727
		
		//Аверсон ЕАЕ 23.01.2025 СВФР-014363
		Если Пенсионный = 1 ИЛИ Пенсионный = 2 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗакрытыеФизлица", "&ЗакрытыеПенсионеры");
		КонецЕсли;
		//Аверсон СВФР-014363
		
	КонецЕсли;
	Запрос.Выполнить();
	
	
	Если Организация.ИНН = "806000046" Тогда 
		Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, ДЕНЬ, ВЫБОР
		|							КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ВЫБОР
		|							КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ КАК Период, //О.Т. Аверсон 18.11.2016 № 39
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование КАК Наименование,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Ссылка,
		|	ВЫБОР
		|		КОГДА (ГОД(ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, ДЕНЬ, ВЫБОР
		|							КОГДА (ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ВЫБОР
		|							КОГДА (ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДополнительныеДанные,
		
		|	РАЗНОСТЬДАТ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, ДЕНЬ, ВЫБОР
		|							КОГДА (ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ВЫБОР
		|							КОГДА (ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ВЫБОР
		|						КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) < &ТекущаяДата
		|							ТОГДА ГОД(&ТекущаяДата) + 1
		|						ИНАЧЕ ГОД(&ТекущаяДата)
		|					КОНЕЦ - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ, ГОД) как КоличествоЛет
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		,
		|		Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ "+ИмяТаблицы+" ГДЕ ЭтоТрудовойДоговор";
		//Если Организация.ИНН = "100092167" Тогда //О.Т. Аверсон 20.04.2019 № 4266
			Запрос.Текст = Запрос.Текст + " или ЭтоТрудовойДоговор1";
		//КонецЕсли;
		
		
		Запрос.Текст = Запрос.Текст + " )";
		Если Не (СписокОрганизаций = Неопределено) Тогда
			Запрос.Текст = Запрос.Текст + "
			|			И Организация В (&СписокГоловныхОрганизаций)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|			) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|И НАЧАЛОПЕРИОДА(&ТекущаяДата,ДЕНЬ) >= НАЧАЛОПЕРИОДА(РаботникиОрганизацийСрезПоследних.ПериодЗавершения,ДЕНЬ) //СВЭЙ 29.05.2024 КВВ СВФР-013128
		|			ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния 
		|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	И ВЫБОР
		|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделение 
		|	КОНЕЦ В (&СписокОрганизаций)
		|
		|ОБЪЕДИНИТЬ
		|
		//|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
		|ВЫБРАТЬ 
		|	ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, ДЕНЬ, ВЫБОР
		|							КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ВЫБОР
		|							КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|								ТОГДА &ДниЮбилей
		|							ИНАЧЕ &ДниНеЮбилей
		|						КОНЕЦ)) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения))
		|	КОНЕЦ, //О.Т. Аверсон 18.11.2016 № 39
		|	РаботникиСрезПоследних.ФизЛицо.Наименование,
		|	РаботникиСрезПоследних.ФизЛицо,
		|	ВЫБОР
		|		КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(РаботникиСрезПоследних.Физлицо.ДатаРождения, &ТекущаяДата, ГОД)
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(
		|		,
		|		ФизЛицо В (ВЫБРАТЬ Физлицо ИЗ "+ИмяТаблицы+")) КАК РаботникиСрезПоследних
		|ГДЕ
		|	РаботникиСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Наименование";
	иначе
		
		Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ КАК Период, //О.Т. Аверсон 18.11.2016 № 39
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование КАК Наименование,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Ссылка,
		//|	ВЫБОР
		//|		КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		
		//Аверсон 26.12.2019 КВВ СВФР-005264 (
		|	ВЫБОР
		|	КОГДА (РАЗНОСТЬДАТ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|	И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|	ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ, ГОД)) / 5 = 
		|	(ВЫРАЗИТЬ(РАЗНОСТЬДАТ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|	И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|	ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ, ГОД) / 5 КАК ЧИСЛО(4, 0)))
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		//Аверсон 26.12.2019 КВВ СВФР-005264 )
		|	КОНЕЦ КАК ДополнительныеДанные,
		
		|	РАЗНОСТЬДАТ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.ДатаРождения))
		|	КОНЕЦ, ГОД) как КоличествоЛет
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		,
		|		Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ "+ИмяТаблицы+" ГДЕ ЭтоТрудовойДоговор";
		//Если Организация.ИНН = "100092167" Тогда //О.Т. Аверсон 20.04.2019 № 4266
			Запрос.Текст = Запрос.Текст + " или ЭтоТрудовойДоговор1";
		//КонецЕсли;
		
		
		Запрос.Текст = Запрос.Текст + " )";
		Если Не (СписокОрганизаций = Неопределено) Тогда
			Запрос.Текст = Запрос.Текст + "
			|			И Организация В (&СписокГоловныхОрганизаций)";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|			) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|И НАЧАЛОПЕРИОДА(&ТекущаяДата,ДЕНЬ) >= НАЧАЛОПЕРИОДА(РаботникиОрганизацийСрезПоследних.ПериодЗавершения,ДЕНЬ) //СВЭЙ 29.05.2024 КВВ СВФР-013128
		|			ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния 
		|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	И ВЫБОР
		|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделение 
		|	КОНЕЦ В (&СписокОрганизаций)
		|
		|ОБЪЕДИНИТЬ
		|
		//|ВЫБРАТЬ" + ?(НеОграничиватьСписокЗадач = Истина, "", " ПЕРВЫЕ "+мКоличествоЗадачВГруппе) + "
		|ВЫБРАТЬ 
		|	ВЫБОР
		|	КОГДА ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения)) >= &ДатаОтсчетаДнейРождения
		|			И ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения)) <= ДОБАВИТЬКДАТЕ(&ДатаОтсчетаДнейРождения, МЕСЯЦ, &МесяцДата)
		|		ТОГДА ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения))
		|	ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиСрезПоследних.ФизЛицо.ДатаРождения, ГОД, ГОД(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, &МесяцДата)) - ГОД(РаботникиСрезПоследних.ФизЛицо.ДатаРождения))
		|	КОНЕЦ, //О.Т. Аверсон 18.11.2016 № 39
		|	РаботникиСрезПоследних.ФизЛицо.Наименование,
		|	РаботникиСрезПоследних.ФизЛицо,
		|	ВЫБОР
		|		КОГДА (ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 = (ВЫРАЗИТЬ((ГОД(&ТекущаяДата) - ГОД(РаботникиСрезПоследних.Физлицо.ДатаРождения)) / 5 КАК ЧИСЛО(4, 0)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	РАЗНОСТЬДАТ(РаботникиСрезПоследних.Физлицо.ДатаРождения, &ТекущаяДата, ГОД)
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(
		|		,
		|		ФизЛицо В (ВЫБРАТЬ Физлицо ИЗ "+ИмяТаблицы+")) КАК РаботникиСрезПоследних
		|ГДЕ
		|	РаботникиСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Наименование";
	КонецЕсли;
	
	
	Возврат Запрос;
	
КонецФункции

//Аверсон ЕАЕ 05.06.2025 СВФР-015804
Функция ЗавершениеДоговораДействие1(ДанныеСтроки) Экспорт
	
	ФормаЭлемента = ДанныеСтроки.Ссылка.ПолучитьФорму();
	ФормаЭлемента.Открыть();
	
	Возврат Неопределено;
	
КонецФункции
//Аверсон СВФР-015804

//Аверсон ЕАЕ 18.08.2025 СВФР-016410
Функция ПолучитьСписокАктуальныхФЛ(СписокФЛ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизаций.Ссылка,
		|	СотрудникиОрганизаций.Физлицо,
		|	СотрудникиОрганизаций.Актуальность
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Физлицо В(&СписокФЛ)
		|	И НЕ СотрудникиОрганизаций.ПометкаУдаления
		|	И СотрудникиОрганизаций.Актуальность";
	
	Запрос.УстановитьПараметр("СписокФЛ", СписокФЛ);
	
	СписокФЛ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	
	Возврат СписокФЛ;
КонецФункции
//Аверсон СВФР-016410

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мСпособОтображенияЗадач = Новый Соответствие;

мКоличествоЗадачВГруппе = 8;