Функция СформироватьЗапросПоСреднесписочнойЧисленности(Запрос, Расшифровка = Ложь, СписокСотрудников,СписокСотрудниковИскл,СписокСЭ_МестаРаботы,Организация,ПодразделенияОрганизации,
	ПодразделенияОрганизацииИскл,СвойствоОбьектов,ЗначениеСвойства,СреднесписочнаяНеВкл,СписочнаяНеВкл,ПериодОтчета,ПериодОтчета1,РасшифровкаПоПолуКатегории=Ложь, 
	ВызовИзКакогоОтчета = "",НачисленияПоПериодуДействия=Ложь, РасшифровкаПоДолжности=Ложь, ГрафикПолн = Неопределено) Экспорт    //Аверсон 01.03.2022 КВВ СВФР-008462 (РасшифровкаПоПолуКатегории) 
	                                                                                                                              //Аверсон 15.04.2022 КВВ СВФР-008958 (ВызовИзКакогоОтчета) 
																																  //Аверсон 02.05.2022 КВВ СВФР-008814 (НачисленияПоПериодуДействия) 
																																  //Аверсон 11.11.2022 КВВ СВФР-009750 (РасшифровкаПоДолжности)
																																  //Аверсон 25.11.2024 ЕАЕ СВФР-014142 (ГрафикПолн)
	//Аверсон 23.01.2022 КВВ СВФР-008462 (перенесено из отчета 12т  общий модуль) (                                                                                                                                                                                                                                                                                                                                                                   
	
	
	//Аверсон 19.12.2019 КВВ СВФР-005230 (
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);  
	Запрос.УстановитьПараметр("СписокСотрудниковИскл", СписокСотрудниковИскл);
	
	СписокФизЛиц = Новый СписокЗначений;
	СписокФизЛицИскл = Новый СписокЗначений;
	Для Каждого ЭлСпСотр Из СписокСотрудников Цикл
		СписокФизЛиц.Добавить(ЭлСпСотр.Значение.ФизЛицо);	
	КонецЦикла;
	Для Каждого ЭлСпСотрИскл Из СписокСотрудниковИскл Цикл
		СписокФизЛицИскл.Добавить(ЭлСпСотрИскл.Значение.ФизЛицо);	
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛиц);  
	Запрос.УстановитьПараметр("СписокФизЛицИскл", СписокФизЛицИскл);
	//Аверсон 19.12.2019 КВВ СВФР-005230 )
	
	Запрос.УстановитьПараметр("СписокСЭ_МестаРаботы", СписокСЭ_МестаРаботы); //Аверсон 10.12.2021 КВВ СВФР-008463
	
	Запрос.УстановитьПараметр("Организация", Организация);  //Аверсон 07.08.2020 КВВ СВФР-006400
	
	//Аверсон 21.09.2021 КВВ СВФР-008154 (
	СписокОснованийУв = Новый СписокЗначений;
	ВыборкаОснованийУв = Справочники.ОснованияУвольненияИзОрганизации.Выбрать();
	Пока ВыборкаОснованийУв.Следующий() Цикл
		СсылкаНаЭлементВыборкаОснованийУв = ВыборкаОснованийУв.Ссылка;
		НаимОсн = Нрег(ВыборкаОснованийУв.Наименование);
		если Найти(НаимОсн,"прогул") > 0 или Найти(НаимОсн,"нарушен") > 0
			или Найти(НаимОсн,"аспитие") > 0 или Найти(НаимОсн,"алкоголь") > 0 
			или Найти(НаимОсн,"опьянение") > 0 или Найти(НаимОсн,"арест") > 0 
			или Найти(НаимОсн,"приговор") > 0 Тогда //Аверсон 25.02.2022 КВВ СВФР-008789
			СписокОснованийУв.Добавить(СсылкаНаЭлементВыборкаОснованийУв);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокОснованийУв", СписокОснованийУв);
	//Аверсон 21.09.2021 КВВ СВФР-008154 )
	
	//Аверсон ЕАЕ 11.10.2024 СВФР-013762
	УчетнаяПолитикаЗапрос = Новый Запрос; 
	УчетнаяПолитикаЗапрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
	УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
	если УчетнаяПолитика.Количество()>0 Тогда 
		УчитыватьОтработанноеВремяТолькоПоТабелю = УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю;
	иначе
		УчитыватьОтработанноеВремяТолькоПоТабелю = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("УчитыватьОтработанноеВремяТолькоПоТабелю", УчитыватьОтработанноеВремяТолькоПоТабелю);
	//Аверсон СВФР-013762
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-013762
	Если ГрафикПолн = Неопределено Тогда
		ГрафикПолнЗначение = Справочники.ГрафикиРаботы.ПустаяСсылка();
	Иначе
		ГрафикПолнЗначение = ГрафикПолн;
	КонецЕсли;
	Запрос.УстановитьПараметр("ГрафикПолногоРабочегоВремениБезСокращенных", ГрафикПолнЗначение);
	//Аверсон СВФР-013762
	
	Запрос.Текст = 
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 5) (
	
	////Аверсон 21.09.2021 КВВ СВФР-008154 (
	//"ВЫБРАТЬ
	//|УвРО.Ссылка КАК Док,
	//|УвРО.Сотрудник КАК Сотрудник,
	//|УвРО.Ссылка.Дата КАК ДатаДок,
	//|УвРО.ДатаУвольнения КАК ДатаУвольнения,
	//|УвРО.ОснованиеУвольнения КАК ОснованиеУвольнения
	//|ПОМЕСТИТЬ ВтУволенныхЗаПрогулы
	//|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвРО
	//|ГДЕ
	//|УвРО.Ссылка.Проведен = ИСТИНА
	//|И УвРО.ОснованиеУвольнения В (&СписокОснованийУв)
	//|И НАЧАЛОПЕРИОДА(УвРО.ДатаУвольнения,МЕСЯЦ) < НАЧАЛОПЕРИОДА(УвРО.Ссылка.Дата,МЕСЯЦ)
	//|;
	//|
	////Аверсон 21.09.2021 КВВ СВФР-008154 )
	
	"ВЫБРАТЬ
	|УвРО.Ссылка КАК Док,
	|УвРО.Сотрудник КАК Сотрудник,
	|УвРО.Ссылка.Дата КАК ДатаДок,
	|УвРО.ДатаУвольнения КАК ДатаУвольнения,
	|УвРО.ОснованиеУвольнения КАК ОснованиеУвольнения
	|ПОМЕСТИТЬ ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок
	|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвРО
	|ГДЕ
	|УвРО.Ссылка.Проведен = ИСТИНА
	|И УвРО.ОснованиеУвольнения В (&СписокОснованийУв)
	|И НАЧАЛОПЕРИОДА(УвРО.ДатаУвольнения,МЕСЯЦ) < НАЧАЛОПЕРИОДА(УвРО.Ссылка.Дата,МЕСЯЦ)
	|;
	|ВЫБРАТЬ 
	|МАКСИМУМ(РО.Период),
	|РО.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|РО.Сотрудник
	|ПОМЕСТИТЬ ВтУволенныхЗаПрогулыЗанимаемыхСтавок
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РО
	|ГДЕ 
	|РО.Сотрудник В (ВЫБРАТЬ ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.Сотрудник ИЗ ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок)
	|И РО.ЗанимаемыхСтавок > 0 
	|СГРУППИРОВАТЬ ПО
	|РО.ЗанимаемыхСтавок,
	|РО.Сотрудник
	|;
	|		
	|ВЫБРАТЬ 
	|ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.Док КАК Док,
	|ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.Сотрудник КАК Сотрудник,
	|ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.ДатаДок КАК ДатаДок,
	|ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.ДатаУвольнения КАК ДатаУвольнения,
	|ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.ОснованиеУвольнения КАК ОснованиеУвольнения,
	|ВтУволенныхЗаПрогулыЗанимаемыхСтавок.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВтУволенныхЗаПрогулы
	|ИЗ ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок КАК ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенныхЗаПрогулыЗанимаемыхСтавок КАК ВтУволенныхЗаПрогулыЗанимаемыхСтавок
	|ПО ВтУволенныхЗаПрогулыБЕЗЗанимаемыхСтавок.Сотрудник = ВтУволенныхЗаПрогулыЗанимаемыхСтавок.Сотрудник
	|;
	|
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 5) )
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВтМесяцаОтчета
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Календарь
	|ГДЕ
	|	Календарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБРАТЬ
	|РаботникиОрганизаций.Сотрудник КАК Сотрудник ,
	|РаботникиОрганизаций.Сотрудник.ФизЛицо КАК ФЛ
	|Поместить ВтСотрудникиОбщиеФЛ0  //Аверсон 07.09.2021 КВВ СВФР-008093 (пункт 2) (замена ВтСотрудникиОбщиеФЛ1 на ВтСотрудникиОбщиеФЛ0)
	|ИЗ	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|И РаботникиОрганизаций.Организация = &Организация  //Аверсон 08.05.2020 КВВ СВФР-005900
	|И РаботникиОрганизаций.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант)
	|И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|РаботникиОрганизаций.Сотрудник,
	|РаботникиОрганизаций.Сотрудник.ФизЛицо
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|И РаботникиОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|И РаботникиОрганизаций.Организация = &Организация  //Аверсон 08.05.2020 КВВ СВФР-005900
	|И РаботникиОрганизаций.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) 
	|И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|РаботникиОрганизацийСрезПоследних.Сотрудник,
	|РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, ) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|ВЫБОР
	|КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|И РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &НачалоПериода
	|ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
	|КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|И РаботникиОрганизацийСрезПоследних.Организация = &Организация 
	|И РаботникиОрганизацийСрезПоследних.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) 
	|И РаботникиОрганизацийСрезПоследних.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|;
	//Аверсон 07.09.2021 КВВ СВФР-008093 ( (пункт 2) 
	|ВЫБРАТЬ *
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ1
	|ИЗ ВтСотрудникиОбщиеФЛ0 КАК ВтСотрудникиОбщиеФЛ0
	|СГРУППИРОВАТЬ ПО 
	|Сотрудник,
	|ФЛ
	|;
	//Аверсон 07.09.2021 КВВ СВФР-008093 ) (пункт 2) 
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ1.Сотрудник,
	|ВтСотрудникиОбщиеФЛ1.ФЛ
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ2
	|ИЗ ВтСотрудникиОбщиеФЛ1 КАК ВтСотрудникиОбщиеФЛ1
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ1.ФЛ,
	|ВтСотрудникиОбщиеФЛ1.Сотрудник
	|;
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ2.Сотрудник,
	|ВтСотрудникиОбщиеФЛ2.ФЛ,
	|1 КАК КолвоФЛ,
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|ВЫБОР КОГДА РО1.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|ТОГДА НАЧАЛОПЕРИОДА(РО1.Период,ДЕНЬ) 
	|ИНАЧЕ ДАТАВРЕМЯ(1,1,1,0,0,0)
	|КОНЕЦ КАК ДатаПриема,
	|
	|ВЫБОР КОГДА РО2.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РО2.Период,ДЕНЬ,-1),ДЕНЬ) 
	|ИНАЧЕ ДАТАВРЕМЯ(1,1,1,0,0,0)
	|КОНЕЦ КАК ДатаУвольнения
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ3
	|ИЗ ВтСотрудникиОбщиеФЛ2 КАК ВтСотрудникиОбщиеФЛ2
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО1
	|ПО ВтСотрудникиОбщиеФЛ2.Сотрудник = РО1.Сотрудник
	|И РО1.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО2
	|ПО ВтСотрудникиОбщиеФЛ2.Сотрудник = РО2.Сотрудник
	|И РО2.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	//Аверсон 16.10.2022 КВВ СВФР-009547 (пункт 2) (
	|ГДЕ 
	|ВтСотрудникиОбщиеФЛ2.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	//Аверсон 16.10.2022 КВВ СВФР-009547 (пункт 2) )
	
	|;
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ3.ФЛ,
	|Сумма(ВтСотрудникиОбщиеФЛ3.КолвоФЛ) КАК КолвоФЛ
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ4
	|ИЗ ВтСотрудникиОбщиеФЛ3 КАК ВтСотрудникиОбщиеФЛ3
	|ГДЕ ВтСотрудникиОбщиеФЛ3.ДатаУвольнения = ДАТАВРЕМЯ(1,1,1,0,0,0) //Аверсон 10.10.2022 КВВ СВФР-009547 
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ3.ФЛ
	|;
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ3.ФЛ,
	|Сумма(ВтСотрудникиОбщиеФЛ3.КолвоФЛ) КАК КолвоФЛ
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ4_НоваяДляДублей
	|ИЗ ВтСотрудникиОбщиеФЛ3 КАК ВтСотрудникиОбщиеФЛ3
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ3.ФЛ
	|;
	|
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ4_НоваяДляДублей.ФЛ КАК ФизЛицо
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ5_НоваяДляДублей
	|ИЗ ВтСотрудникиОбщиеФЛ4_НоваяДляДублей КАК ВтСотрудникиОбщиеФЛ4_НоваяДляДублей
	|ГДЕ ВтСотрудникиОбщиеФЛ4_НоваяДляДублей.КолвоФЛ > 1
	|;
	|
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ВЫБРАТЬ
	|ВтСотрудникиОбщиеФЛ4.ФЛ
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ5
	|ИЗ ВтСотрудникиОбщиеФЛ4 КАК ВтСотрудникиОбщиеФЛ4
	|ГДЕ ВтСотрудникиОбщиеФЛ4.КолвоФЛ > 1
	|;
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ1.Сотрудник,
	|ВтСотрудникиОбщиеФЛ1.Сотрудник.Код,
	|РО.Период КАК ДатаПриема,
	|РО2.ПодразделениеОрганизации,
	|РО2.Должность, //СВЭЙ 12.10.2023 КВВ СВФР-011608
	|РО2.ЗанимаемыхСтавок     
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ6
	|ИЗ ВтСотрудникиОбщиеФЛ1 КАК ВтСотрудникиОбщиеФЛ1
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода,ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РО
	|ПО ВтСотрудникиОбщиеФЛ1.Сотрудник = РО.Сотрудник
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода) КАК РО2
	|ПО ВтСотрудникиОбщиеФЛ1.Сотрудник = РО2.Сотрудник
	|ГДЕ ВтСотрудникиОбщиеФЛ1.Сотрудник.ФизЛицо В (Выбрать
	|ВтСотрудникиОбщиеФЛ5.ФЛ
	|Из ВтСотрудникиОбщиеФЛ5)
	|;
	|ВЫБРАТЬ
	|МИНИМУМ(ВтСотрудникиОбщиеФЛ6.ДатаПриема) КАК ДатаПриема,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ7
	|ИЗ ВтСотрудникиОбщиеФЛ6 КАК ВтСотрудникиОбщиеФЛ6
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо
	|;
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ6.Сотрудник,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.Код,
	|ВтСотрудникиОбщиеФЛ6.ПодразделениеОрганизации,
	|ВтСотрудникиОбщиеФЛ6.Должность, //СВЭЙ 12.10.2023 КВВ СВФР-011608
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица
	|ИЗ ВтСотрудникиОбщиеФЛ6 КАК ВтСотрудникиОбщиеФЛ6
	
	//СВЭЙ 12.10.2023 КВВ СВФР-011608 (
	//|ГДЕ НЕ ВтСотрудникиОбщиеФЛ6.ДатаПриема В (Выбрать
	//|ВтСотрудникиОбщиеФЛ7.ДатаПриема
	//|Из ВтСотрудникиОбщиеФЛ7)
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиОбщиеФЛ7
	|ПО ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо = ВтСотрудникиОбщиеФЛ7.ФизЛицо
	|И ВтСотрудникиОбщиеФЛ6.ДатаПриема = ВтСотрудникиОбщиеФЛ7.ДатаПриема
	|ГДЕ   ВтСотрудникиОбщиеФЛ7.ФизЛицо ЕСТЬ NULL
	//СВЭЙ 12.10.2023 КВВ СВФР-011608 )
	
	|;
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник,
	|ВтСотрудникиОбщиеФЛ6.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ66
	|ИЗ ВтСотрудникиОбщиеФЛ6 КАК ВтСотрудникиОбщиеФЛ6
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник,
	|ВтСотрудникиОбщиеФЛ6.ЗанимаемыхСтавок
	|;
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ66.Сотрудник.ФизЛицо КАК ФизЛицо,
	|СУММА(ВтСотрудникиОбщиеФЛ66.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеФЛ77
	|ИЗ ВтСотрудникиОбщиеФЛ66 КАК ВтСотрудникиОбщиеФЛ66
	|СГРУППИРОВАТЬ ПО 
	|ВтСотрудникиОбщиеФЛ66.Сотрудник.ФизЛицо
	|;
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ6.Сотрудник,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.Код,
	|ВтСотрудникиОбщиеФЛ6.ПодразделениеОрганизации,
	|ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо КАК ФизЛицо,
	|ВтСотрудникиОбщиеФЛ77.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица    //!!!!!
	|ИЗ ВтСотрудникиОбщиеФЛ6 КАК ВтСотрудникиОбщиеФЛ6
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиОбщиеФЛ77 КАК ВтСотрудникиОбщиеФЛ77
	|ПО ВтСотрудникиОбщиеФЛ6.Сотрудник.ФизЛицо = ВтСотрудникиОбщиеФЛ77.ФизЛицо
	|ГДЕ ВтСотрудникиОбщиеФЛ6.ДатаПриема В (Выбрать
	|ВтСотрудникиОбщиеФЛ7.ДатаПриема
	|Из ВтСотрудникиОбщиеФЛ7)
	|;
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|
	|ВЫБРАТЬ 
	|ВтСотрудникиОбщиеФЛ5_НоваяДляДублей.ФизЛицо 
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая
	|ИЗ ВтСотрудникиОбщиеФЛ5_НоваяДляДублей КАК ВтСотрудникиОбщиеФЛ5_НоваяДляДублей
	|ГДЕ НЕ (ФизЛицо) В (ВЫБРАТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ИЗ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица)
	|;
	|
	|ВЫБРАТЬ
	|УвРО.Ссылка КАК Док,
	|УвРО.Сотрудник КАК Сотрудник,
	|УвРО.Ссылка.Дата КАК ДатаДок,
	|УвРО.ДатаУвольнения КАК ДатаУвольнения,
	|УвРО.ОснованиеУвольнения КАК ОснованиеУвольнения
	|ПОМЕСТИТЬ ВтУволенных1
	|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвРО
	|ГДЕ
	|УвРО.Ссылка.Проведен = ИСТИНА
	|И НАЧАЛОПЕРИОДА(УвРО.ДатаУвольнения,МЕСЯЦ) = НАЧАЛОПЕРИОДА(&КонецПериода,МЕСЯЦ)
	|И (УвРО.Сотрудник.ФизЛицо) В (ВЫБРАТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая.ФизЛицо ИЗ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая)
	|
	|;
	
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 ( 
	|
	|ВЫБРАТЬ
	|УвРО.Ссылка КАК Док,
	|УвРО.Сотрудник КАК Сотрудник,
	|УвРО.Ссылка.Дата КАК ДатаДок,
	|УвРО.ДатаУвольнения КАК ДатаУвольнения,
	|УвРО.ОснованиеУвольнения КАК ОснованиеУвольнения
	|ПОМЕСТИТЬ ВтУволенных55
	|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвРО
	|ГДЕ
	|УвРО.Ссылка.Проведен = ИСТИНА
	|И НАЧАЛОПЕРИОДА(УвРО.ДатаУвольнения,МЕСЯЦ) = НАЧАЛОПЕРИОДА(&КонецПериода,МЕСЯЦ)
	|И НЕ (УвРО.Сотрудник.ФизЛицо) В (ВЫБРАТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая.ФизЛицо ИЗ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая)
	|;
	|
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 )
	
	|ВЫБРАТЬ 
	|МАКСИМУМ(РО.Период),
	|РО.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|РО.Сотрудник
	|ПОМЕСТИТЬ ВтУволенных2
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РО
	|ГДЕ 
	|РО.Сотрудник В (ВЫБРАТЬ ВтУволенных1.Сотрудник ИЗ ВтУволенных1)
	|И РО.ЗанимаемыхСтавок > 0 
	|СГРУППИРОВАТЬ ПО
	|РО.ЗанимаемыхСтавок,
	|РО.Сотрудник
	|;
	|
	|ВЫБРАТЬ
	|РО.Сотрудник,
	|РО.Сотрудник.Код КАК ТН,
	|РО.Сотрудник.ФизЛицо КАК ФизЛицо,
	|ВЫБОР 
	|КОГДА РО2.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение) ТОГДА
	|ВтУволенных2.ЗанимаемыхСтавок
	|ИНАЧЕ
	|РО.ЗанимаемыхСтавок
	|КОНЕЦ КАК ЗанимаемыхСтавок,
	|ВЫБОР КОГДА РО1.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|ТОГДА 
	|ВЫБОР КОГДА НАЧАЛОПЕРИОДА(&КонецПериода,МЕСЯЦ) < НАЧАЛОПЕРИОДА(РО1.Период,ДЕНЬ) ТОГДА
	|НАЧАЛОПЕРИОДА(РО1.Период,ДЕНЬ) 
	|ИНАЧЕ
	|НАЧАЛОПЕРИОДА(&КонецПериода,МЕСЯЦ)
	|КОНЕЦ 
	|ИНАЧЕ НАЧАЛОПЕРИОДА(&КонецПериода,МЕСЯЦ)//ДАТАВРЕМЯ(1,1,1,0,0,0)
	|КОНЕЦ КАК ДатаНачала,
	|
	|ВЫБОР КОГДА РО2.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|ТОГДА 
	|ВЫБОР КОГДА КОНЕЦПЕРИОДА(&КонецПериода,МЕСЯЦ) > КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РО2.Период,ДЕНЬ,-1),ДЕНЬ) 
	|ТОГДА
	|КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РО2.Период,ДЕНЬ,-1),ДЕНЬ) 
	|ИНАЧЕ
	|КОНЕЦПЕРИОДА(&КонецПериода,МЕСЯЦ)
	|КОНЕЦ
	|ИНАЧЕ КОНЕЦПЕРИОДА(&КонецПериода,МЕСЯЦ) //ДАТАВРЕМЯ(1,1,1,0,0,0)
	|КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода) КАК РО
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО1
	|ПО РО.Сотрудник = РО1.Сотрудник
	|И РО1.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РО2
	|ПО РО.Сотрудник = РО2.Сотрудник
	|И РО2.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенных2 КАК ВтУволенных2
	|ПО РО.Сотрудник = ВтУволенных2.Сотрудник
	|
	|ГДЕ (РО.Сотрудник.ФизЛицо) В (ВЫБРАТЬ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая.ФизЛицо ИЗ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Первая)
	|;
	|
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|						РаботникиОрганизаций.Сотрудник КАК Сотрудник
	|                        Поместить ВтСотрудникиОбщие
	|						ИЗ
	|							РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|						ГДЕ
	|							РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|							И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|							И РаботникиОрганизаций.Организация = &Организация  //Аверсон 08.05.2020 КВВ СВФР-005900
	|							И РаботникиОрганизаций.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) //Аверсон 09.08.2021 КВВ СВФР-007971
	|							И НЕ РаботникиОрганизаций.Сотрудник В (ВЫБРАТЬ ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.Сотрудник Из ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица) //Аверсон 26.08.2021 КВВ СВФР-008015
	|							И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)";
	Если ЗначениеЗаполнено(ПодразделенияОрганизации) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
	КонецЕсли;
	
	//Аверсон 19.12.2019 КВВ СВФР-005230 (
	Если ЗначениеЗаполнено(СписокСотрудников) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)";
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокСотрудниковИскл) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ РаботникиОрганизаций.Сотрудник В (&СписокСотрудниковИскл)";
	КонецЕсли;
	//Аверсон 19.12.2019 КВВ СВФР-005230 )
	
	//Аверсон 10.12.2021 КВВ СВФР-008463 (
	Если ЗначениеЗаполнено(СписокСЭ_МестаРаботы) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.ауМестоРаботы В (&СписокСЭ_МестаРаботы)";
	КонецЕсли;
	//Аверсон 10.12.2021 КВВ СВФР-008463 )	
	
	
	Запрос.Текст = Запрос.Текст + "
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							РаботникиОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|						ГДЕ
	|							РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|							И РаботникиОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|							И РаботникиОрганизаций.Организация = &Организация  //Аверсон 08.05.2020 КВВ СВФР-005900
	|							И РаботникиОрганизаций.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) //Аверсон 09.08.2021 КВВ СВФР-007971
	|							И НЕ РаботникиОрганизаций.Сотрудник В (ВЫБРАТЬ ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.Сотрудник Из ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица) //Аверсон 26.08.2021 КВВ СВФР-008015
	|							И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)";
	Если ЗначениеЗаполнено(ПодразделенияОрганизации) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
	КонецЕсли;
	
	//Аверсон 19.12.2019 КВВ СВФР-005230 (
	Если ЗначениеЗаполнено(СписокСотрудников) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)";
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокСотрудниковИскл) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ РаботникиОрганизаций.Сотрудник В (&СписокСотрудниковИскл)";
	КонецЕсли;
	//Аверсон 19.12.2019 КВВ СВФР-005230 )
	
	//Аверсон 10.12.2021 КВВ СВФР-008463 (
	Если ЗначениеЗаполнено(СписокСЭ_МестаРаботы) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизаций.ауМестоРаботы В (&СписокСЭ_МестаРаботы)";
	КонецЕсли;
	//Аверсон 10.12.2021 КВВ СВФР-008463 )
	
	Запрос.Текст = Запрос.Текст + "
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							РаботникиОрганизацийСрезПоследних.Сотрудник
	|						ИЗ
	|							РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, ) КАК РаботникиОрганизацийСрезПоследних
	|						ГДЕ
	|							ВЫБОР
	|									КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|											И РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &НачалоПериода
	|										ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|									ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
	|								КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|							И РаботникиОрганизацийСрезПоследних.Организация = &Организация //Аверсон 08.05.2020 КВВ СВФР-005900
	|							И РаботникиОрганизацийСрезПоследних.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) //Аверсон 09.08.2021 КВВ СВФР-007971
	|							И НЕ РаботникиОрганизацийСрезПоследних.Сотрудник В (ВЫБРАТЬ ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.Сотрудник Из ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица) //Аверсон 26.08.2021 КВВ СВФР-008015
	|							И РаботникиОрганизацийСрезПоследних.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)";
	Если ЗначениеЗаполнено(ПодразделенияОрганизации) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";
	КонецЕсли;
	
	//Аверсон 19.12.2019 КВВ СВФР-005230 (
	Если ЗначениеЗаполнено(СписокСотрудников) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизацийСрезПоследних.Сотрудник В (&СписокСотрудников)";
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокСотрудниковИскл) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ РаботникиОрганизацийСрезПоследних.Сотрудник В (&СписокСотрудниковИскл)";
	КонецЕсли;
	//Аверсон 19.12.2019 КВВ СВФР-005230 )
	
	//Аверсон 10.12.2021 КВВ СВФР-008463 (
	Если ЗначениеЗаполнено(СписокСЭ_МестаРаботы) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И РаботникиОрганизацийСрезПоследних.ауМестоРаботы В (&СписокСЭ_МестаРаботы)";
	КонецЕсли;
	//Аверсон 10.12.2021 КВВ СВФР-008463 )
	
	Запрос.Текст = Запрос.Текст + "
	|;
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ Различные
	|	ВтСотрудникиОбщие.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВтСотрудники
	|Из ВтСотрудникиОбщие КАК ВтСотрудникиОбщие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтСотрудники.Сотрудник,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) КАК Период,
	|	ЕСТЬNULL(СреднесписочнаяЧисленностьПоЧасамСрезПоследних.РасчетВЧасах, ЛОЖЬ) КАК РасчетВЧасах
	|ПОМЕСТИТЬ ВтСотрудникиСписочнаяПоЧасам
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СреднесписочнаяЧисленностьПоЧасам.СрезПоследних(
	|				&НачалоПериода,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВтСотрудники.Сотрудник
	|					ИЗ
	|						ВтСотрудники)) КАК СреднесписочнаяЧисленностьПоЧасамСрезПоследних
	|		ПО ВтСотрудники.Сотрудник = СреднесписочнаяЧисленностьПоЧасамСрезПоследних.Сотрудник
	|
	|ОБЪЕДИНИТЬ //ВСЕ //СВЭЙ 08.04.2024 КВВ СВФР-012143 (закомментировано ВСЕ)
	|
	|ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник,
	|	НАЧАЛОПЕРИОДА(&КонецПериода, МЕСЯЦ),
	|	ЕСТЬNULL(СреднесписочнаяЧисленностьПоЧасамСрезПоследних.РасчетВЧасах, ЛОЖЬ)
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СреднесписочнаяЧисленностьПоЧасам.СрезПоследних(
	|				&КонецПериода,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВтСотрудники.Сотрудник
	|					ИЗ
	|						ВтСотрудники)) КАК СреднесписочнаяЧисленностьПоЧасамСрезПоследних
	|		ПО ВтСотрудники.Сотрудник = СреднесписочнаяЧисленностьПоЧасамСрезПоследних.Сотрудник
	|
	|ОБЪЕДИНИТЬ //ВСЕ //СВЭЙ 08.04.2024 КВВ СВФР-012143 (закомментировано ВСЕ) 
	|
	|ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник,
	|	ЕСТЬNULL(СреднесписочнаяЧисленностьПоЧасам.Период, НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)),
	|	ЕСТЬNULL(СреднесписочнаяЧисленностьПоЧасам.РасчетВЧасах, ЛОЖЬ)
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СреднесписочнаяЧисленностьПоЧасам КАК СреднесписочнаяЧисленностьПоЧасам
	|		ПО ВтСотрудники.Сотрудник = СреднесписочнаяЧисленностьПоЧасам.Сотрудник
	|			И (СреднесписочнаяЧисленностьПоЧасам.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|ГДЕ
	|	НЕ СреднесписочнаяЧисленностьПоЧасам.РасчетВЧасах ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник,
	|	ВтМесяцаОтчета.Период
	|ПОМЕСТИТЬ ВтСотрудникПоПериодам
	|ИЗ
	|	ВтМесяцаОтчета КАК ВтМесяцаОтчета,
	|	ВтСотрудники КАК ВтСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСотрудникПоПериодам.Сотрудник,
	|	ВтСотрудникПоПериодам.Период,
	|	МАКСИМУМ(ВтСотрудникиСписочнаяПоЧасам.Период) КАК ПериодРасчатаПоЧасам
	|ПОМЕСТИТЬ ВтПериодыДляСотрудников
	|ИЗ
	|	ВтСотрудникПоПериодам КАК ВтСотрудникПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиСписочнаяПоЧасам КАК ВтСотрудникиСписочнаяПоЧасам
	|		ПО ВтСотрудникПоПериодам.Сотрудник = ВтСотрудникиСписочнаяПоЧасам.Сотрудник
	|			И ВтСотрудникПоПериодам.Период >= ВтСотрудникиСписочнаяПоЧасам.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСотрудникПоПериодам.Сотрудник,
	|	ВтСотрудникПоПериодам.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВтПериодыДляСотрудников.Сотрудник, //Аверсон 10.10.2022 КВВ СВФР-009547 (закомментировано, иначе двоит Гапанюк)
	|	ВтПериодыДляСотрудников.Сотрудник.Физлицо КАК Физлицо,
	|	ВтПериодыДляСотрудников.Сотрудник.ВидЗанятости КАК ВидЗанятости, //Аверсон 16.10.2022 КВВ СВФР-009547 (пункт 2)
	|	ВтПериодыДляСотрудников.Период,
	|	ВтСотрудникиСписочнаяПоЧасам.РасчетВЧасах,
	
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 (
	|ВЫБОР КОГДА ВтУволенных55.Сотрудник ЕСТЬ NULL 
	|ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|ИНАЧЕ ВтУволенных55.ДатаУвольнения КОНЕЦ КАК ДатаУвольнения
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 )
	
	|ПОМЕСТИТЬ ВтСотрудникиРасчетПоЧасам
	|ИЗ
	|	ВтПериодыДляСотрудников КАК ВтПериодыДляСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиСписочнаяПоЧасам КАК ВтСотрудникиСписочнаяПоЧасам
	|		ПО ВтПериодыДляСотрудников.Сотрудник = ВтСотрудникиСписочнаяПоЧасам.Сотрудник
	|			И ВтПериодыДляСотрудников.ПериодРасчатаПоЧасам = ВтСотрудникиСписочнаяПоЧасам.Период
	
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 (
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенных55 КАК ВтУволенных55
	|ПО ВтПериодыДляСотрудников.Сотрудник = ВтУволенных55.Сотрудник  
	|
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтСотрудники.Сотрудник,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) КАК Период,
	|	ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ГрафикРаботы, ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)) КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВтГрафикиРаботыСотрудники //уже не используется!
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&НачалоПериода, МЕСЯЦ),
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВтСотрудники.Сотрудник
	|					ИЗ
	|						ВтСотрудники)) КАК РаботникиОрганизацийСрезПоследних
	|		ПО ВтСотрудники.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник,
	|	НАЧАЛОПЕРИОДА(&КонецПериода, МЕСЯЦ),
	|	ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ГрафикРаботы, ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка))
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ),
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВтСотрудники.Сотрудник
	|					ИЗ
	|						ВтСотрудники)) КАК РаботникиОрганизацийСрезПоследних
	|		ПО ВтСотрудники.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтСотрудники.Сотрудник,
	|	ЕСТЬNULL(РаботникиОрганизаций.Период, НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)),
	|	ЕСТЬNULL(РаботникиОрганизаций.ГрафикРаботы, ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка))
	|ИЗ
	|	ВтСотрудники КАК ВтСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ВтСотрудники.Сотрудник = РаботникиОрганизаций.Сотрудник
	|			И (РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода)
	|ГДЕ
	|	ЕСТЬNULL(РаботникиОрганизаций.ГрафикРаботы, ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	
	//СВЭЙ 08.04.2024 КВВ СВФР-012143 (
	//|ВЫБРАТЬ
	//|	ВтСотрудникПоПериодам.Сотрудник,
	//|	ВтСотрудникПоПериодам.Период,
	//|	МАКСИМУМ(ВтСотрудникиГрафикиРаботы.Период) КАК ПериодГрафика
	//|ПОМЕСТИТЬ ВтПериодыГрафиковДляСотрудников
	//|ИЗ
	//|	ВтСотрудникПоПериодам КАК ВтСотрудникПоПериодам
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГрафикиРаботыСотрудники КАК ВтСотрудникиГрафикиРаботы
	//|		ПО ВтСотрудникПоПериодам.Сотрудник = ВтСотрудникиГрафикиРаботы.Сотрудник
	//|			И ВтСотрудникПоПериодам.Период >= ВтСотрудникиГрафикиРаботы.Период
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВтСотрудникПоПериодам.Сотрудник,
	//|	ВтСотрудникПоПериодам.Период
	//|;
	//|         
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВтПериодыГрафиковДляСотрудников.Сотрудник,
	//|	ВтПериодыГрафиковДляСотрудников.Сотрудник.Физлицо КАК ФизЛицо,
	//|	ВтПериодыГрафиковДляСотрудников.Период,
	//|	ВтСотрудникиГрафикиРаботы.ГрафикРаботы
	//|ПОМЕСТИТЬ ВтСотрудникиГрафикиРаботы
	//|ИЗ
	//|	ВтПериодыГрафиковДляСотрудников КАК ВтПериодыГрафиковДляСотрудников
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтГрафикиРаботыСотрудники КАК ВтСотрудникиГрафикиРаботы
	//|		ПО ВтПериодыГрафиковДляСотрудников.Сотрудник = ВтСотрудникиГрафикиРаботы.Сотрудник
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	//|	ГрафикиРаботыПоВидамВремени.Месяц,
	//|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК КоличествоЧасов
	//|ПОМЕСТИТЬ ВтПланГрафикаРаботы
	//|ИЗ
	//|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	//|ГДЕ
	//|	ГрафикиРаботыПоВидамВремени.Месяц МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	//|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы В
	//|			(ВЫБРАТЬ
	//|				ВтГрафикиРаботыСотрудники.ГрафикРаботы
	//|			ИЗ
	//|				ВтГрафикиРаботыСотрудники КАК ВтГрафикиРаботыСотрудники)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	//|	ГрафикиРаботыПоВидамВремени.Месяц
	//|;       
	
	|ВЫБРАТЬ
	|ИсторияИзмененияУровней.Сотрудник КАК Сотрудник,
	|ИсторияИзмененияУровней.ГрафикРаботы КАК ГрафикРаботы,
	|ИсторияИзмененияУровней.Период КАК Период
	|ПОМЕСТИТЬ ВТУровни99
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК ИсторияИзмененияУровней
	|ГДЕ
	|ИсторияИзмененияУровней.Период <= &КонецПериода";  
	
	Если ЗначениеЗаполнено(СписокСотрудников) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И ИсторияИзмененияУровней.Сотрудник В (&СписокСотрудников)";
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокСотрудниковИскл) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ ИсторияИзмененияУровней.Сотрудник В (&СписокСотрудниковИскл)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ВТУровни.Сотрудник КАК Сотрудник,
	|МАКСИМУМ(ВТУровни.Период) КАК Период
	|ПОМЕСТИТЬ ВтМаксимальныеПериод99
	|ИЗ ВТУровни99 КАК ВТУровни
	|СГРУППИРОВАТЬ ПО
	|ВТУровни.Сотрудник
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ВТУровни.Сотрудник КАК Сотрудник,
	|ВТУровни1.Период КАК НачалоПериода,
	|МИНИМУМ(ДОБАВИТЬКДАТЕ(ВТУровни.Период, СЕКУНДА, -1)) КАК КонецПериода
	|ПОМЕСТИТЬ ВТПЕРИОДЫ99
	|ИЗ ВТУровни99 КАК ВТУровни
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни99 КАК ВТУровни1
	|ПО ВТУровни.Сотрудник = ВТУровни1.Сотрудник
	|И ВТУровни.Период > ВТУровни1.Период
	|СГРУППИРОВАТЬ ПО
	|ВТУровни.Сотрудник,
	|ВТУровни1.Период 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|ВтМаксимальныеПериод.Сотрудник,
	|ВтМаксимальныеПериод.Период,
	|ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|ИЗ
	|ВтМаксимальныеПериод99 КАК ВтМаксимальныеПериод
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни99 КАК ВТУровни1
	|ПО ВтМаксимальныеПериод.Сотрудник = ВТУровни1.Сотрудник
	|И ВтМаксимальныеПериод.Период = ВТУровни1.Период
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ВТПЕРИОДЫ.Сотрудник КАК Сотрудник, 
	|ВТПЕРИОДЫ.Сотрудник.Физлицо КАК ФизЛицо, 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|НАЧАЛОПЕРИОДА(ВТПЕРИОДЫ.НачалоПериода,МЕСЯЦ) КАК Период,
	//|ВТПЕРИОДЫ.НачалоПериода КАК НачалоПериода,  
	
	|НАЧАЛОПЕРИОДА(
	|ВЫБОР КОГДА (НАЧАЛОПЕРИОДА(ВТПЕРИОДЫ.НачалоПериода,ДЕНЬ) < &НачалоПериода)
	|И (ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) > &КонецПериода ТОГДА
	|&КонецПериода
	|ИНАЧЕ
	|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) 
	|КОНЕЦ) > &НачалоПериода
	|ТОГДА &НачалоПериода
	|ИНАЧЕ ВТПЕРИОДЫ.НачалоПериода
	|КОНЕЦ
	|,МЕСЯЦ) КАК Период,          
	
	|ВЫБОР КОГДА (НАЧАЛОПЕРИОДА(ВТПЕРИОДЫ.НачалоПериода,ДЕНЬ) < &НачалоПериода)
	|И (ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) > &КонецПериода ТОГДА
	|&КонецПериода
	|ИНАЧЕ
	|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) 
	|КОНЕЦ) > &НачалоПериода
	|ТОГДА &НачалоПериода
	|ИНАЧЕ ВТПЕРИОДЫ.НачалоПериода
	|КОНЕЦ КАК НачалоПериода,  
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )  
	
	|ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) > &КонецПериода ТОГДА
	|&КонецПериода
	|ИНАЧЕ
	|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) 
	|КОНЕЦ КАК КонецПериода,
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	//|ВЫБОР КОГДА ВТУровни.ГрафикРаботы.СокращенноеРабочееВремя = ИСТИНА
	//|И ВТУровни.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка) ТОГДА 
	//|ВТУровни.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	//|ИНАЧЕ  
	//|ВТУровни.ГрафикРаботы 
	//|КОНЕЦ КАК ГрафикРаботы
	|ВЫБОР
	|КОГДА ВТУровни.ГрафикРаботы.СокращенноеРабочееВремя = ИСТИНА
	|ТОГДА
	|ВЫБОР
	|КОГДА &ГрафикПолногоРабочегоВремениБезСокращенных = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|ТОГДА
	|ВЫБОР
	|КОГДА ВТУровни.ГрафикРаботы.ГрафикПолногоРабочегоВремени = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|ТОГДА ВТУровни.ГрафикРаботы
	|ИНАЧЕ ВТУровни.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|КОНЕЦ
	|ИНАЧЕ &ГрафикПолногоРабочегоВремениБезСокращенных
	|КОНЕЦ
	|ИНАЧЕ ВТУровни.ГрафикРаботы
	|КОНЕЦ КАК ГрафикРаботы
	//Аверсон СВФР-014142
	
	|ПОМЕСТИТЬ ВтСотрудникиГрафикиРаботы  
	|ИЗ ВТПЕРИОДЫ99 КАК ВТПЕРИОДЫ
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни99 КАК ВТУровни
	|ПО ВТПЕРИОДЫ.Сотрудник = ВТУровни.Сотрудник
	|И ВТПЕРИОДЫ.НачалоПериода = ВТУровни.Период
	|ГДЕ 
	|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) >= &НачалоПериода    
	|;     
	|ВЫБРАТЬ   
	|ВтСотрудникиГрафикиРаботы.Сотрудник КАК Сотрудник, 
	|ВтСотрудникиГрафикиРаботы.Сотрудник.Физлицо КАК ФизЛицо, 
	|ВтСотрудникиГрафикиРаботы.Период           
	|ПОМЕСТИТЬ ВтСотрудникиГрафикиРаботыОбщее
	|ИЗ ВтСотрудникиГрафикиРаботы КАК ВтСотрудникиГрафикиРаботы 
	|СГРУППИРОВАТЬ ПО
	|ВтСотрудникиГрафикиРаботы.Сотрудник, 
	|ВтСотрудникиГрафикиРаботы.Сотрудник.Физлицо, 
	|ВтСотрудникиГрафикиРаботы.Период
	|;
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	|/////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|ВТСотрудникПоПериодам.Сотрудник КАК Сотрудник,
	|ВТСотрудникПоПериодам.Сотрудник.ФизЛицо КАК ФизЛицо,
	|ВТСотрудникПоПериодам.Период КАК Период
	|ПОМЕСТИТЬ ВтСотрудникиГрафикиРаботыОбщееПоМесяцам
	|ИЗ ВТСотрудникПоПериодам
	|;
	|////////////////////////////////////////////////////////
	//Аверсон СВФР-014142
	
	|
	|ВЫБРАТЬ 
	|ВтСотрудникиГрафикиРаботы.Сотрудник,
	|ВтСотрудникиГрафикиРаботы.ФизЛицо,
	|ВтСотрудникиГрафикиРаботы.НачалоПериода КАК НачалоПериода,
	|ВтСотрудникиГрафикиРаботы.КонецПериода,
	|ВтСотрудникиГрафикиРаботы.ГрафикРаботы,
	|СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК КоличествоЧасов,
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	|НАЧАЛОПЕРИОДА(ГрафикиРаботыПоВидамВремени.Дата,МЕСЯЦ) КАК Период
	//Аверсон СВФР-014142
	
	|ПОМЕСТИТЬ ВтПланГрафикаРаботыПоСотрудникам
	|ИЗ ВтСотрудникиГрафикиРаботы
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВтСотрудникиГрафикиРаботы.ГрафикРаботы
	|И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	|
	|ГДЕ ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ВтСотрудникиГрафикиРаботы.НачалоПериода И ВтСотрудникиГрафикиРаботы.КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|ВтСотрудникиГрафикиРаботы.Сотрудник,
	|ВтСотрудникиГрафикиРаботы.ФизЛицо,
	|ВтСотрудникиГрафикиРаботы.НачалоПериода,
	|ВтСотрудникиГрафикиРаботы.КонецПериода,
	|ВтСотрудникиГрафикиРаботы.ГрафикРаботы,
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	|НАЧАЛОПЕРИОДА(ГрафикиРаботыПоВидамВремени.Дата,МЕСЯЦ)
	//Аверсон СВФР-014142
	
	|;    
	|
	|ВЫБРАТЬ     
	|ВтПланГрафикаРаботыПоСотрудникам.Сотрудник,  
	|ВтПланГрафикаРаботыПоСотрудникам.ФизЛицо,
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	//|НАЧАЛОПЕРИОДА(ВтПланГрафикаРаботыПоСотрудникам.НачалоПериода,МЕСЯЦ) КАК Период,
	|НАЧАЛОПЕРИОДА(ВтПланГрафикаРаботыПоСотрудникам.Период,МЕСЯЦ) КАК Период,
	//Аверсон СВФР-014142
	
	|СУММА(ВтПланГрафикаРаботыПоСотрудникам.КоличествоЧасов) КАК КоличествоЧасов
	|ПОМЕСТИТЬ ВтПланГрафикаРаботыПоСотрудникамОбщее
	|ИЗ ВтПланГрафикаРаботыПоСотрудникам 
	|СГРУППИРОВАТЬ ПО
	|ВтПланГрафикаРаботыПоСотрудникам.Сотрудник,   
	|ВтПланГрафикаРаботыПоСотрудникам.ФизЛицо,
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	//|НАЧАЛОПЕРИОДА(ВтПланГрафикаРаботыПоСотрудникам.НачалоПериода,МЕСЯЦ)
	|НАЧАЛОПЕРИОДА(ВтПланГрафикаРаботыПоСотрудникам.Период,МЕСЯЦ)
	//Аверсон СВФР-014142
	
	|;
	
	//СВЭЙ 08.04.2024 КВВ СВФР-012143 )	
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыРасчетовКлассификаторИспользованияРВ.ВидКлассификатора
	|ПОМЕСТИТЬ ВтИсключаемыеВР
	|ИЗ
	|	Справочник.ГруппыРасчетов.КлассификаторИспользованияРВ КАК ГруппыРасчетовКлассификаторИспользованияРВ
	|ГДЕ
	|	ГруппыРасчетовКлассификаторИспользованияРВ.Ссылка = &ГруппаРасчетаИсключаемыхВидовКлассификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтМесяцаОтчета.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|ПОМЕСТИТЬ ВтПериодыСведенияОбИнвалидности
	|ИЗ
	|	ВтМесяцаОтчета КАК ВтМесяцаОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО ВтМесяцаОтчета.Период >= СведенияОбИнвалидностиФизлиц.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбИнвалидностиФизлиц.Физлицо,
	|	ВтМесяцаОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериодыСведенияОбИнвалидности.Период,
	|	ВтПериодыСведенияОбИнвалидности.Физлицо,
	|	ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ) КАК Инвалидность
	|ПОМЕСТИТЬ ВтСведенияОбИнвалидности
	|ИЗ
	|	ВтПериодыСведенияОбИнвалидности КАК ВтПериодыСведенияОбИнвалидности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО ВтПериодыСведенияОбИнвалидности.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И ВтПериодыСведенияОбИнвалидности.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСотрудникПоПериодам.Период,
	|	ВтСотрудникПоПериодам.Сотрудник.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК НеИмеетПравоНаПенсию
	|ПОМЕСТИТЬ ВтЗастрахованные
	|ИЗ
	|	ВтСотрудникПоПериодам КАК ВтСотрудникПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ВтСотрудникПоПериодам.Сотрудник.Физлицо
	|					ИЗ
	|						ВтСотрудникПоПериодам КАК ВтСотрудникПоПериодам)) КАК ГражданствоФизЛицСрезПоследних
	|		ПО ВтСотрудникПоПериодам.Сотрудник.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
	|			И ВтСотрудникПоПериодам.Период = ГражданствоФизЛицСрезПоследних.Период
	
	//СВЭЙ 08.05.2024 КВВ СВФР-012995 (
	|СГРУППИРОВАТЬ ПО   
	|ВтСотрудникПоПериодам.Период,
	|ВтСотрудникПоПериодам.Сотрудник.Физлицо ,
	|ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию, ЛОЖЬ)
	//СВЭЙ 08.05.2024 КВВ СВФР-012995 )
	
	|;
	|
	
	//Аверсон ЕАЕ 11.10.2024 СВФР-013762
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РабочееВремяРаботниковОрганизацийОбороты.Период,
	//|	РабочееВремяРаботниковОрганизацийОбороты.Сотрудник,
	//|	СУММА(РабочееВремяРаботниковОрганизацийОбороты.ЧасовОборот) КАК ФактЧасов,
	//|	РабочееВремяРаботниковОрганизацийОбороты.Организация
	//|ПОМЕСТИТЬ ВтФактГрафикаРаботы
	//|ИЗ
	//|	РегистрНакопления.РабочееВремяРаботниковОрганизаций.Обороты(
	//|			&НачалоПериода,
	//|			&КонецПериода,
	//|			Месяц,
	//|			НЕ ВидИспользованияРабочегоВремени В
	//|						(ВЫБРАТЬ
	//|							ВтИсключаемыеВР.ВидКлассификатора
	//|						ИЗ
	//|							ВтИсключаемыеВР КАК ВтИсключаемыеВР)
	//|				И Сотрудник В
	//|					(ВЫБРАТЬ
	//|						ВтСотрудники.Сотрудник
	//|					ИЗ
	//|						ВтСотрудники КАК ВтСотрудники)
	//|				И Организация = &Организация) КАК РабочееВремяРаботниковОрганизацийОбороты
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РабочееВремяРаботниковОрганизацийОбороты.Период,
	//|	РабочееВремяРаботниковОрганизацийОбороты.Сотрудник,
	//|	РабочееВремяРаботниковОрганизацийОбороты.Организация
	//|;
	
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизацийОбороты.Период, МЕСЯЦ) КАК Период,
	|	РабочееВремяРаботниковОрганизацийОбороты.Сотрудник,
	|	СУММА(РабочееВремяРаботниковОрганизацийОбороты.Часов) КАК ФактЧасов,
	|	РабочееВремяРаботниковОрганизацийОбороты.Организация
	|ПОМЕСТИТЬ ВтФактГрафикаРаботы
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизацийОбороты
	|ГДЕ РабочееВремяРаботниковОрганизацийОбороты.Организация = &Организация
	|И РабочееВремяРаботниковОрганизацийОбороты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|И РабочееВремяРаботниковОрганизацийОбороты.Сотрудник В (ВЫБРАТЬ
	|						                                ВтСотрудники.Сотрудник
	|					                                    ИЗ
	|						                                ВтСотрудники КАК ВтСотрудники)
	|И (НЕ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени В
	|						                                          (ВЫБРАТЬ
	|							                                       ВтИсключаемыеВР.ВидКлассификатора
	|						                                           ИЗ
	|							                                       ВтИсключаемыеВР КАК ВтИсключаемыеВР))
	|И ВЫБОР 
	|  КОГДА &УчитыватьОтработанноеВремяТолькоПоТабелю 
	|  ТОГДА РабочееВремяРаботниковОрганизацийОбороты.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации 
	|  ИНАЧЕ ИСТИНА 
	|  КОНЕЦ							                                       						                                
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизацийОбороты.Период, МЕСЯЦ),
	|	РабочееВремяРаботниковОрганизацийОбороты.Сотрудник,
	|	РабочееВремяРаботниковОрганизацийОбороты.Организация
	|;
	//Аверсон СВФР-013762
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСотрудникиГрафикиРаботы.ФизЛицо,
	|	ВтСотрудникиГрафикиРаботы.Период КАК МесяцОтчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтПланГрафикаРаботы.КоличествоЧасов, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВтФактГрафикаРаботы.ФактЧасов, 0) / ВтПланГрафикаРаботы.КоличествоЧасов
	|	КОНЕЦ КАК СредняяЧисленность,
	|	&Организация,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВтЗастрахованные.НеИмеетПравоНаПенсию, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВтПланГрафикаРаботы.КоличествоЧасов, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ВтФактГрафикаРаботы.ФактЧасов, 0) / ВтПланГрафикаРаботы.КоличествоЧасов
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СредняяЧисленностьЗастрахованных,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ВтСведенияОбИнвалидности.Инвалидность, ЛОЖЬ) = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВтПланГрафикаРаботы.КоличествоЧасов, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ЕСТЬNULL(ВтФактГрафикаРаботы.ФактЧасов, 0) / ВтПланГрафикаРаботы.КоличествоЧасов
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СредняяЧисленностьИнвалидов
	|ПОМЕСТИТЬ ВтДанныеПоЧасам
	|ИЗ                                 
	
	//СВЭЙ 08.04.2024 КВВ СВФР-012143 (
	//|	ВтСотрудникиГрафикиРаботы КАК ВтСотрудникиГрафикиРаботы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПланГрафикаРаботы КАК ВтПланГрафикаРаботы
	//|		ПО ВтСотрудникиГрафикиРаботы.Период = ВтПланГрафикаРаботы.Месяц
	//|			И ВтСотрудникиГрафикиРаботы.ГрафикРаботы = ВтПланГрафикаРаботы.ГрафикРаботы 
	
	//Аверсон ЕАЕ 25.11.2024 СВФР-014142
	//|ВтСотрудникиГрафикиРаботыОбщее КАК ВтСотрудникиГрафикиРаботы
	|ВтСотрудникиГрафикиРаботыОбщееПоМесяцам КАК ВтСотрудникиГрафикиРаботы
	//Аверсон СВФР-014142
	
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ  ВтПланГрафикаРаботыПоСотрудникамОбщее КАК ВтПланГрафикаРаботы
	|ПО ВтСотрудникиГрафикиРаботы.Период = ВтПланГрафикаРаботы.Период
	|И ВтСотрудникиГрафикиРаботы.Сотрудник = ВтПланГрафикаРаботы.Сотрудник 
	|
	//СВЭЙ 08.04.2024 КВВ СВФР-012143 )
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтФактГрафикаРаботы КАК ВтФактГрафикаРаботы
	|		ПО ВтСотрудникиГрафикиРаботы.Период = ВтФактГрафикаРаботы.Период
	|			И ВтСотрудникиГрафикиРаботы.Сотрудник = ВтФактГрафикаРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗастрахованные КАК ВтЗастрахованные
	|		ПО ВтСотрудникиГрафикиРаботы.Период = ВтЗастрахованные.Период
	|			И ВтСотрудникиГрафикиРаботы.ФизЛицо = ВтЗастрахованные.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСведенияОбИнвалидности КАК ВтСведенияОбИнвалидности
	|		ПО ВтСотрудникиГрафикиРаботы.ФизЛицо = ВтСведенияОбИнвалидности.Физлицо
	|			И ВтСотрудникиГрафикиРаботы.Период = ВтСведенияОбИнвалидности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПериодыРаботы.Физлицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	ВЫБОР
	|		КОГДА ПериодыРаботы.ДатаНачала > МесяцыОтчета.МесяцОтчета
	|			ТОГДА ПериодыРаботы.ДатаНачала
	|		ИНАЧЕ МесяцыОтчета.МесяцОтчета
	|	КОНЕЦ КАК ДатаС,
	|	ВЫБОР
	|		КОГДА ПериодыРаботы.ДатаОкончания > КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(МесяцыОтчета.МесяцОтчета, МЕСЯЦ)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ПериодыРаботы.ДатаОкончания, ДЕНЬ)
	|	КОНЕЦ КАК ДатаПо,
	|	ПериодыРаботы.ВидЗанятости КАК ВидЗанятости,
	|	ПериодыРаботы.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПериодыРаботы.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ПериодыРаботы.Организация
	|		ИНАЧЕ ПериодыРаботы.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ПериодыРаботы.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ПериодыРаботы.Должность КАК Должность,
	|	ПериодыРаботы.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ПериодыРаботы.ВидДоговора,
	|	РаспределениеПоВидамДеятельности.НеЕНВД,
	|	РаспределениеПоВидамДеятельности.ЕНВД,
	|	ПериодыРаботы.ТарифнаяСтавкаПервогоРазряда
	|	//МаркерПлана
	|ПОМЕСТИТЬ ПериодыРаботыОбщее
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатаНачала.Физлицо КАК Физлицо,
	|			ДатаНачала.Организация КАК Организация,
	|			ДатаНачала.Период КАК ДатаНачала,
	|			МИНИМУМ(ЕСТЬNULL(ДатыОкончания.Период, &КонецПериода)) КАК ДатаОкончания,
	|			ДатаНачала.ВидЗанятости КАК ВидЗанятости,
	|			ДатаНачала.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|			ДатаНачала.Должность КАК Должность,
	|			ДатаНачала.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|			ДатаНачала.ВидДоговора КАК ВидДоговора,
	|			ДатаНачала.ТарифнаяСтавкаПервогоРазряда КАК ТарифнаяСтавкаПервогоРазряда
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|				РаботникиОрганизаций.ОбособленноеПодразделение КАК Организация,
	|				РаботникиОрганизаций.Период КАК Период,
	|				РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
	|				РаботникиОрганизаций.Организация КАК ГоловнаяОрганизация,
	|				РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|				РаботникиОрганизаций.Должность КАК Должность,
	|				РаботникиОрганизаций.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|				РаботникиОрганизаций.Сотрудник.ВидДоговора КАК ВидДоговора,
	|				РаботникиОрганизаций.Сотрудник.ТипРаботника КАК ТипРаботника,
	|				РаботникиОрганизаций.ТарифнаяСтавкаПервогоРазряда КАК ТарифнаяСтавкаПервогоРазряда";
	Если ЗначениеЗаполнено(СвойствоОбьектов) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда 
		Запрос.Текст = Запрос.Текст + " 
		|	ИЗ
		|(ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение) КАК ВложенныйЗапрос
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ПО (РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Объект)";
	иначе
		Запрос.Текст = Запрос.Текст + " 
		
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " 
	
	|			ГДЕ
	|				РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ИСТИНА
	|			{ГДЕ
	|				РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				РаботникиОрганизаций.Сотрудник.Физлицо,
	|				РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения,
	|				РаботникиОрганизаций.ПериодЗавершения,
	|				РаботникиОрганизаций.Сотрудник.ВидЗанятости,
	|				РаботникиОрганизаций.Организация,
	|				РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения,
	|				РаботникиОрганизаций.ДолжностьЗавершения,
	|				РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения,
	|				РаботникиОрганизаций.Сотрудник.ВидДоговора,
	|				РаботникиОрганизаций.Сотрудник.ТипРаботника,
	|				РаботникиОрганизаций.ТарифнаяСтавкаПервогоРазряда
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодаПерекрытия
	|					ПО РаботникиОрганизаций.Сотрудник = ПериодаПерекрытия.Сотрудник
	|						И РаботникиОрганизаций.Организация = ПериодаПерекрытия.Организация
	|						И РаботникиОрганизаций.Период < ПериодаПерекрытия.Период
	|						И РаботникиОрганизаций.ПериодЗавершения >= ПериодаПерекрытия.Период";
	Если ЗначениеЗаполнено(СвойствоОбьектов) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда 
		Запрос.Текст = Запрос.Текст + " 
		
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение) КАК ВложенныйЗапрос
		|ПО РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Объект";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " 
	|			ГДЕ
	|				РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				И РаботникиОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|				И ПериодаПерекрытия.Сотрудник ЕСТЬ NULL 
	|				И ИСТИНА
	|			{ГДЕ
	|				РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				РаботникиОрганизаций.Сотрудник.Физлицо,
	|				ВЫБОР
	|					КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|						ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
	|					ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
	|				КОНЕЦ,
	|				ВЫБОР
	|					КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|						ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
	|					ИНАЧЕ РаботникиОрганизаций.Период
	|				КОНЕЦ,
	|				РаботникиОрганизаций.Сотрудник.ВидЗанятости,
	|				РаботникиОрганизаций.Организация,
	|				ВЫБОР
	|					КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|						ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
	|					ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
	|				КОНЕЦ,
	|				ВЫБОР
	|					КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|						ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
	|					ИНАЧЕ РаботникиОрганизаций.Должность
	|				КОНЕЦ,
	|				ВЫБОР
	|					КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|						ТОГДА РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения
	|					ИНАЧЕ РаботникиОрганизаций.ЗанимаемыхСтавок
	|				КОНЕЦ,
	|				РаботникиОрганизаций.Сотрудник.ВидДоговора,
	|				РаботникиОрганизаций.Сотрудник.ТипРаботника,
	|				РаботникиОрганизаций.ТарифнаяСтавкаПервогоРазряда
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, -1) {(&НачалоПериода)}, ИСТИНА) КАК РаботникиОрганизаций";
	Если ЗначениеЗаполнено(СвойствоОбьектов) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда 
		Запрос.Текст = Запрос.Текст + " 
		
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение) КАК ВложенныйЗапрос
		|ПО РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Объект";
		
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 19.11.2021 КВВ СВФР-008395 (
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенныхЗаПрогулы КАК ВтУволенныхЗаПрогулы
	|ПО РаботникиОрганизаций.Сотрудник = ВтУволенныхЗаПрогулы.Сотрудник 
	//Аверсон 19.11.2021 КВВ СВФР-008395 )
	
	|			ГДЕ
	|			( //Аверсон 19.11.2021 КВВ СВФР-008395
	|				ВЫБОР
	|						КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|							ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
	|						ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
	|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//Аверсон 19.11.2021 КВВ СВФР-008395 (
	|ИЛИ (
	|ВЫБОР
	|КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|И РаботникиОрганизаций.ПериодЗавершения < &НачалоПериода
	|ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
	|ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
	|КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|И НЕ ВтУволенныхЗаПрогулы.Сотрудник ЕСТЬ NULL
	|И НЕ ВтУволенныхЗаПрогулы.ДатаДок < &НачалоПериода 
	|))
	
	//Аверсон 19.11.2021 КВВ СВФР-008395 )
	|				И РаботникиОрганизаций.Организация = &Организация //Аверсон 07.08.2020 КВВ СВФР-006400
	|				И ИСТИНА
	|			{ГДЕ
	|				РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}) КАК ДатаНачала
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|					РаботникиОрганизаций.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|					ВЫБОР
	|						КОГДА РаботникиОрганизаций.Период <> ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА ВЫБОР
	|									КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|										ТОГДА 
	//Аверсон 21.09.2021 КВВ СВФР-008154 (
	|ВЫБОР КОГДА РаботникиОрганизаций.Регистратор В (ВЫБРАТЬ ВтУволенныхЗаПрогулы.Док ИЗ ВтУволенныхЗаПрогулы)
	|ТОГДА КОНЕЦПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1), ДЕНЬ),МЕСЯЦ)
	|ИНАЧЕ 
	//Аверсон 21.09.2021 КВВ СВФР-008154 )
	|											КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1), ДЕНЬ)
	|КОНЕЦ
	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, СЕКУНДА, -1)
	|								КОНЕЦ
	|						ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ КАК Период,
	|					РаботникиОрганизаций.Организация КАК ГоловнаяОрганизация
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|				ГДЕ
	|					РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|					И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|					И ВЫБОР
	|							КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|								ТОГДА 
	//Аверсон 21.09.2021 КВВ СВФР-008154 (
	|ВЫБОР КОГДА РаботникиОрганизаций.Регистратор В (ВЫБРАТЬ ВтУволенныхЗаПрогулы.Док ИЗ ВтУволенныхЗаПрогулы)
	|ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1),МЕСЯЦ)
	|ИНАЧЕ 
	//Аверсон 21.09.2021 КВВ СВФР-008154 )
	|								ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, ДЕНЬ, -1)
	|КОНЕЦ
	|							ИНАЧЕ РаботникиОрганизаций.Период
	|						КОНЕЦ <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|					И ИСТИНА
	|					И РаботникиОрганизаций.Сотрудник.ВидЗанятости В(&ВидЗанятостиОсновнаяВнешняя)
	|				{ГДЕ
	|					РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}
	|				
	|				ОБЪЕДИНИТЬ ВСЕ
	|				
	|				ВЫБРАТЬ
	|					РаботникиОрганизаций.Сотрудник.Физлицо,
	|					РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения,
	|					ВЫБОР
	|						КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.ПериодЗавершения, ДЕНЬ, -1), ДЕНЬ)
	|						ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|					КОНЕЦ,
	|					РаботникиОрганизаций.Организация
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|						ПО РаботникиОрганизаций.Сотрудник = ПериодыПерекрытия.Сотрудник
	|							И РаботникиОрганизаций.Организация = ПериодыПерекрытия.Организация
	|							И РаботникиОрганизаций.Период < ПериодыПерекрытия.Период
	|							И РаботникиОрганизаций.ПериодЗавершения > ПериодыПерекрытия.Период
	|				ГДЕ
	|					РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И РаботникиОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|					И ВЫБОР
	|							КОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|								ТОГДА 
	//Аверсон 21.09.2021 КВВ СВФР-008154 (
	|ВЫБОР КОГДА РаботникиОрганизаций.Регистратор В (ВЫБРАТЬ ВтУволенныхЗаПрогулы.Док ИЗ ВтУволенныхЗаПрогулы)
	|ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.ПериодЗавершения, ДЕНЬ, -1),МЕСЯЦ)
	|ИНАЧЕ 
	//Аверсон 21.09.2021 КВВ СВФР-008154 )
	|									ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
	|КОНЕЦ
	|							ИНАЧЕ РаботникиОрганизаций.ПериодЗавершения
	|						КОНЕЦ <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|					И ПериодыПерекрытия.Сотрудник ЕСТЬ NULL 
	|					И ИСТИНА
	|					И РаботникиОрганизаций.Сотрудник.ВидЗанятости В(&ВидЗанятостиОсновнаяВнешняя)
	|				{ГДЕ
	|					РаботникиОрганизаций.Организация.* КАК ГоловнаяОрганизация}) КАК ДатыОкончания
	|				ПО ДатаНачала.Физлицо = ДатыОкончания.Физлицо
	|					И ДатаНачала.Период < ДатыОкончания.Период
	|					И ДатаНачала.ГоловнаяОрганизация = ДатыОкончания.ГоловнаяОрганизация
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК Физлицо
	|	ИЗ
	|		РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|	ГДЕ
	|		РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо) КАК табель
	|	ПО ДатаНачала.Физлицо = табель.Физлицо
	|		ГДЕ
	|			ДатаНачала.ВидЗанятости В(&ВидЗанятостиОсновнаяВнешняя) 
	|			И ДатаНачала.ТипРаботника <> &НесписочныйСостав
	|			И ДатаНачала.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) //Аверсон 09.08.2021 КВВ СВФР-007971
	
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|			И НЕ ((
	|			ДатаНачала.Физлицо, 
	|           ДатаНачала.Должность, //СВЭЙ 12.10.2023 КВВ СВФР-011608
	|			ДатаНачала.ПодразделениеОрганизации)  
	|			В (ВЫБРАТЬ 
	|			ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.ФизЛицо, 
	|			ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.Должность, //СВЭЙ 12.10.2023 КВВ СВФР-011608
	|			ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица.ПодразделениеОрганизации 
	|			ИЗ ВтСотрудникиОбщиеИСКЛЮЧИТЬДубльФизЛица)) 
	//Аверсон 26.08.2021 КВВ СВФР-008015 ) //СВЭЙ 12.10.2023 КВВ СВФР-011608
	
	|		{ГДЕ
	|			ДатаНачала.ПодразделениеОрганизации.*,
	|			ДатаНачала.Организация.* КАК Организация,
	|			ДатаНачала.ГоловнаяОрганизация.*,
	|			ДатаНачала.Должность.*,
	|			ДатаНачала.ВидЗанятости.*,
	|			ДатаНачала.Физлицо.*}
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДатаНачала.Физлицо,
	|			ДатаНачала.Организация,
	|			ДатаНачала.Период,
	|			ДатаНачала.ВидЗанятости,
	|			ДатаНачала.ПодразделениеОрганизации,
	|			ДатаНачала.Должность,
	|			ДатаНачала.ЗанимаемыхСтавок,
	|			ДатаНачала.ВидДоговора,
	|			ДатаНачала.ТарифнаяСтавкаПервогоРазряда) КАК ПериодыРаботы
	|		ПО МесяцыОтчета.Дата >= ПериодыРаботы.ДатаНачала
	|			И МесяцыОтчета.Дата <= ПериодыРаботы.ДатаОкончания";
	
	//Аверсон 10.12.2021 КВВ СВФР-008463 (
	Если ЗначениеЗаполнено(СписокСЭ_МестаРаботы) Тогда
		Запрос.Текст = Запрос.Текст + "
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода) КАК РОСП
		|		ПО ПериодыРаботы.Физлицо = РОСП.Сотрудник.ФизЛицо
		|";
	КонецЕсли;
	//Аверсон 10.12.2021 КВВ СВФР-008463 )
	
	Запрос.Текст = Запрос.Текст + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА НЕ ЕСНОсновныеНачисления.ОблагаетсяЕНВД
	|						ТОГДА ЕСНОсновныеНачисления.Результат
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК НеЕНВД,
	|			СУММА(ВЫБОР
	|					КОГДА ЕСНОсновныеНачисления.ОблагаетсяЕНВД
	|						ТОГДА ЕСНОсновныеНачисления.Результат
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЕНВД,
	|			ЕСНОсновныеНачисления.ФизЛицо КАК ФизЛицо,
	|			ЕСНОсновныеНачисления.ОбособленноеПодразделение КАК Организация,
	|			ЕСНОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ЕСНОсновныеНачисления.ФизЛицо КАК ФизЛицо,
	|				ЕСНОсновныеНачисления.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|				ЕСНОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|				ЛОЖЬ КАК ОблагаетсяЕНВД,
	|				ЕСНОсновныеНачисления.Результат КАК Результат
	|			ИЗ
	|				РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|			ГДЕ
	|				ЕСНОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ЕСНДополнительныеНачисления.ФизЛицо,
	|				ЕСНДополнительныеНачисления.ОбособленноеПодразделение,
	|				ЕСНДополнительныеНачисления.ПериодРегистрации,
	|				ЛОЖЬ,
	|				ЕСНДополнительныеНачисления.Результат
	|			ИЗ
	|				РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления
	|			ГДЕ
	|				ЕСНДополнительныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода) КАК ЕСНОсновныеНачисления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕСНОсновныеНачисления.ФизЛицо,
	|			ЕСНОсновныеНачисления.ОбособленноеПодразделение,
	|			ЕСНОсновныеНачисления.ПериодРегистрации) КАК РаспределениеПоВидамДеятельности
	|		ПО МесяцыОтчета.МесяцОтчета = РаспределениеПоВидамДеятельности.ПериодРегистрации
	|			И (ПериодыРаботы.Физлицо = РаспределениеПоВидамДеятельности.ФизЛицо)
	|			И (ПериодыРаботы.Организация = РаспределениеПоВидамДеятельности.Организация)
	|ГДЕ
	|	ПериодыРаботы.ВидЗанятости В(&ВидЗанятостиОсновнаяВнешняя)
	//	|	И ПериодыРаботык.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Практикант) //Аверсон 09.08.2021 КВВ СВФР-007971
	|	И ПериодыРаботы.Организация = &Организация"; //Аверсон 10.08.2020 КВВ СВФР-006400
	Если ЗначениеЗаполнено(ПодразделенияОрганизации) Тогда 
		Запрос.Текст = Запрос.Текст + " И ПериодыРаботы.ПодразделениеОрганизации В Иерархии(&ПодразделениеОрганизации)";
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодразделенияОрганизацииИскл) Тогда 
		Если СокрЛП(Организация.ИНН) = "806000046" Тогда
			Запрос.Текст = Запрос.Текст + " И не ПериодыРаботы.ПодразделениеОрганизации В (&ПодразделениеОрганизацииИскл)";  //Аверсон 25.04.2019 КВВ СВФР-004287
		Иначе
			Запрос.Текст = Запрос.Текст + " И не ПериодыРаботы.ПодразделениеОрганизации В Иерархии (&ПодразделениеОрганизацииИскл)"; 
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон 19.12.2019 КВВ СВФР-005230 (
	Если ЗначениеЗаполнено(СписокФизЛиц) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И ПериодыРаботы.Физлицо В (&СписокФизЛиц)";
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокФизЛицИскл) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ ПериодыРаботы.Физлицо В (&СписокФизЛицИскл)";
	КонецЕсли;
	//Аверсон 19.12.2019 КВВ СВФР-005230 )
	
	//Аверсон 10.12.2021 КВВ СВФР-008463 (
	Если ЗначениеЗаполнено(СписокСЭ_МестаРаботы) Тогда
		Запрос.Текст = Запрос.Текст + "
		|И РОСП.ауМестоРаботы В (&СписокСЭ_МестаРаботы)";
	КонецЕсли;
	//Аверсон 10.12.2021 КВВ СВФР-008463 )
	
	
	Запрос.Текст = Запрос.Текст + "
	|{ГДЕ
	|	МесяцыОтчета.МесяцОтчета,
	|	ПериодыРаботы.ВидЗанятости.*,
	|	ПериодыРаботы.Организация.* КАК Организация,
	|	ПериодыРаботы.Физлицо.*,
	|	ПериодыРаботы.ПодразделениеОрганизации.*,
	|	ПериодыРаботы.Должность.*,
	|	МесяцыОтчета.Дата,
	|	(ВЫБОР
	|			КОГДА ПериодыРаботы.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА ПериодыРаботы.Организация
	|			ИНАЧЕ ПериодыРаботы.Организация.ГоловнаяОрганизация
	|		КОНЕЦ).* КАК ГоловнаяОрганизация,
	|	ПериодыРаботы.ЗанимаемыхСтавок,
	|	РаспределениеПоВидамДеятельности.НеЕНВД,
	|	РаспределениеПоВидамДеятельности.ЕНВД}
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыРаботыОбщее.Физлицо,
	|	МАКСИМУМ(ПериодыРаботыОбщее.Дата) КАК Дата,
	|	ПериодыРаботыОбщее.МесяцОтчета
	|ПОМЕСТИТЬ ВтПериодРаботыМаксДаты
	|ИЗ
	|	ПериодыРаботыОбщее КАК ПериодыРаботыОбщее
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыРаботыОбщее.Физлицо,
	|	ПериодыРаботыОбщее.МесяцОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыРаботыОбщее.Физлицо,
	|	ПериодыРаботыОбщее.Дата,
	|	ПериодыРаботыОбщее.МесяцОтчета,
	|	ПериодыРаботыОбщее.ДатаС,
	|	ПериодыРаботыОбщее.ДатаПо,
	|	ПериодыРаботыОбщее.ВидЗанятости,
	|	ПериодыРаботыОбщее.Организация,
	|	ПериодыРаботыОбщее.ГоловнаяОрганизация,
	|	ПериодыРаботыОбщее.ПодразделениеОрганизации,
	|	ПериодыРаботыОбщее.Должность,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВтСотрудникиРасчетПоЧасам.РасчетВЧасах, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ПериодыРаботыОбщее.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	ПериодыРаботыОбщее.ВидДоговора,
	|	ПериодыРаботыОбщее.НеЕНВД,
	|	ПериодыРаботыОбщее.ЕНВД,
	|	ПериодыРаботыОбщее.ТарифнаяСтавкаПервогоРазряда,
	|	Ложь КАК РасчетПоЧасам
	//Аверсон 19.11.2021 КВВ СВФР-008395 (
	//|ПОМЕСТИТЬ ПериодыРаботы
	|ПОМЕСТИТЬ ПериодыРаботы00
	//Аверсон 19.11.2021 КВВ СВФР-008395 )
	|ИЗ
	|	ПериодыРаботыОбщее КАК ПериодыРаботыОбщее
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиРасчетПоЧасам КАК ВтСотрудникиРасчетПоЧасам
	|		ПО ПериодыРаботыОбщее.МесяцОтчета = ВтСотрудникиРасчетПоЧасам.Период
	|			И ПериодыРаботыОбщее.Физлицо = ВтСотрудникиРасчетПоЧасам.Физлицо
	
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 (
	|ГДЕ 
	|ВЫБОР КОГДА ВтСотрудникиРасчетПоЧасам.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|ТОГДА ИСТИНА
	|ИНАЧЕ 
	|НАЧАЛОПЕРИОДА(ВтСотрудникиРасчетПоЧасам.ДатаУвольнения,ДЕНЬ) >= НАЧАЛОПЕРИОДА(ПериодыРаботыОбщее.Дата,ДЕНЬ)
	|КОНЕЦ
	//СВЭЙ 18.01.2024 КВВ СВФР-012157 )
	|И ЕСТЬNULL(ВтСотрудникиРасчетПоЧасам.РасчетВЧасах, ЛОЖЬ) = ЛОЖЬ //СВЭЙ 25.06.2024 КВВ СВФР-013177
	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтПериодРаботыМаксДаты.Физлицо,
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|	ВтПериодРаботыМаксДаты.Дата,
	|ПериодыРаботыОбщее.Дата,
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|	ВтПериодРаботыМаксДаты.МесяцОтчета,
	|	ПериодыРаботыОбщее.ДатаС,
	|	ПериодыРаботыОбщее.ДатаПо,
	|	ПериодыРаботыОбщее.ВидЗанятости,
	|	ПериодыРаботыОбщее.Организация,
	|	ПериодыРаботыОбщее.ГоловнаяОрганизация,
	|	ПериодыРаботыОбщее.ПодразделениеОрганизации,
	|	ПериодыРаботыОбщее.Должность,
	|	ВтДанныеПоЧасам.СредняяЧисленность,
	|	ПериодыРаботыОбщее.ВидДоговора,
	|	ПериодыРаботыОбщее.НеЕНВД,
	|	ПериодыРаботыОбщее.ЕНВД,
	|	ПериодыРаботыОбщее.ТарифнаяСтавкаПервогоРазряда,
	|	Истина
	|ИЗ
	|	ВтПериодРаботыМаксДаты КАК ВтПериодРаботыМаксДаты
	|		Левое СОЕДИНЕНИЕ ПериодыРаботыОбщее КАК ПериодыРаботыОбщее
	|		ПО ВтПериодРаботыМаксДаты.Физлицо = ПериодыРаботыОбщее.Физлицо
	//|			И ВтПериодРаботыМаксДаты.Дата = ПериодыРаботыОбщее.Дата //СВЭЙ 25.06.2024 КВВ СВФР-013177 (закомментировано)
	|			И ВтПериодРаботыМаксДаты.МесяцОтчета = ПериодыРаботыОбщее.МесяцОтчета
	|		Левое СОЕДИНЕНИЕ ВтДанныеПоЧасам КАК ВтДанныеПоЧасам
	|		ПО ВтПериодРаботыМаксДаты.МесяцОтчета = ВтДанныеПоЧасам.МесяцОтчета
	|			И ВтПериодРаботыМаксДаты.Физлицо = ВтДанныеПоЧасам.ФизЛицо
	|		Левое СОЕДИНЕНИЕ ВтСотрудникиРасчетПоЧасам КАК ВтСотрудникиРасчетПоЧасам
	|		ПО ВтПериодРаботыМаксДаты.Физлицо = ВтСотрудникиРасчетПоЧасам.Физлицо
	|			И ВтПериодРаботыМаксДаты.МесяцОтчета = ВтСотрудникиРасчетПоЧасам.Период
	|ГДЕ
	|	ЕСТЬNULL(ВтСотрудникиРасчетПоЧасам.РасчетВЧасах, ЛОЖЬ) = ИСТИНА
	|	И ВтСотрудникиРасчетПоЧасам.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство) //Аверсон 16.10.2022 КВВ СВФР-009547 (пункт 2)
	|;
	|
	
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 5) (
	////Аверсон 19.11.2021 КВВ СВФР-008395 (
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ *
	//|ПОМЕСТИТЬ ПериодыРаботы
	//|ИЗ ПериодыРаботы00 КАК ПериодыРаботы00
	//|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенныхЗаПрогулы КАК ВтУволенныхЗаПрогулы
	//|ПО ПериодыРаботы00.ФизЛицо = ВтУволенныхЗаПрогулы.Сотрудник.ФизЛицо      
	//|ГДЕ
	//|ВЫБОР КОГДА ВтУволенныхЗаПрогулы.Сотрудник ЕСТЬ NULL
	//|ТОГДА ИСТИНА
	//|ИНАЧЕ НЕ ПериодыРаботы00.Дата > ВтУволенныхЗаПрогулы.ДатаДок
	//|КОНЕЦ
	//|;
	////Аверсон 19.11.2021 КВВ СВФР-008395 )
	|ВЫБРАТЬ *, 
	|ВЫБОР КОГДА ВтУволенныхЗаПрогулы.Сотрудник ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//ПериодыРаботы00.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы00.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ
	|ВтУволенныхЗаПрогулы.ЗанимаемыхСтавок 
	|КОНЕЦ КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ПериодыРаботы
	|ИЗ ПериодыРаботы00 КАК ПериодыРаботы00
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтУволенныхЗаПрогулы КАК ВтУволенныхЗаПрогулы
	|ПО ПериодыРаботы00.ФизЛицо = ВтУволенныхЗаПрогулы.Сотрудник.ФизЛицо  
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая КАК ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая
	|ПО ПериодыРаботы00.ФизЛицо = ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо
	|И ПериодыРаботы00.Дата МЕЖДУ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ДатаНачала И ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ДатаОкончания
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|И ПериодыРаботы00.ЗанимаемыхСтавок = ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок //СВЭЙ 08.05.2024 КВВ СВФР-012995
	
	|ГДЕ
	|ВЫБОР КОГДА ВтУволенныхЗаПрогулы.Сотрудник ЕСТЬ NULL
	|ТОГДА ИСТИНА
	|ИНАЧЕ НЕ ПериодыРаботы00.Дата > ВтУволенныхЗаПрогулы.ДатаДок
	|КОНЕЦ
	|;
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 5) )
	
	|////////////////////////////////////////////////////////////////////////////////	
	//Аверсон 13.12.2019 КВВ СВФР-005013 (
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ 
	|НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, ДЕНЬ) КАК ДатаКалендаряН,
	|КОНЕЦПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК ДатаКалендаря
	|ПОМЕСТИТЬ ВрТабДаты
	|ИЗ  РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|СведенияОбИнвалидностиФизлиц.ФизЛицо КАК ФизЛицо,
	|СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности,
	|СведенияОбИнвалидностиФизлиц.Инвалидность КАК Инвалидность,
	|СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|ВрТабДаты.ДатаКалендаряН КАК ДатаКалендаряН,
	|ВрТабДаты.ДатаКалендаря КАК ДатаКалендаря  
	|ПОМЕСТИТЬ ВТИнвалидПоМес
	|ИЗ  РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабДаты КАК ВрТабДаты
	|ПО СведенияОбИнвалидностиФизлиц.Период <= ВрТабДаты.ДатаКалендаряН
	|ГДЕ СведенияОбИнвалидностиФизлиц.Период 
	|В
	|(ВЫБРАТЬ ПЕРВЫЕ 1
	|СОИФЛ.Период
	|ИЗ  РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СОИФЛ
	|ГДЕ СОИФЛ.Период <= ВрТабДаты.ДатаКалендаря
	|И СОИФЛ.ФизЛицо = СведенияОбИнвалидностиФизлиц.ФизЛицо
	|УПОРЯДОЧИТЬ ПО
	|	СОИФЛ.Период УБЫВ)  
	|И 
	|СведенияОбИнвалидностиФизлиц.Инвалидность";
	
	//Аверсон 15.04.2022 КВВ СВФР-008958 (
	Если ВызовИзКакогоОтчета = "4фонд" Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И (СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = ""II"" ИЛИ СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = ""I"")";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 15.04.2022 КВВ СВФР-008958 )
	
	|	И (СведенияОбИнвалидностиФизлиц.СрокДействияСправки = ДАТАВРЕМЯ(1,1,1,0,0,0) ИЛИ
	|СведенияОбИнвалидностиФизлиц.СрокДействияСправки >= ВрТабДаты.ДатаКалендаряН)
	|;";
	//Аверсон 13.12.2019 КВВ СВФР-005013 )
	
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 (
	Если ВызовИзКакогоОтчета = "4фонд" Тогда
		Запрос.Текст = Запрос.Текст + " 
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|СведенияОбИнвалидностиФизлиц.ФизЛицо КАК ФизЛицо,
		|СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности,
		|СведенияОбИнвалидностиФизлиц.Инвалидность КАК Инвалидность,
		|СведенияОбИнвалидностиФизлиц.Период КАК Период,
		|ВрТабДаты.ДатаКалендаряН КАК ДатаКалендаряН,
		|ВрТабДаты.ДатаКалендаря КАК ДатаКалендаря  
		|ПОМЕСТИТЬ ВТИнвалидПоМесГруппаИнвалидности3
		|ИЗ  РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВрТабДаты КАК ВрТабДаты
		|ПО СведенияОбИнвалидностиФизлиц.Период <= ВрТабДаты.ДатаКалендаряН
		|ГДЕ СведенияОбИнвалидностиФизлиц.Период 
		|В
		|(ВЫБРАТЬ ПЕРВЫЕ 1
		|СОИФЛ.Период
		|ИЗ  РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СОИФЛ
		|ГДЕ СОИФЛ.Период <= ВрТабДаты.ДатаКалендаря
		|И СОИФЛ.ФизЛицо = СведенияОбИнвалидностиФизлиц.ФизЛицо
		|УПОРЯДОЧИТЬ ПО
		|СОИФЛ.Период УБЫВ)  
		|И 
		|СведенияОбИнвалидностиФизлиц.Инвалидность
		|И (СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = ""III"")  
		|И (СведенияОбИнвалидностиФизлиц.СрокДействияСправки = ДАТАВРЕМЯ(1,1,1,0,0,0) ИЛИ
		|СведенияОбИнвалидностиФизлиц.СрокДействияСправки >= ВрТабДаты.ДатаКалендаряН)
		|;";
	КонецЕсли;  
	
	Запрос.Текст = Запрос.Текст + "
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 )
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Табель.Физлицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	Табель.Организация
	|ПОМЕСТИТЬ ПериодыОтсутсвияСреднеСписочной
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
	|		РегламентированныйПроизводственныйКалендарь.ВидДня КАК ВидДня
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|			РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			РабочееВремяРаботниковОрганизаций.Период КАК Период,
	|			РабочееВремяРаботниковОрганизаций.Организация КАК Организация
	|		ИЗ
	|			РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ГДЕ
	|			РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
	|			И НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод) КАК Табель
	
	//Аверсон 01.12.2019 КВВ СВФР-005143 (
	//|	ПО ВЫБОР КОГДА МесяцыОтчета.ВидДня = ЗНАЧЕНИЕ(перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
	//|		ТОГДА  ДОБАВИТЬКДАТЕ(МесяцыОтчета.Дата, ДЕНЬ, -1) = Табель.Период
	//|	КОГДА МесяцыОтчета.ВидДня = ЗНАЧЕНИЕ(перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
	//|		ТОГДА  ДОБАВИТЬКДАТЕ(МесяцыОтчета.Дата, ДЕНЬ, -2) = Табель.Период
	//|	ИНАЧЕ МесяцыОтчета.Дата = Табель.Период
	//|	КОНЕЦ
	| ПО МесяцыОтчета.Дата = Табель.Период
	//Аверсон 01.12.2019 КВВ СВФР-005143 )
	|{ГДЕ
	|	МесяцыОтчета.МесяцОтчета,
	|	МесяцыОтчета.Дата}
	|;
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	
	/////////////////////////////////////////////////////////
	//ОТПУСК В ПРАЗДНИК
	//Если сотрудник был в отпуске в праздник, этот день входит в среднесписочную 
	|ВЫБРАТЬ
	|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ПОМЕСТИТЬ ВТПраздники
	|ИЗ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|			И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)
	|;
	|////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|СостоянияРаботниковОрганизацийСрез.Сотрудник.ФизЛицо КАК ФизЛицо,
	|СостоянияРаботниковОрганизацийСрез.Состояние,
	|СостоянияРаботниковОрганизацийСрез.Организация,
	|&НачалоПериода КАК ДатаНачала,
	|ВЫБОР
	|КОГДА СостоянияРаботниковОрганизацийСрез.ПериодЗавершения = ДатаВремя(1,1,1)
	|ТОГДА КОНЕЦПЕРИОДА(&КонецПериода,ДЕНЬ)
	|ИНАЧЕ
	|	ВЫБОР
	|	КОГДА СостоянияРаботниковОрганизацийСрез.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|	ТОГДА СостоянияРаботниковОрганизацийСрез.ПериодЗавершения
	|	ИНАЧЕ КОНЕЦПЕРИОДА(&КонецПериода,ДЕНЬ)
	|	КОНЕЦ 
	|КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСостояния 
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&НачалоПериода) КАК СостоянияРаботниковОрганизацийСрез
	|ГДЕ (СостоянияРаботниковОрганизацийСрез.ПериодЗавершения = ДатаВремя(1,1,1) ИЛИ 
	|	СостоянияРаботниковОрганизацийСрез.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода ИЛИ 
	|	СостоянияРаботниковОрганизацийСрез.ПериодЗавершения > &КонецПериода)
	|	И (СостоянияРаботниковОрганизацийСрез.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный) 
	|   ИЛИ СостоянияРаботниковОрганизацийСрез.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть))
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|СостоянияРаботниковОрганизаций.Сотрудник.ФизЛицо,
	|СостоянияРаботниковОрганизаций.Состояние,
	|СостоянияРаботниковОрганизаций.Организация,
	|СостоянияРаботниковОрганизаций.Период КАК ДатаНачала,
	|ВЫБОР
	|КОГДА СостоянияРаботниковОрганизаций.ПериодЗавершения = ДатаВремя(1,1,1)
	|ТОГДА &КонецПериода
	|ИНАЧЕ
	|	ВЫБОР
	|	КОГДА СостоянияРаботниковОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода
	|	ТОГДА СостоянияРаботниковОрганизаций.ПериодЗавершения
	|	ИНАЧЕ &КонецПериода
	|	КОНЕЦ 
	|КОНЕЦ КАК ДатаОкончания
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостоянияРаботниковОрганизаций
	|ГДЕ СостоянияРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (СостоянияРаботниковОрганизаций.ПериодЗавершения = ДатаВремя(1,1,1) ИЛИ 
	|	СостоянияРаботниковОрганизаций.ПериодЗавершения МЕЖДУ &НачалоПериода И &КонецПериода ИЛИ 
	|	СостоянияРаботниковОрганизаций.ПериодЗавершения > &КонецПериода)
	|	И (СостоянияРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный) 
	|   ИЛИ СостоянияРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть))
	|;
	|////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТСостояния.ФизЛицо,
	|	ВТПраздники.ДатаКалендаря КАК Дата,
	|	НАЧАЛОПЕРИОДА(ВТПраздники.ДатаКалендаря,МЕСЯЦ) КАК МесяцОтчета,
	|	ВТСостояния.Организация
	|ПОМЕСТИТЬ ВТОтпускВПраздник
	|ИЗ ВТПраздники
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостояния
	|ПО ВТПраздники.ДатаКалендаря МЕЖДУ ВТСостояния.ДатаНачала И ВТСостояния.ДатаОкончания
	|;
	|////////////////////////////////////////////////////////////////////////
	//ОТПУСК В ПРАЗДНИК
	/////////////////////////////////////////////////////////////////////////
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Табель.Физлицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	Табель.Организация
	//|ПОМЕСТИТЬ ПериодыПрисутствияСреднеСписочной
	|ПОМЕСТИТЬ ПериодыПрисутствияСреднеСписочнойБезПраздников
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
	|		РегламентированныйПроизводственныйКалендарь.ВидДня КАК ВидДня
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|			РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			РабочееВремяРаботниковОрганизаций.Период КАК Период,
	|			РабочееВремяРаботниковОрганизаций.Организация КАК Организация
	|		ИЗ
	|			РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ГДЕ
	|			НЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
	
	//Аверсон ЕАЕ 05.11.2025 СВФР-017038
	|           И НЕ РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность)
	//Аверсон СВФР-017038
	
	|			И НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод) КАК Табель
	
	| ПО МесяцыОтчета.Дата = Табель.Период
	|{ГДЕ
	|	МесяцыОтчета.МесяцОтчета,
	|	МесяцыОтчета.Дата}
	|;
	|//////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыПрисутствияСреднеСписочнойБезПраздников.ФизЛицо,
	|	ПериодыПрисутствияСреднеСписочнойБезПраздников.Дата,
	|	ПериодыПрисутствияСреднеСписочнойБезПраздников.МесяцОтчета,
	|	ПериодыПрисутствияСреднеСписочнойБезПраздников.Организация
	|ПОМЕСТИТЬ ПериодыПрисутствияСреднеСписочной
	|ИЗ ПериодыПрисутствияСреднеСписочнойБезПраздников
	|
	//Добавляем праздничные дни, в которые сотрудники были в отпуске
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТОтпускВПраздник.ФизЛицо,
	|	ВТОтпускВПраздник.Дата,
	|	ВТОтпускВПраздник.МесяцОтчета,
	|	ВТОтпускВПраздник.Организация
	|ИЗ ВТОтпускВПраздник
	|;
	//Аверсон СВФР-015415
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 6) (
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
	|МесяцыОтчета.Дата КАК Дата,
	|МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
	|ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
	|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
	|ПОМЕСТИТЬ ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно
	|ИЗ
	|(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|ИЗ
	|РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета";
	
	Если НЕ НачисленияПоПериодуДействия Тогда  //Аверсон 02.05.2022 КВВ СВФР-008814
		Запрос.Текст = Запрос.Текст + "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|ГДЕ
		|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
		|И ОсновныеНачисленияРаботниковОрганизаций.Сторно = ИСТИНА";
		//Аверсон 02.05.2022 КВВ СВФР-008814 (
	Иначе
		Запрос.Текст = Запрос.Текст + "
		//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		//|ГДЕ
		//|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		//|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		//|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
		//|И ОсновныеНачисленияРаботниковОрганизаций.Сторно = ИСТИНА
		
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ПО (МесяцыОтчета.Дата МЕЖДУ 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало 
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА 
		|НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ
		|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
		|КОНЕЦ
		|И 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА 
		|КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ
		|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
		|КОНЕЦ
		|)
		|ГДЕ
		|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
		|И ОсновныеНачисленияРаботниковОрганизаций.Сторно = ИСТИНА
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|И
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|КОНЕЦ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 02.05.2022 КВВ СВФР-008814 )	
	|;
	|
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 6) )
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
	|ПОМЕСТИТЬ ОтсутсвияСреднеСписочнойРегистрРасчета
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета ";
	
	Если НЕ НачисленияПоПериодуДействия Тогда  //Аверсон 02.05.2022 КВВ СВФР-008814
		Запрос.Текст = Запрос.Текст + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)";
		//Аверсон 02.05.2022 КВВ СВФР-008814 (
	Иначе
		Запрос.Текст = Запрос.Текст + "
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|		ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		//|ГДЕ
		//|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		//|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		//|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ПО (МесяцыОтчета.Дата МЕЖДУ 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало 
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
		|КОНЕЦ
		|И 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
		|КОНЕЦ
		|)
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСреднесписочная)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)
		//	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|И
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|КОНЕЦ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 02.05.2022 КВВ СВФР-008814 )
	
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 6) (
	|И НЕ ((ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо, 
	|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета, 
	|МесяцыОтчета.Дата, 
	|МесяцыОтчета.МесяцОтчета)
	|В 
	|(ВЫБРАТЬ ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно.ФизЛицо, 
	|ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно.ВидРасчета, 
	|ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно.Дата, 
	|ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно.МесяцОтчета 
	|ИЗ ОтсутсвияСреднеСписочнойРегистрРасчетаТолькоСторно))	
	//Аверсон 13.12.2021 КВВ СВФР-008410 (пункт 6) )
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Табель.Физлицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	Табель.Организация
	|ПОМЕСТИТЬ ПериодыОтсутсвияСписочной
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
	|		РегламентированныйПроизводственныйКалендарь.ВидДня КАК ВидДня
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета
	//О.Т. Аверсон 26.04.2018 № 1860
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочееВремяРаботниковОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|			РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|			РабочееВремяРаботниковОрганизаций.Период КАК Период,
	|			РабочееВремяРаботниковОрганизаций.Организация КАК Организация
	|		ИЗ
	|			РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ГДЕ
	|			РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРВСписочная)
	|			И НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод) КАК Табель
	|	ПО ВЫБОР КОГДА МесяцыОтчета.ВидДня = ЗНАЧЕНИЕ(перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
	|		ТОГДА ДОБАВИТЬКДАТЕ(МесяцыОтчета.Дата, ДЕНЬ, -1) = Табель.Период
	|	КОГДА МесяцыОтчета.ВидДня = ЗНАЧЕНИЕ(перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
	|		ТОГДА ДОБАВИТЬКДАТЕ(МесяцыОтчета.Дата, ДЕНЬ, -2) = Табель.Период
	|	ИНАЧЕ МесяцыОтчета.Дата = Табель.Период
	|	КОНЕЦ
	//О.Т. Аверсон 26.04.2018 № 1860
	|{ГДЕ
	|	МесяцыОтчета.МесяцОтчета,
	|	МесяцыОтчета.Дата}
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
	|	МесяцыОтчета.Дата КАК Дата,
	|	МесяцыОтчета.МесяцОтчета КАК МесяцОтчета,
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
	|ПОМЕСТИТЬ ОтсутсвияСписочнойРегистрРасчета  //ДУБЛЬ В РАСШИФРОВКЕ !!!
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцОтчета,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата
	|	ИЗ
	|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода) КАК МесяцыОтчета ";
	Если НЕ НачисленияПоПериодуДействия Тогда  //Аверсон 02.05.2022 КВВ СВФР-008814
		Запрос.Текст = Запрос.Текст + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСписочная)";
		//Аверсон 02.05.2022 КВВ СВФР-008814 (
	Иначе
		Запрос.Текст = Запрос.Текст + "
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|		ПО (МесяцыОтчета.Дата МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		//|ГДЕ
		//|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		//|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСписочная)
		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ПО (МесяцыОтчета.Дата МЕЖДУ 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало 
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
		|КОНЕЦ
		|И 
		//ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,МЕСЯЦ)
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
		|КОНЕЦ
		|)
		|ГДЕ
		| ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В(&ВидИспользованияРВСписочная)
		//	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|И
		|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.УчитыватьПоПериодуРегистрацииДля12т = ИСТИНА
		|ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|КОНЕЦ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 02.05.2022 КВВ СВФР-008814 )
	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	//ВидДеятельностиНеУдалятьДляТаблицы7";
	
	//Аверсон 28.11.2019 КВВ СВФР-005129 (
	Если Расшифровка Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ПериодыРаботы.Физлицо, 
		|	ПериодыРаботы.ПодразделениеОрганизации, ";
		
		//Аверсон 01.03.2022 КВВ СВФР-008462 (
		Если РасшифровкаПоПолуКатегории Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ПериодыРаботы.Физлицо.Пол КАК Пол, 
			|	ПериодыРаботы.Должность.КатегорияСтатистическогоУчета КАК КатегорияСтатистическогоУчета, ";
		КонецЕсли;
		//Аверсон 01.03.2022 КВВ СВФР-008462 )
		
		//Аверсон 11.11.2022 КВВ СВФР-009750 (
		Если РасшифровкаПоДолжности Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ПериодыРаботы.Должность КАК ДолжностьСотрудника, ";
		КонецЕсли;
		//Аверсон 11.11.2022 КВВ СВФР-009750 )
		
	КонецЕсли;   
	//Аверсон 28.11.2019 КВВ СВФР-005129 )
	
	Запрос.Текст = Запрос.Текст + " 
	//Аверсон 03.12.2019 КВВ СВФР-005143 (
	|	ВЫБОР КОГДА &Знаков = 1 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,1)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 2 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,2)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 3 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,3)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 4 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	|	ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)   
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )	
	
	|)КАК ЧИСЛО(10,4)) 
	|	ИНАЧЕ //&Знаков = 0
	|		СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|		КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )  
	
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ   
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	|) 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ
	//Аверсон 03.12.2019 КВВ СВФР-005143 )
	|	КАК СреднесписочнаяЧисленность1,
	|
	//Аверсон 18.09.2020 КВВ СВФР-006347 (
	|	ВЫБОР КОГДА &Знаков = 1 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(         
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.Врачи123)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,1)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 2 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.Врачи123)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,2)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 3 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.Врачи123)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,3))
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 4 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.Врачи123)
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,4)) 
	|	ИНАЧЕ //&Знаков = 0
	|		СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|		КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.Врачи123)
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|) 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ
	|	КАК СреднесписочнаяЧисленность1Врачи,
	//Аверсон 18.09.2020 КВВ СВФР-006347 )
	
	//Аверсон 27.05.2021 КВВ СВФР-007625 (
	|	ВЫБОР КОГДА &Знаков = 1 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.МедРаб124)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)   
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,1)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 2 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(  
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.МедРаб124)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,2)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 3 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL) 
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.МедРаб124)
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)      
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,3)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 4 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.МедРаб124)
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,4)) 
	|	ИНАЧЕ //&Знаков = 0
	|		СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|		КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		И (НЕ ПериодыРаботы.Должность.Категория ЕСТЬ NULL И ПериодыРаботы.Должность.Категория.МедРаб124)
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)   
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|) 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ
	|	КАК СреднесписочнаяЧисленность1МедРаб,
	//Аверсон 27.05.2021 КВВ СВФР-007625 )
	|
	|	СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР
	|			КОГДА (ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ НЕ NULL 
	|			ИЛИ ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ НЕ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|           И ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL
	//Аверсон СВФР-015415
	
	|					ИЛИ ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ НЕ NULL 
	|				ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|) 
	|КАК НеВключаетсяВСреднеСписочнуюЧисленность,
	|
	
	//ЖЕНЩИНЫ
	
	//Аверсон 13.12.2019 КВВ СВФР-005013 (
	|	ВЫБОР КОГДА &Знаков = 1 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(    
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА 
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ВЫБОР
	|КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|ТОГДА
	//Аверсон СВФР-014959
	
	|ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ИНАЧЕ 0
	|КОНЕЦ
	//Аверсон СВФР-014959
	
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)    
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,1)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 2 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА 
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ВЫБОР
	|КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|ТОГДА
	//Аверсон СВФР-014959
	
	|ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ИНАЧЕ 0
	|КОНЕЦ
	//Аверсон СВФР-014959
	
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,2)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 3 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА 
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ВЫБОР
	|КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|ТОГДА
	//Аверсон СВФР-014959
	
	|ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ИНАЧЕ 0
	|КОНЕЦ
	//Аверсон СВФР-014959
	
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,3)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 4 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(  
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА 
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ВЫБОР
	|КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|ТОГДА
	//Аверсон СВФР-014959
	
	|ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ИНАЧЕ 0
	|КОНЕЦ
	//Аверсон СВФР-014959
	
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,4)) 
	|	ИНАЧЕ //&Знаков = 0
	|		СУММА(  
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА 
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ВЫБОР
	|КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|ТОГДА
	//Аверсон СВФР-014959
	
	|ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	
	//Аверсон ЕАЕ 19.02.2025 СВФР-014959
	|ИНАЧЕ 0
	|КОНЕЦ
	//Аверсон СВФР-014959
	
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|		КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	|) 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ
	| КАК СреднесписочнаяЧисленностьЖенщин,
	
	//ЖЕНЩИНЫ
	
	|
	//ИНВАЛИДЫ (
	|	ВЫБОР КОГДА &Знаков = 1 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)    
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,1)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 2 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,2)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 3 ТОГДА
	|	ВЫРАЗИТЬ(СУММА( 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|	И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|   ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ)
	|	И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|	ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ /
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )	
	
	|)КАК ЧИСЛО(10,3)) 
	|	ИНАЧЕ 
	|	ВЫБОР КОГДА &Знаков = 4 ТОГДА
	|	ВЫРАЗИТЬ(СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|	КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL) 
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ)
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)    
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|)КАК ЧИСЛО(10,4)) 
	|	ИНАЧЕ //&Знаков = 0
	|		СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР 
	|		КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
	|		И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|       ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
	//Аверсон СВФР-015415
	
	|		И ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.Инвалидность, ЛОЖЬ)
	|		И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
	|		ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|	ИНАЧЕ 0
	|	КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)   
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|) 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ 
	|	КОНЕЦ
	| КАК СредняяЧисленностьИнвалидов,
	|";
	//ИНВАЛИДЫ )
	//Аверсон 13.12.2019 КВВ СВФР-005013 )
	
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 (
	Если ВызовИзКакогоОтчета = "4фонд" Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ВЫБОР КОГДА &Знаков = 1 ТОГДА
		|ВЫРАЗИТЬ(СУММА(
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|ИНАЧЕ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|ВЫБОР 
		|КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
		|И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
		
		//Аверсон ЕАЕ 21.05.2025 СВФР-015415
		|ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
		//Аверсон СВФР-015415
		
		|И ЕСТЬNULL(СведенияОбИнвалидностиФизлицГруппаИнвалидности3.Инвалидность, ЛОЖЬ)
		|И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
		|ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
		|ТОГДА 
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
		|ИНАЧЕ 
		|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ / 
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|КОНЕЦ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|)КАК ЧИСЛО(10,1)) 
		|ИНАЧЕ 
		|ВЫБОР КОГДА &Знаков = 2 ТОГДА
		|ВЫРАЗИТЬ(СУММА(    
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|ИНАЧЕ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|ВЫБОР 
		|КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
		|И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
		
		//Аверсон ЕАЕ 21.05.2025 СВФР-015415
		|ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
		//Аверсон СВФР-015415
		
		|И ЕСТЬNULL(СведенияОбИнвалидностиФизлицГруппаИнвалидности3.Инвалидность, ЛОЖЬ)
		|И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
		|ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
		|ТОГДА 
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
		|ИНАЧЕ 
		|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ / 
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|КОНЕЦ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|)КАК ЧИСЛО(10,2)) 
		|ИНАЧЕ 
		|ВЫБОР КОГДА &Знаков = 3 ТОГДА
		|ВЫРАЗИТЬ(СУММА(  
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|ИНАЧЕ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|ВЫБОР 
		|КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
		|И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
		
		//Аверсон ЕАЕ 21.05.2025 СВФР-015415
		|ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
		//Аверсон СВФР-015415
		
		|И ЕСТЬNULL(СведенияОбИнвалидностиФизлицГруппаИнвалидности3.Инвалидность, ЛОЖЬ)
		|И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
		|ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
		|ТОГДА 
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
		|ИНАЧЕ 
		|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ /
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)    
		|КОНЕЦ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|)КАК ЧИСЛО(10,3)) 
		|ИНАЧЕ 
		|ВЫБОР КОГДА &Знаков = 4 ТОГДА
		|ВЫРАЗИТЬ(СУММА(
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|ИНАЧЕ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|ВЫБОР 
		|КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
		|И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
		
		//Аверсон ЕАЕ 21.05.2025 СВФР-015415
		|ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
		//Аверсон СВФР-015415
		
		|И ЕСТЬNULL(СведенияОбИнвалидностиФизлицГруппаИнвалидности3.Инвалидность, ЛОЖЬ)
		|И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
		|ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
		|ТОГДА 
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
		|ИНАЧЕ 
		|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ / 
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)  
		|КОНЕЦ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|)КАК ЧИСЛО(10,4)) 
		|ИНАЧЕ //&Знаков = 0
		|СУММА(
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
		|ИНАЧЕ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|ВЫБОР 
		|КОГДА ((ПериодыОтсутсвияСреднеСписочной.Физлицо ЕСТЬ NULL
		|И ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL)
		
		//Аверсон ЕАЕ 21.05.2025 СВФР-015415
		|ИЛИ НЕ ПериодыПрисутствияСреднеСписочной.Физлицо ЕСТЬ NULL)
		//Аверсон СВФР-015415
		
		|И ЕСТЬNULL(СведенияОбИнвалидностиФизлицГруппаИнвалидности3.Инвалидность, ЛОЖЬ)
		|И ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря ЕСТЬ NULL
		|ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
		|ТОГДА 
		|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
		|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
		|ИНАЧЕ 
		|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ / 
		
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
		//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
		|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
		|КОНЕЦ
		//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
		
		|) 
		|КОНЕЦ 
		|КОНЕЦ 
		|КОНЕЦ 
		|КОНЕЦ
		|КАК СредняяЧисленностьИнвалидовГруппаИнвалидности3,
		|";	
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 )
	
	|		//ТарифнаяСтавкаЗамена //!!! НЕ УДАЛЯТЬ
	|	СУММА(
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам //уже рассчитаны исключения из ср.спис. в при расчете факта и нормы часов, повторно не исключаем
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок/ 
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|ИНАЧЕ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|ВЫБОР
	|			КОГДА ПериодыОтсутсвияСписочной.Физлицо ЕСТЬ NULL 
	|					И ОтсутсвияСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL 
	|					И ПоУходуЗаРебенкомДляСписочной.ДатаКалендаря ЕСТЬ NULL 
	|					И РАЗНОСТЬДАТ(ПериодыРаботы.Физлицо.ДатаРождения, &КонецПериода, ГОД) < 18
	|				ТОГДА //ПериодыРаботы.ЗанимаемыхСтавок
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ФизЛицо ЕСТЬ NULL
	|ТОГДА 
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	//|ПериодыРаботы.ЗанимаемыхСтавок
	|ВЫБОР КОГДА ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо ЕСТЬ NULL
	|ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|ИНАЧЕ 
	|ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|ИНАЧЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.ЗанимаемыхСтавок
	|КОНЕЦ
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	|			ИНАЧЕ 0
	|		КОНЕЦ / 
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (
	//|ВЫБОР КОГДА ПериодыРаботы.РасчетПоЧасам Тогда (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), Месяц) + 1) Иначе(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) Конец
	|(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) 
	|КОНЕЦ
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 )
	
	|) 
	| КАК СреднееДо18,
	|
	|СУММА(ВЫБОР
	|	КОГДА ПериодыОтсутсвияСписочной.Физлицо ЕСТЬ NULL 
	|			И ОтсутсвияСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL 
	|			И ПоУходуЗаРебенкомДляСписочной.ДатаКалендаря ЕСТЬ NULL 
	|		ТОГДА 1 //ПериодыРаботы.ЗанимаемыхСтавок //О.Т. Аверсон 26.04.2018 № 1860
	|	ИНАЧЕ 0
	|КОНЕЦ / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) ) 
	|КАК СписочнаяЧисленность,
	|
	|СУММА(ВЫБОР
	|	КОГДА ПериодыОтсутсвияСписочной.Физлицо ЕСТЬ НЕ NULL 
	|			ИЛИ ОтсутсвияСписочнойРегистрРасчета.Физлицо ЕСТЬ НЕ NULL
	|			ИЛИ ПоУходуЗаРебенкомДляСписочной.ДатаКалендаря ЕСТЬ НЕ NULL 
	|		ТОГДА ПериодыРаботы.ЗанимаемыхСтавок
	|	ИНАЧЕ 0
	|КОНЕЦ / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1) ) КАК НеВключаетсяВСписочнуюЧисленность,
	|Сумма(ВЫБОР
	|	КОГДА ПериодыРаботы.Физлицо.Пол = ЗНАЧЕНИЕ(перечисление.ПолФизическихЛиц.Женский)
	|		ТОГДА ВЫБОР
	|				КОГДА ПериодыОтсутсвияСписочной.Физлицо ЕСТЬ NULL 
	|						И ОтсутсвияСписочнойРегистрРасчета.Физлицо ЕСТЬ NULL 
	|						И ПоУходуЗаРебенкомДляСписочной.ДатаКалендаря ЕСТЬ NULL 
	|					ТОГДА 1 //ПериодыРаботы.ЗанимаемыхСтавок //О.Т. Аверсон 26.04.2018 № 1860
	|				ИНАЧЕ 0
	|			КОНЕЦ / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ), ДЕНЬ) + 1)
	|КОНЕЦ) 
	|КАК СписочнаяЧисленностьЖенщин
	|{ВЫБРАТЬ
	|	СреднесписочнаяЧисленность1,
	|	НеВключаетсяВСреднеСписочнуюЧисленность,
	|	СписочнаяЧисленность,
	|	НеВключаетсяВСписочнуюЧисленность}
	|ИЗ
	|	ПериодыРаботы КАК ПериодыРаботы
	//Аверсон 26.08.2021 КВВ СВФР-008015 (
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица КАК ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица
	|		ПО ПериодыРаботы.Физлицо = ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛица.Физлицо
	//Аверсон 26.08.2021 КВВ СВФР-008015 )
	
	//Аверсон 10.10.2022 КВВ СВФР-009547 (
	|ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая КАК ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая
	|ПО ПериодыРаботы.ФизЛицо = ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ФизЛицо
	|И ПериодыРаботы.Дата МЕЖДУ ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ДатаНачала И ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.ДатаОкончания
	//Аверсон 10.10.2022 КВВ СВФР-009547 )
	
	|И ПериодыРаботы.Сотрудник1 = ВтСотрудникиОбщиеВКЛЮЧИТЬДубльФизЛицаДругая_Вторая.Сотрудник //СВЭЙ 08.05.2024 КВВ СВФР-012995
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОтсутсвияСреднеСписочной КАК ПериодыОтсутсвияСреднеСписочной
	|		ПО ПериодыРаботы.Физлицо = ПериодыОтсутсвияСреднеСписочной.Физлицо
	|			И ПериодыРаботы.Дата = ПериодыОтсутсвияСреднеСписочной.Дата
	
	//Аверсон ЕАЕ 21.05.2025 СВФР-015415
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыПрисутствияСреднеСписочной КАК ПериодыПрисутствияСреднеСписочной
	|		ПО ПериодыРаботы.Физлицо = ПериодыПрисутствияСреднеСписочной.Физлицо
	|			И ПериодыРаботы.Дата = ПериодыПрисутствияСреднеСписочной.Дата
	//Аверсон СВФР-015415
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтсутсвияСреднеСписочнойРегистрРасчета КАК ОтсутсвияСреднеСписочнойРегистрРасчета
	|		ПО ПериодыРаботы.Физлицо = ОтсутсвияСреднеСписочнойРегистрРасчета.Физлицо
	|			И ПериодыРаботы.Дата = ОтсутсвияСреднеСписочнойРегистрРасчета.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|		ИЗ
	|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|					&КонецПериода,
	|					ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = &ОбозначениеВТабеле
	|						И ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (&ВидИспользованияРВСреднесписочная)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|				ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ,-1))
	|		ГДЕ
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо) КАК ПоУходуЗаРебенкомДляСреднесписочной
	|		ПО ПериодыРаботы.Физлицо = ПоУходуЗаРебенкомДляСреднесписочной.ФизЛицо
	|			И ПериодыРаботы.Дата = ПоУходуЗаРебенкомДляСреднесписочной.ДатаКалендаря
	|   ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|		ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|	ИЗ
	|		РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|				&КонецПериода,
	|				ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = &ОбозначениеВТабеле
	|					И ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени В (&ВидИспользованияРВСписочная)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|			ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период И ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ, -1))
	|	ГДЕ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|		ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо) КАК ПоУходуЗаРебенкомДляСписочной //ДУБЛЬ В РАСШИФРОВКЕ !!!
	|	ПО ПериодыРаботы.Физлицо = ПоУходуЗаРебенкомДляСписочной.ФизЛицо
	|		И ПериодыРаботы.Дата = ПоУходуЗаРебенкомДляСписочной.ДатаКалендаря  
	
	//Аверсон 13.12.2019 КВВ СВФР-005013 (
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалидПоМес КАК СведенияОбИнвалидностиФизлиц
	|ПО ПериодыРаботы.Физлицо = СведенияОбИнвалидностиФизлиц.ФизЛицо
	|И ПериодыРаботы.Дата = СведенияОбИнвалидностиФизлиц.ДатаКалендаряН";
	//Аверсон 13.12.2019 КВВ СВФР-005013 )
	
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 (
	Если ВызовИзКакогоОтчета = "4фонд" Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалидПоМесГруппаИнвалидности3 КАК СведенияОбИнвалидностиФизлицГруппаИнвалидности3
		|ПО ПериодыРаботы.Физлицо = СведенияОбИнвалидностиФизлицГруппаИнвалидности3.ФизЛицо
		|И ПериодыРаботы.Дата = СведенияОбИнвалидностиФизлицГруппаИнвалидности3.ДатаКалендаряН
		|";
	КонецЕсли;   
	Запрос.Текст = Запрос.Текст + "
	//СВЭЙ 23.04.2024 КВВ СВФР-012911 )
	
	|ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОтсутсвияСписочной КАК ПериодыОтсутсвияСписочной
	|	ПО ПериодыРаботы.Физлицо = ПериодыОтсутсвияСписочной.Физлицо
	|		И ПериодыРаботы.Дата = ПериодыОтсутсвияСписочной.Дата
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОтсутсвияСписочнойРегистрРасчета КАК ОтсутсвияСписочнойРегистрРасчета
	|	ПО ПериодыРаботы.Физлицо = ОтсутсвияСписочнойРегистрРасчета.Физлицо
	|		И ПериодыРаботы.Дата = ОтсутсвияСписочнойРегистрРасчета.Дата
	
	|ГДЕ
	|	ПериодыРаботы.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)";
	
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (закомментировано) (
	////СВЭЙ 08.05.2024 КВВ СВФР-012995 (
	//Если ЗначениеЗаполнено(СписокСотрудников) Тогда 
	//	Запрос.Текст = Запрос.Текст + "
	//	|	И ПериодыРаботы.Сотрудник1 В (&СписокСотрудников)"; 
	//КонецЕсли;
	//СВЭЙ 25.06.2024 КВВ СВФР-013177 (закомментировано) )
	
	Запрос.Текст = Запрос.Текст + "
	////СВЭЙ 08.05.2024 КВВ СВФР-012995 )
	
	|{ГДЕ
	|	ПериодыРаботы.Физлицо.*,
	|	ПериодыРаботы.Дата,
	|	ПериодыРаботы.МесяцОтчета,
	|	ПериодыРаботы.ВидЗанятости.*,
	|	ПериодыРаботы.Организация.*,
	|	ПериодыРаботы.ГоловнаяОрганизация.*,
	|	ПериодыРаботы.ПодразделениеОрганизации.*,
	|	ПериодыРаботы.Должность.*,
	|	ПериодыРаботы.ВидДоговора,
	|	(ИСТИНА) КАК ВыборкаЕсть}";
	
	//|	//ГруппировкаСтавки";
	
	//Аверсон 28.11.2019 КВВ СВФР-005129 (
	Если Расшифровка Тогда
		Запрос.Текст = Запрос.Текст + "
		|	СГРУППИРОВАТЬ ПО    
		|	//ГруппировкаСтавки   //Аверсон 24.02.2020 КВВ СВФР-005573
		|	ПериодыРаботы.Физлицо,
		|	ПериодыРаботы.ПодразделениеОрганизации";
		
		//Аверсон 01.03.2022 КВВ СВФР-008462 (
		Если РасшифровкаПоПолуКатегории Тогда
			Запрос.Текст = Запрос.Текст + "
			|,
			|	ПериодыРаботы.Физлицо.Пол, 
			|	ПериодыРаботы.Должность.КатегорияСтатистическогоУчета ";
		КонецЕсли;
		//Аверсон 01.03.2022 КВВ СВФР-008462 )
		
		//Аверсон 11.11.2022 КВВ СВФР-009750 (
		Если РасшифровкаПоДолжности Тогда
			Запрос.Текст = Запрос.Текст + "
			|,
			|	ПериодыРаботы.Должность ";
		КонецЕсли;
		//Аверсон 11.11.2022 КВВ СВФР-009750 )
		
		
	КонецЕсли;
	//Аверсон 28.11.2019 КВВ СВФР-005129 )	
	Запрос.УстановитьПараметр("ВидЗанятостиОсновнаяВнешняя", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
	Запрос.УстановитьПараметр("ВидЗанятостиВнутренняя", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	СреднесписочнаяНеВклСписок = Новый СписокЗначений;
	Для Каждого стр из СреднесписочнаяНеВкл.КлассификаторИспользованияРВ Цикл 
		СреднесписочнаяНеВклСписок.Добавить(стр.ВидКлассификатора);
	КонецЦикла;
	
	СписочнаяНеВклСписок = Новый СписокЗначений;
	Для Каждого стр из СписочнаяНеВкл.КлассификаторИспользованияРВ Цикл 
		СписочнаяНеВклСписок.Добавить(стр.ВидКлассификатора);
	КонецЦикла;
	Запрос.УстановитьПараметр("ВидИспользованияРВСреднесписочная", СреднесписочнаяНеВклСписок);
	Запрос.УстановитьПараметр("ВидИспользованияРВСписочная", СписочнаяНеВклСписок);//О.Т. Аверсон 12.12.2016 № 92
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодОтчета));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОтчета1));
	Запрос.УстановитьПараметр("ОбозначениеВТабеле", Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделенияОрганизации);
	Запрос.УстановитьПараметр("ПодразделениеОрганизацииИскл", ПодразделенияОрганизацииИскл);
	Запрос.УстановитьПараметр("НесписочныйСостав", Перечисления.ТипыРаботников.НесписочныйСостав);
	Запрос.УстановитьПараметр("Свойство", СвойствоОбьектов);
	Запрос.УстановитьПараметр("Значение", ЗначениеСвойства);
	
	//Аверсон 03.12.2019 КВВ СВФР-005143 (
	ЗнаковПослеЗапятой = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(КонецМесяца(ПериодОтчета1), 
	Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ОкруглениеСреднесписочной)).Размер;
	ЗнаковПослеЗапятой = ?(Не ЗначениеЗаполнено(ЗнаковПослеЗапятой),0,ЗнаковПослеЗапятой);
	
	Запрос.УстановитьПараметр("Знаков",ЗнаковПослеЗапятой);
	//Аверсон 03.12.2019 КВВ СВФР-005143 )
	Запрос.УстановитьПараметр("ВидУчетаВремени",Перечисления.ВидыУчетаВремени.ПоЧасам);
	Запрос.УстановитьПараметр("ГруппаРасчетаИсключаемыхВидовКлассификаторов",СреднесписочнаяНеВкл);
	
	
	Возврат Запрос;	
	
	//Аверсон 23.01.2022 КВВ СВФР-008462 (перенесено из отчета 12т  общий модуль) )
КонецФункции
