////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение(ПостроительЗапроса = Неопределено) Экспорт
	
	СписокПустыхНомеровПФР = Новый СписокЗначений;
	//толик сделал брать пустые номера
	//СписокПустыхНомеровПФР.Добавить("");
	//СписокПустыхНомеровПФР.Добавить("              ");
	//исзенил запрос без учета кадровых перемещений
	СписокПустыхНомеровПФР.Добавить("Ч");
	//
	
	СписокПричин = Новый СписокЗначений;
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.Увольнение);
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.Перемещение);
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",                ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Организация",                Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("СписокПустыхНомеровПФР",        СписокПустыхНомеровПФР);
	Запрос.УстановитьПараметр("Увольнение",        СписокПричин);
	
	//Аверсон ЕАЕ 10.04.2022 СВФР-008855
	//Запрос.УстановитьПараметр("ДатаНачала" ,         НачалоКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("ДатаНачала" ,         ДатаНачала);
	
	//толик увольнение дата + 1 день                
	//Запрос.УстановитьПараметр("ДатаАктуальности" ,     КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("ДатаАктуальности" ,     ДатаОкончания);
	//Аверсон СВФР-008855
	
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" ,     Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" ,     Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" ,     Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	Запрос.УстановитьПараметр("ТипТелефон" ,     Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипАдрес" ,     Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.НайтиПоКоду("112"));
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	Запрос.УстановитьПараметр("ВидДоговора" , Перечисления.ВидыДоговоровСФизЛицами.Подряда);
	
	СписокПодразделений = ТаблицаПодразделений.ВыгрузитьКолонку("ИсключаемоеПодразделение");
	Запрос.УстановитьПараметр("СписокПодразделений" , СписокПодразделений);
	Запрос.УстановитьПараметр("ВыбранноеПодразделение" , ПодразделениеОрганизации);	 //Аверсон 09.09.2019 КВВ СВФР-004742
	
	//Аверсон ЕАЕ 22.02.2022
	//Запрос.УстановитьПараметр("НачалоПервогоДняСледующегоКвартала", НачалоДня(КонецКвартала(ДатаРегистрации) + 1));
	//Запрос.УстановитьПараметр("КонецПервогоДняСледующегоКвартала", КонецДня(КонецКвартала(ДатаРегистрации) + 1));
	Запрос.УстановитьПараметр("НачалоПервогоДняСледующегоКвартала", НачалоДня(КонецДня(ДатаОкончания) + 1));
	Запрос.УстановитьПараметр("КонецПервогоДняСледующегоКвартала", КонецДня(КонецДня(ДатаОкончания) + 1));
	//Аверсон
	
	//Аверсон ЕАЕ 15.09.2022 СВФР-009493
	Запрос.УстановитьПараметр("Прием", Прием);
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала(ДатаРегистрации));
	//Аверсон СВФР-009493
	
	если не НеВклДогПодряда тогда 
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|    ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|    ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|    ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|    АдресаРегистрации.Поле1 КАК ИндексРегистрации,
		|    АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
		|    ДомашниеТелефоны.Поле3 КАК Телефоны,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
		|    СписокФизлиц.Регистратор КАК Документ,
		|    СписокФизлиц.ФизЛицо,
		|    СписокФизлиц.ФизЛицо.Пол КАК Пол,
		|    СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|    СписокФизлиц.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|    СписокФизлиц.ФизЛицо.МестоРождения КАК МестоРождения,
		|    ВЫБОР
		|        КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
		|                ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
		|            ТОГДА &СтранаПоУмолчанию
		|        ИНАЧЕ ГражданствоФизЛиц.Страна
		|    КОНЕЦ КАК Гражданство,
		|    СписокФизлиц.Период КАК Период,
		|    ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
		|	 Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.Совместительство) тогда 1 иначе 0 конец как ВнешнееСовместительство,
		|	 Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство) тогда 1 иначе 0 конец как ВнутреннееСовместительство, //Аверсон 20.08.2019 КВВ СВФР-004658
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		|	 СписокФизлиц.Разряд КАК Разряд,
		|	 СписокФизлиц.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	 СписокФизлиц.Сотрудник КАК Сотрудник
		//Аверсон СВФР-007679
		|ИЗ                                                                                                                                                
		|    (ВЫБРАТЬ
		|        РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|        РаботникиОрганизаций.Регистратор КАК Регистратор,
		|        РаботникиОрганизаций.Период КАК Период,
		|        ВЫБОР
		|            КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|                ТОГДА 0
		|            ИНАЧЕ 1
		|        КОНЕЦ КАК Сортировка,
		|		РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		|        РаботникиОрганизаций.РазрядЕТС КАК Разряд,
		|		 РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		 РаботникиОрганизаций.Сотрудник КАК Сотрудник
		//Аверсон СВФР-007679
		
		|    ИЗ
		|        РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|    ГДЕ
		|        РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|        И (НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|        И ВЫБОР
		|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			ТОГДА РаботникиОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1) И ДОБАВИТЬКДАТЕ(&ДатаАктуальности, ДЕНЬ, 1)//О.Т. Аверсон 07.07.2017 № 806
		|		ИНАЧЕ РаботникиОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
		|		КОНЕЦ
		|        И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&Увольнение)";
		
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "        
		|    
		|    ОБЪЕДИНИТЬ ВСЕ
		|    
		|    ВЫБРАТЬ
		|        ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Дата,
		|        0,
		|        ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости,
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		|        NULL КАК Разряд,
		|		 ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации,
		|		 ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник
		//Аверсон СВФР-007679
		|    ИЗ
		|        Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|    ГДЕ
		|        (ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация
		|                    И (НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|                    И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
		|                    И ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала >= &ДатаНачала
		|                ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания <= &ДатаАктуальности)";
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		
		
		//Аверсон ЕАЕ 22.02.2022 СВФР-008759
		//добавляем изменение разряда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ФизЛицо,
		|	ВлЗапросРаботникиОрганизацийПериоды.Регистратор,
		|	ВлЗапросРаботникиОрганизацийПериоды.Период,
		|	0.5,
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ВидЗанятости,
		|	ВлЗапросРаботникиОрганизацийПериоды.Разряд,
		|	РаботникиОрганизаций.ПодразделениеОрганизации,
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник
		|ИЗ 
		|(ВЫБРАТЬ
		|	ПрисвоениеРазряда.Сотрудник,
		|	ПрисвоениеРазряда.Организация,
		|	ПрисвоениеРазряда.Период,
		|	ПрисвоениеРазряда.Регистратор,
		|	ПрисвоениеРазряда.Разряд,
		|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК РаботникиОрганизацийПериод
		|ИЗ РегистрСведений.ПрисвоениеРазряда КАК ПрисвоениеРазряда
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ПО РаботникиОрганизаций.Период <= ПрисвоениеРазряда.Период
		|	И РаботникиОрганизаций.Сотрудник = ПрисвоениеРазряда.Сотрудник
		|	И РаботникиОрганизаций.Организация = ПрисвоениеРазряда.Организация
		|СГРУППИРОВАТЬ ПО
		|	ПрисвоениеРазряда.Сотрудник,
		|	ПрисвоениеРазряда.Организация,	
		|	ПрисвоениеРазряда.Период,
		|	ПрисвоениеРазряда.Регистратор,
		|	ПрисвоениеРазряда.Разряд) КАК ВлЗапросРаботникиОрганизацийПериоды
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ПО ВлЗапросРаботникиОрганизацийПериоды.Сотрудник = РаботникиОрганизаций.Сотрудник
		|	И ВлЗапросРаботникиОрганизацийПериоды.Организация = РаботникиОрганизаций.Организация
		|	И ВлЗапросРаботникиОрганизацийПериоды.РаботникиОрганизацийПериод = РаботникиОрганизаций.Период
		|ГДЕ ВлЗапросРаботникиОрганизацийПериоды.Организация = &Организация
		|	И НЕ ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ФизЛицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР)
		|	И ВлЗапросРаботникиОрганизацийПериоды.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		
		//добавляем кадровые переводы за первый день следующего квартала
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|  РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|  РаботникиОрганизаций.Регистратор КАК Регистратор,
		|  РаботникиОрганизаций.Период КАК Период,
		|  0 КАК Сортировка,
		|  РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|  РаботникиОрганизаций.РазрядЕТС КАК Разряд,
		|  РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|  РаботникиОрганизаций.Сотрудник КАК Сотрудник
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|   РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|   И (НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|   И РаботникиОрганизаций.Период МЕЖДУ &НачалоПервогоДняСледующегоКвартала И &КонецПервогоДняСледующегоКвартала
		|   И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Перемещение)";
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		//Аверсон СВФР-008759
		
		Запрос.Текст = Запрос.Текст + "		
		|       ) КАК СписокФизлиц
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
		|        ПО СписокФизлиц.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|        ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|        ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
		|        ПО СписокФизлиц.ФизЛицо = ДомашниеТелефоны.Объект
		|            И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
		|            И (ДомашниеТелефоны.Тип = &ТипТелефон)
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|        ПО СписокФизлиц.ФизЛицо = АдресаФактические.Объект
		|            И (АдресаФактические.Вид = &ВидАдресаФактический)
		|            И (АдресаФактические.Тип = &ТипАдрес)
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|        ПО СписокФизлиц.ФизЛицо = АдресаРегистрации.Объект
		|            И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
		|            И (АдресаФактические.Тип = &ТипАдрес)
		|
		|УПОРЯДОЧИТЬ ПО
		|    СписокФизлиц.Сортировка,
		|    Период,
		|    Фамилия";
	иначе    // НеВклДогПодряда Истина
		//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
		|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
		|	ДомашниеТелефоны.Поле3 КАК Телефоны,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
		|	СписокФизлиц.Регистратор КАК Документ,
		|	СписокФизлиц.ФизЛицо,
		|	СписокФизлиц.ФизЛицо.Пол КАК Пол,
		|	СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	СписокФизлиц.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|	СписокФизлиц.ФизЛицо.МестоРождения КАК МестоРождения,
		|	ВЫБОР
		|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
		|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
		|			ТОГДА &СтранаПоУмолчанию
		|		ИНАЧЕ ГражданствоФизЛиц.Страна
		|	КОНЕЦ КАК Гражданство,
		|	СписокФизлиц.Период КАК Период,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
		|	СписокФизлиц.СотрудникВидДоговора,
		|	Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.Совместительство) тогда 1 иначе 0 конец как ВнешнееСовместительство,
		|	Выбор когда СписокФизлиц.ВидЗанятости = Значение(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство) тогда 1 иначе 0 конец как ВнутреннееСовместительство, //Аверсон 20.08.2019 КВВ СВФР-004658
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		|   СписокФизЛиц.Разряд КАК Разряд,
		|	СписокФизЛиц.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	СписокФизЛиц.Сотрудник КАК Сотрудник
		//Аверсон СВФР-007679
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|		РаботникиОрганизаций.Регистратор КАК Регистратор,
		|		РаботникиОрганизаций.Период КАК Период,
		|		ВЫБОР
		|			КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК Сортировка,
		|		РаботникиОрганизаций.Сотрудник.ВидДоговора КАК СотрудникВидДоговора,
		|		РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		|		РаботникиОрганизаций.РазрядЕТС КАК Разряд,
		|		РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		РаботникиОрганизаций.Сотрудник КАК Сотрудник
		//Аверсон СВФР-007679
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|		И НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР)
		|		И ВЫБОР
		|		КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|			ТОГДА РаботникиОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, 1) И ДОБАВИТЬКДАТЕ(&ДатаАктуальности, ДЕНЬ, 1)//О.Т. Аверсон 07.07.2017 № 806
		
		//Аверсон ЕАЕ 15.09.2022 СВФР-009493
		|       КОГДА РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу) 
		|             И НЕ &Прием
		|       ТОГДА РаботникиОрганизаций.Период МЕЖДУ &НачалоКвартала И &КонецКвартала
		//Аверсон СВФР-009493
		
		|		ИНАЧЕ РаботникиОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
		|		КОНЕЦ
		|		И НЕ РаботникиОрганизаций.ИсключитьИзПУ2
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&Увольнение)";
		//Аверсон 09.09.2019 КВВ СВФР-004742 (
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		//Аверсон 09.09.2019 КВВ СВФР-004742 )
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|		И РаботникиОрганизаций.Сотрудник.ВидДоговора <> &ВидДоговора";
		
		//Аверсон ЕАЕ 22.02.2022 СВФР-008759
		//добавляем изменение разряда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ФизЛицо,
		|	ВлЗапросРаботникиОрганизацийПериоды.Регистратор,
		|	ВлЗапросРаботникиОрганизацийПериоды.Период,
		|	0.5,
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ВидДоговора,
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ВидЗанятости,
		|	ВлЗапросРаботникиОрганизацийПериоды.Разряд,
		|	РаботникиОрганизаций.ПодразделениеОрганизации,
		|	ВлЗапросРаботникиОрганизацийПериоды.Сотрудник
		|ИЗ 
		|(ВЫБРАТЬ
		|	ПрисвоениеРазряда.Сотрудник,
		|	ПрисвоениеРазряда.Организация,
		|	ПрисвоениеРазряда.Период,
		|	ПрисвоениеРазряда.Регистратор,
		|	ПрисвоениеРазряда.Разряд,
		|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК РаботникиОрганизацийПериод
		|ИЗ РегистрСведений.ПрисвоениеРазряда КАК ПрисвоениеРазряда
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ПО РаботникиОрганизаций.Период <= ПрисвоениеРазряда.Период
		|	И РаботникиОрганизаций.Сотрудник = ПрисвоениеРазряда.Сотрудник
		|	И РаботникиОрганизаций.Организация = ПрисвоениеРазряда.Организация
		|СГРУППИРОВАТЬ ПО
		|	ПрисвоениеРазряда.Сотрудник,
		|	ПрисвоениеРазряда.Организация,	
		|	ПрисвоениеРазряда.Период,
		|	ПрисвоениеРазряда.Регистратор,
		|	ПрисвоениеРазряда.Разряд) КАК ВлЗапросРаботникиОрганизацийПериоды
		|	
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ПО ВлЗапросРаботникиОрганизацийПериоды.Сотрудник = РаботникиОрганизаций.Сотрудник
		|	И ВлЗапросРаботникиОрганизацийПериоды.Организация = РаботникиОрганизаций.Организация
		|	И ВлЗапросРаботникиОрганизацийПериоды.РаботникиОрганизацийПериод = РаботникиОрганизаций.Период
		|ГДЕ ВлЗапросРаботникиОрганизацийПериоды.Организация = &Организация
		|	И НЕ ВлЗапросРаботникиОрганизацийПериоды.Сотрудник.ФизЛицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР)
		|	И ВлЗапросРаботникиОрганизацийПериоды.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		
		//добавляем кадровые переводы за первый день следующего квартала
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|  РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|  РаботникиОрганизаций.Регистратор КАК Регистратор,
		|  РаботникиОрганизаций.Период КАК Период,
		|  0 КАК Сортировка,
		|  РаботникиОрганизаций.Сотрудник.ВидДоговора КАК ВидДоговора,
		|  РаботникиОрганизаций.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|  РаботникиОрганизаций.РазрядЕТС КАК Разряд,
		|  РаботникиОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|  РаботникиОрганизаций.Сотрудник КАК Сотрудник
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|   РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
		|   И (НЕ РаботникиОрганизаций.Сотрудник.Физлицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР))
		|   И РаботникиОрганизаций.Период МЕЖДУ &НачалоПервогоДняСледующегоКвартала И &КонецПервогоДняСледующегоКвартала
		|   И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Перемещение)";
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос.Текст = Запрос.Текст + " И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ВыбранноеПодразделение)"
		КонецЕсли;
		
		Если ТаблицаПодразделений.Количество()>0 Тогда 
			Запрос.Текст = Запрос.Текст + " И не РаботникиОрганизаций.ПодразделениеОрганизации В(&СписокПодразделений)"
		КонецЕсли;
		//Аверсон СВФР-008759
		
		Запрос.Текст = Запрос.Текст + "
		|) КАК СписокФизлиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
		|		ПО СписокФизлиц.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
		|		ПО СписокФизлиц.ФизЛицо = ДомашниеТелефоны.Объект
		|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
		|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|		ПО СписокФизлиц.ФизЛицо = АдресаФактические.Объект
		|			И (АдресаФактические.Вид = &ВидАдресаФактический)
		|			И (АдресаФактические.Тип = &ТипАдрес)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|		ПО СписокФизлиц.ФизЛицо = АдресаРегистрации.Объект
		|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
		|			И (АдресаФактические.Тип = &ТипАдрес)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СписокФизлиц.Сортировка,
		|	Период,
		|	Фамилия";
		
	КонецЕсли;
	//Аверсон-софт, Островская Татьяна 20.06.2012 № 15516
	
	ТаблицаРаботникиОрганизации = Новый таблицаЗначений();
	ДопРаботникиОрганизации = Новый Массив;
	
	ТаблицаРаботникиОрганизации = (Запрос.Выполнить().Выгрузить());
	
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//Аверсон ЕАЕ 10.04.2022 СВФР-008855
	//ДатаНачала = НачалоКвартала(ДатаРегистрации);
	//ДатаОкончания = КонецКвартала(ДатаРегистрации);
	//Аверсон СВФР-008855
	
	//Аверсон ЕАЕ 21.09.2021 СВФР-007679
	//ТЗРазряды = ПолучитьРазрядСотрудников(ТаблицаРаботникиОрганизации.ВыгрузитьКолонку("Сотрудник"));
	//Аверсон СВФР-007679
	
	//Аверсон ЕАЕ 14.09.2022 СВФР-009493
	Если Не Прием Тогда
		ТЗПрием = Новый ТаблицаЗначений;
		ТЗПрием.Колонки.Добавить("ФизЛицо");
		ТЗПрием.Колонки.Добавить("ДатаПриема");
		ТЗПрием.Колонки.Добавить("ДатаПриказаОПриеме");
		ТЗПрием.Колонки.Добавить("НомерПриказаОПриеме");
	КонецЕсли;
	//Аверсон СВФР-009493
	
	Для каждого СтрокаТЧ из РаботникиОрганизации цикл
		
		мДобавлено = Ложь;
		Если ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") тогда
			СтрокаТЧ.ДатаПриказаОПриеме = "";
			СтрокаТЧ.НомерПриказаОПриеме = "";
			СтрокаТЧ.ДатаПриказаОбУвольнении = "";
			СтрокаТЧ.НомерПриказаОбУвольнении = "";
			СтрокаТЧ.КодОснованияУвольнения = "";
			СтрокаТЧ.ДатаПеревода = "";
			СтрокаТЧ.НомерПриказаПеревода = "";
			СтрокаТЧ.ДатаПриказаПеревода = "";
			СтрокаТЧ.Должность = "";
			СтрокаТЧ.Договор = "";
			Если (СтрокаТЧ.Документ.Датаначала < ДатаНачала) ИЛИ (СтрокаТЧ.Документ.ДатаОкончания<= ДатаНачала) тогда
				СтрокаТЧ.ДатаПриема     = "";
				СтрокаТЧ.ДатаУвольнения = "";
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			Иначе
				СтрокаТЧ.ДатаПриема     = СтрокаТЧ.Документ.Датаначала;
				СтрокаТЧ.ДатаУвольнения = СтрокаТЧ.Документ.Датаокончания;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") тогда
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			//толик            
			Если СтрокаДаты.Количество() <> 0 тогда
				СтрокаТЧ.ДатаПриема = СтрокаДаты[0].ДатаПриема;
				СтрокаТЧ.ДатаПриказаОПриеме = ДокументОснование.ДатаПриказа;
				СтрокаТЧ.НомерПриказаОПриеме = ДокументОснование.НомерД;
				СтрокаТЧ.Должность = СтрокаДаты[0].Должность;
				Если ЗначениеЗаполнено(СтрокаДаты[0].Основание) Тогда
					СтрокаТЧ.Договор = СтрокаДаты[0].Основание;
				КонецЕсли;
				
				//Аверсон ЕАЕ 14.09.2022 СВФР-009493
				Если Не Прием Тогда
					Если СтрокаДаты[0].ДатаПриема >= НачалоКвартала(ДатаРегистрации) И СтрокаДаты[0].ДатаПриема <= КонецКвартала(ДатаРегистрации) Тогда
						НоваяСтр = ТЗПрием.Добавить();
						НоваяСтр.ФизЛицо = СтрокаТЧ.ФизЛицо;
						НоваяСтр.ДатаПриема = СтрокаТЧ.ДатаПриема;
						НоваяСтр.ДатаПриказаОПриеме = СтрокаТЧ.ДатаПриказаОПриеме;
						НоваяСтр.НомерПриказаОПриеме = СтрокаТЧ.НомерПриказаОПриеме;
					КонецЕсли;
				КонецЕсли;
				//Аверсон СВФР-009493
				
			Иначе
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			КонецЕсли;
		ИначеЕсли (ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций")) ИЛИ (ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов")) Тогда	
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			Если СтрокаДаты.Количество() <> 0 тогда
				СтрокаТЧ.ДатаПеревода = СтрокаДаты[0].ДатаНачала;
				СтрокаТЧ.ДатаПриказаПеревода = ДокументОснование.ДатаПриказа;
				СтрокаТЧ.НомерПриказаПеревода = ?(ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов"),ДокументОснование.НомерД,ДокументОснование.НомерПриказа);
				СтрокаТЧ.Должность = СтрокаДаты[0].Должность;
				//Аверсон 08.10.2019 КВВ СВФР-004895 (
				Если ЗначениеЗаполнено(СтрокаДаты[0].Основание) Тогда
					СтрокаТЧ.Договор = СтрокаДаты[0].Основание;
				КонецЕсли;
				//Аверсон 08.10.2019 КВВ СВФР-004895 )
				
				//Аверсон ЕАЕ 07.10.2021 СВФР-008238
				ДанныеДоПеревода = ПолучитьСтарыеДанные(СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаПеревода);
				СтрокаТЧ.СтараяДолжность = ДанныеДоПеревода.Должность;
				СтрокаТЧ.СтароеПодразделениеОрганизации = ДанныеДоПеревода.Подразделение;
				СтрокаТЧ.СтарыйРазрядЕТС = ДанныеДоПеревода.РазрядЕТС;
				//Аверсон СВФР-008238
			Иначе
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") тогда
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			//толик 
			Если СтрокаДаты.Количество() <> 0 Тогда
				СтрокаРаботника = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо, ДатаУвольнения", СтрокаТЧ.ФизЛицо, '00010101000000'));
				
				//Аверсон ЕАЕ 05.01.2022 СВФР-008571
				//Если СтрокаРаботника.Количество() > 1 Тогда
				//	Если ЗначениеЗаполнено(СтрокаРаботника[0].ДатаПриема) И СтрокаРаботника[0].ДатаПриема < СтрокаДаты[0].ДатаУвольнения Тогда
				//		Если СтрокаРаботника[0] <> СтрокаТЧ Тогда
				//			СтрокаРаботника[0].ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
				//			СтрокаРаботника[0].ДатаПриказаОбУвольнении = ДокументОснование.ДатаПриказа;
				//			СтрокаРаботника[0].НомерПриказаОбУвольнении = ДокументОснование.НомерД;
				//			Если ЗначениеЗаполнено(СтрокаДаты[0].ОснованиеУвольнения) Тогда
				//				СтрокаРаботника[0].КодОснованияУвольнения = СтрокаДаты[0].ОснованиеУвольнения.КодОснования;
				//			КонецЕсли;
				//			СтрокаРаботника[0].Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрокаДаты[0].ДатаУвольнения, Новый Структура("Сотрудник",СтрокаДаты[0].Сотрудник)).Должность;
				//			ДопРаботникиОрганизации.Добавить(СтрокаТЧ);
				//		Иначе
				//			СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
				//			СтрокаТЧ.ДатаПриказаОбУвольнении = ДокументОснование.ДатаПриказа;
				//			СтрокаТЧ.НомерПриказаОбУвольнении = ДокументОснование.НомерД;
				//			Если ЗначениеЗаполнено(СтрокаДаты[0].ОснованиеУвольнения) Тогда
				//				СтрокаТЧ.КодОснованияУвольнения = СтрокаДаты[0].ОснованиеУвольнения.КодОснования;
				//			КонецЕсли;
				//			СтрокаТЧ.Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрокаДаты[0].ДатаУвольнения, Новый Структура("Сотрудник",СтрокаДаты[0].Сотрудник)).Должность;
				//			ДопРаботникиОрганизации.Добавить(СтрокаРаботника[0]);
				//		КонецЕсли;
				//	Иначе
				//		СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
				//		СтрокаТЧ.ДатаПриказаОбУвольнении = ДокументОснование.ДатаПриказа;
				//		СтрокаТЧ.НомерПриказаОбУвольнении = ДокументОснование.НомерД;
				//		Если ЗначениеЗаполнено(СтрокаДаты[0].ОснованиеУвольнения) Тогда
				//			СтрокаТЧ.КодОснованияУвольнения = СтрокаДаты[0].ОснованиеУвольнения.КодОснования;
				//		КонецЕсли;
				//		СтрокаТЧ.Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрокаДаты[0].ДатаУвольнения, Новый Структура("Сотрудник",СтрокаДаты[0].Сотрудник)).Должность;
				//	КонецЕсли;
				//Иначе
				//Аверсон СВФР-008571
				
				СтрокаТЧ.ДатаУвольнения = СтрокаДаты[0].ДатаУвольнения;
				СтрокаТЧ.ДатаПриказаОбУвольнении = ДокументОснование.ДатаПриказа;
				СтрокаТЧ.НомерПриказаОбУвольнении = ДокументОснование.НомерД;
				Если ЗначениеЗаполнено(СтрокаДаты[0].ОснованиеУвольнения) Тогда
					СтрокаТЧ.КодОснованияУвольнения = СтрокаДаты[0].ОснованиеУвольнения.КодОснования;
				КонецЕсли;
				СтрокаТЧ.Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрокаДаты[0].ДатаУвольнения, Новый Структура("Сотрудник",СтрокаДаты[0].Сотрудник)).Должность;
				//КонецЕсли;
				
				//Аверсон ЕАЕ 14.09.2022 СВФР-009493
				Если Не Прием Тогда
					СтрокаРаботникаПрием = ТЗПрием.Найти(СтрокаТЧ.ФизЛицо, "ФизЛицо");
					Если СтрокаРаботникаПрием <> Неопределено Тогда
						СтрокаТЧ.ДатаПриема = СтрокаРаботникаПрием.ДатаПриема;
						СтрокаТЧ.ДатаПриказаОПриеме = СтрокаРаботникаПрием.ДатаПриказаОПриеме;
						СтрокаТЧ.НомерПриказаОПриеме = СтрокаРаботникаПрием.НомерПриказаОПриеме;
					КонецЕсли;
				КонецЕсли;
				//Аверсон СВФР-009493
				
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(Строка(ДокументОснование));    
			КонецЕсли;
			
			
			//Аверсон ЕАЕ 22.02.2022 СВФР-008759
		ИначеЕсли ТипЗнч(СтрокаТЧ.Документ) = Тип("ДокументСсылка.ПриказНаПрисвоениеРазряда") Тогда	
			ДокументОснование = СтрокаТЧ.Документ.ПолучитьОбъект();
			СтрокаДаты = ДокументОснование.РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаТЧ.ФизЛицо));
			Если СтрокаДаты.Количество() <> 0 тогда
				СтрокаТЧ.ДатаПрисвоенияРазряда = СтрокаДаты[0].ДатаНачала;
				СтрокаТЧ.ДатаПриказаОПрисвоенииРазряда = ДокументОснование.ДатаПриказа;
				СтрокаТЧ.НомерПриказаОПрисвоенииРазряда = ДокументОснование.НомерД;
				СтрокаТЧ.Должность = СтрокаДаты[0].Должность;
				
				ДанныеДоПеревода = ПолучитьСтарыеДанные(СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаПеревода);
				СтрокаТЧ.СтараяДолжность = ДанныеДоПеревода.Должность;
				СтрокаТЧ.СтароеПодразделениеОрганизации = ДанныеДоПеревода.Подразделение;
				СтрокаТЧ.СтарыйРазрядЕТС = СтрокаДаты[0].РазрядЕТС;
				СтрокаТЧ.РазрядЕТС = СтрокаДаты[0].РазрядЕТСНовый;
			Иначе
				ДопработникиОрганизации.Добавить(СтрокаТЧ);
			КонецЕсли;
			//Аверсон СВФР-008759
			
		КонецЕсли;
		
		//Аверсон ЕАЕ 21.09.2021 СВФР-007679
		ЗаполнитьКодПоОКРБ(СтрокаТЧ);
		СтрокаТЧ.ДолжностьОКРБ = ПодобратьДолжностьОКРБ(СтрокаТЧ.Должность);
		ЗаполнитьСтарыйКодПоОКРБ(СтрокаТЧ);
		СтрокаТЧ.СтараяДолжностьОКРБ = ПодобратьДолжностьОКРБ(СтрокаТЧ.СтараяДолжность);
		//Аверсон СВФР-007679
	Конеццикла;
	
	Для Каждого Стр из ДопРаботникиОрганизации цикл
		РаботникиОрганизации.Удалить(Стр);
	КонецЦикла;
	
	//Аверсон ЕАЕ 10.04.2022 СВФР-008855
	СтрокиУдалить = Новый Массив;
	Для Каждого Стр Из РаботникиОрганизации Цикл
		Если (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") И Не Прием)
			ИЛИ (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") И Не Перевод)
			ИЛИ (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") И Не Увольнение)
			ИЛИ (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ПриказНаПрисвоениеРазряда") И Не ПрисвоениеРазряда)
			ИЛИ (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") И Не ИзменениеРеквизитов)
			ИЛИ (ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") И Не Договор) Тогда
			СтрокиУдалить.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Стр Из СтрокиУдалить Цикл
		РаботникиОрганизации.Удалить(Стр);	
	КонецЦикла;
	//Аверсон СВФР-008855
КонецФункции

#Если Клиент Тогда
	
	Функция СформироватьВыходнойФайл(Отказ) Экспорт
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
			Отказ = Истина;
			Возврат "";
		КонецЕсли;    
		
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Если Отказ тогда
			Возврат "";
		КонецЕсли;     
		
		Результат                    =    СформироватьЗапросПоРаботникиОрганизации();
		ТЗОсн = Результат.Выгрузить();
		ВыборкаПоРаботникиОрганизации            =    Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		//Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
		//КонецЕсли;     
		
		СписокОбработанныхАнкет = Новый СписокЗначений;
		Если Отказ тогда
			Возврат "";
		КонецЕсли;   
		ЗапросТел = Новый Запрос;
		ЗапросТел.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Поле3
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
		ЗапросТел.УстановитьПараметр("Объект",ВыборкаПоШапкеДокумента.Организация);
		ЗапросТел.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
		ЗапросТел.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		Рез = ЗапросТел.Выполнить().Выбрать();
		ТелефонОрг = "";
		пока Рез.Следующий() цикл
			ТелефонОрг = Рез.Поле3;
		КонецЦикла;
		Кавычка = Символ(34); //Аверсон 14.08.2019 КВВ СВФР-004639
		ТекстФайла = Новый ТекстовыйДокумент;
		//ТекстФайла.ДобавитьСтроку("За " + СтрЗаменить(ПредставлениеПериода(НачалоКвартала(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации),КонецКвартала(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации)),"г.","года"));
		ТекстФайла.ДобавитьСтроку("{");
		ТекстФайла.ДобавитьСтроку(Кавычка+"ver"+Кавычка+": "+ Кавычка + "2.0"+Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"forma"+Кавычка+": "+Кавычка+"PU2"+Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"unpf"+Кавычка+": "+Кавычка + СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР) + Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"unp"+Кавычка+": "+Кавычка + СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН) + Кавычка+",");
		НаимОрг = СокрЛП(СтрЗаменить(ВыборкаПоШапкедокумента.организация.НаименованиеПолное,"""","\"+Кавычка));
		ТекстФайла.ДобавитьСтроку(Кавычка+"plat"+Кавычка+": "+Кавычка+ ВРЕГ(НаимОрг) + Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"type"+Кавычка+": "+Кавычка+"1"+Кавычка+",");
		
		//Аверсон ЕАЕ 10.04.2022 СВФР-008855
		//ТекстФайла.ДобавитьСтроку(Кавычка+"kv"+Кавычка+": "+Кавычка+СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации, "ДФ=к")) + Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"kv"+Кавычка+": "+Кавычка+СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаНачала, "ДФ=к")) + Кавычка+",");
		//ТекстФайла.ДобавитьСтроку(Кавычка+"year"+Кавычка+": "+Кавычка+СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации, "ДФ=гггг")) + Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"year"+Кавычка+": "+Кавычка+СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаНачала, "ДФ=гггг")) + Кавычка+",");
		//Аверсон СВФР-008855
		
		ИмяПачки = "PU2_" + СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР) + "_" + СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН) + 
		
		//Аверсон ЕАЕ 10.04.2022 СВФР-008855
		//"_1_"+ СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации, "ДФ=гггг")) + "0" + СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации, "ДФ=к")) + 
		"_1_"+ СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаНачала, "ДФ=гггг")) + "0" + СокрЛП(Формат(ВыборкаПоШапкеДокумента.Ссылка.ДатаНачала, "ДФ=к")) +
		//Аверсон СВФР-008855
		
		"_" + Формат(ВыборкаПоШапкеДокумента.Ссылка.Дата, "ДФ=ггггММддЧЧммсс");
		ТекстФайла.ДобавитьСтроку(Кавычка+"pck"+Кавычка+": "+Кавычка+СокрЛП(ИмяПачки) + Кавычка+",");			
		ТекстФайла.ДобавитьСтроку(Кавычка+"tel"+Кавычка+": "+Кавычка+СокрЛП(ТелефонОрг) + Кавычка+",");
		ТекстФайла.ДобавитьСтроку(Кавычка+"ddoc"+Кавычка+": "+Кавычка+ Формат(ВыборкаПоШапкеДокумента.Ссылка.Дата, "ДФ=дд/ММ/гггг") +Кавычка+",");
		
		ТекстФайла.ДобавитьСтроку(Кавычка+"data"+Кавычка+": [");
		
		//Аверсон ЕАЕ 10.04.2022 СВФР-008855
		//Пусто = ?(ВыборкаПоШапкеДокумента.Ссылка.ДатаРегистрации < Дата(2019,07,01),Истина,Ложь); //не выводить часть реквизитов до даты 01.07.2019
		Пусто = ?(ВыборкаПоШапкеДокумента.Ссылка.ДатаНачала < Дата(2019,07,01),Истина,Ложь); //не выводить часть реквизитов до даты 01.07.2019
		//Аверсон СВФР-008855
		
		//Аверсон 20.08.2019 КВВ СВФР-004658 (
		ТЗСотр = Новый ТаблицаЗначений;
		ТЗСотр = ТЗОсн.Скопировать();
		ТЗСотр.Свернуть("ФизЛицо,ЛичныйНомер,Фамилия,Имя,Отчество");
		//Аверсон 07.10.2019 КВВ СВФР-004879 (
		ТЗОсн.Колонки.Добавить("ДатаДок"); 		
		Для Каждого СтрТЗОсн Из ТЗОсн Цикл
			СтрТЗОсн.ДатаДок = ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема),СтрТЗОсн.ДатаПриема,?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения),СтрТЗОсн.ДатаУвольнения,СтрТЗОсн.ДатаПеревода));
		КонецЦикла;
		ТЗОсн.Сортировать("ФизЛицо,ДатаДок");
		//Аверсон 07.10.2019 КВВ СВФР-004879 )
		
		//ТЗОсн.Сортировать("ФизЛицо,ДатаПриема Убыв,ДатаУвольнения Убыв,ДатаПеревода");
		
		//Аверсон ЕАЕ 23.09.2021
		ВидыРасчетаКлассность = ПолучитьВидыРасчетаКлассность();
		//Аверсон
		
		Для Каждого СтрТЗСотр Из ТЗСотр Цикл //сотр
			
			//Аверсон ЕАЕ 22.02.2022 СВФР-008759
			БылПеревод = Ложь;
			//Аверсон СВФР-008759
			
			//Аверсон ЕАЕ 06.04.2023 СВФР-010150
			БылПрием = Ложь;
			//Аверсон СВФР-010150
			
			//Аверсон 20.08.2019 КВВ СВФР-004658 )
			ТекстФайла.ДобавитьСтроку("{");
			ТекстФайла.ДобавитьСтроку(Кавычка+"ils"+Кавычка+": "+Кавычка+СокрЛП(СтрТЗСотр.ЛичныйНомер) + Кавычка+",");
			ТекстФайла.ДобавитьСтроку(Кавычка+"fzl"+Кавычка+": "+Кавычка+ВРЕГ(СокрЛП(СтрТЗСотр.Фамилия)) +Кавычка+",");
			ТекстФайла.ДобавитьСтроку(Кавычка+"izl"+Кавычка+": "+Кавычка+Лев(СокрЛП(СтрТЗСотр.Имя),1) +Кавычка+",");
			ТекстФайла.ДобавитьСтроку(Кавычка+"ozl"+Кавычка+": "+Кавычка+Лев(СокрЛП(СтрТЗСотр.Отчество),1) +Кавычка+",");
			
			//Аверсон 20.08.2019 КВВ СВФР-004658 (
			Р1Прием = 0; Р1Увольнение = 0;  Р2Перевод = 0;  Р3Прием = 0;  Р3Увольнение = 0;
			Для Каждого СтрТЗОсн Из ТЗОсн Цикл
				Если СтрТЗОсн.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
					Продолжить;
				КонецЕсли;
				Р1Прием = Р1Прием + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "0",1,0); 
				Р1Увольнение = Р1Увольнение + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "0",1,0);  
				Р2Перевод = Р2Перевод + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода),1,0);  
				Р3Прием = Р3Прием + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "1",1,0);  
				Р3Увольнение = Р3Увольнение + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "1",1,0);
			КонецЦикла;
			СчПеревод = 0;  СчR2 = 0;
			СчR1 = Р1Прием + Р1Увольнение; //Аверсон 07.10.2019 КВВ СВФР-004879
			
			//Аверсон ЕАЕ 14.10.2021 СВФР-008250
			Ном = 0;
			//Аверсон СВФР-008250
			
			БылПрием = Ложь;
			СтрПриемНом = 0;
			Для Каждого СтрТЗОсн Из ТЗОсн Цикл //r1
				Если СтрТЗОсн.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
					Продолжить;
				КонецЕсли;
				
				//Аверсон ЕАЕ 14.10.2021 СВФР-008250
				Ном = Ном + 1;
				//Аверсон СВФР-008250
				
				//Аверсон 20.08.2019 КВВ СВФР-004658 )
				Если (ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения)) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "0" Тогда //Раздел1
					//Аверсон 07.10.2019 КВВ СВФР-004879 (
					Если СчR1 = Р1Прием + Р1Увольнение Тогда
						ТекстФайла.ДобавитьСтроку(Кавычка+"r1"+Кавычка+": [");  
					КонецЕсли;
					//Аверсон 07.10.2019 КВВ СВФР-004879 )
					Если (ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) И Не БылПрием) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) Тогда
						ТекстФайла.ДобавитьСтроку("{");
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) Тогда
						ТекстФайла.ДобавитьСтроку(Кавычка+"dfr1"+Кавычка+": "+Кавычка+ Формат(СтрТЗОсн.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");
						ТекстФайла.ДобавитьСтроку(Кавычка+"dpr11"+Кавычка+": "+Кавычка+ ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОПриеме, "ДФ=дд/ММ/гггг")) + Кавычка+",");
						ТекстФайла.ДобавитьСтроку(Кавычка+"npr11"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОПриеме)) + Кавычка + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения),",",""));
						
						//Аверсон ЕАЕ 22.09.2021 СВФР-007679 
						//ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(СтрТЗОсн.ВнешнееСовместительство) + Кавычка + ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения),",",""));  //Аверсон 20.08.2019 КВВ СВФР-004658 
						//Аверсон СВФР-007679
						
						//Аверсон ЕАЕ 06.04.2023 СВФР-010150
						БылПрием = Истина;
						//Аверсон СВФР-010150
						
						СчR1 = СчR1 - 1;  //Аверсон 09.01.2020 КВВ СВФР-005308
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) Тогда
						//Уберем }
						Если БылПрием Тогда
							Если СтрПриемНом <> 0 Тогда
								ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(СтрПриемНом - 1);
								Если СокрЛП(ЗапомнитьСтр) = "}" Тогда
									ТекстФайла.УдалитьСтроку(СтрПриемНом - 1);	
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						ТекстФайла.ДобавитьСтроку(Кавычка+"dto1"+Кавычка+": "+Кавычка+ Формат(СтрТЗОсн.ДатаУвольнения, "ДФ=дд/ММ/гггг") + Кавычка+",");
						
						//Аверсон ЕАЕ 22.09.2021 СВФР-007679
						//ТекстФайла.ДобавитьСтроку(Кавычка+"koduv1"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.КодОснованияУвольнения)) + Кавычка+",");
						//Аверсон СВФР-007679
						
						ТекстФайла.ДобавитьСтроку(Кавычка+"dpr12"+Кавычка+": "+Кавычка+ ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОбУвольнении, "ДФ=дд/ММ/гггг")) + Кавычка+",");
						ТекстФайла.ДобавитьСтроку(Кавычка+"npr12"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОбУвольнении)) + Кавычка+",");
						
						//Аверсон ЕАЕ 22.09.2021 СВФР-007679
						ТекстФайла.ДобавитьСтроку(Кавычка+"koduv1"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.КодОснованияУвольнения)) + Кавычка);
						//Аверсон СВФР-007679
						
						СчR1 = СчR1 - 1;  //Аверсон 07.10.2019 КВВ СВФР-004879  //Аверсон 09.01.2020 КВВ СВФР-005308
					КонецЕсли;
					ТекстФайла.ДобавитьСтроку("}");
					
					//Аверсон ЕАЕ 29.09.2021 СВФР-007679
					//ТекстФайла.ДобавитьСтроку(?(СчR1<>0,"","]") + ?(Р1Прием<>0 ИЛИ Р2Перевод<>0 ИЛИ Р3Прием<>0 ИЛИ Р3Увольнение<>0,",",""));  //Аверсон 20.08.2019 КВВ СВФР-004658 //Аверсон 07.10.2019 КВВ СВФР-004879
					
					//Аверсон ЕАЕ 05.01.2022 СВФР-008571
					//ТекстФайла.ДобавитьСтроку(?(СчR1<>0,"","]"));
					ТекстФайла.ДобавитьСтроку(?(СчR1<>0,",","]")); //здесь нужно запомнить строку
					
					Если БылПрием Тогда
						СтрПриемНом = ТекстФайла.КоличествоСтрок();
					КонецЕсли;
					//Аверсон СВФР-008571
					
					НомКонСтрокиР1 = ТекстФайла.КоличествоСтрок();
					//Аверсон СВФР-007679
				КонецЕсли;  //конец Раздел1
				
				//Аверсон ЕАЕ 29.09.2021 СВФР-007679
				Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) И Ном = 1 И СчR1 = 0 Тогда //Аверсон ЕАЕ 14.10.2021 СВФР-008250
					ТекстФайла.ДобавитьСтроку(Кавычка+"r1"+Кавычка+": []");
					НомКонСтрокиР1 = ТекстФайла.КоличествоСтрок();
				КонецЕсли;
				//Аверсон СВФР-007679
				
			КонецЦикла; //Аверсон 13.01.2020 КВВ СВФР-005308
			
			//Аверсон ЕАЕ 14.10.2021 СВФР-008250
			Ном1 = 0;
			СтруктураСотр = Новый Структура("ФизЛицо", СтрТЗСотр.ФизЛицо);
			МассивСтрокСотр = ТЗОсн.НайтиСтроки(СтруктураСотр);
			КоличествоСтрокСотр = МассивСтрокСотр.Количество();
			//Аверсон СВФР-008250
			
			//Аверсон ЕАЕ 10.03.2022 СВФР-008759
			r2НужноЗакрытьКвадратнойСкобкой = Ложь;
			//Аверсон СВФР-008759
			
			
			//Аверсон ЕАЕ 17.03.2023 СВФР-010150
			ПредКодПоОКРБ = Неопределено;
			ПредПодразделение = Неопределено;
			ВыводитьР22 = Истина;
			//Аверсон СВФР-010150
			
			//Аверсон 13.01.2020 КВВ СВФР-005308 (
			Для Каждого СтрТЗОсн Из ТЗОсн Цикл //r2  
				Если СтрТЗОсн.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда   
					Продолжить;   
				КонецЕсли;      
				//Аверсон 13.01.2020 КВВ СВФР-005308 )
				
				//Аверсон ЕАЕ 14.10.2021 СВФР-008250
				Ном1 = Ном1 + 1;
				//Аверсон СВФР-008250
				
				//Аверсон ЕАЕ 22.02.2022 СВФР-008759
				Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
					БылПеревод = Истина;
				КонецЕсли;
				//Аверсон СВФР-008759
				
				//Аверсон ЕАЕ 06.04.2023 СВФР-010150
				Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) Тогда
					БылПрием = Истина;
				КонецЕсли;
				
				//Аверсон СВФР-010150
				
				//Аверсон ЕАЕ 05.10.2021 СВФР-007679
				Если ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) Тогда
					//Аверсон ЕАЕ 14.04.2022 СВФР-008855
					//ДатаПриемаСотрудника = ПолучитьДатуПриема(СтрТЗОсн.Сотрудник);
					БылПриемИлиПеревод = БылПриемИлиПеревод(СтрТЗОсн.Сотрудник, СтрТЗОсн.ДатаУвольнения);
					//Аверсон СВФР-008855
				Иначе
					//Аверсон ЕАЕ 14.04.2022 СВФР-008855
					//ДатаПриемаСотрудника = Неопределено;
					БылПриемИлиПеревод = Неопределено;
					//Аверсон СВФР-008855
				КонецЕсли;
				//Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда //Раздел2
				Если (ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) ИЛИ (ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) И БылПриемИлиПеревод = Истина)) Тогда //И ДатаПриемаСотрудника > '20190630')) Тогда //Аверсон ЕАЕ 13.04.2022 СВФР-008855
					//Аверсон СВФР-007679
					
					//Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ (ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) И Р1Прием=0 И СчПеревод = 0) Тогда  //Аверсон 20.08.2019 КВВ СВФР-004658 
					Если СчR2 = 0 Тогда
						
						Если ЗначениеЗаполнено(НомКонСтрокиР1) Тогда
							СтрокаКонР1 = ТекстФайла.ПолучитьСтроку(НомКонСтрокиР1);
							Если Прав(СтрокаКонР1, 1) <> "," Тогда
								ТекстФайла.ЗаменитьСтроку(НомКонСтрокиР1, СтрокаКонР1 + ","); 	
							КонецЕсли;
						КонецЕсли;
						
						ТекстФайла.ДобавитьСтроку(Кавычка+"r2"+Кавычка+": [");
						
						//Аверсон ЕАЕ 09.03.2022 СВФР-008759
						r2НужноЗакрытьКвадратнойСкобкой = Истина;
						//Аверсон СВФР-008759
						
						//ТекстФайла.ДобавитьСтроку("{");
						СчR2 = СчR2 + 1;
						Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
							СчПеревод = СчПеревод + 1;	
						КонецЕсли;
					Иначе  // есть переводы = 1 при приеме ИЛИ переводы > 1
						СчR2 = СчR2 + 1;
						//Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда  //Аверсон 13.01.2020 КВВ СВФР-005308 (коммент)
						ТекстФайла.ДобавитьСтроку(",");
						
						//Аверсон ЕАЕ 06.04.2023 СВФР-010150
						//Если БылПрием Тогда //Аверсон ЕАЕ 12.01.2026 СВФР-017748
							ЗапомнитьСтрНомПрием = ТекстФайла.КоличествоСтрок();
						//КонецЕсли;
						//Аверсон СВФР-010150
						
						//ТекстФайла.ДобавитьСтроку("{");
						СчПеревод = СчПеревод + 1;
						//КонецЕсли;
					КонецЕсли;
					
					///////////////////////////////////////
					//проверка и выгрузка старых должностей
					Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) И СчПеревод = 1 Тогда
						
						//Аверсон ЕАЕ 28.03.2022 СВФР-008759
						
						ТЗ = Новый ТаблицаЗначений;
						ТЗ.Колонки.Добавить("ДатаПеревода");
						ТЗ.Колонки.Добавить("МассивСтрок");
						
						Дат = СтрТЗОсн.ДатаПеревода;
						Пока Дат > '20190701' Цикл
							
							//ДанныеПоследнегоПеревода = ПолучитьДанныеПоследнегоПеревода(СтрТЗОсн.Сотрудник, СтрТЗОсн.ДатаПеревода - 1);
							ДанныеПоследнегоПеревода = ПолучитьДанныеПоследнегоПеревода(СтрТЗОсн.Сотрудник, Дат - 1);
							//Аверсон СВФР-008759
							
							ДатаПоследнегоПеревода = ДанныеПоследнегоПеревода.ДатаПеревода;
							Если ЗначениеЗаполнено(ДатаПоследнегоПеревода) И ДатаПоследнегоПеревода >= '20190701' Тогда
								Сотр = СтрТЗОсн.Сотрудник;
								Должн = ДанныеПоследнегоПеревода.Должность;
								Дат = ДатаПоследнегоПеревода;
								Подр = ДанныеПоследнегоПеревода.ПодразделениеОрганизации;
								ВыгружатьВФайл = Ложь;
								ВыгружатьВРС = Ложь;
								
								//должность выгружена этим документом (это повторная выгрузка)
								//в РС не пишем, выгружаем в файл
								Если ДолжностьВыгружена(Сотр, Должн, Дат, Подр, Ссылка) Тогда
									ВыгружатьВФайл = Истина;
									
									//должность выгружена другим документом
									//ничего не делаем
								ИначеЕсли ДолжностьВыгружена(Сотр, Должн, Дат, Подр) Тогда
									
									//должность не выгружена
									//пишем в РС, пишем в файл
								Иначе
									ВыгружатьВРС = Истина;
									ВыгружатьВФайл = Истина;
								КонецЕсли;
								
								Если ВыгружатьВФайл = Истина Тогда
									
									//Аверсон ЕАЕ 28.03.2022 СВФР-008759
									НоваяСтр = ТЗ.Добавить();
									НоваяСтр.ДатаПеревода = Дат;
									Мас = Новый Массив;
									//Аверсон СВФР-008759
									
									//Старые данные
									Если ДатаПоследнегоПеревода >= '20190703' Тогда
										ДанныеДоПоследнегоПеревода = ПолучитьДанныеДоПоследнегоПеревода(СтрТЗОсн.Сотрудник, ДатаПоследнегоПеревода - 1);
										
										//Аверсон ЕАЕ 28.03.2022 СВФР-008759
										//ТекстФайла.ДобавитьСтроку("{");
										Стр = "{";
										Мас.Добавить(Стр);
										//Аверсон СВФР-008759
										
										КодПоОКРБ = ДанныеДоПоследнегоПеревода.СтарыйКодПоОКРБ;
										
										//Аверсон ЕАЕ 28.03.2022 СВФР-008759
										//ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(КодПоОКРБ)) + Кавычка+",");
										Стр = Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(КодПоОКРБ)) + Кавычка+",";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(ВРЕГ(ДанныеДоПоследнегоПеревода.СтараяДолжность)) + Кавычка + ","));
										Стр = Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(ВРЕГ(ДанныеДоПоследнегоПеревода.СтараяДолжность)) + Кавычка + ",");
										Мас.Добавить(Стр);
										//Аверсон СВФР-008759
										
										СтароеПодр = ДанныеДоПоследнегоПеревода.СтароеПодразделениеОрганизации;
										Если Организация.ИНН = "806000046" Тогда
											ПодразделениеОрганизацииСтр = ИменительныйПадеж(СтароеПодр) + ПолучитьПредставительство(СтароеПодр);
										Иначе
											ПодразделениеОрганизацииСтр = СокрЛП(СтароеПодр);
										КонецЕсли;
										
										ПодразделениеОрганизацииСтр = СтрЗаменить(ПодразделениеОрганизацииСтр, """", "\" + Кавычка);
										
										//Аверсон ЕАЕ 28.03.2022 СВФР-008759
										//ТекстФайла.ДобавитьСтроку(Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ВРЕГ(ПодразделениеОрганизацииСтр) + Кавычка+","));
										Стр = Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ВРЕГ(ПодразделениеОрганизацииСтр) + Кавычка+",");
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(ДанныеПоследнегоПеревода.ВнешнееСовместительство) + Кавычка+",");
										Стр = Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(ДанныеПоследнегоПеревода.ВнешнееСовместительство) + Кавычка+",";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"r22"+Кавычка+": [");
										Стр = Кавычка+"r22"+Кавычка+": [";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку("{");
										Стр = "{";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(Дат - 1, "ДФ=дд/ММ/гггг") + Кавычка+",");
										Стр = Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(Дат - 1, "ДФ=дд/ММ/гггг") + Кавычка+",";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(ДанныеПоследнегоПеревода.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
										Стр = Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(ДанныеПоследнегоПеревода.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(ДанныеПоследнегоПеревода.НомерПриказаПеревода)) + Кавычка);
										Стр = Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(ДанныеПоследнегоПеревода.НомерПриказаПеревода)) + Кавычка;
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку("}");
										Стр = "}";
										Мас.Добавить(Стр);
										
										//ТекстФайла.ДобавитьСтроку("]},");
										Стр = "]},";
										Мас.Добавить(Стр);
										//Аверсон СВФР-008759
										
									КонецЕсли;
									
									//Новые данные
									
									//Аверсон ЕАЕ 28.03.2022 СВФР-008759 
									//прием предыдущих переводов убираем
									//ТекстФайла.ДобавитьСтроку("{");
									//Стр = "{";
									//Мас.Добавить(Стр);
									////Аверсон СВФР-008759
									//
									//КодПоОКРБ = ДанныеПоследнегоПеревода.КодПоОКРБ;
									//
									////Аверсон ЕАЕ 28.03.2022 СВФР-008759
									////ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(КодПоОКРБ)) + Кавычка+",");
									//Стр = Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(КодПоОКРБ)) + Кавычка+",";
									//Мас.Добавить(Стр);
									//
									////ТекстФайла.ДобавитьСтроку(Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(ВРЕГ(Должн)) + Кавычка + ","));
									//Стр = Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(ВРЕГ(Должн)) + Кавычка + ",");
									//Мас.Добавить(Стр);
									////Аверсон СВФР-008759
									//
									//
									//Если Организация.ИНН = "806000046" Тогда
									//	ПодразделениеОрганизацииСтр = ИменительныйПадеж(Подр) + ПолучитьПредставительство(Подр);
									//Иначе
									//	ПодразделениеОрганизацииСтр = СокрЛП(Подр);
									//КонецЕсли;
									//
									//ПодразделениеОрганизацииСтр = СтрЗаменить(ПодразделениеОрганизацииСтр, """", "\" + Кавычка);
									//
									////Аверсон ЕАЕ 28.03.2022 СВФР-008759
									////ТекстФайла.ДобавитьСтроку(Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ВРЕГ(ПодразделениеОрганизацииСтр) + Кавычка+","));
									//Стр = Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ВРЕГ(ПодразделениеОрганизацииСтр) + Кавычка+",");
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(ДанныеПоследнегоПеревода.ВнешнееСовместительство) + Кавычка+",");
									//Стр = Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(ДанныеПоследнегоПеревода.ВнешнееСовместительство) + Кавычка+",";
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку(Кавычка+"r22"+Кавычка+": [");
									//Стр = Кавычка+"r22"+Кавычка+": [";
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку("{");
									//Стр = "{";
									//Мас.Добавить(Стр);
									//
									////ТекстФайла.ДобавитьСтроку(Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(Дат, "ДФ=дд/ММ/гггг") + Кавычка+",");
									//Стр = Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(Дат, "ДФ=дд/ММ/гггг") + Кавычка+",";
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку(Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(ДанныеПоследнегоПеревода.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",");
									//Стр = Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(ДанныеПоследнегоПеревода.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",";
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку(Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(ДанныеПоследнегоПеревода.НомерПриказаПеревода)) + Кавычка+",");
									//Стр = Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(ДанныеПоследнегоПеревода.НомерПриказаПеревода)) + Кавычка+",";
									//Мас.Добавить(Стр);
									////Аверсон СВФР-008759
									//
									////
									//КодДоговора = "";
									//Если ЗначениеЗаполнено(ДанныеПоследнегоПеревода.ТрудовойДоговор) Тогда
									//	Если ДанныеПоследнегоПеревода.ВидТрудовогоДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
									//		КодДоговора = "01";
									//	ИначеЕсли ДанныеПоследнегоПеревода.ВидТрудовогоДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
									//		Если ДанныеПоследнегоПеревода.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.НеопределенСрок Тогда
									//			КодДоговора = "02";
									//		ИначеЕсли ДанныеПоследнегоПеревода.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.Срочный ИЛИ
									//			ДанныеПоследнегоПеревода.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.ОпределенРаботы Тогда
									//			КодДоговора = "03";
									//		КонецЕсли;
									//	ИначеЕсли ДанныеПоследнегоПеревода.ВидТрудовогоДоговора = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий Тогда
									//		КодДоговора = "04";
									//	КонецЕсли;
									//Иначе
									//	КодДоговора = "01";
									//КонецЕсли;
									//Если ДанныеПоследнегоПеревода.ВнутреннееСовместительство = "1" Тогда
									//	КодДоговора = "03";
									//КонецЕсли;
									//
									////Аверсон ЕАЕ 28.03.2022 СВФР-008759
									////ТекстФайла.ДобавитьСтроку(Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка);
									//Стр = Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка;
									//Мас.Добавить(Стр);
									////
									//
									////ТекстФайла.ДобавитьСтроку("}");
									//Стр = "}";
									//Мас.Добавить(Стр);
									////ТекстФайла.ДобавитьСтроку("]},");
									//Стр = "]},";
									//Мас.Добавить(Стр);
									
									НоваяСтр.МассивСтрок = Мас;
									//Аверсон СВФР-008759
									
								КонецЕсли;
								
								Если ВыгружатьВРС = Истина Тогда
									ВыгрузитьДолжность(Сотр, Должн, Дат, Подр);
								КонецЕсли;
								
							КонецЕсли;
							
							//Аверсон ЕАЕ 28.03.2022 СВФР-008759
							Дат = ДатаПоследнегоПеревода;
						КонецЦикла;
						
						ТЗ.Сортировать("ДатаПеревода");
						Для Каждого СтрТЗ Из ТЗ Цикл
							Для Каждого СтрМас Из СтрТЗ.МассивСтрок Цикл
								ТекстФайла.ДобавитьСтроку(СтрМас);	
							КонецЦикла;
						КонецЦикла;
						//Аверсон СВФР-008759
						
					КонецЕсли;
					/////////////////////////////////////////////////////////////
					
					////Аверсон ЕАЕ 17.03.2023 СВФР-010150
					//ПредКодПоОКРБ = Неопределено;
					//ПредПодразделение = Неопределено;
					//ВыводитьР22 = Истина;
					////Аверсон СВФР-010150
					
					
					//Аверсон ЕАЕ 22.09.2021 СВФР-007679
					Для К = 1 По 2 Цикл
						Если К = 2 И Не ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
							Прервать;
						КонецЕсли;
						
						//Проверим дату последней записи в РС РаботникиОрганизаций
						Если К = 1 И ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
							ЗптНужна = Истина;
							//ДатаПоследнегоПеревода = ПолучитьДатуПоследнегоПеревода(СтрТЗОсн.Сотрудник, СтрТЗОсн.ДатаПеревода - 1);
							
							//если дата предыдущего перевода раньше 01.07.2022 - для тек.перевода старую должность не выгружаем, только новую
							//Если ЗначениеЗаполнено(ДатаПоследнегоПеревода) И ДатаПоследнегоПеревода < '20190701' Тогда //Аверсон ЕАЕ 09.03.2022 СВФР-008759
							//	//ЗптНужна = Ложь;
							//	//Продолжить;
							//	Сотр = СтрТЗОсн.Сотрудник;
							//	Должн = СтрТЗОсн.СтараяДолжность;
							//	Дат = ДатаПоследнегоПеревода;
							//	Подр = СтрТЗОсн.СтароеПодразделениеОрганизации;
							//Иначе
							//	
							//	//Аверсон ЕАЕ 22.02.2022 СВФР-008759
							//	//Проверим, была ли выгружена должность
							//	Сотр = СтрТЗОсн.Сотрудник;
							//	Должн = СтрТЗОсн.СтараяДолжность;
							//	Дат = ДатаПоследнегоПеревода;
							//	Подр = СтрТЗОсн.СтароеПодразделениеОрганизации;
							//	Если ДолжностьВыгружена(Сотр, Должн, Дат, Подр, Ссылка) Тогда //Это повторная выгрузка файла из этого документа
							//		
							//	ИначеЕсли ДолжностьВыгружена(Сотр, Должн, Дат, Подр) Тогда
							//		ЗптНужна = Ложь;
							//		Продолжить;
							//	Иначе
							//		Если ЗначениеЗаполнено(Дат) Тогда //Аверсон ЕАЕ 09.03.2022 СВФР-008759
							
							//Выгружаем текущую должность в РС
							Сотр = СтрТЗОсн.Сотрудник;
							Должн = СтрТЗОсн.Должность;
							Дат = СтрТЗОсн.ДатаПеревода;
							Подр = СтрТЗОсн.ПодразделениеОрганизации;
							Если Не ДолжностьВыгружена(Сотр, Должн, Дат, Подр) Тогда
								ВыгрузитьДолжность(Сотр, Должн, Дат, Подр);
							КонецЕсли;
							
							//		КонецЕсли;
							//	КонецЕсли;
							//	//Аверсон СВФР-008759
							//	
							//КонецЕсли;
							
							//Аверсон ЕАЕ 22.02.2022 СВФР-008759
							//если перевод в первый день квартала - выводим только новую должность
							
							//Аверсон ЕАЕ 10.04.2022 СВФР-008855
							//Если НачалоДня(СтрТЗОсн.ДатаПеревода) = НачалоКвартала(ДатаРегистрации) Тогда
							Если НачалоДня(СтрТЗОсн.ДатаПеревода) = ДатаНачала Тогда
								//Аверсон СВФР-008855
								
								ЗптНужна = Ложь;
								Продолжить;
							КонецЕсли;
							//Аверсон СВФР-008759
							
						КонецЕсли;
						
						//Аверсон ЕАЕ 22.02.2022 СВФР-008759
						//если перевод в первый день следующего квартала - выводим только старую должность
						Если К = 2 Тогда
							
							//Аверсон ЕАЕ 10.04.2022 СВФР-008855
							//Если НачалоДня(СтрТЗОсн.ДатаПеревода) = НачалоКвартала(КонецКвартала(ДатаРегистрации) + 1) Тогда
							Если НачалоДня(СтрТЗОсн.ДатаПеревода) = НачалоДня(КонецДня(ДатаОкончания) + 1) Тогда
								//Аверсон СВФР-008855
								
								Прервать;
							КонецЕсли;
						КонецЕсли;
						//Аверсон СВФР-008759
						ЗапомнитьСтрНом = 0;
						Если К = 2 Тогда
							//ЗапомнитьСтрНом = 0;
							Если ЗптНужна = Истина Тогда
								ТекстФайла.ДобавитьСтроку(",");
								ЗапомнитьСтрНом = ТекстФайла.КоличествоСтрок();
							КонецЕсли;
						//ИначеЕсли К = 1 И БылПрием Тогда
							
						КонецЕсли;
						
						//Аверсон ЕАЕ 17.03.2023 СВФР-010150
						//ТекстФайла.ДобавитьСтроку("{");
						//Аверсон СВФР-010150
						
						//ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.Должность.КодПоОКПДТР)) + Кавычка+",");
						
						//Аверсон ЕАЕ 05.01.2022 СВФР-008571
						Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
							Если К = 1 Тогда
								КодПоОКРБ = СтрТЗОсн.СтарыйКодПоОКРБ;
								
								//Аверсон ЕАЕ 17.03.2023 СВФР-010150
								ВыводитьР22 = (КодПоОКРБ <> ПредКодПоОКРБ ИЛИ СтрТЗОсн.ПодразделениеОрганизации <> ПредПодразделение);
								ПредКодПоОКРБ = КодПоОКРБ;
								ПредПодразделение = СтрТЗОсн.СтароеПодразделениеОрганизации;
								
								Если Не ВыводитьР22 Тогда
									Если ЗапомнитьСтрНом <> 0 Тогда
										ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНом - 1);
										Если СокрЛП(ЗапомнитьСтр) = "}" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 1, ""); 
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНом - 1);	
										КонецЕсли;
										ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНом - 2);
										Если СокрЛП(ЗапомнитьСтр) = "]" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНом - 2);
										КонецЕсли;

									КонецЕсли;
									Если ТипЗнч(ЗапомнитьСтрНомПрием) = Тип("Число") И //Аверсон ЕАЕ 08.01.2025 СВФР-017748
										ЗапомнитьСтрНомПрием <> 0 Тогда
										ЗапомнитьСтрПрием = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 1);
										Если СокрЛП(ЗапомнитьСтрПрием) = "}" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 1, ""); 
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 1);	
										КонецЕсли;
										ЗапомнитьСтрПрием = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 2);
										Если СокрЛП(ЗапомнитьСтрПрием) = "]" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 2);
										КонецЕсли;
										ЗапомнитьСтрПрием = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 3);
										Если СокрЛП(ЗапомнитьСтрПрием) = "}" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 3);
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								
								//Аверсон СВФР-010150
								
							Иначе
								КодПоОКРБ = СтрТЗОсн.КодПоОКРБ;
								
								//Аверсон ЕАЕ 17.03.2023 СВФР-010150
								ВыводитьР22 = (КодПоОКРБ <> ПредКодПоОКРБ ИЛИ СтрТЗОсн.ПодразделениеОрганизации <> ПредПодразделение);
								ПредКодПоОКРБ = КодПоОКРБ;
								ПредПодразделение = СтрТЗОсн.СтароеПодразделениеОрганизации;
								
								Если Не ВыводитьР22 Тогда
									Если ЗапомнитьСтрНом <> 0 Тогда
										ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНом - 1);
										Если СокрЛП(ЗапомнитьСтр) = "}" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 1, ""); 
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНом - 1);	
										КонецЕсли;
										ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНом - 2);
										Если СокрЛП(ЗапомнитьСтр) = "]" Тогда
											//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
											ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНом - 2);
										КонецЕсли;

									КонецЕсли;
								КонецЕсли;
								//Аверсон СВФР-010150
								
							КонецЕсли;
						Иначе
							КодПоОКРБ = СтрТЗОсн.КодПоОКРБ;
							
							//Аверсон ЕАЕ 17.03.2023 СВФР-010150
							ВыводитьР22 = (КодПоОКРБ <> ПредКодПоОКРБ ИЛИ СтрТЗОсн.ПодразделениеОрганизации <> ПредПодразделение);
							ПредКодПоОКРБ = КодПоОКРБ;
							ПредПодразделение = СтрТЗОсн.ПодразделениеОрганизации;
							//Аверсон СВФР-010150
							Если Не ВыводитьР22 Тогда
								Если ЗапомнитьСтрНомПрием <> 0 Тогда
									ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 1);
									Если СокрЛП(ЗапомнитьСтр) = "}" Тогда
										//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 1, ""); 
										ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 1);	
									КонецЕсли;
									ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 2);
									Если СокрЛП(ЗапомнитьСтр) = "]" Тогда
										//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
										ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 2);
									КонецЕсли;
									ЗапомнитьСтр = ТекстФайла.ПолучитьСтроку(ЗапомнитьСтрНомПрием - 3);
									Если СокрЛП(ЗапомнитьСтр) = "}" Тогда
										//ТекстФайла.ЗаменитьСтроку(ЗапомнитьСтрНом - 2, "");
										ТекстФайла.УдалитьСтроку(ЗапомнитьСтрНомПрием - 3);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						НомСтрокиСовм = 0; //Аверсон ЕАЕ 31.03.2023 СВФР-010150
						
						Если ВыводитьР22 Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150  //новый раздел prof2
							ТекстФайла.ДобавитьСтроку("{"); //Аверсон ЕАЕ 17.03.2023 СВФР-010150
							
							//ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн.КодПоОКРБ)) + Кавычка+",");
							ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(КодПоОКРБ)) + Кавычка+",");
							//Аверсон СВФР-008571
							
							//ТекстФайла.ДобавитьСтроку(Кавычка+"dpr21"+Кавычка+": "+Кавычка+ ?(Пусто,"",Формат(?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПриказаОПриеме),СтрТЗОсн.ДатаПриказаОПриеме,СтрТЗОсн.ДатаПриказаПеревода), "ДФ=дд/ММ/гггг")) + Кавычка+",");  //Аверсон 14.08.2019 КВВ СВФР-004639
							//ТекстФайла.ДобавитьСтроку(Кавычка+"npr21"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(?(ЗначениеЗаполнено(СтрТЗОсн.НомерПриказаОПриеме),СтрТЗОсн.НомерПриказаОПриеме,СтрТЗОсн.НомерПриказаПеревода))) + Кавычка+",");          //Аверсон 14.08.2019 КВВ СВФР-004639
							//ТекстФайла.ДобавитьСтроку(Кавычка+"dfr21"+Кавычка+": "+Кавычка+ ?(Пусто,"",Формат(?(ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема),СтрТЗОсн.ДатаПриема,СтрТЗОсн.ДатаПеревода), "ДФ=дд/ММ/гггг")) + Кавычка+",");          //Аверсон 14.08.2019 КВВ СВФР-004639
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
								Если К = 1 Тогда
									Должность = СтрТЗОсн.СтараяДолжность;
								Иначе
									Должность = СтрТЗОсн.Должность;
								КонецЕсли;
							Иначе
								Должность = СтрТЗОсн.Должность;
							КонецЕсли;
							ТекстФайла.ДобавитьСтроку(Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(ВРЕГ(Должность)) + Кавычка + ",")); 
							
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
								Если К = 1 Тогда
									Подр = СтрТЗОсн.СтароеПодразделениеОрганизации;
								Иначе
									Подр = СтрТЗОсн.ПодразделениеОрганизации;
								КонецЕсли;
							Иначе
								Подр = СтрТЗОсн.ПодразделениеОрганизации;
							КонецЕсли;
							
							Если Организация.ИНН = "806000046" Тогда
								ПодразделениеОрганизацииСтр = ИменительныйПадеж(Подр) + ПолучитьПредставительство(Подр);
							Иначе
								ПодразделениеОрганизацииСтр = СокрЛП(Подр);
							КонецЕсли;
							
							ПодразделениеОрганизацииСтр = СтрЗаменить(ПодразделениеОрганизацииСтр, """", "\" + Кавычка);
							ТекстФайла.ДобавитьСтроку(Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ВРЕГ(ПодразделениеОрганизацииСтр) + Кавычка+","));  
							//Аверсон СВФР-007679
							
							//Аверсон ЕАЕ 22.09.2021 
							//Аверсон 14.08.2019 КВВ СВФР-004639 (
							//КодДоговора = "";
							//Если ЗначениеЗаполнено(СтрТЗОсн.Договор) Тогда
							//	Если СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
							//		КодДоговора = "01";
							//	ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
							//		Если СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.НеопределенСрок Тогда
							//			КодДоговора = "02";
							//		ИначеЕсли СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.Срочный ИЛИ
							//			СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.ОпределенРаботы Тогда
							//			КодДоговора = "03";
							//		КонецЕсли;
							//	ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий Тогда
							//		КодДоговора = "04";
							//	КонецЕсли;
							//Иначе
							//	КодДоговора = "01";
							//КонецЕсли;
							//ТекстФайла.ДобавитьСтроку(Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка + ",");
							//Аверсон 
							
							//Аверсон ЕАЕ 22.09.2021 СВФР-007679
							//ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(СтрТЗОсн.ВнешнееСовместительство) + Кавычка);
							ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ ?(СокрЛП(СтрТЗОсн.ВнутреннееСовместительство)="1","2",СокрЛП(СтрТЗОсн.ВнешнееСовместительство))+ Кавычка); //Аверсон 12.07.2023 КВВ СВФР-011098
							НомСтрокиСовм = ТекстФайла.КоличествоСтрок();
							
						КонецЕсли; //Аверсон СВФР-010150
						
						//r22
						//Если Р3Прием <> 0 ИЛИ Р3Увольнение <> 0 Тогда // Раздел 3
						
						//Аверсон ЕАЕ 10.03.2022 СВФР-008759
						НужнаЗптПослеr22 = Ложь;
						//Аверсон СВФР-008759
						
						//НужноЗакрытьПроф2 = Ложь;
						//НужноЗакрытьР22 = Ложь;
						
						Для Каждого СтрТЗОсн1 Из ТЗОсн Цикл
							Если СтрТЗОсн1.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
								Продолжить;
							КонецЕсли;
							
							//Аверсон 12.07.2023 КВВ СВФР-011098 (
							Если СтрТЗОсн1.Сотрудник <> СтрТЗОсн.Сотрудник Тогда
								Продолжить;
							КонецЕсли;
							//Аверсон 12.07.2023 КВВ СВФР-011098 )
							
							//Аверсон ЕАЕ 14.10.2021 СВФР-008250
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) И СтрТЗОсн.ДатаПеревода <> СтрТЗОсн1.ДатаПеревода Тогда
								Продолжить;	
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) И СтрТЗОсн.ДатаПриема <> СтрТЗОсн1.ДатаПриема Тогда
								Продолжить;	
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) И СтрТЗОсн.ДатаУвольнения <> СтрТЗОсн1.ДатаУвольнения Тогда
								Продолжить;	
							КонецЕсли;
							//Аверсон СВФР-008250
							
							//Если (ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения)) И СокрЛП(СтрТЗОсн1.ВнутреннееСовместительство) = "1" Тогда //Раздел 3
							Если (ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения) ИЛИ ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода)) Тогда //Раздел 3
								Если НомСтрокиСовм <> 0 Тогда //Аверсон ЕАЕ 31.03.2023 СВФР-010150
									СтрокаСовм = ТекстФайла.ПолучитьСтроку(НомСтрокиСовм);
									Если Прав(СтрокаСовм, 1) <> "," Тогда
										ТекстФайла.ЗаменитьСтроку(НомСтрокиСовм, СтрокаСовм + ","); 	
									КонецЕсли;
								КонецЕсли;
								
								Если ВыводитьР22 Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"r22"+Кавычка+": [");
									
									//Аверсон ЕАЕ 10.03.2022 СВФР-008759
									НужнаЗптПослеr22 = Истина;
									//Аверсон СВФР-008759
									
									ТекстФайла.ДобавитьСтроку("{");
									
								КонецЕсли; //Аверсон СВФР-010150
								
								//ТекстФайла.ДобавитьСтроку(Кавычка+"prof3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн1.Должность.КодПоОКПДТР)) + Кавычка+",");    
								Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) Тогда
									ТекстФайла.ДобавитьСтроку(Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн1.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									ТекстФайла.ДобавитьСтроку(Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн1.ДатаПриказаОПриеме, "ДФ=дд/ММ/гггг")) + Кавычка+",");    
									ТекстФайла.ДобавитьСтроку(Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(СтрТЗОсн1.НомерПриказаОПриеме)) + Кавычка+ ",");  //Аверсон 20.08.2019 КВВ СВФР-004658   
									
									//Аверсон ЕАЕ 29.09.2021 СВФР-007679
								ИначеЕсли ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) И К = 2 Тогда
									
									//Аверсон ЕАЕ 17.03.2023 СВФР-010150
									Если Не ВыводитьР22 Тогда
										ТекстФайла.ДобавитьСтроку("{");	
									КонецЕсли;
									//Аверсон СВФР-010150
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн1.ДатаПеревода, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									ТекстФайла.ДобавитьСтроку(Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн1.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",");    
									ТекстФайла.ДобавитьСтроку(Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(СтрТЗОсн1.НомерПриказаПеревода)) + Кавычка+ ",");   
									//Аверсон СВФР-007679
									
									//Если Не ВыводитьР22 Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150
									//	
										//ТекстФайла.ДобавитьСтроку("}");	 //05.04.2023
										//ТекстФайла.ДобавитьСтроку("]"); 
										//ТекстФайла.ДобавитьСтроку("}");
									//	
									//КонецЕсли; //Аверсон СВФР-010150
									
								КонецЕсли;
								
								//Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) Тогда //Аверсон ЕАЕ 29.09.2021 СВФР-007679
								//	КодДоговора = "";
								//	Если ЗначениеЗаполнено(СтрТЗОсн.Договор) Тогда
								//		Если СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
								//			КодДоговора = "01";
								//		ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
								//			Если СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.НеопределенСрок Тогда
								//				КодДоговора = "02";
								//			ИначеЕсли СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.Срочный ИЛИ
								//				СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.ОпределенРаботы Тогда
								//				КодДоговора = "03";
								//			КонецЕсли;
								//		ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий Тогда
								//			КодДоговора = "04";
								//		КонецЕсли;
								//	Иначе
								//		КодДоговора = "01";
								//	КонецЕсли;
								//	ТекстФайла.ДобавитьСтроку(Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка + ?(ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения),",", ""));
								//КонецЕсли; //Аверсон СВФР-007679
								
								//Аверсон ЕАЕ 15.09.2022 СВФР-009493
								Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) ИЛИ (ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) И К = 2) Тогда //Аверсон ЕАЕ 29.09.2021 СВФР-007679
									КодДоговора = "";
									Если ЗначениеЗаполнено(СтрТЗОсн.Договор) Тогда
										Если СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
											КодДоговора = "01";
										ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
											Если СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.НеопределенСрок Тогда 
												КодДоговора = "02";
											ИначеЕсли СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.Срочный ИЛИ
												СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.ОпределенРаботы Тогда
												КодДоговора = "03";
											КонецЕсли;
										ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий Тогда
											КодДоговора = "04";
										КонецЕсли;
									Иначе
										КодДоговора = "01";
									КонецЕсли;
									Если СтрТЗОсн1.ВнутреннееСовместительство = "1" Тогда
										КодДоговора = "03";
									КонецЕсли;
									ТекстФайла.ДобавитьСтроку(Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка + ?(ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения),",", ""));
								КонецЕсли; //Аверсон СВФР-007679
								//Аверсон СВФР-009493
								
								Если (ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) И К = 2) ИЛИ ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150
									//Если Не ВыводитьР22 Тогда //05.04.2023
										
										ТекстФайла.ДобавитьСтроку("}");	 //05.04.2023
										ТекстФайла.ДобавитьСтроку("]"); 
										//ТекстФайла.ДобавитьСтроку("}");
										
									//КонецЕсли; 
								КонецЕсли; //Аверсон СВФР-010150
								
								Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения) Тогда
									ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн1.ДатаУвольнения, "ДФ=дд/ММ/гггг") + Кавычка+",");      
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн1.ДатаПриказаОбУвольнении, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
									ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн1.НомерПриказаОбУвольнении)) + Кавычка+",");    
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"koduv3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн1.КодОснованияУвольнения)) + Кавычка);  
									
									//Аверсон ЕАЕ 07.10.2021 СВФР-007679
									
									ТекстФайла.ДобавитьСтроку("}");
									ТекстФайла.ДобавитьСтроку("]");
									
								ИначеЕсли ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) И К = 1 Тогда
									
									//Аверсон ЕАЕ 22.02.2022 СВФР-008759
									
									//Аверсон ЕАЕ 10.04.2022 СВФР-008855
									//Если НачалоДня(СтрТЗОсн1.ДатаПеревода) = НачалоДня(КонецКвартала(ДатаРегистрации) + 1) Тогда
									//	ДатПеревода = КонецКвартала(ДатаРегистрации);
									Если НачалоДня(СтрТЗОсн1.ДатаПеревода) = НачалоДня(КонецДня(ДатаОкончания) + 1) Тогда
										ДатПеревода = ДатаОкончания;
										//Аверсон СВФР-008855
										
									Иначе
										ДатПеревода = СтрТЗОсн1.ДатаПеревода - 1;
									КонецЕсли;
									//ТекстФайла.ДобавитьСтроку("{");
									//ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн1.ДатаПеревода-1, "ДФ=дд/ММ/гггг") + Кавычка+",");
									ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(ДатПеревода, "ДФ=дд/ММ/гггг") + Кавычка+",");
									//Аверсон СВФР-008759
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн1.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
									ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн1.НомерПриказаПеревода)) + Кавычка);    
									
									//Аверсон ЕАЕ 31.03.2023 СВФР-010150
									//Если ВыводитьР22 Тогда
									    ТекстФайла.ДобавитьСтроку("}");
										ТекстФайла.ДобавитьСтроку("]");	//Запоминаем1 = ТекстФайла.КоличествоСтрок();
									//КонецЕсли;
									//Аверсон СВФР-010150
									
								КонецЕсли;
								
								//Аверсон ЕАЕ 15.09.2022 СВФР-009493 (перенесено выше)
								//Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаПриема) ИЛИ (ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода) И К = 2) Тогда //Аверсон ЕАЕ 29.09.2021 СВФР-007679
								//	КодДоговора = "";
								//	Если ЗначениеЗаполнено(СтрТЗОсн.Договор) Тогда
								//		Если СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда
								//			КодДоговора = "01";
								//		ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
								//			Если СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.НеопределенСрок Тогда
								//				КодДоговора = "02";
								//			ИначеЕсли СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.Срочный ИЛИ
								//				СтрТЗОсн.Договор.ТипТрудовогоДоговора = Перечисления.ВидыТрудовыхДоговоров.ОпределенРаботы Тогда
								//				КодДоговора = "03";
								//			КонецЕсли;
								//		ИначеЕсли СтрТЗОсн.Договор.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий Тогда
								//			КодДоговора = "04";
								//		КонецЕсли;
								//	Иначе
								//		КодДоговора = "01";
								//	КонецЕсли;
								//	Если СтрТЗОсн1.ВнутреннееСовместительство = "1" Тогда
								//		КодДоговора = "03";
								//	КонецЕсли;
								//	ТекстФайла.ДобавитьСтроку(Кавычка+"kod"+Кавычка+": "+Кавычка + ?(Пусто,"",КодДоговора) + Кавычка + ?(ЗначениеЗаполнено(СтрТЗОсн1.ДатаУвольнения),",", ""));
								//КонецЕсли; //Аверсон СВФР-007679
								//Аверсон СВФР-007679
								//Аверсон СВФР-009493
								
								//Аверсон СВФР-007679
								
								//Если Не ВыводитьР22 Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150
								//	
									//ТекстФайла.ДобавитьСтроку("}");	//05.04.2023 закрываем r22
									//ТекстФайла.ДобавитьСтроку("]"); 
								//	
								//КонецЕсли; //Аверсон СВФР-010150
							КонецЕсли;
						КонецЦикла;
						//КонецЕсли;
						
						//r23
						Если Найти(СокрЛП(Должность), "Водитель") > 0 Тогда
							Для Каждого СтрТЗОсн1 Из ТЗОсн Цикл
								Если СтрТЗОсн1.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
									Продолжить;
								КонецЕсли;
								СтруктураКлассность = Новый Структура;
								СтруктураКлассность.Вставить("ДатаПрисвоения");
								СтруктураКлассность.Вставить("Процент");
								Если ЕстьКлассность(СтрТЗОсн1.ФизЛицо, СтрТЗОсн1.ДатаДок, СтруктураКлассность, ВидыРасчетаКлассность) Тогда
									СтрокаСовм = ТекстФайла.ПолучитьСтроку(НомСтрокиСовм);
									Если Прав(СтрокаСовм, 1) <> "," Тогда
										ТекстФайла.ЗаменитьСтроку(НомСтрокиСовм, СтрокаСовм + ","); 	
									КонецЕсли;
									
									//Аверсон ЕАЕ 10.03.2022 СВФР-008759
									Если НужнаЗптПослеr22 = Истина Тогда
										ТекстФайла.ДобавитьСтроку(",");
									КонецЕсли;
									//Аверсон СВФР-008759
									
									ТекстФайла.ДобавитьСтроку(Кавычка+"r23"+Кавычка+": [");
									ТекстФайла.ДобавитьСтроку("{");
									ТекстФайла.ДобавитьСтроку(Кавычка+"dfr22" + Кавычка + ": "+Кавычка + Формат(СтруктураКлассность.ДатаПрисвоения, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									ТекстФайла.ДобавитьСтроку(Кавычка+"dpr22" + Кавычка + ": "+Кавычка + Формат(СтрТЗОсн1.ДатаПриказаОПрисвоенииКвалификационнойКатегории, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									ТекстФайла.ДобавитьСтроку(Кавычка+"npr22" + Кавычка + ": "+Кавычка + СокрЛП(СтрТЗОсн1.НомерПриказаОПрисвоенииКвалификационнойКатегории) + Кавычка+",");     
									
									Разряд = ПолучитьРазряд(СтрТЗОсн.КодПоОКРБ);
									ТекстФайла.ДобавитьСтроку(Кавычка+"rzrd" + Кавычка + ": "+Кавычка + Разряд + Кавычка+",");     
									//ТекстФайла.ДобавитьСтроку(Кавычка+"ktgr" + Кавычка + ": "+Кавычка + Формат(СтрТЗОсн1.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									
									Класс = ПолучитьКлассВодителя(СтруктураКлассность.Процент);
									ТекстФайла.ДобавитьСтроку(Кавычка+"kls" + Кавычка + ": "+Кавычка + СокрЛП(Класс) + Кавычка);     
									//ТекстФайла.ДобавитьСтроку(Кавычка+"klsgos" + Кавычка + ": "+Кавычка + Формат(СтрТЗОсн1.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");     
									
									ТекстФайла.ДобавитьСтроку("}");	
									ТекстФайла.ДобавитьСтроку("]");
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						//Аверсон СВФР-007679
						
						//Аверсон 14.08.2019 КВВ СВФР-004639 )
						//	ТекстФайла.ДобавитьСтроку(Кавычка+"dpr22"+Кавычка+": "+Кавычка + Кавычка+",");    //?????????? 
						//	ТекстФайла.ДобавитьСтроку(Кавычка+"npr22"+Кавычка+": "+Кавычка + Кавычка+",");    //?????????? 
						//	ТекстФайла.ДобавитьСтроку(Кавычка+"dfr22"+Кавычка+": "+Кавычка + Кавычка);    //??????????
						
						//Если Не ВыводитьР22 Тогда //Аверсон ЕАЕ 17.03.2023 СВФР-010150
						//Если ЗначениеЗаполнено(СтрТЗОсн1.ДатаПеревода)	
						ТекстФайла.ДобавитьСтроку("}");
							
						//КонецЕсли; //Аверсон СВФР-010150
						
						//Аверсон 20.08.2019 КВВ СВФР-004658 (
						//	Если (Р1Прием<>0 И Р2Перевод=0) ИЛИ (Р1Прием<>0 И Р2Перевод<>0 И СчПеревод=Р2Перевод) ИЛИ (Р1Прием=0 И СчПеревод=Р2Перевод) Тогда
						//Если Р2Перевод + Р1Прием + Р3Прием = СчR2 Тогда
						
						//Аверсон ЕАЕ 22.09.2021 СВФР-007679
						//ТекстФайла.ДобавитьСтроку("]" + ?(Р3Прием<>0 ИЛИ Р3Увольнение<>0,",",""));
						
						Если Ном1 = КоличествоСтрокСотр Тогда //Аверсон ЕАЕ 14.10.2021 СВФР-008250
							Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПеревода) Тогда
								Если К = 2 Тогда
									ТекстФайла.ДобавитьСтроку("]");
									
									//Аверсон ЕАЕ 09.03.2022 СВФР-008759
									r2НужноЗакрытьКвадратнойСкобкой = Ложь;
									//Аверсон СВФР-008759
									
									//Аверсон ЕАЕ 10.04.2022 СВФР-008855
									//ИначеЕсли К = 1 И НачалоДня(СтрТЗОсн.ДатаПеревода) = НачалоКвартала(КонецКвартала(ДатаРегистрации) + 1) Тогда
								ИначеЕсли К = 1 И НачалоДня(СтрТЗОсн.ДатаПеревода) = НачалоКвартала(КонецДня(ДатаОкончания) + 1) Тогда
									//Аверсон СВФР-008855
									
									ТекстФайла.ДобавитьСтроку("]");
									r2НужноЗакрытьКвадратнойСкобкой = Ложь;	
								КонецЕсли;
							Иначе
								ТекстФайла.ДобавитьСтроку("]");
								
								//Аверсон ЕАЕ 09.03.2022 СВФР-008759
								r2НужноЗакрытьКвадратнойСкобкой = Ложь;
								//Аверсон СВФР-008759
								
							КонецЕсли;
						КонецЕсли;
						
						//Аверсон СВФР-007679
						
						//КонецЕсли;
						//Аверсон 20.08.2019 КВВ СВФР-004658 )
						
					КонецЦикла;
					
					//Аверсон ЕАЕ 09.03.2022 СВФР-008759
					Если r2НужноЗакрытьКвадратнойСкобкой = Истина  И Ном1 = ТЗОсн.Количество() Тогда
						ТекстФайла.ДобавитьСтроку("]");	
						r2НужноЗакрытьКвадратнойСкобкой = Ложь;
					КонецЕсли;
					//Аверсон СВФР-008759
					
				КонецЕсли;  //конец Раздел2
				
				//Если (ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения)) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "1" Тогда //Раздел 3
				//	ТекстФайла.ДобавитьСтроку(Кавычка+"r3"+Кавычка+": [");  
				//	ТекстФайла.ДобавитьСтроку("{");
				//	ТекстФайла.ДобавитьСтроку(Кавычка+"prof3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.Должность.КодПоОКПДТР)) + Кавычка+",");    
				//	Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) Тогда
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");     
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОПриеме, "ДФ=дд/ММ/гггг")) + Кавычка+",");    
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОПриеме)) + Кавычка+ ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения),",",""));  //Аверсон 20.08.2019 КВВ СВФР-004658   
				//	КонецЕсли;
				//	Если ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) Тогда
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн.ДатаУвольнения, "ДФ=дд/ММ/гггг") + Кавычка+",");      
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"koduv3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.КодОснованияУвольнения)) + Кавычка+",");  
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОбУвольнении, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
				//		ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОбУвольнении)) + Кавычка);    
				//	КонецЕсли;
				//	ТекстФайла.ДобавитьСтроку("}");	
				//	ТекстФайла.ДобавитьСтроку("]"); 
				//КонецЕсли;  //конец Раздел 3
			КонецЦикла;  
			
			//Аверсон ЕАЕ 22.09.2021 
			//Аверсон 20.08.2019 КВВ СВФР-004658 (
			//Если Р3Прием <> 0 ИЛИ Р3Увольнение <> 0 Тогда // Раздел 3
			//	Для Каждого СтрТЗОсн Из ТЗОсн Цикл
			//		Если СтрТЗОсн.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
			//			Продолжить;
			//		КонецЕсли;
			//		Если (ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) ИЛИ ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения)) И СокрЛП(СтрТЗОсн.ВнутреннееСовместительство) = "1" Тогда //Раздел 3
			//			ТекстФайла.ДобавитьСтроку(Кавычка+"r3"+Кавычка+": [");  
			//			ТекстФайла.ДобавитьСтроку("{");
			//			ТекстФайла.ДобавитьСтроку(Кавычка+"prof3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.Должность.КодПоОКПДТР)) + Кавычка+",");    
			//			Если ЗначениеЗаполнено(СтрТЗОсн.ДатаПриема) Тогда
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"dfr3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн.ДатаПриема, "ДФ=дд/ММ/гггг") + Кавычка+",");     
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"dpr31"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОПриеме, "ДФ=дд/ММ/гггг")) + Кавычка+",");    
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"npr31"+Кавычка+": "+Кавычка +  ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОПриеме)) + Кавычка+ ?(ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения),",",""));  //Аверсон 20.08.2019 КВВ СВФР-004658   
			//			КонецЕсли;
			//			Если ЗначениеЗаполнено(СтрТЗОсн.ДатаУвольнения) Тогда
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн.ДатаУвольнения, "ДФ=дд/ММ/гггг") + Кавычка+",");      
			//				
			//				//Аверсон ЕАЕ 22.09.2021 СВФР-007679
			//				//ТекстФайла.ДобавитьСтроку(Кавычка+"koduv3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.КодОснованияУвольнения)) + Кавычка+",");  
			//				//Аверсон СВФР-007679
			//				
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн.ДатаПриказаОбУвольнении, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.НомерПриказаОбУвольнении)) + Кавычка);    
			//				
			//				//Аверсон ЕАЕ 22.09.2021 СВФР-007679
			//				ТекстФайла.ДобавитьСтроку(Кавычка+"koduv3"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн.КодОснованияУвольнения)) + Кавычка+",");  
			//				//Аверсон СВФР-007679
			//			КонецЕсли;
			//			ТекстФайла.ДобавитьСтроку("}");	
			//			ТекстФайла.ДобавитьСтроку("]"); 
			//		КонецЕсли;  //конец Раздел 3
			//	КонецЦикла;
			//КонецЕсли;
			//Аверсон 20.08.2019 КВВ СВФР-004658 )
			//Аверсон
			
			//Аверсон ЕАЕ 22.02.2022 СВФР-008759
			//Приказ о присвоении разряда
			Для Каждого СтрТЗОсн1 Из ТЗОсн Цикл
				Если СтрТЗОсн1.ФизЛицо <> СтрТЗСотр.ФизЛицо Тогда
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрТЗОсн1.ДатаПрисвоенияРазряда) Тогда
					Продолжить;
				КонецЕсли;
				
				//р.2.1
				//НужныСкобкиПослеr2 = Ложь;
				Если Не БылПеревод Тогда
					ТекстФайла.ДобавитьСтроку(Кавычка+"r1"+Кавычка+": [],");
					ТекстФайла.ДобавитьСтроку(Кавычка+"r2"+Кавычка+": [{");
					//НужныСкобкиПослеr2 = Истина;
					
					ТекстФайла.ДобавитьСтроку(Кавычка+"prof2"+Кавычка+": "+Кавычка+ ?(Пусто,"",СокрЛП(СтрТЗОсн1.КодПоОКРБ)) + Кавычка+",");
					ТекстФайла.ДобавитьСтроку(Кавычка+"nameprf"+Кавычка+": "+Кавычка+ ?(Пусто, "", СокрЛП(СтрТЗОсн1.Должность) + Кавычка + ","));
					Подр = СтрТЗОсн1.ПодразделениеОрганизации;
					Если Организация.ИНН = "806000046" Тогда
						ПодразделениеОрганизацииСтр = ИменительныйПадеж(Подр) + ПолучитьПредставительство(Подр);
					Иначе
						ПодразделениеОрганизацииСтр = СокрЛП(Подр);
					КонецЕсли;
					
					ПодразделениеОрганизацииСтр = СтрЗаменить(ПодразделениеОрганизацииСтр, """", "\" + Кавычка);
					ТекстФайла.ДобавитьСтроку(Кавычка+"podr"+Кавычка+": "+Кавычка+ ?(Пусто,"",ПодразделениеОрганизацииСтр + Кавычка+","));
					ТекстФайла.ДобавитьСтроку(Кавычка+"sovm"+Кавычка+": "+Кавычка+ СокрЛП(СтрТЗОсн1.ВнешнееСовместительство) + Кавычка+",");
					
					ТекстФайла.ДобавитьСтроку(Кавычка+"r22"+Кавычка+": [");
					ТекстФайла.ДобавитьСтроку("{");
					ТекстФайла.ДобавитьСтроку(Кавычка+"dto3"+Кавычка+": "+Кавычка + Формат(СтрТЗОсн1.ДатаПеревода-1, "ДФ=дд/ММ/гггг") + Кавычка+",");      
					ТекстФайла.ДобавитьСтроку(Кавычка+"dpr32"+Кавычка+": "+Кавычка + ?(Пусто,"",Формат(СтрТЗОсн1.ДатаПриказаПеревода, "ДФ=дд/ММ/гггг")) + Кавычка+",");  
					ТекстФайла.ДобавитьСтроку(Кавычка+"npr32"+Кавычка+": "+Кавычка + ?(Пусто,"",СокрЛП(СтрТЗОсн1.НомерПриказаПеревода)) + Кавычка);
					ТекстФайла.ДобавитьСтроку("}");	
					ТекстФайла.ДобавитьСтроку("]");
				КонецЕсли;
				
				//здесь удалим скобки из 2 предыдущих строк
				Если БылПеревод Тогда
					//"]"
					НомСтр = ТекстФайла.КоличествоСтрок();
					НужнаяСтр = ТекстФайла.ПолучитьСтроку(НомСтр);
					Если СокрЛП(НужнаяСтр) = "]" Тогда
						ТекстФайла.УдалитьСтроку(НомСтр);
					КонецЕсли;
					//"}"
					НомСтр = ТекстФайла.КоличествоСтрок();
					НужнаяСтр = ТекстФайла.ПолучитьСтроку(НомСтр);
					Если СокрЛП(НужнаяСтр) = "}" Тогда
						ТекстФайла.УдалитьСтроку(НомСтр);
					КонецЕсли;
				КонецЕсли;
				
				ТекстФайла.ДобавитьСтроку(",");
				
				//р.2.3
				ТекстФайла.ДобавитьСтроку(Кавычка+"r23"+Кавычка+": [");
				ТекстФайла.ДобавитьСтроку("{");
				ТекстФайла.ДобавитьСтроку(Кавычка+"dfr22" + Кавычка + ": "+Кавычка + Формат(СтрТЗОсн1.ДатаПрисвоенияРазряда, "ДФ=дд/ММ/гггг") + Кавычка+",");     
				ТекстФайла.ДобавитьСтроку(Кавычка+"dpr22" + Кавычка + ": "+Кавычка + Формат(СтрТЗОсн1.ДатаПриказаОПрисвоенииРазряда, "ДФ=дд/ММ/гггг") + Кавычка+",");     
				ТекстФайла.ДобавитьСтроку(Кавычка+"npr22" + Кавычка + ": "+Кавычка + СокрЛП(СтрТЗОсн1.НомерПриказаОПрисвоенииРазряда) + Кавычка+",");     
				
				КодПоОКРБСтр = СтрТЗОсн1.КодПоОКРБ;	//"2619-015-02-3-00"
				РабочийСлужащий = Сред(КодПоОКРБСтр, 10, 2);
				Если РабочийСлужащий = "01" Тогда //Рабочий
					ТекстФайла.ДобавитьСтроку(Кавычка+"rzrd" + Кавычка + ": "+Кавычка + СокрЛП(СтрТЗОсн1.РазрядЕТС) + Кавычка);
				Иначе
					Ктгр = Сред(КодПоОКРБСтр, 13, 1);
					ТекстФайла.ДобавитьСтроку(Кавычка+"ktgr" + Кавычка + ": "+Кавычка + Ктгр + Кавычка);
				КонецЕсли;
				
				ТекстФайла.ДобавитьСтроку("}");	
				ТекстФайла.ДобавитьСтроку("]");
				
				//Если НужныСкобкиПослеr2 = Истина Тогда
				ТекстФайла.ДобавитьСтроку("}");	
				ТекстФайла.ДобавитьСтроку("]");
				//КонецЕсли;
			КонецЦикла;
			//Аверсон СВФР-008759
			
			ТекстФайла.ДобавитьСтроку("}"+ ?(ТЗСотр.Индекс(СтрТЗСотр)<>ТЗСотр.Количество()-1,",","")); //Аверсон 20.08.2019 КВВ СВФР-004658 
		КонецЦикла;
		ТекстФайла.ДобавитьСтроку("]");
		ТекстФайла.ДобавитьСтроку("}");
		
		//Аверсон ЕАЕ 22.09.2021 СВФР-007679
		//ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		Если ЗначениеЗаполнено(ПутьВыгрузки) Тогда
			ПутьКФайлу = ПутьВыгрузки;
		Иначе
			ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		КонецЕсли;
		//Аверсон СВФР-007679
		
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		ИмяФайлаПачки = ПроцедурыПерсонифицированогоУчета.ПолучитьИмяФайлаФормыПУ( 2,
		
		//Аверсон ЕАЕ 10.04.2022 СВФР-008855
		//1, ДатаРегистрации, Организация );
		1, ДатаНачала, Организация );
		//Аверсон СВФР-008855
		
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			Попытка 		
				//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
				//ТекстФайла.Записать(ПутьКФайлу+"\"+ИмяПачки+".txt",КодировкаТекста.ANSI);
				//Сообщить("Файл сохранен: " + ПутьКФайлу+"\"+ИмяПачки+".txt");      		
				//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
				//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
				ТекстФайла.Записать( ПутьКФайлу + "\" + ИмяФайлаПачки, КодировкаТекста.ANSI );
				Сообщить( "Файл сохранен: " + ПутьКФайлу + "\" + ИмяФайлаПачки );
				//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
			Исключение
				Сообщить("Неверный путь! Файл не выгружен.");
			КонецПопытки;
		иначе
			РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
			б = Сред(РабочийКаталог,7);
			в = Найти(б,Символ(34));
			путьИБ = Лев(б, в-1);
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			//ТекстФайла.Записать(путьИБ+"\"+ИмяПачки+".txt",КодировкаТекста.ANSI);
			//Сообщить("Файл сохранен: " + путьИБ+"\"+ИмяПачки+".txt");
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			ТекстФайла.Записать(путьИБ+"\"+ИмяФайлаПачки,КодировкаТекста.ANSI);
			Сообщить("Файл сохранен: " + путьИБ+"\"+ИмяФайлаПачки);
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		КонецЕсли;
		
		Возврат ТекстФайла; 
	КонецФункции 
	
	//Процедура вывода файла сведений на печать
	Процедура ПечатьФайла(РежимПечати = 0, МестоВызова = "") Экспорт
		
		ЕстьОшибки = Ложь;
		ТекстФайла = РегламентированнаяОтчетность.ПолучитьТекстФайла(ЭтотОбъект,ЕстьОшибки);
		Если ЕстьОшибки тогда
			Возврат;
		КонецЕсли;	 
		
		Макет = ПолучитьМакет("ФормаАДВ_1");
		ДокументРезультат = Новый ТабличныйДокумент;
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_ФормаАДВ_1";
		
		//Получаем таблицу формата записи
		ДокументФорматЗаписей = ПолучитьМакет("ФорматЗаписей");
		ТаблицаФорматаЗаписи = РегламентированнаяОтчетность.ПолучитьФорматЗаписи("АНКТ",ДокументФорматЗаписей);
		
		//Получаем инициализированную структуру, соответствующую формату записи 
		//ПустаяЗапись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		
		//Обработка заголовка файла
		ИнформацияОПачке = Новый Структура;
		Если ПроцедурыПерсонифицированогоУчета.РазобратьЗаголовокФайла(ТекстФайла,ИнформацияОПачке)=0 тогда
			Возврат;
		КонецЕсли;	
		
		//Обработка документов файла
		ОбластьАнкета = Макет.ПолучитьОбласть("Анкета");
		
		Для Н=5 по СтрЧислоСтрок(ТекстФайла) цикл
			//Прочитаем запись из файла
			СтрокаФайла = СтрПолучитьСтроку(ТекстФайла,Н);
			Запись = ПроцедурыПерсонифицированогоУчета.ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
			СтрОшибка = "";
			Если НЕ ПроцедурыПерсонифицированогоУчета.РазложитьСтрокуВСтруктуруЗаписи(СтрокаФайла,"АНКТ",ТаблицаФорматаЗаписи,Запись,СтрОшибка) тогда
				Сообщить("Ошибка в строке файла № "+Н+": "+СтрОшибка);
				Возврат;
			КонецЕсли;	
			
			ОбластьАнкета.Параметры.ДатаЗаполнения					= 	"Дата заполнения "+ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДатаЗаполнения);
			ОбластьАнкета.Параметры.Фамилия 						= Запись.Фамилия; 
			ОбластьАнкета.Параметры.Имя 							= Запись.Имя; 
			ОбластьАнкета.Параметры.Отчество 						= Запись.Отчество; 
			ОбластьАнкета.Параметры.Пол 							= Запись.Пол+"     (м/ж)"; 
			ОбластьАнкета.Параметры.ДатаРождения 					= ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.СтандартнаяДатаРождения); 
			
			//Место рождения
			ОбластьАнкета.Параметры.МестоРожденияТип 				= 	?(Запись.ТипМестаРождения = "ОСОБОЕ", "особое", "");
			ОбластьАнкета.Параметры.МестоРожденияГород 				= 	Запись.МестоРожденияНаселенныйПункт;
			ОбластьАнкета.Параметры.МестоРожденияРайон 				= 	Запись.МестоРожденияРайон;
			ОбластьАнкета.Параметры.МестоРожденияОбласть			= 	Запись.МестоРожденияОбласть;
			ОбластьАнкета.Параметры.МестоРожденияСтрана			 	= 	Запись.МестоРожденияСтрана;
			
			ОбластьАнкета.Параметры.Гражданство 					= 	Запись.Гражданство;
			
			//Паспортные данные
			НаименованиеДокумента 									= 	Запись.ДокументНаименование;
			Серия1 													= 	Запись.ДокументСерияРимскиеЦифры;
			Серия2 													= 	Запись.ДокументСерияРусскиеБуквы;
			
			СерияНомер = Серия1 +?( СокрЛП(НаименованиеДокумента) 	= ВРЕГ("паспорт РБ"), " ", ?( СокрЛП(НаименованиеДокумента) = ВРЕГ("паспорт"), "-", "") ) + Серия2 +",  " + Формат(Запись.ДокументНомер,"ЧГ=0");
			
			ОбластьАнкета.Параметры.НаименованиеДокумента		= 	НаименованиеДокумента;
			ОбластьАнкета.Параметры.СерияНомер			 		= 	СерияНомер;
			ОбластьАнкета.Параметры.ДатаВыдачи 					= 	ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДокументДатаВыдачи);
			ОбластьАнкета.Параметры.КемВыдан 					= 	Запись.ДокументКемВыдан;
			
			//Адреса
			ОбластьАнкета.Параметры.АдресРегистрации 			=	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресРегистрации,0,"");
			ОбластьАнкета.Параметры.АдресФактический 			= 	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресФактический,0,"");
			ОбластьАнкета.Параметры.Телефоны 					= 	Запись.Телефоны;
			
			ДокументРезультат.Вывести(ОбластьАнкета);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		РаботаСДиалогами.НапечататьДокумент(ДокументРезультат,1,Ложь,"Анкета застрахованного лица АДВ-1");
		
		//Печать описи документов
		ДокументОписи = Новый ТабличныйДокумент;
		ДокументОписи.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_АДВ_6";
		ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,Дата,Ответственный.ФизЛицо);
		ПроцедурыПерсонифицированогоУчета.ВывестиОписьАДВ6(ДокументОписи,ИнформацияОПачке,ОтветственныеЛица);
		РаботаСДиалогами.НапечататьДокумент(ДокументОписи,1,Ложь,"Опись документов АДВ-6");
	КонецПроцедуры
	
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Номер, 
	|	Организация,
	|	Ответственный,
	| 	Ссылка
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Выбирает данные, необходимые для заполнения утвержденных форм как из спр-ка
//  физлиц, так и из соотв. регистров сведений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Результат запроса к данным работников документа.
//
Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности" , Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АнкетаЗастрахованногоЛицаРаботники.НомерСтроки КАК НомерСтроки,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо КАК ФизЛицо,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер
	|	КОНЕЦ КАК ЛичныйНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия
	|	КОНЕЦ КАК ДокументСерия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер
	|	КОНЕЦ КАК ДокументНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи
	|	КОНЕЦ КАК ДокументДатаВыдачи,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан
	|	КОНЕЦ КАК ДокументКемВыдан,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации
	|	КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации
	|	КОНЕЦ КАК ИндексРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Телефоны ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Телефоны
	|	КОНЕЦ КАК Телефоны,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Фамилия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Фамилия
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Имя ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Имя
	|	КОНЕЦ КАК Имя,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Отчество ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Отчество
	|	КОНЕЦ КАК Отчество,
	|	АнкетаЗастрахованногоЛицаРаботники.Пол,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриема ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриема
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаРождения
	|	КОНЕЦ КАК ДатаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ГородРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ГородРождения
	|	КОНЕЦ КАК ГородРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.Гражданство.Наименование КАК Страна,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.РайонРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.РайонРождения
	|	КОНЕЦ КАК РайонРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.СтранаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения
	|	КОНЕЦ КАК ОбластьРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.СтатусКатегория.КодПФР КАК КодФСЗН,
	|	АнкетаЗастрахованногоЛицаРаботники.Документ,
	|	АнкетаЗастрахованногоЛицаРаботники.ВнешнееСовместительство,
	|	АнкетаЗастрахованногоЛицаРаботники.ВнутреннееСовместительство, //Аверсон 20.08.2019 КВВ СВФР-004658
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОПриеме ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОПриеме
	|	КОНЕЦ КАК ДатаПриказаОПриеме,
	|ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Договор ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Договор
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОбУвольнении ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОбУвольнении
	|	КОНЕЦ КАК ДатаПриказаОбУвольнении,  
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОПриеме ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОПриеме
	|	КОНЕЦ КАК НомерПриказаОПриеме,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОбУвольнении ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОбУвольнении
	|	КОНЕЦ КАК НомерПриказаОбУвольнении,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.КодОснованияУвольнения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.КодОснованияУвольнения
	|	КОНЕЦ КАК КодОснованияУвольнения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаПеревода ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаПеревода
	|	КОНЕЦ КАК ДатаПриказаПеревода,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.НомерПриказаПеревода ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.НомерПриказаПеревода
	|	КОНЕЦ КАК НомерПриказаПеревода,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПеревода ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПеревода
	|	КОНЕЦ КАК ДатаПеревода,
	|	АнкетаЗастрахованногоЛицаРаботники.Должность,
	
	//Аверсон ЕАЕ 22.09.2021 СВФР-007679
	|	АнкетаЗастрахованногоЛицаРаботники.КодПоОКРБ,
	|	АнкетаЗастрахованногоЛицаРаботники.СтарыйКодПоОКРБ,
	|	АнкетаЗастрахованногоЛицаРаботники.ПодразделениеОрганизации,
	|	АнкетаЗастрахованногоЛицаРаботники.СтароеПодразделениеОрганизации,
	|	АнкетаЗастрахованногоЛицаРаботники.Должность,
	|	АнкетаЗастрахованногоЛицаРаботники.СтараяДолжность,
	|	АнкетаЗастрахованногоЛицаРаботники.ДолжностьОКРБ,
	|	АнкетаЗастрахованногоЛицаРаботники.СтараяДолжностьОКРБ,
	|   АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОПрисвоенииКвалификационнойКатегории,
	|	АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОПрисвоенииКвалификационнойКатегории,
	|	АнкетаЗастрахованногоЛицаРаботники.Сотрудник,
	//Аверсон СВФР-007679
	
	//Аверсон ЕАЕ 22.02.2022 СВФР-008759
	|	АнкетаЗастрахованногоЛицаРаботники.ДатаПрисвоенияРазряда,
	|	АнкетаЗастрахованногоЛицаРаботники.ДатаПриказаОПрисвоенииРазряда,
	|	АнкетаЗастрахованногоЛицаРаботники.НомерПриказаОПрисвоенииРазряда,
	|	АнкетаЗастрахованногоЛицаРаботники.РазрядЕТС,
	|	АнкетаЗастрахованногоЛицаРаботники.СтарыйРазрядЕТС
	//Аверсон СВФР-008759
	
	|ИЗ
	|	Документ.СведенияОДвиженииРаботниковПУ2.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботники
	|ГДЕ
	|	АнкетаЗастрахованногоЛицаРаботники.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	//Островская Татьяна 31.10.2012 № 15                    
	Возврат Запрос.Выполнить();                           
	
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, которая подает сведения!", Отказ, Заголовок);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ответственное лицо!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по работникам, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Фамилия, Имя, Отказ ,Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке № """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";
	// ФизЛицо
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не выбран работник!", Отказ ,Заголовок);
	Иначе	
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + ВыборкаПоСтрокамДокумента.ФизЛицо + " ";
		
		Если  ЗначениеЗаполнено(СтрЗаменить(ВыборкаПоСтрокамДокумента.СтраховойНомерПФР,"-","")) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Уже имеет страховой номер!", Отказ ,Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Фамилия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана фамилия!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Имя) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задано имя!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Пол) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан пол!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаРождения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата рождения!", Отказ ,Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаРождения > Дата тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не может быть больше даты подачи сведений!", Отказ ,Заголовок);
			КонецЕсли;	 
		КонецЕсли;	
		
		Если СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "" 
			или СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "0" Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указано место рождения!", Отказ ,Заголовок);
		КонецЕсли; 
		
		//Паспортные данные
		Если ВыборкаПоСтрокамДокумента.ДокументВид = NULL Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указаны паспортные данные!", Отказ ,Заголовок);
			
		Иначе
			
			//Проверка реквизитов паспортных данных
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументВид) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан вид документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
			Иначе
				Если (ВыборкаПоСтрокамДокумента.ДатаРождения > ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не должна превышать дату выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
				КонецЕсли;
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументСерия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана серия документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан номер документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
		КонецЕсли; 
		
		// Проверка адреса регистрации и проживания
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.АдресРегистрации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан адрес регистрации (юридический адрес)!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресРегистрации)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В адресе регистрации присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресФактический)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В фактическом адресе проживания присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//При проведении файл формируем заново 
	ТекстФайла = "";
	#Если Клиент Тогда
		ТекстФайла = СформироватьВыходнойФайл(Отказ);
	#КонецЕсли
	//Если Отказ тогда
	//	Возврат;
	//КонецЕсли;	 
	
	//Сохраним сформированный файл сведений в регистре сведений
	Если не Отказ Тогда 
		Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
		Запись.Объект = Ссылка;
		Запись.ОписаниеДанных = "Файл-пачка форм ПУ-2";
		Запись.Данные = ТекстФайла; 
	КонецЕсли;
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"ФизЛицо");
	
	//Аверсон ЕАЕ 23.02.2022 СВФР-008759
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Если ПометкаУдаления Тогда
			Набор = РегистрыСведений.ДолжностиПУ2Выгруженные.СоздатьНаборЗаписей();
			Набор.Отбор.ДокументРегистратор.Установить(Ссылка);
			//Набор.Прочитать();
			Набор.Записать();
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-008759
КонецПроцедуры

//Аверсон ЕАЕ 21.09.2021 СВФР-007679
Процедура ЗаполнитьКодПоОКРБ(Стр) Экспорт
	Если ПодбиратьКодыПоКатегориямИПроизводным Тогда
		Должность = Стр.Должность;
		Если ЗначениеЗаполнено(Должность) Тогда
			//КодПоОКРБШаблон = Должность.КодПоОКПДТР;
			//КодПоОКРБ = КодПоОКРБШаблон;
			//РабСлуж = "";
			//Если СтрДлина(КодПоОКРБШаблон) >= 11 Тогда
			//	РабСлуж = Сред(КодПоОКРБШаблон, 10, 2);
			//КонецЕсли;
			//
			//Разряд = "";
			//Если РабСлуж = "01" Тогда
			//	//Если рабочий - определим и заменим разряд в шаблоне кода
			//	//Док = Стр.Документ;
			//	//Если ТипЗнч(Док) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию")
			//	//	ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций")
			//	//	ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") Тогда
			//	//	СтрокаСотрудник = Док.РаботникиОрганизации.Найти(Стр.ФизЛицо, "ФизЛицо");
			//	//	Если СтрокаСотрудник <> Неопределено Тогда
			//	//		Разряд = СокрЛП(СтрокаСотрудник.РазрядЕТС);
			//	//		Если ЗначениеЗаполнено(Разряд) Тогда
			//	//			Если СтрДлина(Разряд) = 1 Тогда
			//	//				Разряд = "0" + Разряд;
			//	//			КонецЕсли;
			//	//			ДлинаКода = СтрДлина(КодПоОКРБШаблон);
			//	//			ДлинаНеизменяемойЧасти = ДлинаКода - 2;
			//	//			НеизменяемаяЧасть = Лев(КодПоОКРБШаблон, ДлинаНеизменяемойЧасти);
			//	//			КодПоОКРБ = НеизменяемаяЧасть + Разряд;
			//	//		КонецЕсли;
			//	//	КонецЕсли;
			//	//КонецЕсли;
			//ИначеЕсли РабСлуж = "02" Тогда
			//	//Если служащий - определим и заменим категорию в шаблоне кода
			//	НаименованиеДолжности = СокрЛП(Стр.Должность);
			//	ПозКатегории = Найти(НаименованиеДолжности, "категории");
			//	Если ПозКатегории <> 0 Тогда
			//		НаименованиеДолжностиБезКатегории = СокрЛП(Лев(НаименованиеДолжности, ПозКатегории - 1));
			//		Категория = Прав(НаименованиеДолжностиБезКатегории, 1);
			//		КодПоОКРБ = СтрЗаменить(КодПоОКРБШаблон, "-0-", "-" + Категория + "-");
			//	КонецЕсли;
			//КонецЕсли;
			КодПоОКРБ = ПолучитьКодПоОКРБ(Должность);
			Стр.КодПоОКРБ = КодПоОКРБ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСтарыйКодПоОКРБ(Стр) Экспорт
	Если ПодбиратьКодыПоКатегориямИПроизводным Тогда
		Должность = Стр.СтараяДолжность;
		Если ЗначениеЗаполнено(Должность) Тогда
			//КодПоОКРБШаблон = Должность.КодПоОКПДТР;
			//КодПоОКРБ = КодПоОКРБШаблон;
			//РабСлуж = "";
			//Если СтрДлина(КодПоОКРБШаблон) >= 11 Тогда
			//	РабСлуж = Сред(КодПоОКРБШаблон, 10, 2);
			//КонецЕсли;
			//
			//Если РабСлуж = "01" Тогда
			//	//Разряд = СокрЛП(Стр.СтарыйРазрядЕТС);
			//	//Если ЗначениеЗаполнено(Разряд) Тогда
			//	//	Если СтрДлина(Разряд) = 1 Тогда
			//	//		Разряд = "0" + Разряд;
			//	//	КонецЕсли;
			//	//	ДлинаКода = СтрДлина(КодПоОКРБШаблон);
			//	//	ДлинаНеизменяемойЧасти = ДлинаКода - 2;
			//	//	НеизменяемаяЧасть = Лев(КодПоОКРБШаблон, ДлинаНеизменяемойЧасти);
			//	//	КодПоОКРБ = НеизменяемаяЧасть + Разряд;
			//	//КонецЕсли;
			//ИначеЕсли РабСлуж = "02" Тогда
			//	//Если служащий - определим и заменим категорию в шаблоне кода
			//	НаименованиеДолжности = СокрЛП(Стр.СтараяДолжность);
			//	ПозКатегории = Найти(НаименованиеДолжности, "категории");
			//	Если ПозКатегории <> 0 Тогда
			//		НаименованиеДолжностиБезКатегории = СокрЛП(Лев(НаименованиеДолжности, ПозКатегории - 1));
			//		Категория = Прав(НаименованиеДолжностиБезКатегории, 1);
			//		КодПоОКРБ = СтрЗаменить(КодПоОКРБШаблон, "-0-", "-" + Категория + "-");
			//	КонецЕсли;
			//КонецЕсли;
			КодПоОКРБ = ПолучитьКодПоОКРБ(Должность);
			Стр.СтарыйКодПоОКРБ = КодПоОКРБ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПодобратьДолжностьОКРБ(Должность)
	ДолжностьОКРБ = Справочники.ОКРБ1.ПустаяСсылка();
	Если Не ЗначениеЗаполнено(Должность) 
		ИЛИ ТипЗнч(Должность) <> Тип("СправочникСсылка.ДолжностиОрганизаций") Тогда
		Возврат ДолжностьОКРБ;
	КонецЕсли;
	
	КодОКРБ = СокрЛП(Должность.КодПоОКПДТР);
	Если Не ЗначениеЗаполнено(КодОКРБ) ИЛИ СтрДлина(КодОКРБ) < 11 Тогда
		Возврат ДолжностьОКРБ;	
	КонецЕсли;
	
	КодГруппы = Лев(КодОКРБ, 8);
	КодКатегорииРаботника = Сред(КодОКРБ, 10, 2);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОКРБ1.Ссылка
	|ИЗ
	|	Справочник.ОКРБ1 КАК ОКРБ1
	|ГДЕ
	|	НЕ ОКРБ1.ПометкаУдаления
	|	И НЕ ОКРБ1.ЭтоГруппа
	|	И ОКРБ1.КодГруппы = &КодГруппы
	|	И ОКРБ1.КодКатегорииРаботника = &КодКатегорииРаботника";
	
	Запрос.УстановитьПараметр("КодГруппы", КодГруппы);
	Запрос.УстановитьПараметр("КодКатегорииРаботника", КодКатегорииРаботника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДолжностьОКРБ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат ДолжностьОКРБ;
КонецФункции

Функция ЕстьКлассность(ФизЛицо, НаДату, СтруктураКлассность, ВидыРасчетаКлассность)
	Есть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1 КАК ПроцентКлассности,
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период
	|ИЗ
	|РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&НаДату,
	|		Сотрудник.Физлицо = &ФизЛицо
	|			И ВидРасчета В (&ВидыРасчета)
	|			) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|			где ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Запрос.УстановитьПараметр("ВидыРасчета", ВидыРасчетаКлассность);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Есть = Истина;
		СтруктураКлассность.ДатаПрисвоения = ВыборкаДетальныеЗаписи.Период;
		СтруктураКлассность.Процент = ВыборкаДетальныеЗаписи.ПроцентКлассности;
	КонецЕсли;
	
	Возврат Есть;
КонецФункции

Функция ПолучитьВидыРасчетаКлассность()
	ВидыРасчетаКлассность = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияОрганизаций.Ссылка
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления
	|	И (ОсновныеНачисленияОрганизаций.Наименование ПОДОБНО ""%классность%""
	|			ИЛИ ОсновныеНачисленияОрганизаций.Наименование ПОДОБНО ""%Классность%"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительныеНачисленияОрганизаций.Ссылка
	|ИЗ
	|	ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ДополнительныеНачисленияОрганизаций
	|ГДЕ
	|	НЕ ДополнительныеНачисленияОрганизаций.ПометкаУдаления
	|	И (ДополнительныеНачисленияОрганизаций.Наименование ПОДОБНО ""%классность%""
	|			ИЛИ ДополнительныеНачисленияОрганизаций.Наименование ПОДОБНО ""%Классность%"")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидыРасчетаКлассность.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Возврат ВидыРасчетаКлассность;
КонецФункции

Функция ПолучитьРазряд(КодОКРБ)
	Разряд = "";
	
	Если Не ЗначениеЗаполнено(КодОКРБ) Тогда
		Возврат Разряд;
	КонецЕсли;
	
	Разряд = Прав(КодОКРБ, 2);
	Если Лев(Разряд, 1) = "0" Тогда
		Разряд = Прав(Разряд, 1);
	КонецЕсли;
	Возврат Разряд;
КонецФункции

Функция ПолучитьКлассВодителя(Процент)
	Если Процент = 25 Тогда
		Возврат 1;
	ИначеЕсли Процент = 15 Тогда
		Возврат 2;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьПредставительство(Подр)
	ПредставительствоРод = "";
	Если Не ЗначениеЗаполнено(Подр) Тогда
		Возврат ПредставительствоРод;
	КонецЕсли;
	
	Представительство = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	ПредставительствоНаименование = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПодразделенияОрганизаций.Ссылка КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА ПодразделенияОрганизаций.Ссылка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПодразделенияОрганизаций.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|					ТОГДА ПодразделенияОрганизаций.Родитель
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|							ТОГДА ПодразделенияОрганизаций.Родитель.Родитель
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|									ТОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель
	|								ИНАЧЕ ПодразделенияОрганизаций.Родитель.Родитель.Родитель.Родитель
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Представительство,
	|	(ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА ПодразделенияОрганизаций.Ссылка
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПодразделенияОрганизаций.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|					ТОГДА ПодразделенияОрганизаций.Родитель
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|							ТОГДА ПодразделенияОрганизаций.Родитель.Родитель
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|									ТОГДА ПодразделенияОрганизаций.Родитель.Родитель.Родитель
	|								ИНАЧЕ ПодразделенияОрганизаций.Родитель.Родитель.Родитель.Родитель
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ).Наименование КАК ПредставительствоНаименование
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Подр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Представительство = ВыборкаДетальныеЗаписи.Представительство;
		ПредставительствоНаименование = ВыборкаДетальныеЗаписи.ПредставительствоНаименование;
	КонецЕсли;
	Если Подр = Представительство Тогда
	Иначе
		Если ЗначениеЗаполнено(Представительство) И (Найти(ПредставительствоНаименование, "Представительство") > 0 
			ИЛИ Найти(ПредставительствоНаименование, "представительство") > 0) Тогда
			ПредставительствоРод = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ПредставительствоНаименование, 2, , Представительство, 1);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПредставительствоРод) Тогда
			ПредставительствоРод = " " + ПредставительствоРод;	
		КонецЕсли;
	КонецЕсли;     
	Возврат ПредставительствоРод;
КонецФункции

Функция ПолучитьДатуПриема(Сотр)
	ДатаПриемаСотрудника = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизаций.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник = &Сотрудник
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаПриемаСотрудника = ВыборкаДетальныеЗаписи.Период; 
	КонецЕсли;
	
	Возврат ДатаПриемаСотрудника;
КонецФункции

Функция ИменительныйПадеж(Подр)
	ИмПадеж = "";
	Если Не ЗначениеЗаполнено(Подр) Тогда
		Возврат ИмПадеж;
	КонецЕсли;
	ИмПадеж = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Подр.Наименование, 1, , Подр, 1);
	Возврат ИмПадеж;
КонецФункции

Функция ПолучитьСтарыеДанные(Сотр, ДатаПеревода)
	СтарыеДанные = Новый Структура;
	СтарыеДанные.Вставить("Должность");
	СтарыеДанные.Вставить("Подразделение");
	СтарыеДанные.Вставить("РазрядЕТС");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.РазрядЕТС
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НаДату, Сотрудник = &Сотрудник И ИсключитьИзПУ2 = ЛОЖЬ) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", ДатаПеревода - 1);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтарыеДанные.Должность = ВыборкаДетальныеЗаписи.Должность;
		СтарыеДанные.Подразделение = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
		СтарыеДанные.РазрядЕТС = ВыборкаДетальныеЗаписи.РазрядЕТС;
	КонецЕсли;
	
	Возврат СтарыеДанные;
КонецФункции

Функция ПолучитьДатуПоследнегоПеревода(Сотр, НаДату)
	ДатаПоследнегоПеревода = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизаций.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&НаДату,
	|			Сотрудник = &Сотрудник
	|				И ИсключитьИзПУ2 = ЛОЖЬ
	
	//Аверсон ЕАЕ 09.03.2022 СВФР-008759
	|И ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.КадровоеПеремещениеОрганизаций)
	//Аверсон СВФР-008759
	
	|) КАК РаботникиОрганизаций";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаПоследнегоПеревода = ВыборкаДетальныеЗаписи.Период;
	КонецЕсли;
	
	Возврат ДатаПоследнегоПеревода;
КонецФункции

//Аверсон ЕАЕ 15.03.2022 СВФР-007679
Функция ПолучитьДанныеПоследнегоПеревода(Сотр, НаДату)
	
	ДанныеПоследнегоПеревода = Новый Структура;
	ДанныеПоследнегоПеревода.Вставить("ДатаПеревода", '00010101');
	ДанныеПоследнегоПеревода.Вставить("Должность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	ДанныеПоследнегоПеревода.Вставить("ПодразделениеОрганизации", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ДанныеПоследнегоПеревода.Вставить("КОДПоОКРБ", "");
	ДанныеПоследнегоПеревода.Вставить("ВнешнееСовместительство", 0);
	ДанныеПоследнегоПеревода.Вставить("ВнутреннееСовместительство", 0);
	ДанныеПоследнегоПеревода.Вставить("НомерПриказаПеревода", "");
	ДанныеПоследнегоПеревода.Вставить("ДатаПриказаПеревода", '00010101');
	
	ДанныеПоследнегоПеревода.Вставить("ТрудовойДоговор", Документы.ТрудовойДоговор.ПустаяСсылка());
	ДанныеПоследнегоПеревода.Вставить("ВидТрудовогоДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
	ДанныеПоследнегоПеревода.Вставить("ТипТрудовогоДоговора", Перечисления.ВидыТрудовыхДоговоров.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации,
	|	ВЫБОР
	|	КОГДА РаботникиОрганизаций.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|	ТОГДА 1
	|	ИНАЧЕ 0
	|	КОНЕЦ ВнешнееСовместительство,
	|	ВЫБОР
	|	КОГДА РаботникиОрганизаций.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	ТОГДА 1
	|	ИНАЧЕ 0
	|	КОНЕЦ ВнутреннееСовместительство,
	|	РаботникиОрганизаций.Регистратор.НомерПриказа КАК НомерПриказаПеревода,
	|	РаботникиОрганизаций.Регистратор.ДатаПриказа КАК ДатаПриказаПеревода,
	
	|	КадровоеПеремещениеОрганизацийСтрока.Основание КАК ТрудовойДоговор,
	|   КадровоеПеремещениеОрганизацийСтрока.Основание.ВидТД КАК ВидТрудовогоДоговора,
	|	КадровоеПеремещениеОрганизацийСтрока.Основание.ТипТрудовогоДоговора КАК ТипТрудовогоДоговора
	
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&НаДату,
	|			Сотрудник = &Сотрудник
	|				И ИсключитьИзПУ2 = ЛОЖЬ
	
	//Аверсон ЕАЕ 09.03.2022 СВФР-008759
	|И ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.КадровоеПеремещениеОрганизаций)
	//Аверсон СВФР-008759
	
	|) КАК РаботникиОрганизаций
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийСтрока
	|ПО РаботникиОрганизаций.Регистратор = КадровоеПеремещениеОрганизацийСтрока.Ссылка
	|	И РаботникиОрганизаций.Сотрудник = КадровоеПеремещениеОрганизацийСтрока.Сотрудник
	|";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДанныеПоследнегоПеревода.ДатаПеревода               = ВыборкаДетальныеЗаписи.Период;
		ДанныеПоследнегоПеревода.Должность                  = ВыборкаДетальныеЗаписи.Должность;
		ДанныеПоследнегоПеревода.ПодразделениеОрганизации   = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
		ДанныеПоследнегоПеревода.КОДПоОКРБ                  = ПолучитьКодПоОКРБ(ВыборкаДетальныеЗаписи.Должность); 
		ДанныеПоследнегоПеревода.ВнешнееСовместительство    = ВыборкаДетальныеЗаписи.ВнешнееСовместительство;
		ДанныеПоследнегоПеревода.ВнутреннееСовместительство = ВыборкаДетальныеЗаписи.ВнутреннееСовместительство; 
		ДанныеПоследнегоПеревода.НомерПриказаПеревода       = ВыборкаДетальныеЗаписи.НомерПриказаПеревода;
		ДанныеПоследнегоПеревода.ДатаПриказаПеревода        = ВыборкаДетальныеЗаписи.ДатаПриказаПеревода; 
		
		ДанныеПоследнегоПеревода.ТрудовойДоговор            = ВыборкаДетальныеЗаписи.ТрудовойДоговор;
		ДанныеПоследнегоПеревода.ВидТрудовогоДоговора       = ВыборкаДетальныеЗаписи.ВидТрудовогоДоговора;
		ДанныеПоследнегоПеревода.ТипТрудовогоДоговора       = ВыборкаДетальныеЗаписи.ТипТрудовогоДоговора;
		
	КонецЕсли;
	
	Возврат ДанныеПоследнегоПеревода;
КонецФункции

Функция ПолучитьДанныеДоПоследнегоПеревода(Сотр, НаДату)
	
	ДанныеДоПоследнегоПеревода = Новый Структура;
	//ДанныеПоследнегоПеревода.Вставить("ДатаПеревода", '00010101');
	ДанныеДоПоследнегоПеревода.Вставить("СтараяДолжность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	ДанныеДоПоследнегоПеревода.Вставить("СтароеПодразделениеОрганизации", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ДанныеДоПоследнегоПеревода.Вставить("СтарыйКОДПоОКРБ", "");
	//ДанныеПоследнегоПеревода.Вставить("ВнешнееСовместительство", 0);
	//ДанныеПоследнегоПеревода.Вставить("НомерПриказаПеревода", "");
	//ДанныеПоследнегоПеревода.Вставить("ДатаПриказаПеревода", '00010101');
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации
	//|	ВЫБОР
	//|	КОГДА РаботникиОрганизаций.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	//|	ТОГДА 1
	//|	ИНАЧЕ 0
	//|	КОНЕЦ ВнешнееСовместительство,
	//|	РаботникиОрганизаций.Регистратор.НомерПриказа КАК НомерПриказаПеревода,
	//|	РаботникиОрганизаций.Регистратор.ДатаПриказа КАК ДатаПриказаПеревода
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&НаДату,
	|			Сотрудник = &Сотрудник
	
	//Аверсон ЕАЕ 14.04.2022 СВФР-008855
	|				И ИсключитьИзПУ2 = ЛОЖЬ 
	//Аверсон СВФР-008855
	
	//Аверсон ЕАЕ 09.03.2022 СВФР-008759
	//|И ТИПЗНАЧЕНИЯ(Регистратор) = ТИП(Документ.КадровоеПеремещениеОрганизаций)
	//Аверсон СВФР-008759
	
	|) КАК РаботникиОрганизаций";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//ДанныеПоследнегоПеревода.ДатаПеревода = ВыборкаДетальныеЗаписи.Период;
		ДанныеДоПоследнегоПеревода.СтараяДолжность = ВыборкаДетальныеЗаписи.Должность;
		ДанныеДоПоследнегоПеревода.СтароеПодразделениеОрганизации = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
		ДанныеДоПоследнегоПеревода.СтарыйКОДПоОКРБ = ПолучитьКодПоОКРБ(ВыборкаДетальныеЗаписи.Должность); 
		//ДанныеПоследнегоПеревода.ВнешнееСовместительство = ВыборкаДетальныеЗаписи.ВнешнееСовместительство; 
		//ДанныеПоследнегоПеревода.НомерПриказаПеревода = ВыборкаДетальныеЗаписи.НомерПриказаПеревода;
		//ДанныеПоследнегоПеревода.ДатаПриказаПеревода = ВыборкаДетальныеЗаписи.ДатаПриказаПеревода; 
	КонецЕсли;
	
	Возврат ДанныеДоПоследнегоПеревода;
КонецФункции

Функция ПолучитьКодПоОКРБ(Должность)
	Код = "";
	КодПоОКРБШаблон = Должность.КодПоОКПДТР;
	КодПоОКРБ = КодПоОКРБШаблон;
	РабСлуж = "";
	Если СтрДлина(КодПоОКРБШаблон) >= 11 Тогда
		РабСлуж = Сред(КодПоОКРБШаблон, 10, 2);
	КонецЕсли;
	
	Разряд = "";
	Если РабСлуж = "02" Тогда
		//Если служащий - определим и заменим категорию в шаблоне кода
		НаименованиеДолжности = СокрЛП(Должность);
		ПозКатегории = Найти(НаименованиеДолжности, "категории");
		Если ПозКатегории <> 0 Тогда
			НаименованиеДолжностиБезКатегории = СокрЛП(Лев(НаименованиеДолжности, ПозКатегории - 1));
			Категория = Прав(НаименованиеДолжностиБезКатегории, 1);
			КодПоОКРБ = СтрЗаменить(КодПоОКРБШаблон, "-0-", "-" + Категория + "-");
		КонецЕсли;
	КонецЕсли;
	Код = КодПоОКРБ;
	Возврат Код;
КонецФункции
//Аверсон СВФР-007679

//Аверсон ЕАЕ 22.02.2022 СВФР-008759
Функция ДолжностьВыгружена(Сотр, Должн, Дат, Подр, Рег = Неопределено)
	Была = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДолжностиПУ2Выгруженные.Сотрудник,
	|	ДолжностиПУ2Выгруженные.ДатаПеревода,
	|	ДолжностиПУ2Выгруженные.Должность
	|ИЗ
	|	РегистрСведений.ДолжностиПУ2Выгруженные КАК ДолжностиПУ2Выгруженные
	|ГДЕ
	|	ДолжностиПУ2Выгруженные.Сотрудник = &Сотрудник
	|	И ДолжностиПУ2Выгруженные.ДатаПеревода = &ДатаПеревода
	|	И ДолжностиПУ2Выгруженные.Должность = &Должность
	|   И ДолжностиПУ2Выгруженные.ПодразделениеОрганизации = &Подразделение
	|	И ДолжностиПУ2Выгруженные.ДокументРегистратор = &Регистратор";
	Если Рег = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДолжностиПУ2Выгруженные.ДокументРегистратор = &Регистратор", "");
	Иначе
		Запрос.УстановитьПараметр("Регистратор", Рег);
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаПеревода", Дат);
	Запрос.УстановитьПараметр("Должность", Должн);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	Запрос.УстановитьПараметр("Подразделение", Подр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Была = Истина;
	КонецЕсли;
	
	Возврат Была;
КонецФункции

Процедура ВыгрузитьДолжность(Сотр, Должн, Дат, Подр)
	
	Набор = РегистрыСведений.ДолжностиПУ2Выгруженные.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРегистратор.Установить(Ссылка);
	Набор.Отбор.Сотрудник.Установить(Сотр);
	Набор.Отбор.Должность.Установить(Должн);
	Набор.Отбор.ДатаПеревода.Установить(Дат);
	Набор.Отбор.ПодразделениеОрганизации.Установить(Подр);
	Набор.Прочитать();
	
	НовЗапись = Набор.Добавить();
	НовЗапись.ДокументРегистратор = Ссылка;
	НовЗапись.Сотрудник = Сотр;
	НовЗапись.Должность = Должн;
	НовЗапись.ДатаПеревода = Дат;
	НовЗапись.ПодразделениеОрганизации = Подр;
	//НовЗапись.Период = Дата;
	Набор.Записать();
КонецПроцедуры
//Аверсон СВФР-008759

//Аверсон ЕАЕ 14.04.2022 СВФР-008855
Функция БылПриемИлиПеревод(Сотр, ДатаУв)
	Был = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизаций.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Период МЕЖДУ &ПериодНач И &ПериодКон
	|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
	|	И НЕ РаботникиОрганизаций.ИсключитьИзПУ2
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&ПричиныИзмененияСостояния)";
	
	Запрос.УстановитьПараметр("ПериодКон", ДатаУв);
	Запрос.УстановитьПараметр("ПериодНач", '20190630');
	ПричиныИзмененияСостояния = Новый Массив;
	ПричиныИзмененияСостояния.Добавить(Перечисления.ПричиныИзмененияСостояния.Перемещение);
	ПричиныИзмененияСостояния.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	Запрос.УстановитьПараметр("ПричиныИзмененияСостояния", ПричиныИзмененияСостояния);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Был = Истина;
	КонецЕсли;
	
	Возврат Был;
КонецФункции
//Аверсон СВФР-008855