//Формирует записи в регистре сведений Графики
//на основании Данных регистра накопления рабочее время работников организациии
Процедура ДобавитьГрафикиРаботыПоВидамВремени(НачДата, КонДата, мСотрудник, мДокумент, мЗаДень,мЗапросИзДок=Неопределено) Экспорт
	//Островская Татьяна 15.01.2014 № 17203
	Если мДокумент.Организация.ИНН = "100765738" Тогда 
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ
		|	РабочееВремяРаботниковОрганизаций.Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
		|	МАКСИМУМ(РабочееВремяРаботниковОрганизаций.Регистратор) КАК Регистратор,
		|	РабочееВремяРаботниковОрганизаций.Период
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		//|	(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
		|	(РабочееВремяРаботниковОрганизаций.ДатаНачала МЕЖДУ &НачДата И &КонДата или &НачДата МЕЖДУ РабочееВремяРаботниковОрганизаций.ДатаНачала и РабочееВремяРаботниковОрганизаций.ДатаОкончания)
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.Организация = &Организация
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочееВремяРаботниковОрганизаций.Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
		|	РабочееВремяРаботниковОрганизаций.Период";
	иначе
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ
		|	РабочееВремяРаботниковОрганизаций.Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
		|	МАКСИМУМ(РабочееВремяРаботниковОрганизаций.Регистратор) КАК Регистратор,
		|	РабочееВремяРаботниковОрганизаций.Период
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		//|	(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
		|	РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.Организация = &Организация
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочееВремяРаботниковОрганизаций.Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
		|	РабочееВремяРаботниковОрганизаций.Период";
	КонецЕсли;
	мЗапрос.УстановитьПараметр("НачДата", НачДата);
	мЗапрос.УстановитьПараметр("КонДата", КонДата);
	мЗапрос.УстановитьПараметр("Сотрудник", мСотрудник);
	мЗапрос.УстановитьПараметр("Организация", мДокумент.Организация);
	УчетнаяПолитикаЗапрос = Новый Запрос;
	УчетнаяПолитикаЗапрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",мДокумент.Организация);
	УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
	если УчетнаяПолитика.Количество()>0 Тогда 
		мЗапрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
	иначе
		мЗапрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
	КонецЕсли;
	
	//О.Т. Аверсон 04.04.2019 № 4199
	ТЗПериоды = Новый ТаблицаЗначений;
	ТЗПериоды.Колонки.Добавить("Период");
	
	Если мЗапросИзДок <> Неопределено Тогда
		
		МассивЗапросИзДок = мЗапросИзДок.НайтиСтроки(Новый Структура("Сотрудник",мСотрудник));
		Для Каждого стрПериоды из МассивЗапросИзДок Цикл 
			СтрТЗПериоды = ТЗПериоды.Добавить();
			СтрТЗПериоды.Период = стрПериоды.Период;
		КонецЦикла;
		
	КонецЕсли;
	//О.Т. Аверсон 04.04.2019 № 4199
	
	
	мЗапросПД = Новый Запрос;
	мЗапросПД.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботыПоВидамВремени.Дата КАК Период
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачДата И &КонДата
	|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	|	И (НЕ ГрафикиРаботыПоВидамВремени.Дата В (&СписокДата))";
	мЗапросПД.УстановитьПараметр("НачДата", НачДата);
	мЗапросПД.УстановитьПараметр("КонДата", КонДата);
	
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(НачДата),
	Новый Структура("Организация, Сотрудник", мДокумент.Организация, мСотрудник));//О.Т. Аверсон 16.10.2017 № 1120
	мЗапросПД.УстановитьПараметр("ГрафикРаботы", мСтрока.ГрафикРаботы);
	мЗапросПД.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
	мЗапросПД.УстановитьПараметр("СписокДата", ?(мЗапросИзДок=Неопределено,мЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Период"),ТЗПериоды.ВыгрузитьКолонку("Период")));
	
	
	мВыборка = мЗапрос.Выполнить().Выбрать();
	мВыборкаПД = мЗапросПД.Выполнить().Выбрать();
	
	НаборГрафикиРаботыПоВидамВремени = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
	
	НаборГрафикиРаботыПоВидамВремени.Отбор.План.Установить(Ложь);
	НаборГрафикиРаботыПоВидамВремени.Отбор.ГрафикРаботы.Установить(мСотрудник);
	НаборГрафикиРаботыПоВидамВремени.Отбор.Месяц.Установить(НачалоМесяца(НачДата));
	Если мЗаДень Тогда
		НаборГрафикиРаботыПоВидамВремени.Отбор.Дата.Установить(НачалоДня(НачДата));
	КонецЕсли;
	//НаборГрафикиРаботыПоВидамВремени.Отбор.ВидУчетаВремени.Установить(ВидУчетаВремени);
	Пока мВыборка.Следующий() Цикл
		Если мВыборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		ИначеЕсли мВыборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
		ИначеЕсли мВыборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
		Иначе
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.Неопределен;
		КонецЕсли;
		
		Движение = НаборГрафикиРаботыПоВидамВремени.Добавить();
		//измерения	
		Движение.ГрафикРаботы = мВыборка.Сотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ВидВремени = мВыборка.ВидВремени;
		Движение.Дата = мВыборка.Период;
		Движение.План = Ложь;
		Движение.Месяц = НачалоМесяца(мВыборка.Период);
		
		// Ресурсы
		Движение.ОсновноеЗначениеПолное = мВыборка.Часов;
		Движение.ДополнительноеЗначениеПолное = 1;
		
		// Реквизиты
		Движение.Документ				= мВыборка.Регистратор;
		//по дням
		Если мВыборка.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
			
			Движение = НаборГрафикиРаботыПоВидамВремени.Добавить();
			//измерения	
			Движение.ГрафикРаботы = мВыборка.Сотрудник;
			Движение.ВидУчетаВремени = ВидУчетаВремени;
			Движение.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаДни;
			Движение.Дата = мВыборка.Период;
			Движение.План = Ложь;
			Движение.Месяц = НачалоМесяца(мВыборка.Период);
			
			// Ресурсы
			Движение.ОсновноеЗначениеПолное = 1;
			Движение.ДополнительноеЗначениеПолное = мВыборка.Часов;
			
			// Реквизиты
			Движение.Документ				= мВыборка.Регистратор;
		КонецЕсли;
	КонецЦикла;
	//пустые даты
	Пока мВыборкаПД.Следующий() Цикл
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		
		Движение = НаборГрафикиРаботыПоВидамВремени.Добавить();
		//измерения	
		Движение.ГрафикРаботы = мСотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
		Движение.Дата = мВыборкаПД.Период;
		Движение.План = Ложь;
		Движение.Месяц = НачалоМесяца(мВыборкаПД.Период);
		
		//по дням
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
		
		Движение = НаборГрафикиРаботыПоВидамВремени.Добавить();
		//измерения	
		Движение.ГрафикРаботы = мСотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаДни;
		Движение.Дата = мВыборкаПД.Период;
		Движение.План = Ложь;
		Движение.Месяц = НачалоМесяца(мВыборкаПД.Период);
	КонецЦикла;
	
	НаборГрафикиРаботыПоВидамВремени.Записать();
КонецПроцедуры

Функция ПолучитьКатегориюПоСотруднику(Сотрудник) Экспорт
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Объект,
	|	КатегорииОбъектов.Категория
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Объект", Сотрудник);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьНормуВремениПоГрафику(ГрафикРаботы, ВидУчетаВремени, Период,Организация = Неопределено) Экспорт
	//Аверсон 09.06.2021 КВВ СВФР-007684 (
	Если Организация <> Неопределено
		И Организация.ИНН = "700067572"
		И ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций" Тогда
		РезИзФ = ПолучитьДанныеПоИндивидуальномуЗаИнтервал(НачалоМесяца(Период),КонецМесяца(Период),ГрафикРаботы);
		мНорма = РезИзФ.КоличествоЧасов;
		Если мНорма <> 0 Тогда 
			Возврат мНорма;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 09.06.2021 КВВ СВФР-007684 )
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	|	И ГрафикиРаботыПоВидамВремени.Месяц = &Период";
	Если ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций" Тогда
		Если Организация = Неопределено Тогда //О.Т. Аверсон 16.10.2017 № 1120
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
		
		мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(Период),
		Новый Структура("Организация, Сотрудник", Организация, ГрафикРаботы));
		Запрос.УстановитьПараметр("ГрафикРаботы", мСтрока.ГрафикРаботы);
	Иначе
		Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(Период));
	мРезультат = Запрос.Выполнить().Выбрать();
	Если мРезультат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Пока мРезультат.Следующий() Цикл
			мНорма = мРезультат.ОсновноеЗначениеНорма;
		КонецЦикла;
		Возврат мНорма;
	КонецЕсли;
КонецФункции

Функция ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени( ГрафикРаботы, ВидУчетаВремени, ПериодНач, ПериодКон, Организация = Неопределено, ГрафикРаботыСотр = Неопределено, Регистратор = Неопределено ) Экспорт //Островская Татьяна 17.10.2013 № 16858 //Аверсон 23.06.2021 КВВ СВФР-007683 (6 и 7 параметры)
	//Аверсон 23.06.2021 КВВ СВФР-007683 (
	Если (Регистратор <> Неопределено 
		И ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОплатаСовмещенияСотрудников") 
		И Регистратор.ОплачиваемоеВремяПоТабелю)
		И
		(ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций" 
		ИЛИ
		(ГрафикРаботыСотр <> Неопределено 
		И ГрафикРаботыСотр.Метаданные().Имя = "СотрудникиОрганизаций")) Тогда
		РезИзФ = ПолучитьДанныеПоИндивидуальномуЗаИнтервал(ПериодНач, ПериодКон,?(ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций",ГрафикРаботы,ГрафикРаботыСотр));
		Если ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам Тогда
			мНорма = РезИзФ.КоличествоЧасов;
		Иначе
			мНорма = РезИзФ.КоличествоДней;
		КонецЕсли;
		Если мНорма <> 0 Тогда 
			Возврат мНорма;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 23.06.2021 КВВ СВФР-007683 )
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение //СВЭЙ 16.02.2024 КВВ СВФР-012360
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &Период И &Период1";
	Если ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций" Тогда
		Если Организация = Неопределено Тогда //О.Т. Аверсон 16.10.2017 № 1120
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
		
		мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодКон,
		Новый Структура("Организация, Сотрудник", Организация, ГрафикРаботы));
		Запрос.УстановитьПараметр("ГрафикРаботы", мСтрока.ГрафикРаботы);
	Иначе
		Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
	Запрос.УстановитьПараметр("Период", ПериодНач);
	Запрос.УстановитьПараметр("Период1", ПериодКон);
	мРезультат = Запрос.Выполнить().Выбрать();
	Если мРезультат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Пока мРезультат.Следующий() Цикл
			мНорма = мРезультат.ОсновноеЗначениеНорма;
			
			//СВЭЙ 16.02.2024 КВВ СВФР-012360 (
			Если Регистратор <> Неопределено 
				//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку") Тогда
				И (ТипЗнч(Регистратор) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку") или ТипЗнч(Регистратор.ссылка) = Тип("ДокументСсылка.СокращениеРабочегоВремени")) Тогда
				мНорма = мРезультат.ОсновноеЗначение;
			КонецЕсли;
			//СВЭЙ 16.02.2024 КВВ СВФР-012360 )
			
			//Аверсон ЕАЕ 20.04.2021 СВФР-007445
			Если мНорма = null Тогда
				мНорма = 0;
			КонецЕсли;
			//Аверсон СВФР-007445
		КонецЦикла;
		Возврат мНорма;
	КонецЕсли;
КонецФункции //Островская Татьяна 17.10.2013 № 16858

//Аверсон ЕАЕ 25.01.2022 СВФР-008641
Функция СотрудникРаботаетПоЧасовомуТарифу(Сотрудник, Организация, НаДату, ЧасоваяТарифнаяСтавка) Экспорт
	Работает = Ложь;
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	План.Сотрудник,
	|	План.Показатель1 КАК ЧасоваяТарифнаяСтавка
	|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаНачала, Сотрудник = &Сотрудник 
	|И Организация = &Организация И Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить) И ВидРасчета В (&ОсновныеВидыРасчета)) КАК План
	//|ГДЕ План.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой)
	|";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Организация", Организация);
	ОсновныеВидыРасчета = Новый Массив;
	ОсновныеВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	ОсновныеВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	Запрос.УстановитьПараметр("ОсновныеВидыРасчета", ОсновныеВидыРасчета);
	Запрос.УстановитьПараметр("ДатаНачала", НаДату);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Работает = Истина;
			//ЧасоваяТарифнаяСтавка = Выборка.ЧасоваяТарифнаяСтавка;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Работает;
КонецФункции
//Аверсон СВФР-008641

//+ СВЭЙ КДЯ 09.10.19 СВФР-004842
Функция ПолучитьСреднеГодовуюНормуВремениПоГрафику( ЗНАЧ ГрафикРаботы, ВидУчетаВремени, Период, Организация = Неопределено ) Экспорт
	
	СреднеГодоваяНормаВремениПоГрафику = 0;
	
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	РазмерыПараметровДляРасчетаОрганизацийСрезПоследних.Размер КАК СреднеГодоваяНормаВремениПоГрафику
	//	|ИЗ
	//	|	РегистрСведений.РазмерыПараметровДляРасчетаОрганизаций.СрезПоследних(
	//	|			&Период,
	//	|           ВидПараметра = ЗНАЧЕНИЕ( Перечисление.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов )
	//	|			И ГрафикРаботы = &ГрафикРаботы
	//	|				И Организация = &Организация) КАК РазмерыПараметровДляРасчетаОрганизацийСрезПоследних";
	//
	//Если ГрафикРаботы.Метаданные().Имя = "СотрудникиОрганизаций" Тогда
	//	Если Организация = Неопределено Тогда
	//		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//	КонецЕсли;
	//	
	//	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее( КонецГода( Период ),
	//	Новый Структура("Организация, Сотрудник", Организация, ГрафикРаботы));
	//	Запрос.УстановитьПараметр("ГрафикРаботы", мСтрока.ГрафикРаботы);
	//Иначе
	//	Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);
	//КонецЕсли;
	//	
	//Запрос.УстановитьПараметр( "Организация", Организация );
	//Запрос.УстановитьПараметр( "Период", КонецГода( Период ) );
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	СреднеГодоваяНормаВремениПоГрафику = Выборка.СреднеГодоваяНормаВремениПоГрафику;	
	//КонецЦикла;  всегда по графику за год /12
	

	
	Если СреднеГодоваяНормаВремениПоГрафику = 0 Тогда
	
		НормаВремениПоГрафикуЗаГод = ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(
			ГрафикРаботы, ВидУчетаВремени, НачалоГода( Период ), КонецГода( Период ), Организация );
		СреднеГодоваяНормаВремениПоГрафику = НормаВремениПоГрафикуЗаГод / 12;	
		
	
	КонецЕсли;
	Возврат СреднеГодоваяНормаВремениПоГрафику;	

КонецФункции // ПолучитьСреднеГодовуюНормуВремениПоГрафику()
//- СВЭЙ КДЯ 09.10.19 СВФР-004842

//+ СВЭЙ КДЯ 14.10.19 СВФР-004591
Функция ЕстьУНП( УНП ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.ИНН
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = &ИНН
		|	И НЕ Организации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИНН", УНП);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьУНП()
 
//- СВЭЙ КДЯ 14.10.19 СВФР-004591

//возвращает тарифную ставку даже перещитывая оклад в т.с. работника в зависимости от
//переданных параметров
Функция ПолучитьЧасовуюТарифнуюСтавку(Организация, Сотрудник, Период, ГрафикРаботы, мКонтракт = Истина, мПовышения = Ложь, мСверхурочные = Ложь, 
	мДопНачисления = Ложь, мОтработаноЧас= Неопределено, ПроцентОтТСБезКонтракта = Ложь,СпособРасчетаВЧасах = Ложь,ВидРасчета1 = неопределено,ПроцентПоИнструкции = Ложь,ТарифныеСтавки1 = Неопределено,РасчетОтСреднегодовойНормы = Ложь,Курс = 1) Экспорт //Островская Татьяна 16.01.2014
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник
	//|				И (НЕ Временно)
	
	//Аверсон ЕАЕ 10.02.2022 СВФР-008728
	|				И (Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить))
	//Аверсон СВФР-008728
	
	|		) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних 
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Период);
	мСписокВидов = Новый СписокЗначений;
	мСписок = СформироватьСписокОсновныхНачислений();
	Пока мСписок.Следующий() Цикл
		мСписокВидов.Добавить(мСписок.ВидРасчета);
	КонецЦикла;
	Запрос.УстановитьПараметр("ВидРасчета", мСписокВидов);
	
	мРезультат = Запрос.Выполнить().Выбрать();
	
	Если мРезультат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Пока мРезультат.Следующий() Цикл
			ВидРасчета = мРезультат.ВидРасчета;
		КонецЦикла;
	КонецЕсли;	
	
	//О.Т. Аверсон 08.11.2016 № 3
	ДляПечати = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период,Новый Структура("Сотрудник",Сотрудник)).ДляПечати; 
	//СВФР-016808
	Если Организация.КадровоеДвижениеВСекундах Тогда
		 ПериодКонец = КонецДня(Период);
	КонецЕсли;
	//СВФР-016808
	
	//О.Т. Аверсон 08.11.2016 № 3
	Если ЗначениеЗаполнено(ТарифныеСтавки1) Тогда 
		ТарифныеСтавки = ТарифныеСтавки1;
	иначе	
		Если Организация.КадровоеДвижениеВСекундах Тогда //СВФР-016808
			ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ПериодКонец,
			Новый Структура("Организация,Сотрудник", Организация, Сотрудник));
		Иначе     
			ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Период,
			Новый Структура("Организация,Сотрудник", Организация, Сотрудник));
		КонецЕсли;
		//+ СВЭЙ КДЯ 24.01.20 СВФР-005407
		Если ТарифныеСтавки.ОкладВВалюте Тогда
			//КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее( Период, 
			//				Новый Структура( "Валюта", ТарифныеСтавки.Валюта ) );
			//				
			//				
			//КурсВалюты.Кратность = ?( КурсВалюты.Кратность = 0, 1, КурсВалюты.Кратность );
			//Если ТарифныеСтавки.ТарифнаяСтавка = 0 Тогда
			//	ТарифныеСтавки.ТарифнаяСтавка =
			//		ОбщегоНазначения.ОкруглитьПоВалюте( ТарифныеСтавки.ОкладСПовышениемВВалюте
			//			* КурсВалюты.Курс / КурсВалюты.Кратность , ТарифныеСтавки.Валюта );
			//КонецЕсли;
			Если ТарифныеСтавки.ТарифнаяСтавка = 0 Тогда
				ТарифныеСтавки.ТарифнаяСтавка =
					ОбщегоНазначения.ОкруглитьПоВалюте( ТарифныеСтавки.ОкладСПовышениемВВалюте
						* Курс, ТарифныеСтавки.Валюта );
			КонецЕсли;
			Если ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции = 0 Тогда
				ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции = 
					ОбщегоНазначения.ОкруглитьПоВалюте( ТарифныеСтавки.ОкладСПовышениемВВалюте
						* Курс , ТарифныеСтавки.Валюта );
			КонецЕсли;
			Если ТарифныеСтавки.Ставка = 0 Тогда
				ТарифныеСтавки.Ставка =	
					ОбщегоНазначения.ОкруглитьПоВалюте( ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте
						* Курс , ТарифныеСтавки.Валюта );
			КонецЕсли;
		КонецЕсли; 
		//- СВЭЙ КДЯ 24.01.20 СВФР-005407
	КонецЕсли;
	Если ТарифныеСтавки.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период,Новый Структура("Организация,Сотрудник", Организация,Сотрудник));//О.Т. Аверсон 05.02.2018 № 1547
	
	Если ЗначениеЗаполнено(мСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547
		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Период,
		Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),мСтрока.ГрафикРаботы));
		Если ЧасовВГоду.Размер = 0 Тогда 
			ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Период,
			Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
		КонецЕсли;
	иначе                        		
		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Период,
		Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
	КонецЕсли;
	//Аверсон-софт, Островская Татьяна 08.06.2012 № 15474
	ДанныеИндивидуальногоГрафика = ПолучитьДанныеПоИндивидуальному(Период,Сотрудник);
	КоличествоДней = ДанныеИндивидуальногоГрафика.КоличествоДней;
	КоличествоЧасов = ДанныеИндивидуальногоГрафика.КоличествоЧасов;
	
	//Аверсон 16.07.2020 КВВ СВФР-006187 ( (закомментировать потом)
	Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" 
		ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") или  Организация.ИНН = "700067572" ИЛИ Организация.ИНН = "101132899" Тогда //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
		КоличествоДней = 0;
		КоличествоЧасов = 0;  		
	КонецЕсли;
	//Аверсон 16.07.2020 КВВ СВФР-006187 ) (закомментировать потом)

	//Аверсон-софт, Островская Татьяна 08.06.2012 № 15474
	//Островская Татьяна 24.10.2013 № 16856
	ЗапросТарСтПоИНН = Новый Запрос;
	ЗапросТарСтПоИНН.Текст = "ВЫБРАТЬ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетЧасовойТарСтавкиОтСрЧасовВГоду,
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.ВалютныеОклады,
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.ЧасовойТарифЗаЦелуюСтавку
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	ЗапросТарСтПоИНН.УстановитьПараметр("Организация",Организация);
	РезФлагТарСтавкаПоИНН = ЗапросТарСтПоИНН.Выполнить().Выбрать();
	если РезФлагТарСтавкаПоИНН.Следующий() Тогда 
		ФлагТарСтавкаОтСрЧасовВГоду = РезФлагТарСтавкаПоИНН.РасчетЧасовойТарСтавкиОтСрЧасовВГоду;
		ФлагВалютныеОклады = РезФлагТарСтавкаПоИНН.ВалютныеОклады;//О.Т. Аверсон 08.11.2016 № 3
		ФлЧасовойТарифЗаЦелуюСтавку = РезФлагТарСтавкаПоИНН.ЧасовойТарифЗаЦелуюСтавку; //О.Т. Аверсон 22.09.2017 № 1059
	иначе
		ФлагТарСтавкаОтСрЧасовВГоду = Ложь;
		ФлагВалютныеОклады = Ложь;//О.Т. Аверсон 08.11.2016 № 3
		ФлЧасовойТарифЗаЦелуюСтавку = Ложь;//О.Т. Аверсон 22.09.2017 № 1059
	КонецЕсли;
	если ((Организация.ИНН = "490319145" или Организация.ИНН = "500052918") и ФлагТарСтавкаОтСрЧасовВГоду) 
		или ?(не ВидРасчета1=Неопределено или ТипЗнч(ВидРасчета1)= Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"),ВидРасчета1.ФлагРасчетОтСреднихЧасов,Ложь) Тогда 
		ТарСтаркаПоИНН = Истина;
	Иначе 
		ТарСтаркаПоИНН = Ложь;
	КонецЕсли;
	//Островская Татьяна 24.10.2013 № 16856
	
	ЗанимаемаяСтавка = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период,Новый Структура("Сотрудник",Сотрудник)).ЗанимаемыхСтавок; //О.Т. Аверсон 22.09.2017 № 1059
	
	//О.Т. Аверсон 31.10.2016 № 1507
	РасчетОтСреднегодовойНормы1 = РасчетОтСреднегодовойНормы;
	Если не(РасчетОтСреднегодовойНормы и ЧасовВГоду.Размер <> 0) Тогда 
		РасчетОтСреднегодовойНормы1 = Ложь;
	КонецЕсли;
	
	//О.Т. Аверсон 31.10.2016 № 1507
	Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой и Организация.ИНН = "100071565" Тогда  	
		Если ЗанимаемаяСтавка <> 1 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И Сотрудник = &Сотрудник
			|				И Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|ГДЕ
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1";
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
			Запрос.УстановитьПараметр("Период", Период);
			
			мРезультат = Запрос.Выполнить().Выбрать();
			
			Если мРезультат.Количество() = 0 Тогда
				Возврат 0;
			Иначе
				Пока мРезультат.Следующий() Цикл
					Размер = мРезультат.Показатель1;
				КонецЦикла;
			КонецЕсли;	
			Возврат Размер;
		Иначе
			Возврат ТарифныеСтавки.ТарифнаяСтавка;
		КОнецЕсли;
	ИначеЕсли ЧасовВГоду.Размер <> 0 и ЗначениеЗаполнено(ГрафикРаботы) тогда
		Если мКонтракт Тогда
			если ПроцентОтТСБезКонтракта Тогда
				Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСтавка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
			ИначеЕсли ПроцентПоИнструкции Тогда 
				Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
			ИначеЕсли ФлагВалютныеОклады и ДляПечати Тогда //О.Т. Аверсон 08.11.2016 № 3
				Тариф = ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте*Курс;
			иначе
				Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.Ставка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
			КонецЕсли;
			
			
			//Аверсон-софт, Островская Татьяна 08.06.2012 № 15474
			если мДопНачисления тогда
				Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам тогда
					//заявка №1662 (база заявок Кристалла) Дмитрук О.Г.
					если не КоличествоДней = 0 тогда
						мТарифнаяСтавка = Тариф/КоличествоЧасов;
					иначе
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						//мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						НормаВремениПоГрафику = ПолучитьНормуВремениПоГрафику( ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период, Организация );
						мТарифнаяСтавка = Тариф/?( РасчетОтСреднегодовойНормы1 ИЛИ НормаВремениПоГрафику = 0, ЧасовВГоду.Размер, НормаВремениПоГрафику ); //О.Т. Аверсон 16.10.2017 № 1120
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
					КонецЕсли;
					
				ИначеЕсли  ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
					//заявка №1662
					если не КоличествоДней = 0 тогда
						мТарифнаяСтавка = Тариф/КоличествоДней;
					иначе
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						//мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						НормаВремениПоГрафику = ПолучитьНормуВремениПоГрафику( ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период, Организация );
						мТарифнаяСтавка = Тариф/?( РасчетОтСреднегодовойНормы1 ИЛИ НормаВремениПоГрафику = 0, ЧасовВГоду.Размер, НормаВремениПоГрафику ); //О.Т. Аверсон 16.10.2017 № 1120
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
					КонецЕсли;
				Иначе
					если не КоличествоЧасов = 0 тогда
						мТарифнаяСтавка = Тариф/КоличествоЧасов;
					иначе
						мТарифнаяСтавка = Тариф/ЧасовВГоду.Размер;
					КонецЕсли;
				КонецЕсли;
				//Аверсон-софт, Островская Татьяна 08.06.2012 № 15474
			иначе
				
				Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам или СпособРасчетаВЧасах тогда //Островская Татьяна 28.04.2014 № 17310
					//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
					если не КоличествоДней = 0 тогда
						мТарифнаяСтавка = Тариф/КоличествоЧасов;
					иначе
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						//мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация));//Наркевич 13.03.2014 № //ЧасовВГоду.Размер;
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
						//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
						НормаВремениПоГрафику = ПолучитьНормуВремениПоГрафику( ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период, Организация );
						мТарифнаяСтавка = Тариф/?( РасчетОтСреднегодовойНормы1 ИЛИ НормаВремениПоГрафику = 0, ЧасовВГоду.Размер, НормаВремениПоГрафику ); //О.Т. Аверсон 16.10.2017 № 1120
						//- СВЭЙ КДЯ 03.01.20 СВФР-005236
					КонецЕсли;
					//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
					//заявка №1662 (база заявок Кристалла) Дмитрук О.Г.
				ИначеЕсли ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
					//заявка №1662
					//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
					//мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
					//- СВЭЙ КДЯ 03.01.20 СВФР-005236
					//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
					НормаВремениПоГрафику = ПолучитьНормуВремениПоГрафику( ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период, Организация );
					мТарифнаяСтавка = Тариф/?( РасчетОтСреднегодовойНормы1 ИЛИ НормаВремениПоГрафику = 0, ЧасовВГоду.Размер, НормаВремениПоГрафику ); //О.Т. Аверсон 16.10.2017 № 1120
					//- СВЭЙ КДЯ 03.01.20 СВФР-005236
				Иначе
					мТарифнаяСтавка = Тариф/ЧасовВГоду.Размер;					
				КонецЕсли;
			КонецЕсли;
			мТарифнаяСтавка = ?(ТарСтаркаПоИНН,Тариф/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
		Иначе
			//с учетом изменений расчета т.с. с 01.09.2009
			Если Период < '20090901000000' Тогда
				если ПроцентОтТСБезКонтракта Тогда
					Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСтавка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				ИначеЕсли ПроцентПоИнструкции Тогда 
					Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				ИначеЕсли ФлагВалютныеОклады и ДляПечати Тогда 
					Тариф = ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте*Курс;
				иначе					
					Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.Ставка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				КонецЕсли;
				//если с повышением 6,9 
				Если мПовышения Тогда
					ТарифПоИнструкции = ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции;
					Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда 
						//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
						если не КоличествоДней = 0 тогда
							мТарифнаяСтавка = Тариф/КоличествоЧасов;
						иначе
							мТарифнаяСтавка = Тариф/ЧасовВГоду.Размер;
						КонецЕсли;
						//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,Тариф/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
						//заявка №1662 (база заявок Кристалла) Дмитрук О.Г.
					ИначеЕсли ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
						//заявка №1662
						Попытка
							мТарифнаяСтавка = ТарифПоИнструкции/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация)); //О.Т. Аверсон 16.10.2017 № 1120
							
						Исключение
							мТарифнаяСтавка = 0;
						КонецПопытки;
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					Иначе
						мТарифнаяСтавка = ТарифПоИнструкции/ЧасовВГоду.Размер;
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					КонецЕсли;
				Иначе
					мЗапрос = Новый Запрос;
					мЗапрос.Текст = 
					"ВЫБРАТЬ
					|	ПовышенияПоИнструкцииСрезПоследних.Размер,
					|	ПовышенияПоИнструкцииСрезПоследних.Действие
					|ИЗ
					|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Период, (НЕ Временно)) КАК ПовышенияПоИнструкцииСрезПоследних
					|ГДЕ
					|	ПовышенияПоИнструкцииСрезПоследних.Сотрудник = &Сотрудник
					|	И (НЕ ПовышенияПоИнструкцииСрезПоследних.Коэффициент.Последующий)";
					мЗапрос.УстановитьПараметр("Период", Период);
					мЗапрос.УстановитьПараметр("Сотрудник", Сотрудник);
					СтрокаПроцентов = мЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
					мДоПовышения = 0;
					Пока СтрокаПроцентов.Следующий() Цикл
						Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
							мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
						КонецЕсли;
					КонецЦикла;
					ТарифПоИнструкции = ТарифныеСтавки.ТарифнаяСтавка + ТарифныеСтавки.ТарифнаяСтавка*мДоПовышения/100;
					Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда 
						//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
						если не КоличествоДней = 0 тогда
							мТарифнаяСтавка = Тариф/КоличествоЧасов;
						иначе
							мТарифнаяСтавка = Тариф/ЧасовВГоду.Размер;
						КонецЕсли;
						//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
						
						//заявка №1662 (база заявок Кристалла) Дмитрук О.Г.
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,Тариф/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					ИначеЕсли ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
						//заявка №1662
						
						мТарифнаяСтавка = ТарифПоИнструкции/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
						
						
					Иначе
						мТарифнаяСтавка = ТарифПоИнструкции/ЧасовВГоду.Размер;
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Если мПовышения Тогда
					ТарифПоИнструкции = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
					//Аверсон-софт, Островская Татьяна 04.06.2012 № 15446
				Иначеесли мСверхурочные тогда
					ТарифПоИнструкции = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.Ставка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
					Если ФлагВалютныеОклады и ДляПечати Тогда //О.Т. Аверсон 08.11.2016 № 3
						ТарифПоИнструкции = ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте*Курс;
					КонецЕсли;        					
					//Аверсон-софт, Островская Татьяна 04.06.2012 № 15446
				ИначеЕсли ФлагВалютныеОклады и ДляПечати Тогда //О.Т. Аверсон 08.11.2016 № 3
					ТарифПоИнструкции = ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте*Курс;
				иначе
					ТарифПоИнструкции = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСтавка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				КонецЕсли;
				//Островская Татьяна 16.01.2014 № 17044
				если ПроцентОтТСБезКонтракта Тогда
					ТарифПоИнструкции = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСтавка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				КонецЕсли;
				если ПроцентПоИнструкции Тогда
					ТарифПоИнструкции = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.ТарифнаяСПовышениемПоИнструкции / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
				КонецЕсли;
				//Островская Татьяна 16.01.2014 № 17044
				Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам 
					//заявка №1662 (база заявок Кристалла) Дмитрук О.Г.
					или ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
					//заявка №1662
					//Аверсон-софт, Островская Татьяна 04.06.2012 № 15446
					если мСверхурочные тогда
						Попытка
							мТарифнаяСтавка = ТарифПоИнструкции/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
						Исключение
							мТарифнаяСтавка = 0;
						КонецПопытки;
						//Аверсон-софт, Островская Татьяна 04.06.2012 № 15446	
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					иначе
						
						Попытка
							//Аверсон-софт, Островская Татьяна 26.07.2012 № 15	
							//О.Т. Аверсон 08.11.2016 № 3
							Если ФлагВалютныеОклады и ДляПечати Тогда //О.Т. Аверсон 08.11.2016 № 3
								Тариф = ТарифныеСтавки.МесячнаяТарифнаяСтавкаВВалюте*Курс;
							иначе
								Тариф = ?(ЗанимаемаяСтавка=0,0,ТарифныеСтавки.Ставка / ?(ЗанимаемаяСтавка<1 и ФлЧасовойТарифЗаЦелуюСтавку,ЗанимаемаяСтавка,1));
							КонецЕсли;
							//О.Т. Аверсон 08.11.2016 № 3
							если не КоличествоДней = 0 тогда
								мТарифнаяСтавка = Тариф/КоличествоЧасов;
								//Островская Татьяна 16.01.2014 № 17044
								мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта,ТарифПоИнструкции/КоличествоЧасов,мТарифнаяСтавка);
								//Островская Татьяна 16.01.2014 № 17044
							иначе
								если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням Тогда
									
									ДанныеНормаЧасов = ПолучитьРасчетнуюНормуЧасов(Период,Сотрудник);
									
									если ДанныеНормаЧасов.НормаЧасовРасчетная = ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период,Организация) Тогда 
										мТарифнаяСтавка = Тариф/ДанныеНормаЧасов.КоличествоДней;
										мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта или ПроцентПоИнструкции,ТарифПоИнструкции/ДанныеНормаЧасов.КоличествоДней,мТарифнаяСтавка); //Островская Татьяна 16.01.2014 № 17044
									иначе
										мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
										мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта или ПроцентПоИнструкции,ТарифПоИнструкции/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоДням, Период,Организация)),мТарифнаяСтавка); //Островская Татьяна 16.01.2014 № 17044
									КонецЕсли;
								иначеесли ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда
									
									ДанныеНормаЧасов = ПолучитьРасчетнуюНормуЧасов(Период,Сотрудник);
									
									если ДанныеНормаЧасов.НормаЧасовРасчетная = ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация) Тогда 
										мТарифнаяСтавка = Тариф/ДанныеНормаЧасов.КоличествоЧасов;
										мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта или ПроцентПоИнструкции,ТарифПоИнструкции/ДанныеНормаЧасов.КоличествоЧасов,мТарифнаяСтавка); //Островская Татьяна 16.01.2014 № 17044
									иначе
										мТарифнаяСтавка = Тариф/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация));//О.Т. Аверсон 16.10.2017 № 1120
										мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта или ПроцентПоИнструкции,ТарифПоИнструкции/?(РасчетОтСреднегодовойНормы1,ЧасовВГоду.Размер,ПолучитьНормуВремениПоГрафику(ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, Период,Организация)),мТарифнаяСтавка); //Островская Татьяна 16.01.2014 № 17044
									КонецЕсли;
									
								иначе
									мТарифнаяСтавка = Тариф/ЧасовВГоду.Размер;
									мТарифнаяСтавка = ?(ПроцентОтТСБезКонтракта или ПроцентПоИнструкции,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка); //Островская Татьяна 16.01.2014 № 17044
								КонецЕсли;
							КонецЕсли;
							//Аверсон-софт, Островская Татьяна 26.07.2012 № 15
							
							
						Исключение
							мТарифнаяСтавка = 0;
						КонецПопытки;
						мТарифнаяСтавка = ?(ТарСтаркаПоИНН,Тариф/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
					КонецЕсли;
				Иначе
					мТарифнаяСтавка = ТарифПоИнструкции/ЧасовВГоду.Размер;
					мТарифнаяСтавка = ?(ТарСтаркаПоИНН,ТарифПоИнструкции/ЧасовВГоду.Размер,мТарифнаяСтавка);//Островская Татьяна 24.10.2013 № 16856
				КонецЕсли;
			КонецЕсли;
			если ПроцентОтТСБезКонтракта Тогда 
				
				
			КонецЕсли;
			
		КонецЕсли;
		//Если Период < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
		КонстантаОкрЧТС = Константы.ОкруглениеЧасовогоТарифаПриРасчетах.Получить();
		Возврат Окр(мТарифнаяСтавка, ?(КонстантаОкрЧТС = 0,5,КонстантаОкрЧТС)); //О.Т. Аверсон 04.10.2016 окр(, 3) //О.Т. Аверсон 07.12.2016 № 83
		//иначе
		//	Возврат ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавка, Период);//О.Т. Аверсон 15.03.2016 № 949
		//КонецЕсли;
		
	КонецЕсли;
	Возврат 0;
КонецФункции 

Функция ПолучитьДанныеПоИндивидуальному(Период,Сотрудник) Экспорт //Островская Татьяна 15.03.2013 № 16327
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Физлицо,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов1,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов2,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов3,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов4,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов5,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов6,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов7,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов8,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов9,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов10,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов11,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов12,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов13,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов14,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов15,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов16,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов17,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов18,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов19,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов20,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов21,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов22,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов23,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов24,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов25,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов26,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов27,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов28,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов29,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов30,
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов31
	|ИЗ
	|	Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации КАК ВводИндивидуальныхГрафиковРаботыОрганизации
	|		ПО ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка = ВводИндивидуальныхГрафиковРаботыОрганизации.Ссылка
	|ГДЕ
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник = &Сотрудник
	|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2
	|	И ВводИндивидуальныхГрафиковРаботыОрганизации.Проведен = ИСТИНА
	//|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЗаменаНормыВремени  //Аверсон 16.07.2020 КВВ СВФР-006187  (откомментировать потом)
	|"; 
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник); //О.Т. 05.09.2014 Замена ФизЛица на Сотрудник
	Запрос.УстановитьПараметр("ПериодРегистрации1",НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодРегистрации2",КонецМесяца(Период));
	График = Запрос.Выполнить().Выгрузить();
	КоличествоЧасов = 0;
	КоличествоДней = 0;
	Для Каждого СтрокаГрафикаРаботы Из График Цикл
		КоличествоЧасов = 0;
		КоличествоЧасовВечерних = 0;
		КоличествоЧасовНочных = 0;
		КоличествоДней = 0;
		Для ИндексДня = 1 по 31 Цикл
			
			Часов = СтрокаГрафикаРаботы["Часов"+Строка(ИндексДня)];
			
			КоличествоЧасов = КоличествоЧасов + Часов;
			
			Если Часов > 0 Тогда
				КоличествоДней = КоличествоДней + 1;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	ДанныеИндивидуального = Новый Структура;
	ДанныеИндивидуального.Вставить("КоличествоДней",КоличествоДней);
	ДанныеИндивидуального.Вставить("КоличествоЧасов",КоличествоЧасов);
	
	Возврат ДанныеИндивидуального;
КонецФункции //Островская Татьяна 15.03.2013 № 16327

Функция ПолучитьДанныеПоИндивидуальномуЗаИнтервал(ПериодНач,ПериодКон,Сотрудник) Экспорт //О.Т. 03.06.2015 № 448
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Физлицо,
	|	ВЫБОР
	|		КОГДА 1 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов1,
	|	ВЫБОР
	|		КОГДА 2 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов2,
	|	ВЫБОР
	|		КОГДА 3 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов3
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов3,
	|	ВЫБОР
	|		КОГДА 4 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов4
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов4,
	|	ВЫБОР
	|		КОГДА 5 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов5
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов5,
	|	ВЫБОР
	|		КОГДА 6 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов6
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов6,
	|	ВЫБОР
	|		КОГДА 7 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов7
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов7,
	|	ВЫБОР
	|		КОГДА 8 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов8
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов8,
	|	ВЫБОР
	|		КОГДА 9 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов9
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов9,
	|	ВЫБОР
	|		КОГДА 10 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов10,
	|	ВЫБОР
	|		КОГДА 11 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов11
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов11,
	|	ВЫБОР
	|		КОГДА 12 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов12
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов12,
	|	ВЫБОР
	|		КОГДА 13 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов13
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов13,
	|	ВЫБОР
	|		КОГДА 14 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов14
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов14,
	|	ВЫБОР
	|		КОГДА 15 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов15
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов15,
	|	ВЫБОР
	|		КОГДА 16 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов16
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов16,
	|	ВЫБОР
	|		КОГДА 17 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов17
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов17,
	|	ВЫБОР
	|		КОГДА 18 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов18
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов18,
	|	ВЫБОР
	|		КОГДА 19 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов19
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов19,
	|	ВЫБОР
	|		КОГДА 20 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов20
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов20,
	|	ВЫБОР
	|		КОГДА 21 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов21
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов21,
	|	ВЫБОР
	|		КОГДА 22 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов22
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов22,
	|	ВЫБОР
	|		КОГДА 23 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов23
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов23,
	|	ВЫБОР
	|		КОГДА 24 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов24
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов24,
	|	ВЫБОР
	|		КОГДА 25 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов25
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов25,
	|	ВЫБОР
	|		КОГДА 26 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов26
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов26,
	|	ВЫБОР
	|		КОГДА 27 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов27
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов27,
	|	ВЫБОР
	|		КОГДА 28 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов28
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов28,
	|	ВЫБОР
	|		КОГДА 29 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов29
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов29,
	|	ВЫБОР
	|		КОГДА 30 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов30
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов30,
	|	ВЫБОР
	|		КОГДА 31 МЕЖДУ ДЕНЬ(&ДатаНач) И ДЕНЬ(&ДатаКон)
	|			ТОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов31
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Часов31
	|ИЗ
	|	Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации КАК ВводИндивидуальныхГрафиковРаботыОрганизации
	|		ПО ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка = ВводИндивидуальныхГрафиковРаботыОрганизации.Ссылка
	|ГДЕ
	|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник = &Сотрудник
	|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации1 И &ПериодРегистрации2
	|	И ВводИндивидуальныхГрафиковРаботыОрганизации.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник); //О.Т. 05.09.2014 Замена ФизЛица на Сотрудник
	Запрос.УстановитьПараметр("ПериодРегистрации1",НачалоМесяца(ПериодНач));
	Запрос.УстановитьПараметр("ПериодРегистрации2",КонецМесяца(ПериодКон));
	Запрос.УстановитьПараметр("ДатаНач",ПериодНач);
	Запрос.УстановитьПараметр("ДатаКон",ПериодКон);
	График = Запрос.Выполнить().Выгрузить();
	КоличествоЧасов = 0;
	КоличествоДней = 0;
	ЕстьГрафик = Ложь; //Аверсон СМА 11.12.21
	Для Каждого СтрокаГрафикаРаботы Из График Цикл
		КоличествоЧасов = 0;
		КоличествоЧасовВечерних = 0;
		КоличествоЧасовНочных = 0;
		КоличествоДней = 0;
		Для ИндексДня = 1 по 31 Цикл
			
			Часов = СтрокаГрафикаРаботы["Часов"+Строка(ИндексДня)];
			
			КоличествоЧасов = КоличествоЧасов + Часов;
			
			Если Часов > 0 Тогда
				КоличествоДней = КоличествоДней + 1;
			КонецЕсли;
		ЕстьГрафик = Истина; //Аверсон СМА 11.12.21
		КонецЦикла;
	КонецЦикла;
	ДанныеИндивидуального = Новый Структура;
	ДанныеИндивидуального.Вставить("КоличествоДней",КоличествоДней);
	ДанныеИндивидуального.Вставить("КоличествоЧасов",КоличествоЧасов);
	ДанныеИндивидуального.Вставить("ЕстьГрафик",ЕстьГрафик);

	
	Возврат ДанныеИндивидуального;
КонецФункции //Островская Татьяна 15.03.2013 № 16327




Функция ПолучитьРасчетнуюНормуЧасов(Период,Сотрудник) Экспорт //Островская Татьяна 15.03.2013 № 16327
	ЗапросНармаЧасов = Новый Запрос;
	ЗапросНармаЧасов.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ГрафикиРаботыПериодыСмены.НомерСтроки) КАК НомерСтроки,
	|	СУММА(РАЗНОСТЬДАТ(ГрафикиРаботыПериодыСмены.ВремяНачала, ГрафикиРаботыПериодыСмены.ВремяОкончания, ЧАС)) КАК Дни,
	|	ВложенныйЗапрос.ОсновноеЗначение,
	|	ВложенныйЗапрос.ДополнительноеЗначение
	|ИЗ
	|	Справочник.ГрафикиРаботы.ПериодыСмены КАК ГрафикиРаботыПериодыСмены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.ГрафикРаботы КАК ГрафикРаботы,
	|			СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
	|			СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ДополнительноеЗначение
	|		ИЗ
	|			РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
	|				ГДЕ
	|					РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник) КАК ВложенныйЗапрос
	|				ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВложенныйЗапрос.ГрафикРаботы
	|		ГДЕ
	|			ГрафикиРаботыПоВидамВремени.Месяц МЕЖДУ &Месяц И &Месяц1
	|			И ГрафикиРаботыПоВидамВремени.План = ИСТИНА
	|			И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетавремени.ПоДням)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.ГрафикРаботы) КАК ВложенныйЗапрос
	|		ПО ГрафикиРаботыПериодыСмены.Ссылка = ВложенныйЗапрос.ГрафикРаботы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ОсновноеЗначение,
	|	ВложенныйЗапрос.ДополнительноеЗначение";
	ЗапросНармаЧасов.УстановитьПараметр("Сотрудник",Сотрудник);
	ЗапросНармаЧасов.УстановитьПараметр("Месяц",НачалоМесяца(Период));
	ЗапросНармаЧасов.УстановитьПараметр("Месяц1",КонецМесяца(Период));
	РезНормаЧасов = ЗапросНармаЧасов.Выполнить().Выбрать();
	если РезНормаЧасов.Следующий() Тогда  
		НормаЧасовВДень = РезНормаЧасов.Дни / РезНормаЧасов.НомерСтроки;
		НормаЧасовРасчетная = НормаЧасовВДень * РезНормаЧасов.ОсновноеЗначение;
	КонецЕсли;
	ДанныеНормаЧасов = Новый Структура;
	ДанныеНормаЧасов.Вставить("КоличествоДней",РезНормаЧасов.ОсновноеЗначение);
	ДанныеНормаЧасов.Вставить("КоличествоЧасов",РезНормаЧасов.ДополнительноеЗначение);//О.Т. 07.08.2014 № 160
	ДанныеНормаЧасов.Вставить("НормаЧасовРасчетная",НормаЧасовРасчетная);
	
	Возврат ДанныеНормаЧасов;
	
КонецФункции //Островская Татьяна 15.03.2013 № 16327


Процедура РассчитатьСуммуЗаРаботу(ОтражатьВБухгалтерскомУчете, ОтражатьВУправленческомУчете, ТекущиеДанные, Дата, ВалютаРегламентированногоУчета, ВалютаУпрУчета, КурсВалютыУпрУчета, КратностьВалютыУпрУчета, РассчитыватьСуммуЗаРаботуВВалютеРасценки = Истина, мПроцент) Экспорт
	
	Если РассчитыватьСуммуЗаРаботуВВалютеРасценки Тогда
		ТекущиеДанные.СуммаЗаРаботуВВалютеРасценки = ТекущиеДанные.Расценка * мПроцент /100;
		Если мПроцент=0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не введен процент сделки");
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущиеДанные.Валюта = ВалютаРегламентированногоУчета Тогда
		КурсВылютыРасценки = 1;
		КратностьВылютыРасценки = 1;
	ИначеЕсли ТекущиеДанные.Валюта = ВалютаУпрУчета Тогда	
		КурсВылютыРасценки = КурсВалютыУпрУчета;
		КратностьВылютыРасценки = КратностьВалютыУпрУчета;
	Иначе	
		Структура = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ТекущиеДанные.Валюта));
		КурсВылютыРасценки = Структура.Курс;
		КратностьВылютыРасценки = Структура.Кратность;
	КонецЕсли; 
	
	Если ОтражатьВУправленческомУчете Тогда
		ТекущиеДанные.Сумма = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ТекущиеДанные.СуммаЗаРаботуВВалютеРасценки,ТекущиеДанные.Валюта,ВалютаУпрУчета,
		КурсВылютыРасценки, КурсВалютыУпрУчета, КратностьВылютыРасценки, КратностьВалютыУпрУчета, Дата);//О.Т. Аверсон 12.03.2016 № 949
	КонецЕсли;
	Если ОтражатьВБухгалтерскомУчете Тогда
		ТекущиеДанные.СуммаРегл = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ТекущиеДанные.СуммаЗаРаботуВВалютеРасценки,ТекущиеДанные.Валюта,ВалютаРегламентированногоУчета,
		КурсВылютыРасценки, 1, КратностьВылютыРасценки, 1,Дата);//О.Т. Аверсон 12.03.2016 № 949
	КонецЕсли;
	
КонецПроцедуры // РассчитатьСуммуЗаРаботу()

//Процедура по Доплате за ночные часы и Доплате за вечерние часы
Процедура ЗаполнитьНачисленияДополнительнымиВидамиРасчета(Начисления, ТЗНачисления, мДопНачисления = Ложь,Организация, ВРОтСтажаПоСумме = Неопределено ) Экспорт //Наркевич 27.03.2014 №17231 /Аверсон 24.01.2023 КВВ СВФР-010220 (ВРОтСтажаПоСумме)
	СписокДополнительныхОсновныхНачислений = Новый СписокЗначений;
	СписокДополнительныхОсновныхНачислений.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
	СписокДополнительныхОсновныхНачислений.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы); 
	
	//СписокДополнительныхОсновныхНачислений.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоНаименованию("Вредность доп."));
	Запрос = Новый Запрос;
	Если Организация.ИНН = "100765738" Тогда //О.Т. Аверсон 13.12.2016 № 100 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
		|	ОсновныеНачисленияОрганизаций.СпособРасчета КАК СпособРасчета,
		|	ОсновныеНачисленияОрганизаций.ВидВремени,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	РабочееВремяРаботниковОрганизаций.Регистратор
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|		ПО РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени
		|ГДЕ
		|	(РабочееВремяРаботниковОрганизаций.ДатаНачала МЕЖДУ &парамНачало И &парамКонец
		|			ИЛИ &парамНачало МЕЖДУ РабочееВремяРаботниковОрганизаций.ДатаНачала И РабочееВремяРаботниковОрганизаций.ДатаОкончания)
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&Список)
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияОрганизаций.Ссылка,
		|	ОсновныеНачисленияОрганизаций.СпособРасчета,
		|	ОсновныеНачисленияОрганизаций.ВидВремени,
		|	РабочееВремяРаботниковОрганизаций.Регистратор";
	иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
		|	ОсновныеНачисленияОрганизаций.СпособРасчета КАК СпособРасчета,
		|	ОсновныеНачисленияОрганизаций.ВидВремени,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	РабочееВремяРаботниковОрганизаций.Регистратор
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|		ПО РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.Период >= &парамНачало
		|	И РабочееВремяРаботниковОрганизаций.Период <= &парамКонец
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&Список)	
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияОрганизаций.Ссылка,
		|	ОсновныеНачисленияОрганизаций.СпособРасчета,
		|	ОсновныеНачисленияОрганизаций.ВидВремени,
		|	РабочееВремяРаботниковОрганизаций.Регистратор";
	КонецЕсли;
	Запрос.УстановитьПараметр("парамНачало", Начисления.ДатаНачала);
	Запрос.УстановитьПараметр("парамКонец", Начисления.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", Начисления.Сотрудник);
	Запрос.УстановитьПараметр("Список", СписокДополнительныхОсновныхНачислений);
	//Наркевич 27.03.2014 №
	Если ВРОтСтажаПоСумме <> Неопределено ИЛИ //Аверсон 24.01.2023 КВВ СВФР-010220
		(Организация.РасчетСтажаОтДатыПриема и ЗначениеЗаполнено(Организация.ВидРасчета)и Начисления.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы 
		или Организация.РасчетСтажаОтДатыПриема и ЗначениеЗаполнено(Организация.ВидРасчета)и Начисления.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство и Организация.ИНН = "806000046")
		или Организация.СтажВнутренним Тогда
		Если Организация.ИНН = "100194961" Тогда                          //СВФР-009955
			Если ПроведениеРасчетов.ЭтоРабочийСоСдельнойОплатой(Начисления.Сотрудник, Начисления.ДатаНачала) Тогда 
				ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("1311");
			Иначе
				ВидРасчета = Организация.ВидРасчета;
				Запрос.УстановитьПараметр("ВидРасчетаФлаг",Организация.ВидРасчета);
			КонецЕсли; 				
			Запрос.УстановитьПараметр("ВидРасчетаФлаг",ВидРасчета); 		
		Иначе
			//Аверсон 24.01.2023 КВВ СВФР-010220 (
			//Запрос.УстановитьПараметр("ВидРасчетаФлаг",Организация.ВидРасчета);
			Запрос.УстановитьПараметр("ВидРасчетаФлаг",?(ВРОтСтажаПоСумме <> Неопределено,ВРОтСтажаПоСумме,Организация.ВидРасчета));
			//Аверсон 24.01.2023 КВВ СВФР-010220 )
		КонецЕсли;
		Запрос.Текст =Запрос.Текст+ 
		"
		|ОБЪЕДИНИТЬ ВСЕ
		
		|ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизаций.Ссылка,
		|	ОсновныеНачисленияОрганизаций.СпособРасчета,
		|	ОсновныеНачисленияОрганизаций.ВидВремени,
		|	NULL,
		|	NULL
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияОрганизаций.Ссылка = &ВидРасчетаФлаг";
		//|   И ОсновныеНачисленияОрганизаций.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		
		
	КонецЕсли;
	
	//Наркевич 27.03.2014 №
	
	РезультатЗапроса = Запрос.Выполнить();
	мНачисленияВыборка = РезультатЗапроса.Выбрать();
	
	Пока мНачисленияВыборка.Следующий() Цикл
		//начисления из нарядов не будем добавлять, все рассчеты идут из этого документа
		Если ТипЗнч(мНачисленияВыборка.Регистратор) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
			Продолжить;
		КонецЕсли;
		//Островская Татьяна 02.04.2014
		ДатаСравнения = Начисления.ДатаОкончания;//О.Т. Аверсон 01.04.2016
		ЦифраПроцентОтСтажа = 0;
		Если мНачисленияВыборка.ВидРасчета = Организация.ВидРасчета или 
			(Организация.ИНН = "100194961" и мНачисленияВыборка.ВидРасчета = ВидРасчета) Тогда
			
			//СВЭЙ 22.02.2024 КВВ СВФР-012384 (
			Если Организация.РасчетСтажаНаНачалоМесяца И Организация.РасчетСтажаОтДатыПриема Тогда  
				Д_Ок = ПолучитьОкончаниеОтпускПоУходуЗаРебенкомБезОплаты(Начисления.Сотрудник,НачалоМесяца(Начисления.ДатаНачала)); 
				Если ЗначениеЗаполнено(Д_Ок) Тогда
					Если Д_Ок > Начисления.ДатаНачала Тогда //Аверсон ЕАЕ 17.09.2024 СВФР-013737
						Начисления.ДатаНачала = Д_Ок;
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;
			//СВЭЙ 22.02.2024 КВВ СВФР-012384 )
			
			ЦифраПроцентОтСтажа = ПолучитьПроцентОтСтажаПоСотруднику(Начисления.Сотрудник, мНачисленияВыборка.ВидРасчета, ДатаСравнения,Организация);
			ПодразделениеУчилище = Ложь;
			Если Найти(ТРег(Начисления.ПодразделениеОрганизации), "Училище")>0 Тогда 
				ПодразделениеУчилище = Истина;
			КонецЕсли;
			Если ПодразделениеУчилище Тогда 
				ЦифраПроцентОтСтажа = 0;
			КонецЕсли;  
			Если Организация.ИНН = "700067572" Тогда 	// если ученические стаж не добавляем 18.01.23			
				Если Найти(Начисления.видРасчета,"15.Ученические") > 0 Тогда  
					ЦифраПроцентОтСтажа = 0;					
				КонецЕсли;
			КонецЕсли;
			если ЦифраПроцентОтСтажа = 0 Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		//Островская Татьяна 02.04.2014
		
		// Добавим новую строку начислений
		мНоваяСтрока = ТЗНачисления.Добавить();
		мНоваяСтрока.Сотрудник = Начисления.Сотрудник;
		мНоваяСтрока.ТабНомер = Начисления.ТабНомер; //Островская Татьяна 20.03.2014
		мНоваяСтрока.Физлицо = Начисления.Физлицо;
		мНоваяСтрока.ВидРасчета = мНачисленияВыборка.ВидРасчета;
		Если мНачисленияВыборка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаВечерниеЧасы
			ИЛИ мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТариф  //О.Т. Аверсон 03.04.2016 № 981
			ИЛИ мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТарифИнстр  //О.Т. Аверсон 03.04.2016 № 981
			ИЛИ мНачисленияВыборка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаНочныеЧасы Тогда
			//Островская Татьяна 08.05.2014 № 17350
			
			
			СреднегодоваяНорма = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(,Новый Структура("Организация,ВидПараметра,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов,Начисления.ГрафикРаботы));
			Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") Тогда //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	НачисленияРаботниковОрганизации.ВидРасчета
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
				|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
				|ГДЕ
				|	ВЫБОР
				|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
				|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|	И ВЫБОР
				|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА ВЫБОР
				|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
				|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
				|					КОНЕЦ
				|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
				|		КОНЕЦ = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам)";
				
				Запрос.УстановитьПараметр("парамНачало", Начисления.ДатаНачала);
				Запрос.УстановитьПараметр("Сотрудник", Начисления.Сотрудник);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВидРасчета1 = Неопределено;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ВидРасчета1 = ВыборкаДетальныеЗаписи.ВидРасчета;
				КонецЦикла;

				Если ВидРасчета1 =ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда
					СреднегодоваяНорма.Размер = 0;
				КонецЕсли;
			КонецЕсли;

			если СреднегодоваяНорма.Размер > 0 Тогда 
				Если мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТариф Тогда //О.Т. Аверсон 03.04.2016 № 981
					ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).ТарифнаяСтавка;
				иначеЕсли мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТарифИнстр Тогда //О.Т. Аверсон 03.04.2016 № 981
					ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).ТарифнаяСПовышениемПоИнструкции;
				иначе
					ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).Ставка;
				КонецЕсли;
				
				Если Начисления.ДатаОкончания < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
					мНоваяСтрока.Показатель1 = Окр(ТарифныеСтавки/СреднегодоваяНорма.Размер,3);
				иначе
					//Аверсон 26.09.2019 КВВ СВФР-004827 (
					Если (Организация.ИНН = "100010315" ИЛИ Организация.ИНН = "700176068" ИЛИ Организация.ИНН = "400230097" ИЛИ Организация.ИНН = "300000265" ИЛИ Организация.ИНН = "500158130" ИЛИ Организация.ИНН = "200400628") Тогда  //Аверсон 07.08.2021 КВВ СВФР-008072 ( +5 УНП к Ортопедам)
						мНоваяСтрока.Показатель1 = Окр(ТарифныеСтавки/СреднегодоваяНорма.Размер,4);
					Иначе
						//Аверсон 26.09.2019 КВВ СВФР-004827 )
						мНоваяСтрока.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныеСтавки/СреднегодоваяНорма.Размер,Начисления.ДатаОкончания);//О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
				КонецЕсли;
			иначе
				Если мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТариф Тогда //О.Т. Аверсон 03.04.2016 № 981
					//ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					//Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).ТарифнаяСтавка;
					мНоваяСтрока.Показатель1 =  ПолучитьЧасовуюТарифнуюСтавку(Начисления.ПодразделениеОрганизации.Владелец, Начисления.Сотрудник, Начисления.ДатаНачала, Начисления.ГрафикРаботы,,,,мДопНачисления,,Истина);
				иначеЕсли мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыТарифИнстр Тогда //О.Т. Аверсон 03.04.2016 № 981
					//ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					//Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).ТарифнаяСПовышениемПоИнструкции;
					мНоваяСтрока.Показатель1 =  ПолучитьЧасовуюТарифнуюСтавку(Начисления.ПодразделениеОрганизации.Владелец, Начисления.Сотрудник, Начисления.ДатаНачала, Начисления.ГрафикРаботы,,,,мДопНачисления,,,,,Истина);
				иначе
					//ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
					//Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник)).Ставка;
					мНоваяСтрока.Показатель1 =  ПолучитьЧасовуюТарифнуюСтавку(Начисления.ПодразделениеОрганизации.Владелец, Начисления.Сотрудник, Начисления.ДатаНачала, Начисления.ГрафикРаботы,,,,мДопНачисления);
				КонецЕсли; 
			КонецЕсли;
			
			//Островская Татьяна 08.05.2014 № 17350
		КонецЕсли;
		если мНачисленияВыборка.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыРасчетОтСреднегодовой Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
			
			Запрос.УстановитьПараметр("Дата", Начисления.ДатаОкончания);
			Запрос.УстановитьПараметр("Сотрудник", Начисления.Сотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			СреднегодоваяНорма = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ГрафикРаботыСотрудника = ВыборкаДетальныеЗаписи.ГрафикРаботы;
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение
				|ИЗ
				|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
				|ГДЕ
				|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
				|	И ГрафикиРаботыПоВидамВремени.ВидВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
				|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &Дата И &Дата1";
				
				Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботыСотрудника);
				Запрос.УстановитьПараметр("Дата", НачалоГода(Начисления.ДатаОкончания));
				Запрос.УстановитьПараметр("Дата1", КонецГода(Начисления.ДатаОкончания));
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СреднегодоваяНорма = СреднегодоваяНорма + ВыборкаДетальныеЗаписи.ОсновноеЗначение;
				КонецЦикла;
				
				
			КонецЦикла;
			СреднегодоваяНорма = СреднегодоваяНорма/12;
			
			если СреднегодоваяНорма > 0 Тогда 
				ТарифныеСтавки = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Начисления.ДатаНачала,
				Новый Структура("Организация,Сотрудник", Организация, Начисления.Сотрудник));
				Если Начисления.ДатаОкончания < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 94
					мНоваяСтрока.Показатель1 = Окр(ТарифныеСтавки.Ставка/СреднегодоваяНорма,3);
				иначе
					
					//Аверсон ЕАЕ 01.10.2025 СВФР-016869
					//мНоваяСтрока.Показатель1 = Окр(ТарифныеСтавки.Ставка/СреднегодоваяНорма,4);//О.Т. Аверсон 15.03.2016 № 949 ,32(окр 4 знака)
					КонстантаОкрЧТС = Константы.ОкруглениеЧасовогоТарифаПриРасчетах.Получить();
					ТочностьЧТС = ?(КонстантаОкрЧТС = 0,4,КонстантаОкрЧТС);
					мНоваяСтрока.Показатель1 = Окр(ТарифныеСтавки.Ставка/СреднегодоваяНорма,ТочностьЧТС);
					//Аверсон СВФР-016869
					
				КонецЕсли;
				Если Организация.ИНН = "101132899" Тогда  
					мНоваяСтрока.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныеСтавки.Ставка/СреднегодоваяНорма,Начисления.ДатаНачала);
				КонецЕсли;
			иначе
				мНоваяСтрока.Показатель1 =  ПолучитьЧасовуюТарифнуюСтавку(Начисления.ПодразделениеОрганизации.Владелец, Начисления.Сотрудник, Начисления.ДатаНачала, Начисления.ГрафикРаботы,,,,мДопНачисления);
			КонецЕсли;
		КонецЕсли;
		
		
		Если мНачисленияВыборка.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Питание Тогда
			мНоваяСтрока.Показатель1 = мНачисленияВыборка.Дней;
		КонецЕсли;
		//Наркевич 27.03.2014 №
		Если мНачисленияВыборка.ВидРасчета = Организация.ВидРасчета или (Организация.ИНН = "100194961" и мНачисленияВыборка.ВидРасчета = ВидРасчета) Тогда
			мНоваяСтрока.Показатель1 = ЦифраПроцентОтСтажа;
		КонецЕсли;
		
		//Наркевич 27.03.2014 №
		мНоваяСтрока.Основное = Начисления.Основное;
		мНоваяСтрока.ДатаНачала = Начисления.ДатаНачала;
		мНоваяСтрока.ДатаОкончания = Начисления.ДатаОкончания;
		мНоваяСтрока.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
		мНоваяСтрока.ПодразделениеОрганизации = Начисления.ПодразделениеОрганизации;
		мНоваяСтрока.СпособРасчета = Начисления.СпособРасчета;
		мНоваяСтрока.ВидВремени = Начисления.ВидВремени;
		мНоваяСтрока.ГрафикРаботы = Начисления.ГрафикРаботы;
		мНоваяСтрока.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
		//Наркевич 28.03.2014 №
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаПриема
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник",Начисления.Сотрудник);
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		ДатаОтсчета = Неопределено;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ДатаОтсчета = ВыборкаДетальныеЗаписи.ДатаПриема;
		КонецЦикла;
		
		//Аверсон 24.01.2023 КВВ СВФР-010220 (
		Если ВРОтСтажаПоСумме <> Неопределено 
			ИЛИ (Организация.РасчетСтажаОтДатыПриема и ЗначениеЗаполнено(Организация.ВидРасчета)) Тогда
			ЗВРОтСтажаПоСумме = Новый Запрос;
			ЗВРОтСтажаПоСумме.Текст = "ВЫБРАТЬ
			|ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней) как СтартСтажа
			|ИЗ Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
			|ГДЕ ФизическиеЛицаСтажи.Ссылка = &ФизЛицо
			|И ФизическиеЛицаСтажи.ВидСтажа = &ВидСтажа";
			ЗВРОтСтажаПоСумме.УстановитьПараметр("ФизЛицо",Начисления.Сотрудник.ФизЛицо);
			ЗВРОтСтажаПоСумме.УстановитьПараметр("ВидСтажа",?(ВРОтСтажаПоСумме <> Неопределено,ВРОтСтажаПоСумме.ВидСтажа,Организация.ВидРасчета.ВидСтажа));
			РезЗВРОтСтажаПоСумме = ЗВРОтСтажаПоСумме.Выполнить().Выгрузить();
			Если РезЗВРОтСтажаПоСумме.Количество() > 0 Тогда
				ДатаОтсчета = Мин(ДатаОтсчета,РезЗВРОтСтажаПоСумме[0].СтартСтажа);
			КонецЕсли;
		КонецЕсли;
		//Аверсон 24.01.2023 КВВ СВФР-010220 )
		
		Если ВРОтСтажаПоСумме <> Неопределено 
			
			//Аверсон ЕАЕ 05.11.2024 СВФР-014032
			И мНачисленияВыборка.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаНочныеЧасы 
			//Аверсон СВФР-014032
			
			ИЛИ //Аверсон 24.01.2023 КВВ СВФР-010220
			(Организация.РасчетСтажаОтДатыПриема и ЗначениеЗаполнено(Организация.ВидРасчета)и
			мНачисленияВыборка.ВидРасчета = Организация.ВидРасчета) или (Организация.ИНН = "100194961" и мНачисленияВыборка.ВидРасчета = ВидРасчета)  Тогда//009955
			если ЗначениеЗаполнено(ДатаОтсчета) Тогда 
				//Аверсон ЕАЕ 01.07.2025 СВФР-016170
				Если Месяц(ДатаОтсчета) = 2 И День(ДатаОтсчета) = 29 И Год(Начисления.ДатаНачала)%4 <> 0 Тогда
					мДатаОтсчета = Дата(Год(Начисления.ДатаНачала),3,1);
				Иначе
				//Аверсон СВФР-016170
					мДатаОтсчета = Дата(Год(Начисления.ДатаНачала), Месяц(ДатаОтсчета), День(ДатаОтсчета));
				КонецЕсли;
				Если мДатаОтсчета > Начисления.ДатаНачала И мДатаОтсчета < КонецМесяца(Начисления.ДатаНачала) Тогда
					ПодразделениеУчилище = Ложь;
					Если Найти(ТРег(Начисления.ПодразделениеОрганизации), "Училище")>0 Тогда 
						ПодразделениеУчилище = Истина;
					КонецЕсли;
					
					мВеличина = ПрочиеПроцедуры.ПолучитьПроцентОтСтажаПоСотруднику(Начисления.Сотрудник, мНачисленияВыборка.ВидРасчета, КонецМесяца(Начисления.ДатаОкончания),Организация);//Островская Татьяна 24.07.2013 № 16643
					Если ПодразделениеУчилище Тогда 
						мВеличина = 0;
					КонецЕсли;
					
					мНоваяСтрока.ДатаОкончания = мин(Начисления.ДатаОкончания,мДатаОтсчета - 1); //Наркевич 24.07.2014 № дайнеко
					мНоваяСтрока.Показатель1 = ПолучитьПроцентОтСтажаПоСотруднику(мНоваяСтрока.Сотрудник, мНачисленияВыборка.ВидРасчета, мНоваяСтрока.ДатаОкончания,Организация);
					Если ПодразделениеУчилище Тогда 
						мНоваяСтрока.Показатель1 = 0;
					КонецЕсли;
					// ... и введем еще один
					если мНоваяСтрока.Показатель1 = мВеличина Тогда
						мНоваяСтрока.ДатаОкончания = Начисления.ДатаОкончания;
						
					иначе
						//ПСА 21.10.2021 СВФР-008274 +++
						//Если   мДатаОтсчета < Начисления.ДатаОкончания Тогда //Наркевич 24.07.2014 № дайнеко
						Если   мДатаОтсчета <= Начисления.ДатаОкончания Тогда //Наркевич 24.07.2014 № дайнеко
						//+++ПСА 21.10.2021 СВФР-008274	
							мНоваяСтрока = ТЗНачисления.Добавить();
							мНоваяСтрока.Сотрудник = Начисления.Сотрудник;
							мНоваяСтрока.ТабНомер = Начисления.ТабНомер;//Островская Татьяна 22.01.2014 № 17057
							мНоваяСтрока.Физлицо = Начисления.Физлицо;
							мНоваяСтрока.ВидРасчета = мНачисленияВыборка.ВидРасчета;
							мНоваяСтрока.КодВычета = Начисления.КодВычета;
							Если ТипЗнч(Начисления.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
								мНоваяСтрока.Показатель1 = мВеличина;				
							Иначе
								мНоваяСтрока.Размер = мВеличина;
							КонецЕсли;
							мНоваяСтрока.Основное = Начисления.Основное;
							мНоваяСтрока.ДатаНачала = мДатаОтсчета;
							мНоваяСтрока.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
							мНоваяСтрока.ДатаОкончания = Начисления.ДатаОкончания;
							мНоваяСтрока.ПодразделениеОрганизации = Начисления.ПодразделениеОрганизации;
							мНоваяСтрока.СпособРасчета = Начисления.СпособРасчета;
							мНоваяСтрока.ВидВремени = Начисления.ВидВремени;
							мНоваяСтрока.ГрафикРаботы = Начисления.ГрафикРаботы;
							мНоваяСтрока.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
						КонецЕсли;//Наркевич 24.07.2014 № дайнеко
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция ОтработанноеВремяПоСводнымГраффикам(парамНачало, парамКонец, Сотрудник, ВидИспользованияРабочегоВремени, ВЦеломЗаПериод, ИспользоватьПериод=Ложь,Организация) Экспорт
	Запрос = Новый Запрос;
	Если Организация.ИНН = "100765738" Тогда //О.Т. Аверсон 13.12.2016 № 100 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		|	(РабочееВремяРаботниковОрганизаций.ДатаНачала МЕЖДУ &парамНачало И &парамКонец
		|			ИЛИ &парамНачало МЕЖДУ РабочееВремяРаботниковОрганизаций.ДатаНачала И РабочееВремяРаботниковОрганизаций.ДатаОкончания)
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ ";
	иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &парамНачало И &парамКонец
		|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	КонецЕсли;
	Если ИспользоватьПериод Тогда
		Запрос.Текст = Запрос.Текст + " И РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод = &ВЦеломЗаПериод";
	КонецЕсли;
	
	УчетнаяПолитикаЗапрос = Новый Запрос;//О.Т. 23.12.2014 № 
	УчетнаяПолитикаЗапрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
	УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
	если УчетнаяПолитика.Количество()>0 Тогда 
		Запрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
	иначе
		Запрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидИспользованияРабочегоВремени", ВидИспользованияРабочегоВремени);
	Запрос.УстановитьПараметр("ВЦеломЗаПериод", ВЦеломЗаПериод);
	мРезультат = Запрос.Выполнить().Выгрузить();
	мОтработано = Новый Структура;
	мОтработано.Вставить("Дней", ?(ЗначениеЗаполнено(мРезультат[0].Дней), мРезультат[0].Дней, 0));
	мОтработано.Вставить("Часов", ?(ЗначениеЗаполнено(мРезультат[0].Часов), мРезультат[0].Часов, 0));
	Возврат мОтработано;
КонецФункции

Функция ОтработанноеВремяПоПлановымГраффикамПлан(парамНачало, парамКонец, Сотрудник, ВидУчетаВремени, ТипГрафика = Истина,Регистратор = Неопределено) Экспорт //Островская Татьяна 15.07.2013 № 16623
	//Островская Татьяна 15.07.2013 № 16623
	если не ЗначениеЗаполнено(Регистратор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <= 0
		|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеПолное
		|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
		|		КОНЕЦ) КАК Значение
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
		|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
		|	И ГрафикиРаботыПоВидамВремени.План = &ТипГрафика";
		
		Запрос.УстановитьПараметр("парамНачало", парамНачало);
		Запрос.УстановитьПараметр("парамКонец", парамКонец);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
		Запрос.УстановитьПараметр("ТипГрафика", ТипГрафика);
		мРезультат = Запрос.Выполнить().Выгрузить();
		Если мРезультат[0].Значение <> Null Тогда
			Возврат мРезультат[0].Значение;
		КонецЕсли;
		мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
		Новый Структура("Организация, Сотрудник", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"), Сотрудник));
		Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
		мРезультат = Запрос.Выполнить().Выгрузить();
		
		//Аверсон ЕАЕ 20.04.2021 СВФР-007445
		//Возврат мРезультат[0].Значение;
		Если мРезультат[0].Значение = null Тогда
			Возврат 0;
		Иначе
			Возврат мРезультат[0].Значение;
		КонецЕсли;
		//Аверсон СВФР-007445
		
	иначе
		
		если Регистратор.КалендарныеДни Тогда 
			мРезультат = ПолучитьДниПоКалендарю(парамНачало,парамКонец,Сотрудник,Регистратор);
			Возврат  мРезультат;
		иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <= 0
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеПолное
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
			|		КОНЕЦ) КАК Значение
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
			|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
			|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
			|	И ГрафикиРаботыПоВидамВремени.План = &ТипГрафика";
			
			Запрос.УстановитьПараметр("парамНачало", парамНачало);
			Запрос.УстановитьПараметр("парамКонец", парамКонец);
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
			Запрос.УстановитьПараметр("ТипГрафика", ТипГрафика);
			мРезультат = Запрос.Выполнить().Выгрузить();
			Если мРезультат[0].Значение <> Null Тогда
				Возврат мРезультат[0].Значение;
			КонецЕсли;
			мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
			Новый Структура("Организация, Сотрудник", Регистратор.Организация, Сотрудник));//О.Т. Аверсон 16.10.2017 № 1120
			Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
			мРезультат = Запрос.Выполнить().Выгрузить();
			
			//Аверсон ЕАЕ 20.04.2021 СВФР-007445
			//Возврат мРезультат[0].Значение;
			Если мРезультат[0].Значение = null Тогда
				Возврат 0;
			Иначе
				Возврат мРезультат[0].Значение;
			КонецЕсли;
			//Аверсон СВФР-007445
			
		КонецЕсли;
		
	КонецЕсли;
	//Островская Татьяна 15.07.2013 № 16623
	
	
КонецФункции


Функция РассчитатьКоличествоДнейОтпуска(ДатаНачалаОтпуска, ДатаОкончанияОтпуска) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаОтпуска",		ДатаНачалаОтпуска);
	Запрос.УстановитьПараметр("ДатаОкончанияОтпуска",	ДатаОкончанияОтпуска);
	Запрос.Текст =
	"ВЫБРАТЬ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КоличествоДнейОтпуска //О.Т. Аверсон 14.05.2018 № 1957 в отпуске использовать календарные дни и праздники тоже включаются
	|	СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни) КАК КоличествоДнейОтпуска
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаОтпуска И &ДатаОкончанияОтпуска";	
	Выборка = Запрос.Выполнить().Выбрать();
	мКоличествоДнейОтпуска = 0;
	Пока Выборка.Следующий() Цикл
		мКоличествоДнейОтпуска = Выборка.КоличествоДнейОтпуска;
	КонецЦикла;
	
	Возврат мКоличествоДнейОтпуска;
	
КонецФункции

Функция ОтработанноеВремяПоНарядам(парамНачало, парамКонец, Сотрудник, ПодразделениеОрганизации, ВидИспользованияРабочегоВремени, ВЦеломЗаПериод=Ложь, ИспользоватьПериод=Ложь) Экспорт // не используется
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
	|	СУММА(СдельныйНарядИсполнители.СуммаКНачислениюРегл) КАК Сумма
	|ИЗ
	|	Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО СдельныйНарядИсполнители.Ссылка = РабочееВремяРаботниковОрганизаций.Регистратор
	|			И СдельныйНарядИсполнители.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
	|ГДЕ
	|	СдельныйНарядИсполнители.Ссылка.Проведен
	|	И СдельныйНарядИсполнители.Ссылка.ДатаНачалаПериода МЕЖДУ &НачДата И &КонДата
	|	И СдельныйНарядИсполнители.Сотрудник = &Сотрудник
	|	И СдельныйНарядИсполнители.Ссылка.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени";
	Если ИспользоватьПериод Тогда
		Запрос.Текст = Запрос.Текст + " И РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод = &ВЦеломЗаПериод";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачДата", парамНачало);
	Запрос.УстановитьПараметр("КонДата", парамКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВидИспользованияРабочегоВремени", ВидИспользованияРабочегоВремени);
	Запрос.УстановитьПараметр("ВЦеломЗаПериод", ВЦеломЗаПериод);
	мРезультат = Запрос.Выполнить().Выгрузить();
	мОтработано = Новый Структура;
	мОтработано.Вставить("Дней", ?(ЗначениеЗаполнено(мРезультат[0].Дней), мРезультат[0].Дней, 0));
	мОтработано.Вставить("Часов", ?(ЗначениеЗаполнено(мРезультат[0].Часов), мРезультат[0].Часов, 0));
	мОтработано.Вставить("Сумма", ?(ЗначениеЗаполнено(мРезультат[0].Сумма), мРезультат[0].Сумма, 0));
	Возврат мОтработано;
КонецФункции

Процедура ЗаполнитьНачисленияСдельнойОплатой(Начисления, ТЗНачисления, НезакрытыеСтроки, ОкончаниеПериодаЗаполнения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СдельныйНарядИсполнители.Сотрудник КАК Сотрудник,
	|	СдельныйНарядИсполнители.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|ГДЕ
	|	СдельныйНарядИсполнители.Ссылка.Проведен
	|	И СдельныйНарядИсполнители.Ссылка.ДатаНачалаПериода МЕЖДУ &НачДата И &КонДата
	|	И СдельныйНарядИсполнители.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	СдельныйНарядИсполнители.Ссылка.ПодразделениеОрганизации,
	|	СдельныйНарядИсполнители.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизации";
	
	
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(Начисления.Период));
	Запрос.УстановитьПараметр("КонДата", ОкончаниеПериодаЗаполнения);
	Запрос.УстановитьПараметр("Сотрудник", Начисления.Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	мНачисленияВыборка = РезультатЗапроса.Выбрать();
	
	Пока мНачисленияВыборка.Следующий() Цикл
		// Добавим новую строку начислений
		мНоваяСтрока = ТЗНачисления.Добавить();
		мНоваяСтрока.Сотрудник = Начисления.Сотрудник;
		мНоваяСтрока.Физлицо = Начисления.Физлицо;
		мНоваяСтрока.ВидРасчета = Начисления.ВидРасчета;
		мНоваяСтрока.Показатель1 = Начисления.Показатель1;
		мНоваяСтрока.Показатель2 = Начисления.Показатель2;
		мНоваяСтрока.Основное = Начисления.ОсновноеНачисление;
		мНоваяСтрока.ДатаНачала = НачалоМесяца(Начисления.Период);
		мНоваяСтрока.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
		мНоваяСтрока.ПодразделениеОрганизации = мНачисленияВыборка.ПодразделениеОрганизации;
		мНоваяСтрока.СпособРасчета = Начисления.СпособРасчета;
		мНоваяСтрока.ВидВремени = Начисления.ВидВремени;
		мНоваяСтрока.ГрафикРаботы = Начисления.ГрафикРаботы;
		мНоваяСтрока.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
		
		НезакрытыеСтроки.Добавить(мНоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНачисленияПовременнойОплатой(Начисления, ТЗНачисления, НезакрытыеСтроки, ОкончаниеПериодаЗаполнения) Экспорт  // не используется
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	РабочееВремяРаботниковОрганизаций.Регистратор.ПодразделениеОрганизации КАК ПодразделениеОрганизации
	|ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|ГДЕ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
	|	И (НЕ РабочееВремяРаботниковОрганизаций.Сдельно)
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочееВремяРаботниковОрганизаций.Сотрудник,
	|	РабочееВремяРаботниковОрганизаций.Регистратор.ПодразделениеОрганизации";
	
	
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(Начисления.Период));
	Запрос.УстановитьПараметр("КонДата", ОкончаниеПериодаЗаполнения);
	Запрос.УстановитьПараметр("Сотрудник", Начисления.Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	мНачисленияВыборка = РезультатЗапроса.Выбрать();
	
	Пока мНачисленияВыборка.Следующий() Цикл
		// Добавим новую строку начислений
		мНоваяСтрока = ТЗНачисления.Добавить();
		мНоваяСтрока.Сотрудник = Начисления.Сотрудник;
		мНоваяСтрока.Физлицо = Начисления.Физлицо;
		мНоваяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
		мНоваяСтрока.Показатель1 = Начисления.Показатель1;
		мНоваяСтрока.Показатель2 = Начисления.Показатель2;
		мНоваяСтрока.Основное = Начисления.ОсновноеНачисление;
		мНоваяСтрока.ДатаНачала = НачалоМесяца(Начисления.Период);
		мНоваяСтрока.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
		мНоваяСтрока.ПодразделениеОрганизации = мНачисленияВыборка.ПодразделениеОрганизации;
		мНоваяСтрока.СпособРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой.СпособРасчета;
		мНоваяСтрока.ВидВремени = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой.ВидВремени;
		мНоваяСтрока.ГрафикРаботы = Начисления.ГрафикРаботы;
		мНоваяСтрока.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
		
		НезакрытыеСтроки.Добавить(мНоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ПериодДействияНачислений(ВидРасчета, Сотрудник, Организация, НачДата, КонДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ВидРасчета КАК ВидРасчета,
	|	ВложенныйЗапрос.НачДата КАК НачДата,
	|	ВложенныйЗапрос.КонДата КАК КонДата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
	|		ПлановыеНачисленияРаботниковОрганизаций.Период КАК НачДата,
	|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК КонДата
	|	ИЗ
	|		РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|	ГДЕ
	|		ПлановыеНачисленияРаботниковОрганизаций.Организация = &Организация
	|		И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|		И ПлановыеНачисленияРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата
	|		И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период < &НачДата
	|				ТОГДА &НачДата
	|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период
	|		КОНЕЦ,
	|		ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ИЗ
	|		РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|				&НачДата,
	|				ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
	|					И Организация = &Организация
	|					И Сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачДата";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	
	мРезультат = Запрос.Выполнить().Выгрузить();
	
	мКол = мРезультат.Количество()-1;
	Если мРезультат.Количество() = 1 Тогда
		мРезультат[0].НачДата = НачДата;
		мРезультат[0].КонДата = КонДата;
	Иначе
		Для Каждого мСтрока Из мРезультат Цикл
			Если мРезультат.Индекс(мСтрока) <> 0 Тогда
				Если мРезультат.Индекс(мСтрока) = мКол Тогда
					мРезультат[мРезультат.Индекс(мСтрока)-1].КонДата = мСтрока.НачДата-86400;
					мСтрока.КонДата = КонДата;
				Иначе
					мРезультат[мРезультат.Индекс(мСтрока)-1].КонДата = мСтрока.НачДата-86400;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для Каждого мСтрока Из мРезультат Цикл
		Если мСтрока.ВидРасчета <> ВидРасчета Тогда
			мРезультат.Удалить(мРезультат.Индекс(мСтрока));
		КонецЕсли;
	КонецЦикла;
	
	Возврат мРезультат;
	
КонецФункции

Функция ПроверкаНаДействиеВидаНачисления(ВидРасчета, Сотрудник, Организация, НачДата, КонДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|			&НачДата,
	|			Сотрудник = &Сотрудник
	|				И Организация = &Организация
	|				И ВидРасчетаИзмерение = &ВидРасчета) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	
	мРезультат = Запрос.Выполнить().Выбрать();
	
	Пока мРезультат.Следующий() Цикл
		Если мРезультат.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
			Если ЗначениеЗаполнено(мРезультат.ПериодЗавершения) Тогда
				Если КонДата < мРезультат.ПериодЗавершения Тогда
					Возврат Истина;
				КонецЕсли;
			Иначе
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСписокСотрудниковСПеремещением(НачалоПериодаЗаполнения, ОкончаниеПериодаЗаполнения, Организация, ПоВсемПодразделениямОрганизации = Истина, ПодразделениеОрганизации = Неопределено) Экспорт
	
	РасчетЗарплатыОрганизацииПоОтветственным = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "РасчетЗарплатыОрганизацииПоОтветственным");
	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	// готовим объект Запрос и 
	// определяем тексты условий ПоВсемПодразделениямОрганизации и УсловиеНаПодразделение.
	Запрос = Новый Запрос;
	
	Если ПоВсемПодразделениямОрганизации Тогда
		УсловиеНаПодразделение = "";
	Иначе
		УсловиеНаПодразделение = " И ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделение)";
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамНачало" , НачалоПериодаЗаполнения);
	Запрос.УстановитьПараметр("парамКонец" , КонецДня(ОкончаниеПериодаЗаполнения));
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);
	Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	
	ТекстЗапросаПоСпискуРаботников = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТСписокРаботников	
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		&парамНачало,
	|		Организация = &парамГоловнаяОрганизация
	|			) КАК РаботникиОрганизации
	|ГДЕ
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
	|	КОНЕЦ = &парамОрганизация
	|		И ВЫБОР
	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА "+ ?(УсловиеНаПодразделение = "", "", СтрЗаменить(УсловиеНаПодразделение,"И ПодразделениеОрганизации","И ПодразделениеОрганизацииЗавершения")) + "
	|			ИНАЧЕ ИСТИНА "+ УсловиеНаПодразделение + "
	|		КОНЕЦ	
	|	
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизации.Сотрудник,
	|	РаботникиОрганизации.Сотрудник.Физлицо
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|ГДЕ
	|	РаботникиОрганизации.Период > &парамНачало
	|		И РаботникиОрганизации.Период <= &парамКонец
	|		И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
	|       
	|		И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация " + УсловиеНаПодразделение + "
	|		
	|ОБЪЕДИНИТЬ 
	|		
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Работники.Сотрудник,
	|	Работники.Сотрудник.Физлицо
	|ИЗ 
	|   РегистрСведений.РаботникиОрганизаций КАК Работники
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|	ПО ПериодыПерекрытия.Период <= Работники.ПериодЗавершения
	|		И ПериодыПерекрытия.Период > Работники.Период
	|		И ПериодыПерекрытия.Сотрудник.Физлицо = Работники.Сотрудник.Физлицо
	|		И ПериодыПерекрытия.Организация = &парамГоловнаяОрганизация
	|ГДЕ  
	|	Работники.ПериодЗавершения<>ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|       
	|		И Работники.Организация = &парамГоловнаяОрганизация
	|		И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация" + СтрЗаменить(УсловиеНаПодразделение,"И ПодразделениеОрганизации","И Работники.ПодразделениеОрганизацииЗавершения") + "
	|		И Работники.ПериодЗавершения > &парамНачало
	|		И Работники.ПериодЗавершения <= &парамКонец 
	|		И ПериодыПерекрытия.Период ЕСТЬ NULL		
	|		
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|ИЗ
	|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|ГДЕ
	|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонец
	|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачало
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация" + УсловиеНаПодразделение +"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	
	
	Запрос.Текст = ТекстЗапросаПоСпискуРаботников;
	Запрос.Выполнить();
	ТекстЗапросаПоСпискуРаботников = "ВТСписокРаботников";
	
	//ТаблицаДвиженийРаботниковТекст
	//Описание:
	//	Выбирает список работников, отвечающих условиям отбора, числящихся на начало месяца и их движения за месяц.
	
	
	ТаблицаДвиженийРаботниковТекст = "
	|// срез работников на начало месяца
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&парамНачало КАК Период,
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ИСТИНА КАК Подходит,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизации.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизации.Должность
	|	КОНЕЦ КАК Должность
	//ПОМЕСТИТЬ ВТДвиженияРаботников
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамНачало, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ " + ТекстЗапросаПоСпискуРаботников + " КАК СписокРаботников)) КАК РаботникиОрганизации
	|ГДЕ 
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
	|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
	|	КОНЕЦ = &парамОрганизация 
	|	И ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
	|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ИСТИНА "+ ?(УсловиеНаПодразделение="","",СтрЗаменить(УсловиеНаПодразделение,"И ПодразделениеОрганизации","И ПодразделениеОрганизацииЗавершения")) + "
	|		ИНАЧЕ ИСТИНА "+ УсловиеНаПодразделение + "
	|	КОНЕЦ	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// движения работников за месяц
	|ВЫБРАТЬ
	|	РаботникиОрганизации.Период,
	|	РаботникиОрганизации.Сотрудник,
	|	ВЫБОР КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение) И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация" + УсловиеНаПодразделение +" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ,
	|	РаботникиОрганизации.ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность
	|ИЗ
	|	" + ТекстЗапросаПоСпискуРаботников + " КАК СписокРаботников
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|	ПО СписокРаботников.Сотрудник = РаботникиОрганизации.Сотрудник
	|
	|ГДЕ
	|	РаботникиОрганизации.Период > &парамНачало И
	|	РаботникиОрганизации.Период <= &парамКонец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ""возвратные"" движения работников за месяц
	|ВЫБРАТЬ 
	|	Работники.ПериодЗавершения  КАК Период,
	|	Работники.Сотрудник,
	|	ВЫБОР КОГДА Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение) И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация" + ?(УсловиеНаПодразделение="","",СтрЗаменить(УсловиеНаПодразделение,"И ПодразделениеОрганизации","И Работники.ПодразделениеОрганизацииЗавершения")) +" ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ,
	|	Работники.ПодразделениеОрганизацииЗавершения,
	|	Работники.ДолжностьЗавершения
	|ИЗ
	|	" + ТекстЗапросаПоСпискуРаботников + " КАК СписокРаботников
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|		ПО ПериодыПерекрытия.Период <= Работники.ПериодЗавершения
	|			И ПериодыПерекрытия.Период > Работники.Период
	|			И ПериодыПерекрытия.Сотрудник = Работники.Сотрудник
	|	ПО СписокРаботников.Сотрудник = Работники.Сотрудник
	|ГДЕ  
	|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|		И Работники.ПериодЗавершения > &парамНачало
	|		И Работники.ПериодЗавершения <= &парамКонец
	|		И ПериодыПерекрытия.Период ЕСТЬ NULL
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&парамНачало, 
	|	ДоговорникиОрганизаций.Ссылка,
	|	ИСТИНА,
	|	NULL,
	|	NULL
	|ИЗ
	|	" + ТекстЗапросаПоСпискуРаботников + " КАК СписокРаботников
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
	|	ПО СписокРаботников.Сотрудник = ДоговорникиОрганизаций.Ссылка
	|
	|ГДЕ
	|	ДоговорникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник, Период
	|";
	
	Запрос.Текст = ТаблицаДвиженийРаботниковТекст;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗСотрудники = Новый ТаблицаЗначений();
	ТЗСотрудники.Колонки.Добавить("Сотрудник");
	ТЗСотрудники.Колонки.Добавить("Физлицо");
	ТЗСотрудники.Колонки.Добавить("ДатаНачала", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТЗСотрудники.Колонки.Добавить("ДатаОкончания", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТЗСотрудники.Колонки.Добавить("ПодразделениеОрганизации");
	ТЗСотрудники.Колонки.Добавить("Должность");
	
	мСЗ = -1;
	мНС = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сотрудник <> мНС Тогда
			Если мСЗ >= 0 Тогда
				ТЗСотрудники[мСЗ].ДатаОкончания = ОкончаниеПериодаЗаполнения;
			КонецЕсли;
			ДобавитьЗапись(ТЗСотрудники, мСЗ, Выборка);
			ТЗСотрудники[мСЗ].ДатаНачала = Выборка.Период;
		Иначе
			Если НЕ Выборка.Подходит Тогда
				ТЗСотрудники[мСЗ].ДатаОкончания = Выборка.Период;
			Иначе
				ТЗСотрудники[мСЗ].ДатаОкончания = Выборка.Период;
				ДобавитьЗапись(ТЗСотрудники, мСЗ, Выборка);
				ТЗСотрудники[мСЗ].ДатаНачала = Выборка.Период;
			КонецЕсли;
		КонецЕсли;
		мНС = Выборка.Сотрудник;
	КонецЦикла;
	Попытка
		ТЗСотрудники[мСЗ].ДатаОкончания = ОкончаниеПериодаЗаполнения;
	Исключение
		
	КонецПопытки;
	
	Возврат ТЗСотрудники;
	
КонецФункции

Функция ПолучитьДанныеОСтавкеПервогоРазрядаСотрудника(Период, Сотрудник, Организация) Экспорт
	рЗапрос = Новый Запрос;
	рЗапрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер, 0) КАК Размер
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда = ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.ТарифнаяСтавка
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	рЗапрос.УстановитьПараметр("Период", Период);
	рЗапрос.УстановитьПараметр("Организация", Организация);
	рЗапрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = рЗапрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Размер;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Процедура ДобавитьЗапись(ТЗСотрудники, мСЗ, Выборка) 
	СтрокаТЗСотрудники = ТЗСотрудники.Добавить();
	СтрокаТЗСотрудники.Сотрудник = Выборка.Сотрудник;
	СтрокаТЗСотрудники.Физлицо = Выборка.Сотрудник.Физлицо;
	СтрокаТЗСотрудники.ПодразделениеОрганизации = Выборка.ПодразделениеОрганизации;
	СтрокаТЗСотрудники.Должность = Выборка.Должность;
	мСЗ = мСЗ + 1;
Конецпроцедуры

Функция ПолучитьВыработкуЗаДень(парамНачало, парамКонец, Сотрудник, Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ФактическаяВыработкаРаботниковОрганизаций.Выработка) КАК Выработка
	|ИЗ
	|	РегистрНакопления.ФактическаяВыработкаРаботниковОрганизаций КАК ФактическаяВыработкаРаботниковОрганизаций
	|ГДЕ
	|	ФактическаяВыработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	И ФактическаяВыработкаРаботниковОрганизаций.Организация = &Организация
	|	И ФактическаяВыработкаРаботниковОрганизаций.Период МЕЖДУ &парамНачало И &парамКонец";
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Организация", Организация);
	мРезультат = Запрос.Выполнить().Выгрузить();
	Если ЗначениеЗаполнено(мРезультат[0].Выработка) Тогда
		Возврат мРезультат[0].Выработка;
	КонецЕсли;
	Возврат 0;
	
КонецФункции

Функция ПолучитьНормуВремениПоГраффику(парамНачало, парамКонец, Сотрудник,УчитыватьСтавку = Ложь,ПроверятьУвольнение = Ложь, НормаИзГрафика = Ложь) Экспорт  //Аверсон 18.06.2020 КВВ СВФР-006120 (ПроверятьУвольнение) //Аверсон ЕАЕ 10.02.2021 СВФР-007115 (НормаИзГрафика)
	//Аверсон 18.06.2020 КВВ СВФР-006120 (
	Если ПроверятьУвольнение Тогда
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ 
		|УвольнениеРаботники.ДатаУвольнения
		|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники	
		|ГДЕ УвольнениеРаботники.Сотрудник = &Сотрудник И
		|УвольнениеРаботники.Ссылка.Проведен";
		З.УстановитьПараметр("Сотрудник",Сотрудник);
		РезЗ = З.Выполнить().Выбрать();
		Если РезЗ.Следующий() Тогда
			парамКонец = Мин(парамКонец,КонецДня(РезЗ.ДатаУвольнения));
		КонецЕсли;		
	КонецЕсли;
	//Аверсон 18.06.2020 КВВ СВФР-006120 )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК НормаЧасов,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма) КАК НормаДней
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
	|	И ГрафикиРаботыПоВидамВремени.План";
	
	//Аверсон ЕАЕ 10.02.2021 СВФР-007115
	Если НормаИзГрафика Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение)");
	КонецЕсли;
	//Аверсон
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	//мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
	//	Новый Структура("Организация, Сотрудник", Справочники.Организации.НайтиПоКоду("000000001"), Сотрудник));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	мРезультат = Запрос.Выполнить().Выгрузить();
	//Островская Татьяна 09.12.2013 
	если мРезультат[0].НормаЧасов = Null и  мРезультат[0].НормаДней = Null Тогда 
		мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
		Новый Структура("Организация, Сотрудник", Сотрудник.Организация, Сотрудник));
		Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
		мРезультат = Запрос.Выполнить().Выгрузить();
		если УчитыватьСтавку Тогда 
			Ставка = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),Новый Структура("Сотрудник",Сотрудник)).ЗанимаемыхСтавок;
			если ставка <> 1 Тогда 
				Для Каждого стрРезультат из мРезультат Цикл 
					если Ставка < 1 Тогда 
						стрРезультат.НормаЧасов = стрРезультат.НормаЧасов*Ставка; 
						стрРезультат.НормаДней = стрРезультат.НормаДней*Ставка; //Аверсон 02.07.2020 КВВ СВФР-006230
					Иначе
						стрРезультат.НормаЧасов = стрРезультат.НормаЧасов/Ставка;
						//стрРезультат.НормаДней = стрРезультат.НормаДней/Ставка; //О.Т. Аверсон 11.04.2017 №  497 только часы
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Островская Татьяна 09.12.2013
	Возврат мРезультат[0];
	
	
КонецФункции

//Аверсон ЕАЕ 13.10.2022 СВФР-009666
Функция ПолучитьНормуВремениПоГрафикуСУчетомИзмененияГрафика(парамНачало, парамКонец, Сотрудник,УчитыватьСтавку = Ложь,ПроверятьУвольнение = Ложь, НормаИзГрафика = Ложь, ВидУчетаВремени = Неопределено) Экспорт //Аверсон ЕАЕ 21.10.2025 СВФР-017027 (ВидУчетаВремени)
	Если ПроверятьУвольнение Тогда
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ 
		|УвольнениеРаботники.ДатаУвольнения
		|ИЗ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеРаботники	
		|ГДЕ УвольнениеРаботники.Сотрудник = &Сотрудник И
		|УвольнениеРаботники.Ссылка.Проведен";
		З.УстановитьПараметр("Сотрудник",Сотрудник);
		РезЗ = З.Выполнить().Выбрать();
		Если РезЗ.Следующий() Тогда
			парамКонец = Мин(парамКонец,КонецДня(РезЗ.ДатаУвольнения));
		КонецЕсли;		
	КонецЕсли;
	
	//Аверсон ЕАЕ 21.10.2025 СВФР-017027
	Если ВидУчетаВремени = Неопределено Тогда
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
	КонецЕсли;
	//Аверсон СВФР-017027 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|РОСрез.Сотрудник,
	|&парамНачало КАК Период,
	|РОСрез.ГрафикРаботы,
	|РОСрез.ЗанимаемыхСтавок КАК Ставка
	|ПОМЕСТИТЬ ВТРО
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамНачало, Сотрудник = &Сотрудник) КАК РОСрез
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|РО.Сотрудник,
	|РО.Период,
	|РО.ГрафикРаботы,
	|РО.ЗанимаемыхСтавок
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РО
	|ГДЕ РО.Сотрудник = &Сотрудник
	|И РО.Период МЕЖДУ &парамНачало И &парамКонец
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ВТРО.Сотрудник,
	|ВТРО.ГрафикРаботы,
	|ВТРО.Период КАК НачПериод,
	|ВТРО.Ставка,
	|МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТРОБольше.Период,СЕКУНДА,-1),&парамКонец)) КАК КонПериод
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ ВТРО
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТРО КАК ВТРОБольше
	|ПО ВТРО.Сотрудник = ВТРОБольше.Сотрудник
	|И ВТРО.Период < ВТРОБольше.Период
	|СГРУППИРОВАТЬ ПО
	|ВТРО.Сотрудник,
	|ВТРО.ГрафикРаботы,
	|ВТРО.Период,
	|ВТРО.Ставка
	|";
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Выполнить();
	
	//Пробуем по сотруднику
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ВТПериоды.Сотрудник,
	|СУММА(ВЫБОР
	|      КОГДА &УчитыватьСтавку И ВТПериоды.Ставка <> 0
	|      ТОГДА ВЫБОР
	|            КОГДА ВТПериоды.Ставка < 1 
	|            ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма * ВТПериоды.Ставка
	|            ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма / ВТПериоды.Ставка
	|            КОНЕЦ
	|      ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
	|      КОНЕЦ) КАК НормаЧасов,
	|СУММА(ВЫБОР
	|      КОГДА &УчитыватьСтавку И ВТПериоды.Ставка <> 0
	|      ТОГДА ВЫБОР
	|            КОГДА ВТПериоды.Ставка < 1
	|            ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма * ВТПериоды.Ставка
	|            ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
	|            КОНЕЦ
	|      ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
	|      КОНЕЦ) КАК НормаДней
	|ИЗ ВТПериоды
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ПО ВТПериоды.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ВТПериоды.НачПериод И ВТПериоды.КонПериод
	|И ГрафикиРаботыПоВидамВремени.План
	
	//Аверсон ЕАЕ 21.10.2025 СВФР-017027
	//|И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
	//Аверсон СВФР-017027
	
	|СГРУППИРОВАТЬ ПО
	|ВТПериоды.Сотрудник
	|";
	
	Если НормаИзГрафика Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("УчитыватьСтавку", УчитыватьСтавку);
	
	//Аверсон ЕАЕ 21.10.2025 СВФР-017027
	Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
	//Аверсон СВФР-017027
	
	мРезультат = Запрос.Выполнить().Выгрузить();
	если мРезультат[0].НормаЧасов = Null и  мРезультат[0].НормаДней = Null Тогда 
		
		//Пробуем по графику
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|ВТПериоды.Сотрудник,
		|СУММА(ВЫБОР
		|      КОГДА &УчитыватьСтавку И ВТПериоды.Ставка <> 0
		|      ТОГДА ВЫБОР
		|            КОГДА ВТПериоды.Ставка < 1 
		|            ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма * ВТПериоды.Ставка
		|            ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма / ВТПериоды.Ставка
		|            КОНЕЦ
		|      ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
		|      КОНЕЦ) КАК НормаЧасов,
		|СУММА(ВЫБОР
		|      КОГДА &УчитыватьСтавку И ВТПериоды.Ставка <> 0
		|      ТОГДА ВЫБОР
		|            КОГДА ВТПериоды.Ставка < 1
		|            ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма * ВТПериоды.Ставка
		|            ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
		|            КОНЕЦ
		|      ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
		|      КОНЕЦ) КАК НормаДней
		|ИЗ ВТПериоды
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ПО ВТПериоды.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ ВТПериоды.НачПериод И ВТПериоды.КонПериод
		|И ГрафикиРаботыПоВидамВремени.План
		
		//Аверсон ЕАЕ 21.10.2025 СВФР-017027
		//|И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
		|И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
		//Аверсон СВФР-017027
		
		|СГРУППИРОВАТЬ ПО
		|ВТПериоды.Сотрудник
		|";
		
		Если НормаИзГрафика Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма)", "СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение)");
		КонецЕсли;
		
		мРезультат = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	Возврат мРезультат[0];
КонецФункции
//Аверсон СВФР-009666

//Возврацает Базу за период(месяц) регистрации по виду расчета для физ лица
//используется в исполнительном листе
Функция ПолучитьБазу(ФизЛицо, НачПериод, ВидРасчета, КонПериод=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(НачПериод));
	Запрос.УстановитьПараметр("КонДата", ?(КонПериод=Неопределено, КонецМесяца(НачПериод), КонецМесяца(КонПериод)));
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Результат");
	
КонецФункции

//Возврацает Базу за период(месяц) по виду расчета для физ лица по документу (регистратор)
//используется в сдельном наряде
Функция ПолучитьБазуПоДокументу(ФизЛицо, ВидРасчета, Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
	|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Документ);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Результат");
	
КонецФункции

//Возврацает Базу за период(месяц) действия по виду расчета для физ лица
//используется в исполнительном листе
Функция ПолучитьБазуПоПериодуДействия(ФизЛицо, НачПериод, ВидРасчета, КонПериод=Неопределено,ВидВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
	|	ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней,
	|	ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &НачДата И &КонДата
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка) //Аверсон 16.09.2022 КВВ СВФР-009545
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней,
	|	ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачДата И &КонДата
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоСреднегоЗаработка) //Аверсон 16.09.2022 КВВ СВФР-009545
	|	И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = &ФизЛицо";
	
	Запрос.УстановитьПараметр("НачДата", НачПериод);
	Запрос.УстановитьПараметр("КонДата", ?(КонПериод=Неопределено, КонецМесяца(НачПериод), КонПериод));
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
	Если ВидВремени Тогда	
		Возврат Запрос.Выполнить().Выгрузить().Итог("Результат")/Запрос.Выполнить().Выгрузить().Итог("ОтработаноЧасов");
	иначе
		Возврат Запрос.Выполнить().Выгрузить().Итог("Результат")/Запрос.Выполнить().Выгрузить().Итог("ОтработаноДней");
	КонецЕсли;	
КонецФункции

//Возврацает данные о рабочем месте сотр
Функция ПолучитьДанныеОСотруднике(ТекПериод, Сотрудник, Тип=1,Организация = Неопределено) Экспорт
	рЗапрос = Новый Запрос;
	Если Тип = 0 Тогда
		рЗапрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПервых.Период,
		|	РаботникиОрганизацийСрезПервых.Должность,
		|	РаботникиОрганизацийСрезПервых.Организация,
		|	РаботникиОрганизацийСрезПервых.Регистратор,
		|	РаботникиОрганизацийСрезПервых.ТипРаботника
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПервых(&ТекПериод, (НЕ Временно)) КАК РаботникиОрганизацийСрезПервых
		|ГДЕ
		|	РаботникиОрганизацийСрезПервых.Сотрудник = &Сотрудник
		|	И РаботникиОрганизацийСрезПервых.Организация = &Организация";
	Иначе
		рЗапрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Период,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.Регистратор,
		|	РаботникиОрганизацийСрезПоследних.ТипРаботника
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ТекПериод, (НЕ Временно)) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	КонецЕсли;
	рЗапрос.УстановитьПараметр("ТекПериод", ТекПериод);
	Если Организация = Неопределено Тогда 
		Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда		
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Иначе
			Организация = Справочники.Организации.НайтиПоКоду("000000001");
		КонецЕсли;
	КонецЕсли;
	рЗапрос.УстановитьПараметр("Организация", Организация);
	рЗапрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Попытка
		Возврат рЗапрос.Выполнить().Выгрузить()[0];
	Исключение
		Возврат Null;
	КонецПопытки;
КонецФункции

//Возвращает ответ необходимо ли выделять контракт
Функция НеобходимоВыделятьКонтракт(Организация = Неопределено) Экспорт
	
	Ответ = Ложь;
	Если Организация = Неопределено Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
	Если УчетнаяПолитика <> Неопределено Тогда
		Если УчетнаяПолитика.ВыделятьКонтракт Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//заявка №1693 (база заявок Кристалла) Дмитрук О.Г.
//Печать расчетного листка
Функция ПечатьРасчетногоЛистка(Организация = Неопределено) Экспорт
	
	Ответ = Ложь;
	Если Организация = Неопределено Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
	Если УчетнаяПолитика <> Неопределено Тогда
		Если УчетнаяПолитика.ПечатьРасчетногоЛистка Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
//заявка №1693

//Возвращает список основных начислений
Функция СформироватьСписокОсновныхНачислений() Экспорт
	
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПрямойСдельныйЗаработок);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокВидов", СписокВидов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияОрганизаций.СпособРасчета В(&СписокВидов)
	|	И (НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления)
	
	//Аверсон ЕАЕ 10.02.2022 СВФР-008728
	|	И ОсновныеНачисленияОрганизаций.ИспользоватьВСпискеВыбора
	//Аверсон СВФР-008728
	
	|";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

//Возвращает список Контрактов
Функция СформироватьСписокНачисленийКонтракта() Экспорт
	
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиБезКонтракта);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСсылка", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияОрганизаций.СпособНачисленияКонтракта КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	(НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления)
	|	И ОсновныеНачисленияОрганизаций.СпособНачисленияКонтракта <> &ПустаяСсылка";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

//Возвращает список основных начислений для выбора в кадровых документах
Функция СформироватьСписокОсновныхНачисленийДляВыбора() Экспорт
	
	СписокВидов = Новый СписокЗначений;
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПрямойСдельныйЗаработок);
	СписокВидов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокВидов", СписокВидов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияОрганизаций.СпособРасчета В(&СписокВидов)
	|	И (НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления)
	|	И ОсновныеНачисленияОрганизаций.ИспользоватьВСпискеВыбора";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

//Возвращает список основных доступных видов времени
//из справочника лассификаторов видов времени для сдельного наряда
Функция СформироватьМассивДоступныхВидовВремениДляСделки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторИспользованияРабочегоВремени.Ссылка КАК ВидВремени
	|ИЗ
	|	Справочник.КлассификаторИспользованияРабочегоВремени КАК КлассификаторИспользованияРабочегоВремени
	|ГДЕ
	|	(НЕ КлассификаторИспользованияРабочегоВремени.ПометкаУдаления)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидВремени");
	
КонецФункции

//Возвращает список основных доступных видов времени для отображения в табелях
//из справочника классификаторов видов времени для сдельного наряда и обычного табеля
Функция СформироватьМассивДоступныхУсловныхОбозначенийВидовВремениДляТабелей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод,
	|	КлассификаторИспользованияРабочегоВремени.ПолноеНаименование КАК ПолноеНаименование,
	|	КлассификаторИспользованияРабочегоВремени.РабочееВремя
	|ИЗ
	|	Справочник.КлассификаторИспользованияРабочегоВремени КАК КлассификаторИспользованияРабочегоВремени
	|ГДЕ
	|	(НЕ КлассификаторИспользованияРабочегоВремени.ПометкаУдаления 
	|	И КлассификаторИспользованияРабочегоВремени.ОтображатьВТабелях = ИСТИНА)
	|УПОРЯДОЧИТЬ ПО
	|	КлассификаторИспользованияРабочегоВремени.РабочееВремя УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Возвращает список категорий Сотрудников                                       
//для сдельного наряда и обычного табеля
Функция СформироватьМассивДоступныхКатегорийСотрудника(НачалоМесяца, Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Категория.Ссылка КАК Категория
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = КатегорииОбъектов.Объект
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)
	
	|СГРУППИРОВАТЬ ПО
	|	КатегорииОбъектов.Категория.Ссылка
	
	|УПОРЯДОЧИТЬ ПО
	|	КатегорииОбъектов.Категория.Ссылка.Наименование Возр";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

//Возвращает ответ необходимо ли Учитывать отработанное время только по табелю
Функция НеобходимоУчитыватьОтработанноеВремяТолькоПоТабелю(Организация = Неопределено) Экспорт
	
	Ответ = Ложь;
	Если Организация = Неопределено Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
	Если УчетнаяПолитика <> Неопределено Тогда
		Если УчетнаяПолитика.ОтработанноеВремяТолькоПоТабелю Тогда
			Ответ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//Возвращает ответ даты изменения ЗП
Функция ОпределитьДатуИзмененияЗП(Организация = Неопределено) Экспорт
	
	Ответ = '19000101000000';
	Если Организация = Неопределено Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
	Если УчетнаяПолитика <> Неопределено Тогда
		Ответ = УчетнаяПолитика.ДатаИзмененияЗП;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//Возвращает коэффициент изменения ТС работника при повышении ТС по предприятию
Функция ПолучитьКоэффициентПриИзмененииЗП(ДатаИзмененияЗП, Организация, Сотрудник) Экспорт
	
	Коэффициент = 1;
	ТарифнаяСтавкаПослеПовышения = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ДатаИзмененияЗП, 
	Новый Структура("Сотрудник, Организация", Сотрудник, Организация)).Ставка;
	ТарифнаяСтавкаДоПовышения = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ДатаИзмененияЗП-86400, 
	Новый Структура("Сотрудник, Организация", Сотрудник, Организация)).Ставка;
	Если ЗначениеЗаполнено(ТарифнаяСтавкаДоПовышения) Тогда
		Коэффициент = ТарифнаяСтавкаПослеПовышения/ТарифнаяСтавкаДоПовышения;
		Если Коэффициент < 1 Тогда
			Коэффициент = 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

//Возвращает список основных начислений использующихся только для сдельной оплаты
Функция СформироватьСписокНачисленийСдельнойОплаты(Тип = "ОсновныеНачисленияОрганизаций") Экспорт
	
	СписокВидов = Новый СписокЗначений;
	
	Если Тип = "ОсновныеНачисленияОрганизаций" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	(НЕ ОсновныеНачисленияОрганизаций.ПометкаУдаления)
		|	И ОсновныеНачисленияОрганизаций.СпособИспользования = ЗНАЧЕНИЕ(Перечисление.СпособИспользованияВидаРасчета.ИспользуетсяВСдельныхНарядах)";
	ИначеЕсли Тип = "ДополнительныеНачисленияОрганизаций" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеНачисленияОрганизаций.Ссылка КАК ВидРасчета
		|ИЗ
		|	ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ДополнительныеНачисленияОрганизаций
		|ГДЕ
		|	(НЕ ДополнительныеНачисленияОрганизаций.ПометкаУдаления)
		|	И ДополнительныеНачисленияОрганизаций.СпособИспользования = ЗНАЧЕНИЕ(Перечисление.СпособИспользованияВидаРасчета.ИспользуетсяВСдельныхНарядах)";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокВидов.Добавить(Выборка.ВидРасчета);
	КонецЦикла;
	
	Возврат СписокВидов;
	
КонецФункции

// Функция возвращает график работы  сотрудника, на указанную дату, 
// если сотрудник еще не работал на указанную дату, тогда возвращается ближайший график (срез первых)
Функция ПолучитьГрафикСотрудникаНаДату(Сотрудник, ДатаПолученияГрафика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Месяц", ДатаПолученияГрафика);
	Запрос.Текст = "ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Месяц, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПервых.ГрафикРаботы
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПервых(&Месяц, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПервых
	|ГДЕ
	|	РаботникиОрганизацийСрезПервых.ГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ГрафикРаботы;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // ПолучитьГрафикСотрудникаНаДату(Сотрудник, ДатаПолученияГрафика()

// Функция возвращает график работы  сотрудника, на указанную дату, 
// если сотрудник еще не работал на указанную дату, тогда возвращается ближайший график (срез первых)
Функция ПолучитьПодразделениеСотрудникаНаДату(Сотрудник, ДатаПолученияГрафика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Месяц", ДатаПолученияГрафика);
	Запрос.Текст = "ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Месяц, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПодразделениеОрганизации;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // ПолучитьГрафикСотрудникаНаДату(Сотрудник, ДатаПолученияГрафика()

// функция возвращает процент от стажа
Функция ПолучитьПроцентОтСтажаПоСотруднику(Сотрудник, ВидРасчета, ДатаСравнения,Организация,Отчет = Ложь) Экспорт //Островская Татьяна 24.07.2013 № 16643
	мПроцент = 0;
	//О.Т. Аверсон 07.02.2016 № 866
	Если не Отчет Тогда 
		если Организация.РасчетСтажаНаНачалоМесяца Тогда 
			ДатаСравнения = НачалоМесяца(ДатаСравнения);
			
			//СВЭЙ 22.02.2024 КВВ СВФР-012384 (
			Если Организация.РасчетСтажаОтДатыПриема Тогда   
				Д_Ок = ПолучитьОкончаниеОтпускПоУходуЗаРебенкомБезОплаты(Сотрудник,ДатаСравнения); 
				Если ЗначениеЗаполнено(Д_Ок) Тогда
					ДатаСравнения = Д_Ок;	
				КонецЕсли;
			КонецЕсли;
			//СВЭЙ 22.02.2024 КВВ СВФР-012384 )
			
		ИначеЕсли Организация.РасчетСтажаНаКонецМесяца Тогда 
			ДатаСравнения = КонецМесяца(ДатаСравнения);
		КонецЕсли;  
	КонецЕсли;
	//О.Т. Аверсон 07.02.2016 № 866
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник.ФизЛицо);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидСтажа", ВидРасчета.ВидСтажа);
	Запрос.УстановитьПараметр("ДатаСравнения", ДатаСравнения);
	//Наркевич 27.03.2014 №
		если (Организация.РасчетСтажаОтДатыПриема и Организация.ВидРасчета = ВидРасчета) или (Организация.ИНН = "100194961") Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		
		//Аверсон 25.01.2023 КВВ СВФР-010220 (
		//|	РАЗНОСТЬДАТ(ТаблицаПриема.Период, &ДатаСравнения, МЕСЯЦ) + ВЫБОР
		//|		КОГДА МЕСЯЦ(&ДатаСравнения) = МЕСЯЦ(ТаблицаПриема.Период)
		//|			ТОГДА (ДЕНЬ(&ДатаСравнения) - ДЕНЬ(ТаблицаПриема.Период)) / 30
		//|		ИНАЧЕ 0
		//|	КОНЕЦ + ЕСТЬNULL(ФизическиеЛицаСтажи.РазмерМесяцев, 0)+ (ЕСТЬNULL(ФизическиеЛицаСтажи.РазмерДней, 0)/30) КАК СтажМесяцев
		
		//Аверсон 18.02.2023 КВВ СВФР-010261 (
		
		//Аверсон 10.03.2023 КВВ СВФР-010496 (
		//|РАЗНОСТЬДАТ(ТаблицаПриема.Период, &ДатаСравнения, МЕСЯЦ) 
		|ВЫБОР КОГДА ЕСТЬNULL(ФизическиеЛицаСтажи.ДатаОтсчета,0) = 0
		|ТОГДА РАЗНОСТЬДАТ(ТаблицаПриема.Период, &ДатаСравнения, МЕСЯЦ)
		|ИНАЧЕ 0
		|КОНЕЦ
		//Аверсон 10.03.2023 КВВ СВФР-010496 )
		
		| + 
		|	ВЫБОР
		|		КОГДА МЕСЯЦ(&ДатаСравнения) = МЕСЯЦ(ТаблицаПриема.Период)
		|			ТОГДА (ДЕНЬ(&ДатаСравнения) - ДЕНЬ(ТаблицаПриема.Период)) / 30
		|		ИНАЧЕ 0
		|	КОНЕЦ
		| +
		|ВЫБОР КОГДА ЕСТЬNULL(ФизическиеЛицаСтажи.ДатаОтсчета,0) = 0 
		|ТОГДА 0
		|ИНАЧЕ
		//Аверсон 18.02.2023 КВВ СВФР-010261 )

		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней), &ДатаСравнения, МЕСЯЦ) + ВЫБОР
		|		КОГДА МЕСЯЦ(&ДатаСравнения) = МЕСЯЦ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней))
		|			ТОГДА (ДЕНЬ(&ДатаСравнения) - ДЕНЬ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней))) / 30
		|		ИНАЧЕ 0
		|	КОНЕЦ 
		|	КОНЕЦ  //Аверсон 18.02.2023 КВВ СВФР-010261
		|КАК СтажМесяцев
		//Аверсон 25.01.2023 КВВ СВФР-010220 )
		
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|		И РаботникиОрганизаций.Сотрудник = &Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РаботникиОрганизаций.Сотрудник) КАК ТаблицаПриема
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
		|		ПО ТаблицаПриема.Сотрудник.Физлицо = ФизическиеЛицаСтажи.Ссылка
		//+ СВЭЙ КДЯ 14.11.19 СВФР-005042
		|			И ФизическиеЛицаСтажи.ВидСтажа = &ВидСтажа
		//+ СВЭЙ КДЯ 14.11.19 СВФР-005042
		|";
	иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней), &ДатаСравнения, МЕСЯЦ) + ВЫБОР
		|		КОГДА МЕСЯЦ(&ДатаСравнения) = МЕСЯЦ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней))
		|			ТОГДА (ДЕНЬ(&ДатаСравнения) - ДЕНЬ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФизическиеЛицаСтажи.ДатаОтсчета, МЕСЯЦ, -ФизическиеЛицаСтажи.РазмерМесяцев), ДЕНЬ, -ФизическиеЛицаСтажи.РазмерДней))) / 30
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтажМесяцев
		|ИЗ
		|	Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
		|ГДЕ
		|	ФизическиеЛицаСтажи.Ссылка = &ФизЛицо
		|	И ФизическиеЛицаСтажи.ВидСтажа = &ВидСтажа
		|";
	КонецЕсли;
	
	//Наркевич 27.03.2014 №
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		мВСтаж = РегистрыСведений.ШкалаКоэффициентовСтажа.Выбрать(Новый Структура("КоэффициентСтажа", ВидРасчета.КоэффициентСтажа));
		Пока мВСтаж.Следующий() Цикл
			//Островская Татьяна 24.07.2013 № 16643
			если Организация.ШкалаДляВыслугиЗаполняетсяВГодах Тогда 
				Месяцы = 12;
			иначе
				Месяцы = 1;
			КонецЕсли;
			Если (Результат.СтажМесяцев >= (мВСтаж.СтажС*Месяцы)) И (Результат.СтажМесяцев < (мВСтаж.СтажПо*Месяцы)) Тогда //Островская Татьяна 24.07.2013 № 16643
				мПроцент = мВСтаж.Величина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//	СВФР-015796  16.05.2025
	Если Организация.Инн = "101542412" Тогда 
		МСДО = РегистрыСведений.МолодыеСпециалисты.Получить(Новый Структура("ФизЛицо", Сотрудник.ФизЛицо)).МолодойСпециалистДоДаты;  
		Если значениеЗаполнено(МСДО) и Результат.СтажМесяцев <=12 тогда
			мВСтаж = РегистрыСведений.ШкалаКоэффициентовСтажа.Выбрать(Новый Структура("КоэффициентСтажа", ВидРасчета.КоэффициентСтажа));
			Пока мВСтаж.Следующий() Цикл
				если Организация.ШкалаДляВыслугиЗаполняетсяВГодах Тогда 
					Месяцы = 12;
				иначе
					Месяцы = 1;
				КонецЕсли;
				Если (13 >= (мВСтаж.СтажС*Месяцы)) И (13 < (мВСтаж.СтажПо*Месяцы)) Тогда //Островская Татьяна 24.07.2013 № 16643
					мПроцент = мВСтаж.Величина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	// СВФР-015796 16.05.2025
	//О.Т. Аверсон 05.04.2016 № 1027
	Если Организация.ИНН = "100074549" Тогда 
		//О.Т. Аверсон 07.02.2016 № 866
		Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаСравнения,Новый Структура("Сотрудник",Сотрудник)).Должность;
		Если мПроцент = 2 и не Должность.КатегорияСтатистическогоУчета = Перечисления.КатегорииДолжностейДляСтатистическогоУчета.Рабочие Тогда
			мПроцент = 0;
		КонецЕсли;
		
		
		Если Сотрудник.ТипРаботника = Перечисления.ТипыРаботников.Временный или Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда 
			мПроцент = 0;
		КонецЕсли;
		
		ЗапросЧасы = Новый Запрос;
		ЗапросЧасы.Текст =
		"ВЫБРАТЬ
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
		|ИЗ
		|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
		|	И РабочееВремяРаботниковОрганизаций.Период >= &Период
		|	И РабочееВремяРаботниковОрганизаций.Период <= &Период2
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		ЗапросЧасы.УстановитьПараметр("Сотрудник",Сотрудник);
		ЗапросЧасы.УстановитьПараметр("Период", НачалоМесяца(ДатаСравнения));//Островская Татьяна 23.04.2014 № 17292
		ЗапросЧасы.УстановитьПараметр("Период2", КонецМесяца(ДатаСравнения));
		ЗапросЧасы.УстановитьПараметр("ВидИспользованияРабочегоВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы);
		УчетнаяПолитикаЗапрос = Новый Запрос; //О.Т. 23.12.2014 № 
		УчетнаяПолитикаЗапрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
		УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
		если УчетнаяПолитика.Количество()>0 Тогда 
			ЗапросЧасы.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
		иначе
			ЗапросЧасы.УстановитьПараметр("ФлагПоТабелю",Ложь);
		КонецЕсли;
		
		ВыборкаЧасы = ЗапросЧасы.Выполнить().Выбрать();
		ЧасыПрогулы = 0;
		пока ВыборкаЧасы.Следующий() Цикл 
			ЧасыПрогулы = ВыборкаЧасы.Часов;		
		КонецЦикла;
		Если ЗначениеЗаполнено(ЧасыПрогулы) Тогда 
			мПроцент = 0;
		КонецЕсли;
	КонецЕсли;
	//О.Т. Аверсон 05.04.2016 № 1027
	
	
	
	
	
	//О.Т. Аверсон 07.02.2016 № 866
	
	//НайденнаяСтрока = Сотрудник.Физлицо.Стажи.Найти(ВидРасчета.ВидСтажа, "ВидСтажа");
	//Если НЕ (НайденнаяСтрока = Неопределено) Тогда
	//	мВСтаж = РегистрыСведений.ШкалаКоэффициентовСтажа.Выбрать(Новый Структура("КоэффициентСтажа", ВидРасчета.КоэффициентСтажа));
	//	Пока мВСтаж.Следующий() Цикл
	//		мНачДата = ДобавитьМесяц(НайденнаяСтрока.ДатаОтсчета, мВСтаж.СтажС*12);
	//		мКонДата = ДобавитьМесяц(НайденнаяСтрока.ДатаОтсчета, мВСтаж.СтажПо*12);
	//		Если (ДатаСравнения >= мНачДата) И (ДатаСравнения < мКонДата) Тогда
	//			мПроцент = мВСтаж.Величина;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	Возврат мПроцент;
КонецФункции

// функция возвращает расчитанную сумму по ИЛ
Функция ПолучитьСуммуПоИсполнительномуЛисту(СтрокаДвижений, мСуммаКНачислению, мСуммаЗП, мСуммаКНачислениюПоПериодуДействия=0) Экспорт
	
	мСуммаКНачислению = ОбщегоНазначения.ОкруглитьПоВалюте(мСуммаКНачислению, Константы.ВалютаРегламентированногоУчета.Получить());
	Размер = мСуммаКНачислению;
	мЗадолженность = 0;
	УжеНачисленоВТекущемПериоде = 0;
	СтрокаДвижений.Показатель2 = 0;
	СтрокаДвижений.Показатель3 = 0;
	мСуммаКНачислениюЧистая = мСуммаКНачислению;
	
	Если ЗначениеЗаполнено(СтрокаДвижений.ДокументОснование) Тогда
		//определяем задолженность
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", СтрокаДвижений.БазовыйПериодНачало);
		Запрос.УстановитьПараметр("ФизЛицо", СтрокаДвижений.ФизЛицо);
		Запрос.УстановитьПараметр("ИсполнительныйЛист", СтрокаДвижений.ДокументОснование);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадолженностьПоИсполнительнымЛистамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЗадолженностьПоИсполнительнымЛистам.Остатки(&Период, ИсполнительныйЛист = &ИсполнительныйЛист) КАК ЗадолженностьПоИсполнительнымЛистамОстатки";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			мЗадолженность = ?(ЗначениеЗаполнено(Результат.СуммаОстаток), Результат.СуммаОстаток, 0);
		КонецЕсли;
		СтрокаДвижений.Показатель3 = мЗадолженность;
		
		//недобор
		//определим есль ли переходящие
		Запрос.УстановитьПараметр("Период", НачалоМесяца(СтрокаДвижений.БазовыйПериодНачало));
		Запрос.УстановитьПараметр("ВидРасчета", СтрокаДвижений.ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия >= ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, 1)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &Период";
		
		мБПМ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(СтрокаДвижений.БазовыйПериодНачало, Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.БПМ)).Размер;
		Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
			Если мСуммаКНачислению < мБПМ*(СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100) Тогда
				Если мСуммаКНачислениюПоПериодуДействия < мБПМ*(СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100) Тогда
					Если мСуммаКНачислениюЧистая < мСуммаКНачислениюПоПериодуДействия Тогда
						Размер = ОбщегоНазначения.ОкруглитьПоВалюте(мБПМ*СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100-(мСуммаКНачислениюПоПериодуДействия-мСуммаКНачислению), Константы.ВалютаРегламентированногоУчета.Получить());
					Иначе
						Размер = ОбщегоНазначения.ОкруглитьПоВалюте(мБПМ*СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100, Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если мСуммаКНачислениюПоПериодуДействия < мБПМ*(СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100) Тогда
				//текущий
				Размер = ОбщегоНазначения.ОкруглитьПоВалюте(мБПМ*СтрокаДвижений.ДокументОснование.ПроцентПрожиточногоМинимума/100, Константы.ВалютаРегламентированногоУчета.Получить());
				//будущий
				Размер = Размер + (мСуммаКНачислению-мСуммаКНачислениюПоПериодуДействия);
			КонецЕсли;
		КонецЕсли;
		//долг
		мСуммаКНачислению = мСуммаКНачислению + мЗадолженность;
		Размер = Размер + мЗадолженность;
		
		//перебор с учетом начисленных
		Запрос.УстановитьПараметр("Период", СтрокаДвижений.ПериодРегистрации);
		Запрос.УстановитьПараметр("Регистратор", СтрокаДвижений.Регистратор);
		Запрос.УстановитьПараметр("НомерСтроки", СтрокаДвижений.НомерСтроки);
		ВидыРасчетаПоИЛ = Новый СписокЗначений;
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентом);
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомБезБЛ);
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомДоПредела);
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомДоПределаБезБЛ);
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммой);
		ВидыРасчетаПоИЛ.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммойДоПредела);
		Запрос.УстановитьПараметр("ВидРасчета", ВидыРасчетаПоИЛ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(УдержанияРаботниковОрганизаций.Результат) КАК Сумма
		|ИЗ
		|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
		|ГДЕ
		|	УдержанияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И УдержанияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
		|	И (НЕ(УдержанияРаботниковОрганизаций.Регистратор = &Регистратор
		|				И УдержанияРаботниковОрганизаций.НомерСтроки = &НомерСтроки))";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			УжеНачисленоВТекущемПериоде = ?(ЗначениеЗаполнено(Результат.Сумма), Результат.Сумма, 0);
		КонецЕсли;
		
		мПроцентЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(СтрокаДвижений.БазовыйПериодНачало, Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МаксимальныйПроцентУдержаний)).Размер;
		Если (Размер+УжеНачисленоВТекущемПериоде) > мСуммаЗП*мПроцентЗП/100 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Сумма удержания по документу "+Строка(СтрокаДвижений.ДокументОснование)+" превышает максимально допустимую на "+Строка((Размер+УжеНачисленоВТекущемПериоде) - мСуммаЗП*мПроцентЗП/100));
			СтрокаДвижений.Показатель2 = ОбщегоНазначения.ОкруглитьПоВалюте((Размер+УжеНачисленоВТекущемПериоде) - мСуммаЗП*мПроцентЗП/100, Константы.ВалютаРегламентированногоУчета.Получить());
			Размер = ОбщегоНазначения.ОкруглитьПоВалюте(Макс(мСуммаЗП*мПроцентЗП/100-УжеНачисленоВТекущемПериоде, 0), Константы.ВалютаРегламентированногоУчета.Получить());
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Не определен документ!");
	КонецЕсли;
	Возврат Размер;
	
КонецФункции

//Возврацает Базу подоходного за период(месяц) по физ-лицу
//используется в исполнительном листе
Функция ПолучитьБазуПодоходногоДляИЛ(ФизЛицо, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(НДФЛРасчетыСБюджетом.Налог) КАК Налог
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.ФизЛицо = &ФизЛицо
	|	И НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Налог");
	
КонецФункции

//Возвращает путь к файлам банка
Функция ОпределитьПутьКФайламБанка(Организация = Неопределено) Экспорт
	
	Ответ = "C:\";  //ответ по умолчанию
	Если Организация = Неопределено Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
	Если ЗначениеЗаполнено(УчетнаяПолитика) Тогда
		Ответ = СокрЛП(УчетнаяПолитика.ПутьКФайламБанк);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

//заявка №1980 (база заявко Кристалла) Дмитрук О.Г.
Функция ПолучитьПериодДействияПлановогоНачисленияПоРаботнику(Сотрудник, СпособРасчета, НачальнаяДата, ДокументСсылка, ДатаНачалаСобытия, ДатаОкончанияСобытия) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	НачалоПериода.Сотрудник,
	|	НачалоПериода.ВидРасчета,
	|	НачалоПериода.ПериодДействияНачало,
	|	ЕСТЬNULL(КонецПериода.ПериодДействияКонец, &ДатаОкончанияСобытия) КАК ПериодДействияКонец
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПервых.Сотрудник КАК Сотрудник,
	|		СрезПервых.Период КАК ПериодДействияНачало,
	|		СрезПервых.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник КАК Сотрудник,
	|			ПлановыеНачисления.Период КАК Период,
	|			ПлановыеНачисления.ВидРасчета КАК ВидРасчета,
	|			ПлановыеНачисления.ПериодЗавершения КАК ПериодЗавершения,
	|			ПлановыеНачисления.ВидРасчетаЗавершения КАК ВидРасчетаЗавершения
	|		ИЗ
	|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПервых(
	|					&ДатаНачалаСобытия,
	|					Сотрудник В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СдельныйНарядИсполнители.Сотрудник
	|						ИЗ
	|							Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|						ГДЕ
	|							СдельныйНарядИсполнители.Ссылка = &ДокументСсылка)) КАК ПлановыеНачисления
	|		ГДЕ
	|			ПлановыеНачисления.ВидРасчета.СпособРасчета = &СпособРасчета
	|			И ПлановыеНачисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|			И ПлановыеНачисления.Сотрудник = &Сотрудник) КАК СрезПервых
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ПлановыеНачисления.Сотрудник КАК Сотрудник
	|			ИЗ
	|				РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|						&ДатаНачалаСобытия,
	|						Сотрудник В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								СдельныйНарядИсполнители.Сотрудник
	|							ИЗ
	|								Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|							ГДЕ
	|								СдельныйНарядИсполнители.Ссылка = &ДокументСсылка)) КАК ПлановыеНачисления
	|			ГДЕ
	|				ПлановыеНачисления.ВидРасчета.СпособРасчета = &СпособРасчета
	|				И ПлановыеНачисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|				И ПлановыеНачисления.Сотрудник = &Сотрудник) КАК СрезПоследних
	|			ПО СрезПервых.Сотрудник = СрезПоследних.Сотрудник
	|	ГДЕ
	|		СрезПоследних.Сотрудник ЕСТЬ NULL 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПлановыеНачисления.Сотрудник,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисления.Период >= &ДатаНачалаСобытия
	|				ТОГДА ПлановыеНачисления.Период
	|			ИНАЧЕ &ДатаНачалаСобытия
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисления.ПериодЗавершения <> &НачальнаяДата
	|					И ПлановыеНачисления.ПериодЗавершения < &ДатаОкончанияСобытия
	|				ТОГДА ПлановыеНачисления.ВидРасчетаЗавершения
	|			ИНАЧЕ ПлановыеНачисления.ВидРасчета
	|		КОНЕЦ
	|	ИЗ
	|		РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|				&ДатаНачалаСобытия,
	|				Сотрудник В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СдельныйНарядИсполнители.Сотрудник
	|					ИЗ
	|						Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|					ГДЕ
	|						СдельныйНарядИсполнители.Ссылка = &ДокументСсылка)) КАК ПлановыеНачисления
	|	ГДЕ
	|		ПлановыеНачисления.ВидРасчета.СпособРасчета = &СпособРасчета
	|		И ПлановыеНачисления.Сотрудник = &Сотрудник) КАК НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник КАК Сотрудник,
	|			ПлановыеНачисления.Период КАК ПериодДействияКонец
	|		ИЗ
	|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|					&ДатаОкончанияСобытия,
	|					Сотрудник В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							СдельныйНарядИсполнители.Сотрудник
	|						ИЗ
	|							Документ.СдельныйНаряд.Исполнители КАК СдельныйНарядИсполнители
	|						ГДЕ
	|							СдельныйНарядИсполнители.Ссылка = &ДокументСсылка)) КАК ПлановыеНачисления
	|		ГДЕ
	|			ПлановыеНачисления.ВидРасчета.СпособРасчета = &СпособРасчета
	|			И ПлановыеНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|			И ПлановыеНачисления.Сотрудник = &Сотрудник) КАК КонецПериода
	|		ПО НачалоПериода.Сотрудник = КонецПериода.Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("СпособРасчета",СпособРасчета);
	Запрос.УстановитьПараметр("НачальнаяДата",НачальнаяДата);
	Запрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("ДатаОкончанияСобытия",ДатаОкончанияСобытия);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
//заявка №1980

#Если Клиент Тогда
	
	// функщия записи изменений в документ породивший запись
	Процедура СинхронизацияДокумента(мДокумент, мСтрока) Экспорт
		Если мДокумент.Метаданные().Имя = "ПриемНаРаботуВОрганизацию" И мДокумент.Проведен Тогда
			НайденнаяСтрока = мДокумент.РаботникиОрганизации.Найти(мСтрока.Сотрудник.Ссылка, "Сотрудник");
			Если НайденнаяСтрока = Неопределено Тогда
				Предупреждение("не найден!");
			Иначе
				НайденнаяСтрока.ПодразделениеОрганизации = мСтрока.ПодразделениеОрганизации;
				НайденнаяСтрока.Должность = мСтрока.Должность;
				НайденнаяСтрока.ЗанимаемыхСтавок = мСтрока.КоличествоСтавок;
				НайденнаяСтрока.РазрядЕТС = мСтрока.РазрядЕТС;
				НайденнаяСтрока.КоэффициентЕТС = мСтрока.КоэффициентЕТС;
				НайденнаяСтрока.ПроцентПоКонтракту = мСтрока.ПроцентПоКонтракту;
				НайденнаяСтрока.ГрафикРаботы = мСтрока.ГрафикРаботы;
				НайденнаяСтрока.Категория = мСтрока.Должность.Категория;
				
				СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата));
				Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
					Строка = СтрокиОсновныхНачислений[0];	
				Иначе
					СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой));
					Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
						Строка = СтрокиОсновныхНачислений[0];	
					Иначе
						СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам));
						Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
							Строка = СтрокиОсновныхНачислений[0];	
						Иначе
							Строка = мДокумент.ОсновныеНачисления.Добавить();
							Строка.Сотрудник = мСтрока.Сотрудник; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если мСтрока.ПризнакСдельщика Тогда
					Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата;
					НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата;
					НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
					Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавкаЧасовая;
					Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
				Иначе
					Если мСтрока.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.Часовая Тогда
						Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
						НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
						НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавкаЧасовая;
						Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
					КонецЕсли;
					Если мСтрока.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.Месячная Тогда
						Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
						НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
						НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			мДокумент.Записать(РежимЗаписиДокумента.Проведение);
		ИначеЕсли мДокумент.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" И мДокумент.Проведен Тогда
			НайденнаяСтрока = мДокумент.РаботникиОрганизации.Найти(мСтрока.Сотрудник.Ссылка, "Сотрудник");
			Если НайденнаяСтрока = Неопределено Тогда
				Предупреждение("не найден!");
			Иначе
				НайденнаяСтрока.ПодразделениеОрганизации = мСтрока.ПодразделениеОрганизации;
				НайденнаяСтрока.Должность = мСтрока.Должность;
				НайденнаяСтрока.ЗанимаемыхСтавок = мСтрока.КоличествоСтавок;
				НайденнаяСтрока.РазрядЕТС = мСтрока.РазрядЕТС;
				НайденнаяСтрока.КоэффициентЕТС = мСтрока.КоэффициентЕТС;
				НайденнаяСтрока.ПроцентПоКонтракту = мСтрока.ПроцентПоКонтракту;
				НайденнаяСтрока.ГрафикРаботы = мСтрока.ГрафикРаботы;
				НайденнаяСтрока.Категория = мСтрока.Должность.Категория;
				
				СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата));
				Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
					Строка = СтрокиОсновныхНачислений[0];	
				Иначе
					СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой));
					Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
						Строка = СтрокиОсновныхНачислений[0];	
					Иначе
						СтрокиОсновныхНачислений = мДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", мСтрока.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам));
						Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
							Строка = СтрокиОсновныхНачислений[0];	
						Иначе
							Строка = мДокумент.ОсновныеНачисления.Добавить();
							Строка.Сотрудник = мСтрока.Сотрудник; 
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если мСтрока.ПризнакСдельщика Тогда
					Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата;
					НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата;
					НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
					Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавкаЧасовая;
					Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
					мТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(мДокумент.Дата-86400,
					Новый Структура("Организация,Сотрудник", мДокумент.Организация,мСтрока.Сотрудник));
					Если мСтрока.РасчетнаяТарифнаяСтавкаЧасовая <> мТарифнаяСтавка.Ставка Тогда
						Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
					Иначе
						Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
					КонецЕсли;
				Иначе
					Если мСтрока.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.Часовая Тогда
						Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
						НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
						НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавкаЧасовая;
						Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
						мТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(мДокумент.Дата-86400,
						Новый Структура("Организация,Сотрудник", мДокумент.Организация,мСтрока.Сотрудник));
						Если мСтрока.РасчетнаяТарифнаяСтавкаЧасовая <> мТарифнаяСтавка.Ставка Тогда
							Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
						Иначе
							Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
						КонецЕсли;
					КонецЕсли;
					Если мСтрока.ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.Месячная Тогда
						Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
						НайденнаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
						НайденнаяСтрока.МесячнаяТарифнаяСтавка = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель1 = мСтрока.РасчетнаяТарифнаяСтавка;
						Строка.Показатель2 = мСтрока.ПроцентПоКонтракту;
						мТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(мДокумент.Дата-86400,
						Новый Структура("Организация,Сотрудник", мДокумент.Организация,мСтрока.Сотрудник));
						Если мСтрока.РасчетнаяТарифнаяСтавка <> мТарифнаяСтавка.Ставка Тогда
							Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
						Иначе
							Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			мДокумент.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецПроцедуры
	
	// определение совобной вакансии
	Функция ВыбратьСвободнуюВакансию() Экспорт
		мЗапрос = Новый Запрос;
		мЗапрос.Текст =
		"ВЫБРАТЬ
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПодразделениеОрганизации,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.Должность,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.РазрядЕТС,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.КоличествоСтавок,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ВидТарифнойСтавки,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ГрафикРаботы,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ВалютаТарифнойСтавки,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ОсобыеУсловияТруда,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.КоэффициентЕТС,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПроцентПоКонтракту,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ТарифнаяСтавка,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.РасчетнаяТарифнаяСтавка,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.Коэффициент,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПризнакУченика,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.КоэффТехнологический,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПроцентПовышения,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПроцентПрочий,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПроцентКатегория,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.ПризнакСдельщика,
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.РасчетнаяТарифнаяСтавкаЧасовая
		|ИЗ
		|	РегистрСведений.ШтатноеРасписаниеОрганизацийФакт.СрезПоследних КАК ШтатноеРасписаниеОрганизацийФактСрезПоследних
		|ГДЕ
		|	ШтатноеРасписаниеОрганизацийФактСрезПоследних.Сотрудник = &Сотрудник";
		мЗапрос.УстановитьПараметр("Сотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
		мТЗ = мЗапрос.Выполнить().Выгрузить();
		Если мТЗ.Количество() = 0 Тогда
			Предупреждение("Свободных вакансий нет"+Символы.ПС+"Уточните в ООТиЗе");
			Возврат Неопределено;
		Иначе
			Возврат мТЗ.ВыбратьСтроку();
		КонецЕсли;
	КонецФункции
	
	//Дополнительные проводки !!!!!!!!!!!!!
	Процедура Распределение97счета(Док, ТочностьРасчетов = 2) Экспорт  //Аверсон ЕАЕ 16.06.2020 СВФР-006057 (добавлен реквизит ТочностьРасчетов)
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Резервы.Наименование,
		|	Резервы.Ссылка
		|ИЗ
		|	Справочник.Резервы КАК Резервы";
		
		РезультатЗапросаРезурв = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапросаРезурв.Следующий() Цикл
			Если Найти(РезультатЗапросаРезурв.Наименование,"БГС")> 0 Тогда 
				СубконтоРезервБГС = РезультатЗапросаРезурв.Ссылка;
			ИначеЕсли Найти(РезультатЗапросаРезурв.Наименование,"ФСЗН")> 0 Тогда 
				СубконтоРезервФСЗН = РезультатЗапросаРезурв.Ссылка;
			КонецЕсли;			
		КонецЦикла;

		//ФСЗН
		зПрибыль = Новый Запрос;
		зПрибыль.УстановитьПараметр("НачДата", НачалоМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("КонДата", КонецМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("СпособРаспределенияПрибыли", Перечисления.СпособыРаспределенияПрибыли.СчетПрибыли);
		//СчетФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации,
		//Новый Структура("ВидОтчисления", Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН)).СчетБУ;
		//зПрибыль.УстановитьПараметр("СчетКт", СчетФСЗН);
		
		зПрибыль.УстановитьПараметр("НачДата", НачалоМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("КонДата", КонецМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("СпособРаспределенияПрибыли", Перечисления.СпособыРаспределенияПрибыли.РаспределятьПрибыль);
		//зПрибыль.УстановитьПараметр("СчетКт", СчетФСЗН);
		зПрибыль.УстановитьПараметр("НачДата", НачалоМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("КонДата", КонецМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("СпособРаспределенияПрибыли", Перечисления.СпособыРаспределенияПрибыли.СчетПрибыли);
		//СчетБГС = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации,
		//Новый Структура("Организация", Док.Организация)).СчетБУ;
		//зПрибыль.УстановитьПараметр("СчетКт", СчетБГС);
		зПрибыль.УстановитьПараметр("НачДата", НачалоМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("КонДата", КонецМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("СпособРаспределенияПрибыли", Перечисления.СпособыРаспределенияПрибыли.РаспределятьПрибыль);
		//зПрибыль.УстановитьПараметр("СчетКт", СчетБГС);
		
		//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
		//Рез = Док.ОтражениеВУчете.Выгрузить();
		//Счет97 = Неопределено;
		//Для Каждого стр Из Рез Цикл
		//	
		//	если стр.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов тогда
		//		Счет97 = стр.СчетДт;
		//	КонецЕсли;
		//			
		//КонецЦикла;
		//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
		
		//прошлый период  
		
		зПрибыль = Новый Запрос;
		зПрибыль.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СчетДт //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СчетДт
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СчетДт
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1.Наименование, 0) = 0 //О.Т. Аверсон 12.06.2018 № 1946
		|			ТОГДА ВложенныйЗапрос.СубконтоДт1
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт1
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт1.Наименование, 0) = 0 //О.Т. Аверсон 12.06.2018 № 1946
		|			ТОГДА ВложенныйЗапрос.СубконтоДт1
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт1
		|		КОНЕЦ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт1.Наименование, 0) = 0 //О.Т. Аверсон 12.06.2018 № 1946
		|			ТОГДА ВложенныйЗапрос.СубконтоДт1
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт1
		|		КОНЕЦ 
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт2
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт2
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт2
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт2
		|		КОНЕЦ 
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт2
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт2
		|		КОНЕЦ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт3
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДт3
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт3
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДт3
		|		КОНЕЦ 
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДт3
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДт3
		|		КОНЕЦ 
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДт3
		|	КОНЕЦ КАК СубконтоДт3,
		|	ВложенныйЗапрос.СчетКт,
		|	ВложенныйЗапрос.СубконтоКт1,
		|	ВложенныйЗапрос.СубконтоКт2,
		|	ВложенныйЗапрос.СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СчетДтНУ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СчетДтНУ
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СчетДтНУ
		|		ИНАЧЕ &парамСпособПоУмолчаниюСчетНУ
		|	КОНЕЦ КАК СчетДтНУ,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ1
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ1.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ1
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОНЕЦ    		
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ1.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ1
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ1
		|		КОНЕЦ 
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ2
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ2
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОНЕЦ 
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ2.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ2
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ2
		|		КОНЕЦ 
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ3
		|		ИНАЧЕ ВложенныйЗапрос.ВидРасчета.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОНЕЦ //О.Т. Аверсон 19.03.2018 № 1737
		|		КОГДА УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ3
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОНЕЦ 
		|		КОГДА УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете <> &парамПустойСпособБУ
		|			ТОГДА ВЫБОР
		|		КОГДА  ЕСТЬNULL(УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ3.Наименование, 0) = 0
		|			ТОГДА ВложенныйЗапрос.СубконтоДтНУ3
		|		ИНАЧЕ УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.СпособОтраженияВБухучете.СубконтоДтНУ3
		|		КОНЕЦ 
		|		ИНАЧЕ &парамСпособПоУмолчаниюСубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3,
		|	ВложенныйЗапрос.СчетКтНУ,
		|	ВложенныйЗапрос.СубконтоКтНУ1,
		|	ВложенныйЗапрос.СубконтоКтНУ2,
		|	ВложенныйЗапрос.СубконтоКтНУ3,
		|	ВложенныйЗапрос.СчетКтУСН,
		|	ВложенныйЗапрос.ОтражениеВУСН,
		|	ВложенныйЗапрос.Результат,
		|	ВложенныйЗапрос.ВидРасчета,
		|	ВложенныйЗапрос.ПериодДействияНачало,
		|	ВложенныйЗапрос.Месяц,
		|	ВложенныйЗапрос.Сотрудник
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДт КАК СчетДт,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКт КАК СчетКт,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт1 КАК СубконтоКт1,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт2 КАК СубконтоКт2,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт3 КАК СубконтоКт3,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДтНУ КАК СчетДтНУ,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтНУ КАК СчетКтНУ,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ1 КАК СубконтоКтНУ1,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ2 КАК СубконтоКтНУ2,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ3 КАК СубконтоКтНУ3,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтУСН КАК СчетКтУСН,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ОтражениеВУСН КАК ОтражениеВУСН,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Результат КАК Результат,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации КАК Месяц,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Организация КАК Организация,
		|		РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|	ИЗ
		|		Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОтражениеЗарплатыВРеглУчетеОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонДата, ) КАК РаботникиОрганизацийСрезПоследних
		|			ПО ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|	ГДЕ
		|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало МЕЖДУ &НачДата И &КонДата
		//ПСА 09.02.2021 СВФР-007179 +++
		|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Результат <> 0
		//+++ПСА 09.02.2021 СВФР-007179
		|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Проведен = ИСТИНА
		|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации < &НачДата
		|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
		|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Организация = &Организация) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.СрезПоследних(&КонДата) КАК УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете
		|		ПО ВложенныйЗапрос.Сотрудник = УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.Сотрудник
		|			И ВложенныйЗапрос.Организация = УчетОсновногоЗаработкаРаботниковОрганизацииВРегламентированномУчете.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СрезПоследних(&КонДата) КАК УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних
		|		ПО ВложенныйЗапрос.Организация = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.Организация
		|			И ВложенныйЗапрос.ПодразделениеОрганизации = УчетОсновногоЗаработкаРаботниковПодразделенияОрганизацииСрезПоследних.ПодразделениеОрганизации";
		Если ЗначениеЗаполнено(Док.ПодразделениеОрганизации) Тогда 
			зПрибыль.Текст = зПрибыль.Текст +"
			|		ГДЕ
			|		ВложенныйЗапрос.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)";			
		КонецЕсли;
		СпособПоУмолчанию = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеНачисленийПоУмолчанию;
		
		зПрибыль.УстановитьПараметр("ПодразделениеОрганизации", Док.ПодразделениеОрганизации);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСчетДт", СпособПоУмолчанию.СчетДт);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт1", СпособПоУмолчанию.СубконтоДт1);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт2", СпособПоУмолчанию.СубконтоДт2);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДт3", СпособПоУмолчанию.СубконтоДт3);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСчетНУ", СпособПоУмолчанию.СчетДтНУ); 	
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ1", СпособПоУмолчанию.СубконтоДтНУ1);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ2", СпособПоУмолчанию.СубконтоДтНУ2);
		зПрибыль.УстановитьПараметр("парамСпособПоУмолчаниюСубконтоДтНУ3", СпособПоУмолчанию.СубконтоДтНУ3);
		зПрибыль.УстановитьПараметр("парамПустойСпособБУ", Справочники.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка()); 
		зПрибыль.УстановитьПараметр("Организация", Док.Организация);//О.Т. Аверсон 06.07.2018 № 2172
		
		
		//"ВЫБРАТЬ
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДт,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт1,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт2,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт3,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКт,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт1,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт2,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт3,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДтНУ,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ1,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ2,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ3,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтНУ,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ1,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ2,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ3,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтУСН,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ОтражениеВУСН,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Результат,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации КАК Месяц,
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник
		//|ИЗ
		//|	Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОтражениеЗарплатыВРеглУчетеОсновныеНачисления
		//|ГДЕ
		//|	ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало МЕЖДУ &НачДата И &КонДата
		//|	И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Проведен = ИСТИНА
		//|	И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации < &НачДата
		//|	И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)";
		
		
		зПрибыль.УстановитьПараметр("НачДата", НачалоМесяца(Док.ПериодРегистрации));
		зПрибыль.УстановитьПараметр("КонДата", КонецМесяца(Док.ПериодРегистрации));
		
		тзПереходящиеОтпуска = зПрибыль.Выполнить().Выгрузить();
		
		//Аверсон 16.07.2023 КВВ СВФР-010889 (
		Если Док.Организация.ИНН = "100194961" Тогда //Виток
			ТЗДат = тзПереходящиеОтпуска.Скопировать();
			ТЗДат.Свернуть("Месяц");
			спСотрудников = Новый СписокЗначений;
			спСотрудников.ЗагрузитьЗначения(тзПереходящиеОтпуска.ВыгрузитьКолонку("Сотрудник"));
			спВР = Новый СписокЗначений;
			спВР.ЗагрузитьЗначения(тзПереходящиеОтпуска.ВыгрузитьКолонку("ВидРасчета"));
			СчЗамен = 0;
			Для Каждого СтрТЗДат ИЗ ТЗДат Цикл
				З = Новый Запрос;
				З.Текст = "ВЫБРАТЬ *
				|ИЗ Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОС
				|ГДЕ ОС.Ссылка.ПРОВЕДЕН = ИСТИНА
				|И ОС.Ссылка.ПериодРегистрации = &ДатаРегистрации
				|И ОС.Сотрудник В (&СписокСотрудников)
				|И ОС.ВидРасчета В (&СписокВР)";
				З.УстановитьПараметр("ДатаРегистрации",СтрТЗДат.Месяц);
				З.УстановитьПараметр("СписокСотрудников",спСотрудников);
				З.УстановитьПараметр("СписокВР",спВР);
				РезЗ = З.Выполнить().Выгрузить();
				
				Для Каждого СтрРезЗ ИЗ РезЗ Цикл
					Отбор = Новый Структура;
					Отбор.Вставить("Сотрудник", СтрРезЗ.Сотрудник);
					Отбор.Вставить("ВидРасчета", СтрРезЗ.ВидРасчета);
					Отбор.Вставить("Результат", СтрРезЗ.Результат);
					Отбор.Вставить("ПериодДействияНачало", СтрРезЗ.ПериодДействияНачало);
					СтрокиОтбора = тзПереходящиеОтпуска.НайтиСтроки(Отбор);
					Для Каждого СтрСтрокиОтбора ИЗ СтрокиОтбора Цикл
						Если СтрРезЗ.СчетДтНУ <> СтрСтрокиОтбора.СчетДт Тогда
							СтрСтрокиОтбора.СчетДт = СтрРезЗ.СчетДт;
							СтрСтрокиОтбора.СубконтоДт1 = СтрРезЗ.СубконтоДт1;
							СтрСтрокиОтбора.СубконтоДт2 = СтрРезЗ.СубконтоДт2;
							СтрСтрокиОтбора.СубконтоДт3 = СтрРезЗ.СубконтоДт3;
							СтрСтрокиОтбора.СчетДтНУ = СтрРезЗ.СчетДтНУ;
							СтрСтрокиОтбора.СубконтоДтНУ1 = СтрРезЗ.СубконтоДтНУ1;   
							СтрСтрокиОтбора.СубконтоДтНУ2 = СтрРезЗ.СубконтоДтНУ2;
							СтрСтрокиОтбора.СубконтоДтНУ3 = СтрРезЗ.СубконтоДтНУ3;			
							
							СчЗамен = СчЗамен + 1;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			//Сообщить("Замен/перераспределений (97 счет) : " + СокрЛП(СчЗамен));
		КонецЕсли;
		//Аверсон 16.07.2023 КВВ СВФР-010889 )
		
		//О.Т. 21.01.2015 № 17778
		ПараметрБез97Счета = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Док.ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ОбязательноеСтрахованиеБез97)).Размер;//О.Т. 21.01.2015 № 17778
		если ПараметрБез97Счета = 0 Тогда 
			ПараметрБез97Счета = Ложь;
		иначе
			ПараметрБез97Счета = Истина;
		КонецЕсли;
		//О.Т. 21.01.2015 № 17778
		
		//РезультатСОграничениемТЗ = зПрибыль.Выполнить().Выгрузить();
		//пока тзПереходящиеОтпуска.Следующий() Цикл 
		//	СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(тзПереходящиеОтпуска.Месяц),Новый Структура("ВидОтчисления",Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд));
		//	РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(тзПереходящиеОтпуска.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
		//	БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
		//	если БазаОграниченияФСЗН < тзПереходящиеОтпуска.Результат Тогда 
		//		ПарамОтбор = Новый Структура;
		//		ПарамОтбор.Вставить("СубконтоКт1",тзПереходящиеОтпуска.СубконтоКт1);
		//		СтрокаИзменить = РезультатСОграничениемТЗ.НайтиСтроки(ПарамОтбор);
		//		если СтрокаИзменить.Количество() > 0 Тогда 
		//			СтрокаИзменить[0].Результат = БазаОграниченияФСЗН; 
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//	
		//КонецЦикла;
		//тзПереходящиеОтпуска = РезультатСОграничениемТЗ; 
		//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
		ЗапросСтатья = Новый Запрос;
		ЗапросСтатья.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация,
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.СубконтоРезерваФСЗН3,
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.СубконтоРезерваСтрах3
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		ЗапросСтатья.УстановитьПараметр("Организация",Док.Организация);
		Рез = ЗапросСтатья.Выполнить().Выбрать();
		СтатьяЗатратФСЗН = Неопределено;
		СтатьяЗатратСтрах = Неопределено;
		пока  Рез.Следующий() цикл
			СтатьяЗатратФСЗН = Рез.СубконтоРезерваФСЗН3;
			СтатьяЗатратСтрах = Рез.СубконтоРезерваСтрах3;
			
		КонецЦикла;
		
		ТЗСчета = Новый ТаблицаЗначений;
		ТЗСчета.Колонки.Добавить("Сотрудник");
		ТЗСчета.Колонки.Добавить("Дт"); 
		ТЗСчета.Колонки.Добавить("Дт1"); 
		ТЗСчета.Колонки.Добавить("Дт2");
		ТЗСчета.Колонки.Добавить("Дт3"); 

		//О.Т. Аверсон 20.11.2017 № 1269
		ТЗСотрудникиПроверка = Новый ТаблицаЗначений;
		ТЗСотрудникиПроверка.Колонки.Добавить("Сотрудник");
		ТЗСотрудникиПроверка.Колонки.Добавить("РезультатФСЗН");
		ТЗСотрудникиПроверка.Колонки.Добавить("РезультатСтрах");
		СтрТЗСотрудникиПроверка = Неопределено;
		//О.Т. Аверсон 20.11.2017 № 1269
		//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
		
		//Аверсон ЕАЕ 12.06.2020 СВФР-006057
		//(1) этот запрос вынесен из цикла
		ЗапросИндСтавкаНалогообл = Новый Запрос;
		ЗапросИндСтавкаНалогообл.Текст = 
		"ВЫБРАТЬ
		|   ИноеНалогообложениеПоСотрудникамСрезПоследних.Сотрудник,
		|   ИноеНалогообложениеПоСотрудникамСрезПоследних.ВидНалогообложения,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
		|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН
		|ИЗ
		|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		//|				И ВидНалогообложения = &ВидНалогообложения
		//|				И Сотрудник = &Сотрудник
		|) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
		
		//ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Док.Организация);
		ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", Док.ПериодРегистрации);
		//ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник); 
		ТЗРезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
		//!!!
		//Аверсон
		
		//Аверсон ЕАЕ 12.06.2020 СВФР-006057
		//(2) этот запрос вынесен из цикла
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
		|ИЗ
		|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
		|ГДЕ
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
		//|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
		//+  Аверсон СМА 22.05.2020 СВФР-006024
		//|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт
		// -  Аверсон СМА 22.05.2020 СВФР-006024
		|";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
		Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
		//Запрос.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
		//Запрос.УстановитьПараметр("СчетДт", мСтрока.СчетДт);
		
		ТЗРаспределениеОсновногоЗаработкаРаботниковОрганизаций = Запрос.Выполнить().Выгрузить();
		//!!!
		//Аверсон
		
		//Аверсон ЕАЕ 12.06.2020 СВФР-006057
		//(3) этот запрос вынесен из цикла
		ЗапросФСЗНБГС = Новый Запрос;
		ЗапросФСЗНБГС.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ.Сотрудник,
		//|	ТЗ.Сотрудник.ФизЛицо КАК ФизЛицо,
		|	ТЗ.Месяц,
		|	ТЗ.ПериодДействияНачало,
		|   ТЗ.СчетДт
		|ПОМЕСТИТЬ ВТТЗ
		|ИЗ &ТЗ КАК ТЗ
		|;
		|////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ЕСНИсчисленный.Сотрудник,
		//      для всех по сотрудникам 26.11.24
		////Аверсон 18.07.2023 КВВ СВФР-010889 (
		//Если Док.Организация.ИНН = "100194961" ИЛИ Док.Организация.ИНН = "100422074" Тогда //Виток Аверсон ЕАЕ 12.03.2024 СВФР-012459 Арлекс
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|   ЕСНИсчисленный.Сотрудник,";
		//КонецЕсли;
		//ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		|   ЕСНИсчисленный.ФизЛицо,
		|	ЕСНИсчисленный.ОбязательноеСтрахование,
		|   ЕСНИсчисленный.ФСЗН,
		|	ЕСНИсчисленный.ЕдиныйПлатеж,
		|   ЕСНИсчисленный.Период,
		|   ЕСНИсчисленный.ПериодВзаиморасчетов,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
		|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
		|ПОМЕСТИТЬ ВТРезультат
		|ИЗ 
		|	РегистрНакопления.ЕСНИсчисленныйПоСотрудникам КАК ЕСНИсчисленный
		//  для всех по сотрудника 26.11.24
		////Аверсон 18.07.2023 КВВ СВФР-010889 (
		//Если Док.Организация.ИНН = "100194961" ИЛИ Док.Организация.ИНН = "100422074" Тогда //Виток Аверсон ЕАЕ 12.03.2024 СВФР-012459 Арлекс
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|	РегистрНакопления.ЕСНИсчисленныйПоСотрудникам КАК ЕСНИсчисленный";
		//Иначе
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный";
		//КонецЕсли;
		//
		//ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		////Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
		|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
		|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
		|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
		// для всех по сотрудникам 26.11.2024
		|		И ЕСНИсчисленный.Сотрудник = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник
		////Аверсон 18.07.2023 КВВ СВФР-010889 (
		//Если Док.Организация.ИНН = "100194961" ИЛИ Док.Организация.ИНН = "100422074" Тогда //Виток Аверсон ЕАЕ 12.03.2024 СВФР-012459 Арлекс
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//|		И ЕСНИсчисленный.Сотрудник = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник";
		//КонецЕсли;
		//ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		////Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		|ГДЕ
		//|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		|	ЕСНИсчисленный.Организация = &Организация
		//|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
		//|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
		//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
		//Аверсон ЕАЕ 05.10.2017
		|   И (ЕСНИсчисленный.ОбязательноеСтрахование <> 0 ИЛИ ЕСНИсчисленный.ФСЗН <> 0 ИЛИ ЕСНИсчисленный.ЕдиныйПлатеж <> 0)
		//Аверсон
		|;
		|////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		// для всех по сотрудникам 26.11.24
		|	ВТТЗ.Сотрудник.ФизЛицо КАК ФизЛицо,
		////Аверсон 18.07.2023 КВВ СВФР-010889 (
		//Если Док.Организация.ИНН = "100194961" ИЛИ Док.Организация.ИНН = "100422074" Тогда //Виток Аверсон ЕАЕ 12.03.2024 СВФР-012459 Арлекс
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|	ВТТЗ.Сотрудник.ФизЛицо КАК ФизЛицо,";
		//КонецЕсли;
		//
		//ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		////Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		|	ВТТЗ.СчетДт КАК СчетДтСтр,
		|	ВТТЗ.Сотрудник,
		|	ВТТЗ.Месяц,
		|	ВТТЗ.ПериодДействияНачало,
		|   ВТРезультат.ДоляСпособаОтражения,
		|	ВТРезультат.СчетДт,
		|	ВТРезультат.СубконтоДт1,
		|	ВТРезультат.СубконтоДт2,
		|	ВТРезультат.СубконтоДт3,
		|	ВТРезультат.СубконтоДтНУ1,
		|	ВТРезультат.СубконтоДтНУ2,
		|	ВТРезультат.СубконтоДтНУ3,
		|	ВТРезультат.СчетДтНУ,
		|	ЕСТЬNULL(ВТРезультат.ОбязательноеСтрахование,0) КАК ОбязательноеСтрахование,
		|	ЕСТЬNULL(ВТРезультат.ФСЗН,0) КАК ФСЗН,
		|   ЕСТЬNULL(ВТРезультат.ЕдиныйПлатеж,0) КАК ЕдиныйПлатеж
		|ИЗ ВТТЗ
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультат
		|ПО ВТТЗ.Сотрудник.ФизЛицо = ВТРезультат.ФизЛицо
		|	И ВТРезультат.Период МЕЖДУ НАЧАЛОПЕРИОДА(ВТТЗ.Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(ВТТЗ.Месяц, МЕСЯЦ)
		|	И ВТРезультат.ПериодВзаиморасчетов МЕЖДУ НАЧАЛОПЕРИОДА(ВТТЗ.ПериодДействияНачало, МЕСЯЦ) И КОНЕЦПЕРИОДА(ВТТЗ.ПериодДействияНачало, МЕСЯЦ)						
		//  для всех по сотрудникам 26.11.24
		|	И ВТТЗ.Сотрудник = ВТРезультат.Сотрудник";
		////Аверсон 18.07.2023 КВВ СВФР-010889 (
		//Если Док.Организация.ИНН = "100194961" ИЛИ Док.Организация.ИНН = "100422074" Тогда //Виток Аверсон ЕАЕ 12.03.2024 СВФР-012459 Арлекс
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|	И ВТТЗ.Сотрудник = ВТРезультат.Сотрудник";
		//Иначе
		//	ЗапросФСЗНБГС.Текст = ЗапросФСЗНБГС.Текст + "
		//	|	И (ВТРезультат.СчетДт = ВТТЗ.СчетДт ИЛИ ЕстьNull(ВТРезультат.СчетДт,1) = 1)";
		//КонецЕсли;
		////Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
		ЗапросФСЗНБГС.УстановитьПараметр("ТЗ", тзПереходящиеОтпуска);
		ТЗФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
		//!!!
		//Аверсон
		
		//Аверсон 18.07.2023 КВВ СВФР-010889 (		
		Если Док.Организация.ИНН = "100194961" Тогда //Виток
			ПроцентБГС = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
		Новый Структура("Организация,ВидНалогообложения", Док.Организация,Док.Организация.ОсновнаяСтавкаНалогообложения)).Ставка;
		
			Отбор_0_0 = Новый Структура;
			Отбор_0_0.Вставить("ФСЗН",0);
			Отбор_0_0.Вставить("ОбязательноеСтрахование",0);
			СтрокиОтбор_0_0 = ТЗФСЗНБГС.НайтиСтроки(Отбор_0_0);
						
			Для Каждого СтрОтбор_0_0 ИЗ СтрокиОтбор_0_0 Цикл     
				СумФСЗНВсего = 0; СумБГСВсего = 0;  
				
				Отбор_Сотр = Новый Структура;
				Отбор_Сотр.Вставить("ФизЛицо",СтрОтбор_0_0.ФизЛицо);
				Отбор_Сотр.Вставить("Месяц",СтрОтбор_0_0.Месяц);
			//	Отбор_Сотр.Вставить("ПериодДействияНачало",СтрОтбор_0_0.ПериодДействияНачало);
				СтрокиОтбор_Сотр = ТЗФСЗНБГС.НайтиСтроки(Отбор_Сотр);
				СчС = 0;

				Для Каждого СтрОтбор_Сотр ИЗ СтрокиОтбор_Сотр Цикл
					СумФСЗНВсего = СумФСЗНВсего + СтрОтбор_Сотр.ФСЗН;
					СумБГСВсего = СумБГСВсего + СтрОтбор_Сотр.ОбязательноеСтрахование;
					СчС = СчС + 1;
				КонецЦикла;
				
				Если СчС = 2 Тогда
				//	Сообщить(врег(СтрОтбор_0_0.ФизЛицо) + " БЫЛ фсзн " + сокрлп(СумФСЗНВсего) + ", бгс " + сокрлп(СумБГСВсего));

					ЗФСЗН = Новый Запрос;
					ЗФСЗН.Текст = "ВЫБРАТЬ
					|ИСЧ.ФизЛицо,
					|ИСЧ.ПроцентФСЗН
					|ИЗ Документ.РасчетЕСН.ИсчисленныйЕСН КАК ИСЧ
					|ГДЕ 
					|ИСЧ.Ссылка.Проведен
					|И ИСЧ.Ссылка.ПериодРегистрации = &Период
					|И ИСЧ.Ссылка.Организация = &Организация
					|И ИСЧ.ФизЛицо = &ФизЛицо
					|СГРУППИРОВАТЬ ПО
					|ИСЧ.ФизЛицо,
					|ИСЧ.ПроцентФСЗН";
					ЗФСЗН.УстановитьПараметр("ФизЛицо",СтрОтбор_0_0.ФизЛицо);
					ЗФСЗН.УстановитьПараметр("Период",СтрОтбор_0_0.Месяц);
					ЗФСЗН.УстановитьПараметр("Организация",Док.Организация);
					РезЗФСЗН = ЗФСЗН.Выполнить().Выгрузить();
					Если РезЗФСЗН.Количество() > 0 Тогда
						ПроцентФСЗН = РезЗФСЗН[0].ПроцентФСЗН;
						
						Отбор_ТЗФСЗНБГС = Новый Структура;
						Отбор_ТЗФСЗНБГС.Вставить("СубконтоКт1",СтрОтбор_0_0.ФизЛицо);
						Отбор_ТЗФСЗНБГС.Вставить("Месяц",СтрОтбор_0_0.Месяц);
				//		Отбор_ТЗФСЗНБГС.Вставить("ПериодДействияНачало",СтрОтбор_0_0.ПериодДействияНачало);
						С1Отбор = тзПереходящиеОтпуска.НайтиСтроки(Отбор_ТЗФСЗНБГС);
						счИзм = 0; СуммаФСЗНУчт = 0;  СуммаБГСУчт = 0;
						КолвоСтр = С1Отбор.Количество();
						Для Каждого С1 ИЗ С1Отбор Цикл
							счИзм = счИзм + 1;
							
							Если КолвоСтр = счИзм Тогда
								СуммаФСЗН = СумФСЗНВсего - СуммаФСЗНУчт;
								СуммаБГС = СумБГСВсего - СуммаБГСУчт;
							Иначе								
								СуммаФСЗН = Окр(С1.Результат * ПроцентФСЗН/100,2);
								СуммаФСЗНУчт = СуммаФСЗНУчт + СуммаФСЗН;
								
								СуммаБГС = Окр(С1.Результат * ПроцентБГС/100,2);
								СуммаБГСУчт = СуммаБГСУчт + СуммаБГС;
							 КонецЕсли;
							 
							 Отбор33 = Новый Структура;
								Отбор33.Вставить("ФизЛицо",СтрОтбор_0_0.ФизЛицо);
								Отбор33.Вставить("Месяц",СтрОтбор_0_0.Месяц);
								Отбор33.Вставить("ПериодДействияНачало",СтрОтбор_0_0.ПериодДействияНачало);
								Отбор33.Вставить("СчетДтСтр",С1.СчетДт);
								СтрокиОтбор33 = ТЗФСЗНБГС.НайтиСтроки(Отбор33);
								
								Для Каждого С33 ИЗ СтрокиОтбор33 Цикл
									С33.ФСЗН = СуммаФСЗН;
									С33.ОбязательноеСтрахование = СуммаБГС;
								КонецЦикла;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Аверсон 18.07.2023 КВВ СВФР-010889 )
		
		Для Каждого мСтрока Из тзПереходящиеОтпуска Цикл
			
			//Аверсон ЕАЕ 16.06.2020 СВФР-006057
			ТочностьРасчетовВМесяце = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(мСтрока.Месяц,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; 
			//Аверсон
			
			//О.Т. Аверсон 20.11.2017 № 1269
			ОбщаяСумма = 0;
			//ПСА 09.02.2021 СВФР-007179 +++
			//МассивПерехОтпуска = тзПереходящиеОтпуска.НайтиСтроки(Новый Структура("Сотрудник",мСтрока.Сотрудник));
			МассивПерехОтпуска = тзПереходящиеОтпуска.НайтиСтроки(Новый Структура("Сотрудник, Месяц",мСтрока.Сотрудник,мСтрока.Месяц));
			//+++ПСА 09.02.2021 СВФР-007179
			Если МассивПерехОтпуска.Количество()>1 Тогда 
				Для Каждого стр из МассивПерехОтпуска Цикл 
					ОбщаяСумма = ОбщаяСумма + стр.Результат;
				КонецЦикла;
			иначе
				ОбщаяСумма = мСтрока.Результат;
			КонецЕсли;
			Если ОбщаяСумма = 0 Тогда 
				ПроцентОтОбщейСуммы = 0;
			иначе     				
				ПроцентОтОбщейСуммы = Окр(мСтрока.Результат * 100 / ОбщаяСумма,10);
			КонецЕсли;
			//О.Т. Аверсон 20.11.2017 № 1269
			
			
			//О.Т. Аверсон 24.03.2016 № 950
			Если мСтрока.Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Док.Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = мСтрока.Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			
			//Аверсон ЕАЕ 12.06.2020 СВФР-006057
			//(1) этот запрос вынесен из цикла
			
			//ЗапросИндСтавкаНалогообл = Новый Запрос;
			//ЗапросИндСтавкаНалогообл.Текст = 
			//"ВЫБРАТЬ
			//|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
			//|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН
			//|ИЗ
			//|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
			//|			&Период,
			//|			Организация = &Организация
			//|				И ВидНалогообложения = &ВидНалогообложения
			//|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
			//
			//ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			//ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Док.Организация);
			//ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", Док.ПериодРегистрации);
			//ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник); 
			//РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
			СтрОтбора = Новый Структура;
			СтрОтбора.Вставить("Сотрудник", мСтрока.Сотрудник);
			СтрОтбора.Вставить("ВидНалогообложения", ВидНалогообложения);
			РезИндСтавкаНалогообл = ТЗРезИндСтавкаНалогообл.НайтиСтроки(СтрОтбора);
			//!!!
			//Аверсон
			
			ЕстьИндивидСтавка = Ложь;
			СтавкаФСЗНИнд = 0;
			СтавкаБГСИнд = 0;
			Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
				ЕстьИндивидСтавка = Истина;
				СтавкаФСЗНИнд = РезИндСтавкаНалогообл[0].ФСЗН;
				СтавкаБГСИнд = РезИндСтавкаНалогообл[0].БГС;
			КонецЕсли;
			СчетФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации,
			Новый Структура("Организация,ВидОтчисления,ВидНалогообложения", Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)); //О.Т. Аверсон 24.03.2016 № 950
			СчетБГС = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации,
			Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
			//О.Т. Аверсон 24.03.2016 № 950
			Если мСтрока.Месяц < Дата(2016,07,01) и мСтрока.ПериодДействияНачало >= Дата(2016,07,01) и Док.ПериодРегистрации >= Дата(2016,07,01) Тогда
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//Результат = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат/10000,Док.ПериодРегистрации);
				Результат = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат/10000,,ТочностьРасчетов);				
				//Аверсон
				
			иначе   				
				Результат = мСтрока.Результат;;
			КонецЕсли;
			//отпуск   
			
			СчРаспр = 2;
			мСтрокаДок = Док.ОтражениеВУчете.Добавить();
			мСтрокаДок.СчетДт = мСтрока.СчетДт;
			мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
			
			
			
			//О.Т. Аверсон 26.01.2018 № 1502
			ЗапросОсн = Новый Запрос;
			ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросОсн.Текст = 
			"ВЫБРАТЬ
			|	ТЧ.ФизЛицо,
			|	ТЧ.СубконтоДт1,
			|	ТЧ.СубконтоДт2,
			|	ТЧ.СубконтоДт3,
			|	ТЧ.СубконтоДтНУ1,
			|	ТЧ.СубконтоДтНУ2,
			|	ТЧ.СубконтоДтНУ3
			|	ПОМЕСТИТЬ ВТОсн
			|ИЗ
			|	&ТЧОсновные КАК ТЧ
			|ГДЕ
			|	ТЧ.СчетДт = &СчетДт
			|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
			//(начало) добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
			|	И ТЧ.ВидРасчета = &ВидРасчета
			//(конец)  добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
			|	И ТЧ.Сотрудник = &Сотрудник";
			ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
			ЗапросОсн.УстановитьПараметр("СчетДт",мСтрока.СчетДт);
			ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
			ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
			//(начало) добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
			ЗапросОсн.УстановитьПараметр("ВидРасчета",мСтрока.ВидРасчета);
			//(конец)  добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
			
			ЗапросОсн.Выполнить();
			ЗапросОсн.Текст = 
			"ВЫБРАТЬ
			|	ТЧ.ФизЛицо,
			|	ТЧ.СубконтоДт1,
			|	ТЧ.СубконтоДт2,
			|	ТЧ.СубконтоДт3,
			|	ТЧ.СубконтоДтНУ1,
			|	ТЧ.СубконтоДтНУ2,
			|	ТЧ.СубконтоДтНУ3
			|ИЗ ВТОсн как ТЧ";
			
			
			РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
			Если РезЗапросОсн.Следующий() Тогда 
				мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
				мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
				мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
				Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
					мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
					мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
					мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
				КонецЕсли;
			иначе 
				ЗапросОсн.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.ФизЛицо,
				|	ТЧ.СубконтоДт1,
				|	ТЧ.СубконтоДт2,
				|	ТЧ.СубконтоДт3,
				|	ТЧ.СубконтоДтНУ1,
				|	ТЧ.СубконтоДтНУ2,
				|	ТЧ.СубконтоДтНУ3
				|	ПОМЕСТИТЬ ВТДоп
				|ИЗ
				|	&ТЧДополит КАК ТЧ
				|ГДЕ
				|	ТЧ.СчетДт = &СчетДт
				//(начало) добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
				|	И ТЧ.ВидРасчета = &ВидРасчета
				//(конец)  добавлено Кухарчуком Д.Я. 21.12.18, Задача СВФР-002938, Аверсон-Софт
				|	И ТЧ.Сотрудник = &Сотрудник";
				ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
				ЗапросОсн.Выполнить();
				ЗапросОсн.Текст = 
				"ВЫБРАТЬ
				|	ТЧ.ФизЛицо,
				|	ТЧ.СубконтоДт1,
				|	ТЧ.СубконтоДт2,
				|	ТЧ.СубконтоДт3,
				|	ТЧ.СубконтоДтНУ1,
				|	ТЧ.СубконтоДтНУ2,
				|	ТЧ.СубконтоДтНУ3
				|ИЗ ВТДоп как ТЧ";
				РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
				Если РезЗапросОсн.Следующий() Тогда
					мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
					мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
					мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
					Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
						мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
					КонецЕсли;
					
				иначе	
					мСтрокаДок.СубконтоДт1 = мСтрока.СубконтоДт1;
					мСтрокаДок.СубконтоДт2 = мСтрока.СубконтоДт2;
					мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;
					
					Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда 
						
						мСтрокаДок.СубконтоДтНУ1 = мСтрока.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ2 = мСтрока.СубконтоДтНУ2;
						мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			мСтрока.СубконтоДт1 =  мСтрокаДок.СубконтоДт1;
			мСтрока.СубконтоДт2 =  мСтрокаДок.СубконтоДт2;
			мСтрока.СубконтоДт3 =  мСтрокаДок.СубконтоДт3;      			
			мСтрока.СубконтоДтНУ1 =  мСтрокаДок.СубконтоДтНУ1;
			мСтрока.СубконтоДтНУ2 =  мСтрокаДок.СубконтоДтНУ2;
			мСтрока.СубконтоДтНУ3 =  мСтрокаДок.СубконтоДтНУ3;
			//О.Т. Аверсон 26.01.2018 № 1502
			
			мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
			//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
			мСтрокаДок.СубконтоКт1 = Справочники.РасходыБудущихПериодов.РБПНаОплатуТруда;
			мСтрокаДок.СубконтоКт2 = мСтрока.СубконтоКт1;
			//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
			мСтрокаДок.СубконтоКт3 = мСтрока.СубконтоКт3;
			мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
			мСтрокаДок.СубконтоКтНУ1 = мСтрока.СубконтоКтНУ1;
			мСтрокаДок.СубконтоКтНУ2 = мСтрока.СубконтоКтНУ2;
			мСтрокаДок.СубконтоКтНУ3 = мСтрока.СубконтоКтНУ3;
			Если мСтрока.Месяц < Дата(2016,07,01) и мСтрока.ПериодДействияНачало >= Дата(2016,07,01) и Док.ПериодРегистрации >= Дата(2016,07,01) Тогда
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат/10000,Док.ПериодРегистрации);
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат/10000,,ТочностьРасчетов);
				//Аверсон
			иначе   				
				мСтрокаДок.Сумма = мСтрока.Результат;
			КонецЕсли;
			мСтрокаРезультат = мСтрокаДок.Сумма;
			мСтрокаДок.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
			мСтрокаДок.СчетКтУСН = мСтрока.СчетКтУСН;
			мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.Начисление;
			
			если Док.НалогиИзДокументаРасчетФзносовСФОТ и не ЗначениеЗаполнено(мСтрока.ВидРасчета.СпособОтраженияВБухучете) Тогда //О.Т. Аверсон 17.07.2018 № 2240 2е условие
				//Аверсон ЕАЕ 12.06.2020 СВФР-006057
				//(2) этот запрос вынесен из цикла
				
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//"ВЫБРАТЬ
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
				//|ИЗ
				//|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
				//|ГДЕ
				//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
				//|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
				////+  Аверсон СМА 22.05.2020 СВФР-006024
				////|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт
				//// -  Аверсон СМА 22.05.2020 СВФР-006024
				//|";
				
				//Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
				//Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
				//Запрос.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
				//Запрос.УстановитьПараметр("СчетДт", мСтрока.СчетДт);
				//
				//РезультатЗапроса = Запрос.Выполнить();
				
				СтрОтбора = Новый Структура;
				СтрОтбора.Вставить("Сотрудник", мСтрока.Сотрудник);
				МассивСтрок = ТЗРаспределениеОсновногоЗаработкаРаботниковОрганизаций.НайтиСтроки(СтрОтбора);
				
				//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				//Аверсон
				//!!!
				
				СуммаРаспр = 0;
				
				//Аверсон ЕАЕ 17.06.2020 СВФР-006057
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Для Каждого ВыборкаДетальныеЗаписи Из МассивСтрок Цикл
				//Аверсон
					
					мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
					ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
					ЗаполнитьЗначенияСвойств(мСтрокаДок1,ВыборкаДетальныеЗаписи);
					
					
					//О.Т. Аверсон 26.01.2018 № 1502
					ЗапросОсн = Новый Запрос;
					ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
					ЗапросОсн.Текст = 
					"ВЫБРАТЬ
					|	ТЧ.ФизЛицо,
					|	ТЧ.СубконтоДт1,
					|	ТЧ.СубконтоДт2,
					|	ТЧ.СубконтоДт3,
					|	ТЧ.СубконтоДтНУ1,
					|	ТЧ.СубконтоДтНУ2,
					|	ТЧ.СубконтоДтНУ3
					|	ПОМЕСТИТЬ ВТОсн
					|ИЗ
					|	&ТЧОсновные КАК ТЧ
					|ГДЕ
					|	ТЧ.СчетДт = &СчетДт
					|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
					|	И ТЧ.Сотрудник = &Сотрудник";
					ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
					ЗапросОсн.УстановитьПараметр("СчетДт",ВыборкаДетальныеЗаписи.СчетДт);
					ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
					ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
					
					ЗапросОсн.Выполнить();
					ЗапросОсн.Текст = 
					"ВЫБРАТЬ
					|	ТЧ.ФизЛицо,
					|	ТЧ.СубконтоДт1,
					|	ТЧ.СубконтоДт2,
					|	ТЧ.СубконтоДт3,
					|	ТЧ.СубконтоДтНУ1,
					|	ТЧ.СубконтоДтНУ2,
					|	ТЧ.СубконтоДтНУ3
					|ИЗ ВТОсн как ТЧ";                                                                                           		
					
					
					РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
					Если РезЗапросОсн.Следующий() Тогда 
						мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
						Если не ЗначениеЗаполнено(мСтрокаДок1.СубконтоДт2) Тогда //Аверсон СМА 22.05.2020 СВФР-006024 добавлено если
							мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
						КонецЕсли;
						мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
						Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
							мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
							мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
							мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
						КонецЕсли;
					иначе 
						ЗапросОсн.Текст = 
						"ВЫБРАТЬ
						|	ТЧ.ФизЛицо,
						|	ТЧ.СубконтоДт1,
						|	ТЧ.СубконтоДт2,
						|	ТЧ.СубконтоДт3,
						|	ТЧ.СубконтоДтНУ1,
						|	ТЧ.СубконтоДтНУ2,
						|	ТЧ.СубконтоДтНУ3
						|	ПОМЕСТИТЬ ВТДоп
						|ИЗ
						|	&ТЧДополит КАК ТЧ
						|ГДЕ
						|	ТЧ.СчетДт = &СчетДт
						|	И ТЧ.Сотрудник = &Сотрудник";
						ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
						ЗапросОсн.Выполнить();
						ЗапросОсн.Текст = 
						"ВЫБРАТЬ
						|	ТЧ.ФизЛицо,
						|	ТЧ.СубконтоДт1,
						|	ТЧ.СубконтоДт2,
						|	ТЧ.СубконтоДт3,
						|	ТЧ.СубконтоДтНУ1,
						|	ТЧ.СубконтоДтНУ2,
						|	ТЧ.СубконтоДтНУ3
						|ИЗ ВТДоп как ТЧ";
						РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
						Если РезЗапросОсн.Следующий() Тогда
							мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
							мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
							мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
							Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
								мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
								мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
								мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					//О.Т. Аверсон 26.01.2018 № 1502 
					
					//Аверсон ЕАЕ 16.06.2020 СВФР-006057
					//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрокаДок1.Сумма * ВыборкаДетальныеЗаписи.ДоляСпособаОтражения/100,Док.ПериодРегистрации);
					мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрокаДок1.Сумма * ВыборкаДетальныеЗаписи.ДоляСпособаОтражения/100,,ТочностьРасчетов);
					//Аверсон
					
					СуммаРаспр = СуммаРаспр + мСтрокаДок1.Сумма; 
				КонецЦикла;
				мСтрокаДок.Сумма = мСтрокаДок.Сумма - СуммаРаспр;
			КонецЕсли;
			
			ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
			//Островская Татьяна 23.04.2013 № 16 ФСЗН ограничения
			если ПенсФондБудМес = 0 тогда
				РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачалоМесяца(мСтрока.Месяц)) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
				СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(мСтрока.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
			иначе
				РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачалоМесяца(Док.ПериодРегистрации)) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
				СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(Док.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
			КонецЕсли;	
			БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			ЗапросОгр = Новый Запрос;
			ЗапросОгр.Текст = 
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.ФизЛицо,
			|	СУММА(ВложенныйЗапрос.Результат) КАК Результат
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ФизЛицо КАК ФизЛицо,
			|		СУММА(ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Результат) КАК Результат
			|	ИЗ
			|		Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОтражениеЗарплатыВРеглУчетеОсновныеНачисления
			|	ГДЕ
			|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ФизЛицо = &ФизЛицо
			|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка = &Ссылка
			|		И (ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
			|		И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало <= &ПериодДействияНачало
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ФизЛицо
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ФизЛицо,
			|		СУММА(ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.Результат)
			|	ИЗ
			|		Документ.ОтражениеЗарплатыВРеглУчете.ДополнительныеНачисления КАК ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления
			|	ГДЕ
			|		ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ФизЛицо = &ФизЛицо
			|		И ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.Ссылка = &Ссылка
			|		И (ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяПолностью)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиЕП)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗН)
			|				ИЛИ ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ВидРасчета.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ))
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОтражениеЗарплатыВРеглУчетеДополнительныеНачисления.ФизЛицо) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ФизЛицо";
			ЗапросОгр.УстановитьПараметр("Ссылка",Док.Ссылка);
			ЗапросОгр.УстановитьПараметр("ФизЛицо",мСтрока.СубконтоКт1);
			ЗапросОгр.УстановитьПараметр("ПериодДействияНачало",КонецМесяца(Док.ПериодРегистрации));
			РезЗапрос = ЗапросОгр.Выполнить().Выбрать();
			//Островская Татьяна 27.09.2013 № 16815
			СуммаФСЗННеВыводить = Ложь;
			пока РезЗапрос.Следующий() Цикл 
				
				если РезЗапрос.Результат+мСтрокаРезультат > БазаОграниченияФСЗН Тогда  
					если РезЗапрос.Результат > БазаОграниченияФСЗН Тогда
						СуммаФСЗННеВыводить = Истина;
					иначе
						
						если БазаОграниченияФСЗН-мСтрокаРезультат > БазаОграниченияФСЗН Тогда
							
							СуммаФСЗННеВыводить = Истина;
						иначе
							если ПенсФондБудМес = 0 тогда
								Результат =мСтрокаРезультат; //мин(мСтрока.Результат,РезПерех);
								
							иначе
								РезПерех = БазаОграниченияФСЗН - РезЗапрос.Результат ;
								Результат =мин(мСтрокаРезультат,РезПерех);
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			//Островская Татьяна 27.09.2013 № 16815
			//Островская Татьяна 23.04.2013 № 16 ФСЗН ограничения
			
			ЕстьРаспределение = Ложь;
			СтрокаНаИзменение = Ложь;
			Если Док.НалогиИзДокументаРасчетФзносовСФОТ Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
				|ИЗ
				|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
				|ГДЕ
				|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
				|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник";
				
				Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
				Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
				Запрос.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник); 
				
				РезПроверкаРаспр = Запрос.Выполнить().Выгрузить();
				ЕстьРаспределение = РезПроверкаРаспр.Количество() > 0;
			КонецЕсли;
			
			
			если ПенсФондБудМес = 0 тогда
				//ФСЗН
				//если не СуммаФСЗННеВыводить Тогда //Островская Татьяна 24.04.2013 № 16 ФСЗН ограничения
				//Островская Татьяна 16.01.2014 № 17043
				НеИмеетПравоНаПенсию = РегистрыСведений.ГражданствоФизЛиц.ПолучитьПоследнее(мСтрока.Месяц, Новый Структура("ФизЛицо",мСтрока.СубконтоКт1)).НеИмеетПравоНаПенсию;
				если не НеИмеетПравоНаПенсию Тогда 
					//Островская Татьяна 16.01.2014 № 17043
					//Если не ЕстьРаспределение Тогда 
					//	МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,ПризнакПроводки",мСтрока.СчетДт,мСтрока.СубконтоДт1,мСтрока.СубконтоДт2,мСтрока.СубконтоКт1,Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты));
					//	Если МассивСтрока.Количество() > 0 Тогда 
					//		мСтрокаДок = МассивСтрока[0];
					//		СтрокаНаИзменение = Истина;
					//	иначе
					//		мСтрокаДок = Док.ОтражениеВУчете.Добавить();   							
					//	КонецЕсли;						
					//иначе 						
					мСтрокаДок = Док.ОтражениеВУчете.Добавить();
					//КонецЕсли;
					
					//О.Т. Аверсон 14.04.2017 № 547
					НомерСубконто = 0;
					Для Каждого стрВидыСубконто из мСтрока.СчетДт.ВидыСубконто Цикл 
						Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
							НомерСубконто = стрВидыСубконто.НомерСтроки;							
						КонецЕсли;  						
					КонецЦикла;
					НомерСубконтоНУ = 0;
					Для Каждого стрВидыСубконто из мСтрока.СчетДтНУ.ВидыСубконто Цикл 
						Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
							НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
						КонецЕсли;  						
					КонецЦикла;
					
					//О.Т. Аверсон 14.04.2017 № 547
					
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					если не СтатьяЗатратФСЗН = Неопределено тогда
						если мСтрока.СубконтоДт3 = Неопределено тогда
							если мСтрока.СубконтоДт2 = Неопределено тогда
								если мСтрока.СубконтоДт1 = Неопределено тогда
									мСтрокаДок.СчетДт			= мСтрока.СчетДт;
									мСтрокаДок.СубконтоДт1	= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрокаДок.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547
								иначе
									мСтрокаДок.СчетДт = мСтрока.СчетДт;
									мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);
									мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
								КонецЕсли;
							иначе
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);
								мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДт2);
								мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;;
							КонецЕсли;
						иначе
							
							мСтрокаДок.СчетДт = мСтрока.СчетДт;
							мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);
							мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДт2);
							мСтрокаДок.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДт3);
						КонецЕсли;
					Иначе 
						мСтрокаДок.СчетДт = мСтрока.СчетДт;
						мСтрокаДок.СубконтоДт1 = мСтрока.СубконтоДт1;
						мСтрокаДок.СубконтоДт2 = мСтрока.СубконтоДт2;
						мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;
						
						
					КонецЕсли;
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
					//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
					мСтрокаДок.СубконтоКт1 = Справочники.РасходыБудущихПериодов.РБПНаФСС;
					мСтрокаДок.СубконтоКт2 = мСтрока.СубконтоКт1;
					//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
					мСтрокаДок.СубконтоКт3 = мСтрока.СубконтоКт3;
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					если не СтатьяЗатратФСЗН = Неопределено тогда
						если мСтрока.СубконтоДтНУ3 = Неопределено тогда
							если мСтрока.СубконтоДтНУ2 = Неопределено тогда
								если мСтрока.СубконтоДтНУ1 = Неопределено тогда
									мСтрокаДок.СчетДтНУ			= мСтрока.СчетДтНУ;
									мСтрокаДок.СубконтоДтНУ1	= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрокаДок.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547
								иначе
									мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
									мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);
									мСтрокаДок.СубконтоДтНУ2	= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
								КонецЕсли;
							Иначе 
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);
								мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ2);
								мСтрокаДок.СубконтоДтНУ3	= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;   
							КонецЕсли;
						иначе
							мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
							мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);
							мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ2);
							мСтрокаДок.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
						КонецЕсли;
					иначе
						мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
						мСтрокаДок.СубконтоДтНУ1 = мСтрока.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ2 = мСтрока.СубконтоДтНУ2;
						мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;
					КонецЕсли;
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					
					мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
					мСтрокаДок.СубконтоКтНУ1 = мСтрока.СубконтоКтНУ1;
					мСтрокаДок.СубконтоКтНУ2 = мСтрока.СубконтоКтНУ2;
					мСтрокаДок.СубконтоКтНУ3 = мСтрока.СубконтоКтНУ3;
					Если Док.НалогиИзДокументаРасчетФзносовСФОТ и не ЗначениеЗаполнено(мСтрока.ВидРасчета.СпособОтраженияВБухучете) Тогда //О.Т. Аверсон 17.07.2018 № 2240 2е условие
						//Если Результат > БазаОграниченияФСЗН Тогда 
						//	если ПенсФондБудМес = 0 тогда
						//		РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(мСтрока.Месяц),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
						//		СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(мСтрока.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
						//	иначе
						//		РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(Док.ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
						//		СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(Док.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
						//	КонецЕсли;	
						//	БазаОграниченияФСЗН1 = СтруктураПенс1.ОграничениеПоДоходам*РазмерСреднейЗарплаты1;
						//	
						//	Если БазаОграниченияФСЗН1 < БазаОграниченияФСЗН Тогда
						//		
						//		ЗапросФСЗН = Новый Запрос;
						//		ЗапросФСЗН.Текст = 
						//		"ВЫБРАТЬ
						//		|	ЕСНИсчисленный.ФСЗН
						//		|ИЗ
						//		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						//		|ГДЕ
						//		|	ЕСНИсчисленный.Организация = &Организация
						//		|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						//		|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
						//		|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &Период И &Период1";
						//		
						//		ЗапросФСЗН.УстановитьПараметр("Организация", Док.Организация);
						//		ЗапросФСЗН.УстановитьПараметр("Период", НачалоМесяца(мСтрока.ПериодДействияНачало));
						//		ЗапросФСЗН.УстановитьПараметр("Период1", КонецМесяца(мСтрока.ПериодДействияНачало));
						//		ЗапросФСЗН.УстановитьПараметр("ФизЛицо", мСтрока.Сотрудник.Физлицо);
						//		
						//		РезультатЗапросаФСЗН = ЗапросФСЗН.Выполнить().Выбрать();
						//		СуммаДопФСЗН = 0;
						//		Пока РезультатЗапросаФСЗН.Следующий() Цикл
						//			СуммаДопФСЗН = СуммаДопФСЗН + РезультатЗапросаФСЗН.ФСЗН;								
						//		КонецЦикла;								
						//		
						//	КонецЕсли;
						//КонецЕсли;
						
						//Аверсон ЕАЕ 15.06.2020 СВФР-006057
						//(4) этот запрос вынесен из цикла
						
						//ЗапросФСЗНБГС = Новый Запрос;
						//ЗапросФСЗНБГС.Текст = 
						//"ВЫБРАТЬ
						//|	ЕСНИсчисленный.ФСЗН,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						//|ИЗ
						//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						//|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
						//|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
						//|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
						//|ГДЕ
						//|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						//|	И ЕСНИсчисленный.Организация = &Организация
						//|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
						//|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
						//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1 И ЕСНИсчисленный.ФСЗН <> 0"; 						
						//
						//ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
						//ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
						//ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
						//ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
						//ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
						//ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",мСтрока.СчетДт);
						//
						//ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
						//ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						СтрОтбора = Новый Структура;
						СтрОтбора.Вставить("Сотрудник", мСтрока.Сотрудник);
						СтрОтбора.Вставить("Месяц", мСтрока.Месяц);
						СтрОтбора.Вставить("ПериодДействияНачало", мСтрока.ПериодДействияНачало);
						СтрОтбора.Вставить("СчетДтСтр", мСтрока.СчетДт);
						МассивСтрокФСЗНБГС = ТЗФСЗНБГС.НайтиСтроки(СтрОтбора);
						
						//!!!
						//Аверсон
						
						СчНомерСтроки = 1;
						
						//Аверсон ЕАЕ 17.06.2020 СВФР-006057
						//Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 														
						Для Каждого РезФСЗНБГС из МассивСтрокФСЗНБГС Цикл
						//Аверсон
							
							//О.Т. Аверсон 14.04.2017 № 547   ,
							НомерСубконто = 0;
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
							КонецЕсли;
							
							//О.Т. Аверсон 14.04.2017 № 547
							
							
							Если СчНомерСтроки = 1 Тогда 
								
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2); //О.Т. Аверсон 28.03.2019 № 4135
								
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								Если РезФСЗНБГС.СчетДт <> Null Тогда 
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												если РезФСЗНБГС.СубконтоДт1 = Неопределено тогда
													мСтрокаДок.СубконтоДт1	= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрокаДок.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547
												иначе
													мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок.СубконтоДт3		= Неопределено;
												КонецЕсли;
											иначе
												мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
												мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
												
											КонецЕсли;
										иначе  											
											мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);
										КонецЕсли;
									Иначе 
										мСтрокаДок.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												если мСтрока.СубконтоДтНУ1 = Неопределено тогда
													мСтрокаДок.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрокаДок.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок.СубконтоДтНУ2 		= Неопределено;
													мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
												иначе
													
													мСтрокаДок.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
													
												КонецЕсли;
												
											иначе
												мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
												мСтрокаДок.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
											КонецЕсли;
										иначе
											
											мСтрокаДок.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);
										КонецЕсли;
									Иначе 
										мСтрокаДок.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
								КонецЕсли;
								
								//МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,СубконтоДт3",мСтрокаДок.СчетДт,мСтрокаДок.СубконтоДт1,мСтрокаДок.СубконтоДт2,мСтрока.СубконтоКт1,мСтрокаДок.СубконтоДт3));
								//Если МассивСтрока.Количество() > 1 Тогда
								//	Для Каждого стрОтр из МассивСтрока Цикл 
								//		Если стрОтр.НомерСтроки = мСтрокаДок.НомерСтроки Тогда 
								//			Продолжить;
								//		КонецЕсли; 
								//		Док.ОтражениеВУчете.Удалить(мСтрокаДок);
								//		мСтрокаДок = стрОтр;
								//		мСтрокаДок.Сумма = мСтрокаДок.Сумма + ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								//		Прервать;										
								//	КонецЦикла;
								
								//иначе
								//	мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);   							
								//КонецЕсли;
								//
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,,ТочностьРасчетовВМесяце) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								//О.Т. Аверсон 20.11.2017 № 1269
								Если РезФСЗНБГС.ДоляСпособаОтражения=Null Тогда
									Если СтрТЗСотрудникиПроверка = Неопределено Тогда 
										СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
									иначе
										Если СтрТЗСотрудникиПроверка.Сотрудник <> мСтрока.Сотрудник и СтрТЗСотрудникиПроверка.РезультатФСЗН <> Неопределено Тогда 
											СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
										КонецЕсли;     									
									КонецЕсли;
									СтрТЗСотрудникиПроверка.Сотрудник = мСтрока.Сотрудник;
									СтрТЗСотрудникиПроверка.РезультатФСЗН = мСтрокаДок.Сумма;
									МассивСотрПроверка = ТЗСотрудникиПроверка.НайтиСтроки(Новый Структура("Сотрудник",мСтрока.Сотрудник));  
									Если МассивСотрПроверка.Количество() = МассивПерехОтпуска.Количество() Тогда 
										СуммаНаПроверку = 0;
										Для Каждого стрФСЗН из МассивСотрПроверка Цикл 
											СуммаНаПроверку = СуммаНаПроверку + стрФСЗН.РезультатФСЗН;
										КонецЦикла;
										Если (СуммаНаПроверку <> РезФСЗНБГС.ФСЗН)
											И (СуммаНаПроверку <> 0 И РезФСЗНБГС.ФСЗН <> 0) Тогда //Аверсон 15.02.2022 КВВ СВФР-008740
											мСтрокаДок.Сумма = мСтрокаДок.Сумма + (РезФСЗНБГС.ФСЗН - СуммаНаПроверку)
										КонецЕсли;    								
									КонецЕсли;
								КонецЕсли;
								//О.Т. Аверсон 20.11.2017 № 1269
								
							иначе 
								Если РезФСЗНБГС.СчетДт <> Null Тогда
									
									мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
									ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
									
									//О.Т. Аверсон 26.01.2018 № 1502
									ЗапросОсн = Новый Запрос;
									ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТОсн
									|ИЗ
									|	&ТЧОсновные КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
									ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
									ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
									ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
									ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
									
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТОсн как ТЧ";
									
									
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда 
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
									иначе 
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|	ПОМЕСТИТЬ ВТДоп
										|ИЗ
										|	&ТЧДополит КАК ТЧ
										|ГДЕ
										|	ТЧ.СчетДт = &СчетДт
										|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
										|	И ТЧ.Сотрудник = &Сотрудник";
										ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
										ЗапросОсн.Выполнить();
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|ИЗ ВТДоп как ТЧ";
										РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
										Если РезЗапросОсн.Следующий() Тогда
											мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
											мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
											мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
											Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
												мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
									РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
									РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
									РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
									РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
									РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
									РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
									//О.Т. Аверсон 26.01.2018 № 1502
									
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												если РезФСЗНБГС.СубконтоДт1 = Неопределено тогда
													мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
													мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрокаДок1.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок1.СубконтоДт2		= Неопределено;
													мСтрокаДок1.СубконтоДт3		= Неопределено;
												иначе
													мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
													мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок1.СубконтоДт3		= Неопределено;
													
												КонецЕсли;
											иначе
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
												мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок1.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												если РезФСЗНБГС.СубконтоДтНУ1 = Неопределено тогда
													мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
													мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрокаДок1.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
													мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
												иначе													
													мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
													мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
													мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
												КонецЕсли;
											иначе
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
												мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок1.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
									//			МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,СубконтоДт3",мСтрокаДок1.СчетДт,мСтрокаДок1.СубконтоДт1,мСтрокаДок1.СубконтоДт2,мСтрока.СубконтоКт1,мСтрокаДок1.СубконтоДт3));
									//			Если МассивСтрока.Количество() > 1 Тогда
									//				Для Каждого стрОтр из МассивСтрока Цикл 
									//					Если стрОтр.НомерСтроки = мСтрокаДок1.НомерСтроки Тогда 
									//						Продолжить;
									//					КонецЕсли; 
									//					Док.ОтражениеВУчете.Удалить(мСтрокаДок1);
									//					мСтрокаДок1 = стрОтр;
									//					мСтрокаДок1.Сумма =  мСтрокаДок.Сумма + ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
									//					Прервать;										
									//				КонецЦикла;
									//
									//			иначе
									//				мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);   							
									//			КонецЕсли;
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц); 
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ФСЗН* ПроцентОтОбщейСуммы/100,,ТочностьРасчетовВМесяце) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце); 
									//Аверсон
									
									мСтрокаДок1.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
									мСтрокаДок1.СчетКтУСН = мСтрока.СчетКтУСН;
									мСтрокаДок1.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
									
									
								КонецЕсли;
								
								
								
							КонецЕсли;
							
							
							СчНомерСтроки = СчНомерСтроки+1;
						КонецЦикла;
						
						
						
						мСтрокаДок.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
						мСтрокаДок.СчетКтУСН = мСтрока.СчетКтУСН;
						мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
						
						ЗапросФСЗНБГС = Новый Запрос;
						ЗапросФСЗНБГС.Текст = 
						"ВЫБРАТЬ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						|ИЗ
						|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						|ГДЕ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт";
						
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
						ЗапросФСЗНБГС.УстановитьПараметр("СчетДт", мСтрока.СчетДт);					
						ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
								ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135   								
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								//О.Т. Аверсон 14.04.2017 № 547
								НомерСубконто = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								
								//О.Т. Аверсон 14.04.2017 № 547
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт1 = Неопределено тогда
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрокаДок1.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт2		 = Неопределено;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
											иначе
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
												
											КонецЕсли;
										иначе
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок1.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
									мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
								КонецЕсли;
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ1 = Неопределено тогда
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрокаДок1.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											иначе
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											КонецЕсли;
										иначе
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок1.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
									мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
									мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
								КонецЕсли;
								
								ЗапросФСЗНБГС = Новый Запрос;
								ЗапросФСЗНБГС.Текст = 
								"ВЫБРАТЬ
								|	ЕСНИсчисленный.ФСЗН,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
								|ИЗ
								|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
								|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
								|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
								|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
								|ГДЕ
								|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
								|	И ЕСНИсчисленный.Организация = &Организация
								|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
								|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
								|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
								
								ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
								ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								
								
								ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);	
								// +  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
								РезФСЗНБГС1 = ЗапросФСЗНБГС.Выполнить().Выбрать();
								
								Пока РезФСЗНБГС1.Следующий() Цикл 
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016((РезФСЗНБГС1.ФСЗН) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);;
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов((РезФСЗНБГС1.ФСЗН) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);;
									//Аверсон
									
								КонецЦикла;
								// -  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
								
								
								
								мСтрокаДок1.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
								мСтрокаДок1.СчетКтУСН = мСтрока.СчетКтУСН;
								мСтрокаДок1.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
							КонецЕсли;
							
						КонецЦикла;
						//если СуммаДопФСЗН<> 0 Тогда 
						//	мСтрокаДок = Док.ОтражениеВУчете.Добавить();
						//	мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
						//	мСтрокаДок.СубконтоДт1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
						//	мСтрокаДок.СубконтоДт2		= мСтрока.СубконтоКт1;
						//	мСтрокаДок.СубконтоДт3		= Неопределено;
						//	мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
						//	мСтрокаДок.СубконтоДтНУ1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
						//	мСтрокаДок.СубконтоДтНУ2		= мСтрока.СубконтоКт1;
						//	мСтрокаДок.СубконтоДтНУ3		= Неопределено;
						//	
						//	мСтрокаДок.СчетКт = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
						//	Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетБУ;//О.Т. Аверсон 25.03.2016 № 950
						//	СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
						//	мСтрокаДок.СубконтоКт1 = СубконтоКредита;
						//	мСтрокаДок.СчетКтНУ	= РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
						//	Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетНУ;//О.Т. Аверсон 25.03.2016 № 950
						//	
						//	мСтрокаДок.Сумма = СуммаДопФСЗН;
						//КонецЕсли;
						
						
						
						
						
					иначе	
						//Островская Татьяна 10.09.2013 № 16725
						
						//Аверсон ЕАЕ 16.06.2020 СВФР-006057
						//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(?(Результат > БазаОграниченияФСЗН ,БазаОграниченияФСЗН,Результат)*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,мСтрока.Месяц);//О.Т. Аверсон 14.03.2016 № 949 950
						мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(?(Результат > БазаОграниченияФСЗН ,БазаОграниченияФСЗН,Результат)*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,,ТочностьРасчетовВМесяце);//О.Т. Аверсон 14.03.2016 № 949 950
						//Аверсон
						
						//Островская Татьяна 10.09.2013 № 16725
						мСтрокаДок.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
						мСтрокаДок.СчетКтУСН = мСтрока.СчетКтУСН;
						мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
						
						//О.Т. Аверсон 09.12.2016 № 79
						Если Результат > БазаОграниченияФСЗН Тогда 
							если ПенсФондБудМес = 0 тогда
								РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(мСтрока.Месяц),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
								СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(мСтрока.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
							иначе
								РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(Док.ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
								СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(Док.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
							КонецЕсли;	
							БазаОграниченияФСЗН1 = СтруктураПенс1.ОграничениеПоДоходам*РазмерСреднейЗарплаты1;
							
							Если БазаОграниченияФСЗН1 < БазаОграниченияФСЗН Тогда 
								
								мСтрокаДок = Док.ОтражениеВУчете.Добавить();
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
								мСтрокаДок.СубконтоДт1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
								мСтрокаДок.СубконтоДт2		= мСтрока.СубконтоКт1;
								мСтрокаДок.СубконтоДт3		= Неопределено;
								мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
								мСтрокаДок.СубконтоДтНУ1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
								мСтрокаДок.СубконтоДтНУ2		= мСтрока.СубконтоКт1;
								мСтрокаДок.СубконтоДтНУ3		= Неопределено;
								
								мСтрокаДок.СчетКт = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
								Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетБУ;//О.Т. Аверсон 25.03.2016 № 950
								СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
								мСтрокаДок.СубконтоКт1 = СубконтоКредита;
								мСтрокаДок.СчетКтНУ	= РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
								Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетНУ;//О.Т. Аверсон 25.03.2016 № 950
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016((БазаОграниченияФСЗН1-БазаОграниченияФСЗН) *?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов((БазаОграниченияФСЗН1-БазаОграниченияФСЗН) *?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//О.Т. Аверсон 09.12.2016 № 79
					
				КонецЕсли;//Островская Татьяна 16.01.2014 № 17043
				//КонецЕсли; //Островская Татьяна 24.04.2013 № 16 ФСЗН ограничения
				
				//Госстрах
				СтрокаНаИзменение = Ложь;
				//Если не ЕстьРаспределение Тогда 
				//	МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,ПризнакПроводки",мСтрока.СчетДт,мСтрока.СубконтоДт1,мСтрока.СубконтоДт2,мСтрока.СубконтоКт1,Перечисления.ПризнакПроводки.ОбязательноеСтрахование));
				//	Если МассивСтрока.Количество() > 0 Тогда 
				//		мСтрокаДок = МассивСтрока[0];
				//		СтрокаНаИзменение = Истина;
				//	иначе
				//		мСтрокаДок = Док.ОтражениеВУчете.Добавить();   							
				//	КонецЕсли;						
				//иначе 						
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				//КонецЕсли;
				
				//О.Т. Аверсон 14.04.2017 № 547
				НомерСубконто = 0;
				Для Каждого стрВидыСубконто из мСтрока.СчетДт.ВидыСубконто Цикл 
					Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
						НомерСубконто = стрВидыСубконто.НомерСтроки;							
					КонецЕсли;  						
				КонецЦикла;
				НомерСубконтоНУ = 0;
				Для Каждого стрВидыСубконто из мСтрока.СчетДтНУ.ВидыСубконто Цикл 
					Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
						НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
					КонецЕсли;  						
				КонецЦикла;                  				
				//О.Т. Аверсон 14.04.2017 № 547
				
				//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
				если не СтатьяЗатратСтрах = Неопределено тогда
					если мСтрока.СубконтоДт3 = Неопределено тогда
						если мСтрока.СубконтоДт2 = Неопределено тогда
							если мСтрока.СубконтоДт1 = Неопределено тогда
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1 		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрокаДок.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
							иначе
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);
								мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
							КонецЕсли;
						иначе
							мСтрокаДок.СчетДт = мСтрока.СчетДт;
							мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);
							мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДт2);
							мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
							
						КонецЕсли;
					иначе
						
						мСтрокаДок.СчетДт = мСтрока.СчетДт;
						мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);
						мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДт2);
						мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;
						мСтрокаДок.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДт3);
						
						
					КонецЕсли;
				Иначе 
					мСтрокаДок.СчетДт = мСтрока.СчетДт;
					мСтрокаДок.СубконтоДт1 = мСтрока.СубконтоДт1;
					мСтрокаДок.СубконтоДт2 = мСтрока.СубконтоДт2;
					мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;	
				КонецЕсли;
				//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
				//О.Т. 13.02.2015 № 17778
				если ПараметрБез97Счета и ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ОтражениеЗарплатыВРеглУчете") Тогда 
					КоррСчет				=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
					Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)); //О.Т. Аверсон 24.03.2016 № 950
					
					мСтрокаДок.СчетКт = КоррСчет.СчетБУ;
					
					мСтрокаДок.СубконтоКт1 = КоррСчет.Контрагент;
					мСтрокаДок.СубконтоКт2 = КоррСчет.Договор;    					
				иначе 					
					мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
					
					//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
					мСтрокаДок.СубконтоКт1 = Справочники.РасходыБудущихПериодов.РБПНаЕСН;
					мСтрокаДок.СубконтоКт2 = мСтрока.СубконтоКт1;
					//Аверсон-софт, Островская Татьяна 05.06.2012 № 15447
					мСтрокаДок.СубконтоКт3 = мСтрока.СубконтоКт3;
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					
				КонецЕсли;
				//О.Т. 13.02.2015 № 17778
				
				если не СтатьяЗатратСтрах = Неопределено тогда
					если мСтрока.СубконтоДтНУ3 = Неопределено тогда
						если мСтрока.СубконтоДтНУ2 = Неопределено тогда
							если мСтрока.СубконтоДтНУ1 = Неопределено тогда
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1	= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрокаДок.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547; 
								
							иначе
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);
								мСтрокаДок.СубконтоДтНУ2	= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;  
							КонецЕсли;
						Иначе 
							мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
							мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);
							мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ2);
							мСтрокаДок.СубконтоДтНУ3	= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
							
						КонецЕсли;
					иначе
						мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
						мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);
						мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ2);
						мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;
						мСтрокаДок.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ3);
						
					КонецЕсли;
				иначе
					мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
					мСтрокаДок.СубконтоДтНУ1 = мСтрока.СубконтоДтНУ1;
					мСтрокаДок.СубконтоДтНУ2 = мСтрока.СубконтоДтНУ2;
					мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;	
				КонецЕсли;
				//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
				мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СубконтоКтНУ1 = мСтрока.СубконтоКтНУ1;
				мСтрокаДок.СубконтоКтНУ2 = мСтрока.СубконтоКтНУ2;
				мСтрокаДок.СубконтоКтНУ3 = мСтрока.СубконтоКтНУ3;
				мСтрокаДок.ОтражениеВУСН = мСтрока.ОтражениеВУСН;
				мСтрокаДок.СчетКтУСН = мСтрока.СчетКтУСН;
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;  
				Если Док.НалогиИзДокументаРасчетФзносовСФОТ и не ЗначениеЗаполнено(мСтрока.ВидРасчета.СпособОтраженияВБухучете) Тогда //О.Т. Аверсон 17.07.2018 № 2240 2е условие
					
					//Аверсон ЕАЕ 15.06.2020 СВФР-006057
					//(3) этот запрос вынесен из цикла
					//ЗапросФСЗНБГС = Новый Запрос;
					//ЗапросФСЗНБГС.Текст = 
					//"ВЫБРАТЬ
					//|	ЕСНИсчисленный.ОбязательноеСтрахование,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
					//|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
					//|ИЗ
					//|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
					//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
					//|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
					//|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
					//|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
					//|ГДЕ
					//|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
					//|	И ЕСНИсчисленный.Организация = &Организация
					//|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
					//|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
					//|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
					////Аверсон ЕАЕ 05.10.2017
					//|   И ЕСНИсчисленный.ОбязательноеСтрахование <> 0
					////Аверсон
					//|";						
					//
					//ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
					//ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
					//ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
					//ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
					//ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
					//ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",мСтрока.СчетДт);
					//
					//
					//ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
					//ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
					//!!!                   
					СтрОтбора = Новый Структура;
					СтрОтбора.Вставить("Сотрудник", мСтрока.Сотрудник);
					СтрОтбора.Вставить("Месяц", мСтрока.Месяц);
					СтрОтбора.Вставить("ПериодДействияНачало", мСтрока.ПериодДействияНачало);
					СтрОтбора.Вставить("СчетДтСтр", мСтрока.СчетДт);
					МассивСтрокФСЗНБГС = ТЗФСЗНБГС.НайтиСтроки(СтрОтбора);
					//Аверсон
					
					СчНомерСтроки = 1;
					
					//Аверсон ЕАЕ 17.06.2020 СВФР-006057
					//Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
					Для Каждого РезФСЗНБГС из МассивСтрокФСЗНБГС Цикл
					//Аверсон
						
						//О.Т. Аверсон 14.04.2017 № 547
						НомерСубконто = 0;
						Если РезФСЗНБГС.СчетДт <> Null Тогда
							Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
								Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
									НомерСубконто = стрВидыСубконто.НомерСтроки;							
								КонецЕсли;  						
							КонецЦикла;
							НомерСубконтоНУ = 0;
							Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
								Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
									НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
								КонецЕсли;  						
							КонецЦикла; 
						КонецЕсли;
						//О.Т. Аверсон 14.04.2017 № 547
						Если СчНомерСтроки = 1 Тогда  
							
							
							//О.Т. Аверсон 26.01.2018 № 1502
							ЗапросОсн = Новый Запрос;
							ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
							ЗапросОсн.Текст = 
							"ВЫБРАТЬ
							|	ТЧ.ФизЛицо,
							|	ТЧ.СубконтоДт1,
							|	ТЧ.СубконтоДт2,
							|	ТЧ.СубконтоДт3,
							|	ТЧ.СубконтоДтНУ1,
							|	ТЧ.СубконтоДтНУ2,
							|	ТЧ.СубконтоДтНУ3
							|	ПОМЕСТИТЬ ВТОсн
							|ИЗ
							|	&ТЧОсновные КАК ТЧ
							|ГДЕ
							|	ТЧ.СчетДт = &СчетДт
							|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
							|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
							|	И ТЧ.Сотрудник = &Сотрудник";
							ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
							ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
							ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
							ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
							ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
							
							ЗапросОсн.Выполнить();
							ЗапросОсн.Текст = 
							"ВЫБРАТЬ
							|	ТЧ.ФизЛицо,
							|	ТЧ.СубконтоДт1,
							|	ТЧ.СубконтоДт2,
							|	ТЧ.СубконтоДт3,
							|	ТЧ.СубконтоДтНУ1,
							|	ТЧ.СубконтоДтНУ2,
							|	ТЧ.СубконтоДтНУ3
							|ИЗ ВТОсн как ТЧ";
							
							
							РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
							Если РезЗапросОсн.Следующий() Тогда 
								мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
								мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
								мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
								Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
									мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
									мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
									мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
								КонецЕсли;
							иначе 
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТДоп
								|ИЗ
								|	&ТЧДополит КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТДоп как ТЧ";
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда
									мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
									
								КонецЕсли;
							КонецЕсли;
							РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок.СубконтоДт1;
							РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок.СубконтоДт2;
							РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок.СубконтоДт3;      			
							РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок.СубконтоДтНУ1;
							РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок.СубконтоДтНУ2;
							РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок.СубконтоДтНУ3;
							//О.Т. Аверсон 26.01.2018 № 1502
							
							
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								если не СтатьяЗатратСтрах = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
											если мСтрока.СубконтоДт1 = Неопределено тогда
												мСтрокаДок.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрокаДок.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт2		= Неопределено;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
											иначе
												мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
											КонецЕсли;
											
										иначе
											мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
											
										КонецЕсли;
									иначе
										
										мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3;
										мСтрокаДок.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);
									КонецЕсли;
								Иначе 
									мСтрокаДок.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
									мСтрокаДок.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
								КонецЕсли;
								
								если не СтатьяЗатратСтрах = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
											если мСтрока.СубконтоДтНУ1 = Неопределено тогда
												мСтрокаДок.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрокаДок.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
											иначе
												мСтрокаДок.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
												
											КонецЕсли;
										иначе
											мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									иначе
										мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 
										мСтрокаДок.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);
									КонецЕсли;
								Иначе 
									мСтрокаДок.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
									мСтрокаДок.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
								КонецЕсли;
								
								//МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,СубконтоДт3",мСтрокаДок.СчетДт,мСтрокаДок.СубконтоДт1,мСтрокаДок.СубконтоДт2,мСтрока.СубконтоКт1,мСтрокаДок.СубконтоДт3));
								//Если МассивСтрока.Количество() > 1 Тогда
								//	Для Каждого стрОтр из МассивСтрока Цикл 
								//		Если стрОтр.НомерСтроки = мСтрокаДок.НомерСтроки Тогда 
								//			Продолжить;
								//		КонецЕсли; 
								//		Док.ОтражениеВУчете.Удалить(мСтрокаДок);
								//		мСтрокаДок = стрОтр;
								//		мСтрокаДок.Сумма = мСтрокаДок.Сумма + ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								//		Прервать;										
								//	КонецЦикла;
								//иначе
								//	мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);   							
								//КонецЕсли;
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,,ТочностьРасчетовВМесяце) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								//О.Т. Аверсон 20.11.2017 № 1269
								Если РезФСЗНБГС.ДоляСпособаОтражения=Null Тогда
									Если СтрТЗСотрудникиПроверка = Неопределено Тогда 
										СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
									иначе
										Если СтрТЗСотрудникиПроверка.Сотрудник <> мСтрока.Сотрудник и СтрТЗСотрудникиПроверка.РезультатСтрах <> Неопределено Тогда 
											СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
										КонецЕсли;     									
									КонецЕсли;
									СтрТЗСотрудникиПроверка.Сотрудник = мСтрока.Сотрудник;
									СтрТЗСотрудникиПроверка.РезультатСтрах = мСтрокаДок.Сумма;
									МассивСотрПроверка = ТЗСотрудникиПроверка.НайтиСтроки(Новый Структура("Сотрудник",мСтрока.Сотрудник));  
									Если МассивСотрПроверка.Количество() = МассивПерехОтпуска.Количество() Тогда 
										СуммаНаПроверку = 0;
										Для Каждого стрСтрах из МассивСотрПроверка Цикл 
											СуммаНаПроверку = СуммаНаПроверку + стрСтрах.РезультатСтрах;
										КонецЦикла;
										Если СуммаНаПроверку <> РезФСЗНБГС.ОбязательноеСтрахование Тогда
											мСтрокаДок.Сумма = мСтрокаДок.Сумма + (РезФСЗНБГС.ОбязательноеСтрахование - СуммаНаПроверку)
										КонецЕсли;    								
									КонецЕсли;
								КонецЕсли;
								//О.Т. Аверсон 20.11.2017 № 1269      						
								
							иначе
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
							КонецЕсли;
							
						иначе
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
								ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт1 = Неопределено тогда
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрокаДок1.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт2 		= Неопределено;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
												
											иначе
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
											КонецЕсли;
										иначе
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
											
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3;
										мСтрокаДок1.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
									мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
								КонецЕсли;
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ1 = Неопределено тогда
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрокаДок1.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											иначе
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											КонецЕсли;
											
										иначе
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
											
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок1.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);
										
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
									мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
									мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
								КонецЕсли;
								
								//МассивСтрока = Док.ОтражениеВУчете.НайтиСтроки(Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоКт2,СубконтоДт3",мСтрокаДок1.СчетДт,мСтрокаДок1.СубконтоДт1,мСтрокаДок1.СубконтоДт2,мСтрока.СубконтоКт1,мСтрокаДок1.СубконтоДт3));
								//Если МассивСтрока.Количество() > 1 Тогда
								//	Для Каждого стрОтр из МассивСтрока Цикл 
								//		Если стрОтр.НомерСтроки = мСтрокаДок1.НомерСтроки Тогда 
								//			Продолжить;
								//		КонецЕсли; 
								//		Док.ОтражениеВУчете.Удалить(мСтрокаДок1);
								//		мСтрокаДок1 = стрОтр;
								//		мСтрокаДок1.Сумма = мСтрокаДок1.Сумма + ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								//		Прервать;										
								//	КонецЦикла;
								//	
								//иначе
								//	мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);   							
								//КонецЕсли;
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,мСтрока.Месяц) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц); 
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ОбязательноеСтрахование * ПроцентОтОбщейСуммы/100,,ТочностьРасчетовВМесяце) * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце); 
								//Аверсон
							КонецЕсли;
							
						КонецЕсли;
						
						
						
						СчНомерСтроки = СчНомерСтроки +1;
					КонецЦикла;
					
					ЗапросФСЗНБГС = Новый Запрос;
					ЗапросФСЗНБГС.Текст = 
					"ВЫБРАТЬ
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
					|ИЗ
					|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
					|ГДЕ
					|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
					|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
					|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт";
					
					ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
					ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
					ЗапросФСЗНБГС.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
					ЗапросФСЗНБГС.УстановитьПараметр("СчетДт", мСтрока.СчетДт);					
					ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
					Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
						Если РезФСЗНБГС.СчетДт <> Null Тогда
							
							//О.Т. Аверсон 14.04.2017 № 547
							НомерСубконто = 0;
							Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
								Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
									НомерСубконто = стрВидыСубконто.НомерСтроки;							
								КонецЕсли;  						
							КонецЦикла;
							НомерСубконтоНУ = 0;
							Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
								Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
									НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
								КонецЕсли;  						
							КонецЦикла;                  				
							//О.Т. Аверсон 14.04.2017 № 547
							
							мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
							ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
							
							//О.Т. Аверсон 26.01.2018 № 1502
							ЗапросОсн = Новый Запрос;
							ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
							ЗапросОсн.Текст = 
							"ВЫБРАТЬ
							|	ТЧ.ФизЛицо,
							|	ТЧ.СубконтоДт1,
							|	ТЧ.СубконтоДт2,
							|	ТЧ.СубконтоДт3,
							|	ТЧ.СубконтоДтНУ1,
							|	ТЧ.СубконтоДтНУ2,
							|	ТЧ.СубконтоДтНУ3
							|	ПОМЕСТИТЬ ВТОсн
							|ИЗ
							|	&ТЧОсновные КАК ТЧ
							|ГДЕ
							|	ТЧ.СчетДт = &СчетДт
							|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
							|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
							|	И ТЧ.Сотрудник = &Сотрудник";
							ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
							ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
							ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
							ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
							ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
							
							ЗапросОсн.Выполнить();
							ЗапросОсн.Текст = 
							"ВЫБРАТЬ
							|	ТЧ.ФизЛицо,
							|	ТЧ.СубконтоДт1,
							|	ТЧ.СубконтоДт2,
							|	ТЧ.СубконтоДт3,
							|	ТЧ.СубконтоДтНУ1,
							|	ТЧ.СубконтоДтНУ2,
							|	ТЧ.СубконтоДтНУ3
							|ИЗ ВТОсн как ТЧ";
							
							
							РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
							Если РезЗапросОсн.Следующий() Тогда 
								мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
								мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
								мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
								Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
									мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
									мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
									мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
								КонецЕсли;
							иначе 
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТДоп
								|ИЗ
								|	&ТЧДополит КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТДоп как ТЧ";
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда
									мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
									
								КонецЕсли;
							КонецЕсли;
							РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
							РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
							РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
							РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
							РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
							РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
							//О.Т. Аверсон 26.01.2018 № 1502
							
							
							если не СтатьяЗатратСтрах = Неопределено тогда
								если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт1 = Неопределено тогда
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт2 		= Неопределено;  
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
										иначе
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
											
										КонецЕсли;
										
									иначе
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
										
									КонецЕсли;
								иначе
									мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
									мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
									мСтрокаДок1.СубконтоДт3 = ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);
								КонецЕсли;
							Иначе 
								мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
								мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
								мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
							КонецЕсли;
							
							если не СтатьяЗатратФСЗН = Неопределено тогда
								если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ1 = Неопределено тогда
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрокаДок1.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт2 		= Неопределено;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
											
										иначе
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											
										КонецЕсли;
										
									иначе
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										
									КонецЕсли;
								иначе
									
									мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
									мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
									мСтрокаДок1.СубконтоДтНУ3 = ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);
								КонецЕсли;
							Иначе 
								мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
								мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
								мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
							КонецЕсли;
							
							ЗапросФСЗНБГС = Новый Запрос;
							ЗапросФСЗНБГС.Текст = 
							"ВЫБРАТЬ
							|	ЕСНИсчисленный.ОбязательноеСтрахование,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
							|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
							|ИЗ
							|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
							|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
							|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
							|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
							|ГДЕ
							|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
							|	И ЕСНИсчисленный.Организация = &Организация
							|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
							|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
							|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
							
							ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
							ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
							ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
							ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
							ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
							ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
							
							ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
							// +  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
							РезФСЗНБГС1 = ЗапросФСЗНБГС.Выполнить().Выбрать();
							Пока РезФСЗНБГС1.Следующий() Цикл 
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС1.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС1.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
							КонецЦикла;	
							// - Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
						КонецЕсли;
					КонецЦикла;
					
				иначе
					//Аверсон ЕАЕ 16.06.2020 СВФР-006057
					//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрокаРезультат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100, Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
					мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрокаРезультат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100, ,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
					//Аверсон
					
				КонецЕсли;
			иначе
				если не Док.НалогиИзДокументаРасчетФзносовСФОТ Тогда 
					СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
					СтавкаФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(мСтрока.ПериодДействияНачало, 
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения", Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).Размер;//О.Т. Аверсон 24.03.2016 № 950
					СтавкаФСЗНИнвалиды = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(мСтрока.ПериодДействияНачало, 
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",  Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения)).Размер;//О.Т. Аверсон 24.03.2016 № 950																					
					СтавкаЕдиныйПлатеж = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(мСтрока.ПериодДействияНачало, 
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",  Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ЕдиныйПлатеж,ВидНалогообложения)).Размер;//О.Т. Аверсон 24.03.2016 № 950
					СтавкаСтрах = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(мСтрока.ПериодДействияНачало, 
					Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)).Ставка;
					
					ЗапросСтатья = Новый Запрос;
					ЗапросСтатья.Текст = 
					"ВЫБРАТЬ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация,
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.СубконтоРезерваФСЗН3,
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.СубконтоРезерваСтрах3
					|ИЗ
					|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
					|ГДЕ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
					ЗапросСтатья.УстановитьПараметр("Организация",Док.Организация);
					Рез = ЗапросСтатья.Выполнить().Выбрать();
					СтатьяЗатратФСЗН = Неопределено;
					СтатьяЗатратСтрах = Неопределено;
					пока  Рез.Следующий() цикл
						СтатьяЗатратФСЗН = Рез.СубконтоРезерваФСЗН3;
						СтатьяЗатратСтрах = Рез.СубконтоРезерваСтрах3;
						
					КонецЦикла;
					//ФСЗН
					РезультатПоИнвалидам = ПроверкаФизлицоНаИнвалидность(мСтрока.СубконтоКт1,Док.ПериодРегистрации).Выгрузить();
					//если не СуммаФСЗННеВыводить Тогда //Островская Татьяна 24.04.2013 № 16 ФСЗН ограничения
					мСтрокаДок = Док.ОтражениеВУчете.Добавить();
					
					//О.Т. Аверсон 14.04.2017 № 547
					НомерСубконто = 0;
					Для Каждого стрВидыСубконто из мСтрока.СчетДт.ВидыСубконто Цикл 
						Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
							НомерСубконто = стрВидыСубконто.НомерСтроки;							
						КонецЕсли;  						
					КонецЦикла;
					НомерСубконтоНУ = 0;
					Для Каждого стрВидыСубконто из мСтрока.СчетДтНУ.ВидыСубконто Цикл 
						Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
							НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
						КонецЕсли;  						
					КонецЦикла;                  				
					//О.Т. Аверсон 14.04.2017 № 547 				
					
					
					//Аверсон-софт, Островская Татьяна 27.06.2012 № 15548
					если не СтатьяЗатратФСЗН = Неопределено тогда
						если мСтрока.СубконтоДт3 = Неопределено тогда
							если мСтрока.СубконтоДт2 = Неопределено тогда
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
							иначе
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);
								мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
							КонецЕсли;
						иначе
							
							мСтрокаДок.СчетДт = мСтрока.СчетДт;
							мСтрокаДок.СубконтоДт1 =?(НомерСубконто = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДт1);
							мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДт2);
							мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
						КонецЕсли;
					Иначе 
						мСтрокаДок.СчетДт = мСтрока.СчетДт;
						мСтрокаДок.СубконтоДт1 = мСтрока.СубконтоДт1;
						мСтрокаДок.СубконтоДт2 = мСтрока.СубконтоДт2;
						мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;
						
						
					КонецЕсли;
					
					если не СтатьяЗатратФСЗН = Неопределено тогда
						если мСтрока.СубконтоДтНУ3 = Неопределено тогда
							если мСтрока.СубконтоДтНУ2 = Неопределено тогда
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1	= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547; 
							Иначе 
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);
								мСтрокаДок.СубконтоДтНУ2	= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;   
							КонецЕсли;
						иначе
							мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
							мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ1);
							мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ2);
							мСтрокаДок.СубконтоДтНУ3	= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,мСтрока.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
						КонецЕсли;
					иначе
						мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
						мСтрокаДок.СубконтоДтНУ1 = мСтрока.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ2 = мСтрока.СубконтоДтНУ2;
						мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;
					КонецЕсли;					
					мСтрокаДок.СчетКт = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
					Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетБУ;//О.Т. Аверсон 24.03.2016 № 950
					мСтрокаДок.СубконтоКт1 = СубконтоКредита;
					мСтрокаДок.СчетКтНУ	= РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
					Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетНУ;//О.Т. Аверсон 24.03.2016 № 950
					Если  Док.Организация.ИНН = "806000046"  Тогда
						мСтрокаДок.СубконтоКт2 =	Док.ПодразделениеОрганизации; 
						Если СокрЛП(мСтрокаДок.СчетДт) = "26.07"  и СокрЛП(мСтрокаДок.СчетКт) = "69.01" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.09.2");
						ИНачеЕсли Лев(мСтрокаДок.СчетДт,2) = "26"  и СокрЛП(мСтрокаДок.СчетКт) = "69.01" Тогда
							Если Док.ПериодРегистрации >= Дата(2022,10,01) Тогда
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.09.1");
							Иначе
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.09");
							КонецЕсли;
						ИначеЕсли Лев(мСтрокаДок.СчетДт,5) = "91.09" и СокрЛП(мСтрокаДок.СчетКт) = "69.01" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.04.5");
							мСтрокаДок.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Расчеты по социальному страхованию (ДНПС)");   							
						ИначеЕсли Лев(мСтрокаДок.СчетДт,2) = "91" и СокрЛП(мСтрокаДок.СчетКт) = "69.01" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.04.5");
							мСтрокаДок.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Расчеты по социальному страхованию");
						КонецЕсли;
						
					КонецЕсли;
					СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(Док.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(Док.ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
					БазаОграниченияФСЗН = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
					
					Если Док.НалогиИзДокументаРасчетФзносовСФОТ и не ЗначениеЗаполнено(мСтрока.ВидРасчета.СпособОтраженияВБухучете) Тогда //О.Т. Аверсон 17.07.2018 № 2240 2е условие
						ЗапросФСЗНБГС = Новый Запрос;
						ЗапросФСЗНБГС.Текст = 
						"ВЫБРАТЬ
						|	ЕСНИсчисленный.ФСЗН,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						|ИЗ
						|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
						|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
						|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
						|ГДЕ
						|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						|	И ЕСНИсчисленный.Организация = &Организация
						|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
						|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
						|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
						
						ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
						ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
						ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
						ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",мСтрока.СчетДт);
						
						
						ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
						ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						
						СчНомерСтроки = 1;
						Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
							
							//О.Т. Аверсон 14.04.2017 № 547
							НомерСубконто = 0;
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;    
							КонецЕсли;
							//О.Т. Аверсон 14.04.2017 № 547
							
							Если СчНомерСтроки = 1  Тогда 
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,ПроцентОтОбщейСуммы,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,ПроцентОтОбщейСуммы,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								//О.Т. Аверсон 20.11.2017 № 1269
								Если РезФСЗНБГС.ДоляСпособаОтражения=Null Тогда 
									Если СтрТЗСотрудникиПроверка = Неопределено Тогда 
										СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
									иначе
										Если СтрТЗСотрудникиПроверка.Сотрудник <> мСтрока.Сотрудник и СтрТЗСотрудникиПроверка.РезультатФСЗН <> Неопределено Тогда 
											СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
										КонецЕсли;     									
									КонецЕсли; 								
									СтрТЗСотрудникиПроверка.Сотрудник = мСтрока.Сотрудник;
									СтрТЗСотрудникиПроверка.РезультатФСЗН = мСтрокаДок.Сумма;
									МассивСотрПроверка = ТЗСотрудникиПроверка.НайтиСтроки(Новый Структура("Сотрудник",мСтрока.Сотрудник));  
									Если МассивСотрПроверка.Количество() = МассивПерехОтпуска.Количество() Тогда 
										СуммаНаПроверку = 0;
										Для Каждого стрФСЗН из МассивСотрПроверка Цикл 
											СуммаНаПроверку = СуммаНаПроверку + стрФСЗН.РезультатФСЗН;
										КонецЦикла;
										Если СуммаНаПроверку <> РезФСЗНБГС.ФСЗН Тогда
											мСтрокаДок.Сумма = мСтрокаДок.Сумма + (РезФСЗНБГС.ФСЗН - СуммаНаПроверку)
										КонецЕсли;    								
									КонецЕсли;
								КонецЕсли;
								//О.Т. Аверсон 20.11.2017 № 1269
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								Если РезФСЗНБГС.СчетДт <> Null Тогда
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												мСтрокаДок.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт2 		= Неопределено;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
												
											иначе
												мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
												
											КонецЕсли;
										иначе
											мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												мСтрокаДок.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
												
											иначе
												мСтрокаДок.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
												
											КонецЕсли;
										иначе
											
											мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
								КонецЕсли;
								
							иначе
								Если РезФСЗНБГС.СчетДт <> Null Тогда
									мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
									ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
									
									//О.Т. Аверсон 26.01.2018 № 1502
									ЗапросОсн = Новый Запрос;
									ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТОсн
									|ИЗ
									|	&ТЧОсновные КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
									ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
									ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);
									ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
									ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
									
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТОсн как ТЧ";
									
									
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда 
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
									иначе 
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|	ПОМЕСТИТЬ ВТДоп
										|ИЗ
										|	&ТЧДополит КАК ТЧ
										|ГДЕ
										|	ТЧ.СчетДт = &СчетДт
										|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
										|	И ТЧ.Сотрудник = &Сотрудник";
										ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
										ЗапросОсн.Выполнить();
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|ИЗ ВТДоп как ТЧ";
										РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
										Если РезЗапросОсн.Следующий() Тогда
											мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
											мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
											мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
											Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
												мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
									РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
									РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
									РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
									РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
									РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
									РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
									//О.Т. Аверсон 26.01.2018 № 1502
									
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт2 		= Неопределено;
												мСтрокаДок1.СубконтоДт3 		= Неопределено; 
											иначе
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратФСЗН = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
												
											иначе
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
									//Аверсон
									
									мСтрокаДок1.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
								КонецЕсли;
							КонецЕсли;
							
							
							СчНомерСтроки = СчНомерСтроки+1;
						КонецЦикла;
						
						
						
						мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
						
						ЗапросФСЗНБГС = Новый Запрос;
						ЗапросФСЗНБГС.Текст = 
						"ВЫБРАТЬ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						|ИЗ
						|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						|ГДЕ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт";
						
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
						ЗапросФСЗНБГС.УстановитьПараметр("СчетДт", мСтрока.СчетДт);					
						ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								//О.Т. Аверсон 14.04.2017 № 547
								НомерСубконто = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;                  				
								//О.Т. Аверсон 14.04.2017 № 547
								
								мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
								ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 28.03.2019 № 4135
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт2 		= Неопределено;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
										иначе
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
									мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
								КонецЕсли;
								
								если не СтатьяЗатратФСЗН = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
											мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
										иначе
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратФСЗН,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
									мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
									мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
								КонецЕсли;
								
								ЗапросФСЗНБГС = Новый Запрос;
								ЗапросФСЗНБГС.Текст = 
								"ВЫБРАТЬ
								|	ЕСНИсчисленный.ФСЗН,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
								|ИЗ
								|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
								|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
								|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
								|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
								|ГДЕ
								|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
								|	И ЕСНИсчисленный.Организация = &Организация
								|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
								|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
								|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
								
								ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
								ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								
								
								ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
								
								// +  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
								РезФСЗНБГС1 = ЗапросФСЗНБГС.Выполнить().Выбрать();
								Пока РезФСЗНБГС1.Следующий() Цикл 
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС1.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС1.ФСЗН * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
									//Аверсон
									
								КонецЦикла;
								// -  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
								
								мСтрокаДок1.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
							КонецЕсли;
							
						КонецЦикла;
						
					иначе
						//Аверсон ЕАЕ 16.06.2020 СВФР-006057
						//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
						мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
						//Аверсон
						
						//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
						
						Если РезультатПоИнвалидам.Количество() = 0 Тогда
							//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
							
							//Аверсон ЕАЕ 16.06.2020 СВФР-006057
							//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
							мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
							//Аверсон
							
							//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
						Иначе
							Если РезультатПоИнвалидам[0].Группа = 1 тогда
								//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗНИнвалиды) / 100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗНИнвалиды) / 100,,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
								//Аверсон
								
								//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
								//Сообщить("инвалид: " + ТекСтрокаОтражениеВБУ.ФизЛицо.Наименование);
							Иначе
								//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(Мин(Результат,БазаОграниченияФСЗН) * ?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СтавкаФСЗН) / 100,,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949
								//Аверсон
								
								//Аверсон-софт, Островская Татьяна 17.07.2012 № 15614
							КонецЕсли;
						КонецЕсли;
						
						мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
						
						//О.Т. Аверсон 09.12.2016 № 79
						Если Результат > БазаОграниченияФСЗН Тогда 
							если ПенсФондБудМес = 0 тогда
								РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачалоМесяца(мСтрока.ПериодДействияНачало)-86400) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
								СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(мСтрока.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
							иначе
								РазмерСреднейЗарплаты1 = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(НачалоМесяца(Док.ПериодРегистрации)) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
								СтруктураПенс1 = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(Док.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
							КонецЕсли;	
							БазаОграниченияФСЗН1 = СтруктураПенс1.ОграничениеПоДоходам*РазмерСреднейЗарплаты1;
							
							Если БазаОграниченияФСЗН <> БазаОграниченияФСЗН1 Тогда 
								
								мСтрокаДок = Док.ОтражениеВУчете.Добавить();
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
								мСтрокаДок.СубконтоДт1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
								мСтрокаДок.СубконтоДт2		= мСтрока.СубконтоКт1;
								мСтрокаДок.СубконтоДт3		= Неопределено;
								мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
								мСтрокаДок.СубконтоДтНУ1		= Справочники.РасходыБудущихПериодов.РБПНаФСС;
								мСтрокаДок.СубконтоДтНУ2		= мСтрока.СубконтоКт1;
								мСтрокаДок.СубконтоДтНУ3		= Неопределено;
								
								мСтрокаДок.СчетКт = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
								Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетБУ;//О.Т. Аверсон 25.03.2016 № 950
								СубконтоКредита = Перечисления.ВидыПлатежейВГосБюджет.Налог;
								мСтрокаДок.СубконтоКт1 = СубконтоКредита;
								мСтрокаДок.СчетКтНУ	= РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации, Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",
								Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)).СчетНУ;//О.Т. Аверсон 25.03.2016 № 950
								
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016((БазаОграниченияФСЗН-БазаОграниченияФСЗН1) *?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов((БазаОграниченияФСЗН-БазаОграниченияФСЗН1) *?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					//О.Т. Аверсон 09.12.2016 № 79
					
					
					//КонецЕсли; //Островская Татьяна 24.04.2013 № 16 ФСЗН ограничения		
					//По Кт - 76.02 БелГоССтрах
					мСтрокаДок = Док.ОтражениеВУчете.Добавить();
					если не СтатьяЗатратСтрах = Неопределено тогда
						если мСтрока.СубконтоДт3 = Неопределено тогда
							если мСтрока.СубконтоДт2 = Неопределено тогда
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
							иначе
								мСтрокаДок.СчетДт = мСтрока.СчетДт;
								мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);
								мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
							КонецЕсли;
						иначе
							
							мСтрокаДок.СчетДт = мСтрока.СчетДт;
							мСтрокаДок.СубконтоДт1 = ?(НомерСубконто = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДт1);
							мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДт2);
							мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
						КонецЕсли;
					Иначе 
						мСтрокаДок.СчетДт = мСтрока.СчетДт;
						мСтрокаДок.СубконтоДт1 = мСтрока.СубконтоДт1;
						мСтрокаДок.СубконтоДт2 = мСтрока.СубконтоДт2;
						мСтрокаДок.СубконтоДт3 = мСтрока.СубконтоДт3;
						
						
					КонецЕсли;
					
					если не СтатьяЗатратСтрах = Неопределено тогда
						если мСтрока.СубконтоДтНУ3 = Неопределено тогда
							если мСтрока.СубконтоДтНУ2 = Неопределено тогда
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1	= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547; 
							Иначе 
								мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
								мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);
								мСтрокаДок.СубконтоДтНУ2	= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;   
							КонецЕсли;
						иначе
							мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
							мСтрокаДок.СубконтоДтНУ1 = ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ1);
							мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ2);
							мСтрокаДок.СубконтоДтНУ3	= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,мСтрока.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
						КонецЕсли;
					иначе
						мСтрокаДок.СчетДтНУ = мСтрока.СчетДтНУ;
						мСтрокаДок.СубконтоДтНУ1 = мСтрока.СубконтоДтНУ1;
						мСтрокаДок.СубконтоДтНУ2 = мСтрока.СубконтоДтНУ2;
						мСтрокаДок.СубконтоДтНУ3 = мСтрока.СубконтоДтНУ3;
					КонецЕсли;
					
					
					
					КоррСчет				=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
					Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)).СчетБУ;//О.Т. Аверсон 24.03.2016 № 950
					
					мСтрокаДок.СчетКт			=  КоррСчет;
					
					Субконто    = Новый Массив(3);
					Для тт=0 по 2 цикл
						Субконто[тт] = Неопределено;
					КонецЦикла;
					
					Для тт=0 по КоррСчет.ВидыСубконто.Количество()-1 Цикл
						Если НЕ Коррсчет.ВидыСубконто[тт].ВидСубконто = Неопределено тогда
							Если Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет")) Тогда
								Субконто[тт] = Перечисления.ВидыПлатежейВГосБюджет.Налог;
								
							ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
								Субконто[тт] = Док.Организация;
								
							ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Контрагенты")) Тогда
								Субконто[тт] =РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
								Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)).Контрагент;//О.Т. Аверсон 24.03.2016 № 950
								
							ИначеЕсли Коррсчет.ВидыСубконто[тт].ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКонтрагентов")) Тогда
								Субконто[тт] = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
								Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)).Договор;//О.Т. Аверсон 24.03.2016 № 950
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
					мСтрокаДок.СубконтоКт1		= Субконто[0];
					мСтрокаДок.СубконтоКт2		= Субконто[1];
					мСтрокаДок.СубконтоКт3		= Субконто[2];
					Если Док.Организация.ИНН = "806000046" Тогда
						ЗначПодр = Док.ПодразделениеОрганизации;
						ПодрПоиска = СтрЗаменить(ЗначПодр,"Представительство Государственного предприятия ""Стравита""","Белгосстрах");
						Если Док.ПодразделениеОрганизации.Код ="000000009" или Док.ПодразделениеОрганизации.Код ="000000015"  Тогда
							ПодрПоиска = "Ф-л Белгосстраха по г.Минску";
						КонецЕсли;
						//КонецЕсли;
						СпрКонтрагент = Справочники.Контрагенты.Выбрать();
						Пока СпрКонтрагент.Следующий()=1 Цикл 
							Если Найти(СпрКонтрагент.НаименованиеПолное,ПодрПоиска) Тогда
								НайденКонтрагент =СпрКонтрагент.Ссылка; 
							КонецЕсли;
						КонецЦикла; 
						СпрДогоора = Справочники.ДоговорыКонтрагентов.Выбрать();
						Пока СпрДогоора.Следующий()=1 Цикл 
							Если СпрДогоора.Владелец = НайденКонтрагент Тогда
								НайденДоговор =СпрДогоора.Ссылка; 
							КонецЕсли;
						КонецЦикла;  
						мСтрокаДок.СубконтоКт1 = НайденКонтрагент;
						мСтрокаДок.СубконтоКт2	    = НайденДоговор;
						Если СокрЛП(мСтрокаДок.СчетДт) = "26.07" и СокрЛП(мСтрокаДок.СчетКт) = "76.02" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23.2");
							Субконто3 = Справочники.Страхование_ВидыСтрахования.НайтиПоКоду("000000001");
							мСтрокаДок.СубконтоДт3 = Субконто3;  
						ИначеЕсли Лев(мСтрокаДок.СчетДт,2) = "26" и СокрЛП(мСтрокаДок.СчетКт) = "76.02" Тогда
							Если Док.ПериодРегистрации >= Дата(2022,10,01) Тогда
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23.1");
							Иначе
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23");
							КонецЕсли;
							Субконто3 = Справочники.Страхование_ВидыСтрахования.НайтиПоКоду("000000001");
							мСтрокаДок.СубконтоДт3 = Субконто3;  	
						ИначеЕсли Лев(мСтрокаДок.СчетДт,5) = "91.09" и СокрЛП(мСтрокаДок.СчетКт) = "76.02" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.04.5");
							мСтрокаДок.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Страховые взносы по страхованию от несч. сл. на производстве (ДНПС)");
						ИначеЕсли Лев(мСтрокаДок.СчетДт,2) = "91" и СокрЛП(мСтрокаДок.СчетКт) = "76.02" Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.04.5");
							мСтрокаДок.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Страховые взносы по страхованию от несч. сл. на производстве");
						КонецЕсли;
					КонецЕсли;
					
					
					мСтрокаДок.СчетКтНУ			=  РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации, 
					Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения)).СчетНУ;//О.Т. Аверсон 24.03.2016 № 950
					
					мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;  
					Если Док.НалогиИзДокументаРасчетФзносовСФОТ и не ЗначениеЗаполнено(мСтрока.ВидРасчета.СпособОтраженияВБухучете) Тогда //О.Т. Аверсон 17.07.2018 № 2240 2е условие
						ЗапросФСЗНБГС = Новый Запрос;
						ЗапросФСЗНБГС.Текст = 
						"ВЫБРАТЬ
						|	ЕСНИсчисленный.ОбязательноеСтрахование,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						|ИЗ
						|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
						|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
						|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
						|ГДЕ
						|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						|	И ЕСНИсчисленный.Организация = &Организация
						|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
						|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
						|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
						
						ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
						ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
						ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
						ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",мСтрока.СчетДт);
						
						ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);			
						ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						
						СчНомерСтроки = 1;
						Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
							//О.Т. Аверсон 14.04.2017 № 547
							НомерСубконто = 0;
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;  
							КонецЕсли;
							//О.Т. Аверсон 14.04.2017 № 547
							
							Если СчНомерСтроки = 1 Тогда 
								//Аверсон ЕАЕ 16.06.2020 СВФР-006057
								//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,ПроцентОтОбщейСуммы,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
								мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,ПроцентОтОбщейСуммы,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
								//Аверсон
								
								//О.Т. Аверсон 20.11.2017 № 1269
								Если РезФСЗНБГС.ДоляСпособаОтражения=Null Тогда
									Если СтрТЗСотрудникиПроверка = Неопределено Тогда 
										СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
									иначе
										Если СтрТЗСотрудникиПроверка.Сотрудник <> мСтрока.Сотрудник и СтрТЗСотрудникиПроверка.РезультатСтрах <> Неопределено Тогда 
											СтрТЗСотрудникиПроверка = ТЗСотрудникиПроверка.Добавить();
										КонецЕсли;     									
									КонецЕсли;
									
									СтрТЗСотрудникиПроверка.Сотрудник = мСтрока.Сотрудник;
									СтрТЗСотрудникиПроверка.РезультатСтрах = мСтрокаДок.Сумма;
									МассивСотрПроверка = ТЗСотрудникиПроверка.НайтиСтроки(Новый Структура("Сотрудник",мСтрока.Сотрудник));  
									Если МассивСотрПроверка.Количество() = МассивПерехОтпуска.Количество() Тогда 
										СуммаНаПроверку = 0;
										Для Каждого стрСтрах из МассивСотрПроверка Цикл 
											СуммаНаПроверку = СуммаНаПроверку + стрСтрах.РезультатСтрах;
										КонецЦикла;
										Если СуммаНаПроверку <> РезФСЗНБГС.ОбязательноеСтрахование Тогда
											мСтрокаДок.Сумма = мСтрокаДок.Сумма + (РезФСЗНБГС.ОбязательноеСтрахование - СуммаНаПроверку)
										КонецЕсли;    								
									КонецЕсли;
								КонецЕсли;
								//О.Т. Аверсон 20.11.2017 № 1269
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								Если РезФСЗНБГС.СчетДт <> Null Тогда
									если не СтатьяЗатратСтрах = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												мСтрокаДок.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт2 		= Неопределено;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
											иначе
												мСтрокаДок.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДт3 		= Неопределено;
											КонецЕсли;
										иначе
											мСтрокаДок.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратСтрах = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												мСтрокаДок.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
											иначе
												мСтрокаДок.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок.СубконтоДтНУ3 		= Неопределено;
											КонецЕсли;
										иначе
											мСтрокаДок.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
								КонецЕсли;
								
							иначе
								Если РезФСЗНБГС.СчетДт <> Null Тогда
									мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
									ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
									
									//О.Т. Аверсон 26.01.2018 № 1502
									ЗапросОсн = Новый Запрос;
									ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТОсн
									|ИЗ
									|	&ТЧОсновные КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
									ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
									ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2);
									ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
									ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
									
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТОсн как ТЧ";
									
									
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда 
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
									иначе 
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|	ПОМЕСТИТЬ ВТДоп
										|ИЗ
										|	&ТЧДополит КАК ТЧ
										|ГДЕ
										|	ТЧ.СчетДт = &СчетДт
										|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
										|	И ТЧ.Сотрудник = &Сотрудник";
										ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
										ЗапросОсн.Выполнить();
										ЗапросОсн.Текст = 
										"ВЫБРАТЬ
										|	ТЧ.ФизЛицо,
										|	ТЧ.СубконтоДт1,
										|	ТЧ.СубконтоДт2,
										|	ТЧ.СубконтоДт3,
										|	ТЧ.СубконтоДтНУ1,
										|	ТЧ.СубконтоДтНУ2,
										|	ТЧ.СубконтоДтНУ3
										|ИЗ ВТДоп как ТЧ";
										РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
										Если РезЗапросОсн.Следующий() Тогда
											мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
											мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
											мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
											Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
												мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
												мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
									РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
									РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
									РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
									РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
									РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
									РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
									//О.Т. Аверсон 26.01.2018 № 1502
									
									если не СтатьяЗатратСтрах = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт2 		= Неопределено;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
											иначе
												мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
												мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДт3 		= Неопределено;
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
											мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
									КонецЕсли;
									
									если не СтатьяЗатратСтрах = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
											если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											иначе
												мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
												мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
												мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											КонецЕсли;
										иначе
											
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
											мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
										КонецЕсли;
									Иначе 
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
										мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
									КонецЕсли;
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
									//Аверсон
								КонецЕсли;
							КонецЕсли;
							СчНомерСтроки = СчНомерСтроки+1;
						КонецЦикла;
						
						ЗапросФСЗНБГС = Новый Запрос;
						ЗапросФСЗНБГС.Текст = 
						"ВЫБРАТЬ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
						|ИЗ
						|	РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
						|ГДЕ
						|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник = &Сотрудник
						|	И РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт <> &СчетДт";
						
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(Док.ПериодРегистрации));
						ЗапросФСЗНБГС.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
						ЗапросФСЗНБГС.УстановитьПараметр("СчетДт", мСтрока.СчетДт);					
						ТЗРезФСЗНБГС = ЗапросФСЗНБГС.Выполнить().Выгрузить();
						Для Каждого РезФСЗНБГС из ТЗРезФСЗНБГС Цикл 
							Если РезФСЗНБГС.СчетДт <> Null Тогда
								
								//О.Т. Аверсон 14.04.2017 № 547
								НомерСубконто = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДт.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконто = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;
								НомерСубконтоНУ = 0;
								Для Каждого стрВидыСубконто из РезФСЗНБГС.СчетДтНУ.ВидыСубконто Цикл 
									Если стрВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
										НомерСубконтоНУ = стрВидыСубконто.НомерСтроки;							
									КонецЕсли;  						
								КонецЦикла;                  				
								//О.Т. Аверсон 14.04.2017 № 547
								
								мСтрокаДок1 = Док.ОтражениеВУчете.Добавить();
								ЗаполнитьЗначенияСвойств(мСтрокаДок1,мСтрокаДок);
								
								//О.Т. Аверсон 26.01.2018 № 1502
								ЗапросОсн = Новый Запрос;
								ЗапросОсн.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|	ПОМЕСТИТЬ ВТОсн
								|ИЗ
								|	&ТЧОсновные КАК ТЧ
								|ГДЕ
								|	ТЧ.СчетДт = &СчетДт
								|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
								|	И &Период МЕЖДУ ТЧ.ПериодДействияНачало И ТЧ.ПериодДействияКонец
								|	И ТЧ.Сотрудник = &Сотрудник";
								ЗапросОсн.УстановитьПараметр("Сотрудник",мСтрока.Сотрудник);
								ЗапросОсн.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								ЗапросОсн.УстановитьПараметр("СубконтоДт2",РезФСЗНБГС.СубконтоДт2); //О.Т. Аверсон 28.03.2019 № 4135
								ЗапросОсн.УстановитьПараметр("Период",мСтрока.ПериодДействияНачало);
								ЗапросОсн.УстановитьПараметр("ТЧОсновные",Док.ОсновныеНачисления);
								
								ЗапросОсн.Выполнить();
								ЗапросОсн.Текст = 
								"ВЫБРАТЬ
								|	ТЧ.ФизЛицо,
								|	ТЧ.СубконтоДт1,
								|	ТЧ.СубконтоДт2,
								|	ТЧ.СубконтоДт3,
								|	ТЧ.СубконтоДтНУ1,
								|	ТЧ.СубконтоДтНУ2,
								|	ТЧ.СубконтоДтНУ3
								|ИЗ ВТОсн как ТЧ";
								
								
								РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
								Если РезЗапросОсн.Следующий() Тогда 
									мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
									мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
									Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
										мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
										мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
									КонецЕсли;
								иначе 
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|	ПОМЕСТИТЬ ВТДоп
									|ИЗ
									|	&ТЧДополит КАК ТЧ
									|ГДЕ
									|	ТЧ.СчетДт = &СчетДт
									|	И ТЧ.СубконтоДт2 = &СубконтоДт2 //О.Т. Аверсон 28.03.2019 № 4135
									|	И ТЧ.Сотрудник = &Сотрудник";
									ЗапросОсн.УстановитьПараметр("ТЧДополит", Док.ДополнительныеНачисления);
									ЗапросОсн.Выполнить();
									ЗапросОсн.Текст = 
									"ВЫБРАТЬ
									|	ТЧ.ФизЛицо,
									|	ТЧ.СубконтоДт1,
									|	ТЧ.СубконтоДт2,
									|	ТЧ.СубконтоДт3,
									|	ТЧ.СубконтоДтНУ1,
									|	ТЧ.СубконтоДтНУ2,
									|	ТЧ.СубконтоДтНУ3
									|ИЗ ВТДоп как ТЧ";
									РезЗапросОсн = ЗапросОсн.Выполнить().Выбрать();
									Если РезЗапросОсн.Следующий() Тогда
										мСтрокаДок1.СубконтоДт1 = РезЗапросОсн.СубконтоДт1;
										мСтрокаДок1.СубконтоДт2 = РезЗапросОсн.СубконтоДт2;
										мСтрокаДок1.СубконтоДт3 = РезЗапросОсн.СубконтоДт3;
										Если ЗначениеЗаполнено(мСтрока.СчетДтНУ) Тогда
											мСтрокаДок1.СубконтоДтНУ1 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ2 = РезЗапросОсн.СубконтоДтНУ1;
											мСтрокаДок1.СубконтоДтНУ3 = РезЗапросОсн.СубконтоДтНУ1;
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								РезФСЗНБГС.СубконтоДт1 =  мСтрокаДок1.СубконтоДт1;
								РезФСЗНБГС.СубконтоДт2 =  мСтрокаДок1.СубконтоДт2;
								РезФСЗНБГС.СубконтоДт3 =  мСтрокаДок1.СубконтоДт3;      			
								РезФСЗНБГС.СубконтоДтНУ1 =  мСтрокаДок1.СубконтоДтНУ1;
								РезФСЗНБГС.СубконтоДтНУ2 =  мСтрокаДок1.СубконтоДтНУ2;
								РезФСЗНБГС.СубконтоДтНУ3 =  мСтрокаДок1.СубконтоДтНУ3;
								//О.Т. Аверсон 26.01.2018 № 1502
								
								
								если не СтатьяЗатратСтрах = Неопределено тогда
									если РезФСЗНБГС.СубконтоДт3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДт2 = Неопределено тогда
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт1		= ?(НомерСубконто = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт2 		= Неопределено;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
										иначе
											мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
											мСтрокаДок1.СубконтоДт2		= ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДт3 		= Неопределено;
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
										мСтрокаДок1.СубконтоДт2 = ?(НомерСубконто = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт2);
										мСтрокаДок1.СубконтоДт3 		= ?(НомерСубконто = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДт3);//О.Т. Аверсон 14.04.2017 № 547;
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДт = РезФСЗНБГС.СчетДт;
									мСтрокаДок1.СубконтоДт2 = РезФСЗНБГС.СубконтоДт2;
									мСтрокаДок1.СубконтоДт3 = РезФСЗНБГС.СубконтоДт3; 		
								КонецЕсли;
								
								если не СтатьяЗатратСтрах = Неопределено тогда
									если РезФСЗНБГС.СубконтоДтНУ3 = Неопределено тогда
										если РезФСЗНБГС.СубконтоДтНУ2 = Неопределено тогда
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ1		= ?(НомерСубконтоНУ = 1,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ1);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДтНУ2 		= Неопределено;
											мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
										иначе
											мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
											мСтрокаДок1.СубконтоДтНУ2		= ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);//О.Т. Аверсон 14.04.2017 № 547;
											мСтрокаДок1.СубконтоДтНУ3 		= Неопределено;
											
										КонецЕсли;
									иначе
										
										мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
										мСтрокаДок1.СубконтоДтНУ2 = ?(НомерСубконтоНУ = 2,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ2);
										мСтрокаДок1.СубконтоДтНУ3 		= ?(НомерСубконтоНУ = 3,СтатьяЗатратСтрах,РезФСЗНБГС.СубконтоДтНУ3);//О.Т. Аверсон 14.04.2017 № 547;
									КонецЕсли;
								Иначе 
									мСтрокаДок1.СчетДтНУ = РезФСЗНБГС.СчетДтНУ;
									мСтрокаДок1.СубконтоДтНУ2 = РезФСЗНБГС.СубконтоДтНУ2;
									мСтрокаДок1.СубконтоДтНУ3 = РезФСЗНБГС.СубконтоДтНУ3; 		
								КонецЕсли;
								
								ЗапросФСЗНБГС = Новый Запрос;
								ЗапросФСЗНБГС.Текст = 
								"ВЫБРАТЬ
								|	ЕСНИсчисленный.ОбязательноеСтрахование,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ДоляСпособаОтражения,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт КАК СчетДт,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт1 КАК СубконтоДт1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт2 КАК СубконтоДт2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДт3 КАК СубконтоДт3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ1 КАК СубконтоДтНУ1,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ2 КАК СубконтоДтНУ2,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СубконтоДтНУ3 КАК СубконтоДтНУ3,
								|	РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДтНУ КАК СчетДтНУ
								|ИЗ
								|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеОсновногоЗаработкаРаботниковОрганизаций КАК РаспределениеОсновногоЗаработкаРаботниковОрганизаций
								|		ПО ЕСНИсчисленный.ФизЛицо = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Физлицо
								|			И ЕСНИсчисленный.Организация = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.Сотрудник.Организация
								|			И ЕСНИсчисленный.ПериодВзаиморасчетов = РаспределениеОсновногоЗаработкаРаботниковОрганизаций.ПериодРегистрации
								|ГДЕ
								|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
								|	И ЕСНИсчисленный.Организация = &Организация
								|	И ЕСНИсчисленный.Период МЕЖДУ &Период И &Период1
								|	И (РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт = &СчетДт ИЛИ ЕстьNull(РаспределениеОсновногоЗаработкаРаботниковОрганизаций.СпособОтраженияВБухучете.СчетДт,1) = 1)
								|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1"; 						
								
								ЗапросФСЗНБГС.УстановитьПараметр("Организация", Док.Организация);
								ЗапросФСЗНБГС.УстановитьПараметр("Период", НачалоМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("Период1", КонецМесяца(мСтрока.Месяц));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов", НачалоМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("ПериодВзаиморасчетов1", КонецМесяца(мСтрока.ПериодДействияНачало));
								ЗапросФСЗНБГС.УстановитьПараметр("СчетДт",РезФСЗНБГС.СчетДт);
								
								ЗапросФСЗНБГС.УстановитьПараметр("ФизЛицо",мСтрока.Сотрудник.Физлицо);	
								// +  Аверсон СМА 14.05.2020 СВФР-005914 РезФСЗНБГС заменено на РезФСЗНБГС1
								РезФСЗНБГС1 = ЗапросФСЗНБГС.Выполнить().Выбрать();
								Пока РезФСЗНБГС1.Следующий() Цикл 
									
									//Аверсон ЕАЕ 16.06.2020 СВФР-006057
									//мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(РезФСЗНБГС1.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,мСтрока.Месяц);
									мСтрокаДок1.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(РезФСЗНБГС1.ОбязательноеСтрахование * ?(РезФСЗНБГС.ДоляСпособаОтражения=Null,100,РезФСЗНБГС.ДоляСпособаОтражения) / 100,,ТочностьРасчетовВМесяце);
									//Аверсон
								КонецЦикла;	
								//-  Аверсон СМА 14.05.2020 СВФР-005914  РезФСЗНБГС заменено на РезФСЗНБГС1
								
							КонецЕсли;
						КонецЦикла;
						
						
						
						
					иначе
						//Аверсон ЕАЕ 16.06.2020 СВФР-006057
						//мСтрокаДок.Сумма			= ОбщегоНазначения.ОкруглитьЗначение2016(мСтрокаРезультат * ?(ЕстьИндивидСтавка,СтавкаБГСИнд,СтавкаСтрах) / 100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949
						мСтрокаДок.Сумма			= ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрокаРезультат * ?(ЕстьИндивидСтавка,СтавкаБГСИнд,СтавкаСтрах) / 100,,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949
						//Аверсон
						
					КонецЕсли;
				КонецЕсли;
				Если Док.Организация.УчетБГС97 Тогда 					 					
					мНоваяСтрока = ТЗСчета.Добавить();
					мНоваяСтрока.Сотрудник = мСтрока.Сотрудник;
					мНоваяСтрока.Дт  = мСтрокаДок.СчетДт;
					Если Лев(мСтрокаДок.СчетДт,2) = "96"  и ЗначениеЗаполнено(СубконтоРезервБГС) Тогда
						мНоваяСтрока.Дт1 = СубконтоРезервБГС ;   						
					Иначе
						мНоваяСтрока.Дт1 = мСтрокаДок.СубконтоДт1  ;
					КОнецесли;
					мНоваяСтрока.Дт2 = мСтрокаДок.СубконтоДт2  ;
					мНоваяСтрока.Дт3 = мСтрокаДок.СубконтоДт3   ;
				КонецЕсли;
			КонецЕсли;  			
		КонецЦикла;
		Если Док.Организация.УчетБГС97 Тогда
			Для Каждого мСтрока Из тзПереходящиеОтпуска Цикл
				СтруктураПоиска = Новый Структура("Дт,Сотрудник");
				СтруктураПоиска.Дт = мСтрока.СчетДт;
				СтруктураПоиска.Сотрудник = мСтрока.Сотрудник;
				СтрокиТаблицы = ТЗСчета.НайтиСтроки(СтруктураПоиска);
				//Если СтрокиТаблицы.Количество() = 1 Тогда
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				мСтрокаДок.СчетДт = СтрокиТаблицы[0].Дт;
				мСтрокаДок.СубконтоДт1 = СтрокиТаблицы[0].Дт1;
				мСтрокаДок.СубконтоДт2 = СтрокиТаблицы[0].Дт2;
				мСтрокаДок.СубконтоДт3 = СтрокиТаблицы[0].Дт3;
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;  
				мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;   					
				мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СубконтоКт1 = Справочники.РасходыБудущихПериодов.РБПНаЕСН;
				мСтрокаДок.СубконтоКт2 = мСтрока.Сотрудник.Физлицо;
				//мСтрокаДок.сумма =  мСтрока.ОбязательноеСтрахование; 					
				//КонецЕсли;
				мСтрокаДок.сумма =  ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100, ,ТочностьРасчетов);			
				Если Док.Организация.ИНН = "806000046" Тогда						
					Если Лев(мСтрокаДок.СчетДт,2) = "26" Тогда
						Если мСтрока.Сотрудник.Физлицо.ДНПС Тогда
							мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23.2"); 
						Иначе
							Если мСтрока.Месяц >= Дата(2022,10,01) Тогда 
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23.1"); 
							Иначе
								мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("26.23"); 
							КонецЕсли;
						КонецЕсли;
						мСтрокаДок.СубконтоДт2 = СтатьяЗатратСтрах;
						Субконто3 = Справочники.Страхование_ВидыСтрахования.НайтиПоКоду("000000001");
						мСтрокаДок.СубконтоДт3 = Субконто3;
					ИначеЕсли Лев(мСтрокаДок.СчетДт,2) = "91" Тогда
						мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("91.04.5");
						мСтрокаДок.СубконтоДт1 = Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Страховые взносы по страхованию от несч. сл. на производстве");
						Если  ТипЗнч(мСтрокаДок.СубконтоДт3) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда 
							мСтрокаДок.СубконтоДт2 = мСтрокаДок.СубконтоДт3;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;  					
			КонецЦикла;   			
		КОнецЕсли;	
		
		//теперь разберемся с отзывами из отпуска
		ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Док.ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;//О.Т. Аверсон 08.08.2016
		зОтзыв = Новый Запрос;
		зОтзыв.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1) и &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|				ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сторно и &ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1, 0, 0, 0)
		|				ТОГДА ВЫБОР
		|						КОГДА ОсновныеНачисленияРаботниковОрганизаций.СторнируемыйДокумент.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		|								И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		|							ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
		|					КОНЕЦ
		|			ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ) КАК Результат,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.Регистратор = НачислениеОтпускаРаботникамОрганизаций.Ссылка
		|ГДЕ
		|	НачислениеОтпускаРаботникамОрганизаций.ПерерассчитываемыйДокумент <> &ПустаяСсылка
		|	И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация";
		Если ЗначениеЗаполнено(Док.ПодразделениеОрганизации) Тогда 
			зОтзыв.Текст = зОтзыв.Текст +"
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)";
		КонецЕсли;
		зОтзыв.Текст = зОтзыв.Текст +"
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник";
		
		зОтзыв.УстановитьПараметр("ПодразделениеОрганизации", Док.ПодразделениеОрганизации);
		зОтзыв.УстановитьПараметр("Организация", Док.Организация);
		зОтзыв.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Док.ПериодРегистрации));
		зОтзыв.УстановитьПараметр("ПустаяСсылка", Документы.НачислениеОтпускаРаботникамОрганизаций.ПустаяСсылка());
		тзОтзыв = зОтзыв.Выполнить().Выгрузить();
		
		Для Каждого мСтрока Из тзОтзыв Цикл
			
			
			зЗапись = Новый Запрос;
			зЗапись.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.НомерСтроки,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ФизЛицо,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДт,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт1,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт2,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДт3,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКт,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт1,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт2,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКт3,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетДтНУ,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ1,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ2,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоДтНУ3,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтНУ,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Результат,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ1,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ2,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СубконтоКтНУ3,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.СчетКтУСН,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ОтражениеВУСН,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияНачало,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ПериодДействияКонец,
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ДокументОснование
			|ИЗ
			|    Документ.ОтражениеЗарплатыВРеглУчете.ОсновныеНачисления КАК ОтражениеЗарплатыВРеглУчетеОсновныеНачисления
			|ГДЕ
			|    ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.Проведен = ИСТИНА
			|    И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Ссылка.ПериодРегистрации = &ПериодРегистрации
			|    И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.ВидРасчета = &ВидРасчета
			|    И ОтражениеЗарплатыВРеглУчетеОсновныеНачисления.Сотрудник = &Сотрудник";
			
			зЗапись.УстановитьПараметр("ПериодРегистрации", Док.ПериодРегистрации);
			зЗапись.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
			зЗапись.УстановитьПараметр("ВидРасчета", мСтрока.ВидРасчета);
			тзЗапись = зЗапись.Выполнить().Выгрузить();
			
			//О.Т. Аверсон 24.03.2016 № 950
			Если мСтрока.Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Док.Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = мСтрока.Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			
			ЗапросИндСтавкаНалогообл = Новый Запрос;
			ЗапросИндСтавкаНалогообл.Текст = 
			"ВЫБРАТЬ
			|	ИноеНалогообложениеПоСотрудникамСрезПоследних.БГС,
			|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ФСЗН
			|ИЗ
			|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ВидНалогообложения = &ВидНалогообложения
			|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
			
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Док.Организация);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", Док.ПериодРегистрации);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник); 
			РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
			ЕстьИндивидСтавка = Ложь;
			СтавкаФСЗНИнд = 0;
			СтавкаБГСИнд = 0;
			Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
				ЕстьИндивидСтавка = Истина;
				СтавкаФСЗНИнд = РезИндСтавкаНалогообл[0].ФСЗН;
				СтавкаБГСИнд = РезИндСтавкаНалогообл[0].БГС;
			КонецЕсли;
			СчетФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(Док.ПериодРегистрации,
			Новый Структура("Организация,ВидОтчисления,ВидНалогообложения", Док.Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения)); //О.Т. Аверсон 24.03.2016 № 950
			СчетБГС = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(Док.ПериодРегистрации,
			Новый Структура("Организация,ВидНалогообложения", Док.Организация,ВидНалогообложения));//О.Т. Аверсон 24.03.2016 № 950
			//О.Т. Аверсон 24.03.2016 № 950
			
			
			Если тзЗапись.Количество() > 0 Тогда
				//корректирующая проводка счета затрат (26)
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.Сумма = -мСтрока.Результат;
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.Начисление;
				
				//ФСЗН
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетКт = СчетФСЗН.СчетБу;
				мСтрокаДок.СчетКтНУ = СчетФСЗН.СчетНу;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(-мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,Док.ПериодРегистрации); //О.Т. Аверсон 14.03.2016 № 949 950
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(-мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,,ТочностьРасчетов); //О.Т. Аверсон 14.03.2016 № 949 950
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
				
				//Госстрах
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетКт = СчетБГС.СчетБу;
				мСтрокаДок.СчетКтНУ = СчетБГС.СчетНу;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(-мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100,Док.ПериодРегистрации);//О.Т. Аверсон 14.03.2016 № 949 950
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(-мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100,,ТочностьРасчетов);//О.Т. Аверсон 14.03.2016 № 949 950
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;
				
				//корректирующая проводка отпуска 97
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.Сумма = мСтрока.Результат;
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.Начисление;
				
				//ФСЗН
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов69;
				мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СчетКт = СчетФСЗН.СчетБу;
				мСтрокаДок.СчетКтНУ = СчетФСЗН.СчетНу;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100, Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100, ,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
				
				//Госстрах
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетДт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов76;
				мСтрокаДок.СчетДтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СчетКт = СчетБГС.СчетБу;
				мСтрокаДок.СчетКтНУ = СчетБГС.СчетНу;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100, Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100,  ,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;
				
				//корректирующая проводка сторнирование (26) 97
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				мСтрокаДок.Сумма = мСтрока.Результат;
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.Начисление;
				
				//ФСЗН
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов69;
				мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100, Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949 950
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаФСЗНИнд,СчетФСЗН.Размер)/100,   ,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949 950
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ФондСоциальнойЗащиты;
				
				//Госстрах
				мСтрокаДок = Док.ОтражениеВУчете.Добавить();
				ЗаполнитьЗначенияСвойств(мСтрокаДок, тзЗапись[0]);
				мСтрокаДок.СчетКт = ПланыСчетов.Хозрасчетный.РасходыНаОплатуТрудаБудущихПериодов76;
				мСтрокаДок.СчетКтНУ = ПланыСчетов.Налоговый.РасходыНаОплатуТрудаБудущихПериодов;
				
				//Аверсон ЕАЕ 16.06.2020 СВФР-006057
				//мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100,Док.ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949
				мСтрокаДок.Сумма = ОбщегоНазначения.ОкруглитьЗначение2016СТочностьюРасчетов(мСтрока.Результат*?(ЕстьИндивидСтавка,СтавкаБГСИнд,СчетБГС.Ставка)/100,   ,ТочностьРасчетов);//О.Т. Аверсон 15.03.2016 № 949
				//Аверсон
				
				мСтрокаДок.ПризнакПроводки = Перечисления.ПризнакПроводки.ОбязательноеСтрахование;
			КонецЕсли;
		КонецЦикла;
		
		//Аверсон ЕАЕ 12.03.2024 СВФР-012459
		//Удалим строки с нулевой суммой
		ПоследнийНомерСтроки = Док.ОтражениеВУчете.Количество();
		Если ПоследнийНомерСтроки > 0 Тогда
			ПоследнийИндекс = ПоследнийНомерСтроки - 1;
			Для н = -ПоследнийИндекс По 0 Цикл
				ТекИндекс = -н;
				ТекСтр = Док.ОтражениеВУчете[ТекИндекс];
				Если ТекСтр.Сумма = 0 Тогда
					Док.ОтражениеВУчете.Удалить(ТекСтр);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Аверсон СВФР-012459
	КонецПроцедуры 
	
	Функция ПроверкаФизлицоНаИнвалидность(ФизЛицо,ПериодРегистрации)
		Запрос = Новый Запрос;
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Период,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ДатаВыдачи,
		|	ВЫБОР
		|		КОГДА СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности = &парамГруппа1
		|				ИЛИ СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности = &парамГруппа2
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Группа,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
		|ИЗ
		|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&Период, ) КАК СведенияОбИнвалидностиФизлицСрезПоследних
		|ГДЕ
		|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность
		|	И СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо = &Физлицо";
		
		Запрос.УстановитьПараметр("парамГруппа1","I");
		Запрос.УстановитьПараметр("парамГруппа2","II");
		Запрос.УстановитьПараметр("Период",КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Физлицо",Физлицо);
		
		Запрос.Текст = ТекстЗапроса;
		
		Возврат  Запрос.Выполнить();
		
	КонецФункции
	
	
	
	
	Функция ПроверитьИОтрегулироватьПеремещение(ДатаНачала, Сотрудник, Организация, ЭтотДокумент, СтрокаТабЧасти, ВидРасчета=Неопределено) Экспорт
		
		Отказ = Ложь;
		
		//Проверяем на хронологию перемещений
		
		Запрос = Новый Запрос;
		Если ЭтотДокумент.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка КАК Документ,
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник
			|ИЗ
			|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|		ПО КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка = РаботникиОрганизаций.Регистратор
			|ГДЕ
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.Организация = &Организация
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка <> &ЭтотДокумент
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала > &Период";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПлановыеНачисленияРаботниковОрганизаций.Регистратор КАК Документ,
			|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
			|ГДЕ
			|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
			|	И ПлановыеНачисленияРаботниковОрганизаций.Организация = &Организация
			|	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = &ВидРасчета
			|	И ПлановыеНачисленияРаботниковОрганизаций.Регистратор <> &ЭтотДокумент
			|	И ПлановыеНачисленияРаботниковОрганизаций.Период > &Период";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Период", ДатаНачала);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотДокумент.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
				Если Не (РольДоступна("ПолныеПрава") или РольДоступна("ПолныеПраваБезЭкономики") //Тогда //О.Т. Аверсон 17.03.2017 № 335    
				Или (Выборка.Документ.Метаданные().Имя = "КадровоеПеремещениеОрганизаций") и РольДоступна("ОТиЗ")) Тогда  
				Отказ = Истина;
				Сообщить("Нарушение хронологического порядка документов !!!"+Символы.ПС+"Проведение документа возможно только после отмены проведения документов с более поздней датой проведения!"+Символы.ПС+
				"по сотруднику "+Строка(Выборка.Сотрудник)+" "+Строка(Выборка.Документ));
				Возврат Отказ;
			КонецЕсли;
		КонецЦикла;
		
		//Проверяем на некорректные попадание дат начала и окончания перемещения
		Если ЭтотДокумент.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Или 
			ЭтотДокумент.Метаданные().Имя = "УвольнениеИзОрганизаций" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка КАК Документ
			|ИЗ
			|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
			|ГДЕ
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Временно
			|	И &Период МЕЖДУ КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала И КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.Организация = &Организация
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка <> &ЭтотДокумент
			|	И (НЕ КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПометкаУдаления)";
			
			Запрос.УстановитьПараметр("Период", ДатаНачала);
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ЭтотДокумент", ЭтотДокумент.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не (РольДоступна("ПолныеПрава") или РольДоступна("ПолныеПраваБезЭкономики")) Тогда //О.Т. Аверсон 17.03.2017 № 335
					Отказ = Истина;
					Сообщить("Документ противоречит по датам перемещения с документом "+Строка(Выборка.Документ));
				КонецЕсли;
			КонецЦикла;
			
			//Определяем признак другого перемещения
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка КАК Документ
			|ИЗ
			|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
			|ГДЕ
			|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник = &Сотрудник
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Временно
			|	И НАЧАЛОПЕРИОДА(КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.Организация = &Организация
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка <> &Документ
			|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.Проведен";
			
			Запрос.УстановитьПараметр("Период", ДатаНачала - 86400);
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Документ", ЭтотДокумент.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Документ.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Тогда
					мДокумент = Выборка.Документ.ПолучитьОбъект();
					НайденнаяСтрока = мДокумент.РаботникиОрганизации.Найти(Сотрудник, "Сотрудник");
					//Определяем виды начислений по которым были изменения
					ЗапросН = Новый Запрос;
					ЗапросН.Текст = 
					"ВЫБРАТЬ
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Сотрудник,
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.ВидРасчета,
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Показатель1,
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Показатель2,
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Показатель3,
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Показатель4
					|ИЗ
					|	Документ.КадровоеПеремещениеОрганизаций.ОсновныеНачисления КАК КадровоеПеремещениеОрганизацийОсновныеНачисления
					|ГДЕ
					|	КадровоеПеремещениеОрганизацийОсновныеНачисления.Ссылка = &Ссылка
					|	И КадровоеПеремещениеОрганизацийОсновныеНачисления.Сотрудник = &Сотрудник
					|	И КадровоеПеремещениеОрганизацийОсновныеНачисления.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять)
					|	И (НЕ КадровоеПеремещениеОрганизацийОсновныеНачисления.ВидРасчета В (&ВидыРасчета))";
					
					ЗапросН.УстановитьПараметр("Ссылка", мДокумент.Ссылка);
					ЗапросН.УстановитьПараметр("Сотрудник", Сотрудник);
					Список = Новый СписокЗначений;
					Список.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
					Список.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата);
					Список.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
					ЗапросН.УстановитьПараметр("ВидыРасчета", Список);
					ВыборкаН = ЗапросН.Выполнить().Выбрать();
					
					//изменяем вид действия с начислением для того чтобы при временном перемещении вернулось прежнее значение	
					Если не ЭтотДокумент.Метаданные().Имя = "УвольнениеИзОрганизаций" Тогда //О.Т. Аверсон 07.06.2016 № 1216
						Пока ВыборкаН.Следующий() Цикл
							СтрокиОсновныхНачислений = ЭтотДокумент.ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник, ВидРасчета", ВыборкаН.Сотрудник, ВыборкаН.ВидРасчета));
							Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
								Если СтрокиОсновныхНачислений[0].Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
									СтрокиОсновныхНачислений[0].Действие = Перечисления.ВидыДействияСНачислением.Изменить;	
								КонецЕсли;
							Иначе
								ЗапросНачислений = Новый Запрос;
								ЗапросНачислений.Текст = 
								"ВЫБРАТЬ
								|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1,
								|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2,
								|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель3,
								|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель4
								|ИЗ
								|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, (НЕ временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
								|ГДЕ
								|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
								|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
								|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = &ВидРасчета";
								ЗапросНачислений.УстановитьПараметр("Организация", мДокумент.Организация);
								ЗапросНачислений.УстановитьПараметр("Период", ДатаНачала - 86400);
								ЗапросНачислений.УстановитьПараметр("Сотрудник", Сотрудник);
								ЗапросНачислений.УстановитьПараметр("ВидРасчета", ВыборкаН.ВидРасчета);
								ВыборкаНачислений = ЗапросНачислений.Выполнить().Выгрузить();
								
								НоваяСтрока = ЭтотДокумент.ОсновныеНачисления.Добавить();
								НоваяСтрока.Сотрудник = ВыборкаН.Сотрудник;
								НоваяСтрока.ФизЛицо = ВыборкаН.Сотрудник.ФизЛицо;
								НоваяСтрока.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
								НоваяСтрока.ВидРасчета = ВыборкаН.ВидРасчета;
								Если ВыборкаНачислений.Количество() = 0 Тогда
									НоваяСтрока.Показатель1 = ВыборкаН.Показатель1;
									НоваяСтрока.Показатель2 = ВыборкаН.Показатель2;
									НоваяСтрока.Показатель3 = ВыборкаН.Показатель3;
									НоваяСтрока.Показатель4 = ВыборкаН.Показатель4;
								Иначе
									НоваяСтрока.Показатель1 = ВыборкаНачислений[0].Показатель1;
									НоваяСтрока.Показатель2 = ВыборкаНачислений[0].Показатель2;
									НоваяСтрока.Показатель3 = ВыборкаНачислений[0].Показатель3;
									НоваяСтрока.Показатель4 = ВыборкаНачислений[0].Показатель4;
								КонецЕсли
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если НайденнаяСтрока = Неопределено Тогда
						Предупреждение("не найден!");
					Иначе
						НайденнаяСтрока.ДругоеПеремещение = Истина;
						НайденнаяСтрока.Документ = ЭтотДокумент.Ссылка;
						мДокумент.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли
				КонецЕсли;
			КонецЦикла;
			
			//Корректность перемещения с подразделений и должностей
			
			Если ЭтотДокумент.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Тогда
				Если (Не (РольДоступна("ПолныеПрава") или РольДоступна("ПолныеПраваБезЭкономики"))) И  //О.Т. Аверсон 17.03.2017 № 335
					СокрЛП(СтрокаТабЧасти.ПодразделениеОрганизации.Родитель.Код) <> "1700" И
					ДатаНачала > '20091014000000' Тогда
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор КАК Документ,
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
					|ИЗ
					|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
					|			&Период,
					|			Сотрудник = &Сотрудник
					|				И Регистратор <> &Ссылка
					|				И ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних";
					
					Запрос.УстановитьПараметр("Ссылка",	ЭтотДокумент.Ссылка);
					Запрос.УстановитьПараметр("Период",		ДатаНачала);
					Запрос.УстановитьПараметр("Сотрудник",	Сотрудник);
					ВыборкаРегистр = Запрос.Выполнить().Выбрать();
					ВыборкаРегистр.Следующий();
					
					Запрос.Текст =
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВЫБОР
					|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &Период
					|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
					|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
					|	КОНЕЦ КАК ПодразделениеОрганизации,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &Период
					|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
					|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность
					|	КОНЕЦ КАК Должность,
					|	РаботникиОрганизацииСрезПоследних.Регистратор КАК Документ,
					|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ВидРасчета
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
					|			&Период,
					|			Сотрудник = &Сотрудник
					|				И Регистратор <> &Ссылка) КАК РаботникиОрганизацииСрезПоследних
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
					|		ПО РаботникиОрганизацииСрезПоследних.Регистратор = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка";
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Если СтрокаТабЧасти.Должность = Выборка.Должность И 
							СтрокаТабЧасти.ПодразделениеОрганизации = Выборка.ПодразделениеОрганизации И
							СтрокаТабЧасти.ВидРасчета = Выборка.ВидРасчета И
							?(ВыборкаРегистр.Количество()=0, Истина, СтрокаТабЧасти.ВидРасчета = ВыборкаРегистр.ВидРасчета) И
							СтрокаТабЧасти.Временно Тогда
							Отказ = Истина;
							Сообщить("Ошибка перевода сотрудника! Подразделение и должность идентичны по документу"+Символы.ПС+Строка(Выборка.Документ));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Отказ;
		
	КонецФункции
	
	Процедура ОткрытьФормуВыбораПерерассчитываемогоДокументаСТекущимМесяцем(Владелец, СтандартнаяОбработка, ДокументПерерасчет, Ключ = Неопределено) Экспорт
		
		ИмяДокумента = ДокументПерерасчет.Метаданные().Имя;
		ФормаВыбора = Документы[ИмяДокумента].ПолучитьФормуВыбора(, Владелец, Ключ);
		
		ФормаВыбора.Отбор.Организация.Использование	= Истина;
		ФормаВыбора.Отбор.Организация.ВидСравнения 	= ВидСравнения.Равно;
		ФормаВыбора.Отбор.Организация.Значение	 	= ДокументПерерасчет.Организация;
		
		ФормаВыбора.Отбор.ПериодРегистрации.Использование	= Истина;
		ФормаВыбора.Отбор.ПериодРегистрации.ВидСравнения 	= ВидСравнения.МеньшеИлиРавно;
		ФормаВыбора.Отбор.ПериодРегистрации.Значение	 	= ДокументПерерасчет.ПериодРегистрации;
		
		ФормаВыбора.Открыть();
		СтандартнаяОбработка = Ложь;
		
	КонецПроцедуры
	
	Функция ПроверкаВведенныхДокументов(мОбъект) Экспорт
		
		Если мОбъект.Метаданные().Имя = "НачислениеПоБольничномуЛисту" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачислениеПоБольничномуЛисту.Ссылка
			|ИЗ
			|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
			|ГДЕ
			|	НачислениеПоБольничномуЛисту.НомерВходящегоДокумента = &НомерВходящегоДокумента
			|	И НачислениеПоБольничномуЛисту.Сотрудник = &Сотрудник
			|	И НачислениеПоБольничномуЛисту.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
			|	И НачислениеПоБольничномуЛисту.Проведен
			|	И НачислениеПоБольничномуЛисту.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("НачДата", НачалоГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("КонДата", КонецГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("Сотрудник", мОбъект.Сотрудник);
			Запрос.УстановитьПараметр("Ссылка", мОбъект.Ссылка);
			Запрос.УстановитьПараметр("НомерВходящегоДокумента", мОбъект.НомерВходящегоДокумента);
			Отказ = (Запрос.Выполнить().Выбрать().Количество() <> 0);
			//О.Т. 08.10.2014 № 17616	
		ИначеЕсли мОбъект.Метаданные().Имя = "НачислениеПоБольничномуЛистуПоДоговорамПодряда" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачислениеПоБольничномуЛистуПоДоговорамПодряда.Ссылка
			|ИЗ
			|	Документ.НачислениеПоБольничномуЛистуПоДоговорамПодряда КАК НачислениеПоБольничномуЛистуПоДоговорамПодряда
			|ГДЕ
			|	НачислениеПоБольничномуЛистуПоДоговорамПодряда.НомерВходящегоДокумента = &НомерВходящегоДокумента
			|	И НачислениеПоБольничномуЛистуПоДоговорамПодряда.Сотрудник = &Сотрудник
			|	И НачислениеПоБольничномуЛистуПоДоговорамПодряда.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
			|	И НачислениеПоБольничномуЛистуПоДоговорамПодряда.Проведен
			|	И НачислениеПоБольничномуЛистуПоДоговорамПодряда.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("НачДата", НачалоГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("КонДата", КонецГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("Сотрудник", мОбъект.Сотрудник);
			Запрос.УстановитьПараметр("Ссылка", мОбъект.Ссылка);
			Запрос.УстановитьПараметр("НомерВходящегоДокумента", мОбъект.НомерВходящегоДокумента);
			Отказ = (Запрос.Выполнить().Выбрать().Количество() <> 0);
			//О.Т. 08.10.2014 № 17616		
		ИначеЕсли мОбъект.Метаданные().Имя = "НачислениеОтпускаРаботникамОрганизаций" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачислениеОтпускаРаботникамОрганизаций.Ссылка
			|ИЗ
			|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций
			|ГДЕ
			|	НачислениеОтпускаРаботникамОрганизаций.Сотрудник = &Сотрудник
			|	И НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации = &ПериодРегистрации
			|	И НачислениеОтпускаРаботникамОрганизаций.Проведен
			|	И НачислениеОтпускаРаботникамОрганизаций.Ссылка <> &Ссылка";
			
			//		Запрос.УстановитьПараметр("НачДата", НачалоГода(мОбъект.ПериодРегистрации));
			//		Запрос.УстановитьПараметр("КонДата", КонецГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("ПериодРегистрации", мОбъект.ПериодРегистрации);
			Запрос.УстановитьПараметр("Ссылка", мОбъект.Ссылка);
			Запрос.УстановитьПараметр("Сотрудник", мОбъект.Сотрудник);
			//		Запрос.УстановитьПараметр("ДатаНачалаОсновногоОтпуска", мОбъект.ДатаНачалаОсновногоОтпуска);
			//		Запрос.УстановитьПараметр("ДатаОкончанияОсновногоОтпуска", мОбъект.ДатаОкончанияОсновногоОтпуска);
			Если (Запрос.Выполнить().Выбрать().Количество() <> 0) Тогда
				Предупреждение("Похожий документ уже введен");
			КонецЕсли;
			
			Отказ = Ложь;
			
		ИначеЕсли мОбъект.Метаданные().Имя = "ОплатаПоСреднемуЗаработку" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОплатаПоСреднемуЗаработку.Ссылка
			|ИЗ
			|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
			|ГДЕ
			|	ОплатаПоСреднемуЗаработку.Сотрудник = &Сотрудник
			|	И ОплатаПоСреднемуЗаработку.ПериодРегистрации МЕЖДУ &НачДата И &КонДата
			|	И ОплатаПоСреднемуЗаработку.ДатаНачала = &ДатаНачала
			|	И ОплатаПоСреднемуЗаработку.ДатаОкончания = &ДатаОкончания
			|	И ОплатаПоСреднемуЗаработку.Проведен
			|	И ОплатаПоСреднемуЗаработку.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("НачДата", НачалоГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("КонДата", КонецГода(мОбъект.ПериодРегистрации));
			Запрос.УстановитьПараметр("Сотрудник", мОбъект.Сотрудник);
			Запрос.УстановитьПараметр("Ссылка", мОбъект.Ссылка);
			Запрос.УстановитьПараметр("ДатаНачала", мОбъект.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", мОбъект.ДатаОкончания);
			Отказ = (Запрос.Выполнить().Выбрать().Количество() <> 0);
		КонецЕсли;
		Если Отказ Тогда
			Если Вопрос("Документ с такими реквизитами уже существует !!!"+Символы.ПС+"Продолжить ввод документа ?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Да Тогда
				Отказ = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Отказ;
	КонецФункции
	
	//Возвращает ответ значения учетной политики по заданному параметру
	Функция ОпределитьЗначениеУчетнойПолитики(Организация = Неопределено, Реквизит = "") Экспорт
		
		Ответ = Неопределено;
		Если ЗначениеЗаполнено(Реквизит) Тогда
			Если Организация = Неопределено Тогда
				Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
			КонецЕсли;
			УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация", Организация));
			Если УчетнаяПолитика <> Неопределено Тогда
				Ответ = УчетнаяПолитика[Реквизит];
			КонецЕсли;
		КонецЕсли;
		
		Возврат Ответ;
		
	КонецФункции
	
	//Возвращает ответственное лицо
	Функция СформироватьЗапросПоОтветственнымЛицамОрганизации(ОтветственноеЛицо, Дата) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииОтветственныеЛица.Сотрудник,
		|	ОрганизацииОтветственныеЛица.Должность,
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
		|	ОрганизацииОтветственныеЛица.Дата КАК Дата
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И ОрганизацииОтветственныеЛица.Дата < &Дата
		
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ОтветственноеЛицо", ОтветственноеЛицо);
		
		Возврат Запрос.Выполнить();
	КонецФункции
	
	//Функция ПолучитьДниПоКалендарю (ПериодРегистрацииНачало,ПериодРегистрацииКонец,СписокСотрудников,Регистратор,ВклИсключения = Истина) Экспорт //Островская Татьяна 15.07.2013 № 16623
	//	ПериодРегистрации = НачалоМесяца(ПериодРегистрацииНачало);
	//	ЗапросАвтоЗаполнения = Новый Запрос;
	//	ВидыРасчета = новый СписокЗначений;
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ);
	//	
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛЛиквидаторамЧАЭС);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка); //О.Т. Аверсон 16.08.2018 № 2307
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника); //О.Т. Аверсон 16.08.2018 № 2307
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам);
	//	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты);
	//	
	//	ЗапросАвтоЗаполнения.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//	ЗапросАвтоЗаполнения.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	//	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц", ПериодРегистрации);
	//	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидРасчета", ВидыРасчета);
	//	ЗапросАвтоЗаполнения.УстановитьПараметр("Регистратор", Регистратор);
	//	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойКлассификатор", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	//	ГодПериода = Формат(Год(ПериодРегистрации), "ЧГ=4");
	//	МесяцПериода = Месяц(ПериодРегистрации);
	//	ТекстЗапроса = "ВЫБРАТЬ
	//	|	ДатаТабеля
	//	|	
	//	|ПОМЕСТИТЬ ВТДатыТабеля 
	//	|	ИЗ (
	//	|	ВЫБРАТЬ
	//	|	ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " , " + День(ПериодРегистрации) + ") КАК ДатаТабеля
	//	|	";           
	//	Для НомерДня = День(ПериодРегистрации) + 1 По День(КонецМесяца(ПериодРегистрации)) Цикл
	//		ТекстЗапроса = ТекстЗапроса + 
	//		"ОБЪЕДИНИТЬ ВСЕ
	//		|ВЫБРАТЬ
	//		|  ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " ," + НомерДня + ")
	//		|	";
	//	КонецЦикла;
	//	ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
	//	ЗапросАвтоЗаполнения.Текст = ТекстЗапроса;
	//	ЗапросАвтоЗаполнения.Выполнить();
	//	
	//	
	//	
	//	
	//	ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ
	//	|	ДатыТабеля.ДатаТабеля,
	//	|	Начисления.Сотрудник КАК Сотрудник,
	//	|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
	//	|	Начисления.ВидРасчета КАК ВидРасчета,
	//	|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	//	|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
	//	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	//	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	//	|	ВЫБОР
	//	|		КОГДА Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало
	//	|						ТОГДА ВЫБОР
	//	|								КОГДА Начисления.ОтработаноЧасов = 0
	//	|									ТОГДА Начисления.ОплаченоДнейЧасов
	//	|								ИНАЧЕ Начисления.ОтработаноЧасов
	//	|							КОНЕЦ
	//	|					ИНАЧЕ 0
	//	|				КОНЕЦ
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК ВремяЗаДень,
	//	|	Начисления.ОплаченоДнейЧасов
	//	|ИЗ
	//	|	ВТДатыТабеля КАК ДатыТабеля
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//	|			Начисления.Сотрудник КАК Сотрудник,
	//	|			Начисления.Сотрудник.Код КАК СотрудникКод,
	//	|			Начисления.ГрафикРаботы КАК ГрафикРаботы,
	//	|			Начисления.ВидРасчета КАК ВидРасчета,
	//	|			Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	//	|			Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	//	|			Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	//	|			Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
	//	|			Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов,
	//	|			Начисления.Регистратор КАК Регистратор
	//	|		ИЗ
	//	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
	//	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
	//	|				ПО (СторноНачисления.Сторно)
	//	|					И (НЕ Начисления.Сторно)
	//	|					И (СторноНачисления.Сотрудник = Начисления.Сотрудник)
	//	|					И (СторноНачисления.ВидРасчета = Начисления.ВидРасчета)
	//	|					И (СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации)
	//	|					И (СторноНачисления.ПериодДействия = &Месяц)
	//	|					И (СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор)
	//	|					И (НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы)))
	//	|		ГДЕ
	//	|			СторноНачисления.Сотрудник ЕСТЬ NULL 
	//	|			И НЕ Начисления.Сторно
	//	|			И Начисления.ПериодДействия = &Месяц
	//	|			И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	//	|			И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))) КАК Начисления
	//	|		ПО (ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	//	|ГДЕ
	//	|	Начисления.ВидРасчета В(&ВидРасчета)
	//	|	И Начисления.Регистратор <> &Регистратор";
	//	
	//	Результ = ЗапросАвтоЗаполнения.Выполнить().Выбрать();
	//	КалендарныеДни = 0;
	//	ИсклДни = 0;
	//	если ВклИсключения Тогда //О.Т. 07.08.2014 № 164
	//		Пока Результ.Следующий() Цикл 
	//			если Результ.ДатаТабеля >= ПериодРегистрацииНачало и Результ.ДатаТабеля <= ПериодРегистрацииКонец Тогда   
	//				ИсклДни = ИсклДни+1;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//	КалендарныеДни = (День(ПериодРегистрацииКонец) - День(ПериодРегистрацииНачало))+1 -ИсклДни;
	//	Возврат КалендарныеДни;
	//	
	//КонецФункции //Островская Татьяна 15.07.2013 № 16623
	//
	//
	
#КонецЕсли

Функция ПолучитьДниПоКалендарю (ПериодРегистрацииНачало,ПериодРегистрацииКонец,СписокСотрудников,Регистратор,ВклИсключения = Истина) Экспорт //Островская Татьяна 15.07.2013 № 16623
	ПериодРегистрации = НачалоМесяца(ПериодРегистрацииНачало);
	ЗапросАвтоЗаполнения = Новый Запрос;
	ВидыРасчета = новый СписокЗначений;
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ);
	
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛЛиквидаторамЧАЭС);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка); //О.Т. Аверсон 16.08.2018 № 2307
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника); //О.Т. Аверсон 16.08.2018 № 2307
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам);
	ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты);
	
	ЗапросАвтоЗаполнения.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросАвтоЗаполнения.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц", ПериодРегистрации);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидРасчета", ВидыРасчета);
	ЗапросАвтоЗаполнения.УстановитьПараметр("Регистратор", Регистратор);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойКлассификатор", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	ГодПериода = Формат(Год(ПериодРегистрации), "ЧГ=4");
	МесяцПериода = Месяц(ПериодРегистрации);
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДатаТабеля
	|	
	|ПОМЕСТИТЬ ВТДатыТабеля 
	|	ИЗ (
	|	ВЫБРАТЬ
	|	ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " , " + День(ПериодРегистрации) + ") КАК ДатаТабеля
	|	";           
	Для НомерДня = День(ПериодРегистрации) + 1 По День(КонецМесяца(ПериодРегистрации)) Цикл
		ТекстЗапроса = ТекстЗапроса + 
		"ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|  ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " ," + НомерДня + ")
		|	";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
	ЗапросАвтоЗаполнения.Текст = ТекстЗапроса;
	ЗапросАвтоЗаполнения.Выполнить();
	
	
	
	
	ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ
	|	ДатыТабеля.ДатаТабеля,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
	|			ТОГДА ВЫБОР
	|					КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало
	|						ТОГДА ВЫБОР
	|								КОГДА Начисления.ОтработаноЧасов = 0
	|									ТОГДА Начисления.ОплаченоДнейЧасов
	|								ИНАЧЕ Начисления.ОтработаноЧасов
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВремяЗаДень,
	|	Начисления.ОплаченоДнейЧасов
	|ИЗ
	|	ВТДатыТабеля КАК ДатыТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Начисления.Сотрудник КАК Сотрудник,
	|			Начисления.Сотрудник.Код КАК СотрудникКод,
	|			Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|			Начисления.ВидРасчета КАК ВидРасчета,
	|			Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|			Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|			Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|			Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|			Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов,
	|			Начисления.Регистратор КАК Регистратор
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
	|				ПО (СторноНачисления.Сторно)
	|					И (НЕ Начисления.Сторно)
	|					И (СторноНачисления.Сотрудник = Начисления.Сотрудник)
	|					И (СторноНачисления.ВидРасчета = Начисления.ВидРасчета)
	|					И (СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации)
	|					И (СторноНачисления.ПериодДействия = &Месяц)
	|					И (СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор)
	|					И (НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы)))
	|		ГДЕ
	|			СторноНачисления.Сотрудник ЕСТЬ NULL 
	|			И НЕ Начисления.Сторно
	|			И Начисления.ПериодДействия = &Месяц
	|			И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	|			И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))) КАК Начисления
	|		ПО (ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|ГДЕ
	|	Начисления.ВидРасчета В(&ВидРасчета)
	|	И Начисления.Регистратор <> &Регистратор";
	
	Результ = ЗапросАвтоЗаполнения.Выполнить().Выбрать();
	КалендарныеДни = 0;
	ИсклДни = 0;
	если ВклИсключения Тогда //О.Т. 07.08.2014 № 164
		Пока Результ.Следующий() Цикл 
			если Результ.ДатаТабеля >= ПериодРегистрацииНачало и Результ.ДатаТабеля <= ПериодРегистрацииКонец Тогда   
				ИсклДни = ИсклДни+1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	КалендарныеДни = (День(ПериодРегистрацииКонец) - День(ПериодРегистрацииНачало))+1 -ИсклДни;
	Возврат КалендарныеДни;
	
КонецФункции //Островская Татьяна 15.07.2013 № 16623

Функция ПолучитьОкончаниеОтпускПоУходуЗаРебенкомБезОплаты(Сотрудник,ДатаСравнения) Экспорт  
	//СВЭЙ 22.02.2024 КВВ СВФР-012384 (
	ДатаСравнения_ = Дата(1,1,1);
	
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор,
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаНачала как ДатаНачала,
	
	//Аверсон ЕАЕ 17.09.2024 СВФР-013737
	//|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончания как ДатаОкончания
	|ВЫБОР
	|КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончанияФакт <> ДатаВремя(1,1,1)
	|ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончанияФакт
	|ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончания
	|КОНЕЦ КАК ДатаОкончания 
	//Аверсон СВФР-013737
	
	|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
	|И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидоврасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)
	|И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник   
	|И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)  
	|И НАЧАЛОПЕРИОДА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончания,МЕСЯЦ) = &НачМесяца";
	З.УстановитьПараметр("Сотрудник", Сотрудник); 
	З.УстановитьПараметр("НачМесяца", ДатаСравнения);
	РезЗ = З.Выполнить().Выгрузить();
	Если РезЗ.Количество() > 0 Тогда
		ДатаСравнения_ = КонецДня(РезЗ[0].ДатаОкончания) + 1;
	КонецЕсли;
	
	Возврат ДатаСравнения_;
	//СВЭЙ 22.02.2024 КВВ СВФР-012384 )
КонецФункции

//Аверсон ЕАЕ 15.05.2024 СВФР-012983
Функция ПолучитьБазуПоСотруднику(Сотрудник, НачПериод, КонПериод, ВидРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачДата И &КонДата
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачДата И &КонДата
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(НачПериод));
	Запрос.УстановитьПараметр("КонДата", КонецМесяца(КонПериод));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Результат");
	
КонецФункции

Функция ПолучитьБазуПоСотрудникамВРазрезеПериодов(СписокСотрудников, НачПериод, КонПериод, ВидРасчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|   ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|   НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия,МЕСЯЦ) КАК Период,
	|	ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат
	|ПОМЕСТИТЬ ВТРезультаты
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачДата И &КонДата
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник В(&СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
	|   НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,МЕСЯЦ),
	|	ДополнительныеНачисленияРаботниковОрганизаций.Результат
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачДата И &КонДата
	|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	|	И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник В(&СписокСотрудников)
	|;
	|///////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРезультаты.Сотрудник,
	|	ВТРезультаты.Период,
	|	СУММА(ВТРезультаты.Результат) КАК Результат
	|ИЗ ВТРезультаты
	|СГРУППИРОВАТЬ ПО
	|	ВТРезультаты.Сотрудник,
	|	ВТРезультаты.Период
	|";
	
	Запрос.УстановитьПараметр("НачДата", НачалоМесяца(НачПериод));
	Запрос.УстановитьПараметр("КонДата", КонецМесяца(КонПериод));
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета.БазовыеВидыРасчета.ВыгрузитьКолонку("ВидРасчета"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//Аверсон СВФР-012983