////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Предопределенные значения справочника "КлассификаторИспользованияРабочегоВремени"
Перем КлассификаторНочноеВремя, КлассификаторВечернееВремя;

// Значение  "ПоДням" перечисления ВидыУчетаВремени
Перем ВидУчетаВремениПоДням;

// Значение  "ПоЧасам" перечисления ВидыУчетаВремени
Перем ВидУчетаВремениПоЧасам;
Перем ВидУчетаВремениПоВечернимЧасам;
Перем ВидУчетаВремениПоНочнымЧасам;
//толик
Перем ВидУчетаВремениПоВредность;

// Массив строк "Первый", "Второй", "Третий" - приставки элементов табличной части документа.
Перем МассивПриставок;

// Значения справочника Классификатор использования рабочего времени. 
Перем КлассификаторЯвка;
Перем КлассификаторНочныеЧасы;
Перем КлассификаторВечерниеЧасы;
//толик
Перем КлассификаторВредность;

Перем КлассификаторПустаяСсылка;
// Индекс записи в наборе записей регистра сведений Графика
Перем ИндексЗаписиЯвка;

// Дата на которую происходит получение записи регистра.
Перем ДатаИндексаЗаписиЯвка;

// Количество часов работы которое проставляется для вида времени ПоДням
Перем ВремяЯвки;

// Структура для поиска строки таблицы значений
Перем СтруктураПоиска;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Функция предназначена для автозаполнения документа
// если заполнен параметр сотрудники, то в табличную часть будут добавлены
// строки по данным сотрудникам.
Функция Автозаполнение(ПостроительЗапроса = Неопределено, Сотрудники = Неопределено, ТекущаяСтрокаТабличнойЧасти = Неопределено) Экспорт
	
	//Аверсон ЕАЕ 05.10.2021 СВФР-008221
	//Если Организация.ИНН = "100071565" Тогда
	//	РабочихЧасовВМесяце = ПолучитьРабочихЧасовВМесяце();
	//КонецЕсли;
	//Аверсон СВФР-008221
	
	СписокКатегорий = Новый СписокЗначений;
	
	РезультатВыбора = ПрочиеПроцедуры.СформироватьМассивДоступныхКатегорийСотрудника(НачалоМесяца(ПериодРегистрации), ПодразделениеОрганизации).Выбрать();
	
	Пока РезультатВыбора.Следующий() Цикл
		
		Если РезультатВыбора.Категория.ТипДокумента = 1 Тогда
			СписокКатегорий.Добавить(РезультатВыбора.Категория);
		КонецЕсли;
		
	КонецЦикла;
	
	
	СписокВидовРасчетов = Новый СписокЗначений;
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	СписокВидовРасчетов.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	
	ЗапросАвтоЗаполнения = Новый Запрос;
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	ЗапросАвтоЗаполнения.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ТрудовойДоговор", Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
	ЗапросАвтоЗаполнения.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПериодРегистрации));
	ЗапросАвтоЗаполнения.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц", ПериодРегистрации);
	ЗапросАвтоЗаполнения.УстановитьПараметр("Месяц1", КонецМесяца(ПериодРегистрации));//Островская Татьяна 31.07.2013 № 16675
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоДням", ВидУчетаВремениПоДням);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоЧасам", ВидУчетаВремениПоЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоВечернимЧасам", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремениПоНочнымЧасам", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторЯ", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторВЧ", КлассификаторВечернееВремя);
	ЗапросАвтоЗаполнения.УстановитьПараметр("КлассификаторНЧ", КлассификаторНочноеВремя);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустоеПодразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ЗапросАвтоЗаполнения.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойДокумент", Документы.ТабельУчетаРабочегоВремениОрганизации.ПустаяСсылка()); //О.Т. 26.08.2014 № 
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("СверхНормы", Перечисления.ВидыВремени.ОтработанноеСверхНормы);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойКлассификатор", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоЧасам", Перечисления.ВидыУчетаВремени.ПоЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоВечерним", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПоНочным", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам); 
	
	ВидыВремениУчитываемыеВВыходные = Новый Массив(2);
	ВидыВремениУчитываемыеВВыходные[0] = Перечисления.ВидыВремени.ОтработанноеСверхНормы;
	ВидыВремениУчитываемыеВВыходные[1] = Перечисления.ВидыВремени.ЦелодневноеНеотработанное;
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидыВремениУчитываемыеВВыходные", ВидыВремениУчитываемыеВВыходные);
	ЗапросАвтоЗаполнения.УстановитьПараметр("ПустойГрафик", Справочники.ГрафикиРаботы.ПустаяСсылка());
	ЗапросАвтоЗаполнения.УстановитьПараметр("ВидРасчета", СписокВидовРасчетов);
	//Островская 15.03.2014 №
	СписокВакансий = Новый СписокЗначений;
	СписокВакансий.Добавить("Вакансия");
	СписокВакансий.Добавить("вакансия");
	СписокВакансий.Добавить("ВАКАНСИЯ");
	СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
	СписокВакансий.Добавить("вакансия 1 1");
	ЗапросАвтоЗаполнения.УстановитьПараметр("Наименование", СписокВакансий);
	//Островская 15.03.2014 №
	
	Если ПостроительЗапроса = Неопределено Тогда 
		
		Если Сотрудники = Неопределено Тогда
			СотрудникиТекст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОрганизаций.Сотрудник КАК Ссылка,
			|	РаботникиОрганизаций.Сотрудник.Код КАК СотрудникКод
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ОбособленноеПодразделение
			|		КОНЕЦ = &ОбособленноеПодразделение
			|	И (ВЫБОР
			|				КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|						И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
			|			КОНЕЦ В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= &НачалоМесяца
			|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РаботникиОрганизаций.ПричинаИзмененияСостояния
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	РаботникиОрганизаций.Сотрудник,
			|	РаботникиОрганизаций.Сотрудник.Код
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецМесяца, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизаций
			|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	РаботникиОрганизаций.Период > &НачалоМесяца
			|	И РаботникиОрганизаций.Период <= &КонецМесяца
			|	И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|	И РаботникиОрганизаций.ОбособленноеПодразделение = &ОбособленноеПодразделение
			|	И (РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
			|	И НЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо.Наименование В (&Наименование)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	Работники.Сотрудник,
			|	Работники.Сотрудник.Код
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК Работники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
			|		ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
			|			И (ПериодыПерекрытия.Период > Работники.Период)
			|			И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
			|			И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
			|ГДЕ
			|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И Работники.ПериодЗавершения > &НачалоМесяца
			|	И Работники.ПериодЗавершения <= &КонецМесяца
			|	И Работники.Организация = &ГоловнаяОрганизация
			|	И Работники.ОбособленноеПодразделениеЗавершения = &ОбособленноеПодразделение
			|	И (Работники.ПодразделениеОрганизацииЗавершения В ИЕРАРХИИ (&Подразделение)
			|			ИЛИ &Подразделение = &ПустоеПодразделение)
			|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
			|	И НЕ Работники.Сотрудник.Физлицо.Наименование В (&Наименование)
			|
			|УПОРЯДОЧИТЬ ПО
			|	СотрудникКод"; 
			
			ЗапросАвтоЗаполнения.Текст = СотрудникиТекст;
			СписокСотрудников = ЗапросАвтоЗаполнения.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Ложь);
		Иначе
			СписокСотрудников = Сотрудники;
			ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Истина);
		КонецЕсли;
	Иначе
		//Островская Татьяна 24.10.2013 № 16872
		ИсходныйТекстПостроителя = ПостроительЗапроса.Текст;
		ТекстЗапросаПоСпискуРаботников = СтрЗаменить(ИсходныйТекстПостроителя,"РАЗРЕШЕННЫЕ","");
		//ТекстЗапросаПоСпискуРаботников = Лев(ТекстЗапросаПоСпискуРаботников, Найти(ТекстЗапросаПоСпискуРаботников,"УПОРЯДОЧИТЬ") - 1);
		ПостроительЗапроса.Текст = ТекстЗапросаПоСпискуРаботников;
		ПостроительЗапроса.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ПостроительЗапроса.Выполнить();
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРаботников.Сотрудник КАК Ссылка
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников ";
		ПостроительЗапроса.Текст = СотрудникиТекст;
		ПостроительЗапроса.Выполнить();
		СписокСотрудников = ПостроительЗапроса.Выполнить().Выгрузить();//.ВыгрузитьКолонку("Ссылка");
		//Островская Татьяна 24.10.2013 № 16872
		ЗапросАвтоЗаполнения.УстановитьПараметр("ВключатьВРезультатПустыеЗаписи", Ложь);
	КонецЕсли;
	ЗапросАвтоЗаполнения.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросАвтоЗаполнения.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Аверсон ЕАЕ 20.09.2021 СВФР-008061
	ЗапросВредность = Новый Запрос;
	ЗапросВредность.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	&НачДата КАК Период
	|ПОМЕСТИТЬ ВТВредность
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&НачДата, Сотрудник В (&Сотрудники)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
	|	И ВЫБОР
	|	КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &НачДата
	|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
	|	ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
	|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ПлановыеНачисленияРаботниковОрганизаций.Период
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
	|	И ВЫБОР
	|	КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &НачДата
	|	И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
	|	ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
	|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В (&Сотрудники)
	|	И ПлановыеНачисленияРаботниковОрганизаций.Период МЕЖДУ &НачДата И &КонДата		
	|;
	|//////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТВредность.Сотрудник,
	|	ВТВредность.Период КАК НачалоПериода,
	|	МАКСИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТВредностьБольше.Период,СЕКУНДА,-1), &КонДата)) КАК КонецПериода
	|ПОМЕСТИТЬ ВТПериодыВредности
	|ИЗ ВТВредность
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТВредность КАК ВТВредностьБольше
	|ПО ВТВредность.Сотрудник = ВТВредностьБольше.Сотрудник
	|	И ВТВредность.Период < ВТВредностьБольше.Период
	|СГРУППИРОВАТЬ ПО
	|	ВТВредность.Сотрудник,
	|	ВТВредность.Период
	|;
	|/////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТПериодыВредности.Сотрудник,
	|	РеглКалендарь.ДатаКалендаря
	|ИЗ ВТПериодыВредности
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РеглКалендарь
	|ПО РеглКалендарь.ДатаКалендаря МЕЖДУ ВТПериодыВредности.НачалоПериода И ВТПериодыВредности.КонецПериода";
	
	ЗапросВредность.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
	ЗапросВредность.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	Если ТипЗнч(СписокСотрудников) = Тип("ТаблицаЗначений") Тогда
		Сп = СписокСотрудников.ВыгрузитьКолонку("Ссылка");
	ИначеЕсли ТипЗнч(СписокСотрудников) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		Сп = Новый Массив;
		Сп.Добавить(СписокСотрудников);
	Иначе
		Сп = СписокСотрудников;
	КонецЕсли;
	ЗапросВредность.УстановитьПараметр("Сотрудники", Сп);
	ТЗВредность = ЗапросВредность.Выполнить().Выгрузить();
	//Аверсон СВФР-008061
	
	ГодПериода = Формат(Год(ПериодРегистрации), "ЧГ=4");
	МесяцПериода = Месяц(ПериодРегистрации);
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДатаТабеля
	|	
	|ПОМЕСТИТЬ ВТДатыТабеля 
	|	ИЗ (
	|	ВЫБРАТЬ
	|	ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " , " + День(НачалоМесяца(ПериодРегистрации)) + ") КАК ДатаТабеля
	|	";           
	Для НомерДня = День(НачалоМесяца(ПериодРегистрации)) + 1 По День(КонецМесяца(ПериодРегистрации)) Цикл
		ТекстЗапроса = ТекстЗапроса + 
		"ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|  ДАТАВРЕМЯ(" + ГодПериода + ", " + МесяцПериода + " ," + НомерДня + ")
		|	";
	КонецЦикла;
	ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
	ЗапросАвтоЗаполнения.Текст = ТекстЗапроса;
	ЗапросАвтоЗаполнения.Выполнить();
	
	//ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ
	//|	ДатыТабеля.ДатаТабеля,
	//|	Начисления.Сотрудник,
	//|	Начисления.ГрафикРаботы,
	//|	Начисления.ВидРасчета,
	//|	Начисления.ВидУчетаВремени,
	//|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
	//|	Начисления.ПериодДействияНачало,
	//|	Начисления.ПериодДействияКонец,
	//|	ВЫБОР КОГДА (Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)) ТОГДА
	//|		ВЫБОР КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало ТОГДА
	//|			Начисления.ОтработаноЧасов
	//|		ИНАЧЕ
	//|			0
	//|		КОНЕЦ
	//|	ИНАЧЕ 
	//|		NULL
	//|	КОНЕЦ КАК ВремяЗаДень
	//|ПОМЕСТИТЬ ВТОсновныеНачисления
	//|ИЗ 
	//|	ВТДатыТабеля КАК ДатыТабеля
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
	//|ПО
	//|	ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец
	//|	И НЕ Начисления.Сторно
	//|	И Начисления.ПериодДействия = &Месяц
	//|	И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	//|	И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
	//|ПО
	//|	ДатыТабеля.ДатаТабеля МЕЖДУ СторноНачисления.ПериодДействияНачало И СторноНачисления.ПериодДействияКонец
	//|	И СторноНачисления.Сторно
	//|	И СторноНачисления.Сотрудник = Начисления.Сотрудник
	//|	И СторноНачисления.ВидРасчета = Начисления.ВидРасчета
	//|	И СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации
	//|	И СторноНачисления.ПериодДействия = &Месяц
	//|	И СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	//|	И НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))
	//|ГДЕ
	//|	СторноНачисления.Сотрудник Есть NULL
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Начисления.Сотрудник,
	//|	ДатыТабеля.ДатаТабеля,
	//|	Начисления.ВидРасчета";
	
	ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ
	|	ДатыТабеля.ДатаТабеля,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|	Начисления.ВидРасчета.ВидВремени КАК ВидВремени,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВЫБОР
	|		КОГДА Начисления.ВидРасчета.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
	|			ТОГДА ВЫБОР
	|					КОГДА ДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало
	|						ТОГДА ВЫБОР
	|								КОГДА Начисления.ОтработаноЧасов = 0
	|									ТОГДА Начисления.ОплаченоДнейЧасов
	|								ИНАЧЕ Начисления.ОтработаноЧасов
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВремяЗаДень,
	|	Начисления.ОплаченоДнейЧасов
	|ПОМЕСТИТЬ ВТОсновныеНачисления
	|ИЗ
	|	ВТДатыТабеля КАК ДатыТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Начисления.Сотрудник КАК Сотрудник,
	|			Начисления.Сотрудник.Код КАК СотрудникКод,
	|			Начисления.ГрафикРаботы КАК ГрафикРаботы,
	|			Начисления.ВидРасчета КАК ВидРасчета,
	|			Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|			Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|			Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|			Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|			Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК Начисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Сотрудник В (&СписокСотрудников)) КАК СторноНачисления
	|				ПО (СторноНачисления.Сторно)
	|					И (НЕ Начисления.Сторно)
	|					И (СторноНачисления.Сотрудник = Начисления.Сотрудник)
	|					И (СторноНачисления.ВидРасчета = Начисления.ВидРасчета)
	|					И (СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации)
	|					И (СторноНачисления.ПериодДействия = &Месяц)
	|					И (СторноНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор)
	|					И (НЕ СторноНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы)))
	|		ГДЕ
	|			СторноНачисления.Сотрудник ЕСТЬ NULL 
	|			И НЕ Начисления.Сторно
	|			И Начисления.ПериодДействия = &Месяц
	|			И Начисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ПустойКлассификатор
	|			И НЕ Начисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы))) КАК Начисления
	|		ПО (ДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|ГДЕ
	|	НЕ Начисления.Сотрудник.Физлицо.Наименование В (&Наименование)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ДатыТабеля.ДатаТабеля,
	|	ВидРасчета";
	ЗапросАвтоЗаполнения.Выполнить();
	
	ЗапросАвтоЗаполнения.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Месяц,
	|	ГрафикиРаботыПоВидамВремени.Дата,
	|	ГрафикиРаботыПоВидамВремени.План,
	|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.Документ
	|ПОМЕСТИТЬ ВТГрафикиРаботыПоВидамВремени
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
	|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
	|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
	|		КОНЕЦ КАК ГрафикРаботы
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник В (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &НачалоМесяца
	|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
	|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
	|			КОНЕЦ <> &ПустойГрафик
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.ГрафикРаботы
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ГДЕ
	|		РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
	|		И РаботникиОрганизаций.Период > &НачалоМесяца
	|		И РаботникиОрганизаций.Период <= &КонецМесяца
	|		И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Работники.ГрафикРаботыЗавершения
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК Работники
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|			ПО ПериодыПерекрытия.Период <= Работники.ПериодЗавершения
	|				И ПериодыПерекрытия.Период > Работники.Период
	|				И ПериодыПерекрытия.Сотрудник = Работники.Сотрудник
	|	ГДЕ
	|		Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		И Работники.ПериодЗавершения > &НачалоМесяца
	|		И Работники.ПериодЗавершения <= &КонецМесяца
	|		И Работники.ГрафикРаботыЗавершения <> &ПустойГрафик
	|		И ПериодыПерекрытия.Период ЕСТЬ NULL 
	|		И Работники.Сотрудник В(&СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыбранныеСотрудники.Ссылка
	|	ИЗ
	|		Справочник.СотрудникиОрганизаций КАК ВыбранныеСотрудники
	|	ГДЕ
	|		ВыбранныеСотрудники.Ссылка В(&СписокСотрудников)) КАК ГрафикиРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ГрафикиРаботы.ГрафикРаботы
	|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка)
	|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ПустойДокумент)
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
	|			И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|			И ((НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ))
	|ГДЕ
	|	(НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL )
	|ИНДЕКСИРОВАТЬ ПО
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Месяц,
	|	ГрафикиРаботыПоВидамВремени.Дата,
	|	ГрафикиРаботыПоВидамВремени.План,
	|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
	ЗапросАвтоЗаполнения.Выполнить();
	
	ТекстГрафики = ЗапросАвтоЗаполнения.Текст; //Островская Татьяна 01.04.2014 № 17
	
	// Заполнение с разбивкой по дням.
	
	ЗапросАвтоЗаполнения.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТОсновныеНачисления.ДатаТабеля,
	|	ВТОсновныеНачисления.Сотрудник,
	|	ВТОсновныеНачисления.ГрафикРаботы,
	|	ВТОсновныеНачисления.ВидРасчета,
	|	ВТОсновныеНачисления.ВидВремени,
	|	ВТОсновныеНачисления.ПериодДействияНачало,
	|	ВТОсновныеНачисления.ПериодДействияКонец,
	|	ВТОсновныеНачисления.ВремяЗаДень
	|ПОМЕСТИТЬ ВТОтредактированныеНачисления
	|ИЗ
	|	ВТОсновныеНачисления
	|	
	|ОБЪЕДИНИТЬ 
	|
	|
	|ВЫБРАТЬ
	|	ВТОсновныеНачисления.ДатаТабеля,
	|	ВТОсновныеНачисления.Сотрудник,
	|	ВТОсновныеНачисления.ГрафикРаботы,
	|	""ПланируемаяЯвка"", 
	|	NULL,
	|	ВТОсновныеНачисления.ПериодДействияНачало,
	|	ВТОсновныеНачисления.ПериодДействияКонец,
	|	ВТОсновныеНачисления.ВремяЗаДень
	|ИЗ
	|	ВТОсновныеНачисления
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТОсновныеНачисления КАК Явки
	|ПО
	|	Явки.ДатаТабеля = ВТОсновныеНачисления.ДатаТабеля
	|	И Явки.Сотрудник = ВТОсновныеНачисления.Сотрудник
	|	И (Явки.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы 
	|		ИЛИ Явки.ГрафикРаботы = ВТОсновныеНачисления.Сотрудник)
	|	И Явки.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеВПределахНормы)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТГрафикиРаботыПоВидамВремени КАК ГрафикиРаботы
	|ПО
	|	ГрафикиРаботы.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
	|	И ГрафикиРаботы.Дата = ВТОсновныеНачисления.ДатаТабеля
	|	И ГрафикиРаботы.ВидУчетаВремени = ВТОсновныеНачисления.ВидУчетаВремени
	|ГДЕ
	|	Явки.Сотрудник ЕСТЬ NULL
	|	И ГрафикиРаботы.ОсновноеЗначение > 0 
	|	И ВТОсновныеНачисления.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)";
	ЗапросАвтоЗаполнения.Выполнить();
	
	
	ЗапросАвтоЗаполненияТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Код КАК СотрудникКод,
	|	ДниСотрудников.Дата,
	|	ДЕНЬ(ДниСотрудников.Дата) КАК День,
	|	ДниСотрудников.ВидВремени КАК БукваВидаВремени,
	|	ДниСотрудников.ОсновноеЗначение,
	|	ВЫБОР
	|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторЯ
	|			ТОГДА 1
	|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторВЧ
	|			ТОГДА 2
	|		КОГДА ДниСотрудников.ВидВремени = &КлассификаторНЧ
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК ПорядокСортировки,
	|	ДниСотрудников.ОсновноеЗначение1
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДниСотрудников.Сотрудник КАК Сотрудник,
	|			ДниСотрудников.Дата КАК Дата,
	|			ВЫБОР
	|				КОГДА НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
	|						И (ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
	|							ИЛИ ДневныеНеявки.ВидРасчета.ВидВремени В (&ВидыВремениУчитываемыеВВыходные))
	|					ТОГДА ДневныеНеявки.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени
	|				КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
	|					ТОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоЧасам
	|								ТОГДА &КлассификаторЯ
	|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоВечерним
	|								ТОГДА &КлассификаторВЧ
	|							КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ВидУчетаВремени, ОбщиеГрафики.ВидУчетаВремени) = &ПоНочным
	|								ТОГДА &КлассификаторНЧ
	|						КОНЕЦ
	|			КОНЕЦ КАК ВидВремени,
	|			ВЫБОР
	|				КОГДА НЕ ДневныеНеявки.ВремяЗаДень ЕСТЬ NULL 
	|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
	|						И (ДневныеНеявки.ВремяЗаДень > 0
	|							ИЛИ ДневныеНеявки.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
	|					ТОГДА ДневныеНеявки.ВремяЗаДень
	|				КОГДА НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|						И ДневныеНеявки.ВидРасчета <> ""ПланируемаяЯвка""
	|						И (ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
	|							ИЛИ ДневныеНеявки.ВидРасчета.ВидВремени В (&ВидыВремениУчитываемыеВВыходные))
	|					ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ЕСТЬNULL(ОбщиеГрафики.ОсновноеЗначение, 0))
	|				КОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0
	|					ТОГДА ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение)
	|			КОНЕЦ КАК ОсновноеЗначение,
	|			ВЫБОР
	|				КОГДА ИндивидуальныеГрафики.ОсновноеЗначение > 0
	|					ТОГДА ИндивидуальныеГрафики.ОсновноеЗначение
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОсновноеЗначение1
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ДатыПериода.ДатаТабеля КАК Дата,
	|				РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|				МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаИзменения
	|			ИЗ
	|				ВТДатыТабеля КАК ДатыПериода
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|					ПО (РаботникиОрганизаций.Сотрудник В (&СписокСотрудников))
	|						И (РаботникиОрганизаций.Период <= ДатыПериода.ДатаТабеля)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				РаботникиОрганизаций.Сотрудник,
	|				ДатыПериода.ДатаТабеля) КАК ДниСотрудников
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|				ПО (РаботникиОрганизаций.Сотрудник = ДниСотрудников.Сотрудник)
	|					И (РаботникиОрганизаций.Период = ДниСотрудников.ДатаИзменения)
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ВведенныеТабеля
	|				ПО (ВведенныеТабеля.ГрафикРаботы = ДниСотрудников.Сотрудник)
	|					И (НЕ ВведенныеТабеля.План)
	|					И (ВведенныеТабеля.Дата = ДниСотрудников.Дата)
	|					И (ВведенныеТабеля.ВидУчетаВремени = &ПоЧасам)
	|					И (ВведенныеТабеля.Документ ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|				ПО (СводныеИндивидуальныеГрафики.Сотрудник = ДниСотрудников.Сотрудник)
	|					И (СводныеИндивидуальныеГрафики.Месяц = &Месяц)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК СводныеТабеля
	|				ПО (СводныеТабеля.Сотрудник = ДниСотрудников.Сотрудник)
	|					И (СводныеТабеля.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации)
	|					И (СводныеТабеля.Регистратор <> &ДокументСсылка)
	|					И (СводныеТабеля.Период МЕЖДУ &Месяц И &Месяц1)
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОтредактированныеНачисления КАК ДневныеНеявки
	|				ПО (ДневныеНеявки.Сотрудник = ДниСотрудников.Сотрудник)
	|					И ДниСотрудников.Дата = ДневныеНеявки.ДатаТабеля
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныеГрафики
	|				ПО (ИндивидуальныеГрафики.ГрафикРаботы = ДниСотрудников.Сотрудник)
	|					И (ИндивидуальныеГрафики.План)
	|					И (ИндивидуальныеГрафики.Дата = ДниСотрудников.Дата)
	|					И (ИндивидуальныеГрафики.ВидУчетаВремени = &ПоЧасам
	|						ИЛИ ИндивидуальныеГрафики.ВидУчетаВремени В (&ПоВечерним, &ПоНочным)
	|							И ИндивидуальныеГрафики.ОсновноеЗначение > 0)
	|					И (ИндивидуальныеГрафики.Документ ССЫЛКА Документ.ВводИндивидуальныхГрафиковРаботыОрганизации)
	|					И (ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|						ИЛИ ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
	|						ИЛИ ИндивидуальныеГрафики.ВидУчетаВремени = &ПоЧасам)
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ОбщиеГрафики
	|				ПО (ОбщиеГрафики.ГрафикРаботы = ВЫБОР
	|						КОГДА РаботникиОрганизаций.ПериодЗавершения <= ДниСотрудников.Дата
	|								И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА РаботникиОрганизаций.ГрафикРаботыЗавершения
	|						ИНАЧЕ РаботникиОрганизаций.ГрафикРаботы
	|					КОНЕЦ)
	|					И (ОбщиеГрафики.План)
	|					И (ОбщиеГрафики.Дата = ДниСотрудников.Дата)
	|					И (ОбщиеГрафики.ВидУчетаВремени = &ПоЧасам
	|						ИЛИ ОбщиеГрафики.ВидУчетаВремени В (&ПоВечерним, &ПоНочным)
	|							И ОбщиеГрафики.ОсновноеЗначение > 0)
	|					И (ИндивидуальныеГрафики.ГрафикРаботы ЕСТЬ NULL )
	|					И (ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|						ИЛИ ДневныеНеявки.ВидРасчета = ""ПланируемаяЯвка""
	|						ИЛИ ОбщиеГрафики.ВидУчетаВремени = &ПоЧасам)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
	|				ПО (РаботникиОрганизацийУвольнения.Сотрудник = ДниСотрудников.Сотрудник)
	|					И (РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|		ГДЕ
	|			(РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL 
	|					ИЛИ РаботникиОрганизацийУвольнения.Период > ДниСотрудников.Дата)
	|			И РаботникиОрганизаций.ГрафикРаботы <> &ПустойГрафик
	|			И СводныеТабеля.НомерСтроки ЕСТЬ NULL 
	|			И ВведенныеТабеля.ГрафикРаботы ЕСТЬ NULL 
	|			И СводныеИндивидуальныеГрафики.НомерСтроки ЕСТЬ NULL 
	|			И (НЕ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|					ИЛИ ДневныеНеявки.ВидРасчета ЕСТЬ NULL 
	|						И ЕСТЬNULL(ИндивидуальныеГрафики.ОсновноеЗначение, ОбщиеГрафики.ОсновноеЗначение) > 0)) КАК ДниСотрудников
	|		ПО (НЕ ДниСотрудников.ВидВремени ЕСТЬ NULL )
	|			И (ДниСотрудников.Сотрудник = Сотрудники.Ссылка)
	|ГДЕ
	|	Сотрудники.Ссылка В(&СписокСотрудников)
	|	И (&ВключатьВРезультатПустыеЗаписи
	|			ИЛИ НЕ ДниСотрудников.ВидВремени ЕСТЬ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникКод,
	|	Сотрудник,
	|	День,
	|	ПорядокСортировки";
	
	
	ЗапросАвтоЗаполнения.Текст = ЗапросАвтоЗаполненияТекст;
	РезультатЗапроса = ЗапросАвтоЗаполнения.Выполнить();
	
	Если Сотрудники = Неопределено Тогда
		ОтработанноеВремя.Очистить();
		ОтработанноеВремяВЦеломЗаПериод.Очистить();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивВидВремени = Новый СписокЗначений;
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни);
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь); 
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству);
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя);
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение); 
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы);
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком);// О.Т. 04.11.2014 267
	МассивВидВремени.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам);//О.Т. 06.04.2015 № 402
	
	Если Выборка.Количество() > 0 Тогда
		
		// по дням.
		
		ВведенныеТабеляПоДнямПоСотруднику = Новый Соответствие;
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			СтавкаСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Выборка.Сотрудник)).ЗанимаемыхСтавок; 
			
			ВведенныеТабеляПоДнямПоСотруднику.Очистить();
			Если ТекущаяСтрокаТабличнойЧасти = Неопределено Тогда
				СтрокаРасшифровкиПоДням = ОтработанноеВремя.Добавить();
			Иначе
				СтрокаРасшифровкиПоДням = ТекущаяСтрокаТабличнойЧасти;
				Для ИндексДня = 1 По 31 Цикл
					ТекущаяСтрокаТабличнойЧасти["ПервыйВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
					ТекущаяСтрокаТабличнойЧасти["ВторойВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
					ТекущаяСтрокаТабличнойЧасти["ТретийВидВремени" + Строка(ИндексДня)] = КлассификаторПустаяСсылка;
					ТекущаяСтрокаТабличнойЧасти["ПервыйЧасов" + Строка(ИндексДня)] = 0;
					ТекущаяСтрокаТабличнойЧасти["ВторойЧасов" + Строка(ИндексДня)] = 0;
					ТекущаяСтрокаТабличнойЧасти["ТретийЧасов" + Строка(ИндексДня)] = 0;
				КонецЦикла;
			КонецЕсли;
			СтрокаРасшифровкиПоДням.Сотрудник = Выборка.Сотрудник;
			ОчередностьДней = 1;
			Если Выборка.День <> NULL Тогда
				// О.Т. 30.10.2014 262
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизацийСрезПоследних.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследних
				|ГДЕ
				|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
				
				Запрос.УстановитьПараметр("Дата", КонецМесяца(ПериодРегистрации));
				Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
				
				РезультатДата = Запрос.Выполнить().Выгрузить();
				ДатаПриема = Дата(1,1,1);
				Если РезультатДата.Количество()>0 Тогда 
					ДатаПриема = РезультатДата[0].Период;
					если ДатаПриема > ПериодРегистрации Тогда 
						ОчередностьДней = День(ДатаПриема);
					КонецЕсли;
				КонецЕсли;
				// О.Т. 30.10.2014 262
				запросДок = Новый запрос;
				//Островская Татьяна 13.05.2014 № 17349
				запросДок.Текст =
				"ВЫБРАТЬ
				|	ОтпускаФактическиеПоСотрудникам.Регистратор КАК Ссылка
				|ИЗ
				|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
				|		ПО ОтпускаФактическиеПоСотрудникам.Регистратор = ОтпускПоУходуЗаРебенком.Ссылка
				|ГДЕ
				|	ОтпускПоУходуЗаРебенком.Сотрудник = &Сотрудник
				|	И ВЫБОР
				|			КОГДА ОтпускПоУходуЗаРебенком.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|					И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания
				|			ИНАЧЕ &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачалаФакт И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт
				|		КОНЕЦ";
				//Островская Татьяна 13.05.2014 № 17349


				Пока Выборка.СледующийПоЗначениюПоля("День") Цикл
					если ОчередностьДней < Выборка.День Тогда
						для СчДень = ОчередностьДней по Выборка.День-1 Цикл 
							ИндексЯчейкиВТаблице = СчДень;
							НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							
							запросДок.УстановитьПараметр("ДатаФакт",Дата(Число(СтрЗаменить(Год(Выборка.Дата)," ","")),Месяц(Выборка.Дата),СчДень));
							запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
							Результ = запросДок.Выполнить();
							
							если Результ.Пустой() Тогда 
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
							иначе
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
							КонецЕсли;
							НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							если Результ.Пустой() Тогда
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = "В";
							иначе
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод
							КонецЕсли;
							
							ОчередностьДней = ОчередностьДней + 1;
						КонецЦикла;
						
						
					ИначеЕсли Выборка.ОсновноеЗначение = 0 и Выборка.ОсновноеЗначение1 = 0  Тогда 
						ИндексЯчейкиВТаблице = Выборка.День;
						НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						
						// О.Т. 04.11.2014 267
						запросДок.УстановитьПараметр("ДатаФакт",Дата(Число(СтрЗаменить(Год(Выборка.Дата)," ","")),Месяц(Выборка.Дата),ОчередностьДней));
						запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
						Результ = запросДок.Выполнить();
						//О.Т. 06.04.2015 № 402
						ВидДня = Неопределено;
						запросПраздники = Новый Запрос;
						запросПраздники.Текст = 
						"ВЫБРАТЬ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
						|	РегламентированныйПроизводственныйКалендарь.Год,
						|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
						|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
						|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
						|	РегламентированныйПроизводственныйКалендарь.ВидДня
						|ИЗ
						|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
						|ГДЕ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
						запросПраздники.УстановитьПараметр("ДатаКалендаря",Выборка.Дата);
						РезПраздники = запросПраздники.Выполнить().Выбрать();
						Пока РезПраздники.Следующий() Цикл 
							ВидДня = РезПраздники.ВидДня;
						КонецЦикла;
						если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник и Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам Тогда
							ОчередностьДней = ОчередностьДней + 1;
							Продолжить;
						КонецЕсли;
						//О.Т. 06.04.2015 № 402
						если Результ.Пустой() Тогда  
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
						иначе
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
						КонецЕсли;               					
						
						НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
						если Результ.Пустой() Тогда
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = "В";
						иначе
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод
						КонецЕсли;
						// О.Т. 04.11.2014 267
					ИначеЕсли Выборка.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Работа и 
						Выборка.БукваВидаВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда 
						
						ИндексЯчейкиВТаблице = Выборка.День;
						НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						// О.Т. 04.11.2014 267
						запросДок.УстановитьПараметр("ДатаФакт",Дата(Число(СтрЗаменить(Год(Выборка.Дата)," ","")),Месяц(Выборка.Дата),ОчередностьДней));
						запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
						Результ = запросДок.Выполнить();
						если Результ.Пустой() Тогда 
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
						иначе
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
						КонецЕсли;  
						НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
						если Результ.Пустой() Тогда
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = "В";
						иначе
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод
						КонецЕсли;
						
					КонецЕсли;
					ОчередностьДней = ОчередностьДней + 1;
					ЕстьРабота = Ложь;
					ЕстьПраздник = Ложь;
					ИндексЯчейкиВТаблице = Выборка.День;
					//Островская Татьяна 18.12.2012 № 16065
					ЯвкуНеДобавлять = Ложь;
					//Островская Татьяна 18.12.2012 № 16065
					ИндексМассиваПриставок = 0;
					Пока Выборка.Следующий() Цикл  
						// О.Т. 31.10.2014 262
						если ИндексМассиваПриставок > 0 Тогда 
							если СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь.БуквенныйКод и 
								Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск Тогда 
								Продолжить;
							КонецЕсли;
						КонецЕсли;
                        // О.Т. 31.10.2014 262
						Если ИндексМассиваПриставок > 2 Тогда
							// На данный момент мы можем вводить только 3 вида времени в один день
							Прервать;
						КонецЕсли;
						//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
						запросДок = Новый запрос;
						//Островская Татьяна 13.05.2014 № 17349
						запросДок.Текст =
						"ВЫБРАТЬ
						|	ОтпускаФактическиеПоСотрудникам.Регистратор КАК Ссылка
						|ИЗ
						|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
						|		ПО ОтпускаФактическиеПоСотрудникам.Регистратор = ОтпускПоУходуЗаРебенком.Ссылка
						|ГДЕ
						|	ОтпускПоУходуЗаРебенком.Сотрудник = &Сотрудник
						|	И ВЫБОР
						|			КОГДА ОтпускПоУходуЗаРебенком.ДатаНачалаФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						|					И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						|				ТОГДА &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания
						|			ИНАЧЕ &ДатаФакт МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачалаФакт И ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт
						|		КОНЕЦ";
						//Островская Татьяна 13.05.2014 № 17349
						запросДок.УстановитьПараметр("ДатаФакт",Выборка.Дата);
						запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
						Результ = запросДок.Выполнить();
						// О.Т. 04.11.2014 267
						если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
							если не Результ.Пустой() тогда
								НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
								НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод;
							КонецЕсли;
							
						КонецЕсли;
						// О.Т. 04.11.2014 267

						//Аверсон-софт, Островская Татьяна 17.08.2012 № 15704
						ВидДня = Неопределено;
						запросПраздники = Новый Запрос;
						запросПраздники.Текст = 
						"ВЫБРАТЬ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
						|	РегламентированныйПроизводственныйКалендарь.Год,
						|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
						|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
						|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
						|	РегламентированныйПроизводственныйКалендарь.ВидДня
						|ИЗ
						|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
						|ГДЕ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
						запросПраздники.УстановитьПараметр("ДатаКалендаря",Выборка.Дата);
						РезПраздники = запросПраздники.Выполнить().Выбрать();
						Пока РезПраздники.Следующий() Цикл 
							ВидДня = РезПраздники.ВидДня;
						КонецЦикла;
						//Аверсон-софт, Островская Татьяна 17.08.2012 № 15704
						если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа и ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник тогда
							НазваниеЯчейкиВБазе = МассивПриставок[4]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
							НазваниеЯчейкиВБазе = МассивПриставок[4]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
						КонецЕсли;
						
							
						
						// О.Т. 03.12.2014 
						если  ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник и не (Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа или
							Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы или
							Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные или
							Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) тогда
							
							Продолжить;
						КонецЕсли;
						// О.Т. 03.12.2014 
						
						если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
							НазваниеЯчейкиВБазе = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
							НазваниеЯчейкиВБазе = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						// О.Т. 03.11.2014 267	
						ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
							НазваниеЯчейкиВБазе = МассивПриставок[3]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
							НазваниеЯчейкиВБазе = МассивПриставок[4]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
						// О.Т. 03.11.2014 267	
						иначе
							НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							//Продолжить;
						КонецЕсли;
						
						если  не Результ.Пустой() тогда
							если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
							иначе
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени;
							КонецЕсли;
						иначе
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени;
						КонецЕсли;
						
						//Аверсон-софт, Островская Татьяна 31.05.2012 № 15431
						если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
							НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							если Результ.Пустой() тогда
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
							КонецЕсли;
						ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
							НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
						// О.Т. 03.11.2014 267
						ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
							НазваниеЯчейкиВБазе = МассивПриставок[3]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
	                    ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
							НазваниеЯчейкиВБазе = МассивПриставок[4]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
						// О.Т. 03.11.2014 267	
						иначе
							НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							если МассивВидВремени.НайтиПоЗначению(Выборка.БукваВидаВремени)= Неопределено Тогда
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = "";
							КонецЕсли;
							//Продолжить;
						КонецЕсли;
						
						
						//Островская Татьяна 18.12.2012 № 16065
						если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
							если Выборка.ОсновноеЗначение1 = 0 Тогда 
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
							иначе
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
							КонецЕсли;
							
						КонецЕсли;
						если МассивВидВремени.НайтиПоЗначению(Выборка.БукваВидаВремени)<> Неопределено Тогда
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени.БуквенныйКод;
						КонецЕсли;
						
						
						//Островская Татьяна 18.12.2012 № 16065
						//Островская Татьяна 15.04.2014 № 17276
						если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
						КонецЕсли;
						//Островская Татьяна 15.04.2014 № 17276
						
						
						ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
						
						если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
							если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда 
								если ЕстьПраздник = Ложь Тогда 
									если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
										НазваниеЯчейкиВБазе = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
										НазваниеЯчейкиВБазе = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
										НазваниеЯчейкиВБазе = МассивПриставок[3]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
                                    ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
										НазваниеЯчейкиВБазе = МассивПриставок[4]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									иначе
										Продолжить;	
									КонецЕсли;
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники;
									если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
										НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
										НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
										НазваниеЯчейкиВБазе = МассивПриставок[3]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
										НазваниеЯчейкиВБазе = МассивПриставок[4]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									иначе
										Продолжить;	
									КонецЕсли;
									
									если Выборка.ОсновноеЗначение1 = 0 Тогда 
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
									иначе
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									если МассивВидВремени.НайтиПоЗначению(Выборка.БукваВидаВремени)<> Неопределено Тогда
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени.БуквенныйКод;
									КонецЕсли;
									ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									ЕстьРабота = Истина;
								КонецЕсли;
							ИначеЕсли  Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда 
								если ЕстьРабота = Ложь Тогда 
									если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
										НазваниеЯчейкиВБазе = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
										НазваниеЯчейкиВБазе = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
										НазваниеЯчейкиВБазе = МассивПриставок[3]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
										НазваниеЯчейкиВБазе = МассивПриставок[4]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									иначе
										Продолжить;
									КонецЕсли;
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
									если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
										НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
										НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
										НазваниеЯчейкиВБазе = МассивПриставок[3]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
										НазваниеЯчейкиВБазе = МассивПриставок[4]+"Часов"+Строка(ИндексЯчейкиВТаблице);
									// О.Т. 03.11.2014 267	
									иначе
										Продолжить;
									КонецЕсли;
									если Выборка.ОсновноеЗначение1 = 0 Тогда 
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
									иначе
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение1;
									КонецЕсли; 
									//Островская Татьяна 15.04.2014 № 17276
									если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
									КонецЕсли;
									//Островская Татьяна 15.04.2014 № 17276
									если МассивВидВремени.НайтиПоЗначению(Выборка.БукваВидаВремени)<> Неопределено Тогда
										СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени.БуквенныйКод;
									КонецЕсли;
									ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
									ЕстьПраздник = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						//Толик
						Если ПрочиеПроцедуры.ПроверкаНаДействиеВидаНачисления(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("085"), Выборка.Сотрудник, Организация, НачалоМесяца(ПериодРегистрации), КонецМесяца(ПериодРегистрации)) И Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
							Если ИндексМассиваПриставок > 2 Тогда
								// На данный момент мы можем вводить только 3 вида времени в один день
								Прервать;
							КонецЕсли;
							если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
								НазваниеЯчейкиВБазе = МассивПриставок[0]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
								НазваниеЯчейкиВБазе = МассивПриставок[1]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							// О.Т. 03.11.2014 267	
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
								НазваниеЯчейкиВБазе = МассивПриставок[3]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
								НазваниеЯчейкиВБазе = МассивПриставок[4]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
							// О.Т. 03.11.2014 267	
							иначе
								Продолжить;
							КонецЕсли;
							
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
							если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа тогда
								НазваниеЯчейкиВБазе = МассивПриставок[0]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы тогда
								НазваниеЯчейкиВБазе = МассивПриставок[1]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							// О.Т. 03.11.2014 267
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные тогда
								НазваниеЯчейкиВБазе = МассивПриставок[3]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							ИначеЕсли Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники тогда
								НазваниеЯчейкиВБазе = МассивПриставок[4]+"Часов"+Строка(ИндексЯчейкиВТаблице);
							// О.Т. 03.11.2014 267
							иначе
								Продолжить;
							КонецЕсли;
							СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.ОсновноеЗначение;
							//Островская Татьяна 15.04.2014 № 17276
							если Организация.ЗаполнениеТабелейСУчетомСтавки Тогда 
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе]*СтавкаСотрудника;
							КонецЕсли;
							//Островская Татьяна 15.04.2014 № 17276
							если МассивВидВремени.НайтиПоЗначению(Выборка.БукваВидаВремени)<> Неопределено Тогда
								СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Выборка.БукваВидаВремени.БуквенныйКод;
							КонецЕсли;
							ИндексМассиваПриставок = ИндексМассиваПриставок + 1;
						КонецЕсли;
						//Островская Татьяна 01.02.2013 № 16
						//если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя Тогда
						//	СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = 0;
						//КонецЕсли;
						//Островская Татьяна 22.02.2013 № 15797
						если Выборка.БукваВидаВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда 
							СтрокаРасшифровкиПоДням.ИтогоВредность = СтрокаРасшифровкиПоДням.ИтогоВредность+ СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе];
						КонецЕсли;
						//Островская Татьяна 22.02.2013 № 15797
						
						//енд							
					КонецЦикла;
				КонецЦикла;
				ДеньМес = Выборка.День; 
				если Выборка.День <> День(КонецМесяца(Выборка.Дата)) Тогда
					пока ДеньМес <> День(КонецМесяца(Выборка.Дата)) Цикл 
						ДеньМес = ДеньМес + 1; 
						запросПраздники = Новый Запрос;
						запросПраздники.Текст = 
						"ВЫБРАТЬ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
						|	РегламентированныйПроизводственныйКалендарь.Год,
						|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
						|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
						|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
						|	РегламентированныйПроизводственныйКалендарь.ВидДня
						|ИЗ
						|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
						|ГДЕ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
						запросПраздники.УстановитьПараметр("ДатаКалендаря",Дата(Число(СтрЗаменить(Год(Выборка.Дата)," ","")),Месяц(Выборка.Дата),ДеньМес));
						РезПраздники = запросПраздники.Выполнить().Выбрать();
						если РезПраздники.Следующий() Тогда 
							если РезПраздники.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота или
								РезПраздники.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье или
								РезПраздники.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда //О.Т. Аверсон 08.01.2019 № 3009 доб праздник
								
								ИндексЯчейкиВТаблице = ДеньМес;
								НазваниеЯчейкиВБазе = МассивПриставок[2]+"ВидВремени"+Строка(ИндексЯчейкиВТаблице);
								// О.Т. 04.11.2014 267
								запросДок.УстановитьПараметр("ДатаФакт",Дата(Число(СтрЗаменить(Год(Выборка.Дата)," ","")),Месяц(Выборка.Дата),ДеньМес));
								запросДок.УстановитьПараметр("Сотрудник",Выборка.Сотрудник);
								Результ = запросДок.Выполнить();
								если Результ.Пустой() Тогда 
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
								иначе
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком;
								КонецЕсли;  
								НазваниеЯчейкиВБазе = МассивПриставок[2]+"Часов"+Строка(ИндексЯчейкиВТаблице);
								если Результ.Пустой() Тогда
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = "В";
								иначе
									СтрокаРасшифровкиПоДням[НазваниеЯчейкиВБазе] = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком.БуквенныйКод
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Аверсон ЕАЕ 20.09.2021 СВФР-008061
			// О.Т. 05.12.2014 311
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
			//|ИЗ
			//|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, сотрудник = &Сотрудник) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			//|ГДЕ
			//|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.основныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда)
			//|	И ВЫБОР
			//|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &Период
			//|					И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			//|				ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
			//|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
			//|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
			//
			//Запрос.УстановитьПараметр("Период", ПериодРегистрации);
			//Запрос.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
			//
			//ЕстьВредность = Запрос.Выполнить().Выгрузить();
			
			//если ЕстьВредность.Количество()>0 Тогда
			
			//ЕстьИндивидуальный = Ложь;
			//ЗапросАвтоЗаполнения.Текст = 
			//"ВЫБРАТЬ
			//|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			//|	СУММА(ВТГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ОсновноеЗначение,
			//|	ВТГрафикиРаботыПоВидамВремени.План,
			//|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени
			//|ИЗ
			//|	ВТГрафикиРаботыПоВидамВремени КАК ВТГрафикиРаботыПоВидамВремени
			//|ГДЕ
			//|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
			//|	И ВТГрафикиРаботыПоВидамВремени.План = &План
			//|СГРУППИРОВАТЬ ПО
			//|	ВТГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			//|	ВТГрафикиРаботыПоВидамВремени.План,
			//|	ВТГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
			//
			//ЗапросАвтоЗаполнения.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);
			//ЗапросАвтоЗаполнения.УстановитьПараметр("План", Истина);
			//
			//РезультатГрафик = ЗапросАвтоЗаполнения.Выполнить().Выбрать();
			//
			//Пока РезультатГрафик.Следующий() Цикл
			//	если ТипЗнч(РезультатГрафик.ГрафикРаботы) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда 
			//		ЕстьИндивидуальный = Истина;
			//		ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
			//	КонецЕсли;
			//	если не ЕстьИндивидуальный Тогда 
			//		ГрафикЧасов = РезультатГрафик.ОсновноеЗначение;
			//	КонецЕсли;
			//	
			//	
			//КонецЦикла;
			//Если СтрокаРасшифровкиПоДням.ИтогоВредность >= ГрафикЧасов Тогда //О.Т. 02.03.2015
			//	СтрокаРасшифровкиПоДням.ИтогоВредность = ГрафикЧасов;
			//КонецЕсли;
			
			//иначе
			//	СтрокаРасшифровкиПоДням.ИтогоВредность = 0;
			//	
			//КонецЕсли;
			// О.Т. 05.12.2014 311
			
			ИтогоВредность = 0;
			
			//Аверсон ЕАЕ 05.10.2021 СВФР-008221
			//Если Организация.ИНН = "100071565" Тогда
			//	ИтогоОтработаноЧасов = 0;
			//КонецЕсли;
			//Аверсон СВФР-008221
			
			Для д = 1 По 31 Цикл
				ИмяКолонкиВидВремени = "ПервыйВидВремени" + СокрЛП(д);
				ЗначениеКолонкиВидВремени = СтрокаРасшифровкиПоДням[ИмяКолонкиВидВремени];
				ИмяКолонкиЧасов = "ПервыйЧасов" + СокрЛП(д);
				ЗначениеКолонкиЧасов = СтрокаРасшифровкиПоДням[ИмяКолонкиЧасов];
				
				Если ЗначениеКолонкиВидВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
					Продолжить;
				КонецЕсли;
				
				ПроверяемаяДата = Дата(Год(ПериодРегистрации), Месяц(ПериодРегистрации), д);
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ДатаКалендаря", ПроверяемаяДата);
				СтруктураОтбора.Вставить("Сотрудник", СтрокаРасшифровкиПоДням.Сотрудник);
				МассивСтрок = ТЗВредность.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество() > 0 Тогда
					ИтогоВредность = ИтогоВредность + ЗначениеКолонкиЧасов;	
				КонецЕсли;
				
				//Аверсон ЕАЕ 05.10.2021 СВФР-008221
				//Если Организация.ИНН = "100071565" Тогда
				//	ИтогоОтработаноЧасов = ИтогоОтработаноЧасов + ЗначениеКолонкиЧасов;
				//КонецЕсли;
				//Аверсон СВФР-008221

			КонецЦикла;
			СтрокаРасшифровкиПоДням.ИтогоВредность = ИтогоВредность;
			
			//Аверсон СВФР-008061
			
			//Аверсон ЕАЕ 05.10.2021 СВФР-008221
			//Если Организация.ИНН = "100071565" Тогда
			//	Если РабочихЧасовВМесяце = 0 Тогда
			//		СтрокаРасшифровкиПоДням.ИтогоВредность = 0;	
			//	Иначе
			//		Если ИтогоОтработаноЧасов / РабочихЧасовВМесяце * 100 < 80 Тогда
			//			СтрокаРасшифровкиПоДням.ИтогоВредность = 0;	
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			//Аверсон СВФР-008221
		КонецЦикла;
		
	КонецЕсли;	
КонецФункции // Автозаполнение()

#Если Клиент Тогда
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	// Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//	НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Макет = ПолучитьМакет("МакетГрафик");
		ДокументРезультат = Новый ТабличныйДокумент;
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ДокументРезультат.ПолеСлева = 0;
		ДокументРезультат.ПолеСправа = 0;
		ОбластьДанныхЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьДанныхШапка 		= Макет.ПолучитьОбласть("Шапка|ДниЧасть1");
		ОбластьДанныхШапка2 		= Макет.ПолучитьОбласть("Шапка|ДниЧасть2");
		
		ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
		если ИмяМакета = "ТабельН" Тогда
			ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть1");
			
			ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть2");
			
			ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
		иначе
			ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть1");
			
			ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть2");
			
			ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
			
		КонецЕсли;
		ОбластьДанныхИтог		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧасть1");
		ОбластьДанныхИтог2		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧасть2");
		
		ОбластьДанныхИтогДоп	= Макет.ПолучитьОбласть("ИтогСтрока|ДниПлав");
		ОбластьДанныхПодвал		= Макет.ПолучитьОбласть("Подвал");
		
		ОбластьДанныхЗаголовок.Параметры.Период    = Формат(ПериодРегистрации,"ДФ=""ММММ гггг""");
		
		//заполним ответсвенных в документе
		если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ФИОРукПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРукПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРукПодразделения.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРукПодразделения,
			|	РуководительПодразделения.Должность,
			|	ФИОКадры.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадры.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадры.Отчество КАК СТРОКА(1))) + ""."" КАК СотрудникКадры,
			|	ОрганизацииОтветственныеЛица.Должность КАК ДолжностьКадры,
			|	ФИОРуководитель.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководитель.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководитель.Отчество КАК СТРОКА(1))) + ""."" КАК Руководитель,
			|	ОтветственныеЛицаРуководитель.Должность КАК ДолжностьДиректор
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
			|				&ДатаСреза,
			|				СтруктурнаяЕдиница = &Подразделение1
			|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения)) КАК РуководительПодразделения
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРукПодразделения
			|			ПО РуководительПодразделения.ФизическоеЛицо = ФИОРукПодразделения.ФизЛицо
			|		ПО ПодразделенияОрганизаций.Ссылка = РуководительПодразделения.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОтветственныеЛицаРуководитель
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководитель
			|				ПО ОтветственныеЛицаРуководитель.Сотрудник.Физлицо = ФИОРуководитель.ФизЛицо
			|			ПО Организации.Ссылка = ОтветственныеЛицаРуководитель.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации1
			|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадры
			|					ПО ОрганизацииОтветственныеЛица.Сотрудник.Физлицо = ФИОКадры.ФизЛицо
			|				ПО Организации1.Ссылка = ОрганизацииОтветственныеЛица.Ссылка
			|			ПО Организации.Ссылка = Организации1.Ссылка
			|		ПО ПодразделенияОрганизаций.Владелец = Организации.Ссылка
			|ГДЕ
			|	ПодразделенияОрганизаций.Ссылка = &Подразделение1
			|	И ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.специалистКадровойСлужбы)
			|	И Организации.Ссылка = &Организация
			|	И ОтветственныеЛицаРуководитель.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)");
		иначе
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ФИОКадры.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадры.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадры.Отчество КАК СТРОКА(1))) + ""."" КАК СотрудникКадры,
			|	ОрганизацииОтветственныеЛица.Должность КАК ДолжностьКадры,
			|	ФИОРуководитель.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководитель.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководитель.Отчество КАК СТРОКА(1))) + ""."" КАК Руководитель,
			|	ОтветственныеЛицаРуководитель.Должность КАК ДолжностьДиректор
			|ИЗ
			|	Справочник.Организации КАК Организации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации1
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадры
			|				ПО ОрганизацииОтветственныеЛица.Сотрудник.Физлицо = ФИОКадры.ФизЛицо
			|			ПО Организации1.Ссылка = ОрганизацииОтветственныеЛица.Ссылка
			|		ПО Организации.Ссылка = Организации1.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОтветственныеЛицаРуководитель
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководитель
			|			ПО ОтветственныеЛицаРуководитель.Сотрудник.Физлицо = ФИОРуководитель.ФизЛицо
			|		ПО Организации.Ссылка = ОтветственныеЛицаРуководитель.Ссылка
			|ГДЕ
			|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.СпециалистКадровойСлужбы)
			|	И Организации.Ссылка = &Организация
			|	И ОтветственныеЛицаРуководитель.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаСреза",         КонецМесяца(ПериодРегистрации));
		Если ПодразделениеОрганизации <> Неопределено тогда
			Запрос.УстановитьПараметр("Подразделение",     Организация);
		Иначе
			Запрос.УстановитьПараметр("Подразделение",     ПодразделениеОрганизации);
		КонецЕсли;
		Запрос.УстановитьПараметр("Подразделение1",     ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("Организация",       Организация);
		Если Ответственный <> Неопределено тогда           
			Запрос.УстановитьПараметр("ФизЛицо", Ответственный.ФизЛицо);
		Иначе
			Запрос.УстановитьПараметр("ФизЛицо", Неопределено);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			ОбластьДанныхПодвал.Параметры.Заполнить(Выборка);
			ОбластьДанныхЗаголовок.Параметры.Заполнить(Выборка);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		|	РегламентированныйПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаКалендаря И &ДатаКалендаря1
		|	И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
		|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
		|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник))";
		
		Запрос.УстановитьПараметр("ДатаКалендаря", НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("ДатаКалендаря1", КонецМесяца(ПериодРегистрации));
		
		Результат = Запрос.Выполнить();
		
		ВидПоКалендарю = Результат.Выгрузить();
		для Каждого СтрДата из ВидПоКалендарю Цикл 
			День = День(СтрДата.ДатаКалендаря);
			если День >= 29 и День <= День(КонецМесяца(ПериодРегистрации)) Тогда 
				ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
				ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
			ИначеЕсли День <= День(КонецМесяца(ПериодРегистрации)) Тогда 
				ОбластьД = ОбластьДанныхШапка.Область(2,День+3,2,День+3); 
				ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;
			
		КонецЦикла;
		СтокаВыведена = Ложь;
		ОбластьДанныхЗаголовок.Параметры.Организация = СОКРЛП(Организация);
		ОбластьДанныхЗаголовок.Параметры.Подразделение = СОКРЛП(ПодразделениеОрганизации);  
		ДокументРезультат.Вывести(ОбластьДанныхЗаголовок);
		ДниДобавить = День(КонецМесяца(ПериодРегистрации))-28;
		ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
		ОбластьД.Объединить();
		ДокументРезультат.Вывести(ОбластьДанныхШапка);
		для стр = 29 по День(КонецМесяца(ПериодРегистрации)) Цикл
			ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
			для Каждого СтрДата из ВидПоКалендарю Цикл 
				 
				День = День(СтрДата.ДатаКалендаря); 
				если День = стр Тогда 
					ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
					ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
			ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
		КонецЦикла;
		ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
		НомерПП = 0;
		
		СчДни = 0;
		ИтогОтпуск = 0;
		ИтогУчеба = 0;
		ИтогПрогул = 0;
		ИтогОтпускБезСохранения = 0;
		ИтогБольничный = 0;
		ИтогВыходные = 0;
		ИтогНочные = 0;
		ИтогДней = 0;
		ИтогЧасов = 0;
		ИтогРаботаВВых = 0;
		ИтогВредность = 0;
		// О.Т. 03.11.2014 267
		ИтогСверхурочные = 0 ;
		ИтогПраздничные = 0 ;
		// О.Т. 03.11.2014 267
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = " Выбрать * Поместить ВТВремТабл из &ТаблОтработанВремя как ф";
		Запрос.УстановитьПараметр("ТаблОтработанВремя",ОтработанноеВремя);
		Запрос.Выполнить();
		Запрос.Текст = "Выбрать * из ВТВремТабл";
		Если СпособСортировкиПечФормы Тогда 
			Запрос.Текст = Запрос.Текст + " Упорядочить ПО ВТВремТабл.Сотрудник.Код";
		иначе
			Запрос.Текст = Запрос.Текст + " Упорядочить ПО ВТВремТабл.Сотрудник.Наименование";
		КонецЕсли;
		
		РезОтработанноеВремя = Запрос.Выполнить().Выгрузить();
		ПроверкаМассив = Новый Массив;
		ПроверкаМассив.Добавить(ОбластьДанныхЗаголовок);
		ПроверкаМассив.Добавить(ОбластьДанныхШапка);
		ПроверкаМассив.Добавить(ОбластьДанныхСтрока);
		Для Каждого ВыборкаПоРаботнику из РезОтработанноеВремя Цикл 
			КолОтпуск = 0;
			КолУчеба = 0;
			КолПрогул = 0;
			КолОтпускБезСохранения = 0;
			КолБольничный = 0;
			КолВыходные = 0;
			КолПраздничные = 0;
			КолНочные = 0;
			КолДеньОтраб = 0;
			КолЧасОтраб = 0;
			КолРаботаВВых = 0;
			// О.Т. 03.11.2014 267
			КолСверхурочные = 0;
			КолПраздничные = 0;
			// О.Т. 03.11.2014 267

			//Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
			//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			//КонецЕсли;
			
						
			если ИмяМакета = "ТабельН" Тогда
				ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть1");
				
				ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть2");
				
				ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
			иначе
				ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть1");
				
				ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть2");
				ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
				
			КонецЕсли; 
			НомерПП = НомерПП + 1;
            ДолжностьСтруктура = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ВыборкаПоРаботнику.Сотрудник));
			ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
			ОбластьДанныхСтрока.Параметры.ТабельныйНомер = СокрЛП(ВыборкаПоРаботнику.Сотрудник.Код);
			ОбластьДанныхСтрока.Параметры.Работник = СокрП(ОбщегоНазначения.ФамилияИнициалыФизЛица(ВыборкаПоРаботнику.Сотрудник)) + ", " + Символы.ПС + ДолжностьСтруктура.Должность;
			ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
			
			
			Для мС = 1 По День(КонецМесяца(ПериодРегистрации)) Цикл
				мДата = Дата(Год(ПериодРегистрации), Месяц(ПериодРегистрации), мС, 0, 0, 0); 
				если мС >= 29 Тогда
					если ИмяМакета = "ТабельН" Тогда
						ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
					иначе
						ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
					КонецЕсли;
				КонецЕсли;
				если ЗначениеЗаполнено(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) Тогда 
					если ВыборкаПоРаботнику["ПервыйЧасов"+Мс]> 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]> 0 Тогда 
						
						если мС >= 29 Тогда
							ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1);
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						Иначе 
							ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3);
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						КонецЕсли;
						КолДеньОтраб = КолДеньОтраб + 1;
						КолЧасОтраб = КолЧасОтраб + ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						если мС >= 29 Тогда
							ОбластьДанныхСтрокаДоп.Параметры["Н"] = ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						Иначе 
							ОбластьДанныхСтрока.Параметры["Н"+СокрЛП(Строка(мС))] = ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						КонецЕсли;
 						КолНочные = КолНочные + ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						
						
						если ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "О"  Тогда 
							КолОтпуск = КолОтпуск + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "В"  Тогда 
							КолВыходные = КолВыходные + 1;
							КолРаботаВВых = КолРаботаВВых+1;
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;// О.Т. 03.12.2014 
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Б"  Тогда 
							КолБольничный = КолБольничный + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "А"  Тогда 
							КолОтпускБезСохранения = КолОтпускБезСохранения + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "У"  Тогда 
							КолУчеба = КолУчеба + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Пр" или ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "ПР"  Тогда 
							КолПрогул = КолПрогул + 1;
						КонецЕсли;

						
					ИначеЕсли ВыборкаПоРаботнику["ПервыйЧасов"+Мс]= 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]= 0 Тогда
						если мС >= 29 Тогда
							если ИмяМакета = "ТабельН" Тогда
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
								ОбластьД.Объединить();
							иначе
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,1,1);
							КонецЕсли;
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ТретийЧасов"+Мс];
						Иначе 
							если ИмяМакета = "ТабельН" Тогда
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
								ОбластьД.Объединить();
							иначе
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,1,мС+3);
							КонецЕсли;
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = ВыборкаПоРаботнику["ТретийЧасов"+Мс];
						КонецЕсли; 
						если ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "О"  Тогда 
							КолОтпуск = КолОтпуск + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "В"  Тогда 
							КолВыходные = КолВыходные + 1;
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;// О.Т. 03.12.2014 
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Б"  Тогда 
							КолБольничный = КолБольничный + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "А"  Тогда 
							КолОтпускБезСохранения = КолОтпускБезСохранения + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "У"  Тогда 
							КолУчеба = КолУчеба + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Пр" или ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "ПР"  Тогда 
							КолПрогул = КолПрогул + 1;
						КонецЕсли;
						
						
						
					иначеЕсли ВыборкаПоРаботнику["ПервыйЧасов"+Мс]> 0  Тогда 
						
						если мС >= 29 Тогда
							если ИмяМакета = "ТабельН" Тогда
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
								ОбластьД.Объединить();
							иначе
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,1,1);
							КонецЕсли;
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						Иначе 
							если ИмяМакета = "ТабельН" Тогда
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
								ОбластьД.Объединить();
							иначе
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,1,мС+3);
							КонецЕсли;
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						КонецЕсли;
						КолДеньОтраб = КолДеньОтраб + 1;
						КолЧасОтраб = КолЧасОтраб + ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						
						если ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "О"  Тогда 
							КолОтпуск = КолОтпуск + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "В"  Тогда 
							КолВыходные = КолВыходные + 1;
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;// О.Т. 03.12.2014 
							КолРаботаВВых = КолРаботаВВых + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Б"  Тогда 
							КолБольничный = КолБольничный + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "А"  Тогда 
							КолОтпускБезСохранения = КолОтпускБезСохранения + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "У"  Тогда 
							КолУчеба = КолУчеба + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Пр" или ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "ПР"  Тогда 
							КолПрогул = КолПрогул + 1;
						КонецЕсли;

					иначеЕсли ВыборкаПоРаботнику["ВторойЧасов"+Мс]> 0  Тогда	
						если мС >= 29 Тогда
							ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
							ОбластьД.Объединить();
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						Иначе 
							ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
							ОбластьД.Объединить();
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))]= ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						КонецЕсли;
 
						КолНочные = КолНочные + ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						 
						если ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "О"  Тогда 
							КолОтпуск = КолОтпуск + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "В"  Тогда 
							КолВыходные = КолВыходные + 1;
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;// О.Т. 03.12.2014 
							КолРаботаВВых = КолРаботаВВых + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Б"  Тогда 
							КолБольничный = КолБольничный + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "А"  Тогда 
							КолОтпускБезСохранения = КолОтпускБезСохранения + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "У"  Тогда 
							КолУчеба = КолУчеба + 1;
						ИначеЕсли ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "Пр" или ВРег(ВыборкаПоРаботнику["ТретийЧасов"+Мс]) = "ПР"  Тогда 
							КолПрогул = КолПрогул + 1;
						КонецЕсли;

					КонецЕсли;
					
				иначе
					если (ВыборкаПоРаботнику["ПервыйЧасов"+Мс]> 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]= 0) Тогда 
						если мС >= 29 Тогда
							ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
							ОбластьД.Объединить();
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						Иначе  
							ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
							ОбластьД.Объединить();
							
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))]= ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						КонецЕсли; 
						КолДеньОтраб = КолДеньОтраб + 1;
						КолЧасОтраб = КолЧасОтраб + ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
					ИначеЕсли (ВыборкаПоРаботнику["ПервыйЧасов"+Мс]= 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]> 0) Тогда 
						если мС >= 29 Тогда
							ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
							ОбластьД.Объединить();
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						Иначе 
							ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
							ОбластьД.Объединить();
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))]= ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						КонецЕсли;  
						КолНочные = КолНочные + ВыборкаПоРаботнику["ВторойЧасов"+Мс];
					ИначеЕсли ВыборкаПоРаботнику["ПервыйЧасов"+Мс]= 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]= 0 Тогда 
						если ИмяМакета = "ТабельН" Тогда
							если мС >= 29 Тогда
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1); 
								ОбластьД.Объединить();
							Иначе 
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
								ОбластьД.Объединить();
							КонецЕсли;
						иначе
							если мС >= 29 Тогда
								ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,1,1); 
							Иначе 
								ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,1,мС+3); 
							КонецЕсли;

						КонецЕсли;

					иначеЕсли ВыборкаПоРаботнику["ПервыйЧасов"+Мс]> 0 и ВыборкаПоРаботнику["ВторойЧасов"+Мс]> 0 Тогда
						если мС >= 29 Тогда
							ОбластьДанныхСтрокаДоп.Параметры["Я"] = ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						Иначе 
							ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))]= ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						КонецЕсли;
						КолДеньОтраб = КолДеньОтраб + 1;
						КолЧасОтраб = КолЧасОтраб + ВыборкаПоРаботнику["ПервыйЧасов"+Мс];
						если мС >= 29 Тогда
							ОбластьДанныхСтрокаДоп.Параметры["Н"] = ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						Иначе 
							ОбластьДанныхСтрока.Параметры["Н"+СокрЛП(Строка(мС))]= ВыборкаПоРаботнику["ВторойЧасов"+Мс];
						КонецЕсли; 
						
						КолНочные = КолНочные + ВыборкаПоРаботнику["ВторойЧасов"+Мс];
					 
					КонецЕсли;
					
					
					
				КонецЕсли; 
				Если ВыборкаПоРаботнику["ЧетвертыйЧасов"+Мс]> 0 Тогда 
					КолСверхурочные = КолСверхурочные + ВыборкаПоРаботнику["ЧетвертыйЧасов"+Мс];
				КонецЕсли;
				Если ВыборкаПоРаботнику["ПятыйЧасов"+Мс]> 0 Тогда	
					КолПраздничные = КолПраздничные + ВыборкаПоРаботнику["ПятыйЧасов"+Мс];
				КонецЕсли;	
				если мС >= 28 Тогда //О.Т. 27.02.2015 (февраль чтобы правильно был)
					если не СтокаВыведена Тогда 
						СтокаВыведена = Истина;
						ДокументРезультат.Вывести(ОбластьДанныхСтрока);
					КонецЕсли;
					если мС >= 29 Тогда
					ДокументРезультат.Присоединить(ОбластьДанныхСтрокаДоп);
					КонецЕсли;
				КонецЕсли;
				
				
				
				
			КонецЦикла;
			//Для стрДень = Мс-1 по 31 Цикл 
			//	ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3); 
			//	ОбластьД.Объединить();
			//КонецЦикла;
			СтокаВыведена = Ложь;
			//ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
			
			
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			//Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
			//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			//	СчДни = СчДни + 2;
			//	ДокументРезультат.Вывести(ОбластьДанныхШапка);
			//КонецЕсли;
			// О.Т. 03.11.2014 267
			ОбластьДанныхСтрока2.Параметры.ИтогоСверхурочные = ?(КолСверхурочные=0,"0",КолСверхурочные);
			ОбластьДанныхСтрока2.Параметры.ИтогоПраздники = ?(КолПраздничные=0,"0",КолПраздничные);
			// О.Т. 03.11.2014 267
			ОбластьДанныхСтрока2.Параметры.Вых = ?(КолВыходные=0,"0",КолВыходные-КолРаботаВВых);
			ОбластьДанныхСтрока2.Параметры.Ночные = ?(КолНочные=0,"0",КолНочные);
			если ОтличаютсяВредныеЧасы Тогда
				ОбластьДанныхСтрока2.Параметры.Вредность = ?(ОтличаютсяВредныеЧасы,?(ВыборкаПоРаботнику.ИтогоВредность = 0,"0",ВыборкаПоРаботнику.ИтогоВредность),
				?(КолЧасОтраб=0,"0",КолЧасОтраб));
			КонецЕсли;
			
			ИтогВредность = ИтогВредность + ВыборкаПоРаботнику.ИтогоВредность;
			
			ОбластьДанныхСтрока2.Параметры.ИтогоЧасов = ?(КолЧасОтраб=0,"0",КолЧасОтраб);
			ОбластьДанныхСтрока2.Параметры.ИтогоДней = ?(КолДеньОтраб=0,"0",КолДеньОтраб);
			ОбластьДанныхСтрока2.Параметры.Отпуск = ?(КолОтпуск=0,"0",КолОтпуск);
			ОбластьДанныхСтрока2.Параметры.Учеба = ?(КолУчеба=0,"0",КолУчеба);
			ОбластьДанныхСтрока2.Параметры.Прогул = ?(КолПрогул=0,"0",КолПрогул);
			ОбластьДанныхСтрока2.Параметры.ОтпускБезСох = ?(КолОтпускБезСохранения=0,"0",КолОтпускБезСохранения);
			ОбластьДанныхСтрока2.Параметры.Больничный = ?(КолБольничный=0,"0",КолБольничный);
			ОбластьДанныхСтрока2.Параметры.РаботаВВых = ?(КолРаботаВВых=0,"0",КолРаботаВВых);


			
			
			
			ДокументРезультат.Присоединить(ОбластьДанныхСтрока2);
			Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
				ПроверкаМассив = Новый Массив;
				ПроверкаМассив.Добавить(ОбластьДанныхШапка);
				ПроверкаМассив.Добавить(ОбластьДанныхСтрока);
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				СчДни = СчДни + 2;
				ДниДобавить = День(КонецМесяца(ПериодРегистрации))-28;
				ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
				ОбластьД.Объединить();
				ДокументРезультат.Вывести(ОбластьДанныхШапка);
				для стр = 29 по День(КонецМесяца(ПериодРегистрации)) Цикл
					ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
					для Каждого СтрДата из ВидПоКалендарю Цикл 
						
						День = День(СтрДата.ДатаКалендаря); 
						если День = стр Тогда 
							ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
					ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
				КонецЦикла;
				ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
			КонецЕсли;

			
			
			СчДни = СчДни + 1;	
			ИтогВыходные = ИтогВыходные + КолВыходные;
			ИтогНочные = ИтогНочные + КолНочные;
			ИтогДней = ИтогДней + КолДеньОтраб;
			ИтогЧасов = ИтогЧасов + КолЧасОтраб;
			
			ИтогОтпуск = ИтогОтпуск + КолОтпуск;
			ИтогУчеба = ИтогУчеба + КолУчеба;
			ИтогПрогул = ИтогПрогул + КолПрогул;
			ИтогОтпускБезСохранения = ИтогОтпускБезСохранения + КолОтпускБезСохранения;
			ИтогБольничный = ИтогБольничный + КолБольничный;
			ИтогРаботаВВых = ИтогРаботаВВых + КолРаботаВВых;
			// О.Т. 03.11.2014 267
			ИтогСверхурочные = ИтогСверхурочные + КолСверхурочные;
			ИтогПраздничные = ИтогПраздничные + КолПраздничные;
			// О.Т. 03.11.2014 267
			
			
		КонецЦикла;
		
		
		Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
			ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
			ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(ОбластьДанныхШапка);
			//О.Т. Аверсон 07.04.2016
			для стр = 29 по День(КонецМесяца(ПериодРегистрации)) Цикл
				ОбластьДанныхШапкаДоп   = Макет.ПолучитьОбласть("Шапка|ДниПлав");
				для Каждого СтрДата из ВидПоКалендарю Цикл 
					
					День = День(СтрДата.ДатаКалендаря); 
					если День = стр Тогда 
						ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
						ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
				ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
			КонецЦикла;
			//О.Т. Аверсон 07.04.2016
			ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
		КонецЕсли;
		ОбластьДанныхИтог2.Параметры.ИтогВых = ?(ИтогВыходные=0,"0",ИтогВыходные-ИтогРаботаВВых);
		ОбластьДанныхИтог2.Параметры.ИтогНочные = ?(ИтогНочные=0,"0",ИтогНочные);
		если ОтличаютсяВредныеЧасы Тогда
			ОбластьДанныхИтог2.Параметры.ИтогВредность = ?(ОтличаютсяВредныеЧасы, ИтогВредность,?(ИтогЧасов=0,"0",ИтогЧасов));
		КонецЕсли;
		ОбластьДанныхИтог2.Параметры.ИтогИтогоДней = ?(ИтогДней=0,"0",ИтогДней);
		ОбластьДанныхИтог2.Параметры.ИтогИтогоЧасов = ?(ИтогЧасов=0,"0",ИтогЧасов);
		
		ОбластьДанныхИтог2.Параметры.ИтогОтпуск = ?(ИтогОтпуск=0,"0",ИтогОтпуск);
		ОбластьДанныхИтог2.Параметры.ИтогУчеба = ?(ИтогУчеба=0,"0",ИтогУчеба);
		ОбластьДанныхИтог2.Параметры.ИтогПрогул = ?(ИтогПрогул=0,"0",ИтогПрогул);
		ОбластьДанныхИтог2.Параметры.ИтогОтпускБезСох = ?(ИтогОтпускБезСохранения=0,"0",ИтогОтпускБезСохранения);
		ОбластьДанныхИтог2.Параметры.ИтогБольничный = ?(ИтогБольничный=0,"0",ИтогБольничный);
		ОбластьДанныхИтог2.Параметры.ИтогРаботаВВых = ?(ИтогРаботаВВых=0,"0",ИтогРаботаВВых);
		// О.Т. 03.11.2014 267
		ОбластьДанныхИтог2.Параметры.ИтогИтогоСверхурочные = ?(ИтогСверхурочные=0,"0",ИтогСверхурочные);
        ОбластьДанныхИтог2.Параметры.ИтогИтогоПраздники = ?(ИтогПраздничные=0,"0",ИтогПраздничные);
		// О.Т. 03.11.2014 267
		ДокументРезультат.Вывести(ОбластьДанныхИтог);
		для стр = 29 по День(КонецМесяца(ПериодРегистрации)) Цикл
			ОбластьДанныхИтогДоп	= Макет.ПолучитьОбласть("ИтогСтрока|ДниПлав");
			ДокументРезультат.Присоединить(ОбластьДанныхИтогДоп);
		КонецЦикла;
		
		ДокументРезультат.Присоединить(ОбластьДанныхИтог2);
		ДокументРезультат.Вывести(ОбластьДанныхПодвал);
		
		
		РаботаСДиалогами.НапечататьДокумент(ДокументРезультат, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним + " Табель"));
		
	КонецФункции // Печать()
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	
	СтруктураМакетов.Вставить("Табель",	"Табель"); 
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция возвращает значение перечислеиня ВидыУчетаВремени, соответствующее 
// справочнику КлассификаторИспользованияРабочегоВремени.
Функция ПолучитьВидУчетаВремениПоКлассификатору(ВидВремени)
	
	Если ВидВремени.Пустая() Тогда
		Возврат ВидУчетаВремениПоЧасам;
	ИначеЕсли ВидВремени = КлассификаторВечернееВремя Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
	ИначеЕсли ВидВремени = КлассификаторНочноеВремя Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
		//толик
	ИначеЕсли ВидВремени = КлассификаторВредность Тогда
		Возврат Перечисления.ВидыУчетаВремени.ПоВредность;
	Иначе
		Возврат ВидУчетаВремениПоЧасам;
	КонецЕсли;
	
КонецФункции

// процедура проверяет, нет ли уже аналогичных записей с ключевыми полями в регистре сведений
// ГрафикиРаботыПоВидамВремени.
// Возвращает Истина если проведение возможно, иначе Ложь.
Процедура ПроверитьУникальностьЗаписи(Отказ, Заголовок = "")
	
	ЗапросПроверкаУникальности = Новый Запрос;
	
	ЗапросПроверкаУникальности.УстановитьПараметр("ДокументСсылка", Ссылка);
	ЗапросПроверкаУникальности.УстановитьПараметр("Месяц", ПериодРегистрации);
	ЗапросПроверкаУникальности.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПериодРегистрации));
	ЗапросПроверкаУникальности.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	
	ЗапросПроверкаУникальности.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(РабочееВремяРаботниковОрганизаций.Регистратор, ГрафикиРаботыПоВидамВремени.Документ)) КАК ДокументПредставление,
	|	ЕСТЬNULL(СотрудникиТабеля.Сотрудник.Наименование, ГрафикиРаботыПоВидамВремени.ГрафикРаботы.Наименование) КАК СотрудникНаименование
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПоДням.Сотрудник КАК Сотрудник
	|	ИЗ
	|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТаблицаПоДням
	|	ГДЕ
	|		ТаблицаПоДням.Ссылка = &ДокументСсылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВЦеломЗаПериод.Сотрудник
	|	ИЗ
	|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремяВЦеломЗаПериод КАК ТаблицаВЦеломЗаПериод
	|	ГДЕ
	|		ТаблицаВЦеломЗаПериод.Ссылка = &ДокументСсылка) КАК СотрудникиТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|		ПО РабочееВремяРаботниковОрганизаций.Сотрудник = СотрудникиТабеля.Сотрудник
	|			И (РабочееВремяРаботниковОрганизаций.Регистратор <> &ДокументСсылка)
	|			И (РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод
	|					И РабочееВремяРаботниковОрганизаций.Период = &Месяц
	|				ИЛИ (НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
	|					И (РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоМесяца И &КонецМесяца))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СотрудникиТабеля.Сотрудник
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
	|			И (ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|			И (ГрафикиРаботыПоВидамВремени.Документ <> &ДокументСсылка)
	|			И (НЕ ГрафикиРаботыПоВидамВремени.План)
	|			И (НЕ ГрафикиРаботыПоВидамВремени.Документ В (ЗНАЧЕНИЕ(Документ.КадровыйТабельУчетаРабочегоВремени.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.СдельныйНаряд.ПустаяСсылка)))
	|ГДЕ
	|	((НЕ РабочееВремяРаботниковОрганизаций.НомерСтроки ЕСТЬ NULL )
	|			ИЛИ (НЕ ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ))";
	
	ВыборкаРезультата = ЗапросПроверкаУникальности.Выполнить().Выбрать();
	Если ВыборкаРезультата.Количество() > 0 Тогда
		СтрокаСотрудников = "";
		
		Пока ВыборкаРезультата.Следующий() Цикл
			СтрокаСотрудников = СтрокаСотрудников + Символы.ПС + ВыборкаРезультата.СотрудникНаименование+ " ("+ВыборкаРезультата.ДокументПредставление+")";
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьОбОшибке("На следующих сотрудников уже введены документы учета отработанного времени в этом периоде" + СтрокаСотрудников,Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьУникальностьЗаписи()	

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ГоловнаяОрганизация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой вводится табель!", Отказ, Заголовок);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениОрганизации.Дата,
	|	ТабельУчетаРабочегоВремениОрганизации.ПериодРегистрации,
	|	ТабельУчетаРабочегоВремениОрганизации.ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА ТабельУчетаРабочегоВремениОрганизации.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА ТабельУчетаРабочегоВремениОрганизации.Организация
	|		ИНАЧЕ ТабельУчетаРабочегоВремениОрганизации.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ТабельУчетаРабочегоВремениОрганизации.Организация Как Организация,
	|	ТабельУчетаРабочегоВремениОрганизации.Ссылка КАК Документ
	|ИЗ
	|	Документ.КадровыйТабельУчетаРабочегоВремени КАК ТабельУчетаРабочегоВремениОрганизации
	|ГДЕ
	|	ТабельУчетаРабочегоВремениОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "ОтработанноеВремя" документа
//
// Параметры:
//	ВыборкаПоШапкеДокумента
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДокументСсылка",			 Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	 ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Месяц", 					 ВыборкаПоШапкеДокумента.ПериодРегистрации);
	
	ИндексНачальногоДня = День(ВыборкаПоШапкеДокумента.ПериодРегистрации);
	СтрИндексДня = Строка(ИндексНачальногоДня);
	//Островская Татьяна 13.02.2013 № 15797
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки КАК НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" КАК ВидВремени,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов"+СтрИндексДня+" КАК Часов,
	|		"+СтрИндексДня+" КАК ИндексДня,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|ПОМЕСТИТЬ ВТДанныеТабеляПоДням
	|	ИЗ
	|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Вредность))
	|
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов"+СтрИндексДня+",
	|		"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|	ИЗ
	|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+" НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+",
	|		"+СтрИндексДня+",
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
	|	ИЗ
	|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|	ГДЕ
	|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
	|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+" <> """"
	|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+"  НЕ В 
	|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
	|";
	
	ИндексКонечногоДня = День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
	Для ИндексДня = ИндексНачальногоДня + 1 По ИндексКонечногоДня Цикл
		СтрИндексДня = Строка(ИндексДня);
		Запрос.Текст = Запрос.Текст + 
		"	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени"+СтрИндексДня+" НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка))
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени"+СтрИндексДня+"  НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,		
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+",
		|		"+СтрИндексДня+",
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ИтогоВредность
		|	ИЗ
		|		Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
		|	ГДЕ
		|		ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
		|		И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов"+СтрИндексДня+" <> """"
		|		И (ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени"+СтрИндексДня+"  НЕ В 
		|			(ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка)))
		|
		|";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + 
	"ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	ДанныеТабеляПоДнямТекст = "ВТДанныеТабеляПоДням";
	
    ТекстЗапроса = "ВЫБРАТЬ
    |	ОбщийЗапрос.Сотрудник,
    |	ОбщийЗапрос.ДеньМесяца,
    |	ОбщийЗапрос.ВидВремени, ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка) КАК ВидВремени,
    |	ЕСТЬNULL(ОбщийЗапрос.Часов, 0) КАК Часов,
    |	ВЫБОР 
	|				КОГДА ОбщийЗапрос.ЗаписатьПустогоСотрудника ЕСТЬ NULL
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ КАК ЗаписатьПустоеЗначение,
    |	ЕСТЬNULL(ОбщийЗапрос.НомерСтроки, 0) КАК НомерСтроки,
    |	ВЫБОР
    |				КОГДА ОбщийЗапрос.ПроверкаСотрудникаИОрганизации ЕСТЬ NULL 
    |					ТОГДА ЛОЖЬ
    |				КОГДА ОбщийЗапрос.ПроверкаСотрудникаИОрганизации.Организация = &ГоловнаяОрганизация
    |					ТОГДА ЛОЖЬ
    |				ИНАЧЕ ИСТИНА
    |			КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
    |	ЕСТЬNULL(ОбщийЗапрос.КоличествоДублей, 0) КАК КоличествоДублей,
	|	ЕСТЬNULL(ОбщийЗапрос.ИтогоВредность, 0) как ИтогоВредность

    |	ИЗ
    |	(
    |		ВЫБРАТЬ
    |			СотрудникиДокумента.Сотрудник,
    |			ДанныеТабеляПоДням.ИндексДня КАК ДеньМесяца,
    |			ДанныеТабеляПоДням.ВидВремени КАК ВидВремени,
    |			ДанныеТабеляПоДням.Часов КАК Часов,
    |			ДанныеТабеляПоДням.Сотрудник КАК ЗаписатьПустогоСотрудника,
    |			ДанныеТабеляПоДням.НомерСтроки КАК НомерСтроки,
    |			СотрудникиДокумента.Сотрудник КАК ПроверкаСотрудникаИОрганизации,
    |			СотрудникиДокумента.КоличествоДублей КАК КоличествоДублей,
	|			ДанныеТабеляПоДням.ИтогоВредность КАК ИтогоВредность
    |		ИЗ
    |			(ВЫБРАТЬ
    |			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник,
    |			КОЛИЧЕСТВО(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник) КАК КоличествоДублей,
    |			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка КАК Ссылка
    |		ИЗ
    |			Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
    |		ГДЕ
    |			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
    |		
    |		СГРУППИРОВАТЬ ПО
    |			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
    |			ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка) КАК СотрудникиДокумента
    |				ЛЕВОЕ СОЕДИНЕНИЕ " + ДанныеТабеляПоДнямТекст + " КАК ДанныеТабеляПоДням
    |				ПО ДанныеТабеляПоДням.Сотрудник = СотрудникиДокумента.Сотрудник		
    |		 	
    |		ОБЪЕДИНИТЬ
    |		
    |		ВЫБРАТЬ
    |			Сотрудники.Сотрудник КАК Сотрудник,
    |			Даты.ИндексДня КАК ИндексДня,
    |			NULL,
    |			0,
    |			NULL,
    |			NULL,
    |			NULL,
    |			NULL,
	|			0
    |		ИЗ
    |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
    |				ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник КАК Сотрудник
    |			ИЗ
    |				Документ.КадровыйТабельУчетаРабочегоВремени.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
    |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
    |					ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник
    |						И (ГрафикиРаботыПоВидамВремени.Месяц = &Месяц)
    |						И ((НЕ ГрафикиРаботыПоВидамВремени.План))
    |			ГДЕ
    |				ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &ДокументСсылка
    |				И ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ NULL ) КАК Сотрудники
    |			ЛЕВОЕ СОЕДИНЕНИЕ (";
    
    Для ИндексДня = День(НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)) По День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)) Цикл
    	ТекстЗапроса = ТекстЗапроса + 
    	"	ВЫБРАТЬ " + Строка(ИндексДня) + " КАК ИндексДня
    	|	ОБЪЕДИНИТЬ ВСЕ";
    КонецЦикла;
 ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-14) + " ) КАК Даты
    |			ПО (ИСТИНА)
    |	) КАК ОбщийЗапрос
	|	УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДеньМесяца";
	//Островская Татьяна 13.02.2013 № 15797
	
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтработанноеВремя()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтработанноеВремя" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа,
//	Отказ						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "")
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Отработанное время"": ";
	
	Если ВыборкаПоСтрокамДокумента.НомерСтроки = 0 Тогда // это строка-дополнение
		Возврат
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка дублирования сотрудников
	Если ВыборкаПоСтрокамДокумента.КоличествоДублей > 1 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "обнаружен сотрудник, который введен второй раз!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиОтработанноеВремя()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтработанноеВремяВЦеломЗаПериод" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа,
//	Отказ						- флаг отказа в проведении.
//


// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРабочееВремяРаботниковОрганизацийПоДням(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей,Часов)
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	
	//О.Т. Аверсон 14.12.2016 № 100
	Движение.ДатаНачала = НачалоДня(Движение.Период);
	Движение.ДатаОкончания = КонецДня(Движение.Период);
	//О.Т. Аверсон 14.12.2016 № 100

	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоСтрокамДокумента.ВидВремени;
	
	// Ресурсы
	Если ВыборкаПоСтрокамДокумента.ВидВремени.УчитыватьТолькоДни Тогда
		Движение.Дней = ?(ВыборкаПоСтрокамДокумента.Часов=0, ВыборкаПоСтрокамДокумента.Дней, ВыборкаПоСтрокамДокумента.Часов);
	Иначе
		//заявка №1979 (база заявок Кристалла) Дмитрук О.Г. 
		Если НачалоМесяца(ПериодРегистрации) >= Дата('20110601') Тогда
			
			//Аверсон-софт, Островская Татьяна 12.03.2012
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	ГрафикиРаботыПоВидамВремени.Месяц,
			|	ГрафикиРаботыПоВидамВремени.План,
			|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение КАК ОснЗначение,
			|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК ДопЗначение,
			|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
			|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
			|	ГрафикиРаботыПоВидамВремени.ВидВремени КАК ВидВремени
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
			|	И ГрафикиРаботыПоВидамВремени.План = &Истина
			|	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
			|	И ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение <> 0
			|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> &ВидУчетаВремени";
			
			Запрос.УстановитьПараметр("ГрафикРаботы", ВыборкаПоСтрокамДокумента.Сотрудник);
			Запрос.УстановитьПараметр("Истина", Истина);
			Запрос.УстановитьПараметр("Месяц",ВыборкаПоШапкеДокумента.ПериодРегистрации);
			Запрос.УстановитьПараметр("ВидУчетаВремени",Перечисления.ВидыУчетаВремени.ПоДням);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			
			
			
			если Результат.Пустой() тогда 
				
				Движение.Дней = ?(Часов.НормаЧасов <> 0, ВыборкаПоСтрокамДокумента.Часов / Часов.НормаЧасов, ВыборкаПоСтрокамДокумента.Часов / 8);
				//заявка №1979
			иначе
				Пока ВыборкаДетальныеЗаписи.Следующий() цикл 
					если  ВыборкаДетальныеЗаписи.ДопЗначение <> 0 и  ВыборкаДетальныеЗаписи.Дата = Движение.Период 
						и  ВыборкаПоСтрокамДокумента.ВидВремени = ВыборкаДетальныеЗаписи.ВидВремени тогда
						Движение.Дней = ?(ВыборкаДетальныеЗаписи.ОснЗначение <> 0, ВыборкаПоСтрокамДокумента.Часов / ВыборкаДетальныеЗаписи.ОснЗначение, ВыборкаПоСтрокамДокумента.Часов / 8);
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//Аверсон-софт, Островская Татьяна 12.03.2012
		Иначе
			Движение.Дней								= ?(ВыборкаПоСтрокамДокумента.Часов = 0, 0, 1);
		КонецЕсли;
		//Островская Татьяна 18.12.2012 № 15
		ВидДня = Неопределено;
		запросПраздники = Новый Запрос;
		запросПраздники.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		|	РегламентированныйПроизводственныйКалендарь.Год,
		|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
		|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
		|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
		|	РегламентированныйПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
		запросПраздники.УстановитьПараметр("ДатаКалендаря",Движение.Период);
		РезПраздники = запросПраздники.Выполнить().Выбрать();
		Пока РезПраздники.Следующий() Цикл 
			ВидДня = РезПраздники.ВидДня;
		КонецЦикла;
		если ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник и Движение.Дней = 0
			и Движение.ВидИспользованияРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа Тогда
			Движение.Дней = 1;
		КонецЕсли;
		
		//Островская Татьяна 18.12.2012 № 15
		
		
		Движение.Часов								= ВыборкаПоСтрокамДокумента.Часов;
		
	КонецЕсли;
	// Реквизиты
	Движение.ВЦеломЗаПериод						= Ложь;
	
КонецПроцедуры // ДобавитьСтрокуРабочееВремяРаботниковОрганизацийПоДням()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуГрафикиРаботыПоВидамВремениДни(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, ТаблицаНабора)
	ОбрабатываемаяДата = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	
	СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоДням);
	СтруктураПоиска.Вставить("Дата", ОбрабатываемаяДата);
	
	МассивСтрок = ТаблицаНабора.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		Движение = МассивСтрок[0];
	Иначе
		
		Движение = ТаблицаНабора.Добавить();
		Движение.ГрафикРаботы = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремениПоДням;
		Движение.Дата = ОбрабатываемаяДата;
		Движение.План = Ложь;
		Движение.Месяц = ВыборкаПоШапкеДокумента.ПериодРегистрации;
		
	КонецЕсли;
	
	// Ресурсы
	Если ВремяЯвки > 0 Тогда
		Движение.ОсновноеЗначениеПолное = ?(ВремяЯвки = 0, 0, 1);
		Движение.ДополнительноеЗначениеПолное = ВремяЯвки;
	Иначе
		Движение.ОсновноеЗначениеПолное = ?(ВыборкаПоСтрокамДокумента.Часов = 0, 0, 1);
		Движение.ДополнительноеЗначениеПолное = ВыборкаПоСтрокамДокумента.Часов;
	КонецЕсли;
	
	// Реквизиты
	Движение.Документ 				= ВыборкаПоШапкеДокумента.Документ;
	
КонецПроцедуры // ДобавитьСтрокуГрафикиРаботыПоВидамВремениДни()

// По строке выборок из результатов запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
//	НаборЗаписей							- набор записей для РабочееВремяРаботниковОрганизаций 
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуГрафикиРаботыПоВидамВремениЧасы(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, ТаблицаНабора)
	
	ОбрабатываемаяДата = Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоСтрокамДокумента.ДеньМесяца);
	ВидУчетаВремени = ПолучитьВидУчетаВремениПоКлассификатору(ВыборкаПоСтрокамДокумента.ВидВремени);
	
	Если ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторВечерниеЧасы Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоВечернимЧасам);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторНочныеЧасы Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоНочнымЧасам);
		//толик	
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторВредность Тогда
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоВредность);
	Иначе
		СтруктураПоиска.Вставить("ВидУчетаВремени", ВидУчетаВремениПоЧасам);
	КонецЕсли;
	СтруктураПоиска.Вставить("Дата", ОбрабатываемаяДата);
	
	МассивСтрок = ТаблицаНабора.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() > 0 Тогда
		Движение = МассивСтрок[0];
	Иначе
		
		Движение = ТаблицаНабора.Добавить();
		Движение.ГрафикРаботы = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.Дата = ОбрабатываемаяДата;
		Движение.План = Ложь;
		Движение.Месяц = ВыборкаПоШапкеДокумента.ПериодРегистрации;
		
	КонецЕсли;
	
	// Ресурсы
	//толик
	Если ВыборкаПоСтрокамДокумента.ВидВремени = КлассификаторЯвка Тогда
		Движение.ОсновноеЗначениеПолное = Движение.ОсновноеЗначениеПолное + ВыборкаПоСтрокамДокумента.Часов;
		Движение.ДополнительноеЗначениеПолное = ?((Движение.ДополнительноеЗначениеПолное > 0) ИЛИ (ВыборкаПоСтрокамДокумента.Часов > 0), 1, 0);
	КонецЕсли;
	//енд
	
	// Реквизиты
	Движение.Документ				= ВыборкаПоШапкеДокумента.Документ;
	
КонецПроцедуры // ДобавитьСтрокуГрафикиРаботыПоВидамВремениЧасы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" документа.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОтработанноеВремя);
	

	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения" документа.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ВредностьЧасов = Неопределено;
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		//толик		ПроверитьУникальностьЗаписи(Отказ, Заголовок);
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			//Дмитрук О.Г. 02.02.2011
			//бедем делать движение, только когда Статус = Проверено
			
			// Данные введены с разбивкой по дням.
			
			////////////////////////////////////////////////////////////////////////
			// Отработанное время
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Месяц", ВыборкаПоШапкеДокумента.ПериодРегистрации);
			
			// получим реквизиты табличной части
			ВыборкаПоОтработанноеВремя = СформироватьЗапросПоОтработанноеВремя(ВыборкаПоШапкеДокумента).Выбрать();
			
			//
						
			
			
			ВидУчетаВремениПоДням = Перечисления.ВидыУчетаВремени.ПоДням;
			ВидУчетаВремениПоЧасам = Перечисления.ВидыУчетаВремени.ПоЧасам;
			ПустойДокумент = Документы.КадровыйТабельУчетаРабочегоВремени.ПустаяСсылка();
			//Островская Татьяна 01.03.2013 № 16797
			ТаблицаЗначенийДубли = Новый ТаблицаЗначений;
			ТаблицаЗначенийДубли.Колонки.Добавить("Сотрудник",,"Сотрудник");
			//Островская Татьяна 01.03.2013 № 16797
			
			Пока ВыборкаПоОтработанноеВремя.СледующийПоЗначениюПоля("Сотрудник") Цикл
				// Проверим очередную строка табличной части
				ПроверитьЗаполнениеСтрокиОтработанноеВремя(ВыборкаПоШапкеДокумента, ВыборкаПоОтработанноеВремя, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					НаборЗаписей = Движения.РабочееВремяПоКадровомуТабелю;
					Пока ВыборкаПоОтработанноеВремя.Следующий() Цикл
						Если ВыборкаПоОтработанноеВремя.ВидВремени1 = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка()
							или ВыборкаПоОтработанноеВремя.ВидВремени1 = Null Тогда
							Продолжить;
						КонецЕсли;
						
						ДвижениеРабочееВремя = НаборЗаписей.Добавить();
						
						// Свойства
						ДвижениеРабочееВремя.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоОтработанноеВремя.ДеньМесяца);
						
						// Измерения
						ДвижениеРабочееВремя.Сотрудник						= ВыборкаПоОтработанноеВремя.Сотрудник;
						ДвижениеРабочееВремя.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
						
						ДвижениеРабочееВремя.ВидИспользованияРабочегоВремени	= ВыборкаПоОтработанноеВремя.ВидВремени1;
						если ВыборкаПоОтработанноеВремя.ВидВремени1 = Справочники.КлассификаторИспользованияРабочегоВремени.Работа или 
							ВыборкаПоОтработанноеВремя.ВидВремени1 = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы Тогда 	
							ДвижениеРабочееВремя.Часов = ВыборкаПоОтработанноеВремя.Часов;
							Если ЗначениеЗаполнено(ВыборкаПоОтработанноеВремя.Часов) Тогда 
								ДвижениеРабочееВремя.Дней = 1;
							КонецЕсли;
						ИначеЕсли ВыборкаПоОтработанноеВремя.ВидВремени1 = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() Тогда 
							Продолжить;
						иначе
							ДвижениеРабочееВремя.Дней = 1;
						КонецЕсли;
						если не ЗначениеЗаполнено(ВредностьЧасов) Тогда 
							ВредностьЧасов = ВыборкаПоОтработанноеВремя.ИтогоВредность;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				//Островская Татьяна 13.02.2013 № 15797
				если ОтличаютсяВредныеЧасы Тогда 
					если ЗначениеЗаполнено(ВредностьЧасов) Тогда
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("Сотрудник", ВыборкаПоОтработанноеВремя.Сотрудник);
						
						Массив = ТаблицаЗначенийДубли.НайтиСтроки(ПараметрыОтбора);
						если Массив.Количество() = 0 Тогда 
							НаборЗаписей1 = Движения.РабочееВремяПоКадровомуТабелю;
							Движение = НаборЗаписей1.Добавить();
							
							// Свойства
							Движение.Период								= Дата(Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), Месяц(ВыборкаПоШапкеДокумента.ПериодРегистрации), День(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
							
							// Измерения
							Движение.Сотрудник						= ВыборкаПоОтработанноеВремя.Сотрудник;
							Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
							
							Движение.ВидИспользованияРабочегоВремени	= Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
							Движение.ЧасовВредность = ВредностьЧасов;
							ТЗДубли = ТаблицаЗначенийДубли.Добавить();
							ТЗДубли.Сотрудник = ВыборкаПоОтработанноеВремя.Сотрудник;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//Островская Татьяна 13.02.2013 № 15797
				ВредностьЧасов = 0;	
			КонецЦикла;
			//закомментарила Дмитрук О.Г. 17.02.2011
			//ПроведениеПоРегиструРасчета(ВыборкаПоШапкеДокумента);
			//ВредностьЧасов = 0;	
			
			Движения.РабочееВремяПоКадровомуТабелю.Записать();
						
		КонецЕсли;
	КонецЕСли;
КонецПроцедуры // ОбработкаПроведения()

//Островская Татьяна 30.07.2013 увеличение производительности
Функция ПолучитьНормуПоГраффику(парамНачало, парамКонец, Сотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК НормаЧасов,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК НормаДней,
	|	ГрафикиРаботыПоВидамВремени.Дата
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
	|	И ГрафикиРаботыПоВидамВремени.План
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПоВидамВремени.Дата";
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	//мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
	//	Новый Структура("Организация, Сотрудник", Справочники.Организации.НайтиПоКоду("000000001"), Сотрудник));
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
	Новый Структура("Организация, Сотрудник", Сотрудник.Организация, Сотрудник));
	Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
	мРезультат = Запрос.Выполнить().Выгрузить();
	Возврат мРезультат;
	
КонецФункции
//Островская Татьяна 30.07.2013 увеличение производительности

//толик
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.РабочееВремяПоКадровомуТабелю.Очистить();
	Движения.РабочееВремяПоКадровомуТабелю.Записать();
		
КонецПроцедуры
//енд

//Аверсон ЕАЕ 05.10.2021 СВФР-008221
//Функция ПолучитьРабочихЧасовВМесяце()
//	Часов = 0;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//		|	СУММА(ЕСТЬNULL(ВЫБОР
//		|			КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
//		|				ТОГДА 8
//		|			КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
//		|				ТОГДА 7
//		|			ИНАЧЕ 0
//		|		КОНЕЦ, 0)) КАК Часов
//		|ИЗ
//		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
//		|ГДЕ
//		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНач И &ДатаКон";
//	
//	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ПериодРегистрации));
//	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодРегистрации));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		Часов = ВыборкаДетальныеЗаписи.Часов;
//	КонецЕсли;
//	
//	Возврат Часов;
//КонецФункции
//Аверсон СВФР-008221

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

КлассификаторНочноеВремя = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
КлассификаторВечернееВремя = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы;

ВидУчетаВремениПоДням  			= Перечисления.ВидыУчетаВремени.ПоДням;
ВидУчетаВремениПоЧасам 			= Перечисления.ВидыУчетаВремени.ПоЧасам;
ВидУчетаВремениПоВечернимЧасам 	= Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
ВидУчетаВремениПоНочнымЧасам 	= Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
//толик
ВидУчетаВремениПоВредность  	= Перечисления.ВидыУчетаВремени.ПоВредность;


МассивПриставок = Новый Массив(5);
МассивПриставок[0] = "Первый";
МассивПриставок[1] = "Второй";
МассивПриставок[2] = "Третий";
МассивПриставок[3] = "Четвертый";
МассивПриставок[4] = "Пятый";

КлассификаторЯвка = Справочники.КлассификаторИспользованияРабочегоВремени.Работа;
КлассификаторВечерниеЧасы = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы;
КлассификаторНочныеЧасы = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы;
КлассификаторПустаяСсылка = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
//толик
КлассификаторВредность = Справочники.КлассификаторИспользованияРабочегоВремени.Вредность;
