////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки          Экспорт;
Перем ЭтоРасшифровка       Экспорт;

//Аверсон ЕАЕ 15.01.2022 СВФР-008610
Перем ВыводитьВидРасчетаВРасшифровке Экспорт;
//Аверсон СВФР-008610

#Если Клиент ИЛИ ВнешнееСоединение Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
	// 
	
	// Формирование отчета в табличный документ
	// 
	Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
		
		//Возврат ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
		Возврат СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	КонецФункции //СформироватьОтчет()
	
	// Дорабатывает компоновщик натроек перед выводом
	//
	Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
		
		//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЕстьГруппировкаПоПериодуРегисрации")); //Аверсон 06.09.2019 КВВ СВФР-004725 (Закомментировано)
		//ЗначениеПараметра.Значение = ПрисутствуетПолеПериодРегистрацииВГруппировке();  //Аверсон 06.09.2019 КВВ СВФР-004725 (Закомментировано)
		
		//Аверсон ЕАЕ 10.09.2021 СВФР-008069
		//ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Бригада"));
		//Если ЗначениеПараметра <> Неопределено Тогда
		//	ЗначениеПараметра.Использование = Истина;
		//	ЗначениеПараметра.Значение = Бригада;
		//КонецЕсли;
		//Аверсон СВФР-008069
		
		ДоработатьМакетОформленияПередВыводом();
		
		// установить итог если это расшифровка
		Если ЭтоРасшифровка тогда
			ЭлементВывода = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("VerticalOverallPlacement");
			ЭлементВывода.Использование = ложь;
			
			//Аверсон ЕАЕ 02.06.2021 СВФР-007644
			//ТиповыеОтчеты.ВыводТабельногоНомера(КомпоновщикНастроек.Настройки, ЭтотОбъект);
			//Аверсон СВФР-007644
		КонецЕсли;
		
		ЗначениеПараметраОрг = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
		Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Если ЗначениеПараметраОрг <> Неопределено Тогда
			ЗначениеПараметраОрг.Использование = Истина;
			ЗначениеПараметраОрг.Значение = Орг;
		КонецЕсли;
		
	КонецПроцедуры //ДоработатьКомпоновщикПередВыводом()
	
	
	Процедура ДоработатьМакетОформленияПередВыводом() Экспорт
		
		Если ЭтоРасшифровка тогда
			Возврат;
		КонецЕсли;
		
		Структура = КомпоновщикНастроек.Настройки.Структура;
		
		Пока Структура.Количество() > 0 Цикл
			
			Если Тип(Структура[0]) <> Тип("ГруппировкаКомпоновкиДанных") тогда
				Прервать;
			КонецЕсли;
			
			Структура = Структура[0];
			
			Если Структура.ПоляГруппировки.Элементы.Количество() > 0 
				И Структура.ПоляГруппировки.Элементы[0].Поле <> Новый ПолеКомпоновкиДанных("ВидДвижения") тогда
				
				ЭлементУсловногоОформления = Структура.УсловноеОформление.Элементы.Добавить();
				ЭлементУсловногоОформления.Использование = истина;
				
				// добавим поля
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Результат");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтработаноЧасов");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтработаноДней");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЧасов");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОплаченоДней");
				
				ПараметрТекст               = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Text");
				ПараметрТекст.Значение      = Новый ПолеКомпоновкиДанных("РезультатНоль");
				ПараметрТекст.Использование = истина;
				
			Иначе
				
				ЭлементУсловногоОформления = Структура.УсловноеОформление.Элементы.Добавить();
				ЭлементУсловногоОформления.Использование = истина;
				
				// добавим поля
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Результат");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтработаноЧасов");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтработаноДней");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЧасов");
				
				ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
				ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОплаченоДней");
				
				ПараметрТекст               = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Text");
				ПараметрТекст.Значение      = Новый ПолеКомпоновкиДанных("РезультатНоль");
				ПараметрТекст.Использование = истина;
				
				ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидДвижения");
				ЭлементОтбора.ПравоеЗначение = "5. Сальдо";
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;  
				
				Прервать;
				
			КонецЕсли;
			
			Структура = Структура.Структура;
			
		КонецЦикла;
		
	КонецПроцедуры
	
#КонецЕсли

#Если Клиент Тогда
	
	// Настройку отчета
	//
	Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
		
		ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
		
	КонецПроцедуры //Настроить()
	
	// Сохранение настроек схемы компоновки
	//
	Процедура СохранитьНастройку() Экспорт
		
		СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
		СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
		
	КонецПроцедуры //СохранитьНастройку()
	
	// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
	//
	Процедура ПрименитьНастройку() Экспорт
		
		Если СохраненнаяНастройка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
		
	КонецПроцедуры //ПрименитьНастройку()
	
	// Инициализация отчета
	//
	Процедура ИнициализацияОтчета() Экспорт
		
		ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
		
	КонецПроцедуры //ИнициализацияОтчета()
	
#КонецЕсли

#Если Клиент ИЛИ ВнешнееСоединение Тогда
	
	// Возвращает значение истина, если в элементах структур отчета присутствует поле Период регистрации
	//
	Функция ПрисутствуетПолеПериодРегистрацииВГруппировке()
		
		ЕстьГруппировка = ложь;
		
		Если КомпоновщикНастроек.Настройки.Структура.Количество() <> 0 тогда
			
			Если Тип(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ТаблицаКомпоновкиДанных") тогда
				
				ЕстьГруппировка = НайтиПериодРегистрации(КомпоновщикНастроек.Настройки.Структура[0].Строки[0]);
				
			ИначеЕсли Тип(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ГруппировкаКомпоновкиДанных") тогда
				
				ЕстьГруппировка = НайтиПериодРегистрации(КомпоновщикНастроек.Настройки.Структура[0]);
				
			ИначеЕсли Тип(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ДиаграммаКомпоновкиДанных") тогда
				
				Если КомпоновщикНастроек.Настройки.Структура[0].Точки.Количество() <> 0 тогда
					
					ЕстьГруппировка = НайтиПериодРегистрации(КомпоновщикНастроек.Настройки.Структура[0].Точки[0]) ИЛИ НайтиПериодРегистрации(КомпоновщикНастроек.Настройки.Структура[0].Серии[0]);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// найти поле группировки в отборе
		Для каждого ОтборПоле из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			ПолеПериодРегистрации = Новый ПолеКомпоновкиДанных("ПериодРегистрации");
			
			Если ОтборПоле.Использование и (ОтборПоле.ЛевоеЗначение = ПолеПериодРегистрации или ОтборПоле.ПравоеЗначение = ПолеПериодРегистрации) тогда
				
				ЕстьГруппировка = истина;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат ЕстьГруппировка;
		
	КонецФункции //ПрисутствуетПолеПериодРегистрацииВГруппировке()
	
	// Функция возвращает значение истина, если в группировках элементов структуры присутствует поле "Период регистрации"
	//
	Функция НайтиПериодРегистрации(Структура)
		
		ЕстьПоле = ложь;
		
		Если ТипЗнч(Структура) <> Тип("ГруппировкаКомпоновкиДанных") тогда
			
			Возврат ЕстьПоле;
			
		КонецЕсли;
		
		ПолеПериодРегистрации = Новый ПолеКомпоновкиДанных("ПериодРегистрации");
		
		Для каждого ПолеГруппировки из Структура.ПоляГруппировки.Элементы Цикл
			
			Если ПолеГруппировки.Использование И ПолеГруппировки.Поле = ПолеПериодРегистрации тогда
				
				ЕстьПоле = истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЕстьПоле И Структура.Структура.Количество() <> 0 тогда
			
			ЕстьПоле = НайтиПериодРегистрации(Структура.Структура[0]);
			
		КонецЕсли;
		
		Возврат ЕстьПоле;
		
	КонецФункции //НайтиПериодРегистрации()
	
	//Аверсон ЕАЕ 03.03.2023
	// Формирует типовой отчет в строку XML, табличный документ или поле табличного документа	
	Функция СформироватьТиповойОтчет(ОтчетОбъект, Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено, ВыводитьШапкуОтчетаНаВсехСтраницах = истина)
		
		//для Каждого МакетОф из ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы Цикл 
		//	если МакетОф.Значение = "БезОформления" Тогда 
		//		МакетОф.Значение = "Основной";
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		//Здесь надо получить строки шапки
		
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ДанныеРасшифровки = Неопределено;
			// Вывод отчета в XML
			Если ТиповыеОтчеты.ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
				СохранениеНастроек = Новый Структура;
			Иначе
				СохранениеНастроек.ЗаполнитьНастройкиПриОткрытииОтчета(ОтчетОбъект);
			КонецЕсли;
			ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
			// Сгенерируем макет компоновки данных при помощи компоновщика макета
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(ОтчетОбъект.СхемаКомпоновкиДанных, ОтчетОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
			// Создадим и инициализируем процессор компоновки
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			Если ВнешниеНаборыДанных = Неопределено Тогда
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
			Иначе
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
			КонецЕсли;
			ЗаписьXML = Новый ЗаписьXML();
			ЗаписьXML.УстановитьСтроку();
			ЗаписьXML.ЗаписатьНачалоЭлемента("result");
			Пока Истина Цикл
				ЭлементРезультата = ПроцессорКомпоновки.Следующий();
				Если ЭлементРезультата = Неопределено Тогда
					Прервать;
				КонецЕсли;
				СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ЭлементРезультата, "item", "http://v8.1c.ru/8.1/data-composition-system/result");
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
			Результат = ЗаписьXML.Закрыть();
			
			ЗаписьXML = Новый ЗаписьXML();
			ЗаписьXML.УстановитьСтроку();
			ЗаписьXML.ЗаписатьНачалоЭлемента("details");
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ДанныеРасшифровки, "item", "http://v8.1c.ru/8.1/data-composition-system/details");
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ДанныеРасшифровки = ЗаписьXML.Закрыть();		
			
		ИначеЕсли ВыводВФормуОтчета Тогда
			#Если Клиент Тогда
				// Вывод отчета в форму отчета                           
				Результат.Очистить();
				Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
				
				//Аверсон ЕАЕ 25.05.2021 СВФР-007611
				//ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект);
				//Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
				//	ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест")
				//	ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений")	Тогда
				//	ВыводЗаголовкаПриРасширеннойНастройке = Истина;
				//Иначе
				//	ВыводЗаголовкаПриРасширеннойНастройке = Ложь;
				//КонецЕсли;
				
				ВыводЗаголовкаПриРасширеннойНастройке = Истина;
				
				ТиповыеОтчеты.ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект,,ВыводЗаголовкаПриРасширеннойНастройке);
				//Аверсон СВФР-007611
				
				//Аверсон ЕАЕ 24.05.2021 СВФР-007611
				//ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета);
				ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета, ВыводЗаголовкаПриРасширеннойНастройке);
				//Аверсон СВФР-007611
				
				ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
				ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных, ВыводитьШапкуОтчетаНаВсехСтраницах);
				
				//Аверсон ЕАЕ 03.06.2021 СВФР-007644
				//Если (ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный") 
				//	ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест")
				//	ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений")) 
				//	И ОтчетОбъект.ЭтоРасшифровка Тогда
				//	ВыводТабельногоНомера(Настройки, ОтчетОбъект);
				//КонецЕсли;
				//Аверсон СВФР-007644
				
				ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
				
				//Аверсон ЕАЕ 24.05.2021 СВФР-007611
				//УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат);
				ТиповыеОтчеты.УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводЗаголовкаПриРасширеннойНастройке);
				//Аверсон СВФР-007611
				
				Если Не ОтчетОбъект.ЭтоРасшифровка Тогда
					////////////Постобработка
					
					//Ориентация
					Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
					
					//Колонтитул
					Результат.ВерхнийКолонтитул.Выводить = Истина;
					Результат.ВерхнийКолонтитул.НачальнаяСтраница = 1;
					//Результат.ВерхнийКолонтитул.Шрифт = Новый Шрифт(Результат.ВерхнийКолонтитул.Шрифт, , , , Истина);
					Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
					Результат.ВерхнийКолонтитул.ТекстСлева = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + " " + СокрЛП(Орг);
					
					ОписаниеПериода = ПолучитьОписаниеПериода(КомпоновщикНастроек);
					
					Результат.ВерхнийКолонтитул.ТекстВЦентре = "Свод фонда оплаты труда по видам выплат " + ОписаниеПериода;
					//Результат.ВерхнийКолонтитул.ТекстСправа = "Лист [&НомерСтраницы] из [&СтраницВсего]";
					Результат.РазмерКолонтитулаСверху = 15;
					Результат.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
					
					//Фиксация 1 столбца
					ОблПодразделение = Результат.Область(,1,,1);
					Результат.ПовторятьПриПечатиКолонки = ОблПодразделение;
					
					//Итоги на отдельном листе
					КолСтр = Результат.ВысотаТаблицы;
					КолКол = Результат.ШиринаТаблицы;
					ТекстИтога = "ИТОГО " + СокрЛП(Орг);
					СтрИтог = 0;
					н = 0;
					НачСворачиваем = 0; //искусственно будем уменьшать высоту шапки
					КонСворачиваем = 0;
					
					//уберем пустые строки из шапки
					Для стр = 1 По КолСтр Цикл
						
						ОблПроверка = Результат.Область(Стр, 1, Стр, 1);
						Если СокрЛП(ОблПроверка.Текст) = "Подразделение организации" ИЛИ СокрЛП(ОблПроверка.Текст) = "Категория" Тогда
							н = н + 1;
							Если н = 2 Тогда
								НачСворачиваем = Стр;
							КонецЕсли;
							ОблСтр = Результат.Область(Стр,,Стр);
							//ОблСтр.ВысотаСтроки = 25;
							//ОблСтр.АвтовысотаСтроки = Ложь;
							ОблСтр.АвтовысотаСтроки = Истина;
						Иначе
							Если ОблПроверка.Имя = "Шапка" Тогда //последняя строка шапки
								КонСворачиваем = Стр;
							КонецЕсли;
						КонецЕсли;
						
						//запомним строку общего итога, чтобы вывести на отдельный лист
						Если СокрЛП(ОблПроверка.Текст) = ТекстИтога Тогда
							СтрИтог = Стр;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если СтрИтог <> 0 Тогда
						Результат.Область(СтрИтог,,СтрИтог,).НачалоСтраницы = Истина;
					КонецЕсли;
					
					//Уберем рамки с итоговой страницы
					НетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
					Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
					Для стр = СтрИтог + 1 По КолСтр Цикл
						Обл1 = Результат.Область(Стр,1,Стр,1);
						Если СокрЛП(Обл1.Текст) = "Корректировка отпусков:" Тогда
							ЭтоКорректировкаОтпусков = Истина;
						Иначе
							ЭтоКорректировкаОтпусков = Ложь;
						КонецЕсли;
						Если СокрЛП(Обл1.Текст) = "Договора подряда:" Тогда
							ЭтоДоговораПодряда = Истина;	
						Иначе
							ЭтоДоговораПодряда = Ложь;
						КонецЕсли;
						
						Для кол = 1 По КолКол Цикл
							Обл = Результат.Область(стр,кол,стр,кол);
							Обл.ГраницаСлева = НетЛинии;
							Обл.ГраницаСправа = НетЛинии;
							Если ЭтоКорректировкаОтпусков ИЛИ ЭтоДоговораПодряда Тогда
								Обл.ГраницаСнизу = Линия1;
							Иначе
								Обл.ГраницаСнизу = НетЛинии;
							КонецЕсли;
							Обл.ГраницаСверху = НетЛинии;
						КонецЦикла;
					КонецЦикла;
					
					Если НачСворачиваем > 0 И КонСворачиваем > 0 Тогда
						ОблСворачиваемСтр = Результат.Область(НачСворачиваем + 1,,КонСворачиваем);
						
						Результат.УдалитьОбласть(ОблСворачиваемСтр,ТипСмещенияТабличногоДокумента.ПоВертикали);
						Результат.ФиксацияСверху = НачСворачиваем;
					КонецЕсли;
					
					ОблШапкаСверху = Результат.ПолучитьОбласть(4,,НачСворачиваем);
					ОблШапкаСверху1 = Результат.Область(4,,НачСворачиваем);
					Результат.ПовторятьПриПечатиСтроки = ОблШапкаСверху1;
					
					ОблШапкаСлева = Результат.ПолучитьОбласть(,1,,1);
					
					//Свертка вертикальных групп
					ТЗСвертка = Новый ТаблицаЗначений;
					ТЗСвертка.Колонки.Добавить("НаименованиеГруппы");
					ТЗСвертка.Колонки.Добавить("Нач");
					ТЗСвертка.Колонки.Добавить("Кон");
					Для Кол = 1 По Результат.ШиринаТаблицы Цикл
						ОблПроверка = Результат.Область(4,Кол,5,Кол);
						ТекстЗаголовка = СокрЛП(ОблПроверка.Текст);
						Если ТекстЗаголовка = "ИТОГО ФЗП+ФМП+Договора подряда" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "ИТОГО ФЗП+ФМП+Договора подряда";
							НовСтр.Нач = Кол;
							
						ИначеЕсли ТекстЗаголовка = "ИТОГО ФЗП+ФМП" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "ИТОГО ФЗП+ФМП";
							НовСтр.Нач = Кол;
						ИначеЕсли ТекстЗаголовка = "Итого ФЗП" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "Итого ФЗП";
							НовСтр.Нач = Кол;
						ИначеЕсли ТекстЗаголовка = "Итого ФМП" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "Итого ФМП";
							НовСтр.Нач = Кол;
							
							СтрТЗ = ТЗСвертка.Найти("Итого ФЗП", "НаименованиеГруппы");
							Если СтрТЗ <> Неопределено Тогда
								СтрТЗ.Кон = Кол - 1;
							КонецЕсли;
						ИначеЕсли ТекстЗаголовка = "Итого Договора подряда" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "Итого Договора подряда";
							НовСтр.Нач = Кол;
							
							СтрТЗ = ТЗСвертка.Найти("Итого ФМП", "НаименованиеГруппы");
							Если СтрТЗ <> Неопределено Тогда
								СтрТЗ.Кон = Кол - 1;
							КонецЕсли;
							
							СтрТЗ = ТЗСвертка.Найти("ИТОГО ФЗП+ФМП", "НаименованиеГруппы");
							Если СтрТЗ <> Неопределено Тогда
								СтрТЗ.Кон = Кол - 1;
							КонецЕсли;
						ИначеЕсли ТекстЗаголовка = "Итого Иные выплаты" Тогда
							НовСтр = ТЗСвертка.Добавить();
							НовСтр.НаименованиеГруппы = "Итого Иные выплаты";
							НовСтр.Нач = Кол;
							
							СтрТЗ = ТЗСвертка.Найти("ИТОГО ФЗП+ФМП+Договора подряда", "НаименованиеГруппы");
							Если СтрТЗ <> Неопределено Тогда
								СтрТЗ.Кон = Кол - 1;
							КонецЕсли;
							СтрТЗ = ТЗСвертка.Найти("Итого Договора подряда", "НаименованиеГруппы");
							Если СтрТЗ <> Неопределено Тогда
								СтрТЗ.Кон = Кол - 1;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					СтрТЗ = ТЗСвертка.Найти("Итого Иные выплаты", "НаименованиеГруппы");
					Если СтрТЗ <> Неопределено Тогда
						СтрТЗ.Кон = Результат.ШиринаТаблицы;
					КонецЕсли;
					
					////ИТОГО ФЗП+ФМП+Договора подряда
					//СтрТЗ = ТЗСвертка.Найти("ИТОГО ФЗП+ФМП+Договора подряда", "НаименованиеГруппы");
					//Если СтрТЗ <> Неопределено Тогда
					//	Обл = Результат.Область(,СтрТЗ.Нач + 1,,СтрТЗ.Кон);
					//	Обл.Сгруппировать();
					//КонецЕсли;
					//
					////Итого иные выплаты
					//СтрТЗ = ТЗСвертка.Найти("Итого Иные выплаты", "НаименованиеГруппы");
					//Если СтрТЗ <> Неопределено Тогда
					//	Обл = Результат.Область(,СтрТЗ.Нач + 1,,СтрТЗ.Кон);
					//	Обл.Сгруппировать();
					//КонецЕсли;
					
					Для Каждого Стр ИЗ ТЗСвертка Цикл
						Если Стр.Нач = Стр.Кон Тогда
							Продолжить;
						КонецЕсли;
						Обл = Результат.Область(,Стр.Нач + 1,,Стр.Кон);
						Обл.Сгруппировать();
					КонецЦикла;
					
					//Разбиваем на листы
					//Горизонтально
					МассивОбластейГ = Новый Массив; //массив областей для разбивки на страницы сверху вниз (горизонтальные разделители)
					КолСтр = Результат.ВысотаТаблицы; //номер последней строки
					МассивГоризонтальныхРазделителей = Новый Массив; //здесь будем хранить номера строк, в которых надо проставить разделители
					
					МассивОбластейВ = Новый Массив; //массив областей для разбивки на страницы слева направо (вертикальные разделители)
					КолКол = Результат.ШиринаТаблицы; //номер последней колонки
					МассивВертикальныхРазделителей = Новый Массив; //здесь будем хранить номера колонок, в которых надо проставить разделители
					
					//Результат.ВывестиГоризонтальныйРазделительСтраниц(); //проверка, вмещаются ли строки, идет на первом свободном листе снизу
					//Результат.ВывестиВертикальныйРазделительСтраниц();
					
					ТабДок = Новый ТабличныйДокумент;
					ТабДок.ОриентацияСтраницы = Ориентациястраницы.Ландшафт;
					ТабДок.АвтоМасштаб = Ложь;
					ТабДок.Область(,1,,1).ШиринаКолонки = 22.38;
					//ПервоначальнаяШиринаКолонки = ТабДок.Область(,1,,1).ШиринаКолонки;
					
					ОблПустаяСтрока = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 2,,Результат.ВысотаТаблицы + 3); //2 пустых строки для вывода Приложения/Листа, на первом свободном листе, там точно ничего не будет
					МассивОбластейГ.Добавить(ОблПустаяСтрока); //проверять будем с учетом 2-х пустых строк (они для вывода номера приложения/листа)
					ОблПустаяСтрока1 = Результат.Область(Результат.ВысотаТаблицы + 2,,Результат.ВысотаТаблицы + 3);
					
					//Горизонтальные разделители
					ПерваяСтраница = Истина;
					Для н = 1 По КолСтр Цикл
						Обл1 = Результат.Область(н,1,н,1);
						Если СокрЛП(Обл1.Текст) = ТекстИтога Тогда //попали на итоговую страницу
							
							//добавим пустые строки на ИТОГОВУЮ страницу (чтобы номер приложения/листа разместился внизу страницы)
							ОблКонецОтчета = Результат.Область(Результат.ВысотаТаблицы,,Результат.ВысотаТаблицы);
							ОблКонецОтчета.КонецСтраницы = Истина;
							
							МассивОбластейГ.Очистить();
							МассивОбластейГ.Добавить(ОблШапкаСверху); //шапка
							МассивОбластейГ.Добавить(Результат.ПолучитьОбласть(н,,Результат.ВысотаТаблицы,)); //то, что уже выведено на итоговой странице
							ОблПустаяСтр = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
							ОблПустаяСтр1 = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
							МассивОбластейГ.Добавить(ОблПустаяСтр); //пустая строка для проверки
							
							Пока ТабДок.ПроверитьВывод(МассивОбластейГ) Цикл
								ОблПустаяСтр = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
								ОблПустаяСтр1 = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
								
								ОблПриемник = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
								Результат.ВставитьОбласть(ОблПустаяСтр1, ОблПриемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
								МассивОбластейГ.Добавить(ОблПустаяСтр);
							КонецЦикла;
							
							ОблКонецСтраницы = Результат.Область(КолСтр,,КолСтр);
							ОблКонецСтраницы.КонецСтраницы = Ложь;
							
							ОблКонецОтчета = Результат.Область(Результат.ВысотаТаблицы,,Результат.ВысотаТаблицы);
							ОблКонецОтчета.КонецСтраницы = Истина;
							
							//добавим пустые строки на ПРЕДПОСЛЕДНЮЮ страницу
							МассивОбластейГ.Очистить();
							
							КонСтр = Результат.ВысотаТаблицы + 1;
							ПоследняяСтрокаОбласти = н - 1;
							
							МассивОбластейГ.Очистить();
							МассивОбластейГ.Добавить(ОблШапкаСверху);//Шапка
							Если МассивГоризонтальныхРазделителей.Количество() = 0 Тогда
								МассивОбластейГ.Добавить(Результат.ПолучитьОбласть(1,,н - 1,)); //то, что выведено на прдпоследней странице
							Иначе
								МассивОбластейГ.Добавить(Результат.ПолучитьОбласть(МассивГоризонтальныхРазделителей[МассивГоризонтальныхРазделителей.Количество() - 1],,н - 1,)); //то, что выведено на прдпоследней странице
							КонецЕсли;
							ОблПустаяСтр = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
							ОблПустаяСтр1 = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
							МассивОбластейГ.Добавить(ОблПустаяСтр);
							
							Пока ТабДок.ПроверитьВывод(МассивОбластейГ) Цикл
								ОблПустаяСтр = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
								ОблПустаяСтр1 = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 1,);
								
								ОблПриемник = Результат.Область(ПоследняяСтрокаОбласти + 1,,ПоследняяСтрокаОбласти + 1,);
								Результат.ВставитьОбласть(ОблПустаяСтр1, ОблПриемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
								ПоследняяСтрокаОбласти = ПоследняяСтрокаОбласти + 1;
								МассивОбластейГ.Добавить(ОблПустаяСтр);
							КонецЦикла;
							
							Прервать;
						КонецЕсли;
						
						//проверяем таблицу
						ОблСтр = Результат.ПолучитьОбласть(н,,н);
						//Если ПерваяСтраница Тогда
						//	Если н < 4 ИЛИ н > НачСворачиваем Тогда
						//		МассивОбластейГ.Добавить(ОблСтр);
						//	КонецЕсли;
						//Иначе
						МассивОбластейГ.Добавить(ОблСтр);
						//КонецЕсли;
						
						Помещается = ТабДок.ПроверитьВывод(МассивОбластейГ);
						Если Не Помещается Тогда
							ОблПустаяСтрока = Результат.ПолучитьОбласть(Результат.ВысотаТаблицы + 2,,Результат.ВысотаТаблицы + 3);
							
							МассивГоризонтальныхРазделителей.Добавить(н);
							МассивОбластейГ.Очистить();
							МассивОбластейГ.Добавить(ОблШапкаСверху);
							МассивОбластейГ.Добавить(ОблПустаяСтрока);
							
							МассивОбластейГ.Добавить(ОблСтр);
							ПерваяСтраница = Ложь;
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого Эл Из МассивГоризонтальныхРазделителей Цикл
						Результат.Область(Эл,,Эл,).НачалоСтраницы = Истина;
					КонецЦикла;
					
					//Вертикально
					ПерваяСтраница = Истина;
					
					ОблИсточник = Результат.Область(1, 1, Результат.ВысотаТаблицы, 1);
					ОблПриемник = ТабДок.Область(1, 1, Результат.ВысотаТаблицы, 1);
					ТабДок.ВставитьОбласть(ОблИсточник, ОблПриемник);
					ОблПриемник.ШиринаКолонки = ОблИсточник.ШиринаКолонки;
					ТабДок.ПовторятьПриПечатиКолонки = ОблПриемник;
					
					Для к = 1 По КолКол Цикл
						ОблКол = Результат.ПолучитьОбласть(,к,,к);
						МассивОбластейВ.Добавить(ОблКол);
						
						Помещается = ТабДок.ПроверитьПрисоединение(МассивОбластейВ);
						Если Не Помещается Тогда
							МассивВертикальныхРазделителей.Добавить(к);
							МассивОбластейВ.Очистить();
							
							МассивОбластейВ.Добавить(ОблШапкаСлева);
							МассивОбластейВ.Добавить(ОблКол);
							ПерваяСтраница = Ложь;
							
						КонецЕсли;
					КонецЦикла;
					
					//добавим справа столько пустых колонок, сколько поместится на лист
					Результат.Область(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1).НачалоСтраницы = Ложь;
					ОблПустаяКолонка = Результат.ПолучитьОбласть(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					ОблПустаяКолонка1 = Результат.Область(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					МассивОбластейВ.Добавить(ОблПустаяКолонка);
					
					//КонКол = Результат.ШиринаТаблицы;
					
					Пока ТабДок.ПроверитьПрисоединение(МассивОбластейВ) Цикл
						ОблПриемник = Результат.Область(,Результат.ШиринаТаблицы,,Результат.ШиринаТаблицы);
						Результат.ВставитьОбласть(ОблПустаяКолонка1, ОблПриемник, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
						//КонКол = КонКол + 1;
						
						ОблПустаяКолонка = Результат.ПолучитьОбласть(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
						МассивОбластейВ.Добавить(ОблПустаяКолонка);
					КонецЦикла;
					
					Для Каждого Эл Из МассивВертикальныхРазделителей Цикл
						Результат.Область(,Эл,,Эл).НачалоСтраницы = Истина;
					КонецЦикла;
					Результат.УдалитьОбласть(Результат.Область(,Результат.ШиринаТаблицы,,Результат.ШиринаТаблицы), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
					Результат.Область(,Результат.ШиринаТаблицы,,Результат.ШиринаТаблицы).КонецСтраницы = Истина;
					
					//Убрать
					//Результат.ОтображатьСетку = Истина;
					//Результат.ОтображатьЗаголовки = Истина;
					//
					
					//Добавим на каждой странице пустые колонки, чтобы номер приложения/листа был строго справа
					//ПоследнийИндекс = МассивВертикальныхРазделителей.Количество() - 1;
					//Для Эл = -ПоследнийИндекс По 0 Цикл
					//	НомерЭлемента = -Эл;
					//	СтрРазделителя = МассивВертикальныхРазделителей[НомерЭлемента];
					//	
					//	Если НомерЭлемента = 0 Тогда
					//		СтрНач = 1;
					//	Иначе
					//		СтрНач = МассивВертикальныхРазделителей[НомерЭлемента - 1];
					//	КонецЕсли;
					//	
					//	ОблПустаяКолонка = Результат.Область(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					//	ОблПустаяКолонка1 = Результат.ПолучитьОбласть(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					//	
					//	МассивПроверка = Новый Массив;
					//	МассивПроверка.Добавить(ОблШапкаСлева);
					//	ОблТоЧтоЕсть = Результат.ПолучитьОбласть(,СтрНач,,СтрРазделителя - 1);
					//	МассивПроверка.Добавить(ОблТоЧтоЕсть);
					//	МассивПроверка.Добавить(ОблПустаяКолонка1);
					//	Пока ТабДок.ПроверитьПрисоединение(МассивПроверка) Цикл
					//		ОблПримник = Результат.Область(,СтрРазделителя - 1,,СтрРазделителя - 1);
					//		ОблПустаяКолонка = Результат.Область(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					//		
					//		Результат.ВставитьОбласть(ОблПустаяКолонка, ОблПриемник, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
					//		
					//		ОблПустаяКолонка1 = Результат.ПолучитьОбласть(,Результат.ШиринаТаблицы + 1,,Результат.ШиринаТаблицы + 1);
					//		МассивПроверка.Добавить(ОблПустаяКолонка1);
					//	КонецЦикла;
					//КонецЦикла;
					
					//Проставляем номера приложений/листов (в правом нижнем углу листа)
					//Если МассивГоризонтальныхРазделителей.Количество() > 0 И МассивВертикальныхРазделителей.Количество() > 0 Тогда
						//НомерЛиста = 0;
						
						Если МассивВертикальныхРазделителей.Количество() = 0 Тогда
							ПослСтр = Результат.ШиринаТаблицы;
						ИначеЕсли МассивВертикальныхРазделителей.Количество() = 1 Тогда
							ШиринаСтраницы = МассивВертикальныхРазделителей[0];
							ПослСтр = МассивВертикальныхРазделителей[0] + ШиринаСтраницы - 2;
						Иначе
							ШиринаСтраницы = МассивВертикальныхРазделителей[МассивВертикальныхРазделителей.Количество() - 1] - МассивВертикальныхРазделителей[МассивВертикальныхРазделителей.Количество() - 2];
							ПослСтр = МассивВертикальныхРазделителей[МассивВертикальныхРазделителей.Количество() - 1] + ШиринаСтраницы - 1;
						КонецЕсли;
						
						ПоследнийИндекс = МассивГоризонтальныхРазделителей.Количество() - 1;
						НомерЛиста = ПоследнийИндекс + 1;
						НомерЭлемента = 0;
						Для ЭлСтр = -ПоследнийИндекс По 0 Цикл //по веритикали
							//НомерЛиста = НомерЛиста + 1;
							НомерПриложения = 0;
							
							НомерЭлемента = -ЭлСтр;
							СтрРазделителя = МассивГоризонтальныхРазделителей[НомерЭлемента];
							
							//вставим пустые строки
							
							ОблПустаяСтрока1 = Результат.Область(Результат.ВысотаТаблицы + 1,,Результат.ВысотаТаблицы + 2);
							
							ОблПриемник = Результат.Область(СтрРазделителя,,СтрРазделителя + 1);
							Результат.ВставитьОбласть(ОблПустаяСтрока1, ОблПриемник, ТипСмещенияТабличногоДОкумента.ПоВертикали);
							
							//НомерЛиста = 1;
							Для Каждого ЭлКол Из МассивВертикальныхРазделителей Цикл //по горизонтали
								КолРазделителя = ЭлКол;
								Обл = Результат.Область(СтрРазделителя + 1, КолРазделителя - 1, СтрРазделителя + 1, КолРазделителя - 1); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
								Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(НомерЛиста);
								Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
								//НомерЛиста = НомерЛиста + 1;
								НомерПриложения = НомерПриложения + 1;
							КонецЦикла;
							
							//на последнем листе справа
							//Обл = Результат.Область(СтрРазделителя + 1, Результат.ШиринаТаблицы - 1, СтрРазделителя + 1, Результат.ШиринаТаблицы - 1); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
							Обл = Результат.Область(СтрРазделителя + 1, ПослСтр, СтрРазделителя + 1, ПослСтр); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
							Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(НомерЛиста);
							Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
							НомерЛиста = НомерЛиста - 1;
						КонецЦикла;
						
						//Проставим номера приложений/листов на итоговой странице
						//НомерЛиста = 1;
						НомерПриложения = 0;
						Для Каждого ЭлКол Из МассивВертикальныхРазделителей Цикл
							КолРазделителя = ЭлКол;
							Обл = Результат.Область(Результат.ВысотаТаблицы, КолРазделителя - 1, Результат.ВысотаТаблицы, КолРазделителя - 1); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
							Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(ПоследнийИндекс + 3);
							Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
							//НомерЛиста = НомерЛиста + 1;
							НомерПриложения = НомерПриложения + 1;
						КонецЦикла;
						//на последнем листе справа
						//Обл = Результат.Область(Результат.ВысотаТаблицы, Результат.ШиринаТаблицы - 1, Результат.ВысотаТаблицы, Результат.ШиринаТаблицы - 1); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
						Обл = Результат.Область(Результат.ВысотаТаблицы, ПослСтр, Результат.ВысотаТаблицы, ПослСтр); //здесь нужно предусмотреть ситуацию, когда разделителй нет (отчет маленький)
						Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(ПоследнийИндекс + 3);
						Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
						
						//Проставим номера приложений /листов на предпоследней странице
						//найдем строку с итогом
						СтрИтог = 0;
						Для н = 1 По Результат.ВысотаТаблицы Цикл
							ОблИтог = Результат.Область(н,1,н,1);
							Если СокрЛП(ОблИтог.Текст) = ТекстИтога Тогда
								СтрИтог = н;
							КонецЕсли;
						КонецЦикла;
						НомерЛиста = 1;
						НомерПриложения = 0;
						Для Каждого ЭлКол Из МассивВертикальныхРазделителей Цикл
							КолРазделителя = ЭлКол;
							Обл = Результат.Область(СтрИтог - 1, КолРазделителя - 1, СтрИтог - 1, КолРазделителя - 1);
							Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(ПоследнийИндекс + 2);
							Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
							НомерЛиста = НомерЛиста + 1;
							НомерПриложения = НомерПриложения + 1;
						КонецЦикла;
						//на последнем листе справа
						//Обл = Результат.Область(СтрИтог - 1, Результат.ШиринаТаблицы - 1, СтрИтог - 1, Результат.ШиринаТаблицы - 1);
						Обл = Результат.Область(СтрИтог - 1, ПослСтр, СтрИтог - 1, ПослСтр); 
						Обл.Текст = "Приложение " + СокрЛП(НомерПриложения) + " Лист " + СокрЛП(ПоследнийИндекс + 2);
						Обл.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
					//Иначе
					//	
					//КонецЕсли;
				Иначе
					Обл = Результат.Область(,1,,1);
					Обл.ШиринаКолонки = 25;
				КонецЕсли;
			Иначе
				// Вывод отчета в табличный документ
				Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
				ТиповыеОтчеты.ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект);
				ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета);
				ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
				ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
				ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
			#КонецЕсли
		КонецЕсли;
		
		
		
	КонецФункции
	
	Функция ПолучитьОписаниеПериода(КомпоновщикНастроек)
		ОписаниеПериода = "";
		
		ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		
		Если ЗначениеПараметраНачалоПериода <> Неопределено 
			И ЗначениеПараметраКонецПериода <> Неопределено Тогда
			НачалоПериода = ЗначениеПараметраНачалоПериода.Значение;
			КонецПериода = ЗначениеПараметраКонецПериода.Значение;
			Если НачалоПериода = '00010101' И КонецПериода = '00010101' Тогда
				ОписаниеПериода = НСтр("ru='Период не установлен'");
			ИначеЕсли НачалоПериода = '00010101' ИЛИ КонецПериода = '00010101' Тогда
				ОписаниеПериода = Формат(НачалоПериода, "ДФ = дд.ММ.гггг; ДП = ...") + " - " + Формат(КонецПериода, "ДФ = дд.ММ.гггг; ДП = ...");
			ИначеЕсли НачалоПериода <= КонецПериода Тогда
				ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
			Иначе
				ОписаниеПериода = НСтр("ru='Неправильно задан период!'");
			КонецЕсли;
		ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
			Период = ЗначениеПараметраПериод.Значение;
			Если Период = '00010101' Тогда
				ОписаниеПериода = НСтр("ru='на '") + Формат(ТекущаяДата(), "ДП = ...");
			Иначе
				ОписаниеПериода = НСтр("ru='на конец дня '") + Формат(Период, "ДФ = дд.ММ.гггг; ДП = ...");
			КонецЕсли;
		Иначе
			ОписаниеПериода = "";
		КонецЕсли;
		Если Не ПустаяСтрока(ОПисаниеПериода) Тогда
			ОписаниеПериода = "за период: " + ОписаниеПериода + Символы.ПС;
		КонецЕсли;
		Возврат ОписаниеПериода;
	КонецФункции
	
	// Выводит типовой отчет в табличный документ
	Процедура ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено, ВыводитьШапкуОтчетаНаВсехСтраницах = истина)
		
		ОтчетОбъект.КомпоновщикНастроек.Восстановить();
		Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект);
		
		//Сгенерируем макет компоновки данных при помощи компоновщика макета
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		Попытка
			
			//В качестве схемы компоновки будет выступать схема самого отчета
			//В качестве настроек отчета - текущие настройки отчета
			//Данные расшифровки будем помещать в ДанныеРасшифровки
			Если ВыводВФормуОтчета Тогда
				МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, ОтчетОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
				ТиповыеОтчеты.ДополнитьМакетыМакетаКомпоновкиРасшифровкойРесурсов(МакетКомпоновки, ОтчетОбъект.КомпоновщикНастроек);
				//Создадим и инициализируем процессор компоновки
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				Если ВнешниеНаборыДанных = Неопределено Тогда
					ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
				Иначе
					ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
				КонецЕсли;
			Иначе
				МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, ОтчетОбъект.КомпоновщикНастроек.Настройки);
				//Создадим и инициализируем процессор компоновки
				ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
				Если ВнешниеНаборыДанных = Неопределено Тогда
					ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
				Иначе
					ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина);
				КонецЕсли;
			КонецЕсли;
			
			//Создадим и инициализируем процессор вывода результата
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(Результат);
			
			//Обозначим начало вывода
			ПроцессорВывода.НачатьВывод();
			Состояние(НСТР("ru='Если Вы хотите прервать вывод отчета, нажмите Ctrl+Break'"));
			
			ТаблицаЗафиксирована = Не ВыводВФормуОтчета;
			
			Результат.ФиксацияСверху = 0;
			
			ВывестиГоризонтальныйРазделитель = Ложь;
			
			//Основной цикл вывода отчета
			Пока Истина Цикл
				
				ОбработкаПрерыванияПользователя();
				//Получим следующий элемент результата компоновки
				ЭлементРезультата = ПроцессорКомпоновки.Следующий();
				
				Если ЭлементРезультата = Неопределено Тогда
					//Следующий элемент не получен - заканчиваем цикл вывода
					Прервать;
					
				Иначе
					
					// Зафиксируем шапку
					Если //Не ОтчетОбъект.РасширеннаяНастройка 
						//И 
						Не ТаблицаЗафиксирована 
						И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 
						И ТипЗнч(ОтчетОбъект.КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ДиаграммаКомпоновкиДанных") Тогда
						ТаблицаЗафиксирована = Истина;
						
						Если ОтчетОбъект.ЭтоРасшифровка Тогда
							Результат.ФиксацияСверху = Результат.ВысотаТаблицы;
						КонецЕсли;
						
						Если ВыводитьШапкуОтчетаНаВсехСтраницах тогда
							ОбластьШапки = Результат.Область(4, ,Результат.ВысотаТаблицы, );
							
							Если ОтчетОбъект.ЭтоРасшифровка Тогда
								Результат.ПовторятьПриПечатиСтроки = ОбластьШапки;
							Иначе
								
								//Чтобы потом отличить окончание шапки
								ОблПоследняяСтрокаШапки = Результат.Область(Результат.ВысотаТаблицы,1,Результат.ВысотаТаблицы,1);
								ОблПоследняяСтрокаШапки.Имя = "Шапка";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					//Элемент получен - выведем его при помощи процессора вывода
					ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
					
					Если ВывестиГоризонтальныйРазделитель Тогда
						Результат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			//Обозначем завершение вывода
			ПроцессорВывода.ЗакончитьВывод();
			
		Исключение
			Вопрос("Отчет не сформирован!" + Символы.ПС + ТиповыеОтчеты.ПолучитьОписаниеРодительскойПричиныИнформацииОбОшибке(ИнформацияОбОшибке()), РежимДиалогаВопрос.ОК);
		КонецПопытки;
		
	КонецПроцедуры
	
	// Выводит заголовок типового отчета в табличный документ
	Процедура ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета = Истина, ВыводЗаголовкаПриРасширеннойНастройке = Ложь) Экспорт //Аверсон ЕАЕ 24.05.2021 СВФР-007611 параметр ВыводЗаголовкаПриРасширеннойНастройке
		
		//Аверсон ЕАЕ 25.05.2021 СВФР-007611
		//Если ОтчетОбъект.РасширеннаяНастройка Тогда
		Если ОтчетОбъект.РасширеннаяНастройка И Не ВыводЗаголовкаПриРасширеннойНастройке Тогда
			//Аверсон СВФР-007611
			
			Возврат;                                           
		КонецЕсли;
		
		Если ТиповыеОтчеты.ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
			ЗначениеПараметра = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput"));
			ВыводитьЗаголовок = (ЗначениеПараметра.Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить И ЗначениеПараметра.Использование);
			Если Не ВыводВФормуОтчета И Не ВыводитьЗаголовок Тогда
				Возврат;
			КонецЕсли;
			
			//МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокТиповогоОтчета");
			МакетЗаголовок = ПолучитьМакет("ЗаголовокТиповогоОтчета");
			
			//Аверсон ЕАЕ 02.07.2021 б/н
			
			//Аверсон ЕАЕ 16.11.2021 СВФР-008385
			Бригады = Новый СписокЗначений;
			//Аверсон СВФР-008385
			
			Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест") 
				ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
				ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений") Тогда
				ОбластьТекДата = МакетЗаголовок.ПолучитьОбласть("ТекДата");
				ОбластьТекДата.Параметры.ТекДата = ТекущаяДата();
				Результат.Вывести(ОбластьТекДата);
				
				//Аверсон ЕАЕ 16.11.2021 СВФР-008385
				Бригады = ОтчетОбъект.Бригада;
				//Аверсон СВФР-008385
				
				//Аверсон ЕАЕ 17.01.2022 СВФР-008610
				Если ОтчетОбъект.ЭтоРасшифровка Тогда
					ОбластьВидРасчета = МакетЗаголовок.ПолучитьОбласть("ВидРасчета");
					Если ОтчетОбъект.ВыводитьВидРасчетаВРасшифровке = Истина Тогда
						ЭлементыОтбора = ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы;
						ВидРасчета = "не определен";
						Для Каждого Эл Из ЭлементыОтбора Цикл
							Если ТипЗнч(Эл) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
								Продолжить;
							КонецЕсли;
							Если Эл.Использование = Истина И Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидРасчета") Тогда
								ВидРасчета = Эл.ПравоеЗначение;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						ВидРасчетаВШапку = "Вид расчета: " + СокрЛП(ВидРасчета);
					Иначе
						ВидРасчетаВШапку = "По всем видам расчета";
					КонецЕсли;
					ОбластьВидРасчета.Параметры.ВидРасчета = ВидРасчетаВШапку;
					Результат.Вывести(ОбластьВидРасчета);
				КонецЕсли;
				//Аверсон СВФР-008610
			КонецЕсли;
			//Аверсон
			
			ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
			ЗаголовокОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение;
			
			//Аверсон ЕАЕ 16.11.2021 СВФР-008385
			Если Бригады.Количество() > 0 Тогда
				ЗаголовокОтчетаСвод = "Свод начисленной зарплаты по: ";
				//Если Бригады.Количество() = 1 Тогда
				//	ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + "бригаде ";	
				//Иначе
				//	ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + "бригадам ";	
				//КонецЕсли;
				н = 0;
				Для Каждого ЭлСписка Из Бригады Цикл
					н = н + 1;
					ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + ?(н = 1, "", ", ") + """" + СокрЛП(ЭлСписка.Значение) + """";	
				КонецЦикла;
				ЗаголовокОтчета = ЗаголовокОтчетаСвод;
			КонецЕсли;
			//Аверсон СВФР-008385
			
			ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
			ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета = ПолучитьОписаниеНастроекОтчета(ОтчетОбъект.КомпоновщикНастроек);
			Результат.Вывести(ОбластьЗаголовок);
		Иначе
			ЗначенияНастроек = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
			ВыводитьЗаголовокОтчета = Истина;
			Если ЗначенияНастроек = Неопределено
				ИЛИ Не ЗначенияНастроек.Свойство("ВыводитьЗаголовокОтчета", ВыводитьЗаголовокОтчета) Тогда
				ВыводитьЗаголовок = Истина;	
			Иначе
				ВыводитьЗаголовок = ВыводитьЗаголовокОтчета;
			КонецЕсли;
			
			Если Не ВыводВФормуОтчета И Не ВыводитьЗаголовок Тогда
				Возврат;
			КонецЕсли;
			МакетЗаголовок = ПолучитьМакет("ЗаголовокТиповогоОтчета");
			
			//Аверсон ЕАЕ 02.07.2021 б/н
			Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест") 
				ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
				ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений") Тогда
				ОбластьТекДата = МакетЗаголовок.ПолучитьОбласть("ТекДата");
				ОбластьТекДата.Параметры.ТекДата = ТекущаяДата();
				Результат.Вывести(ОбластьТекДата);
			КонецЕсли;
			//Аверсон
			
			ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
			ЗначениеПараметра = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
			ЗаголовокОтчета = ЗначениеПараметра.Значение;
			Если ПустаяСтрока(ЗаголовокОтчета) Тогда
				ЗаголовокОтчета = ТиповыеОтчеты.ПолучитьЗаголовокОтчета(ОтчетОбъект);
			КонецЕсли;
			ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
			ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета = ПолучитьОписаниеНастроекОтчета(ОтчетОбъект.КомпоновщикНастроек);
			Результат.Вывести(ОбластьЗаголовок);
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПолучитьОписаниеНастроекОтчета(КомпоновщикНастроек) Экспорт
		
		Если КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Период
		ОписаниеПериода = ПолучитьОписаниеПериода(КомпоновщикНастроек);
		//ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		//ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		//ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		//
		//Если ЗначениеПараметраНачалоПериода <> Неопределено 
		//   И ЗначениеПараметраКонецПериода <> Неопределено Тогда
		//	НачалоПериода = ЗначениеПараметраНачалоПериода.Значение;
		//	КонецПериода = ЗначениеПараметраКонецПериода.Значение;
		//	Если НачалоПериода = '00010101' И КонецПериода = '00010101' Тогда
		//		ОписаниеПериода = НСтр("ru='Период не установлен'");
		//	ИначеЕсли НачалоПериода = '00010101' ИЛИ КонецПериода = '00010101' Тогда
		//		ОписаниеПериода = Формат(НачалоПериода, "ДФ = дд.ММ.гггг; ДП = ...") + " - " + Формат(КонецПериода, "ДФ = дд.ММ.гггг; ДП = ...");
		//	ИначеЕсли НачалоПериода <= КонецПериода Тогда
		//		ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		//	Иначе
		//		ОписаниеПериода = НСтр("ru='Неправильно задан период!'");
		//	КонецЕсли;
		//ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
		//	Период = ЗначениеПараметраПериод.Значение;
		//	Если Период = '00010101' Тогда
		//		ОписаниеПериода = НСтр("ru='на '") + Формат(ТекущаяДата(), "ДП = ...");
		//	Иначе
		//		ОписаниеПериода = НСтр("ru='на конец дня '") + Формат(Период, "ДФ = дд.ММ.гггг; ДП = ...");
		//	КонецЕсли;
		//Иначе
		//	ОписаниеПериода = "";
		//КонецЕсли;
		//Если Не ПустаяСтрока(ОПисаниеПериода) Тогда
		//	ОписаниеПериода = "Период: " + ОписаниеПериода + Символы.ПС;
		//КонецЕсли;
		
		//ЭлементОтчета = КомпоновщикНастроек.Настройки.Структура[0];
		//ПредставлениеЭлементаОтчета = ПолучитьПредставлениеПоЭлементуСтруктуры(ЭлементОтчета);
		//Если ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Таблица Тогда
		//	Строки = ПолучитьМассивГруппировок(ЭлементОтчета, КомпоновщикНастроек);
		//	ТипСтрок = "Группировки строк";
		//ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.КроссТаблица Тогда
		//	Если ЭлементОтчета.Строки.Количество() > 0 Тогда
		//		Строки = ПолучитьМассивГруппировок(ЭлементОтчета.Строки[0], КомпоновщикНастроек);
		//	Иначе
		//		Строки = Новый Массив;
		//	КонецЕсли;
		//	ТипСтрок = "Группировки строк";
		//	Если ЭлементОтчета.Колонки.Количество() > 0 Тогда
		//		Колонки = ПолучитьМассивГруппировок(ЭлементОтчета.Колонки[0], КомпоновщикНастроек); 
		//	Иначе
		//		Колонки = Новый Массив;
		//	КонецЕсли;
		//	ТипКолонок = "Группировки колонок";
		//ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Диаграмма Тогда
		//	Если ЭлементОтчета.Серии.Количество() > 0 Тогда
		//		Строки = ПолучитьМассивГруппировок(ЭлементОтчета.Серии[0], КомпоновщикНастроек);
		//	Иначе
		//		Строки = Новый Массив;
		//	КонецЕсли;
		//	ТипСтрок = "Группировки серий";
		//	Если ЭлементОтчета.Точки.Количество() > 0 Тогда
		//		Колонки = ПолучитьМассивГруппировок(ЭлементОтчета.Точки[0], КомпоновщикНастроек); 
		//	Иначе
		//		Колонки = Новый Массив;
		//	КонецЕсли;
		//	ТипКолонок = "Группировки точек";
		//КонецЕсли;
		
		//Показатели = ПолучитьПоказатели(КомпоновщикНастроек);
		//ДополнительныеПоля = ПолучитьДополнительныеПоля(КомпоновщикНастроек);
		
		//СтрокаОтбор = Строка(КомпоновщикНастроек.Настройки.Отбор);
		ОписаниеНастроекОтчета = 
		ОписаниеПериода; // +
		//СформироватьСтрокуПолей(ТипСтрок, Строки) + 
		//СформироватьСтрокуПолей(ТипКолонок, Колонки) + 
		//СформироватьСтрокуПолей("Дополнительные поля", ДополнительныеПоля) +
		//СформироватьСтрокуПолей("Показатели", Показатели) +
		//?(ПустаяСтрока(СтрокаОтбор) , "", "Отбор: " + СтрокаОтбор);
		
		Возврат ОписаниеНастроекОтчета;		
		
	КонецФункции
	
	//Аверсон 
	
	ЭтоРасшифровка = ложь;
	
	//Аверсон ЕАЕ 08.09.2021 СВФР-008026
	//Если Сокращенно Тогда
	//	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхСокращенно");
	//Иначе
	//	Если ПоБригадам Тогда
	//		Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанныхПоБригадам");
	//	Иначе
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//	КонецЕсли;
	//КонецЕсли;
	//Аверсон СВФР-008026
	
	СхемаКомпоновкиДанных = Схема;
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
#КонецЕсли


#Если Клиент Тогда
	
	
	
	Расшифровки = Новый СписокЗначений;
	
	НастройкаПериода = Новый НастройкаПериода;
	
#КонецЕсли

