
#Если Клиент Тогда

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки) Экспорт

	//Аверсон ЕАЕ 11.09.2025 СВФР-016633
	//СТРИМ
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//Аверсон СВФР-016633
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Физлицо",		  Работник.Физлицо);
	Запрос.УстановитьПараметр("Сотрудник",		  Работник);
	ВыводимыеОбласти = Новый Массив();  //Островская Татьяна 27.11.2013 № 16936
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизаций.Код КАК ТабельныйНомер,
	|	СотрудникиОрганизаций.Физлицо.Пол КАК Пол,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	СотрудникиОрганизаций.Физлицо.ДатаРождения КАК ДатаРождения,
	|	СотрудникиОрганизаций.Физлицо.МестоРождения КАК МестоРождения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)
	|			ТОГДА ""Республика Беларусь""
	|		КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяССылка)
	|			ТОГДА ""Республика Беларусь""
	|		КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ЛицоБезГражданства)
	|			ТОГДА ""Лицо без гражданства""
	|		ИНАЧЕ ""Иностранный гражданин""
	|	КОНЕЦ КАК Гражданство,
	|	РаботникиОрганизацииСрезПоследних1.Должность КАК Должность,
	
	//Аверсон ЕАЕ 11.09.2025 СВФР-016633
	|   РаботникиОрганизацииСрезПоследних1.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|   КонтактнаяИнформацияТелефонСлужебный.Представление КАК ТелефонСлужебный,
	//Аверсон СВФР-016633
	
	|	РаботникиОрганизацииСрезПоследних.Организация.НаименованиеПолное КАК НазваниеОрганизации,
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение КАК СемейноеПоложение,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан1 КАК ДокументКемВыдан,
	|	ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ЛичныйНомер КАК ДокументЛичныйНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	КонтактнаяИнформацияАдрес.Представление КАК АдресПроживания,
	|	КонтактнаяИнформацияТелефонДом.Представление КАК ТелефонДомашний,
	|	СотрудникиОрганизаций.Физлицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	РаботникиОрганизацииСрезПоследних.Период КАК ДатаПриема,
	|	ПОДСТРОКА(СотрудникиОрганизаций.Физлицо.Наименование, 1, 1) КАК Буква,
	|	ВоинскийУчетСрезПоследних.ГруппаВоинскогоУчета,
	|	ВоинскийУчетСрезПоследних.КатегорияЗапаса КАК КатегорияВоинскогоУчета,
	|	ВоинскийУчетСрезПоследних.Состав,
	|	ВоинскийУчетСрезПоследних.Звание,
	|	ВоинскийУчетСрезПоследних.ВУС1 как ВУС,
	|	ВоинскийУчетСрезПоследних.Годность,
	|	ВоинскийУчетСрезПоследних.Военкомат,
	|	ВоинскийУчетСрезПоследних.СпецУчет,
	|	КонтактнаяИнформацияТелефонМоб.Представление КАК ТелефонМобильный,
	|	КонтактнаяИнформацияАдресПрописка.Представление КАК АдресПрописки,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК Документ
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК СемейноеПоложениеФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
	|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияАдрес.Объект
	|			И (КонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонДом
	|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияТелефонДом.Объект
	|			И (КонтактнаяИнформацияТелефонДом.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформацияТелефонДом.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.КонтактнТелефонКандидата))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				Сотрудник = &Сотрудник
	|					И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних1
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаАктуальности, Физлицо = &ФизЛицо) КАК ВоинскийУчетСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонМоб
	|		ПО (КонтактнаяИнформацияТелефонМоб.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформацияТелефонМоб.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица))
	|			И СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияТелефонМоб.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресПрописка
	|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияАдресПрописка.Объект
	|			И (КонтактнаяИнформацияАдресПрописка.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияАдресПрописка.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	
	//Аверсон ЕАЕ 11.09.2025 790016243
	|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонСлужебный
	|       ПО КонтактнаяИнформацияТелефонСлужебный.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|       И КонтактнаяИнформацияТелефонСлужебный.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный)
	|       И СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияТелефонСлужебный.Объект
	//Аверсон 790016243
	
	|ГДЕ
	|	СотрудникиОрганизаций.Ссылка = &Сотрудник";
	
	ВыборкаРезультата	=	Запрос.Выполнить().Выбрать();

	ДокументРезультат.Очистить();
 	Макет 				= 	ПолучитьМакет("Макет");
	
	ЛицеваяСторона	= 	Макет.ПолучитьОбласть("ЛицеваяСторона");
	ОборотнаяСторона  =   Макет.ПолучитьОбласть("ОборотнаяСторона");
	
	//Аверсон ЕАЕ 01.02.2023 СВФР-010239
	Должность = Справочники.ДолжностиОрганизаций.ПустаяСсылка();
	//Аверсон СВФР-010239
	
	Если ВыборкаРезультата.Следующий() тогда
		
		//Аверсон ЕАЕ 01.02.2023 СВФР-010239
        Должность = ВыборкаРезультата.Должность;
		//Аверсон СВФР-010239
		
		ЛицеваяСторона.Параметры.Заполнить(ВыборкаРезультата);
		
		//ПерваяСтраница.Параметры.ДокументКемВыдан = СокрЛП(ВыборкаРезультата.ДокументКемВыдан);
		
		Если ВыборкаРезультата.Фамилия = NULL тогда
			ФИО		=	ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ВыборкаРезультата.Представление, " ");
			Если ФИО.Количество()	>	0	тогда
				Фамилия	=	ФИО[0];
			КонецЕсли;
			Если ФИО.Количество()	>	1	тогда
				Имя		=	ФИО[1];
			КонецЕсли;
			Если ФИО.Количество()	>	2	тогда
				Отчество=	ФИО[2];
			КонецЕсли;
			// ФИО
			ЛицеваяСторона.Параметры.Фамилия	=	Фамилия;
			ЛицеваяСторона.Параметры.Имя		=	Имя;
			ЛицеваяСторона.Параметры.Отчество   =	Отчество;
		КонецЕсли;
		
		МестоРождения = РегламентированнаяОтчетность.ПредставлениеМестаРождения(ВыборкаРезультата.МестоРождения, Работник.Физлицо.МестоРожденияПроизвольныйФормат);
		МестоРождения = СтрЗаменить(МестоРождения, "Населенный пункт: ", "");
		МестоРождения = СтрЗаменить(МестоРождения, " страна:", "");
		
		СоставСемьи = "";
		ЗапросСоставСемьи = Новый Запрос;
		ЗапросСоставСемьи.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаСоставСемьи.Имя,
		|	ФизическиеЛицаСоставСемьи.СтепеньРодства,
		|	ФизическиеЛицаСоставСемьи.ГодРождения
		|ИЗ
		|	Справочник.ФизическиеЛица.СоставСемьи КАК ФизическиеЛицаСоставСемьи
		|ГДЕ
		|	ФизическиеЛицаСоставСемьи.Ссылка = &Физлицо";
		
		ЗапросСоставСемьи.УстановитьПараметр("Физлицо",		  Работник.Физлицо);
		ВыборкаСоставСемьи = ЗапросСоставСемьи.Выполнить().Выбрать();
		
		//Аверсон ЕАЕ 11.09.2025 СВФР-016633
		//СТРИМ
		//Если Орг.ИНН = "790016243" Тогда
		Если Истина Тогда
			МассивСупруги = Новый Массив;
			МассивСупруги.Добавить("муж");
			МассивСупруги.Добавить("супруг");
			МассивСупруги.Добавить("жена");
			МассивСупруги.Добавить("супруга");
			
			ТЗРодственники = Новый ТаблицаЗначений;
			ТЗРодственники.Колонки.Добавить("Родственник");
			Супруг = "";
			Пока ВыборкаСоставСемьи.Следующий() цикл
				СтРодства = нрег(СокрЛП(ВыборкаСоставСемьи.СтепеньРодства));
				Если МассивСупруги.Найти(СтРодства) <> Неопределено Тогда
					Супруг = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");		
				Иначе
					НС = ТЗРодственники.Добавить();
					НС.Родственник = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			КонецЦикла;
			ЛицеваяСторона.Параметры.Супруг = Супруг;
		Иначе
		//Аверсон СВФР-016633
		
			Пока ВыборкаСоставСемьи.Следующий() цикл
				СоставСемьи = СоставСемьи + ВыборкаСоставСемьи.СтепеньРодства + " - " + ВыборкаСоставСемьи.Имя + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy")+"; ";
			КонецЦикла;
			СоставСемьи = Лев(СоставСемьи, СтрДлина(СоставСемьи)-1);
			ЛицеваяСторона.Параметры.СоставСемьи = СоставСемьи;
		КонецЕсли;
		
		ЗапросОбразование = Новый Запрос;
		ВысшееИСреднее = Новый СписокЗначений;
		ВысшееИСреднее.Добавить(Справочники.ВидыОбразованияФизЛиц.АспирантураОрдинатураАдъюнктура);
		ВысшееИСреднее.Добавить(Справочники.ВидыОбразованияФизЛиц.Докторантура);
		ВысшееИСреднее.Добавить(Справочники.ВидыОбразованияФизЛиц.ВысшееОбразование);
		ВысшееИСреднее.Добавить(Справочники.ВидыОбразованияФизЛиц.СреднееПолноеОбщееОбразование);
		
		//Проф = Новый СписокЗначений;
		//Проф.Добавить(Справочники.ВидыОбразованияФизЛиц.НачальноеПрофессиональноеОбразование);
		//Проф.Добавить(Справочники.ВидыОбразованияФизЛиц.СреднееПрофессиональноеОбразование);
		
		ЗапросОбразование.УстановитьПараметр("ВысшееИСреднее", ВысшееИСреднее);
		ЗапросОбразование.УстановитьПараметр("ФизЛицо", Работник.Физлицо);
		
		ЗапросОбразование.Текст =
		"ВЫБРАТЬ
		|	1 КАК ВидОбразования,
		|	ФизическиеЛицаОбразование.ВидОбразования КАК УровеньОбразования,
		|	ФизическиеЛицаОбразование.УчебноеЗаведение,
		|	ФизическиеЛицаОбразование.Специальность,
		|	ФизическиеЛицаОбразование.Диплом,
		|	ФизическиеЛицаОбразование.ГодОкончания КАК ГодОкончания,
		|	ФизическиеЛицаОбразование.Квалификация1
		|ИЗ
		|	Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
		|ГДЕ
		|	ФизическиеЛицаОбразование.Ссылка = &ФизЛицо
		|	И ФизическиеЛицаОбразование.ОсновноеОбразование = ИСТИНА //СВЭЙ 11.11.2023 КВВ СВФР-011794
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГодОкончания";
		
		ВыборкаОбразование = ЗапросОбразование.Выполнить().Выбрать();
		НомерОбразованияВВУЗЕ = 0;
		НомерОбразованияПроф = 0;
		
		Пока ВыборкаОбразование.Следующий() цикл
			Если ВыборкаОбразование.ВидОбразования = 1 тогда 
				НомерОбразованияВВУЗЕ = НомерОбразованияВВУЗЕ + 1;
				Если НомерОбразованияВВУЗЕ < 3  тогда
					//СВЭЙ 11.11.2023 КВВ СВФР-011794 (
					//ЛицеваяСторона.Параметры["НазваниеВысш" + НомерОбразованияВВУЗЕ] = ВыборкаОбразование.УчебноеЗаведение;                    
					//ЛицеваяСторона.Параметры["ДатаОкончанияВысш" + НомерОбразованияВВУЗЕ] = Формат(ВыборкаОбразование.ГодОкончания,"ЧГ=0") + " г. выпуска";
					ЛицеваяСторона.Параметры["НазваниеВысш" + НомерОбразованияВВУЗЕ] = СокрЛП(ВыборкаОбразование.УчебноеЗаведение) + ?(ЗначениеЗаполнено(ВыборкаОбразование.ГодОкончания),", " + Формат(ВыборкаОбразование.ГодОкончания,"ЧГ=0") + " г. выпуска","");
					//СВЭЙ 11.11.2023 КВВ СВФР-011794 )
					
					ЛицеваяСторона.Параметры["Специальность" + НомерОбразованияВВУЗЕ] = СокрЛП(ВыборкаОбразование.Специальность);
					ЛицеваяСторона.Параметры["Квалификация" + НомерОбразованияВВУЗЕ] = СокрЛП(ВыборкаОбразование.Квалификация1); //О.Т. 01.08.2014 № 154
					//ПерваяСтраница.Параметры["Диплом" + НомерОбразованияВВУЗЕ] = ВыборкаОбразование.Диплом;

//					ПерваяСтраница.Параметры.ОКСО = ВыборкаОбразование.Специальность.Код;
					//ПерваяСтраница.Параметры.Диплом = ВыборкаОбразование.Диплом;
					
					ЛицеваяСторона.Параметры.УровеньОбразования = СокрЛП(ВыборкаОбразование.УровеньОбразования);
				КонецЕсли;
			Иначе
				НомерОбразованияПроф = НомерОбразованияПроф +1;
				Если  НомерОбразованияПроф = 1 тогда
					//ПерваяСтраница.Параметры.НазваниеУч = ВыборкаОбразование.УчебноеЗаведение;
					//ПерваяСтраница.Параметры.ДатаОкончанияУч = Формат(ВыборкаОбразование.ГодОкончания,"ЧГ=0") + " г. выпуска";	
					//ПерваяСтраница.Параметры.Диплом = ВыборкаОбразование.Диплом;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//ЗапросПрофессеии = Новый Запрос;
		//ЗапросПрофессеии.УстановитьПараметр("Физлицо", Работник.Физлицо);
		//ЗапросПрофессеии.Текст =
		//"ВЫБРАТЬ ПЕРВЫЕ 2
		//|	ФизическиеЛицаПрофессии.Профессия
		//|ИЗ
		//|	Справочник.ФизическиеЛица.Профессии КАК ФизическиеЛицаПрофессии
		//|ГДЕ
		//|	ФизическиеЛицаПрофессии.Ссылка = &Физлицо";
		//
		//ВыборкаПрофессии = ЗапросПрофессеии.Выполнить().Выбрать();
		//КоличествоПрофессий = 0;
		//Пока ВыборкаПрофессии.Следующий() Цикл
		//	КоличествоПрофессий = КоличествоПрофессий + 1;
		//	Если КоличествоПрофессий = 1 тогда 
		//		//ПерваяСтраница.Параметры.ОКПД = ВыборкаПрофессии.Профессия.Код;	
		//		//ПерваяСтраница.Параметры.ПрофОсн = СокрЛП(ВыборкаПрофессии.Профессия);
		//	Иначе
		//		ПерваяСтраница.Параметры.ПрофВторая = СокрЛП(ВыборкаПрофессии.Профессия);
		//	КонецЕсли;
		//КонецЦикла;
		
		ВыборкаПоСтажу = ПроведениеРасчетов.ВыбратьСтажиРаботника(Работник.Физлицо);
		Пока ВыборкаПоСтажу.Следующий()	Цикл
			
			ДатаНачалаОтсчетаСтажа = ДобавитьМесяц(ВыборкаПоСтажу.ДатаОтсчета, - ВыборкаПоСтажу.РазмерМесяцев) - ВыборкаПоСтажу.РазмерДней*86400;
			Лет		= 0;
			Месяцев	= 0;
			Дней	= 0;
			ОбщегоНазначения.РазобратьРазностьДат(ДатаАктуальности, ДатаНачалаОтсчетаСтажа, Лет, Месяцев, Дней);
			НазваниеЛет = ОбщегоНазначения.ФормаМножественногоЧисла("год", "года", "лет", Лет);
			НазваниеМесяцев = ОбщегоНазначения.ФормаМножественногоЧисла("месяц", "месяца", "месяцев", Месяцев);
			НазваниеДней =  ОбщегоНазначения.ФормаМножественногоЧисла("день", "дня", "дней", Дней);
			Если ВыборкаПоСтажу.ВидСтажа = Справочники.ВидыСтажа.ОбщийСтаж  Тогда
				
				//ПерваяСтраница.Параметры.Общий	= Формат(Лет) + " " + НазваниеЛет + " " + Формат(Месяцев) + " " + НазваниеМесяцев + " " + Формат(Дней) + " " + НазваниеДней;
					
			//ИначеЕсли ВыборкаПоСтажу.ВидСтажа = Справочники.ВидыСтажа.НепрерывныйСтаж Тогда
			//	ПерваяСтраница.Параметры.Непрерывный	=	Формат(ВыборкаПоСтажу.ДатаОтсчета, "ДФ='ММММ гггг'")+" - " +Формат(ДатаАктуальности, "ДФ='ММММ гггг'") ;
            КонецЕсли;	
		КонецЦикла;
		
		
		
		//ПерваяСтраница.Параметры.НаПредприятии	=	Формат(ВыборкаРезультата.ДатаПриема, "ДФ='ММММ гггг'")+" - " +Формат(ДатаАктуальности, "ДФ='ММММ гггг'") ;
      	ЛицеваяСторона.Параметры.МестоРождения = МестоРождения;
		//ПерваяСтраница.Параметры.ДатаЗаполнения			= Формат(ДатаАктуальности, "ДФ='дд ММММ гггг'");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВоинскийУчетСрезПоследних.Физлицо,
		|	ВоинскийУчетСрезПоследних.ГруппаВоинскогоУчета КАК ГрУчета,
		|	ВоинскийУчетСрезПоследних.КатегорияЗапаса КАК КатУчета,
		|	ВоинскийУчетСрезПоследних.Состав,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.ВУС1,
		|	ВоинскийУчетСрезПоследних.Годность,
		|	ВоинскийУчетСрезПоследних.СпецУчет,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		
		//Аверсон ЕАЕ 11.09.2025 СВФР-016633
		|   ВоинскийУчетСрезПоследних.РазрядЗапаса,
		|   ВоинскийУчетСрезПоследних.ВУС1.Код КАК ВУСКод,
		|   ВоинскийУчетСрезПоследних.ОтношениеКВоинскомуУчету,
		|   ВоинскийУчетСрезПоследних.Период,
		|   ВоинскийУчетСрезПоследних.ОсобыеОтметки
		//Аверсон СВФР-016633
		
		|ИЗ
		|	РегистрСведений.ВоинскийУчет.СрезПоследних КАК ВоинскийУчетСрезПоследних
		|ГДЕ
		|	ВоинскийУчетСрезПоследних.Физлицо = &Физлицо";
		
		Запрос.УстановитьПараметр("Физлицо", Работник.Физлицо);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		
		ОсобыеОтметки = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЛицеваяСторона.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			
			//Аверсон ЕАЕ 11.09.2025 СВФР-016633
			//СТРИМ
			//Если Орг.ИНН = "790016243" Тогда
				ЛицеваяСторона.Параметры.ГрУчета = СокрЛП(ВыборкаДетальныеЗаписи.ГрУчета) + " запаса" + ?(СокрЛП(ВыборкаДетальныеЗаписи.Военкомат) = "", "", ", ") + СокрЛП(ВыборкаДетальныеЗаписи.Военкомат);
				ЛицеваяСторона.Параметры.ГрУчета1 = СокрЛП(ВыборкаДетальныеЗаписи.ГрУчета);
				ЛицеваяСторона.Параметры.ВУС1 = СокрЛП(ВыборкаДетальныеЗаписи.ВУСКод);
				Если ВыборкаДетальныеЗаписи.ОтношениеКВоинскомуУчету = Перечисления.ОтношениеКВоинскомуУчету.СнятПоВозрасту Тогда
					ЛицеваяСторона.Параметры.ДатаСнятия = Формат(ВыборкаДетальныеЗаписи.Период, "ДФ=dd.MM.yyyy");
				КонецЕсли;
				ОсобыеОтметки = СокрЛП(ВыборкаДетальныеЗаписи.ОсобыеОтметки);
			//КонецЕсли;
			//Аверсон СВФР-016633
			                                                         
		КонецЦикла;
		
		//Аверсон ЕАЕ 11.09.2025 СВФР-016633
		//СТРИМ
		//Если Орг.ИНН = "790016243" Тогда
			ЛицеваяСторона.Параметры.Организация = СокрЛП(Орг.НаименованиеПолное);
			ЛицеваяСторона.Параметры.Подразделение = СокрЛП(ВыборкаРезультата.ПодразделениеОрганизации);
			ЛицеваяСторона.Параметры.ТелефонРабочий = СокрЛП(ВыборкаРезультата.ТелефонСлужебный);
			ЛицеваяСторона.Параметры.ДатаПриема = Формат(ВыборкаРезультата.ДатаПриема, "ДФ=dd.MM.yyyy");
		//КонецЕсли;
		//Аверсон СВФР-016633

	КонецЕсли;
	
	//Аверсон ЕАЕ 11.09.2025 СВФР-016633
	//СТРИМ
	//Если Орг.ИНН = "790016243" Тогда
	//	ЛицеваяСторона.Параметры.Организация = СокрЛП(Орг.НаименованиеПолное);
	//	ЛицеваяСторона.Параметры.Подразделение = СокрЛП(Орг.ПодразделениеОрганизации);
	//КонецЕсли;
	//Аверсон СВФР-016633
	
	// Вывод страниц документа
	ДокументРезультат.Вывести(ЛицеваяСторона);
	
	//Аверсон ЕАЕ 11.09.2025 СВФР-016633
	//СТРИМ
	//Если Орг.ИНН = "790016243" Тогда
		н = 0;
		Для Каждого Стр Из ТЗРодственники Цикл
			н = н + 1;
			Если н > 4 Тогда
				Прервать;
			КонецЕсли;
			Обл = ДокументРезультат.Область(31 + н, 19, 31 + н, 31);
			Обл.Текст = Стр.Родственник;
		КонецЦикла;
	//КонецЕсли;
	
	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();

	//
	//ЗапросПеремещения = Новый Запрос;
	//ЗапросПеремещения.УстановитьПараметр("Сотрудник", Работник);
	//ЗапросПеремещения.Текст =
	//"ВЫБРАТЬ
	//|	РаботникиОрганизаций.Период,
	//|	РаботникиОрганизаций.Регистратор,
	//|	РаботникиОрганизаций.ПодразделениеОрганизации,
	//|	РаботникиОрганизаций.Должность,
	//|	РаботникиОрганизаций.Категория,
	//|	ТарифныеСтавкиРаботниковОрганизации.Ставка,
	//|	РаботникиОрганизаций.Должность.Категория,
	//|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.НомерД КАК НомерТД,
	//|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ДатаПриказа КАК ДатаТД
	//|ИЗ
	//|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	//|		ПО РаботникиОрганизаций.Регистратор = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
	//|			И РаботникиОрганизаций.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	//|		ПО РаботникиОрганизаций.Регистратор = ТарифныеСтавкиРаботниковОрганизации.Регистратор
	//|			И РаботникиОрганизаций.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	//|ГДЕ
	//|	РаботникиОрганизаций.Сотрудник = &Сотрудник
	//|	И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//|	И НЕ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций";
	//	
	//ВыборкаПеремещения = ЗапросПеремещения.Выполнить().Выбрать();
	//
	//Если ВыборкаПеремещения.Количество() > 0  тогда
	//	ДокументРезультат.Присоединить(ШапкаПеремещения);
	//КонецЕсли;
	//
	//Пока ВыборкаПеремещения.Следующий() цикл
	//	
	//	Перемещения.Параметры.Дата = Формат(ВыборкаПеремещения.Период, "ДФ='дд.ММ.гг'"); 
	//	Перемещения.Параметры.ПоразделениеОрганизации = СокрЛП(ВыборкаПеремещения.ПодразделениеОрганизации);
	//	Перемещения.Параметры.Категория = СокрЛП(ВыборкаПеремещения.Категория);
	//	Перемещения.Параметры.Должность = СокрЛП(ВыборкаПеремещения.Должность);
	//	Перемещения.Параметры.Тариф = ВыборкаПеремещения.Ставка;//Островская Татьяна 15.04.2014 № 17279
	//	Если ТипЗнч(ВыборкаПеремещения.Регистратор) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") тогда
	//		Перемещения.Параметры.НаименованиеДокумента = "Прием на работу Приказ от "+Формат(?(ЗначениеЗаполнено(ВыборкаПеремещения.ДатаТД),ВыборкаПеремещения.ДатаТД,Дата(1,1,1)), "ДФ='дд.ММ.гг'")+" № "+ Строка(?(ЗначениеЗаполнено(ВыборкаПеремещения.НомерТД),ВыборкаПеремещения.НомерТД,0));
	//	ИначеЕсли ТипЗнч(ВыборкаПеремещения.Регистратор) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") тогда
	//		Перемещения.Параметры.НаименованиеДокумента = "Кадровое перемещение от "+Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'")+" № "+строка(Число(ВыборкаПеремещения.Регистратор.Номер));
	//	ИначеЕсли ТипЗнч(ВыборкаПеремещения.Регистратор) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") тогда
	//		Перемещения.Параметры.НаименованиеДокумента = "Изменение периодических реквизитов от "+Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'")+" № "+строка(Число(ВыборкаПеремещения.Регистратор.Номер));//О.Т. Аверсон 18.04.2017 № 529		
	//	Иначе
	//		Перемещения.Параметры.НаименованиеДокумента = "Увольнение от "+Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'")+" № "+строка(Число(ВыборкаПеремещения.Регистратор.Номер));
	//	КонецЕсли;
	//	//	Перемещения.Параметры.ДатаДокумента = Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'");
	//	//	Перемещения.Параметры.НомерДокумента = ВыборкаПеремещения.Регистратор.Номер;
	//	Перемещения.Параметры.РасшифровкаПеремещения =  ВыборкаПеремещения.Регистратор;
	//	
	//	ДокументРезультат.Присоединить(Перемещения);	
	//	
	//КонецЦикла;
	////Островская Татьяна 27.11.2013 № 16936
	//Если ВыборкаПеремещения.Количество() > 0  тогда
	//	ВыводимыеОбласти.Добавить(ШапкаПеремещения);
	//	ВыводимыеОбласти.Добавить(Перемещения);
	//	//ВыводимыеОбласти.Добавить(ПроверкаДоп);//Островская Татьяна 21.01.2014
	//	ПроверкаВмещения = ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
	//	пока ПроверкаВмещения Цикл  
	//		Перемещения.Параметры.Дата = ""; 
	//		Перемещения.Параметры.ПоразделениеОрганизации = "";
	//		Перемещения.Параметры.Категория = "";
	//		Перемещения.Параметры.Должность = "";
	//		Перемещения.Параметры.Тариф = "";
	//		//		Перемещения.Параметры.Тариф = ВыборкаПеремещения.Ставка;
	//		
	//		Перемещения.Параметры.НаименованиеДокумента = "";
	//		//	Перемещения.Параметры.ДатаДокумента = Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'");
	//		//	Перемещения.Параметры.НомерДокумента = ВыборкаПеремещения.Регистратор.Номер;
	//		Перемещения.Параметры.РасшифровкаПеремещения =  "";
	//		
	//		ДокументРезультат.Присоединить(Перемещения);
	//		ПроверкаВмещения = ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
	//	КонецЦикла;
	//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	//КонецЕсли;
	////Островская Татьяна 27.11.2013 № 16936
	//ЗапросОтпуск = Новый Запрос;
	//ЗапросОтпуск.УстановитьПараметр("Сотрудник", Работник);
	//
	//// ОТПУСКА
	//СписокОтпусков = Новый Массив;
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть);	
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины);
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы);
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебный);
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый);
	//СписокОтпусков.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
	//ЗапросОтпуск.УстановитьПараметр("СписокОтпусков",	СписокОтпусков);
	//ЗапросОтпуск.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	//
	//ЗапросОтпуск.Текст = 
	//"ВЫБРАТЬ 
	//|	ОтпускаРаботника.ДатаС,
	//|	ОтпускаРаботника.ДатаПо,
	//|	ОтпускаРаботника.ДополнительныйОтпуск,
	//|	ОтпускаРаботника.ДатаНачалаДоп,
	//|	ОтпускаРаботника.ДатаОкончанияДоп,
	//|	ОтпускаРаботника.Регистратор,
	//|	ОтпускаРаботника.ДатаПриказа,
	//|	ОтпускаРаботника.НомерПриказа,
	//|	ОтпускаРаботника.Продолжительность,
	//|	ОтпускаРаботника.ПродолжительностьДоп,
	//|	ОтпускаРаботника.ПричинаОтсутствия,
	//|	ОтпускаОрганизацийРаботникиОрганизации.РабочийГодС КАК РабочийГодС,
	//|	ОтпускаОрганизацийРаботникиОрганизации.РабочийГодПо КАК РабочийГодПо,
	//|	ОтпускаОрганизацийРаботникиОрганизации.Основание КАК Основание
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ОтпускаРаботника.ДатаС КАК ДатаС,
	//|		ОтпускаРаботника.ДатаПо КАК ДатаПо,
	//|		ОтпускаРаботника.ПричинаОтсутствия КАК ПричинаОтсутствия,
	//|		ОтпускаРаботника.ДополнительныйОтпуск КАК ДополнительныйОтпуск,
	//|		ЕСТЬNULL(ОтпускаРаботника.ДатаНачалаДоп,0) КАК ДатаНачалаДоп,
	//|		ЕСТЬNULL(ОтпускаРаботника.ДатаОкончанияДоп,0) КАК ДатаОкончанияДоп,
	//|		ОтпускаРаботника.Регистратор КАК Регистратор,
	//|		ОтпускаРаботника.ДатаПриказа КАК ДатаПриказа,
	//|		ОтпускаРаботника.НомерСтроки КАК НомерСтроки,
	//|		ОтпускаРаботника.НомерПриказа КАК НомерПриказа,
	//|		РАЗНОСТЬДАТ(ОтпускаРаботника.ДатаС, ОтпускаРаботника.ДатаПо, ДЕНЬ) + 1 КАК Продолжительность,
	//|		ЕСТЬNULL(РАЗНОСТЬДАТ(ОтпускаРаботника.ДатаНачалаДоп, ОтпускаРаботника.ДатаОкончанияДоп, ДЕНЬ),0) КАК ПродолжительностьДоп
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			ПериодыОтпуска.ДатаС КАК ДатаС,
	//|			ВЫБОР
	//|				КОГДА ПериодыОтпуска.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	//|					ТОГДА ВЫБОР
	//|							КОГДА ОтпускаОрганизацииРаботники.ДатаНачалаДоп = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|								ТОГДА ПериодыОтпуска.ДатаПо
	//|							ИНАЧЕ ВЫБОР
	//|									КОГДА ПериодыОтпуска.ДатаПо < ОтпускаОрганизацииРаботники.ДатаНачалаДоп
	//|										ТОГДА ПериодыОтпуска.ДатаПо
	//|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ОтпускаОрганизацииРаботники.ДатаНачалаДоп, ДЕНЬ, -1)
	//|								КОНЕЦ
	//|						КОНЕЦ
	//|				ИНАЧЕ ПериодыОтпуска.ДатаПо
	//|			КОНЕЦ КАК ДатаПо,
	//|			ПериодыОтпуска.Состояние КАК ПричинаОтсутствия,
	//|			ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска.Наименование КАК ДополнительныйОтпуск,
	//|			ОтпускаОрганизацииРаботники.ДатаНачалаДоп КАК ДатаНачалаДоп,
	//|			ВЫБОР
	//|				КОГДА ОтпускаОрганизацииРаботники.ДатаНачалаДоп = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|					ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ИНАЧЕ ПериодыОтпуска.ДатаПо
	//|			КОНЕЦ КАК ДатаОкончанияДоп,
	//|			ОтпускаОрганизацииРаботники.НомерСтроки КАК НомерСтроки,
	//|			ПериодыОтпуска.Регистратор КАК Регистратор,
	//|			ПериодыОтпуска.Регистратор.ДатаПриказа КАК ДатаПриказа,
	//|			ПериодыОтпуска.Регистратор.НомерПриказа КАК НомерПриказа
	//|		ИЗ
	//|			(ВЫБРАТЬ
	//|				ДатыУходаВОтпуск.Период КАК ДатаС,
	//|				ДОБАВИТЬКДАТЕ(ВЫБОР
	//|						КОГДА ДатыУходаВОтпуск.ПериодЗавершения >= МИНИМУМ(ДатыВозвращенияИзОтпуска.Период)
	//|								ИЛИ ДатыУходаВОтпуск.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|							ТОГДА МИНИМУМ(ДатыВозвращенияИзОтпуска.Период)
	//|						ИНАЧЕ ДатыУходаВОтпуск.ПериодЗавершения
	//|					КОНЕЦ, ДЕНЬ, -1) КАК ДатаПо,
	//|				ДатыУходаВОтпуск.Регистратор КАК Регистратор,
	//|				ДатыУходаВОтпуск.Сотрудник КАК Сотрудник,
	//|				ДатыУходаВОтпуск.Состояние КАК Состояние
	//|			ИЗ
	//|				РегистрСведений.СостояниеРаботниковОрганизаций КАК ДатыУходаВОтпуск
	//|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК ДатыВозвращенияИзОтпуска
	//|					ПО ДатыУходаВОтпуск.Период < ДатыВозвращенияИзОтпуска.Период
	//|						И ДатыУходаВОтпуск.Сотрудник = ДатыВозвращенияИзОтпуска.Сотрудник
	//|			ГДЕ
	//|				ДатыУходаВОтпуск.Период <= &ДатаАктуальности
	//|				И ДатыУходаВОтпуск.Состояние В(&СписокОтпусков)
	//|				И ДатыУходаВОтпуск.Сотрудник = &Сотрудник
	//|			
	//|			СГРУППИРОВАТЬ ПО
	//|				ДатыУходаВОтпуск.Период,
	//|				ДатыУходаВОтпуск.ПериодЗавершения,
	//|				ДатыУходаВОтпуск.Регистратор,
	//|				ДатыУходаВОтпуск.Сотрудник,
	//|				ДатыУходаВОтпуск.Состояние) КАК ПериодыОтпуска
	//|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
	//|				ПО ПериодыОтпуска.ДатаС = ОтпускаОрганизацииРаботники.ДатаНачала
	//|					И ПериодыОтпуска.Регистратор = ОтпускаОрганизацииРаботники.Ссылка
	//|					И ПериодыОтпуска.Сотрудник = ОтпускаОрганизацииРаботники.Сотрудник) КАК ОтпускаРаботника
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	//|			ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтпускаРаботника.ДатаС И ОтпускаРаботника.ДатаПо
	//|					ИЛИ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтпускаРаботника.ДатаНачалаДоп И ОтпускаРаботника.ДатаОкончанияДоп)
	//|				И (РегламентированныйПроизводственныйКалендарь.ВидДня <> ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник))
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ОтпускаРаботника.ДатаС,
	//|		ОтпускаРаботника.ДатаПо,
	//|		ОтпускаРаботника.ПричинаОтсутствия,
	//|		ОтпускаРаботника.ДополнительныйОтпуск,
	//|		ОтпускаРаботника.ДатаНачалаДоп,
	//|		ОтпускаРаботника.ДатаОкончанияДоп,
	//|		ОтпускаРаботника.Регистратор,
	//|		ОтпускаРаботника.ДатаПриказа,
	//|		ОтпускаРаботника.НомерСтроки,
	//|		ОтпускаРаботника.НомерПриказа) КАК ОтпускаРаботника
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
	//|		ПО ОтпускаРаботника.Регистратор = ОтпускаОрганизацийРаботникиОрганизации.Ссылка
	//|			И ОтпускаРаботника.НомерСтроки = ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
	//|	
	////+ СВЭЙ КДЯ 06.12.19 СВФР-005152
	//|	УПОРЯДОЧИТЬ ПО
	//|		ОтпускаРаботника.ДатаС,
	//|		ОтпускаРаботника.ДатаПо
	////- СВЭЙ КДЯ 06.12.19 СВФР-005152
	//|";
	//					

	//ВыборкаОтпуска = ЗапросОтпуск.Выполнить().Выбрать();
	////Островская Татьяна 21.01.2014 
	////Если ВыборкаОтпуска.Количество() > 0  тогда
	//	ДокументРезультат.Присоединить(ШапкаОтпуск);
	////КонецЕсли;
	////Островская Татьяна 21.01.2014
	//
	//Пока ВыборкаОтпуска.Следующий() цикл
	//	Отпуск.Параметры.Период = Формат(ВыборкаОтпуска.РабочийГодС, "ДФ='ММММ гггг'")+" - " +Формат(ВыборкаОтпуска.РабочийГодПо, "ДФ='ММММ гггг'") ;
	//    Отпуск.Параметры.ВидОтпуска = ВыборкаОтпуска.ПричинаОтсутствия;
	//	Отпуск.Параметры.ДниОсновоной  = ВыборкаОтпуска.Продолжительность;
	//	//Отпуск.Параметры.ДниДоп1   =  ?(ВыборкаОтпуска.ПродолжительностьДоп = 0,0,ВыборкаОтпуска.ПродолжительностьДоп +1);
	//	//Отпуск.Параметры.ДниДопИтого = Отпуск.Параметры.ДниДоп1;
	//	Отпуск.Параметры.ДниИтого  =  "пр. № " + ВыборкаОтпуска.НомерПриказа + " от "+ Формат(ВыборкаОтпуска.ДатаПриказа,"ДЛФ=Д");//О.Т. Аверсон 28.11.2018 № 2852  //ВыборкаОтпуска.Продолжительность + Отпуск.Параметры.ДниДоп1;
	//	Отпуск.Параметры.ДатаНачала = Формат(ВыборкаОтпуска.ДатаС,"ДФ='дд.ММ.гггг'");
	//	Отпуск.Параметры.ДатаОкончания = Формат(?(ВыборкаОтпуска.ДатаОкончанияДоп = Дата(1,1,1),ВыборкаОтпуска.ДатаПо,ВыборкаОтпуска.ДатаОкончанияДоп),"ДФ='дд.ММ.гггг'") ;
	//	Отпуск.Параметры.РасшифровкаОтпуска = ВыборкаОтпуска.Регистратор;
	//	
	//	ДокументРезультат.Присоединить(Отпуск);
	//КонецЦикла;
	////Островская Татьяна 27.11.2013 № 16936
	////Островская Татьяна 21.01.2014
	////Если ВыборкаОтпуска.Количество() > 0  тогда
	//	ВыводимыеОбласти = Новый Массив();  //Островская Татьяна 27.11.2013 № 16936
	//	ВыводимыеОбласти.Добавить(ШапкаОтпуск);
	//	ВыводимыеОбласти.Добавить(Отпуск);
	//	//ВыводимыеОбласти.Добавить(ПроверкаДоп);
	//	ПроверкаВмещения = ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
	//	пока ПроверкаВмещения Цикл  
	//		Отпуск.Параметры.Период = "" ;
	//		Отпуск.Параметры.ВидОтпуска = "";
	//		Отпуск.Параметры.ДниОсновоной  = "";
	//		//Отпуск.Параметры.ДниДоп1   =  "";
	//		//Отпуск.Параметры.ДниДопИтого = "";
	//		Отпуск.Параметры.ДниИтого  =  "";
	//		Отпуск.Параметры.ДатаНачала = "";
	//		Отпуск.Параметры.ДатаОкончания = "";
	//		Отпуск.Параметры.РасшифровкаОтпуска = "";
	//		ДокументРезультат.Присоединить(Отпуск);
	//		ПроверкаВмещения = ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
	//	КонецЦикла;
	//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	//КонецЕсли;
	//Островская Татьяна 27.11.2013 № 16936
	
	//Аверсон ЕАЕ 01.02.2023 СВФР-010239
	
	ОсобыеОтметкиСтр1 = "";
	//Если ЗначениеЗаполнено(Должность) ИЛИ Орг.ИНН = "790016243" Тогда //Аверсон ЕАЕ 11.09.2025 СВФР-016633 (СТРИМ)
		ДолжностьСтр = нрег(СокрЛП(Должность));
		//Если Найти(ДолжностьСтр, "водитель") > 0 ИЛИ Орг.ИНН = "790016243" Тогда //Аверсон ЕАЕ 11.09.2025 СВФР-016633 (СТРИМ)
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВодительскиеУдостоверения.Серия,
			|	ВодительскиеУдостоверения.Номер,
			|	ВодительскиеУдостоверения.ДатаОкончания
			|ИЗ
			|	РегистрСведений.ВодительскиеУдостоверения КАК ВодительскиеУдостоверения
			|ГДЕ
			|	ВодительскиеУдостоверения.ФизЛицо = &ФизЛицо";
			
			Запрос.УстановитьПараметр("ФизЛицо", Работник.ФизЛицо);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				ОсобыеОтметкиСтр1 = ОсобыеОтметкиСтр1 + "Водительское удостоверение " + СокрЛП(ВыборкаДетальныеЗаписи.Серия) + 
				" " + СокрЛП(ВыборкаДетальныеЗаписи.Номер) + " до " + Формат(ВыборкаДетальныеЗаписи.ДатаОкончания, "ДФ=dd.MM.yyyy");
				ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст1 = ОсобыеОтметкиСтр1;
			КонецЕсли;
			
		//КонецЕсли;
	//КонецЕсли;
	
	ОсобыеОтметкиСтр2 = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СведенияОбИнвалидностиФизлицСрезПоследних.ГруппаИнвалидности,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СерияСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.НомерСправки,
		|	СведенияОбИнвалидностиФизлицСрезПоследних.СрокДействияСправки
		|ИЗ
		|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(, ФизЛицо = &ФизЛицо И Инвалидность = Истина) КАК СведенияОбИнвалидностиФизлицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", Работник.ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОсобыеОтметкиСтр2 = ОсобыеОтметкиСтр2 + "Удостоверение инвалида " + СокрЛП(ВыборкаДетальныеЗаписи.СерияСправки) + 
		" " + СокрЛП(ВыборкаДетальныеЗаписи.НомерСправки) + " до " + Формат(ВыборкаДетальныеЗаписи.СрокДействияСправки, "ДФ=dd.MM.yyyy") + 
		" (гр.инв." + СокрЛП(ВыборкаДетальныеЗаписи.ГруппаИнвалидности) + ")";
		Если ЗначениеЗаполнено(ОсобыеОтметкиСтр1) Тогда
			ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст2 = ОсобыеОтметкиСтр2;
		Иначе
			ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст1 = ОсобыеОтметкиСтр2;
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон ЕАЕ 11.09.2025 СВФР-016633
	//СТРИМ
	//Если Орг.ИНН = "790016243" Тогда
	Если Истина Тогда
		//ОтветственныеЛица = ПолучитьОтветственного(Орг);
		Исполнитель = ПолучитьОтветственного(Орг);
		Если ЗначениеЗаполнено(Исполнитель) Тогда
			ИсполнительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Исполнитель);
			ОборотнаяСторона.Параметры.ФИО = ИсполнительФИО;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсобыеОтметки) Тогда
			Если ЗначениеЗаполнено(ОсобыеОтметкиСтр2) Тогда
				ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст3 = ОсобыеОтметки;	
			Иначе
				Если ЗначениеЗаполнено(ОсобыеОтметкиСтр1) Тогда
					ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст2 = ОсобыеОтметки;	
				Иначе
					ОборотнаяСторона.Параметры.ОсобыеОтметкиТекст1 = ОсобыеОтметки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
	//Аверсон СВФР-016633
	
		ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
		Если ЗначениеЗаполнено(ТекПользователь) Тогда
			Исполнитель = ТекПользователь.ФизЛицо;
			Если ЗначениеЗаполнено(Исполнитель) Тогда
				ИсполнительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Исполнитель);
				ОборотнаяСторона.Параметры.ФИО = ИсполнительФИО;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-010239
	
	ДокументРезультат.Вывести(ОборотнаяСторона);

	//ДокументРезультат.Присоединить(ВтораяСтраница);
	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	//ДокументРезультат.Присоединить(ТретьяСтраницаТ2);
	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	//ДокументРезультат.Присоединить(ЧетвертаяСтраницаТ2);
	
	//Параметры документа
	ДокументРезультат.ПолеСлева				= 0;
	ДокументРезультат.ПолеСправа			= 0;
	ДокументРезультат.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЛичнаяКарточка";
	ДокументРезультат.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
КонецПроцедуры

//Аверсон ЕАЕ 11.09.2025 СВФР-016633
Функция ПолучитьОтветственного(Орг)
	ФИО = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииОтветственныеЛица.Сотрудник
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ОтветственныйЗаВедениеВоенноУчетнойРаботы)
		|	И ОрганизацииОтветственныеЛица.Ссылка = &Орг";
	
	Запрос.УстановитьПараметр("Орг", Орг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ФИО = ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЕсли;
	
	Возврат ФИО;
КонецФункции
//Аверсон СВФР-016633


// Выполняет запрос и формирует документ Word
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
//
Процедура СформироватьОтчетWord() Экспорт
	
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Личная карточка.dot";
	ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	Попытка
		MSWord = новый COMОбъект("Word.Application");
		Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
		
		MSWord.Application.Visible = Истина; 
		MSWord.Activate(); 

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		Запрос.УстановитьПараметр("Физлицо",		  Работник.Физлицо);
		Запрос.УстановитьПараметр("Сотрудник",		  Работник);
		
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизаций.Код КАК ТабельныйНомер,
		|	СотрудникиОрганизаций.Физлицо.Пол КАК Пол,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	СотрудникиОрганизаций.Физлицо.ДатаРождения КАК ДатаРождения,
		|	СотрудникиОрганизаций.Физлицо.МестоРождения КАК МестоРождения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)
		|			ТОГДА ""Республика Беларусь""
		|		КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяССылка)
		|			ТОГДА ""Республика Беларусь""
		|		КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ЛицоБезГражданства)
		|			ТОГДА ""Лицо без гражданства""
		|		ИНАЧЕ ""Иностранный гражданин""
		|	КОНЕЦ КАК Гражданство,
		|	РаботникиОрганизацииСрезПоследних1.Должность КАК Должность,
		|	РаботникиОрганизацииСрезПоследних.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение КАК СемейноеПоложение,
		|	КонтактнаяИнформацияАдрес.Представление КАК Адрес,
		|	КонтактнаяИнформацияТелефон.Представление КАК Телефон,
		|	КонтактнаяИнформацияАдресПроживания.Представление КАК АдресПроживания,
		|	КонтактнаяИнформацияТелефонДом.Представление КАК ТелефонДом,
		|	СотрудникиОрганизаций.Физлицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	РаботникиОрганизацииСрезПоследних.Период КАК ДатаПриема,
		|	ПОДСТРОКА(СотрудникиОрганизаций.Физлицо.Наименование, 1, 1) КАК Буква,
		|	ВоинскийУчетСрезПоследних.ГруппаВоинскогоУчета,
		|	ВоинскийУчетСрезПоследних.КатегорияЗапаса КАК КатегорияВоинскогоУчета,
		|	ВоинскийУчетСрезПоследних.Состав,
		|	ВоинскийУчетСрезПоследних.Звание,
		|	ВоинскийУчетСрезПоследних.ВУС,
		|	ВоинскийУчетСрезПоследних.Годность,
		|	ВоинскийУчетСрезПоследних.Военкомат,
		|	ВоинскийУчетСрезПоследних.СпецУчет,
		|	СотрудникиОрганизаций.Физлицо.МестоРожденияПроизвольныйФормат КАК МестоРожденияПроизвольныйФормат,
		|	КонтактнаяИнформацияАдрес.Комментарий
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК СемейноеПоложениеФизЛицСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
		|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияАдрес.Объект
		|			И (КонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресПроживания
		|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияАдресПроживания.Объект
		|			И (КонтактнаяИнформацияАдресПроживания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (КонтактнаяИнформацияАдресПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
		|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияТелефон.Объект
		|			И (КонтактнаяИнформацияТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонДом
		|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияТелефонДом.Объект
		|			И (КонтактнаяИнформацияТелефонДом.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (КонтактнаяИнформацияТелефонДом.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.КонтактнТелефонКандидата))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				Сотрудник = &Сотрудник
		|					И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних1
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаАктуальности, Физлицо = &ФизЛицо) КАК ВоинскийУчетСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &Сотрудник";
		
		ВыборкаРезультата	=	Запрос.Выполнить().Выбрать();
		
		Если ВыборкаРезультата.Следующий() тогда
			Замена = Документ.Content.Find;
			Замена.Execute("_НазваниеОрганизации", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ВыборкаРезультата.НазваниеОрганизации));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Пол", Ложь, Истина, Ложь, , , Истина, , Ложь, Лев(ВыборкаРезультата.Пол,1));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ТабНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.ТабельныйНомер);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Алфавит", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Буква);
			
			// ФИО
			Замена = Документ.Content.Find;
			Замена.Execute("_Фамилия", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Фамилия);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Имя", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Имя);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Отчество", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Отчество);
			
			//дата рождения
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаРождения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаРезультата.ДатаРождения, "ДФ=dd.MM.yyyy"));
			
			//место рождения
			Замена = Документ.Content.Find;
			Если ВыборкаРезультата.МестоРожденияПроизвольныйФормат = 1 Тогда
				Замена.Execute("_МестоРождения", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.МестоРождения);
			Иначе
				МестоРождения = Прав(ВыборкаРезультата.МестоРождения, СтрДлина(ВыборкаРезультата.МестоРождения) - 2);
				МестоРождения = СтрЗаменить(МестоРождения,",,,","");
				МестоРождения = СтрЗаменить(МестоРождения,",,",",");
				Если Прав(МестоРождения,1) = "," Тогда
					МестоРождения = Лев(МестоРождения, СтрДлина(МестоРождения) - 1);
				КонецЕсли;
				Замена.Execute("_МестоРождения", Ложь, Истина, Ложь, , , Истина, , Ложь, МестоРождения);
			КонецЕсли;
			
			//национальность
			Замена = Документ.Content.Find;
			Замена.Execute("_Гражданство", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Гражданство);
			
			//должность
			Замена = Документ.Content.Find;
			Замена.Execute("_Должность", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Должность.Наименование);
			
			//Стаж
			ВыборкаПоСтажу = ПроведениеРасчетов.ВыбратьСтажиРаботника(Работник.Физлицо);
			ФлагОбщий = 0; ФлагНепрерывный = 0; ФлагДля13 = 0;

			Пока ВыборкаПоСтажу.Следующий()	Цикл
				Если ВыборкаПоСтажу.ВидСтажа = Справочники.ВидыСтажа.СтажВОтрасли  Тогда
					Замена = Документ.Content.Find;
					Замена.Execute("_СтажОбщий", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаПоСтажу.ДатаОтсчета, "ДФ=dd.MM.yyyy"));
					ФлагОбщий = 1;
				ИначеЕсли ВыборкаПоСтажу.ВидСтажа = Справочники.ВидыСтажа.НепрерывныйСтаж  Тогда
					Замена = Документ.Content.Find;
					Замена.Execute("_СтажНепрерывный", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаПоСтажу.ДатаОтсчета, "ДФ=dd.MM.yyyy"));
					ФлагНепрерывный = 1;
				ИначеЕсли ВыборкаПоСтажу.ВидСтажа = Справочники.ВидыСтажа.СтажДля13  Тогда
					Замена = Документ.Content.Find;
					Замена.Execute("_СтажДля13", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаПоСтажу.ДатаОтсчета, "ДФ=dd.MM.yyyy"));
					ФлагДля13 = 1;
				КонецЕсли;	
			КонецЦикла;
			Если ФлагОбщий = 0 Тогда
				Замена = Документ.Content.Find;
				Замена.Execute("_СтажОбщий", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			ИначеЕсли ФлагНепрерывный = 0 Тогда
				Замена = Документ.Content.Find;
				Замена.Execute("_СтажНепрерывный", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			ИначеЕсли ФлагДля13 = 0 Тогда
				Замена = Документ.Content.Find;
				Замена.Execute("_СтажДля13", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;	
			
			//семейное положение
			Замена = Документ.Content.Find;
			Замена.Execute("_СемейноеПоложение", Ложь, Истина, Ложь, , , Истина, , Ложь, ?(ЗначениеЗаполнено(ВыборкаРезультата.СемейноеПоложение), ВыборкаРезультата.СемейноеПоложение.Наименование, ""));
			
			//состав семьи
			ЗапросСоставСемьи = Новый Запрос;
			ЗапросСоставСемьи.Текст =
			"ВЫБРАТЬ
			|	ФизическиеЛицаСоставСемьи.Имя,
			|	ФизическиеЛицаСоставСемьи.СтепеньРодства.Наименование КАК СтепеньРодства,
			|	ФизическиеЛицаСоставСемьи.ГодРождения
			|ИЗ
			|	Справочник.ФизическиеЛица.СоставСемьи КАК ФизическиеЛицаСоставСемьи
			|ГДЕ
			|	ФизическиеЛицаСоставСемьи.Ссылка = &Физлицо";
			
			ЗапросСоставСемьи.УстановитьПараметр("Физлицо",		  Работник.Физлицо);
			ВыборкаСоставСемьи = ЗапросСоставСемьи.Выполнить().Выбрать();
			
			Если ВыборкаСоставСемьи.Количество() > 0 Тогда
				Таблица=Документ.Tables(2);
				Кол = ВыборкаСоставСемьи.Количество() - 1;
				Для к = 1 по Кол Цикл
					Таблица.Rows.Add();
				КонецЦикла;	
				
				н = Таблица.Rows.Count - (ВыборкаСоставСемьи.Количество() - 1);
				Пока ВыборкаСоставСемьи.Следующий() цикл
					Таблица.Cell(н,3).Range.Text = ВыборкаСоставСемьи.СтепеньРодства;
					Таблица.Cell(н,4).Range.Text = ВыборкаСоставСемьи.Имя;
					Таблица.Cell(н,5).Range.Text = Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");
					
					н = н + 1;
				КонецЦикла;
			КонецЕсли;
			
			//образование
			ЗапросОбразование = Новый Запрос;
			ЗапросОбразование.УстановитьПараметр("ФизЛицо", Работник.Физлицо);
			
			ЗапросОбразование.Текст =
			"ВЫБРАТЬ
			|	ФизическиеЛицаОбразование.ВидОбразования,
			|	ФизическиеЛицаОбразование.УчебноеЗаведение,
			|	ФизическиеЛицаОбразование.Специальность,
			|	ФизическиеЛицаОбразование.Диплом,
			|	ФизическиеЛицаОбразование.ГодОкончания КАК ГодОкончания,
			|	ФизическиеЛицаОбразование.Квалификация1
			|ИЗ
			|	Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
			|ГДЕ
			|	ФизическиеЛицаОбразование.Ссылка = &ФизЛицо
			|	И ФизическиеЛицаОбразование.СтатусУчебы <> &СтатусУчебы
			|
			|УПОРЯДОЧИТЬ ПО
			|	ГодОкончания";
			
			ЗапросОбразование.УстановитьПараметр("СтатусУчебы", Перечисления.СтатусУчебы.Учится);
			ВыборкаОбразование = ЗапросОбразование.Выполнить().Выбрать();
			
			ВидОбразования = "";

			Если ВыборкаОбразование.Количество() > 0 Тогда
				Таблица=Документ.Tables(3);
				Кол = ВыборкаОбразование.Количество() - 1;
				Для к = 1 по Кол Цикл
					Таблица.Rows.Add();
				КонецЦикла;	
				
				н = 2; 
				Пока ВыборкаОбразование.Следующий() цикл
					Таблица.Cell(н,1).Range.Text = ВыборкаОбразование.ГодОкончания;
					Таблица.Cell(н,2).Range.Text = Строка(ВыборкаОбразование.УчебноеЗаведение);
					Таблица.Cell(н,3).Range.Text = Строка(ВыборкаОбразование.ВидОбразования);
					Таблица.Cell(н,4).Range.Text = Строка(ВыборкаОбразование.Специальность);
					Таблица.Cell(н,5).Range.Text = ВыборкаОбразование.Квалификация1; //О.Т. 01.08.2014 № 154
					Таблица.Cell(н,6).Range.Text = ВыборкаОбразование.Диплом;
					
					ВидОбразования = Строка(ВыборкаОбразование.ВидОбразования); 
					н = н + 1;
				КонецЦикла;
			КонецЕсли;
			Замена = Документ.Content.Find;
			Замена.Execute("_ВидОбразования", Ложь, Истина, Ложь, , , Истина, , Ложь, ВидОбразования);			
			
			//паспортные данные
			ЗапросПаспорт = Новый Запрос;
			ЗапросПаспорт.УстановитьПараметр("ФизЛицо", Работник.Физлицо);
			
			ЗапросПаспорт.Текст =
			"ВЫБРАТЬ
			|	ПаспортныеДанныеФизЛиц.ДокументСерия,
			|	ПаспортныеДанныеФизЛиц.ДокументНомер,
			|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи,
			|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан,
			|	ПаспортныеДанныеФизЛиц.ЛичныйНомер,
			|	ПаспортныеДанныеФизЛиц.ДатаСрокДействия
			|ИЗ
			|	РегистрСведений.ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц
			|ГДЕ
			|	ПаспортныеДанныеФизЛиц.ФизЛицо = &ФизЛицо
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПаспортныеДанныеФизЛиц.Период ВОЗР";
			
			ВыборкаПаспорт = ЗапросПаспорт.Выполнить().Выбрать();
			н = 0; 
			Если ВыборкаПаспорт.Количество() > 0 Тогда
				Пока ВыборкаПаспорт.Следующий() цикл
					Замена = Документ.Content.Find;
					Замена.Execute("_ДокументСерия", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаПаспорт.ДокументСерия);
					Замена = Документ.Content.Find;
					Замена.Execute("_ДокументНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаПаспорт.ДокументНомер);
					Замена = Документ.Content.Find;
					Замена.Execute("_ДокументКемВыдан", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ВыборкаПаспорт.ДокументКемВыдан));
					Замена = Документ.Content.Find;
					Замена.Execute("_ДокументДатаВыдачи", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаПаспорт.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy"));
					Замена = Документ.Content.Find;
					Замена.Execute("_ДокументДействителенПо", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ВыборкаПаспорт.ДатаСрокДействия, "ДФ=dd.MM.yyyy"));
					
					н = н + 1;
				КонецЦикла;
			Иначе
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументСерия", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументКемВыдан", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументДатаВыдачи", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументДействителенПо", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ЛичныйНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			Если н >= 1 Тогда
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументСерия", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументКемВыдан", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументДатаВыдачи", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДокументДействителенПо", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			Замена = Документ.Content.Find;
			Замена.Execute("_ЛичныйНомер", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ВыборкаРезультата.СтраховойНомерПФР));

			//телефоны
			Замена = Документ.Content.Find;
			Если Не ВыборкаРезультата.ТелефонДом = NULL Тогда 
				Замена.Execute("_ТелефонДом", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.ТелефонДом);
			Иначе
				Замена.Execute("_ТелефонДом", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			
			Замена = Документ.Content.Find;
			Если Не ВыборкаРезультата.Телефон = NULL Тогда 
				Замена.Execute("_Телефон", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Телефон);
			Иначе
				Замена.Execute("_Телефон", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			
			//адреса
			Замена = Документ.Content.Find;
			Если Не ВыборкаРезультата.Адрес = NULL Тогда 
				Замена.Execute("_Адрес", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.Адрес + ?(ЗначениеЗаполнено(ВыборкаРезультата.Комментарий), ", " + СокрЛП(ВыборкаРезультата.Комментарий), ""));
			Иначе
				Замена.Execute("_Адрес", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			Замена = Документ.Content.Find;
			Если Не ВыборкаРезультата.АдресПроживания = NULL Тогда 
				Замена.Execute("_АдресПроживания", Ложь, Истина, Ложь, , , Истина, , Ложь, ВыборкаРезультата.АдресПроживания);
			Иначе
				Замена.Execute("_АдресПроживания", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			
			//дата заполнения
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаЗаполнения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаАктуальности, "ДФ=dd.MM.yyyy"));
			
			//воинский учет
			Замена = Документ.Content.Find;
			Замена.Execute("_ГруппаВоинскогоУчета", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.ГруппаВоинскогоУчета));
			Замена = Документ.Content.Find;
			Замена.Execute("_КатегорияВоинскогоУчета", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.КатегорияВоинскогоУчета));
			Замена = Документ.Content.Find;
			Замена.Execute("_Состав", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.Состав));
			Замена = Документ.Content.Find;
			Замена.Execute("_Звание", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.Звание));
			Замена = Документ.Content.Find;
			Замена.Execute("_ВУС", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ВыборкаРезультата.ВУС));
			Замена = Документ.Content.Find;
			Замена.Execute("_Годность", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.Годность));
			Замена = Документ.Content.Find;
			Замена.Execute("_Военкомат", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ВыборкаРезультата.Военкомат));
			Замена = Документ.Content.Find;
			Замена.Execute("_СпецУчет", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ВыборкаРезультата.СпецУчет));
			
			//назначения и перемещения
			//выберем данные до 2011г. из PRIEM.dbf
			Таблица=Документ.Tables(7);
			н = 2;
			ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
			РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
			ИмяФайла = "PRIEM.dbf";
			ИмяИндексаPRIEM = "PRIEM.CDX";
			
			ВыбФайлPRIEM = Новый XBase(РабочийКаталог + "\" + ИмяФайла);
			ВыбФайлPRIEM.Кодировка = КодировкаXBase.OEM;
			
			ИмяФайла1 = "PEOPLES.dbf";
			ИмяИндексаPEOPLES = "PEOPLES.CDX";

			ВыбФайлPEOPLES = Новый XBase(РабочийКаталог + "\" + ИмяФайла1);
			ВыбФайлPEOPLES.Кодировка = КодировкаXBase.OEM;

			Если ВыбФайлPEOPLES.Открыта() = 1 Тогда
				ВыбФайлPEOPLES.Индексы.Добавить("IDX_vE", "TABNOMER", Ложь, Ложь);
				ВыбФайлPEOPLES.СоздатьИндексныйФайл(РабочийКаталог + "\" + ИмяИндексаPEOPLES);
				ВыбФайлPEOPLES.ТекущийИндекс = ВыбФайлPEOPLES.Индексы.IDX_vE;
				
				ВыбФайлPEOPLES.Ключ.TABNOMER = Работник.Код;
				
				Если ВыбФайлPEOPLES.НайтиПоКлючу("=") = Ложь Тогда
					
				Иначе
					
					Если ВыбФайлPRIEM.Открыта() = 1 Тогда
						ВыбФайлPRIEM.Первая();
						Пока НЕ ВыбФайлPRIEM.ВКонце() Цикл
							
							Если ВыбФайлPEOPLES.ID = ВыбФайлPRIEM.PEOPLE Тогда
								Если ВыбФайлPRIEM.DATEPRIEM < Дата('20110101') Тогда
									Таблица.Cell(н,1).Range.Text = Формат(ВыбФайлPRIEM.DATEPRIEM, "ДФ='дд.ММ.гг'");
									Таблица.Cell(н,2).Range.Text = СокрЛП(ВыбФайлPRIEM.SP_NF);
									Таблица.Cell(н,3).Range.Text = СокрЛП(ВыбФайлPRIEM.DOLZN_NF);
									Таблица.Cell(н,4).Range.Text = СокрЛП(ВыбФайлPRIEM.OSN_NF) + " № " + СокрЛП(ВыбФайлPRIEM.NUMPRIK) + " от " + Формат(ВыбФайлPRIEM.DATEPRIK, "ДФ='дд.ММ.гг'");
									
									н = н + 1;
								КонецЕсли;
							КонецЕсли;
							ВыбФайлPRIEM.Следующая()
						КонецЦикла;	
						
						ВыбФайлPRIEM.ЗакрытьФайл();
					КонецЕсли;
				КонецЕсли;
				
				ВыбФайлPEOPLES.ЗакрытьФайл();
				УдалитьФайлы(РабочийКаталог + "\" + ИмяИндексаPEOPLES); 
			КонецЕсли;
			
			ЗапросПеремещения = Новый Запрос;
			ЗапросПеремещения.УстановитьПараметр("Сотрудник", Работник);
			ЗапросПеремещения.УстановитьПараметр("ДатаНачала", Дата('20110101'));
			ЗапросПеремещения.Текст =
			"ВЫБРАТЬ
			|	РаботникиОрганизаций.Период,
			|	РаботникиОрганизаций.Регистратор,
			|	РаботникиОрганизаций.ПодразделениеОрганизации,
			|	РаботникиОрганизаций.Должность,
			|	РаботникиОрганизаций.Категория,
			|	РаботникиОрганизаций.Должность.Категория
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|ГДЕ
			|	РаботникиОрганизаций.Сотрудник = &Сотрудник
			|	И РаботникиОрганизаций.Период >= &ДатаНачала
			|	И (РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций)";
			
			ВыборкаПеремещения = ЗапросПеремещения.Выполнить().Выбрать();
			
			ДатаУвольнения = ""; ПричинаУвольнения = ""; ДокументУвольнения = "";
			
			Если ВыборкаПеремещения.Количество() > 0 Тогда
				//Кол = ВыборкаПеремещения.Количество() - 1;
				//Для к = 1 по Кол Цикл
				//	Таблица.Rows.Add();
				//КонецЦикла;	
				
				к = н; 
				Пока ВыборкаПеремещения.Следующий() цикл
					Если ТипЗнч(ВыборкаПеремещения.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") тогда
						ТаблРаботникиОрганизации = ВыборкаПеремещения.Регистратор.РаботникиОрганизации;
						
						СтруктураПоиска = Новый Структура("Сотрудник", Работник);
						
						Строки = ТаблРаботникиОрганизации.НайтиСтроки(СтруктураПоиска);
						
						Для Каждого СтрокаТабличнойЧасти из Строки Цикл
							ДатаУвольнения = СтрокаТабличнойЧасти.ДатаУвольнения;
							ПричинаУвольнения = СтрокаТабличнойЧасти.СтатьяТКРФ;
							ДокументУвольнения = ВыборкаПеремещения.Регистратор;
						КонецЦикла;
						
					Иначе						
						Таблица.Cell(к,1).Range.Text = Формат(ВыборкаПеремещения.Период, "ДФ='дд.ММ.гг'");
						Таблица.Cell(к,2).Range.Text = СокрЛП(ВыборкаПеремещения.ПодразделениеОрганизации) + ?(ЗначениеЗаполнено(ВыборкаПеремещения.ПодразделениеОрганизации.Родитель), " " + СокрЛП(ВыборкаПеремещения.ПодразделениеОрганизации.Родитель), "");
						Таблица.Cell(к,3).Range.Text = СокрЛП(ВыборкаПеремещения.Должность);
						Таблица.Cell(к,4).Range.Text = "Приказ № " + СокрЛП(ВыборкаПеремещения.Регистратор.Номер) + " от " + Формат(ВыборкаПеремещения.Регистратор.Дата, "ДФ='дд.ММ.гг'");
					КонецЕсли;
					к = к + 1;
				КонецЦикла;
			КонецЕсли;
			
			//профессиональное обучение
			ЗапросКвалификация = Новый Запрос;
			ЗапросКвалификация.УстановитьПараметр("Сотрудник", Работник);
			ЗапросКвалификация.Текст =
			"ВЫБРАТЬ
			|	ОбучениеИПереподготовка.ДатаНачала КАК ДатаНачала,
			|	ОбучениеИПереподготовка.Регистратор,
			|	ОбучениеИПереподготовка.ТипОбучения,
			|	ОбучениеИПереподготовка.Период,
			|	ОбучениеИПереподготовка.УчебноеЗаведение,
			|	ОбучениеИПереподготовка.Профессия
			|ИЗ
			|	РегистрСведений.ОбучениеИПереподготовка КАК ОбучениеИПереподготовка
			|ГДЕ
			|	ОбучениеИПереподготовка.Сотрудник = &Сотрудник
			|	И (ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПовышениеКвалификации)
			|			ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.ПрофПодготовкаБезПрофесии)
			|			ИЛИ ОбучениеИПереподготовка.ТипОбучения = ЗНАЧЕНИЕ(Перечисление.ТипыОбучения.Переподготовка))
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаНачала";
			
			ВыборкаКвалификация = ЗапросКвалификация.Выполнить().Выбрать();
			
			Если ВыборкаКвалификация.Количество() > 0 Тогда
				Таблица=Документ.Tables(8);
				//Кол = ВыборкаКвалификация.Количество() - 1;
				//Для к = 1 по Кол Цикл
				//	Таблица.Rows.Add();
				//КонецЦикла;	
				
				н = 2; 
				Пока ВыборкаКвалификация.Следующий() цикл
					Таблица.Cell(н,1).Range.Text = Строка(ВыборкаКвалификация.ТипОбучения);
					Таблица.Cell(н,2).Range.Text = Формат(ВыборкаКвалификация.ДатаНачала, "ДФ='дд.ММ.гг'") + " - " + Формат(ВыборкаКвалификация.Период, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,3).Range.Text = Строка(ВыборкаКвалификация.УчебноеЗаведение);
					Таблица.Cell(н,4).Range.Text = Строка(ВыборкаКвалификация.Профессия);
					Таблица.Cell(н,5).Range.Text = Строка("№ " + СокрЛП(ВыборкаКвалификация.Регистратор.Номер) + " от " + Формат(ВыборкаКвалификация.Регистратор.Дата, "ДФ='дд.ММ.гг'"));
					
					н = н + 1;
				КонецЦикла;
			КонецЕсли;
						
			//аттестация
			ЗапросАттестация = Новый Запрос;
			ЗапросАттестация.УстановитьПараметр("Сотрудник", Работник);
			ЗапросАттестация.Текст =
			"ВЫБРАТЬ
			|	АттестацияРаботников.РезультатАттестации,
			|	АттестацияРаботников.ДатаАттестации КАК ДатаАттестации
			|ИЗ
			|	РегистрСведений.АттестацияРаботников КАК АттестацияРаботников
			|ГДЕ
			|	АттестацияРаботников.Сотрудник = &Сотрудник
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаАттестации ВОЗР";
			
			ВыборкаАттестация = ЗапросАттестация.Выполнить().Выбрать();
			
			Если ВыборкаАттестация.Количество() > 0 Тогда
				Таблица=Документ.Tables(9);
				//Кол = ВыборкаАттестация.Количество() - 1;
				//Для к = 1 по Кол Цикл
				//	Таблица.Rows.Add();
				//КонецЦикла;	
				
				н = 2; 
				Пока ВыборкаАттестация.Следующий() цикл
					Таблица.Cell(н,1).Range.Text = Формат(ВыборкаАттестация.ДатаАттестации, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,2).Range.Text = Строка(ВыборкаАттестация.РезультатАттестации);
					
					н = н + 1;
				КонецЦикла;
			КонецЕсли;
			
			//дополнительные данные
			Если ЗначениеЗаполнено(ДокументУвольнения) Тогда
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаУвольнения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаУвольнения, "ДФ='дд.ММ.гггг'"));
				Замена = Документ.Content.Find;
				Замена.Execute("_ПричинаУвольнения", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка(ПричинаУвольнения));
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаПриказа", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДокументУвольнения.Дата, "ДФ='дд.ММ.гггг'"));
				Замена = Документ.Content.Find;
				Замена.Execute("_НомерПриказа", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ДокументУвольнения.Номер));
			Иначе
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаУвольнения", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ПричинаУвольнения", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_ДатаПриказа", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
				Замена = Документ.Content.Find;
				Замена.Execute("_НомерПриказа", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			КонецЕсли;
			
			мСтрокаН = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', Работник, 0);
			Замена = Документ.Content.Find;
			Замена.Execute("_Дата", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(мСтрокаН.Период,"ДФ='дд.ММ.гггг'"));
			Замена = Документ.Content.Find;
			Замена.Execute("_Дата", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(мСтрокаН.Период,"ДФ='дд.ММ.гггг'"));
			Замена = Документ.Content.Find;
			Замена.Execute("_Дата", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(мСтрокаН.Период,"ДФ='дд.ММ.гггг'"));
			
			//отпуска
			Замена = Документ.Content.Find;
			Замена.Execute("_ФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Работник.Наименование));
			
			ЗапросОтпуска = Новый Запрос;
			ЗапросОтпуска.УстановитьПараметр("Сотрудник", Работник);
			ЗапросОтпуска.Текст =
			"ВЫБРАТЬ
			|	ОтпускаФактическиеПоСотрудникам.НачалоОтпуска,
			|	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска,
			|	ОтпускаФактическиеПоСотрудникам.КоличествоДней,
			|	ОтпускаФактическиеПоСотрудникам.РабочийПериодС,
			|	ОтпускаФактическиеПоСотрудникам.РабочийПериодПо,
			|	ОтпускаФактическиеПоСотрудникам.Комментарий,
			|	ОтпускаФактическиеПоСотрудникам.Регистратор,
			|	ОтпускаФактическиеПоСотрудникам.Состояние
			|ИЗ
			|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
			|ГДЕ
			|	ОтпускаФактическиеПоСотрудникам.Сотрудник = &Сотрудник
			|	И ОтпускаФактическиеПоСотрудникам.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций";
			
			ВыборкаОтпуска = ЗапросОтпуска.Выполнить().Выбрать();
			
			Если ВыборкаОтпуска.Количество() > 0 Тогда
				Таблица=Документ.Tables(11);
				Кол = ВыборкаОтпуска.Количество() - 1;
				Для к = 1 по Кол Цикл
					Таблица.Rows.Add();
				КонецЦикла;	
				
				н = 4; 
				Пока ВыборкаОтпуска.Следующий() цикл
					Таблица.Cell(н,1).Range.Text = Строка(ВыборкаОтпуска.Состояние);
					Таблица.Cell(н,2).Range.Text = Формат(ВыборкаОтпуска.РабочийПериодС, "ДФ='дд.ММ.гг'") + " - " + Формат(ВыборкаОтпуска.РабочийПериодПо, "ДФ='дд.ММ.гг'");
										
					ДопОтпуска = ВыборкаОтпуска.Регистратор.Отпуска;
					Для Каждого ТекСтрокаОтпуска Из ДопОтпуска Цикл
						Если ТекСтрокаОтпуска.ВидОтпуска.Код = "000000001" Тогда
							Таблица.Cell(н,3).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						ИначеЕсли ТекСтрокаОтпуска.ВидОтпуска.Код = "000000002" Тогда
							Таблица.Cell(н,4).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						ИначеЕсли ТекСтрокаОтпуска.ВидОтпуска.Код = "000000003" Тогда
							Таблица.Cell(н,5).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						ИначеЕсли ТекСтрокаОтпуска.ВидОтпуска.Код = "000000004" Тогда
							Таблица.Cell(н,6).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						ИначеЕсли ТекСтрокаОтпуска.ВидОтпуска.Код = "000000005" Тогда
							Таблица.Cell(н,7).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						ИначеЕсли ТекСтрокаОтпуска.ВидОтпуска.Код = "000000006" Тогда
							Таблица.Cell(н,8).Range.Text = ТекСтрокаОтпуска.КоличествоДней;
						КонецЕсли;
					КонецЦикла;
					
					КоличествоДнейКомпенсации = 0;
					Отпуска = ВыборкаОтпуска.Регистратор.РаботникиОрганизации;
					СтруктураПоиска = Новый Структура("Сотрудник", Работник);
					Строки = Отпуска.НайтиСтроки(СтруктураПоиска);
					Для Каждого ТекСтрокаОтпуска из Строки Цикл
						КоличествоДнейКомпенсации = КоличествоДнейКомпенсации + ТекСтрокаОтпуска.КоличествоДнейКомпенсации;
					КонецЦикла;
					Таблица.Cell(н,9).Range.Text = ?(КоличествоДнейКомпенсации <> 0, КоличествоДнейКомпенсации, "");
					
					Таблица.Cell(н,10).Range.Text = ВыборкаОтпуска.КоличествоДней;
					Таблица.Cell(н,11).Range.Text = Формат(ВыборкаОтпуска.НачалоОтпуска, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,12).Range.Text = Формат(ВыборкаОтпуска.ОкончаниеОтпуска, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,13).Range.Text = Строка("Приказ № " + СокрЛП(ВыборкаОтпуска.Регистратор.Номер) + " от " + Формат(ВыборкаОтпуска.Регистратор.Дата, "ДФ='дд.ММ.гг'"));
					
					н = н + 1;
				КонецЦикла;
			КонецЕсли;
			
			//продолжительность трудового отпуска
			Запрос = Новый Запрос;
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ОтпускаПоСотрудникамСрезПоследних.Сотрудник,
			|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска,
			|	ОтпускаПоСотрудникамСрезПоследних.Подразделение,
			|	ОтпускаПоСотрудникамСрезПоследних.Должность,
			|	ОтпускаПоСотрудникамСрезПоследних.КоличествоДней,
			|	ОтпускаПоСотрудникамСрезПоследних.Период КАК Период,
			|	ОтпускаПоСотрудникамСрезПоследних.Основание
			|ИЗ
			|	РегистрСведений.ОтпускаПоСотрудникам КАК ОтпускаПоСотрудникамСрезПоследних
			|ГДЕ
			|	ОтпускаПоСотрудникамСрезПоследних.Сотрудник = &Сотрудник
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период,
			|	ОтпускаПоСотрудникамСрезПоследних.ВидОтпуска.Код";
			
			Запрос.УстановитьПараметр("Сотрудник", Работник);  
			Запрос.Текст = ТекстЗапроса;
			
			ВыборкаОтпуска = Запрос.Выполнить().Выбрать();
			ТЗ = Запрос.Выполнить().Выгрузить();
			ТЗ.Свернуть("Период");
			
			Если ВыборкаОтпуска.Количество() > 0 Тогда
				Таблица=Документ.Tables(12);
				Кол = ТЗ.Количество() - 1;
				Для к = 1 по Кол Цикл
					Таблица.Rows.Add();
				КонецЦикла;	
				
				н = 4; ДатаИзменения = Дата(1,1,1);
				Пока ВыборкаОтпуска.Следующий() цикл
					
					Если ДатаИзменения <> ВыборкаОтпуска.Период и ДатаИзменения <> Дата(1,1,1) Тогда
						н = н + 1;
					КонецЕсли;
					
					Таблица.Cell(н,1).Range.Text = Формат(ВыборкаОтпуска.Период, "ДФ='дд.ММ.гг'");
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000001" Тогда
						Таблица.Cell(н,2).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000002" Тогда
						Таблица.Cell(н,3).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000003" Тогда
						Таблица.Cell(н,4).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000004" Тогда
						Таблица.Cell(н,5).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000005" Тогда
						Таблица.Cell(н,6).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Если ВыборкаОтпуска.ВидОтпуска.Код = "000000006" Тогда
						Таблица.Cell(н,7).Range.Text = ВыборкаОтпуска.КоличествоДней;
					КонецЕсли;
					
					Таблица.Cell(н,8).Range.Text = Строка(ВыборкаОтпуска.Основание);
					
					ДатаИзменения = ВыборкаОтпуска.Период;
				КонецЦикла;
			КонецЕсли;
			
			//отпуска по уходу за ребенком
			ЗапросОтпуска = Новый Запрос;
			ЗапросОтпуска.УстановитьПараметр("Сотрудник", Работник);
			ЗапросОтпуска.Текст =
			"ВЫБРАТЬ
			|	ОтпускаФактическиеПоСотрудникам.НачалоОтпуска,
			|	ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска,
			|	ОтпускаФактическиеПоСотрудникам.Регистратор
			|ИЗ
			|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
			|ГДЕ
			|	ОтпускаФактическиеПоСотрудникам.Сотрудник = &Сотрудник
			|	И ОтпускаФактическиеПоСотрудникам.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком";
			
			ВыборкаОтпуска = ЗапросОтпуска.Выполнить().Выбрать();
			
			Если ВыборкаОтпуска.Количество() > 0 Тогда
				Таблица=Документ.Tables(13);
				//Кол = (ВыборкаОтпуска.Количество() - 1) * 5;
				//Для к = 1 по Кол Цикл
				//	Таблица.Rows.Add();
				//КонецЦикла;	
				
				Пока ВыборкаОтпуска.Следующий() цикл
					Если ВыборкаОтпуска.Количество() > 1 Тогда
						 н = Таблица.Rows.Count();
					 Иначе
						 н = 2;
					КонецЕсли;
					 
					Таблица.Cell(н,1).Range.Text = "Период (план)";
					Таблица.Cell(н,3).Range.Text = "Основание";
					
					Таблица.Rows.Add();
					н = Таблица.Rows.Count(); 
					Rgn = Документ.Range(Таблица.Cell(н - 1,1).Range.Start,Таблица.Cell(н - 1,2).Range.End);
					Rgn.Cells.Merge();

					Таблица.Cell(н,1).Range.Text = Формат(ВыборкаОтпуска.Регистратор.ДатаНачала, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,2).Range.Text = Формат(ВыборкаОтпуска.Регистратор.ДатаОкончания, "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,3).Range.Text = Строка("Приказ № " + СокрЛП(ВыборкаОтпуска.Регистратор.Номер) + " от " + Формат(ВыборкаОтпуска.Регистратор.Дата, "ДФ='дд.ММ.гг'"));

					Таблица.Rows.Add();
                    н = Таблица.Rows.Count();  
					Таблица.Cell(н,1).Range.Text = "Период (факт)";
					Таблица.Cell(н,3).Range.Text = "Основание";
					
					Таблица.Rows.Add();
                    н = Таблица.Rows.Count(); 
					Rgn = Документ.Range(Таблица.Cell(н - 1, 1).Range.Start,Таблица.Cell(н - 1, 2).Range.End);
					Rgn.Cells.Merge();
					Таблица.Cell(н,1).Range.Text = Формат(?(ЗначениеЗаполнено(ВыборкаОтпуска.Регистратор.ДатаНачалаФакт), ВыборкаОтпуска.Регистратор.ДатаНачалаФакт, ВыборкаОтпуска.НачалоОтпуска), "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,2).Range.Text = Формат(?(ЗначениеЗаполнено(ВыборкаОтпуска.Регистратор.ДатаОкончанияФакт), ВыборкаОтпуска.Регистратор.ДатаОкончанияФакт, ВыборкаОтпуска.ОкончаниеОтпуска), "ДФ='дд.ММ.гг'");
					Таблица.Cell(н,3).Range.Text = Строка("Приказ № " + СокрЛП(ВыборкаОтпуска.Регистратор.НомерПриказаОбОкончанииОтпуска) + " от " + Формат(ВыборкаОтпуска.Регистратор.ДатаПриказаОбОкончанииОтпуска, "ДФ='дд.ММ.гг'"));
					
					Таблица.Rows.Add();
                    н = Таблица.Rows.Count();  
					Таблица.Cell(н,1).Range.Text = "Сдвиг рабочего года";
					Таблица.Cell(н,2).Range.Text = "";
					Таблица.Cell(н,3).Range.Text = "";
					
					Если ВыборкаОтпуска.Количество() > 1 Тогда
						Таблица.Rows.Add();
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		//MSWord.Application.Visible = Истина; 
		//MSWord.Activate(); 

	Исключение
		Сообщить(ОписаниеОшибки());
		MSWord.Application.Quit();
	КонецПопытки;
	
КонецПроцедуры

мДлинаСуток = 86400;

#КонецЕсли

