////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаОрганизации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	Запрос.УстановитьПараметр("ВидТелефонаОрганизации" , Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	Запрос.УстановитьПараметр("ОсновноеМестоРаботы",	Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
	|	ТрудовойДоговор.Номер КАК НомерДок,
	|	ТрудовойДоговор.Дата КАК ДатаДок,
	|	ВЫРАЗИТЬ(ТрудовойДоговор.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК ПолноеНазваниеОрганизации,
	|	ЕСТЬNULL(ФИООтветственныхЛиц.Фамилия + "" "" + ФИООтветственныхЛиц.Имя + "" "" + ФИООтветственныхЛиц.Отчество, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
	|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ТрудовойДоговор.ФизЛицо.Наименование) КАК ФИОРаботника,
	|	ТрудовойДоговор.ОкончаниеДоговора,
	|	ТрудовойДоговор.НачалоДоговора,
	|	ТрудовойДоговор.Должность.Наименование КАК Должность,
	|	ТрудовойДоговор.ЗанимаемыхСтавок,
	|	ТрудовойДоговор.ИспытательныйСрок,
	|	ТрудовойДоговор.ПодразделениеОрганизации.Наименование КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ТрудовойДоговор.ВидЗанятости = &ОсновноеМестоРаботы
	|			ТОГДА ""основной работе""
	|		ИНАЧЕ ""совместительству""
	|	КОНЕЦ КАК ВидЗанятости,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,

	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан1.Наименование КАК ДокументКемВыдан, //Островская Татьяна 26.03.2014 № 17191
	|	АдресРегистрации.Представление КАК АдресРегистрации,
	|	ТелефонДомашний.Представление КАК Телефоны,
	|	КонтактнаяИнформация.Представление КАК АдресОрганизации,
	|	ТелефонОрганизации.Представление КАК ТелефоныОрганизации,
	|	ТрудовойДоговор.Организация.Наименование КАК НазваниеОрганизации,
	|	ТрудовойДоговор.ГрафикРаботы.ВидГрафика КАК ВидГрафика,
	|	ТрудовойДоговор.ГрафикРаботы.ДлительностьРабочейНедели КАК ДлительностьРабочейНедели,
	|	ТрудовойДоговор.СпособРасчета,
	|	ТрудовойДоговор.РасчетнаяТарифнаяСтавка КАК ТарифнаяСтавка,
	|	ТрудовойДоговор.ВалютаТарифнойСтавки.Наименование КАК ВалютаТарифнойСтавки,
	|	ТрудовойДоговор.ПерсональныеНадбавки.(
	|		Ссылка,
	|		НомерСтроки,
	|		Надбавка КАК Надбавка,
	|		Показатель1
	|	),
	|	ТрудовойДоговор.Отпуска.(
	|		Ссылка,
	|		НомерСтроки,
	|		ВидОтпуска,
	|		КоличествоДней

	|	),

	|	ТрудовойДоговор.ФизЛицо

	|ИЗ
	|	Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИООтветственныхЛиц
	|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИООтветственныхЛиц.ФизЛицо
	|		ПО ТрудовойДоговор.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛиц
	|		ПО ТрудовойДоговор.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО ТрудовойДоговор.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресРегистрации
	|		ПО ТрудовойДоговор.ФизЛицо = АдресРегистрации.Объект
	|			И (АдресРегистрации.Вид = &ВидАдресаРегистрации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонДомашний
	|		ПО ТрудовойДоговор.ФизЛицо = ТелефонДомашний.Объект
	|			И (АдресРегистрации.Вид = &ВидТелефонаДомашний)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ТрудовойДоговор.Организация = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = &ВидАдресаОрганизации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонОрганизации
	|		ПО ТрудовойДоговор.Организация = ТелефонОрганизации.Объект
	|			И (ТелефонОрганизации.Вид = &ВидТелефонаОрганизации)
	|ГДЕ
	|	ТрудовойДоговор.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Печать" Тогда
			
			ТабДокумент = Новый ТабличныйДокумент;
			ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТрудовойДоговор_Печать";
			
			// получаем данные для печати
			Выборка = СформироватьЗапросДляПечати().Выбрать();
			
			// получаем макет
			Макет = ПолучитьМакет("Макет");
			
			// выводим данные 
			Если Выборка.Следующий() Тогда
				Макет.Параметры.Заполнить(Выборка);
				Макет.Параметры.ИспытательныйСрокСтрокой = ?(ЗначениеЗаполнено(Выборка.ИспытательныйСрок), "" + Выборка.ИспытательныйСрок + " месяца(ев)","             месяцев" );
				Макет.Параметры.РежимРаботы = "" + Выборка.ВидГрафика + "; " + Выборка.ДлительностьРабочейНедели + " - часовая рабочая неделя";
				Макет.Параметры.ФормаОплаты = "Форма оплаты: " + Выборка.СпособРасчета + "; Оклад (тариф) = " + Выборка.ТарифнаяСтавка + " ("+Выборка.ВалютаТарифнойСтавки+")";  
				//для отпуска
				ВыборкаОтпуска = Выборка.Отпуска.Выбрать();
				Если ВыборкаОтпуска.Количество()>0 Тогда
					СтрокаОтпуска = "Отпуска: ";
					Пока ВыборкаОтпуска.Следующий() Цикл
						СтрокаОтпуска = СтрокаОтпуска + ВыборкаОтпуска.ВидОтпуска + "- " + ВыборкаОтпуска.КоличествоДней + "; ";
					КонецЦикла; 
					Макет.Параметры.ФормаОтпуск = СтрокаОтпуска;
				КонецЕсли; 
				
				
				ВыборкаПерсональныхДадбавок = Выборка.ПерсональныеНадбавки.Выбрать();
				Если ВыборкаПерсональныхДадбавок.Количество()>0 Тогда
					СтрокаНадбавки = "Персональные надбавки: ";
					Пока ВыборкаПерсональныхДадбавок.Следующий() Цикл
						СтрокаНадбавки = СтрокаНадбавки + ВыборкаПерсональныхДадбавок.Надбавка + "- " + ВыборкаПерсональныхДадбавок.Показатель1 + "; ";
					КонецЦикла; 
					Макет.Параметры.Надбавки = СтрокаНадбавки;
				КонецЕсли; 
			КонецЕсли;
			
			// выводим готовый документ
			ТабДокумент.Вывести(Макет); 
			// СВЭЙ СВФР-015597 СОА 26.04.2025(
		ИначеЕсли ИмяМакета = "ПечатьКонтракта" Тогда
			ПечатьКонтрактаИлиДоговора("ТекстКонтракта", КоличествоЭкземпляров, НаПринтер);
		ИначеЕсли ИмяМакета = "ПечатьДоговора" Тогда
			ПечатьКонтрактаИлиДоговора("ТекстДоговора", КоличествоЭкземпляров, НаПринтер);
			// СВЭЙ СВФР-015597 СОА 26.04.2025 )	
		КонецЕсли;
		
		РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Прием на работу в организацию "));
		
	КонецПроцедуры // Печать
	
	// СВЭЙ СВФР-015597 СОА 26.04.2025(
Процедура  ПечатьКонтрактаИлиДоговора(текИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь)
	ТабДокумент = Новый ТабличныйДокумент;

	// получаем данные для печати
	Выборка = СформироватьЗапросДляПечати().Выбрать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
	|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
	|	Организации.Наименование,
	|	ОрганизацииОтветственныеЛица.Дата КАК Дата,
	|	ОрганизацииОтветственныеЛица.Должность
	|ИЗ
	|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
	|ГДЕ
	|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И Организации.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Руководитель = Результат.Сотрудник; 
		ДолжностьРуководителя = Результат.Должность;
	КонецЦикла;
	если не Руководитель = Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизЛиц.Фамилия,
		|	ФИОФизЛиц.Имя,
		|	ФИОФизЛиц.Отчество,
		|	ФИОФизЛиц.ФизЛицо
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
		|ГДЕ
		|	ФИОФизЛиц.ФизЛицо = &ФизЛицо";
		
		Запрос.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
		
		Результат1 = Запрос.Выполнить().Выбрать();
		Пока Результат1.Следующий() цикл
			Фамилия = Результат1.Фамилия;
			Имя = Лев(Результат1.Имя,1);
			Отчество = Лев(Результат1.Отчество,1);
			ФИО = Имя+"."+Отчество+"."+ " "+Фамилия;
		КонецЦикла;
	КонецЕсли;
	
	ВидАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Организация);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Поле4 КАК Город
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		печГород = "";
	Иначе 
		печГород = РезультатЗапроса.Выгрузить()[0].Город;
	КонецЕсли;	

	// выводим данные 
	Если Выборка.Следующий() Тогда
		// получаем макет
		Макет = ПолучитьМакет(текИмяМакета);
		РезультатЗапросаУсловия = СформироватьЗапросПоДокументу();
		Если НЕ РезультатЗапросаУсловия.Пустой() Тогда 
			ВыборкаУсловия = РезультатЗапросаУсловия.Выбрать();
			ВыборкаУсловия.следующий();
			Если текИмяМакета =  "ТекстКонтракта" Тогда
				ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
				ОбластьШапка.Параметры.НомерДоговора = ВыборкаУсловия.НомерТД;
				ОбластьШапка.Параметры.Дата  = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yyyy");
				ОбластьШапка.Параметры.Должность = ВыборкаУсловия.Должность;
				ОбластьШапка.Параметры.Подразделение = ВыборкаУсловия.ПодразделениеОрганизации;
				ОбластьШапка.Параметры.Город = печГород;
				ОбластьШапка.Параметры.Организация = Выборка.ПолноеНазваниеОрганизации;
				ФИОРуководителя = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Руководитель, 2, Руководитель.ФизЛицо.Пол, Руководитель, 1);
				РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ДолжностьРуководителя.Наименование, 2, , ДолжностьРуководителя, 1);
				
				ОбластьШапка.Параметры.ДолжностьРуководителя = РезультатСклоненияДолжность;
				ОбластьШапка.Параметры.ФИОРуководителя = ФИОРуководителя;
				ОбластьШапка.Параметры.ФИОРаботник = Выборка.ФИОРаботника;
				
				ПолСотрудника = Выборка.ФизЛицо.Пол;
				ОбластьШапка.Параметры.ФИОРаботником = УправлениеОтчетами.CклонятьФИО(глСклонение,Выборка.ФИОРаботника,5,ПолСотрудника,,ложь);
				ОбластьШапка.Параметры.Основание = "Устава";
				Если СрокДоговора = "1 год" Тогда
					ОбластьШапка.Параметры.СрокДоговора = "1 (один) год";
				ИначеЕсли  СрокДоговора = "2 года" тогда
					ОбластьШапка.Параметры.СрокДоговора =   "2 (два) года";
				ИначеЕсли  СрокДоговора = "3 года" тогда
					ОбластьШапка.Параметры.СрокДоговора = "3 (три) года";
				ИначеЕсли  СрокДоговора = "4 года" тогда
					ОбластьШапка.Параметры.СрокДоговора = "4 (четыре) года";
				ИначеЕсли  СрокДоговора = "5 лет" тогда
					ОбластьШапка.Параметры.СрокДоговора =  "5 (пять) лет";
				Иначе ОбластьШапка.Параметры.СрокДоговора = СрокДоговора;
				КонецЕсли;
				
				ОбластьШапка.Параметры.ДатаНачала =  Формат(ВыборкаУсловия.НачалоДоговора, "ДФ=dd.MM.yyyy");
				ОбластьШапка.Параметры.ДатаОкончания = Формат(ВыборкаУсловия.ОкончаниеДоговора, "ДФ=dd.MM.yyyy");
				ТабДокумент.Вывести(ОбластьШапка); 
				
				ОбластьОбязанностиРаботника =  Макет.ПолучитьОбласть("ОбязанностиРаботника"); 
				ТабДокумент.Вывести(ОбластьОбязанностиРаботника);
				
				ОбластьПраваРаботника =  Макет.ПолучитьОбласть("ПраваРаботника");
				ТабДокумент.Вывести(ОбластьПраваРаботника);
				
				ОбластьОбязанностиРаботодателя =   Макет.ПолучитьОбласть("ОбязанностиРаботодателя");
				ТабДокумент.Вывести(ОбластьОбязанностиРаботодателя); 
				
				ОбластьПраваРаботодателя =  Макет.ПолучитьОбласть("ПраваРаботодателя");
				ТабДокумент.Вывести(ОбластьПраваРаботодателя); 
				
				ОбластьПрочиеУсловия =    Макет.ПолучитьОбласть("ПрочиеУсловия");
				
				Если ВыборкаУсловия.ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка Тогда
					печРабочаяНеделя = "пятидневная рабочая неделя";
				ИначеЕсли ГрафикРаботы.ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка Тогда	
					печРабочаяНеделя = "шестидневная рабочая неделя";
				Иначе
					печРабочаяНеделя = "рабочая неделя со сменным графиком";
				КонецЕсли;			
				//для отпуска 
				СтрокаОтпуска = "";
				ВсегоДнейОтпуска = 0; ОсновнойОтпуск = "основной отпуск продолжительностью 0 календарных дней"; 
				ВыборкаОтпуска = Выборка.Отпуска.Выбрать();
				Если ВыборкаОтпуска.Количество()>0 Тогда
					Пока ВыборкаОтпуска.Следующий() Цикл
						ВсегоДнейОтпуска = ВсегоДнейОтпуска + ВыборкаОтпуска.КоличествоДней;
						
						Если ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
							ОсновнойОтпуск = "основной отпуск продолжительностью " +  СтрокаКалендарныхДней;						
						КонецЕсли;  
						Если ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт Тогда 
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
							СтрокаОтпуска = СтрокаОтпуска + "дополнительный поощрительный отпуск продолжительностью " + СтрокаКалендарныхДней   + " с сохранением среднего заработка в соответствии с абзацем вторым пункта 3 части первой статьи 261-2 Трудового кодекса Республики Беларусь.";
						КонецЕсли;
						Если  НЕ ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск и НЕ ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт тогда
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru"); 
							Если СтрДлина(СтрокаОтпуска)>0 Тогда
							   СтрокаОтпуска = СтрокаОтпуска + Символы.ПС + "   " + ВыборкаОтпуска.ВидОтпуска + " - " + СтрокаКалендарныхДней + "; ";
							Иначе	
							   СтрокаОтпуска = "   " + ВыборкаОтпуска.ВидОтпуска + " - " + СтрокаКалендарныхДней + "; ";
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла; 
					
				КонецЕсли;
				ОбластьПрочиеУсловия.Параметры.ОсновнойОтпуск = ОсновнойОтпуск;
				ОбластьПрочиеУсловия.Параметры.СтрокаОтпуска = СтрокаОтпуска;
				ОбластьПрочиеУсловия.Параметры.ВсегоДнейОтпуска = ВсегоДнейОтпуска;
				КоличествоСимволов =  СтрДлина(ДниВыдачиЗП);
				Если КоличествоСимволов > 0 Тогда
					ЧислоЗП = "";
					ПозицияСимвола = Найти(ДниВыдачиЗП, ",");
					Если ПозицияСимвола = 0 Тогда
						СпецСимвол = " ";
					Иначе	СпецСимвол = ",";
					КонецЕсли;
					Для Позиция=1 По КоличествоСимволов Цикл
					    Символ = Сред(ДниВыдачиЗП, Позиция, 1);
						Если Символ = СпецСимвол Тогда
						   ЧислоАванс = Прав(ДниВыдачиЗП,КоличествоСимволов-Позиция);
						   Прервать;
						Иначе	
						   ЧислоЗП = ЧислоЗП + Символ;
						КонецЕсли; 				
					КонецЦикла;					 
				Иначе	
					ЧислоЗП = "____";
					ЧислоАванс = "____";
				КонецЕсли;
				 
				ОбластьПрочиеУсловия.Параметры.ЧислоЗП = ЧислоЗП;
				ОбластьПрочиеУсловия.Параметры.ЧислоАванс = ЧислоАванс;
				ОбластьПрочиеУсловия.Параметры.РабочаяНеделя = печРабочаяНеделя; 
				ОбластьПрочиеУсловия.Параметры.ВыходныеДни = ВыходныеДни;
				ОбластьПрочиеУсловия.Параметры.НачалоРабочегоДня = ВремяНачалоРаботы;
				ОбластьПрочиеУсловия.Параметры.ОкончаниеРабочегоДня = ВремяОкончаниеРаботы;
				ОбластьПрочиеУсловия.Параметры.ВремяПерерыв = ВремяПерерыв;
				ОбластьПрочиеУсловия.Параметры.ПроцентПоКонтракту =  ПроцентПоКонтракту;
				печТарифнаяСтавка =  ТарифнаяСтавка; //Выборка.ТарифнаяСтавка
				ОбластьПрочиеУсловия.Параметры.ОкладЦифрой   = печТарифнаяСтавка; 
				мВалюта = ПолучитьВалютуРегламентированногоУчета();
				ОбластьПрочиеУсловия.Параметры.ОкладБуквами  = РаботаСДиалогами.СформироватьСуммуПрописью(печТарифнаяСтавка, мВалюта);
				
				ТабДокумент.Вывести(ОбластьПрочиеУсловия);
				
			Иначе //печатная форма Договор
				
				ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
				ОбластьШапка.Параметры.НомерДоговора = ВыборкаУсловия.НомерТД;
				ОбластьШапка.Параметры.Дата  = Формат(Выборка.ДатаДок, "ДФ=dd.MM.yyyy");
				ОбластьШапка.Параметры.Должность = ВыборкаУсловия.Должность;
				ОбластьШапка.Параметры.Подразделение = ВыборкаУсловия.ПодразделениеОрганизации;
				ОбластьШапка.Параметры.Город = печГород;
				ОбластьШапка.Параметры.Организация = Выборка.ПолноеНазваниеОрганизации;
				ФИОРуководителя = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Руководитель, 2, Руководитель.ФизЛицо.Пол, Руководитель, 1);
				РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ДолжностьРуководителя.Наименование, 2, , ДолжностьРуководителя, 1);
				
				ОбластьШапка.Параметры.ДолжностьРуководителя = РезультатСклоненияДолжность;
				ОбластьШапка.Параметры.ФИОРуководителя = ФИОРуководителя;
				ОбластьШапка.Параметры.ФИОРаботник = Выборка.ФИОРаботника;
				ПолСотрудника = Выборка.ФизЛицо.Пол;
				ОбластьШапка.Параметры.ФИОРаботника = УправлениеОтчетами.CклонятьФИО(глСклонение,Выборка.ФИОРаботника,4,ПолСотрудника,,ложь);
				ОбластьШапка.Параметры.Основание = "Устава";
				ОбластьШапка.Параметры.ИспытательныйСрок = ВыборкаУсловия.ИспытательныйСрок;
				ОбластьШапка.Параметры.НачалоДоговора =  Формат(ВыборкаУсловия.НачалоДоговора, "ДФ=dd.MM.yyyy");
				ТабДокумент.Вывести(ОбластьШапка);
				ОбластьПраваРаботника =  Макет.ПолучитьОбласть("ПраваРаботника");
				ТабДокумент.Вывести(ОбластьПраваРаботника);
				ОбластьОбязанностиРаботника =  Макет.ПолучитьОбласть("ОбязанностиРаботника"); 
				ТабДокумент.Вывести(ОбластьОбязанностиРаботника);
				ОбластьПраваРаботодателя =  Макет.ПолучитьОбласть("ПраваРаботодателя");
				ТабДокумент.Вывести(ОбластьПраваРаботодателя); 
				
				ОбластьПрочиеУсловия =    Макет.ПолучитьОбласть("ПрочиеУсловия");
				печТарифнаяСтавка = ТарифнаяСтавка; //Выборка.ТарифнаяСтавка
				ОбластьПрочиеУсловия.Параметры.ОкладЦифрой   = печТарифнаяСтавка; //СОА 07.07.2025
				мВалюта = ПолучитьВалютуРегламентированногоУчета();
				ОбластьПрочиеУсловия.Параметры.ОкладБуквами  = РаботаСДиалогами.СформироватьСуммуПрописью(печТарифнаяСтавка, мВалюта);
				
				//для отпуска 
				СтрокаОтпуска = "";
				ВсегоДнейОтпуска = 0; ОсновнойОтпуск = "основной отпуск продолжительностью 0 календарных дня"; 
				ВыборкаОтпуска = Выборка.Отпуска.Выбрать();
				Если ВыборкаОтпуска.Количество()>0 Тогда
					Пока ВыборкаОтпуска.Следующий() Цикл
						ВсегоДнейОтпуска = ВсегоДнейОтпуска + ВыборкаОтпуска.КоличествоДней;
						Если ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
							ОсновнойОтпуск = "основной отпуск продолжительностью " +  СтрокаКалендарныхДней;						
						КонецЕсли;  
						Если ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаНенормРабДень Тогда 
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
							СтрокаОтпуска = СтрокаОтпуска + " дополнительный отпуск за ненормированный рабочий день продолжительностью " + СтрокаКалендарныхДней +";";
						КонецЕсли;
						Если  НЕ ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск и НЕ ВыборкаОтпуска.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаНенормРабДень тогда
							СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
							ВыборкаОтпуска.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
							Если СтрДлина(СтрокаОтпуска)>0 Тогда
							   СтрокаОтпуска = СтрокаОтпуска + Символы.ПС +"   " + ВыборкаОтпуска.ВидОтпуска + " - " + СтрокаКалендарныхДней + "; ";
							Иначе	
							   СтрокаОтпуска = "   " + ВыборкаОтпуска.ВидОтпуска + " - " + СтрокаКалендарныхДней + "; ";
							КонецЕсли;
						КонецЕсли;
					КонецЦикла; 
					
				КонецЕсли;
				ОбластьПрочиеУсловия.Параметры.ОсновнойОтпуск = ОсновнойОтпуск;
				ОбластьПрочиеУсловия.Параметры.СтрокаОтпуска = СтрокаОтпуска;
				ОбластьПрочиеУсловия.Параметры.ВсегоДнейОтпуска = ВсегоДнейОтпуска;
				ОбластьПрочиеУсловия.Параметры.СтрокаОтпуска = СтрокаОтпуска;
				КоличествоСимволов =  СтрДлина(ДниВыдачиЗП);
				Если КоличествоСимволов > 0 Тогда
					ЧислоЗП = "";
					ПозицияСимвола = Найти(ДниВыдачиЗП, ",");
					Если ПозицияСимвола = 0 Тогда
						СпецСимвол = " ";
					Иначе	СпецСимвол = ",";
					КонецЕсли;
					Для Позиция=1 По КоличествоСимволов Цикл
					    Символ = Сред(ДниВыдачиЗП, Позиция, 1);
						Если Символ = СпецСимвол Тогда
						   ЧислоАванс = Прав(ДниВыдачиЗП,КоличествоСимволов-Позиция);
						   Прервать;
						Иначе	
						   ЧислоЗП = ЧислоЗП + Символ;
						КонецЕсли; 				
					КонецЦикла;					 
				Иначе	
					ЧислоЗП = "____";
					ЧислоАванс = "____";
				КонецЕсли;
				 
				ОбластьПрочиеУсловия.Параметры.ЧислоЗП = ЧислоЗП;
				ОбластьПрочиеУсловия.Параметры.ЧислоАванс = ЧислоАванс;
				ТабДокумент.Вывести(ОбластьПрочиеУсловия);
			КонецЕсли;
			
			ОбластьПодписи =  Макет.ПолучитьОбласть("Подписи");
			ОбластьПодписи.Параметры.ФИОНаниматель = ФИО;
			ПодписьФИО1 = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ФизЛицо.Наименование); 
			ОбластьПодписи.Параметры.ФИОРаботник = ПодписьФИО1;
			
			ТабДокумент.Вывести(ОбластьПодписи); 
			
			ТабДокумент.ПолеСлева = 30;
			ТабДокумент.ПолеСправа = 8;
			ТабДокумент.ПолеСверху = 20;
			ТабДокумент.ПолеСнизу = 20;
			ТабДокумент.ОтображатьСетку =Ложь;
			ТабДокумент.ОтображатьЗаголовки =Ложь; 
			Если текИмяМакета =  "ТекстКонтракта" Тогда
				ТабДокумент.Показать("Контракт");
			Иначе ТабДокумент.Показать("Трудовой договор");
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры   

Функция ПолучитьВалютуРегламентированногоУчета()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Константы.ВалютаРегламентированногоУчета.Ссылка КАК Ссылка,
	|	Константы.ВалютаРегламентированногоУчета.Наименование КАК Наименование
	|ИЗ
	|	Константы КАК Константы");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	//мИмяВалютыРегламентированногоУчета	= Выборка.Наименование;
	мВалютаРегламентированногоУчета		= Выборка.Ссылка;
	Возврат мВалютаРегламентированногоУчета;
КонецФункции // ПолучитьВалютуРегламентированногоУчета()

	
	// СВЭЙ СВФР-015597 СОА 26.04.2025
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	// СВЭЙ СВФР-015597 СОА 26.04.2025(
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Печать","Печать");
	СтруктураМакетов.Вставить("ПечатьКонтракта", "Печать контракта");
	СтруктураМакетов.Вставить("ПечатьДоговора", "Печать договора");
	Возврат СтруктураМакетов;
	// СВЭЙ СВФР-015597 СОА 26.04.2025)
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоДокументу() 
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТрудовойДоговор.Организация,
	|	ТрудовойДоговор.ПодразделениеОрганизации,
	|	ТрудовойДоговор.Должность,
	|	ТрудовойДоговор.ЗанимаемыхСтавок,
	|	ТрудовойДоговор.НачалоДоговора КАК Период,
	|	ТрудовойДоговор.ИспытательныйСрок,
	|	ТрудовойДоговор.ОкончаниеДоговора,
	|	ТрудовойДоговор.ВидЗанятости,
	|	ТрудовойДоговор.ГрафикРаботы,
	|	ТрудовойДоговор.Сотрудник,
	|	ТрудовойДоговор.НомерТД,
	|	ТрудовойДоговор.ВидТД КАК ВидДоговора,
	|	ВЫБОР
	|		КОГДА ТрудовойДоговор.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ТрудовойДоговор.Организация
	|		ИНАЧЕ ТрудовойДоговор.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ТрудовойДоговор.ПодразделениеОрганизации.Владелец <> ТрудовойДоговор.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ВЫБОР
	|		КОГДА ТрудовыеДоговора.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПересичениеПериодов,
	|	ТрудовыеДоговора.Регистратор КАК ОшибочныйДоговор,
	|	ТрудовойДоговор.ТарифнаяСтавкаПервогоРазряда,
	|	ТрудовойДоговор.ДействиеТрудовогоДоговора,
	|	ТрудовойДоговор.НачалоДоговора
	|ИЗ
	|	Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО ТрудовойДоговор.Ссылка <> ТрудовыеДоговора.Регистратор
	|			И ТрудовойДоговор.Сотрудник = ТрудовыеДоговора.Сотрудник
	|			И ТрудовойДоговор.НачалоДоговора <= ТрудовыеДоговора.ОкончаниеДоговора
	|ГДЕ
	|	ТрудовойДоговор.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции	

Функция СформироватьЗапросПоОтпускам()	
	
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	//Запрос.Текст = 
	//(начало) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	//"ВЫБРАТЬ
	//|	ТрудовойДоговорОтпуска.ВидОтпуска,
	//|	ТрудовойДоговорОтпуска.КоличествоДней,
	//|	ТрудовойДоговорОтпуска.НомерСтроки,
	//|	ТрудовойДоговорОтпуска.РабочийГодС,
	//|	ТрудовойДоговорОтпуска.РабочийГодПо
	//|ИЗ
	//|	Документ.ТрудовойДоговор.Отпуска КАК ТрудовойДоговорОтпуска
	//|ГДЕ
	//|	ТрудовойДоговорОтпуска.Ссылка = &ДокументСсылка";
	//(конец ) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	
	//(начало) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	//"
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	//|	Ложь КАК Корректировка,
	//|	&Сотрудник КАК Сотрудник,
	//|	ТрудовойДоговорОтпуска.ВидОтпуска,
	//|	ТрудовойДоговорОтпуска.КоличествоДней,
	//|	МИНИМУМ( ТрудовойДоговорОтпуска.НомерСтроки ) КАК НомерСтроки,
	//|	ТрудовойДоговорОтпуска.РабочийГодС,
	//|	ТрудовойДоговорОтпуска.РабочийГодПо
	//|   ПОМЕСТИТЬ ВтТаблицаНовыхОтпусков
	//|ИЗ
	//|	Документ.ТрудовойДоговор.Отпуска КАК ТрудовойДоговорОтпуска
	//|ГДЕ
	//|	ТрудовойДоговорОтпуска.Ссылка = &ДокументСсылка
	//|	И НЕ ТрудовойДоговорОтпуска.ИзменениеДнейОтпуска
	//|СГРУППИРОВАТЬ ПО
	//|	ТрудовойДоговорОтпуска.ВидОтпуска,
	//|	ТрудовойДоговорОтпуска.КоличествоДней,
	//|	ТрудовойДоговорОтпуска.РабочийГодС,
	//|	ТрудовойДоговорОтпуска.РабочийГодПо
	//|ИНДЕКСИРОВАТЬ ПО
	//|	&Сотрудник,
	//|	ТрудовойДоговорОтпуска.ВидОтпуска,
	//|	ТрудовойДоговорОтпуска.КоличествоДней,
	//|	ТрудовойДоговорОтпуска.РабочийГодС,
	//|	ТрудовойДоговорОтпуска.РабочийГодПо
	//|;
	//|	
	//|ВЫБРАТЬ
	//|	ТаблицаОтпусков.ВидОтпуска,
	//|	&Сотрудник КАК Сотрудник,
	//|	ТаблицаОтпусков.КоличествоДней,
	//|	ТаблицаОтпусков.НомерСтроки,
	//|	ТаблицаОтпусков.РабочийГодС,
	//|	ТаблицаОтпусков.РабочийГодПо
	//|   ПОМЕСТИТЬ ВтТаблицаИзмененийОтпусков
	//|ИЗ
	//|	&ТаблицаОтпусков КАК ТаблицаОтпусков
	//|ГДЕ
	//|	ТаблицаОтпусков.ИзменениеДнейОтпуска
	//|ИНДЕКСИРОВАТЬ ПО
	//|	&Сотрудник,
	//|	ТаблицаОтпусков.ВидОтпуска
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаИзмененийОтпусков.ВидОтпуска,
	//|	ТаблицаИзмененийОтпусков.Сотрудник,
	//|	МАКСИМУМ( ПрежниеОтпуска.КоличествоДней ) КАК КоличествоДней,
	//|	ТаблицаИзмененийОтпусков.НомерСтроки,
	//|	ТаблицаИзмененийОтпусков.РабочийГодС,
	//|	ТаблицаИзмененийОтпусков.РабочийГодПо
	//|   ПОМЕСТИТЬ ВтТаблицаПрежнихОтпусков
	//|ИЗ
	//|	ВтТаблицаИзмененийОтпусков КАК ТаблицаИзмененийОтпусков
	//|   	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	//|		(ВЫБРАТЬ
	//|			ТаблицаИзмененийОтпусков.НомерСтроки,
	//|           МАКСИМУМ( ЗарегистрированныеОтпуска.Регистратор.Дата ) КАК ПериодПрежнегоОтпуска
	//|		ИЗ
	//|			ВтТаблицаИзмененийОтпусков КАК ТаблицаИзмененийОтпусков
	//|		   		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска 
	//|       			ПО ТаблицаИзмененийОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	//|       			И ТаблицаИзмененийОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	//|       			И ТаблицаИзмененийОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	//|       			И ТаблицаИзмененийОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	//|       			И ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) = ЗарегистрированныеОтпуска.ВидДвижения
	//|       			И &ДокументСсылка <> ЗарегистрированныеОтпуска.Регистратор
	//|       			И &ДатаОстатков >= ЗарегистрированныеОтпуска.Регистратор.Дата
	//|       СГРУППИРОВАТЬ ПО
	//|			ТаблицаИзмененийОтпусков.НомерСтроки
	//|		) КАК ПериодыПрежнихОтпусков
	//|       	ПО ТаблицаИзмененийОтпусков.НомерСтроки = ПериодыПрежнихОтпусков.НомерСтроки
	//|   	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ПрежниеОтпуска 
	//|       	ПО ТаблицаИзмененийОтпусков.Сотрудник = ПрежниеОтпуска.Сотрудник
	//|       	И ТаблицаИзмененийОтпусков.ВидОтпуска = ПрежниеОтпуска.ВидОтпуска
	//|       	И ТаблицаИзмененийОтпусков.РабочийГодС = ПрежниеОтпуска.Период
	//|       	И ТаблицаИзмененийОтпусков.РабочийГодПо = ПрежниеОтпуска.ДатаОкончания
	//|       	И ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) = ПрежниеОтпуска.ВидДвижения
	//|       	И &ДокументСсылка <> ПрежниеОтпуска.Регистратор
	//|       	И ПериодыПрежнихОтпусков.ПериодПрежнегоОтпуска = ПрежниеОтпуска.Регистратор.Дата
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаИзмененийОтпусков.ВидОтпуска,
	//|	ТаблицаИзмененийОтпусков.Сотрудник,
	//|	ТаблицаИзмененийОтпусков.НомерСтроки,
	//|	ТаблицаИзмененийОтпусков.РабочийГодС,
	//|	ТаблицаИзмененийОтпусков.РабочийГодПо
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаНовыхОтпусков.ВидДвижения КАК ВидДвижения,
	//|	ТаблицаНовыхОтпусков.Корректировка,
	//|	ТаблицаНовыхОтпусков.ВидОтпуска,
	//|	ТаблицаНовыхОтпусков.Сотрудник,
	//|	ТаблицаНовыхОтпусков.КоличествоДней,
	//|	ТаблицаНовыхОтпусков.НомерСтроки,
	//|	ТаблицаНовыхОтпусков.РабочийГодС,
	//|	ТаблицаНовыхОтпусков.РабочийГодПо
	//|   ПОМЕСТИТЬ ВтТаблицаНезарегистрированныхОтпусков
	//|ИЗ
	//|	ВтТаблицаНовыхОтпусков КАК ТаблицаНовыхОтпусков
	//|   	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска 
	//|       	ПО ТаблицаНовыхОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	//|       	И ТаблицаНовыхОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	//|       	И ТаблицаНовыхОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	//|       	И ТаблицаНовыхОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	//|       	И ТаблицаНовыхОтпусков.КоличествоДней = ЗарегистрированныеОтпуска.КоличествоДней
	//|       	И ТаблицаНовыхОтпусков.ВидДвижения = ЗарегистрированныеОтпуска.ВидДвижения
	//|ГДЕ
	//|	ЗарегистрированныеОтпуска.Сотрудник IS NULL
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаНезарегистрированныхОтпусков.Корректировка,
	//|	ТаблицаНезарегистрированныхОтпусков.ВидОтпуска,
	//|	ТаблицаНезарегистрированныхОтпусков.Сотрудник,
	//|	ТаблицаНезарегистрированныхОтпусков.КоличествоДней,
	//|	ТаблицаНезарегистрированныхОтпусков.НомерСтроки,
	//|	ТаблицаНезарегистрированныхОтпусков.РабочийГодС,
	//|	ТаблицаНезарегистрированныхОтпусков.РабочийГодПо,
	//|	МАКСИМУМ( ISNULL( ЗарегистрированныеОтпуска.КоличествоДней, 0 ) ) <> 0 КАК ОшибкаНеверноеКоличествоДней,
	//|	МАКСИМУМ( ISNULL( ЗарегистрированныеОтпуска.КоличествоДней, 0 ) ) КАК ЗарегистрированноеКоличествоДней
	//|   ПОМЕСТИТЬ ВтТаблицаНовыхОтпусковКРегистрации
	//|ИЗ
	//|	ВтТаблицаНезарегистрированныхОтпусков КАК ТаблицаНезарегистрированныхОтпусков
	//|   	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска 
	//|       	ПО ТаблицаНезарегистрированныхОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	//|       	И ТаблицаНезарегистрированныхОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	//|       	И ТаблицаНезарегистрированныхОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	//|       	И ТаблицаНезарегистрированныхОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	//|       	И ТаблицаНезарегистрированныхОтпусков.КоличествоДней <> ЗарегистрированныеОтпуска.КоличествоДней
	//|       	И ТаблицаНезарегистрированныхОтпусков.ВидДвижения = ЗарегистрированныеОтпуска.ВидДвижения
	//|СГРУППИРОВАТЬ ПО
	//|	ТаблицаНезарегистрированныхОтпусков.ВидДвижения,
	//|	ТаблицаНезарегистрированныхОтпусков.Корректировка,
	//|	ТаблицаНезарегистрированныхОтпусков.ВидОтпуска,
	//|	ТаблицаНезарегистрированныхОтпусков.Сотрудник,
	//|	ТаблицаНезарегистрированныхОтпусков.КоличествоДней,
	//|	ТаблицаНезарегистрированныхОтпусков.НомерСтроки,
	//|	ТаблицаНезарегистрированныхОтпусков.РабочийГодС,
	//|	ТаблицаНезарегистрированныхОтпусков.РабочийГодПо
	//|;
	//|
	//|ВЫБРАТЬ
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	Ложь КАК ОкруглятьКорректировкуВПользуСотрудника,
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	ЗНАЧЕНИЕ( ВидДвиженияНакопления.Приход ) КАК ВидДвижения,
	//|	ТаблицаНовыхОтпусковКРегистрации.Корректировка,
	//|	ТаблицаНовыхОтпусковКРегистрации.ВидОтпуска,
	//|	ТаблицаНовыхОтпусковКРегистрации.Сотрудник,
	//|	ТаблицаНовыхОтпусковКРегистрации.КоличествоДней,
	//|	ТаблицаНовыхОтпусковКРегистрации.НомерСтроки,
	//|	ТаблицаНовыхОтпусковКРегистрации.РабочийГодС,
	//|	ТаблицаНовыхОтпусковКРегистрации.РабочийГодПо,
	//|	ТаблицаНовыхОтпусковКРегистрации.ОшибкаНеверноеКоличествоДней,
	//|	ТаблицаНовыхОтпусковКРегистрации.ЗарегистрированноеКоличествоДней
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|   ПОМЕСТИТЬ ВтДвижения
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|ИЗ
	//|	ВтТаблицаНовыхОтпусковКРегистрации КАК ТаблицаНовыхОтпусковКРегистрации
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	Ложь КАК ОкруглятьКорректировкуВПользуСотрудника,
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	ЗНАЧЕНИЕ( ВидДвиженияНакопления.Расход ) КАК ВидДвижения,
	//|	Истина КАК Корректировка,
	//|	Изменения.ВидОтпуска,
	//|	Изменения.Сотрудник,
	//|   ВЫБОР 
	//|		КОГДА РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|			  И РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|		ТОГДА
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|			 ВЫРАЗИТЬ(
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|						Изменения.КоличествоДней 
	//|						* РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|						 	МЕСЯЦ ) 
	//|						/ РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|							МЕСЯЦ ) 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|			  КАК ЧИСЛО( 5, 0 ) )
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|       ИНАЧЕ 0
	//|	КОНЕЦ  КАК КоличествоДней,
	//|	Изменения.НомерСтроки,
	//|	Изменения.РабочийГодС,
	//|	Изменения.РабочийГодПо,
	//|	Ложь КАК ОшибкаНеверноеКоличествоДней,
	//|	0 КАК ЗарегистрированноеКоличествоДней
	//|ИЗ
	//|   ВтТаблицаПрежнихОтпусков КАК Изменения
	//|ГДЕ
	//|   ВЫБОР 
	//|		КОГДА РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|			  И РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|		ТОГДА 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|			 ВЫРАЗИТЬ(
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|						Изменения.КоличествоДней 
	//|						* РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|						 	МЕСЯЦ ) 
	//|						/ РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|							МЕСЯЦ ) 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|			  КАК ЧИСЛО( 5, 0 ) )
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|       ИНАЧЕ 0
	//|	КОНЕЦ  > 0
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	Ложь КАК ОкруглятьКорректировкуВПользуСотрудника,
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	ЗНАЧЕНИЕ( ВидДвиженияНакопления.Приход ) КАК ВидДвижения,
	//|	Ложь КАК Корректировка,
	//|	Изменения.ВидОтпуска,
	//|	Изменения.Сотрудник,
	//|	Изменения.КоличествоДней КАК КоличествоДней,
	//|	Изменения.НомерСтроки,
	//|	Изменения.РабочийГодС,
	//|	Изменения.РабочийГодПо,
	//|	Ложь КАК ОшибкаНеверноеКоличествоДней,
	//|	Изменения.КоличествоДней КАК ЗарегистрированноеКоличествоДней
	//|ИЗ
	//|	ВтТаблицаИзмененийОтпусков КАК Изменения
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	Истина КАК ОкруглятьКорректировкуВПользуСотрудника,
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|	ЗНАЧЕНИЕ( ВидДвиженияНакопления.Расход ) КАК ВидДвижения,
	//|	Истина КАК Корректировка,
	//|	Изменения.ВидОтпуска,
	//|	Изменения.Сотрудник,
	//|   ВЫБОР 
	//|		КОГДА РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|			  И РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	////|		ТОГДА ВЫРАЗИТЬ( Изменения.КоличествоДней 
	////|						* РАЗНОСТЬДАТ( 
	////|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	////|							ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	////|						 	МЕСЯЦ ) 
	////|						/ РАЗНОСТЬДАТ( 
	////|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	////|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	////|							МЕСЯЦ ) 
	////|			  КАК ЧИСЛО( 5, 0 ) )
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|		ТОГДА Изменения.КоличествоДней 
	//|						* РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|						 	МЕСЯЦ ) 
	//|						/ РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|							МЕСЯЦ ) 
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|       ИНАЧЕ 0
	//|	КОНЕЦ  КАК КоличествоДней,
	//|	Изменения.НомерСтроки,
	//|	Изменения.РабочийГодС,
	//|	Изменения.РабочийГодПо,
	//|	Ложь КАК ОшибкаНеверноеКоличествоДней,
	//|	0 КАК ЗарегистрированноеКоличествоДней
	//|ИЗ
	//|	ВтТаблицаИзмененийОтпусков КАК Изменения
	//|ГДЕ
	//|   ВЫБОР 
	//|		КОГДА РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|			  И РАЗНОСТЬДАТ( 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|				ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|			   	МЕСЯЦ ) > 0 
	//|		ТОГДА ВЫРАЗИТЬ( Изменения.КоличествоДней 
	//|						* РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( &ДатаНачалаДоговора ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( &ДатаНачалаДоговора, МЕСЯЦ ) КОНЕЦ, 
	//|						 	МЕСЯЦ ) 
	//|						/ РАЗНОСТЬДАТ( 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодС ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодС, МЕСЯЦ ) КОНЕЦ, 
	//|							ВЫБОР КОГДА ДЕНЬ( Изменения.РабочийГодПо ) >= 15 ТОГДА ДОБАВИТЬКДАТЕ( НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ), МЕСЯЦ, 1 ) ИНАЧЕ НАЧАЛОПЕРИОДА( Изменения.РабочийГодПо, МЕСЯЦ ) КОНЕЦ, 
	//|							МЕСЯЦ ) 
	//|			  КАК ЧИСЛО( 5, 0 ) )
	//|       ИНАЧЕ 0
	//|	КОНЕЦ  > 0
	//|
	////+ СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|;
	//|
	//|ВЫБРАТЬ
	//|	Движения.ВидДвижения,
	//|	Движения.Корректировка,
	//|	Движения.ВидОтпуска,
	//|	Движения.Сотрудник,
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|   Движения.КоличествоДней КАК КоличествоДнейДоОкругления,
	//|	Движения.ОкруглятьКорректировкуВПользуСотрудника, 
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|	ВЫБОР КОГДА Движения.ОкруглятьКорректировкуВПользуСотрудника 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|				ИЛИ НЕ &ЕстьОкруглятьКорректировкуВПользуСотрудника И Движения.Корректировка
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|			ТОГДА
	//|				ВЫБОР КОГДА ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) ) - Движения.КоличествоДней = 0.5
	//|						ТОГДА
	//|							ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) ) - 1
	//|						ИНАЧЕ 
	//|							ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) )
	//|				КОНЕЦ
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|				- &ДнейОкругления
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|			ИНАЧЕ 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|				Движения.КоличествоДней
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|   			ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) )
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|	КОНЕЦ КАК КоличествоДней,
	//|	Движения.НомерСтроки,
	//|	Движения.РабочийГодС,
	//|	Движения.РабочийГодПо,
	//|	Движения.ОшибкаНеверноеКоличествоДней,
	//|	Движения.ЗарегистрированноеКоличествоДней
	//|ИЗ
	//|	ВтДвижения КАК Движения 
	//|ГДЕ
	//|	ВЫБОР КОГДА Движения.ОкруглятьКорректировкуВПользуСотрудника 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|				ИЛИ НЕ &ЕстьОкруглятьКорректировкуВПользуСотрудника И Движения.Корректировка
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|			ТОГДА
	//|				ВЫБОР КОГДА ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) ) - Движения.КоличествоДней = 0.5
	//|						ТОГДА
	//|							ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) ) - 1
	//|						ИНАЧЕ 
	//|							ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) )
	//|				КОНЕЦ
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|				- &ДнейОкругления
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|			ИНАЧЕ 
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	////|				Движения.КоличествоДней
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	////+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|   			ВЫРАЗИТЬ( Движения.КоличествоДней КАК ЧИСЛО( 5, 0 ) )
	////- СВЭЙ КДЯ 27.11.19 СВФР-005125
	//|	КОНЕЦ  > 0
	//|
	////- СВЭЙ 28.02.19  КДЯ СВФР-004023
	//|";
	
	//Аверсон 24.06.2021 СВФР-007752
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЛОЖЬ КАК Корректировка,
	|	&Сотрудник КАК Сотрудник,
	|	ТрудовойДоговорОтпуска.ВидОтпуска,
	|	ТрудовойДоговорОтпуска.КоличествоДней,
	|	МИНИМУМ(ТрудовойДоговорОтпуска.НомерСтроки) КАК НомерСтроки,
	|	ТрудовойДоговорОтпуска.РабочийГодС,
	|	ТрудовойДоговорОтпуска.РабочийГодПо
	|ПОМЕСТИТЬ ВтТаблицаНовыхОтпусков
	|ИЗ
	|	Документ.ТрудовойДоговор.Отпуска КАК ТрудовойДоговорОтпуска
	|ГДЕ
	|	ТрудовойДоговорОтпуска.Ссылка = &ДокументСсылка
	|	И НЕ ТрудовойДоговорОтпуска.ИзменениеДнейОтпуска
	|
	|СГРУППИРОВАТЬ ПО
	|	ТрудовойДоговорОтпуска.ВидОтпуска,
	|	ТрудовойДоговорОтпуска.КоличествоДней,
	|	ТрудовойДоговорОтпуска.РабочийГодС,
	|	ТрудовойДоговорОтпуска.РабочийГодПо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	&Сотрудник,
	|	ТрудовойДоговорОтпуска.ВидОтпуска,
	|	ТрудовойДоговорОтпуска.КоличествоДней,
	|	ТрудовойДоговорОтпуска.РабочийГодС,
	|	ТрудовойДоговорОтпуска.РабочийГодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтпусков.ВидОтпуска,
	|	&Сотрудник КАК Сотрудник,
	|	ТаблицаОтпусков.КоличествоДней,
	|	ТаблицаОтпусков.НомерСтроки,
	|	ТаблицаОтпусков.РабочийГодС,
	|	ТаблицаОтпусков.РабочийГодПо
	|ПОМЕСТИТЬ ВтТаблицаИзмененийОтпусков
	|ИЗ
	|	&ТаблицаОтпусков КАК ТаблицаОтпусков
	|ГДЕ
	|	ТаблицаОтпусков.ИзменениеДнейОтпуска
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	&Сотрудник,
	|	ТаблицаОтпусков.ВидОтпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзмененийОтпусков.ВидОтпуска,
	|	ТаблицаИзмененийОтпусков.Сотрудник,
	|	МАКСИМУМ(ПрежниеОтпуска.КоличествоДней) КАК КоличествоДней,
	|	ТаблицаИзмененийОтпусков.НомерСтроки,
	|	ТаблицаИзмененийОтпусков.РабочийГодС,
	|	ТаблицаИзмененийОтпусков.РабочийГодПо
	|ПОМЕСТИТЬ ВтТаблицаПрежнихОтпусков
	|ИЗ
	|	ВтТаблицаИзмененийОтпусков КАК ТаблицаИзмененийОтпусков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаИзмененийОтпусков.НомерСтроки КАК НомерСтроки,
	|			МАКСИМУМ(ЗарегистрированныеОтпуска.Регистратор.Дата) КАК ПериодПрежнегоОтпуска
	|		ИЗ
	|			ВтТаблицаИзмененийОтпусков КАК ТаблицаИзмененийОтпусков
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска
	|				ПО ТаблицаИзмененийОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	|					И ТаблицаИзмененийОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	
	//Аверсон 06.12.2022 КВВ СВФР-009919 (
	//|					И ТаблицаИзмененийОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	//|					И ТаблицаИзмененийОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	|					И НАЧАЛОПЕРИОДА(ТаблицаИзмененийОтпусков.РабочийГодС,ДЕНЬ) = НАЧАЛОПЕРИОДА(ЗарегистрированныеОтпуска.Период,ДЕНЬ)
	|					И НАЧАЛОПЕРИОДА(ТаблицаИзмененийОтпусков.РабочийГодПо,ДЕНЬ) = НАЧАЛОПЕРИОДА(ЗарегистрированныеОтпуска.ДатаОкончания,ДЕНЬ)
	//Аверсон 06.12.2022 КВВ СВФР-009919 )
	
	|					И (ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) = ЗарегистрированныеОтпуска.ВидДвижения)
	|					И (&ДокументСсылка <> ЗарегистрированныеОтпуска.Регистратор)
	|					И (&ДатаОстатков >= ЗарегистрированныеОтпуска.Регистратор.Дата)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаИзмененийОтпусков.НомерСтроки) КАК ПериодыПрежнихОтпусков
	|		ПО ТаблицаИзмененийОтпусков.НомерСтроки = ПериодыПрежнихОтпусков.НомерСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ПрежниеОтпуска
	|		ПО ТаблицаИзмененийОтпусков.Сотрудник = ПрежниеОтпуска.Сотрудник
	|			И ТаблицаИзмененийОтпусков.ВидОтпуска = ПрежниеОтпуска.ВидОтпуска
	
	//Аверсон 06.12.2022 КВВ СВФР-009919 (
	//|			И ТаблицаИзмененийОтпусков.РабочийГодС = ПрежниеОтпуска.Период
	//|			И ТаблицаИзмененийОтпусков.РабочийГодПо = ПрежниеОтпуска.ДатаОкончания
	|			И НАЧАЛОПЕРИОДА(ТаблицаИзмененийОтпусков.РабочийГодС,ДЕНЬ) = НАЧАЛОПЕРИОДА(ПрежниеОтпуска.Период,ДЕНЬ)
	|			И НАЧАЛОПЕРИОДА(ТаблицаИзмененийОтпусков.РабочийГодПо,ДЕНЬ) = НАЧАЛОПЕРИОДА(ПрежниеОтпуска.ДатаОкончания,ДЕНЬ)
	//Аверсон 06.12.2022 КВВ СВФР-009919 )
	
	|			И (ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) = ПрежниеОтпуска.ВидДвижения)
	|			И (&ДокументСсылка <> ПрежниеОтпуска.Регистратор)
	|			И (ПериодыПрежнихОтпусков.ПериодПрежнегоОтпуска = ПрежниеОтпуска.Регистратор.Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзмененийОтпусков.ВидОтпуска,
	|	ТаблицаИзмененийОтпусков.Сотрудник,
	|	ТаблицаИзмененийОтпусков.НомерСтроки,
	|	ТаблицаИзмененийОтпусков.РабочийГодС,
	|	ТаблицаИзмененийОтпусков.РабочийГодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНовыхОтпусков.ВидДвижения КАК ВидДвижения,
	|	ТаблицаНовыхОтпусков.Корректировка,
	|	ТаблицаНовыхОтпусков.ВидОтпуска,
	|	ТаблицаНовыхОтпусков.Сотрудник,
	|	ТаблицаНовыхОтпусков.КоличествоДней,
	|	ТаблицаНовыхОтпусков.НомерСтроки,
	|	ТаблицаНовыхОтпусков.РабочийГодС,
	|	ТаблицаНовыхОтпусков.РабочийГодПо
	|ПОМЕСТИТЬ ВтТаблицаНезарегистрированныхОтпусков
	|ИЗ
	|	ВтТаблицаНовыхОтпусков КАК ТаблицаНовыхОтпусков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска
	|		ПО ТаблицаНовыхОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	|			И ТаблицаНовыхОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	|			И ТаблицаНовыхОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	|			И ТаблицаНовыхОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	|			И ТаблицаНовыхОтпусков.КоличествоДней = ЗарегистрированныеОтпуска.КоличествоДней
	|			И ТаблицаНовыхОтпусков.ВидДвижения = ЗарегистрированныеОтпуска.ВидДвижения
	|ГДЕ
	|	ЗарегистрированныеОтпуска.Сотрудник ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНезарегистрированныхОтпусков.Корректировка,
	|	ТаблицаНезарегистрированныхОтпусков.ВидОтпуска,
	|	ТаблицаНезарегистрированныхОтпусков.Сотрудник,
	|	ТаблицаНезарегистрированныхОтпусков.КоличествоДней,
	|	ТаблицаНезарегистрированныхОтпусков.НомерСтроки,
	|	ТаблицаНезарегистрированныхОтпусков.РабочийГодС,
	|	ТаблицаНезарегистрированныхОтпусков.РабочийГодПо,
	|	МАКСИМУМ(ЕСТЬNULL(ЗарегистрированныеОтпуска.КоличествоДней, 0)) <> 0 КАК ОшибкаНеверноеКоличествоДней,
	|	МАКСИМУМ(ЕСТЬNULL(ЗарегистрированныеОтпуска.КоличествоДней, 0)) КАК ЗарегистрированноеКоличествоДней
	|ПОМЕСТИТЬ ВтТаблицаНовыхОтпусковКРегистрации
	|ИЗ
	|	ВтТаблицаНезарегистрированныхОтпусков КАК ТаблицаНезарегистрированныхОтпусков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ЗарегистрированныеОтпуска
	|		ПО ТаблицаНезарегистрированныхОтпусков.Сотрудник = ЗарегистрированныеОтпуска.Сотрудник
	|			И ТаблицаНезарегистрированныхОтпусков.ВидОтпуска = ЗарегистрированныеОтпуска.ВидОтпуска
	|			И ТаблицаНезарегистрированныхОтпусков.РабочийГодС = ЗарегистрированныеОтпуска.Период
	|			И ТаблицаНезарегистрированныхОтпусков.РабочийГодПо = ЗарегистрированныеОтпуска.ДатаОкончания
	|			И ТаблицаНезарегистрированныхОтпусков.КоличествоДней <> ЗарегистрированныеОтпуска.КоличествоДней
	|			И ТаблицаНезарегистрированныхОтпусков.ВидДвижения = ЗарегистрированныеОтпуска.ВидДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНезарегистрированныхОтпусков.Корректировка,
	|	ТаблицаНезарегистрированныхОтпусков.ВидОтпуска,
	|	ТаблицаНезарегистрированныхОтпусков.Сотрудник,
	|	ТаблицаНезарегистрированныхОтпусков.КоличествоДней,
	|	ТаблицаНезарегистрированныхОтпусков.НомерСтроки,
	|	ТаблицаНезарегистрированныхОтпусков.РабочийГодС,
	|	ТаблицаНезарегистрированныхОтпусков.РабочийГодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК ОкруглятьКорректировкуВПользуСотрудника,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаНовыхОтпусковКРегистрации.Корректировка,
	|	ТаблицаНовыхОтпусковКРегистрации.ВидОтпуска,
	|	ТаблицаНовыхОтпусковКРегистрации.Сотрудник,
	|	ТаблицаНовыхОтпусковКРегистрации.КоличествоДней,
	|	ТаблицаНовыхОтпусковКРегистрации.НомерСтроки,
	|	ТаблицаНовыхОтпусковКРегистрации.РабочийГодС,
	|	ТаблицаНовыхОтпусковКРегистрации.РабочийГодПо,
	|	ТаблицаНовыхОтпусковКРегистрации.ОшибкаНеверноеКоличествоДней,
	|	ТаблицаНовыхОтпусковКРегистрации.ЗарегистрированноеКоличествоДней
	|ПОМЕСТИТЬ ВтДвижения
	|ИЗ
	|	ВтТаблицаНовыхОтпусковКРегистрации КАК ТаблицаНовыхОтпусковКРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ИСТИНА,
	|	Изменения.ВидОтпуска,
	|	Изменения.Сотрудник,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) > 0
	|				И РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) > 0
	|			ТОГДА Изменения.КоличествоДней * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) / РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Изменения.НомерСтроки,
	|	Изменения.РабочийГодС,
	|	Изменения.РабочийГодПо,
	|	ЛОЖЬ,
	|	0
	|ИЗ
	|	ВтТаблицаПрежнихОтпусков КАК Изменения
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ) > 0
	|					И РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ) > 0
	|				ТОГДА Изменения.КоличествоДней * РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ) / РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ)
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЛОЖЬ,
	|	Изменения.ВидОтпуска,
	|	Изменения.Сотрудник,
	|	Изменения.КоличествоДней,
	|	Изменения.НомерСтроки,
	|	Изменения.РабочийГодС,
	|	Изменения.РабочийГодПо,
	|	ЛОЖЬ,
	|	Изменения.КоличествоДней
	|ИЗ
	|	ВтТаблицаИзмененийОтпусков КАК Изменения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ИСТИНА,
	|	Изменения.ВидОтпуска,
	|	Изменения.Сотрудник,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) > 0
	|				И РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) > 0
	|			ТОГДА Изменения.КоличествоДней * РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ) / РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|					КОНЕЦ, ВЫБОР
	|						КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|							ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|						ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|					КОНЕЦ, МЕСЯЦ)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	Изменения.НомерСтроки,
	|	Изменения.РабочийГодС,
	|	Изменения.РабочийГодПо,
	|	ЛОЖЬ,
	|	0
	|ИЗ
	|	ВтТаблицаИзмененийОтпусков КАК Изменения
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ) > 0
	|					И РАЗНОСТЬДАТ(ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|						КОНЕЦ, ВЫБОР
	|							КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|								ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|							ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|						КОНЕЦ, МЕСЯЦ) > 0
	|				ТОГДА ВЫРАЗИТЬ(Изменения.КоличествоДней * РАЗНОСТЬДАТ(ВЫБОР
	|								КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|									ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|								ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|							КОНЕЦ, ВЫБОР
	|								КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
	|									ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
	|								ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
	|							КОНЕЦ, МЕСЯЦ) / РАЗНОСТЬДАТ(ВЫБОР
	|								КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
	|									ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
	|								ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
	|							КОНЕЦ, ВЫБОР
	|								КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
	|									ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
	|								ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
	|							КОНЕЦ, МЕСЯЦ) КАК ЧИСЛО(5, 0))
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.ВидДвижения,
	|	Движения.Корректировка,
	|	Движения.ВидОтпуска,
	|	Движения.Сотрудник,
	|	Движения.КоличествоДней КАК КоличествоДнейДоОкругления,
	|	Движения.ОкруглятьКорректировкуВПользуСотрудника,
	|	ВЫБОР
	|		КОГДА Движения.ОкруглятьКорректировкуВПользуСотрудника
	|				ИЛИ НЕ &ЕстьОкруглятьКорректировкуВПользуСотрудника
	|					И Движения.Корректировка
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))) - Движения.КоличествоДней = 0.5
	|						ТОГДА (ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))) - 1
	|					ИНАЧЕ ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))
	|				КОНЕЦ - &ДнейОкругления
	|		ИНАЧЕ ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))
	|	КОНЕЦ КАК КоличествоДней,
	|	Движения.НомерСтроки,
	|	Движения.РабочийГодС,
	|	Движения.РабочийГодПо,
	|	Движения.ОшибкаНеверноеКоличествоДней,
	|	Движения.ЗарегистрированноеКоличествоДней
	|ИЗ
	|	ВтДвижения КАК Движения
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Движения.ОкруглятьКорректировкуВПользуСотрудника
	|					ИЛИ НЕ &ЕстьОкруглятьКорректировкуВПользуСотрудника
	|						И Движения.Корректировка
	|				ТОГДА ВЫБОР
	|						КОГДА (ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))) - Движения.КоличествоДней = 0.5
	|							ТОГДА (ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))) - 1
	|						ИНАЧЕ ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))
	|					КОНЕЦ - &ДнейОкругления
	|			ИНАЧЕ ВЫРАЗИТЬ(Движения.КоличествоДней КАК ЧИСЛО(5, 0))
	|		КОНЕЦ > 0";
	
	Запрос.УстановитьПараметр( "ТаблицаОтпусков" , ЭтотОбъект.Отпуска );
	Запрос.УстановитьПараметр( "Сотрудник" , Сотрудник );
	Запрос.УстановитьПараметр( "ДатаОстатков" , ЭтотОбъект.Дата );
	Запрос.УстановитьПараметр( "ДатаНачалаДоговора" , ЭтотОбъект.НачалоДоговора );
	//(конец ) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	
	//+ СВЭЙ КДЯ 27.11.19 СВФР-005125
	Запрос.УстановитьПараметр( "ДнейОкругления", 0 );
	Запрос.УстановитьПараметр( "ЕстьОкруглятьКорректировкуВПользуСотрудника", Истина );
	ТЗ_Движения = Запрос.Выполнить().Выгрузить();
	ДнейОкругления = 0;
	ЕстьОкруглятьКорректировкуВПользуСотрудника = Ложь;
	Для каждого Стр Из ТЗ_Движения.НайтиСтроки( Новый Структура( "Корректировка", Истина ) ) Цикл
		ДнейОкругления = ДнейОкругления + ( Стр.КоличествоДней - Стр.КоличествоДнейДоОкругления ) ;	
		ЕстьОкруглятьКорректировкуВПользуСотрудника = ЕстьОкруглятьКорректировкуВПользуСотрудника 
		ИЛИ Стр.ОкруглятьКорректировкуВПользуСотрудника;
	КонецЦикла;
	ДнейОкругления = Окр( ДнейОкругления, 0, 1 );
	ДнейОкругления = ?( ДнейОкругления > 0, ДнейОкругления, 0 );
	Запрос.УстановитьПараметр( "ДнейОкругления", ДнейОкругления );
	
	//Аверсон 06.12.2022 КВВ СВФР-009919 (
	Если ЕстьОкруглятьКорректировкуВПользуСотрудника = Ложь
		И ЭтотОбъект.Перемещение
		И ЭтотОбъект.Отпуска.Количество() > 0
		И ЭтотОбъект.Отпуска.Итог("КоличествоДней") = 0 Тогда
		ЕстьОкруглятьКорректировкуВПользуСотрудника = Истина;
	КонецЕсли;
	//Аверсон 06.12.2022 КВВ СВФР-009919 )
	
	Запрос.УстановитьПараметр( "ЕстьОкруглятьКорректировкуВПользуСотрудника", ЕстьОкруглятьКорректировкуВПользуСотрудника );
	//- СВЭЙ КДЯ 27.11.19 СВФР-005125
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции	




// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеДокумента(Выборка, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(Выборка.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, в которую принимается работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(Выборка.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран работник!", Отказ, Заголовок);
	КонецЕсли;
	
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(Выборка.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано подразделение, в которое принимается работник!", Отказ, Заголовок);
	ИначеЕсли Выборка.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке("указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
	КонецЕсли;
	
	// Должность
	Если НЕ ЗначениеЗаполнено(Выборка.Должность) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана должность работника!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаПриема
	ЕстьДатаПриема = ЗначениеЗаполнено(Выборка.Период);
	Если НЕ ЕстьДатаПриема Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата приема на работу!", Отказ, Заголовок);
		//Иначе
		//	#Если Клиент Тогда
		//		Если Выборка.Период > РабочаяДата Тогда
		//			Сообщить("Дата начала договора превышает рабочую дату!", СтатусСообщения.Важное);
		//		КонецЕсли;
		//	#КонецЕсли
	КонецЕсли;
	
	// Количество ставок
	Если Выборка.ЗанимаемыхСтавок = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано количество занимаемых работником ставок!", Отказ, Заголовок);
	КонецЕсли;
	
	// ГрафикРаботы
	Если НЕ ЗначениеЗаполнено(Выборка.ГрафикРаботы)  Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан рабочий график!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НетСотрудника ИЛИ (НЕ ЕстьДатаПриема) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Если Выборка.ПересичениеПериодов Тогда
			Сообщить("Дата начала трудового договора меньше даты окончания договора: " + Выборка.ОшибочныйДоговор, СтатусСообщения.Важное);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеОтпусков(Выборка, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Выборка.НомерСтроки) +
	""" табл. части ""Отпуска"": ";
	
	Если НЕ ЗначениеЗаполнено(Выборка.ВидОтпуска) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид отпуска!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.КоличествоДней) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано количество дней!", Отказ, Заголовок);
	КонецЕсли;
	
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()




Процедура ДобавитьСтрокуВДвиженияПоРегиструТрудовыеДоговора(Выборка)
	
	Движение = Движения.ТрудовыеДоговора.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение, Выборка);	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

Процедура ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоДокументу, ВыборкаПоОтпускам)
	НачалоДог = Год(ВыборкаПоДокументу.Период);   
	НомерГодаДляОкончания =Год(ВыборкаПоОтпускам.РабочийГодПо)- НачалоДог-1;
	ОкончаниеДог = Год(ВыборкаПоОтпускам.РабочийГодПо+1);
	НомерГода = 0;
	
	//(начало) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	Если ВыборкаПоОтпускам.ОшибкаНеверноеКоличествоДней Тогда
		ТекстСообщения = НСтр("ru = 'В строке %1 указано неверное количество дней: %2 вместо %3 !'");
		ТекстСообщения = СтрЗаменить( ТекстСообщения, "%1", Строка(ВыборкаПоОтпускам.НомерСтроки) );
		ТекстСообщения = СтрЗаменить( ТекстСообщения, "%2", Строка(ВыборкаПоОтпускам.КоличествоДней) );
		ТекстСообщения = СтрЗаменить( ТекстСообщения, "%3", Строка(ВыборкаПоОтпускам.ЗарегистрированноеКоличествоДней) );
		Сообщить( ТекстСообщения, СтатусСообщения.Важное );
		Возврат;
	КонецЕсли; // ВыборкаПоОтпускам.ОшибкаНеверноеКоличествоДней
	//(конец ) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	
	//пока НачалоДог < ОкончаниеДог Цикл 
	Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
	
	//Измерения
	//(начало) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	//Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
	//(конец ) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	//(начало) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	Движение.ВидДвижения = ВыборкаПоОтпускам.ВидДвижения;
	Движение.Корректировка = ВыборкаПоОтпускам.Корректировка;
	//(конец ) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	
	//Островская Татьяна 21.03.2014
	Движение.Период         = ВыборкаПоОтпускам.РабочийГодС;
	Движение.ДатаОкончания	= ВыборкаПоОтпускам.РабочийГодПо;
	//Островская Татьяна 21.03.2014
	Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
	Движение.ВидОтпуска     = ВыборкаПоОтпускам.ВидОтпуска;
	
	
	//Ресурсы
	Движение.КоличествоДней = ВыборкаПоОтпускам.КоличествоДней;
	
	
	НачалоДог = НачалоДог+1;
	НомерГодаДляОкончания =Год(ВыборкаПоОтпускам.РабочийГодС)- НачалоДог-1; //Островская Татьяна 21.03.2014
	НомерГода = НомерГода+1;
	// КонецЦикла;	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ВыборкаПоДокументу = СформироватьЗапросПоДокументу().Выбрать();
	//(начало) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	//ВыборкаПоОтпускам = СформироватьЗапросПоОтпускам().Выбрать();
	//(конец ) закомментировано Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
	
	Если ВыборкаПоДокументу.Следующий() тогда
		
		//Надо позвать проверку заполнения реквизитов 
		ПроверитьЗаполнениеДокумента(ВыборкаПоДокументу, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			ДобавитьСтрокуВДвиженияПоРегиструТрудовыеДоговора(ВыборкаПоДокументу);
			
			Если НЕ РасчетОтСреднегодовойНормыДней Тогда //Аверсон 24.03.2023 КВВ СВФР-010537
				//(начало) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
				ВыборкаПоОтпускам = СформироватьЗапросПоОтпускам().Выбрать();
				//(конец ) добавлено Кухарчуком Д.Я. 13.07.18, задача СВФР-002178
				
				Пока  ВыборкаПоОтпускам.Следующий() Цикл
					ПроверитьЗаполнениеОтпусков(ВыборкаПоОтпускам, Отказ, Заголовок);
					Если НЕ Отказ Тогда
						ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоДокументу, ВыборкаПоОтпускам);
					КонецЕсли;
				КонецЦикла;
				
				//Аверсон 24.03.2023 КВВ СВФР-010537 (
			Иначе  //РасчетОтСреднегодовойНормыДней = ИСТИНА
				ДнейВГоду = 0;
				НаДату = НачалоДня(?(ЗначениеЗаполнено(НачалоДоговора),НачалоДоговора,ДатаТД));
				ДнейВГодуРег = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НаДату,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячноеКалендДней));
				Если ЗначениеЗаполнено(ДнейВГодуРег) ИЛИ ДнейВГодуРег.Размер <> 0 тогда
					ДнейВГоду = ДнейВГодуРег.Размер;
				Иначе
					Сообщить("Не определен параметр ""Среднемесячное количество календарных дней"" в регистре сведений ""Размеры параметров для расчета РБ"", не будут рассчитаны дни отпуска.");
				КонецЕсли;
				Если ДнейВГоду > 0 Тогда	
					З_Отп = Новый Запрос;
					З_Отп.Текст = "ВЫБРАТЬ
					|ТаблицаОтпусков.ВидОтпуска,
					|&Сотрудник КАК Сотрудник,
					|ТаблицаОтпусков.КоличествоДней,
					|ТаблицаОтпусков.НомерСтроки,
					|ТаблицаОтпусков.РабочийГодС,
					|ТаблицаОтпусков.РабочийГодПо
					|ПОМЕСТИТЬ ВтТаблицаИзмененийОтпусков
					|ИЗ Документ.ТрудовойДоговор.Отпуска КАК ТаблицаОтпусков
					|ГДЕ
					|ТаблицаОтпусков.Ссылка = &ДокументСсылка
					|И ТаблицаОтпусков.ИзменениеДнейОтпуска
					|ИНДЕКСИРОВАТЬ ПО
					|&Сотрудник,
					|ТаблицаОтпусков.ВидОтпуска
					|;
					|
					|ВЫБРАТЬ
					|Изменения.ВидОтпуска,
					|Изменения.Сотрудник,
					|Изменения.КоличествоДней КАК КоличествоДней,
					|ВЫРАЗИТЬ(РАЗНОСТЬДАТ(Изменения.РабочийГодС,&ДатаНачалаДоговора,ДЕНЬ)/&СреднеГодНормаДн КАК ЧИСЛО(5, 0)) КАК ДнейНаСреднеГод,
					|Изменения.НомерСтроки,
					|Изменения.РабочийГодС,
					|Изменения.РабочийГодПо
					|ИЗ ВтТаблицаИзмененийОтпусков КАК Изменения
					|ГДЕ
					|ВЫБОР
					|КОГДА РАЗНОСТЬДАТ(ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
					|КОНЕЦ, ВЫБОР
					|КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
					|КОНЕЦ, МЕСЯЦ) > 0
					|И РАЗНОСТЬДАТ(ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
					|КОНЕЦ, ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
					|КОНЕЦ, МЕСЯЦ) > 0
					|ТОГДА ВЫРАЗИТЬ(Изменения.КоличествоДней * РАЗНОСТЬДАТ(ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
					|КОНЕЦ, ВЫБОР
					|КОГДА ДЕНЬ(&ДатаНачалаДоговора) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(&ДатаНачалаДоговора, МЕСЯЦ)
					|КОНЕЦ, МЕСЯЦ) / РАЗНОСТЬДАТ(ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодС) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодС, МЕСЯЦ)
					|КОНЕЦ, ВЫБОР
					|КОГДА ДЕНЬ(Изменения.РабочийГодПо) >= 15
					|ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ), МЕСЯЦ, 1)
					|ИНАЧЕ НАЧАЛОПЕРИОДА(Изменения.РабочийГодПо, МЕСЯЦ)
					|КОНЕЦ, МЕСЯЦ) КАК ЧИСЛО(5, 0))
					|ИНАЧЕ 0
					|КОНЕЦ > 0";
					З_Отп.УстановитьПараметр("СреднеГодНормаДн", ДнейВГоду);
					З_Отп.УстановитьПараметр("ДокументСсылка", Ссылка);
					З_Отп.УстановитьПараметр("ДатаНачалаДоговора", НачалоДоговора);
					З_Отп.УстановитьПараметр("Сотрудник", Сотрудник);
					Рез_З_Отп = З_Отп.Выполнить().Выгрузить();
					
					ТЗ_ВыборкаПоОтпускам = Новый ТаблицаЗначений;
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("РабочийГодС");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("РабочийГодПо");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("ОшибкаНеверноеКоличествоДней");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("НомерСтроки");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("КоличествоДней");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("ЗарегистрированноеКоличествоДней");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("ВидДвижения");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("Корректировка");
					ТЗ_ВыборкаПоОтпускам.Колонки.Добавить("ВидОтпуска");
					
					Для Каждого Стр_Рез_З_Отп ИЗ Рез_З_Отп Цикл
						ОстатокМес = 12 - Стр_Рез_З_Отп.ДнейНаСреднеГод;
						ОстатокДней = Стр_Рез_З_Отп.КоличествоДней / 12 * ОстатокМес;
						
						З_ДнейПоРегНак = Новый Запрос;
						З_ДнейПоРегНак.Текст = "ВЫБРАТЬ 
						|СУММА(ОПТД.КоличествоДней) КАК Дней
						|ИЗ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ОПТД
						|ГДЕ
						|ОПТД.Сотрудник = &Сотрудник
						|И ОПТД.ВидОтпуска = &ВидОтпуска
						|И ОПТД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
						|И ОПТД.Период = &ДатаНачала
						|И ОПТД.ДатаОкончания = &ДатаОкончания";
						З_ДнейПоРегНак.УстановитьПараметр("Сотрудник", Сотрудник);
						З_ДнейПоРегНак.УстановитьПараметр("ВидОтпуска", Стр_Рез_З_Отп.ВидОтпуска);
						З_ДнейПоРегНак.УстановитьПараметр("ДатаНачала", Стр_Рез_З_Отп.РабочийГодС);
						З_ДнейПоРегНак.УстановитьПараметр("ДатаОкончания", Стр_Рез_З_Отп.РабочийГодПо);
						Рез_З_ДнейПоРегНак = З_ДнейПоРегНак.Выполнить().Выгрузить();
						ДнейПрихода = ?(Не ЗначениеЗаполнено(Рез_З_ДнейПоРегНак[0].Дней),0,Рез_З_ДнейПоРегНак[0].Дней);
						ДнейДляРасчета2 = 0;
						Если ДнейПрихода <> 0 Тогда
							ДнейДляРасчета1 = ДнейПрихода / 12 * Стр_Рез_З_Отп.ДнейНаСреднеГод;
							ДнейДляРасчета2 = ДнейДляРасчета1 + ОстатокДней;
						Иначе
							ДнейДляРасчета1 = Окр(Стр_Рез_З_Отп.КоличествоДней / 12 * ОстатокМес);
							ДнейДляРасчета2 = Стр_Рез_З_Отп.КоличествоДней - ДнейДляРасчета1;
						КонецЕсли;
						КорректировкаДней = Окр(ДнейДляРасчета2);
						
						КолвоЦиклов = ?(КорректировкаДней=0,1,2);
						Для А = 1 По КолвоЦиклов Цикл
							
							Стр_ТЗ_ВыборкаПоОтпускам = ТЗ_ВыборкаПоОтпускам.Добавить();
							Стр_ТЗ_ВыборкаПоОтпускам.РабочийГодС = Стр_Рез_З_Отп.РабочийГодС;
							Стр_ТЗ_ВыборкаПоОтпускам.РабочийГодПо = Стр_Рез_З_Отп.РабочийГодПо;
							Стр_ТЗ_ВыборкаПоОтпускам.ОшибкаНеверноеКоличествоДней = Ложь;
							Стр_ТЗ_ВыборкаПоОтпускам.НомерСтроки = Стр_Рез_З_Отп.НомерСтроки;
							Стр_ТЗ_ВыборкаПоОтпускам.КоличествоДней = ?(А=1,Стр_Рез_З_Отп.КоличествоДней,КорректировкаДней);
							Стр_ТЗ_ВыборкаПоОтпускам.ЗарегистрированноеКоличествоДней = Стр_Рез_З_Отп.КоличествоДней;
							Стр_ТЗ_ВыборкаПоОтпускам.ВидДвижения = ?(А=1,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
							Стр_ТЗ_ВыборкаПоОтпускам.Корректировка = ?(А=1,Ложь,Истина);
							Стр_ТЗ_ВыборкаПоОтпускам.ВидОтпуска = Стр_Рез_З_Отп.ВидОтпуска;
							
						КонецЦикла;
						
						
						
					КонецЦикла;
					
					Для Каждого Стр_ТЗ_ВыборкаПоОтпускам ИЗ ТЗ_ВыборкаПоОтпускам Цикл
						ПроверитьЗаполнениеОтпусков(Стр_ТЗ_ВыборкаПоОтпускам, Отказ, Заголовок);
						Если НЕ Отказ Тогда
							
							ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоДокументу, Стр_ТЗ_ВыборкаПоОтпускам);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;	
			//Аверсон 24.03.2023 КВВ СВФР-010537 )
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Аверсон ЕАЕ 08.04.2025 СВФР-015257
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		Если Не Отказ Тогда
			Если ОсновнойДоговор Тогда
				СотрудникОбъект = Сотрудник.ПолучитьОбъект();
				СотрудникОбъект.ТрудовойДоговор  = Ссылка;
				СотрудникОбъект.НомерДоговора    = НомерТД;
				СотрудникОбъект.ДатаДоговора     = ДатаТД;    
				СотрудникОбъект.ДатаНачала       = НачалоДоговора;
				СотрудникОбъект.ДатаОкончания    = ОкончаниеДоговора;
				СотрудникОбъект.ПроцентПовышения = ПроцентПоКонтракту;
				Попытка
					СотрудникОбъект.Записать();	
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-015257
	
	//Аверсон ЕАЕ 14.05.2025 СВФР-015666
	Если Не Отказ Тогда
		СотрудникОбъект = Сотрудник.ПолучитьОбъект();
		СотрудникОбъект.ВидДоговора = ВидТД;
		Попытка
			СотрудникОбъект.Записать();	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	//Аверсон СВФР-015666
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
		// Заполнение шапки
		ВидЗанятости = Основание.ВидЗанятости;
		ЗанимаемыхСтавок = Основание.ЗанимаемыхСтавок;
		Организация = Основание.Организация;
		Сотрудник = Основание.Сотрудник;
		ФизЛицо = Основание.ФизЛицо;
		Для Каждого ТекСтрокаОтпуска Из Основание.Отпуска Цикл
			НоваяСтрока = Отпуска.Добавить();
			НоваяСтрока.ВидОтпуска = ТекСтрокаОтпуска.ВидОтпуска;
			НоваяСтрока.КоличествоДней = ТекСтрокаОтпуска.КоличествоДней;
		КонецЦикла;
		Для Каждого ТекСтрокаПерсональныеНадбавки Из Основание.ПерсональныеНадбавки Цикл
			НоваяСтрока = ПерсональныеНадбавки.Добавить();
			НоваяСтрока.Валюта1 = ТекСтрокаПерсональныеНадбавки.Валюта1;
			НоваяСтрока.Валюта2 = ТекСтрокаПерсональныеНадбавки.Валюта2;
			НоваяСтрока.Валюта3 = ТекСтрокаПерсональныеНадбавки.Валюта3;
			НоваяСтрока.Валюта4 = ТекСтрокаПерсональныеНадбавки.Валюта4;
			НоваяСтрока.Валюта5 = ТекСтрокаПерсональныеНадбавки.Валюта5;
			НоваяСтрока.Валюта6 = ТекСтрокаПерсональныеНадбавки.Валюта6;
			НоваяСтрока.Надбавка = ТекСтрокаПерсональныеНадбавки.Надбавка;
			НоваяСтрока.Показатель1 = ТекСтрокаПерсональныеНадбавки.Показатель1;
			НоваяСтрока.Показатель2 = ТекСтрокаПерсональныеНадбавки.Показатель3;
			НоваяСтрока.Показатель3 = ТекСтрокаПерсональныеНадбавки.Показатель3;
			НоваяСтрока.Показатель4 = ТекСтрокаПерсональныеНадбавки.Показатель4;
			НоваяСтрока.Показатель5 = ТекСтрокаПерсональныеНадбавки.Показатель5;
			НоваяСтрока.Показатель6 = ТекСтрокаПерсональныеНадбавки.Показатель6;
			НоваяСтрока.ТарифныйРазряд1 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд1;
			НоваяСтрока.ТарифныйРазряд2 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд2;
			НоваяСтрока.ТарифныйРазряд3 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд3;
			НоваяСтрока.ТарифныйРазряд4 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд4;
			НоваяСтрока.ТарифныйРазряд5 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд5;
			НоваяСтрока.ТарифныйРазряд6 = ТекСтрокаПерсональныеНадбавки.ТарифныйРазряд6;
		КонецЦикла;
		
		//(начало) добавлено Кухарчуком Д.Я. 20.09.18, Задача СВФР-002169
		ВычислитьДатыНачалаОкончаниеДоговора();   //Аверсон 25.08.2021 КВВ СВФР-008031 (перенесено только под данное условие)
		//(конец) добавлено Кухарчуком Д.Я. 20.09.18, Задача СВФР-002169
		
		
		//Аверсон 18.05.2021 КВВ СВФР-007579 (
	ИначеЕсли ТипЗнч(Основание) = Тип("Структура") Тогда   
		Если Основание.Свойство("Сотрудник") Тогда
			Сотрудник = Основание.Сотрудник;
			ФизЛицо = Основание.Сотрудник.ФизЛицо;
			НомерТД = "б/н";
			//Аверсон 07.06.2021 КВВ СВФР-007579 (
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|Прием.ДатаПриема КАК ДатаДок,
			|Прием.Ссылка.ДатаПриказа КАК ДатаПриказа,        
			//Аверсон 25.08.2021 КВВ СВФР-008031 (
			|Прием.Ссылка.НомерД КАК НомерПриказа, 
			|Прием.ДатаПриема КАК ДатаДействия,
			//Аверсон 25.08.2021 КВВ СВФР-008031 )
			|Прием.Ссылка КАК Док
			|ПОМЕСТИТЬ ВтДоков
			|ИЗ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Прием
			|ГДЕ
			|Прием.Ссылка.Проведен
			|И Прием.Сотрудник = &Сотрудник
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|КП.ДатаНачала КАК ДатаДок,
			|КП.Ссылка.ДатаПриказа КАК ДатаПриказа,     
			//Аверсон 25.08.2021 КВВ СВФР-008031 (
			|КП.Ссылка.НомерПриказа КАК НомерПриказа,
			|КП.ДатаНачала КАК ДатаДействия,
			//Аверсон 25.08.2021 КВВ СВФР-008031 )
			|КП.Ссылка КАК Док
			|
			|ИЗ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КП
			|ГДЕ
			|КП.Ссылка.Проведен
			|И КП.Сотрудник = &Сотрудник
			|;
			|
			|ВЫБРАТЬ * 
			|ИЗ ВтДоков КАК ВтДоков
			|УПОРЯДОЧИТЬ ПО 
			|ВтДоков.ДатаДок УБЫВ";
			З.УстановитьПараметр("Сотрудник",Основание.Сотрудник);
			РезЗ = З.Выполнить().Выгрузить();
			Если РезЗ.Количество() > 0 Тогда
				ДатаТД = РезЗ[0].ДатаПриказа;
				ДатаПриказа = РезЗ[0].ДатаПриказа;    
				//Аверсон 25.08.2021 КВВ СВФР-008031 (
				НомерПриказа = РезЗ[0].НомерПриказа; 
				НачалоДоговора = РезЗ[0].ДатаДействия; 
				ОкончаниеДоговора = Дата(1,1,1,0,0,0);
				Орг = Организация;
				Если НЕ ЗначениеЗаполнено(Орг) Тогда
					Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
				КонецЕсли;
				Если Орг.ИНН = "700067572" И Отпуска.Количество() = 0
					И ТипЗнч(РезЗ[0].Док) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
					НовСтрОтп = Отпуска.Добавить();
					НовСтрОтп.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск;
					НовСтрОтп.КоличествоДней = 24;
					НовСтрОтп.РабочийГодС = НачалоДоговора;
					НовСтрОтп.РабочийГодПо = ДобавитьМесяц(НовСтрОтп.РабочийГодС,12)-1; 
					
					
					НовСтрОтп = Отпуска.Добавить();
					НовСтрОтп.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт;
					НовСтрОтп.КоличествоДней = 1;
					НовСтрОтп.РабочийГодС = НачалоДоговора;
					НовСтрОтп.РабочийГодПо = ДобавитьМесяц(НовСтрОтп.РабочийГодС,12)-1;
				КонецЕсли;
				//Аверсон 25.08.2021 КВВ СВФР-008031 )
			КонецЕсли;
			
			//Аверсон 07.06.2021 КВВ СВФР-007579 )
		КонецЕсли;
		//Аверсон 18.05.2021 КВВ СВФР-007579 )
	КонецЕсли;
	
	
КонецПроцедуры

//(начало) добавлено Кухарчуком Д.Я. 20.09.18, Задача СВФР-002169
//Вычисляет реквизиты Дата, ДатаПриказа, НачалоДоговора, ОкончаниеДоговора
Процедура ВычислитьДатыНачалаОкончаниеДоговора()
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТрудовойДоговор.НачалоДоговора КАК НачалоДоговора,
	|	ТрудовойДоговор.ОкончаниеДоговора
	|ИЗ
	|	Документ.ТрудовойДоговор КАК ТрудовойДоговор
	|ГДЕ
	|	ТрудовойДоговор.Сотрудник = &Сотрудник
	|	И ТрудовойДоговор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДоговора УБЫВ";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	ВыборкаПоследнийДоговор = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаПоследнийДоговор.Следующий() Тогда
		НачалоДоговора = КонецДня( ВыборкаПоследнийДоговор.ОкончаниеДоговора ) + 1;
		ОкончаниеДоговора = НачалоДоговора 
		+ ( ВыборкаПоследнийДоговор.ОкончаниеДоговора - ВыборкаПоследнийДоговор.НачалоДоговора );
		Дата = НачалоДня( НачалоДоговора - 1 );
		ДатаПриказа = Дата;
	КонецЕсли;
	
КонецПроцедуры
//(конец) добавлено Кухарчуком Д.Я. 20.09.18, Задача СВФР-002169


//+ СВЭЙ 12.03.19 КДЯ СВФР-004043
//процедура перенесена из модуля формы документа
Процедура РассчитатьОклад( РассчитатьКоэф, РассчитатьПовышения ) Экспорт
	
	Если РазмерСтавки1Разряда <> 0  И НЕ БезЕТС тогда
		
		
		Если РассчитатьКоэф тогда
			ПовышенныйКоэффициентЕТС = 1;
			Для Каждого СтрокаКоэффициентов из КоэфПовышенияТО Цикл
				ПовышенныйКоэффициентЕТС = ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер;
			КонецЦикла;
		КонецЕсли;
		
		Если  ПовышенныйКоэффициентЕТС = 0 тогда
			ПовышенныйКоэффициентЕТС = 1;
		КонецЕсли;
		
		Если Организация.ИНН = "100074549" Тогда //О.Т. Аверсон 11.02.2016 № 861
			Коэффициент = Окр(ПовышенныйКоэффициентЕТС*КоэффициентЕТС,2);
		иначе
			Коэффициент = ПовышенныйКоэффициентЕТС*КоэффициентЕТС;
		КонецЕсли;
		
		//Аверсон 28.02.2020 КВВ СВФР-005596 (
		Если Организация.ИНН = "806000046" И ЗанимаемыхСтавок < 1 Тогда
			Тариф = Окр(Коэффициент * РазмерСтавки1Разряда,2)* ЗанимаемыхСтавок;
		Иначе
			//Аверсон 28.02.2020 КВВ СВФР-005596 )
			Тариф = ОбщегоНазначения.ОкруглитьПоВалюте(Коэффициент * РазмерСтавки1Разряда * ЗанимаемыхСтавок, Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 29.03.2019 № 4154
		КонецЕсли;
		
		ТарифнаяСтавка = Тариф;
		ТарифБезСтавки  = Окр(Коэффициент * РазмерСтавки1Разряда,2);
		
		СуммаПовышения = 0;//О.Т. Аверсон 12.03.2019 № 3151								
		Если РассчитатьПовышения  тогда
			
			ПовышенияПоИнструкции.Очистить();
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
			|	ПовышенияПоИнструкцииСрезПоследних.Размер,
			|	ПовышенияПоИнструкцииСрезПоследних.Действие
			|ИЗ
			|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ПовышенияПоИнструкцииСрезПоследних
			|ГДЕ
			|	ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
			
			Запрос.УстановитьПараметр("Дата", ?( ЗначениеЗаполнено( НачалоДоговора ), НачалоДоговора, Дата ) );
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтрПовышенияПоИнструкции = ПовышенияПоИнструкции.Добавить();
				СтрПовышенияПоИнструкции.Коэффициент = ВыборкаДетальныеЗаписи.Коэффициент;
				СтрПовышенияПоИнструкции.Размер = ВыборкаДетальныеЗаписи.Размер;
				СуммаПовышения = СуммаПовышения + Окр(ТарифБезСтавки * ЗанимаемыхСтавок *ВыборкаДетальныеЗаписи.Размер/100,2); //О.Т. Аверсон 12.03.2019 № 3151 каждый процент округляется
			КонецЦикла;
			
			ИтоговоеПовышениеПоИнструкции = 0;
			Для Каждого СтрокаПроцентов из ПовышенияПоИнструкции Цикл
				ИтоговоеПовышениеПоИнструкции = ИтоговоеПовышениеПоИнструкции+СтрокаПроцентов.Размер;
			КонецЦикла;
		КонецЕсли;
		
		//ТарифПоИнструкции = ТарифнаяСтавка + ТарифнаяСтавка * ИтоговоеПовышениеПоИнструкции / 100; //О.Т. Аверсон 12.03.2019 № 3151
		ТарифПоИнструкции = ТарифнаяСтавка + СуммаПовышения; //О.Т. Аверсон 12.03.2019 № 3151
		ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьПоВалюте( ТарифПоИнструкции, Константы.ВалютаРегламентированногоУчета.Получить() );
		//ПСА 18.10.2021 СВФР-008226 +++
		//Если Организация.ИНН = "806000046" Тогда 
		//	ТарифныйПоКонтракту = ТарифныйСПовышениемПоИнструкции + ТарифнаяСтавка * ПроцентПоКонтракту/100;
		//иначе          			
		//	ТарифныйПоКонтракту = ТарифПоИнструкции * (100+ПроцентПоКонтракту)/100;//О.Т. Аверсон 28.10.2015
		//КонецЕсли;
		ТарифныйПоКонтракту = ТарифныйСПовышениемПоИнструкции + ТарифнаяСтавка * ПроцентПоКонтракту/100;
		//+++ ПСА 18.10.2021 СВФР-008226
		РасчетнаяТарифнаяСтавка =   ОбщегоНазначения.ОкруглитьПоВалюте( ТарифныйПоКонтракту, Константы.ВалютаРегламентированногоУчета.Получить() );
		
		
	Иначе
		
		Если БезЕТС Тогда
			//Аверсон 24.02.2020 КВВ СВФР-005568 (
			Если Организация.НеУчитыватьЕТКС Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ПроцентПоКонтракту,
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка,
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции,
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Период
				|ИЗ	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних( &Дата, Сотрудник = &Сотрудник
				|			) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних";  
				Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(НачалоДоговора),НачалоДоговора,Дата));
				Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
				Рез = Запрос.Выполнить().Выбрать();
				
				ПроцентПоКонтракту = 0;	ТарифнаяСтавка = 0;  ТарифныйСПовышениемПоИнструкции = 0; РасчетнаяТарифнаяСтавка = 0;
				
				Пока Рез.Следующий() Цикл
					Если Рез.ПроцентПоКонтракту > 0 Тогда
						Если Рез.ПроцентПоКонтракту > 50 Тогда
							Сообщить( "Процент по контракту превышает допустимое значение 50!!!", СтатусСообщения.Важное );
							Продолжить;
						Иначе	
							ПроцентПоКонтракту = Рез.ПроцентПоКонтракту;  
						КонецЕсли;
					КонецЕсли;
					ТарифнаяСтавка = Рез.ТарифнаяСтавка;
					ТарифныйСПовышениемПоИнструкции = Рез.ТарифнаяСПовышениемПоИнструкции;
					РасчетнаяТарифнаяСтавка = Рез.Ставка;
				КонецЦикла; 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ 
				|ПланНач.Показатель1,
				|ПланНач.ВидРасчета
				|ИЗ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних( &Дата, Сотрудник = &Сотрудник) КАК ПланНач
				|ГДЕ ПланНач.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|И НЕ ПланНач.ВидРасчета В (&СписокВР)";
				Запрос.УстановитьПараметр("Дата",?(ЗначениеЗаполнено(НачалоДоговора),НачалоДоговора,Дата));
				Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
				СписокВР = Новый СписокЗначений;
				СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
				СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
				СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
				Если ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация) Тогда
					ПустаяСс = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
					Если ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням.СпособНачисленияКонтракта <> ПустаяСс Тогда
						СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням.СпособНачисленияКонтракта);
					Иначе
						Если ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам.СпособНачисленияКонтракта <> ПустаяСс Тогда
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам.СпособНачисленияКонтракта);
						Иначе
							Если ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой.СпособНачисленияКонтракта <> ПустаяСс Тогда
								СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой.СпособНачисленияКонтракта);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Запрос.УстановитьПараметр("СписокВР",СписокВР);
				ПерсональныеНадбавки.Очистить();
				Рез = Запрос.Выполнить().Выбрать();
				Пока Рез.Следующий() Цикл
					НоваяСтрокаПН = ПерсональныеНадбавки.Добавить();
					НоваяСтрокаПН.Надбавка = Рез.ВидРасчета;
					НоваяСтрокаПН.Показатель1 = Рез.Показатель1;
				КонецЦикла;
				
				//Аверсон 13.03.2020 КВВ СВФР-005679 (
				Если РассчитатьПовышения  тогда
					ПовышенияПоИнструкции.Очистить();
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	 ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
					|	 ПовышенияПоИнструкцииСрезПоследних.Размер,
					|	 ПовышенияПоИнструкцииСрезПоследних.Действие
					|ИЗ  РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ПовышенияПоИнструкцииСрезПоследних
					|ГДЕ ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";					
					Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(НачалоДоговора), НачалоДоговора, Дата));
					Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
					РезультатЗапроса = Запрос.Выполнить();
					Рез = РезультатЗапроса.Выбрать();
					Пока Рез.Следующий() Цикл
						СтрПовышенияПоИнструкции = ПовышенияПоИнструкции.Добавить();
						СтрПовышенияПоИнструкции.Коэффициент = Рез.Коэффициент;
						СтрПовышенияПоИнструкции.Размер = Рез.Размер;
					КонецЦикла;
				КонецЕсли;
				//Аверсон 13.03.2020 КВВ СВФР-005679 )
				
			Иначе		
				//Аверсон 24.02.2020 КВВ СВФР-005568 )
				КоэффициентЕТС = 0;
				РазрядЕТС = "";
				ПроцентПоКонтракту = 0;
				ТарифныйСПовышениемПоИнструкции = 0;
				ТарифнаяСтавка = 0;
				ИтоговоеПовышениеПоИнструкции = 0;
				ПовышенныйКоэффициентЕТС = 0;
				РазмерСтавки1Разряда = 0;
				ТарифнаяСтавкаПервогоРазряда = Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка();
				КоэфПовышенияТО.Очистить();
				ПовышенияПоИнструкции.Очистить();
			КонецЕсли;
		Иначе
			Сообщить("Невозможно рассчитать месячный тариф по ЕТС. Не введен параметр Ставка 1 разряда по Организации");
		КонецЕсли;
		
	КонецЕсли; // РазмерСтавки1Разряда <> 0  И НЕ БезЕТС
	
	
КонецПроцедуры


Процедура ЗаполнитьПоказателиОсновнойОплатыСотрудника() Экспорт
	
	Если НЕ ЗначениеЗаполнено( Сотрудник ) Тогда
		Возврат;	
	КонецЕсли; 
	
	ФизЛицо =  Сотрудник.ФизЛицо;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ПроцентПоКонтракту,
	|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних( &Дата, Сотрудник = &Сотрудник
	|			) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
	|";  
	Запрос.УстановитьПараметр( "Дата", ?( ЗначениеЗаполнено( НачалоДоговора ), НачалоДоговора, Дата ) );
	Запрос.УстановитьПараметр( "Сотрудник", Сотрудник );
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ПроцентПоКонтракту = 0;				
	ПовышенияПроцентовПоКонтракту.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ПроцентПоКонтракту > 0 Тогда
			
			Если ВыборкаДетальныеЗаписи.ПроцентПоКонтракту > 50 Тогда
				Сообщить( "Процент по контракту превышает допустимое значение 50!!!", СтатусСообщения.Важное );
				Продолжить;
			Иначе	
				ПроцентПоКонтракту = ВыборкаДетальныеЗаписи.ПроцентПоКонтракту;
			КонецЕсли;
			
			СтрПовыш = ПовышенияПроцентовПоКонтракту.Добавить();
			СтрПовыш.СДаты = ?( ЗначениеЗаполнено( НачалоДоговора ), НачалоДоговора, Дата );
			СтрПовыш.ПроцентПоКонтракту = ВыборкаДетальныеЗаписи.ПроцентПоКонтракту;
			СтрПовыш.ДатаПриказа = ДатаПриказа;
			СтрПовыш.НомерПриказа = НомерПриказа;
			
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы,
	|	РаботникиОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
	|	ISNULL( ТарифныеСтавкиПервогоРазряда.Размер, 0 ) КАК РазмерСтавки1Разряда,
	|	РаботникиОрганизацийСрезПоследних.РазрядЕТС,
	|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаПриема,
	|	РаботникиОрганизацийСрезПоследних.УсловияТрудаИзмерение КАК УсловияТруда,
	|	РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних( &Дата, Сотрудник = &Сотрудник И Организация = &Организация ) КАК РаботникиОрганизацийСрезПоследних
	|	ЛЕВОЕ СОЕДИНЕНИЕ		    	
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних( &Дата, Организация = &Организация) КАК ТарифныеСтавкиПервогоРазряда
	|	ПО		    	
	|		РаботникиОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда = ТарифныеСтавкиПервогоРазряда.ТарифнаяСтавка			
	|";
	
	Запрос.УстановитьПараметр( "Дата", ?( ЗначениеЗаполнено( НачалоДоговора ), НачалоДоговора, Дата ) );
	Запрос.УстановитьПараметр( "Сотрудник", Сотрудник );
	Запрос.УстановитьПараметр( "Организация", Организация );
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств( ЭтотОбъект, Выборка );
		
		Если ЗначениеЗаполнено( РазрядЕТС ) Тогда 
			ВыбранныйРазряд = СокрЛП( РазрядЕТС );
			
			Для каждого СтрокаРазряда из Должность.СтрокаЕТС.Коэффициенты цикл
				Если СтрокаРазряда.Разряд = ВыбранныйРазряд тогда
					КоэффициентЕТС = СтрокаРазряда.Коэффициент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		РассчитатьОклад( Ложь, Истина );
		
	КонецЦикла;
	
КонецПроцедуры
//- СВЭЙ 12.03.19 КДЯ СВФР-004043




