Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки          Экспорт;
Перем ЭтоРасшифровка       Экспорт;

Перем Выслуга Экспорт;

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = истина,ВыводитьПоСтраницам = ложь) Экспорт
	
	//О.Т. Аверсон 08.11.2018 № 2753
	Если РольДоступна("ЗапретИзмененияОтбораПодразделения") Тогда 
		СписокЭлементов = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		Для каждого Элемент из СписокЭлементов Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				//О.Т. Аверсон 12.04.2018 № 1824
				Если Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации") Тогда
					мПодразделениеОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
					Если ЗначениеЗаполнено(мПодразделениеОрганизации) Тогда 
						Элемент.ПравоеЗначение = мПодразделениеОрганизации;
						Элемент.Использование = Истина;
						Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;					
					КонецЕсли;
				КонецЕсли;
				//О.Т. Аверсон 12.04.2018 № 1824
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//О.Т. Аверсон 08.11.2018 № 2753
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Если ДанныеРасшифровки = Неопределено тогда
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КонецЕсли;
	
	// Получить настройки схемы компоновки данных
	Настройки = КомпоновщикНастроек.Настройки;
	Выслуга.Очистить();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если Организация.ДенежноеДовольствие Тогда 
		ФизЛицо = Неопределено;
		Для Каждого стрОтбор из Настройки.Отбор.Элементы Цикл 
			Если Строка(стрОтбор.ЛевоеЗначение) = "ФизЛицо" Тогда 
				Если стрОтбор.Использование = истина Тогда 
					ФизЛицо = стрОтбор.ПравоеЗначение;
					ВидСравненияСотр = стрОтбор.ВидСравнения; 
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ДатаКалендаря КАК Период,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Организация
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодКон, ) КАК РаботникиОрганизацийСрезПоследних,
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК ДатаКалендаря
		|	ИЗ
		|		РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|	ГДЕ
		|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ПериодНач И &ПериодКон
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)) КАК ВложенныйЗапрос";

		
		Если не ФизЛицо = Неопределено Тогда
			Если ВидСравненияСотр = ВидСравненияКомпоновкиДанных.Равно Тогда 
				Запрос.Текст = Запрос.Текст + " ГДЕ РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо = &ФизЛицо ";
			ИначеЕсли ВидСравненияСотр = ВидСравненияКомпоновкиДанных.НеРавно Тогда
				Запрос.Текст = Запрос.Текст + " ГДЕ РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо <> &ФизЛицо ";
			ИначеЕсли ВидСравненияСотр = ВидСравненияКомпоновкиДанных.ВСписке Тогда
				Запрос.Текст = Запрос.Текст + " ГДЕ РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо В (&ФизЛицо) ";
			ИначеЕсли ВидСравненияСотр = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
				Запрос.Текст = Запрос.Текст + " ГДЕ не РаботникиОрганизацийСрезПоследних.Сотрудник.ФизЛицо В (&ФизЛицо) ";
	
			КонецЕсли;
		КонецЕсли;


		
		Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(КонПериода));
		Запрос.УстановитьПараметр("ПериодНач", НачПериода);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);

		
		РезультатЗапросаСотр = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапросаСотр.Следующий() Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
			
			Запрос.УстановитьПараметр("Сотрудник", РезультатЗапросаСотр.Сотрудник);
			Запрос.УстановитьПараметр("Период", КонецМесяца(КонПериода));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ДатаОтсчета = Дата(1,1,1);
				Для Каждого стр из РезультатЗапросаСотр.Сотрудник.Физлицо.Стажи Цикл 
					Если стр.ВидСтажа = Справочники.ВидыСтажа.ОбщийСтаж Тогда 
						ДатаОтсчета = стр.ДатаОтсчета;
					КонецЕсли;
				КонецЦикла;
				Если ДатаОтсчета = Дата(1,1,1) Тогда 
					ДатаОтсчета = ВыборкаДетальныеЗаписи.Период;
				КонецЕсли;
				
				
				Если НачалоМесяца(ВыборкаДетальныеЗаписи.Период) = НачалоМесяца(РезультатЗапросаСотр.Период) Тогда 
					Лет = 0;
					Месяцев = 0;
					Дней = 0;
					ОбщегоНазначения.РазобратьРазностьДат(ВыборкаДетальныеЗаписи.Период,ДатаОтсчета,Лет,Месяцев,Дней);
					НадписьЛет = " г,";
										
					НадписьМес = " м,";
					 					
					НадписьДни = " д";
					
					
					
					
					//Лет = ?(Лет =0,"",Лет);
					//Месяцев = ?(Месяцев =0,"",Месяцев);
					//Дней = ?(Дней =0,"",Дней);
					
					ЗначениеВыслуга = Строка(Лет) + НадписьЛет + Строка(Месяцев) + НадписьМес + Строка(Дней) + НадписьДни;
					
				иначе
					
					Лет = 0;
					Месяцев = 0;
					Дней = 0;
					ОбщегоНазначения.РазобратьРазностьДат(НачалоМесяца(РезультатЗапросаСотр.Период),ДатаОтсчета,Лет,Месяцев,Дней);
					НадписьЛет = " г,";
										
					НадписьМес = " м,";
					 					
					НадписьДни = " д";
					
					
					
					//Лет = ?(Лет =0,"",Лет);
					//Месяцев = ?(Месяцев =0,"",Месяцев);
					//Дней = ?(Дней =0,"",Дней);
					
					ЗначениеВыслуга = Строка(Лет) + НадписьЛет + Строка(Месяцев) + НадписьМес + Строка(Дней) + НадписьДни;
					
				КонецЕсли;
				СтрВыслуга = Выслуга.Добавить();
				СтрВыслуга.ФизЛицо = РезультатЗапросаСотр.Сотрудник.ФизЛицо;
				СтрВыслуга.ПериодРегистрации = РезультатЗапросаСотр.Период;
				СтрВыслуга.Организация = РезультатЗапросаСотр.Организация;
				СтрВыслуга.ВидДвижения = "Выслуга";
				СтрВыслуга.ВидДвижения2 = "Выслуга";
				СтрВыслуга.Выслуга = ЗначениеВыслуга; 
			КонецЦикла;
			
			
		КонецЦикла;
	КонецЕсли;
	
	

	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Выслуга", Выслуга);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// создадим и инициализируем процессор компоновки данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	Результат.Очистить();
	
	
	
	// выведем отчет в табличный документ "Результат"
	ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновки, Результат, ВыводитьПоСтраницам);

	
	
	//ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета);
	
	РазбитьТабличныйДокументПоСтраницам(Результат);
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;//Островская Татьяна 31.01.2014 № 17052
	Результат.АвтоМасштаб = Истина; //Островская Татьяна 31.01.2014 № 17052
КонецФункции

Процедура ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновкиДанных, ТабличныйДокумент, ВыводитьПоСтраницам) Экспорт
	
	// Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);

	// Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	Состояние(НСТР("ru='Если Вы хотите прервать вывод отчета, нажмите Ctrl+Break'"));

	// Основной цикл вывода отчета
	Счетчик = 0;
	Пока Истина Цикл
		
		
		// Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		
		// Получим следующий элемент результата компоновки
		Если ЭлементРезультата = Неопределено Тогда
			
			// Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
			
		Иначе
			
			// Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
	Если ВыводитьПоСтраницам тогда
		РазбитьТабличныйДокументПоСтраницам(ТабличныйДокумент);
	КонецЕсли
	
КонецПроцедуры


// Разбивает табличный документ по страницам
//
// Параметры:
//  ТабличныйДокумент - ссылка на табличный документ.
//
Процедура РазбитьТабличныйДокументПоСтраницам(ТабличныйДокумент)
	#Если Клиент Тогда
	Состояние(НСТР("ru='Разделение отчета по страницам ...  (Если вы хотите прервать вывод отчета, нажмите Ctrl+Break)'"));
	
	Для сч = 0 по 10 Цикл
		ОбластьКолонкиРЛ                  = ТабличныйДокумент.Область(, сч+1, , сч+1);
		ОбластьКолонкиРЛ.ШиринаКолонки    = 9;
		ОбластьКолонкиРЛ.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
	КонецЦикла;
	ОбластьКолонкиРЛ                  = ТабличныйДокумент.Область(, 4, , 4);
	ОбластьКолонкиРЛ.ШиринаКолонки    = 9;
	ОбластьКолонкиРЛ.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьКолонкиРЛ                  = ТабличныйДокумент.Область(, 2, , 2);
	ОбластьКолонкиРЛ.ШиринаКолонки    = 9.9;
	//ОбластьКолонкиРЛ.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьКолонкиРЛ                  = ТабличныйДокумент.Область(, 3, , 3);
	ОбластьКолонкиРЛ.ШиринаКолонки    = 9.9;
	//ОбластьКолонкиРЛ.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;

	//ТабличныйДокументДляПроверки.АвтоМасштаб = Истина;

	
	ОбластьПервойЯчейки = ТабличныйДокумент.НайтиТекст(" ИЗВЕЩЕНИЕ");
	
	Если ОбластьПервойЯчейки = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	НомерСтрокиНачалаРЛ = ОбластьПервойЯчейки.Верх;
	
	НомерСтрокиКонцаРЛ     = НомерСтрокиНачалаРЛ + 62;
	
	ОбластьСлед = ТабличныйДокумент.Область(НомерСтрокиКонцаРЛ, , НомерСтрокиКонцаРЛ, );
	ОбластьПервойЯчейки = ТабличныйДокумент.НайтиТекст(" ИЗВЕЩЕНИЕ", ОбластьСлед);
	
	//Пока ОбластьПервойЯчейки <> Неопределено Цикл
	//	НомерСтрокиНачалаРЛ = ОбластьПервойЯчейки.Верх;
	//	НомерСтрокиКонцаРЛ  = НомерСтрокиНачалаРЛ + 62;
	//	ОбластьРазделителя  = ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ - 5, , НомерСтрокиНачалаРЛ - 5, );
	//	ОбластьРазделителя.НачалоСтраницы = истина;
	//	ОбластьСлед         = ТабличныйДокумент.Область(НомерСтрокиКонцаРЛ, , НомерСтрокиКонцаРЛ, );
	//	ОбластьПервойЯчейки = ТабличныйДокумент.НайтиТекст(" ИЗВЕЩЕНИЕ", ОбластьСлед);
	//	
	//	ОбработкаПрерыванияПользователя();
	//	
	//КонецЦикла;
	#КонецЕсли
КонецПроцедуры


// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТекстТекущейДаты"));
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметра.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
	
КонецПроцедуры

Выслуга = Новый ТаблицаЗначений();
Выслуга.Колонки.Добавить("ФизЛицо");
Выслуга.Колонки.Добавить("ПериодРегистрации");
Выслуга.Колонки.Добавить("Организация");
Выслуга.Колонки.Добавить("ВидДвижения");
Выслуга.Колонки.Добавить("ВидДвижения2");
Выслуга.Колонки.Добавить("Выслуга");
