////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает дату начала события
//
Функция ПолучитьДатуНачалаСобытия() Экспорт
	
	//Возврат ?(ДатаНачалаОсновногоОтпуска = '00010101', ?(ДатаНачалаДополнительногоОтпуска = '00010101',Дата,ДатаНачалаДополнительногоОтпуска), ДатаНачалаОсновногоОтпуска);
	Возврат ?(ЗначениеЗаполнено(ДатаНачалаВыборки),ДобавитьМесяц(НачалоМесяца(ДатаНачалаВыборки),ВидРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка),ПериодРегистрации); //О.Т. 15.07.2014 № 122 только период регистрации
КонецФункции // ПолучитьДатуНачалаСобытия()

// Заполняет документ по перерассчитываемому документу
// ИсходныйДокумент - тип ДокументОбъект.НачислениеОтпускаРаботникамОрганизаций
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,"Проведен, Дата, Номер, ПометкаУдаления, ПериодРегистрации, Комментарий, Ответственный, ПерерассчитываемыйДокумент, РезультатКомпенсацииОтпуска, СторноРезультатКомпенсацииОтпуска,НачислятьМатериальнуюПомощь,МатериальнаяПомощьДокумент");
	
КонецПроцедуры // ЗаполнитьПоПерерассчитываемомуДокументу()

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати
//	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Т60", "Расчет среднего заработка");
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

//заявка №2093 (база заявок Кристалла) Дмитрук О.Г.

//Аверсон 28.04.2023 КВВ СВФР-010738 (закомментировано, перенесено в ПроведениеРасчетов) (
//Функция СформироватьДанныеПоГрРасчетов(БазовыйПериодНачало, БазовыйПериодКонец)
//	//Аверсон 03.01.2023 КВВ СВФР-010061 (
//	ВозвратЗначения = Ложь;
//	Если Организация.НормаВОтпускахПоГрРасчетов = Истина
//		И ЗначениеЗаполнено(Организация.ГруппаРасчета) Тогда
//		
//		СпЗнВидыВремени = Новый СписокЗначений;
//		Для Каждого Стр из Организация.ГруппаРасчета.КлассификаторИспользованияРВ Цикл 
//			СпЗнВидыВремени.Добавить(Стр.ВидКлассификатора);
//		КонецЦикла;
//		
//		Если СпЗнВидыВремени.Количество() > 0 Тогда				
//			Запрос = Новый Запрос;
//			
//			Запрос.Текст = "ВЫБРАТЬ
//			|СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
//			|СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней
//			|ИЗ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
//			|ГДЕ
//			|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В (&СпЗнВидыВремени) 
//			|	И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ &НачПериод И &КонПериод
//			|	И РабочееВремяРаботниковОрганизаций.Организация = &Организация
//			|	И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник";
//			
//			Запрос.УстановитьПараметр("НачПериод", БазовыйПериодНачало);
//			Запрос.УстановитьПараметр("КонПериод", БазовыйПериодКонец);
//			Запрос.УстановитьПараметр("Организация", Организация);
//			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
//			Запрос.УстановитьПараметр("СпЗнВидыВремени",СпЗнВидыВремени);
//			Рез = Запрос.Выполнить().Выгрузить();
//			Если Рез.Количество() > 0 Тогда
//				Если (ЗначениеЗаполнено(Рез[0].Часов) И Рез[0].Часов > 0) ИЛИ (ЗначениеЗаполнено(Рез[0].Дней) И Рез[0].Дней > 0) Тогда
//					ВозвратЗначения = Истина;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;	
//	Возврат ВозвратЗначения;	
//	//Аверсон 03.01.2023 КВВ СВФР-010061 )
//КонецФункции
//Аверсон 28.04.2023 КВВ СВФР-010738 (закомментировано, перенесено в ПроведениеРасчетов) )

//Возвращает данные по БЛ за данный период
//
Функция СформироватьДанныеПоБЛ(БазовыйПериодНачало, БазовыйПериодКонец)
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1,
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту
	|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачПериод И &КонПериод
	|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|	И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1";
	
	Запрос.УстановитьПараметр("НачПериод", БазовыйПериодНачало);
	Запрос.УстановитьПараметр("КонПериод", БазовыйПериодКонец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Процедура ПроверкаРасчетаСреднегоЗаработка() Экспорт
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СУММА(НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Результат) КАК Сумма,
	|	КОЛИЧЕСТВО(НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Включать) КАК КолМесяцев
	|ИЗ
	|	Документ.НачислениеОтпускаРаботникамОрганизаций.РасчетСреднегоПоКалендарным КАК НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным
	|ГДЕ
	|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Включать
	|	И НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СреднемесячнаяЗП = 0; 
	
	мСтрокаН = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', Сотрудник, 0,Организация);//О.Т. Аверсон 16.10.2017 № 1120
	
	Если Результат.Количество() > 0 Тогда
		если не Результат[0].КолМесяцев = 0 Тогда //Островская Татьяна 18.09.2013 № 16778
			СреднемесячнаяЗП = ОбщегоНазначения.ОкруглитьЗначение2016(Результат[0].Сумма / Результат[0].КолМесяцев,ПериодРегистрации);//О.Т. Аверсон 15.03.2016 № 949
			
			Для Каждого ТекСтрока из РасчетСреднегоПоКалендарным Цикл
				
				//проверку на дату приема
				//О.Т. Аверсон 02.11.2017 № 1191
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ВложенныйЗапрос.ДатаПриема,
				|	ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаКалендаря, ГОД, -(&ГодВыборки - ГОД(ВложенныйЗапрос.ДатаПриема))) КАК РабочаяДатаПриема
				|ИЗ
				|	(ВЫБРАТЬ
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
				|		МИНИМУМ(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ДатаКалендаря
				|	ИЗ
				|		Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
				|			ПО (ДОБАВИТЬКДАТЕ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема, ГОД, &ГодВыборки - ГОД(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема)) >= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
				|				И (НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема, ГОД, &ГодВыборки - ГОД(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема)), МЕСЯЦ) = НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ))
				|	ГДЕ
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник = &ФизЛицо
				|		И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема) КАК ВложенныйЗапрос";
				
				Запрос.УстановитьПараметр("ФизЛицо", Сотрудник);
				Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
				Запрос.УстановитьПараметр("ГодВыборки", Год(ТекСтрока.МесяцВыборки));
				РезПрием = Запрос.Выполнить().Выбрать();
				ДатаПриема = Дата(1,1,1);
				ДатаРабДняВыборки = Дата(1,1,1);
				Если РезПрием.Следующий() Тогда 
					ДатаПриема = РезПрием.ДатаПриема;
					ДатаРабДняВыборки = РезПрием.РабочаяДатаПриема;
				КонецЕсли;
				
				//О.Т. Аверсон 02.11.2017 № 1191
				
				Если НачалоМесяца(ТекСтрока.МесяцВыборки) = НачалоМесяца(мСтрокаН.Период) Тогда
					Если ДатаПриема > ДатаРабДняВыборки Тогда
						ТекСтрока.Включать = Ложь;
						Сообщить("Месяц выборки " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " исключается из расчета среднего заработка, т.к. работник принят на работу " + Формат(мСтрокаН.Период, "ДЛФ=D"));
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				//проверка на дату вольнения
				мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(КонецМесяца(ТекСтрока.МесяцВыборки), Сотрудник, 1,Организация);//О.Т. Аверсон 16.10.2017 № 1120
				Если ТипЗнч(мСтрока.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
					Если мСтрока.Период < КонецМесяца(ТекСтрока.МесяцВыборки) Тогда
						ТекСтрока.Включать = Ложь;
						Сообщить("Месяц выборки " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " исключается из расчета среднего заработка, т.к. работник уволен " + Формат(мСтрока.Период, "ДЛФ=D"));
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				если не Организация.НормаВОтпускахПоГрРасчетов Тогда //О.Т. 09.09.2014 № 17567
					//проверка на больничные листы
					Если ТекСтрока.Включать Тогда 
						//Островская Татьяна 03.12.2013 № 16960
						если ТекСтрока.ОтработаноЧасов < ТекСтрока.НормаЧасов Тогда 
							ТекСтрока.Включать = Ложь;
							Сообщить("Норма времени по " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " не совпадает с отработанным!");
						КонецЕсли;					
						//Островская Татьяна 03.12.2013 № 16960
						
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				//Аверсон 28.04.2023 КВВ СВФР-010738 (закомментировано, перенесено в ПроведениеРасчетов) (
				////Аверсон 03.01.2023 КВВ СВФР-010061 (
				//ПроверкаНаВРВГруппеРасчетов = СформироватьДанныеПоГрРасчетов(НачалоМесяца(ТекСтрока.МесяцВыборки), КонецМесяца(ТекСтрока.МесяцВыборки));
				//Если ПроверкаНаВРВГруппеРасчетов Тогда
				//	ТекСтрока.Включать = Ложь;
				//	Сообщить("Месяц выборки " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " исключается из расчета среднего заработка, т.к. есть виды времени, включенные в группу расчетов """ + СокрЛП(Организация.ГруппаРасчета) + """");
				//	Продолжить;
				//КонецЕсли;
				////Аверсон 03.01.2023 КВВ СВФР-010061 )
				//Аверсон 28.04.2023 КВВ СВФР-010738 (закомментировано, перенесено в ПроведениеРасчетов) )
				
				ВыборкаБЛ = СформироватьДанныеПоБЛ(НачалоМесяца(ТекСтрока.МесяцВыборки), КонецМесяца(ТекСтрока.БазовыйПериодКонец));
				//О.Т. 26.08.2014 № 17551 Проверка убрана с даты
				если Дата < Дата(2014,7,25) Тогда 
					Если ВыборкаБЛ.Количество() > 0 Тогда
						БЛ_80 = Ложь;
						
						ВыборкаБЛ.Выбрать();
						Пока ВыборкаБЛ.Следующий() Цикл
							Если ВыборкаБЛ.Показатель1 = 80 Тогда
								БЛ_80 = Истина;
							КонецЕсли;
						КонецЦикла;
						
						Если БЛ_80 = Ложь Тогда
							ТекСтрока.Включать = Истина;
						Иначе
							//Островская Татьяна 03.12.2013 № 16960
							//Если ТекСтрока.Результат >= СреднемесячнаяЗП Тогда
							//	ТекСтрока.Включать = Истина;
							//КонецЕсли;
						КонецЕсли;
					Иначе
						//Островская Татьяна 03.12.2013 № 16960
						//Если ТекСтрока.Результат >= СреднемесячнаяЗП Тогда
						//	ТекСтрока.Включать = Истина;
						//КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//О.Т. 26.08.2014 № 17551
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
//заявка №2093

// Процедура рассчитывает начисления по среднему и заполняет реквизит Результат таблицы начислений
// Параметры:
//		РассчитываемыеТаблицы  - структура из элементов, соответствующих табличным частям документа. 
//				Значение Истина для каждого из элементов структуры означает необходимость расчета 
//				соответствующей табличной части документа
//		РежимПерерасчета - булево - признак вызов расчета при перерасчете документа
Процедура Рассчитать(РассчитываемыеТаблицы, РежимПерерасчета = Ложь,НеСторноНач = Ложь) Экспорт
	
	//Перед вызовом процедуры документ должнен быть записан, движения должны быть удалены 
	
	Отказ = Ложь;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке(РассчитываемыеТаблицы).Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	ТС1Разряда = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Сотрудник",Сотрудник)).ТарифнаяСтавкаПервогоРазряда; 
	Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
		ТекущаяТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), 
		Новый Структура("Организация,ТарифнаяСтавка", Организация, ТС1Разряда));
		РазмерТСТекПериода = ТекущаяТарифнаяСтавка.Размер;
		РазмерТСПредПериода = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(НачалоМесяца(ПериодРегистрации) - 86400), 
		Новый Структура("Организация,ТарифнаяСтавка", Организация, ТС1Разряда)).Размер;
		ПорядокОкругления = Константы.АВ_ПорядокОкругленияКоэффициентаИндексации.Получить();
		Если  Организация.РасчетКоэффициентовВОтпускахПоТС и РазмерТСТекПериода = 0 Тогда   // пытаемся взять основную ставка если пред 0
			ТС1Разряда = Справочники.ТарифныеСтавкиПервогоРазряда.Основная;
			ТекущаяТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), 
			Новый Структура("Организация,ТарифнаяСтавка", Организация, ТС1Разряда));
			РазмерТСТекПериода = ТекущаяТарифнаяСтавка.Размер;
			РазмерТСПредПериода = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(НачалоМесяца(ПериодРегистрации) - 86400), 
			Новый Структура("Организация,ТарифнаяСтавка", Организация, ТС1Разряда)).Размер;  			
		КонецЕсли;	
		Если ЗначениеЗаполнено(РазмерТСПредПериода) Тогда 
			КоэффициентОтпуска = Окр(РазмерТСТекПериода / РазмерТСПредПериода,ПорядокОкругления);
		иначе
			КоэффициентОтпуска = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//толик если исправительный документ перенос среднего 	    
	Если РассчитываемыеТаблицы.РасчетСреднего И ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
		
		//Аверсон 19.06.2023 КВВ СВФР-010922 (
		Если РасчетОтОклада Тогда 		
			//РасчетСреднегоПоКалендарным.Загрузить(ПерерассчитываемыйДокумент.РасчетСреднегоПоКалендарным.Выгрузить()); // ( закомментировано СВФР-010922 )
			//Аверсон 19.06.2023 КВВ СВФР-010922 )
			
			РасчетСреднегоПоШестидневке.Загрузить(ПерерассчитываемыйДокумент.РасчетСреднегоПоШестидневке.Выгрузить());
			Записать();
			РассчитываемыеТаблицы.РасчетСреднего = Ложь;
		КонецЕсли;
		#Если Клиент Тогда
			Текст = "Взять данные из старого документа";     // берем по желанию данные старого документа
			Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );
			Если Ответ = КодВозвратаДиалога.Да Тогда
				РасчетСреднегоПоКалендарным.Загрузить(ПерерассчитываемыйДокумент.РасчетСреднегоПоКалендарным.Выгрузить());		
				РасчетСреднегоПоШестидневке.Загрузить(ПерерассчитываемыйДокумент.РасчетСреднегоПоШестидневке.Выгрузить());
				Записать();
				РассчитываемыеТаблицы.РасчетСреднего = Ложь;  
			КонецЕсли;
		#КонецЕсли
		
		//Аверсон ЕАЕ 13.11.2020 если за период расчета среднего заработка было изменение тарифной ставки - выдаем сообщение
		НачалоПериода = '00010101';
		КонецПериода = '00010101';
		КоличествоПоКалендарным = РасчетСреднегоПоКалендарным.Количество();
		КоличествоПоШестидневке = РасчетСреднегоПоШестидневке.Количество();
		Если КоличествоПоКалендарным > 0 Тогда
			НачалоПериода = НачалоМесяца(РасчетСреднегоПоКалендарным[0].МесяцВыборки);
			КонецПериода = КонецМесяца(РасчетСреднегоПоКалендарным[КоличествоПоКалендарным - 1].МесяцВыборки);
		Иначе
			Если КоличествоПоШестидневке > 0 Тогда
				НачалоПериода = НачалоМесяца(РасчетСреднегоПоШестидневке[0].МесяцВыборки);
				КонецПериода = КонецМесяца(РасчетСреднегоПоШестидневке[КоличествоПоШестидневке - 1].МесяцВыборки);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда 
			ПроверкаИзмененияТарифнойСтавки(Сотрудник, НачалоПериода, КонецПериода);
		КонецЕсли;
		//Аверсон
	КонецЕсли;
	
	
	// Создадим наборы записей используемых регистров 
	НаборОсновныеНачисления = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	НаборДополнительныеНачисления = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборДополнительныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	НаборРасчетСреднего = РегистрыРасчета.РасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	НаборРасчетСреднего.Отбор.Регистратор.Значение = Ссылка;
	
	//+ СВЭЙ КДЯ 25.02.20 СВФР-005555
	//Если НЕ РассчитываемыеТаблицы.РасчетСреднего и не РассчитываемыеТаблицы.Пересчет Тогда //Островская Татьяна 30.05.2014 № 17397
	//- СВЭЙ КДЯ 25.02.20 СВФР-005555
	//+ СВЭЙ КДЯ 25.02.20 СВФР-005555
	Если НЕ РассчитываемыеТаблицы.РасчетСреднего Тогда
		//- СВЭЙ КДЯ 25.02.20 СВФР-005555
		
		// запишем движения по среднему заработку для расчета начислений
		// получим реквизиты табличной части РасчетСреднего 
		РезультатЗапросаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего();
		ВыборкаПоРасчетСреднего = РезультатЗапросаПоРасчетСреднего.Выбрать();
		
		Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок);
			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, НаборРасчетСреднего);
			КонецЕсли;
		КонецЦикла;
		
		НаборРасчетСреднего.Записать();
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если это документ-исправление, тогда добавим сторно-записи из исправляемого документа.
	ПроведениеРасчетов.СформироватьСторноЗаписиПоПерерассчитываемомуДокументу(ПерерассчитываемыйДокумент,ВыборкаПоШапкеДокумента, НаборОсновныеНачисления, НаборДополнительныеНачисления);
	
	// Начисления документа.
	СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборОсновныеНачисления, НаборДополнительныеНачисления);
	
	// Получим дополнительные записи, имеющие признак сторно, которые необходимо добавить 
	// в текущий набор для того, чтобы в результате сохранения получился максимальный 
	// фактический период действия
	ТаблицаСторноЗаписей = ПроведениеРасчетов.ПолучитьТаблицуСторноЗаписей(НаборОсновныеНачисления.ПолучитьДополнение());
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодРегистрации");
	ТаблицаСторноЗаписей.Колонки.ПериодРегистрацииСторно.Имя = "ПериодРегистрации";
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодДействияНачало");
	ТаблицаСторноЗаписей.Колонки.ПериодДействияНачалоСторно.Имя = "ПериодДействияНачало";
	ТаблицаСторноЗаписей.Колонки.Удалить("ПериодДействияКонец");
	ТаблицаСторноЗаписей.Колонки.ПериодДействияКонецСторно.Имя = "ПериодДействияКонец";
	Для каждого СтрокаСторно Из ТаблицаСторноЗаписей Цикл
		// Заполним записи в наборе записей регистра
		// и в табличной части
		
		// новая запись движений
		Движение = НаборОсновныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение,СтрокаСторно);
		
		// Свойства
		Движение.Сторно	= Истина;
		Движение.Авторасчет	= Истина;
		
	КонецЦикла;
	
	// получим список зависимых начислений
	Если ТаблицаСторноЗаписей.Количество() <> 0 Тогда
		// если таблица сторно-записей не пустая, получим таблицу
		// начислений, зависисяцих от тех начислений, которые зарегистрированы,
		
		ТаблицаОсновныхНачислений = ПроведениеРасчетов.ПолучитьТаблицуЗависимыхНачисленийОсновные(НаборОсновныеНачисления.Выгрузить());
		Для каждого СтрокаТаблицы Из ТаблицаОсновныхНачислений Цикл
			
			Если СтрокаТаблицы.Начислить > 0 Тогда
				
				// начисление зависит от сторнирующего, добавим не сторно
				Движение = НаборОсновныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицы);
				Движение.СторнируемыйДокумент = Неопределено;
				Движение.Сторно	= Ложь;
				Движение.Авторасчет	= Истина;
				
			КонецЕсли;
			
			Если СтрокаТаблицы.Сторнировать > 0 Тогда
				
				// начисление зависит от сторнируемого, добавим сторно
				Движение = НаборОсновныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицы);
				Движение.Сторно	= Истина;
				Движение.Авторасчет	= Истина;
				
			КонецЕсли;	
			
		КонецЦикла;
		
		ТаблицаДополнительныхНачислений = ПроведениеРасчетов.ПолучитьТаблицуЗависимыхНачисленийДополнительные(ТаблицаСторноЗаписей);
		Для каждого СтрокаТаблицы Из ТаблицаДополнительныхНачислений Цикл
			
			Движение = НаборДополнительныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицы);
			Движение.Сторно	= Истина;
			Движение.Авторасчет	= Истина;
			
			Движение = НаборДополнительныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,СтрокаТаблицы);
			Движение.СторнируемыйДокумент = Неопределено;
			Движение.Сторно	= Ложь;
			Движение.Авторасчет	= Истина;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Очистим начисления
	Начисления.Очистить();
	
	// рассчитываем записи начислений и если надо, записи расчета среднего заработка
	Если РассчитываемыеТаблицы.Начисления Тогда
		СреднийРассчитан = Ложь;
		
		Если НаборОсновныеНачисления.Количество() <> 0 Тогда
			Если РассчитываемыеТаблицы.РасчетСреднего Тогда
				//Островская Татьяна 30.05.2014 № 17397
				ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", НаборОсновныеНачисления, , НаборРасчетСреднего, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);
				СреднийРассчитан = Истина;
				НачислОсн = НаборОсновныеНачисления.Выгрузить();
				Для Каждого стрНач из НачислОсн цикл
					если не стрНач.Сторно тогда
						НеСторноНач = Истина; 
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", НаборОсновныеНачисления, , , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);//О.Т. 10.07.2014 № 112
			КонецЕсли;
		КонецЕсли;
		
		// перепишем записи основных начислений в документ
		ЗаписиНачислений = НаборОсновныеНачисления.Выгрузить();
		ЗаписиНачислений.Колонки.ПериодДействияНачало.Имя = "ДатаНачала";
		ЗаписиНачислений.Колонки.ПериодДействияКонец.Имя = "ДатаОкончания";
		Начисления.Загрузить(ЗаписиНачислений);
		
		Если НаборДополнительныеНачисления.Количество() > 0 Тогда
			
			Если Не ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
				Если РассчитываемыеТаблицы.РасчетСреднего  И Не СреднийРассчитан Тогда
					ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , НаборРасчетСреднего, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет); //О.Т. 10.07.2014 № 112
					СреднийРассчитан = Истина;
				Иначе
					ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);//О.Т. 10.07.2014 № 112
				КонецЕсли;
				
				// перепишем записи начислений в документ
				ЗаписиНачислений = НаборДополнительныеНачисления.Выгрузить();
				ЗаписиНачислений.Колонки.БазовыйПериодНачало.Имя = "ДатаНачала";
				ЗаписиНачислений.Колонки.БазовыйПериодКонец.Имя  = "ДатаОкончания";
				
				Для каждого СтрокаТаблицы Из ЗаписиНачислений Цикл
					СтрокаТабличнойЧасти = Начисления.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТаблицы);
				КонецЦикла;		
				
				//заявка №1921 (база заявок Кристалла) Дмитрук О.Г.
			Иначе 
				//Аверсон 04.05.2021 КВВ СВФР-007553 (
				СчитатьДальше = Ложь;
				Если (КоэффициентОтпуска = 1 или КоэффициентОтпуска = 0) ИЛИ (ДнейЧасовКомпенсацииОтпуска <> 0) Тогда
					СчитатьДальше = Истина;
				КонецЕсли;	
				//Если КоэффициентОтпуска = 1 или КоэффициентОтпуска = 0 Тогда
				Если СчитатьДальше Тогда
					//Аверсон 04.05.2021 КВВ СВФР-007553 )
					
					Если РассчитываемыеТаблицы.РасчетСреднего  И Не СреднийРассчитан Тогда
						ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , НаборРасчетСреднего, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);//О.Т. 10.07.2014 № 112
						СреднийРассчитан = Истина;
					Иначе
						ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);//О.Т. 10.07.2014 № 112
					КонецЕсли;
					
					// перепишем записи начислений в документ
					ЗаписиНачислений = НаборДополнительныеНачисления.Выгрузить();
					ЗаписиНачислений.Колонки.БазовыйПериодНачало.Имя = "ДатаНачала";
					ЗаписиНачислений.Колонки.БазовыйПериодКонец.Имя  = "ДатаОкончания";
					
					Для каждого СтрокаТаблицы Из ЗаписиНачислений Цикл
						СтрокаТабличнойЧасти = Начисления.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТаблицы);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//заявка №1921
			
		КонецЕсли;
		
	ИначеЕсли РассчитываемыеТаблицы.РасчетСреднего Тогда
		НаборОсновныеНачисления.Записать();
		НаборДополнительныеНачисления.Записать();
		
		Если НаборОсновныеНачисления.Количество() > 0 Тогда
			ПроведениеРасчетов.СформироватьИЗаписатьДанныеРасчетаСреднего("ОсновныеНачисленияРаботниковОрганизаций", Ссылка, НаборРасчетСреднего,,,,РассчитываемыеТаблицы.Пересчет);//Островская Татьяна 30.05.2014 № 17397
		Иначе //Островская Татьяна 12.02.2014
			ПроведениеРасчетов.СформироватьИЗаписатьДанныеРасчетаСреднего("ДополнительныеНачисленияРаботниковОрганизаций", Ссылка, НаборРасчетСреднего,,,,РассчитываемыеТаблицы.Пересчет); //Островская Татьяна 30.05.2014 № 17397
		КонецЕсли;
	КонецЕсли;
	
	
	Если РассчитываемыеТаблицы.РасчетСреднего Тогда
		
		// перепишем записи расчета среднего заработка в документ
		если не РассчитываемыеТаблицы.Пересчет Тогда
			РасчетСреднегоПоКалендарным.Очистить();
		КонецЕсли;
		РасчетСреднегоПоШестидневке.Очистить();
		
		ВременнаяТЗ = НаборРасчетСреднего.Выгрузить();
		ВременнаяТЗ.Свернуть("СпособРасчета,БазовыйПериодКонец,БазовыйПериодНачало,ВидРасчета,КоэффициентИндексации,НормаПоПятидневке,ОтработаноДней,ОтработаноПоПятидневке,ОтработаноЧасов,Результат,ЧислоМесяцев,МесяцВыборки,ТекущаяТарифнаяСтавка,ТарифнаяСтавкаПериода,НормаДней,НормаЧасов,Включать");
		ВременнаяТЗ.Сортировать("МесяцВыборки Возр");
		
		// перепишем записи расчета среднего заработка в документ
		Для Каждого СтрокаНабора Из ВременнаяТЗ Цикл
			
			Если СтрокаНабора.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням Тогда
				если РассчитываемыеТаблицы.Пересчет Тогда 
					МассивТЧСредний = РасчетСреднегоПоКалендарным.НайтиСтроки(Новый Структура("МесяцВыборки,ВидРасчета",СтрокаНабора.МесяцВыборки,СтрокаНабора.ВидРасчета));
					если МассивТЧСредний.Количество()=0 Тогда 
						Продолжить;
					иначе
						СтрокаТЧ = МассивТЧСредний[0];
					КонецЕсли;
				иначе
					СтрокаТЧ = РасчетСреднегоПоКалендарным.Добавить();
				КонецЕсли;
				//Иначе
				//	СтрокаТЧ = РасчетСреднегоПоШестидневке.Добавить();
				//	СтрокаТЧ.ОтработаноДней = КоэффициентОтпуска;
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаНабора);
			КонецЕсли;
			//ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаНабора);
			//СтрокаТЧ.ОтработаноДней = КоэффициентОтпуска;
			
		КонецЦикла;
		
	КонецЕсли;
	//О.Т. Аверсон 21.11.2018 № 2774
	Для Каждого стр из Начисления Цикл 
		стр.ДатаНачалаСобытия = ПериодРегистрации;
	КонецЦикла;
	//О.Т. Аверсон 21.11.2018 № 2774
	
	
	Если РежимПерерасчета тогда
		// Для режима перерасчета запишем движения (набор записей расчета среднего уже записан)
		НаборОсновныеНачисления.Записать();
		НаборДополнительныеНачисления.Записать();
		НаборРасчетСреднего.Записать();
	Иначе	
		// Удаляем движения для режима интерактивного расчета 
		НаборОсновныеНачисления.Очистить();
		НаборОсновныеНачисления.Записать();
		
		НаборДополнительныеНачисления.Очистить();
		НаборДополнительныеНачисления.Записать();
		
		НаборРасчетСреднего.Очистить();
		НаборРасчетСреднего.Записать();
		
	КонецЕсли;
	
	//Аверсон ЕАЕ 19.01.2021 СВФР-007065
	Если РассчитываемыеТаблицы.РасчетСреднего Тогда
		ПроверкаКоэффициентовИндексации();
		ПересчетЗаработкаСУчетомИндексации(); //Аверсон 05.01.2022 КВВ СВФР-008562
	КонецЕсли;
	//Аверсон
	
КонецПроцедуры // РассчитатьНачисления()

Процедура ПересчетЗаработкаСУчетомИндексации()
	//Аверсон 05.01.2022 КВВ СВФР-008562 (
	Для Каждого Стр Из РасчетСреднегоПоКалендарным Цикл
		Стр.ЗаработокСУчетомИндексации = Окр(Стр.КоэффициентИндексации*Стр.Результат,2);
	КонецЦикла;
	//Аверсон 05.01.2022 КВВ СВФР-008562 )
КонецПроцедуры


//Аверсон ЕАЕ 19.01.2021 СВФР-007065
Процедура ПроверкаКоэффициентовИндексации()
	Для Каждого Стр Из РасчетСреднегоПоКалендарным Цикл
		Если Стр.КоэффициентИндексации = 1 Тогда
			Продолжить;
		КонецЕсли;
		Сообщить("Обратите внимание! Применен коэффициент индексации " + СокрЛП(Стр.КоэффициентИндексации) + " (строка " + СокрЛП(Стр.НомерСтроки) + ").");
	КонецЦикла;
КонецПроцедуры
//Аверсон

//Аверсон ЕАЕ 14.11.2020
Процедура ПроверкаИзмененияТарифнойСтавки(Сотрудник, НачалоПериода, КонецПериода)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТарифныеСтавкиРаботниковОрганизации.Период,
	//|	ТарифныеСтавкиРаботниковОрганизации.Ставка
	//|ИЗ
	//|	РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
	//|ГДЕ
	//|	ТарифныеСтавкиРаботниковОрганизации.Организация = &Организация
	//|	И ТарифныеСтавкиРаботниковОрганизации.Активность
	//|	И ТарифныеСтавкиРаботниковОрганизации.Период < &КонецПериода
	//|	И ТарифныеСтавкиРаботниковОрганизации.Сотрудник = &Сотрудник
	//|	И ТарифныеСтавкиРаботниковОрганизации.Период > &НачалоПериода";
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ТарифныеСтавкиРаботниковОрганизацииНачало.Ставка,0) КАК СтавкаНачало,
	|	ЕСТЬNULL(ТарифныеСтавкиРаботниковОрганизацииКонец.Ставка,0) КАК СтавкаКонец
	|ИЗ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&НачалоПериода, Сотрудник = &Сотрудник И Организация = &Организация) КАК ТарифныеСтавкиРаботниковОрганизацииНачало
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&КонецПериода, Сотрудник = &Сотрудник И Организация = &Организация) КАК ТарифныеСтавкиРаботниковОрганизацииКонец
	|ПО ТарифныеСтавкиРаботниковОрганизацииНачало.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииКонец.Сотрудник
	|";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СтавкаНачало <> ВыборкаДетальныеЗаписи.СтавкаКонец Тогда
			Сообщить("За период с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy") + " тарифная ставка изменилась на " + СокрЛП(ВыборкаДетальныеЗаписи.СтавкаКонец) + ".");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//Аверсон

// Выполняет перерасчет по заданному списку физлиц
// Параметры
//	Физлица - массив - ссылки на физлиц
// Возвращаемое значение
//	Нет
//
Процедура Перерассчитать(Физлица = Неопределено) Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	// Выполним полный перерасчет документа
	Рассчитать(Новый Структура("Начисления,РасчетСреднего",Истина,Истина), Истина);
	
	// Зафиксируем данные табличных частей после расчета
	Записать();
	
	Движения.НДФЛСведенияОДоходах.Очистить();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Движения.ФактическиеОтпускаОрганизаций.Очистить();
	
	// Получение учетной политики по персоналу организации
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
		
		//толик		//Если Не ВыборкаПоНачислениям.ЕстьКадровыйОтпуск И Не ВыборкаПоНачислениям.ВидЕжегодногоОтпуска.Пустая() Тогда
		//	ДобавитьСтрокуВДвиженияПоОстаткам(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
		//КонецЕсли;
	КонецЦикла;
	
	Движения.НДФЛСведенияОДоходах.Записать();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записать();
	Движения.ФактическиеОтпускаОрганизаций.Записать();
	
	// Удалим записи перерасчета по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	
КонецПроцедуры // Перерассчитать()

#Если Клиент Тогда
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//	Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//	НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если Не  Проведен Тогда
			//РаботаСДиалогами.ВывестиПредупреждение("Документ можно распечатать только после расчета и проведения!");
			//Возврат Неопределено;
			
			//О.Т. Аверсон 24.02.2017 № 346
			ТекстВопроса = "Документ можно распечатать только после расчета и проведения! Провести?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат Неопределено;
			иначе
				попытка
					ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Возврат Неопределено;
				КонецПопытки;
				
			КонецЕсли;
			//О.Т. Аверсон 24.02.2017 № 346
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Т60" Тогда
			ТабДокумент = ПечатьТ60();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (Т-60)");
		КонецЕсли;
		
	КонецФункции // Печать()
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
	
	// Формирует запрос по шапке документа для целей выода документа на печать
	//
	//
	// Возвращаемое значение:
	//  Результат запроса
	//
	Функция СформироватьЗапросПоШапкеДляПечати()
		
		ДатаНачалаСобытия = ПолучитьДатуНачалаСобытия();
		
		Запрос = Новый Запрос;
		
		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("ДатаНачалаСобытия",		ДатаНачалаСобытия);
		Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
		Запрос.УстановитьПараметр("Физлицо",				Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("МесяцевРасчетаПоЗакону",	?(ДатаНачалаСобытия < ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006(),3,12));
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Отпуск.Дата КАК ДатаДокумента,
		|	Отпуск.Номер КАК НомерДокумента,
		|	Отпуск.Сотрудник КАК Сотрудник,
		|	Отпуск.ДатаНачалаОсновногоОтпуска,
		|	Отпуск.ДатаОкончанияОсновногоОтпуска,
		|	Отпуск.РабочийГодС,
		|	Отпуск.РабочийГодПо,
		|	Отпуск.ДатаНачалаДополнительногоОтпуска,
		|	Отпуск.ДатаОкончанияДополнительногоОтпуска,
		|	Отпуск.ПорядокРасчетаОсновногоОтпуска,
		|	Отпуск.ВидРасчетаДополнительногоОтпуска.Наименование КАК ВидДополнительногоОтпуска,
		|	Отпуск.ИспользоватьСреднеЧасовойЗаработок КАК ИспользоватьСреднеЧасовойЗаработок,
		|	Отпуск.Организация.КодПоОКПО КАК КодПоОКПО,
		|	Отпуск.Организация.НаименованиеПолное КАК НазваниеОрганизации,
		|	Отпуск.Сотрудник.Код КАК ТабельныйНомер,
		|	Отпуск.Организация.Префикс,
		//Усков Сергей 07.08.2013 № 16701+   //Аверсон 04.07.2019 КВВ СВФР-004496 ( (добавлены новые Дни компенсации отпуска (2-4)
		|	(Отпуск.ДнейЧасовКомпенсацииОтпуска + Отпуск.ДнейЧасовКомпенсацииОтпуска2 + Отпуск.ДнейЧасовКомпенсацииОтпуска3 + Отпуск.ДнейЧасовКомпенсацииОтпуска4) КАК ДнейКомпенсации,
		//Усков Сергей 07.08.2013 № 16701-   //Аверсон 04.07.2019 КВВ СВФР-004496 ) (добавлены новые Дни компенсации отпуска (2-4)
		|	ЕСТЬNULL(ФИОФизлица.Фамилия + "" "" + ФИОФизлица.Имя + "" "" + ФИОФизлица.Отчество, Отпуск.Сотрудник.Наименование) КАК ФИО,
		|	ВЫБОР
		|		КОГДА  РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
		|		ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.Наименование
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
		|		ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность.Наименование 
		|	КОНЕЦ КАК Должность,	
		|	ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ, ЛОЖЬ) КАК НеЯвляетсяНалоговымРезидентомРФ,
		|	ВЫБОР
		|		КОГДА Отпуск.ДатаНачалаОсновногоОтпуска = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Отпуск.ДатаНачалаДополнительногоОтпуска
		|		ИНАЧЕ Отпуск.ДатаНачалаОсновногоОтпуска
		|	КОНЕЦ КАК ДатаНачалаОтпуска,
		|	ВЫБОР
		|		КОГДА Отпуск.ДатаОкончанияОсновногоОтпуска = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА Отпуск.ДатаОкончанияДополнительногоОтпуска
		|		КОГДА Отпуск.ДатаОкончанияОсновногоОтпуска < Отпуск.ДатаОкончанияДополнительногоОтпуска
		|			ТОГДА Отпуск.ДатаОкончанияДополнительногоОтпуска
		|		ИНАЧЕ Отпуск.ДатаОкончанияОсновногоОтпуска
		|	КОНЕЦ КАК ДатаОкончанияОтпуска";
		Если ДатаНачалаОсновногоОтпуска <> '00010101' Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -(ВЫБОР
			|		КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
			|			ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
			|		ИНАЧЕ &МесяцевРасчетаПоЗакону
			|	КОНЕЦ)) КАК ПериодРасчетаОсновногоОтпускаНачало";
		КонецЕсли;
		Если ДатаНачалаДополнительногоОтпуска <> '00010101' Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -(ВЫБОР
			|		КОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
			|			ТОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПериодРасчетаСреднегоЗаработка
			|		ИНАЧЕ &МесяцевРасчетаПоЗакону
			|	КОНЕЦ)) КАК ПериодРасчетаДополнительногоОтпускаНачало";
		КонецЕсли;
		Если ДнейЧасовКомпенсацииОтпуска > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + ",
			|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -(ВЫБОР
			|		КОГДА ПараметрыВидаРасчетаКомпенсация.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
			|			ТОГДА ПараметрыВидаРасчетаКомпенсация.ЧислоМесяцев
			|		ИНАЧЕ &МесяцевРасчетаПоЗакону
			|	КОНЕЦ)) КАК ПериодРасчетаКомпенсацииОтпускаНачало";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо) КАК ФИОФизлица
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
		|		ПО (ИСТИНА)";
		Если ДатаНачалаОсновногоОтпуска <> '00010101' Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаОсновногоОтпуска
			|		ПО (ПараметрыВидаРасчетаОсновногоОтпуска.Ссылка = ВЫБОР
			|			КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
			|				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
			|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
			|		КОНЕЦ)";
		КонецЕсли;
		Если ДнейЧасовКомпенсацииОтпуска > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсация
			|		ПО (ПараметрыВидаРасчетаКомпенсация.Ссылка = ВЫБОР
			|					КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
			|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
			|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
			|				КОНЕЦ)";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	Отпуск.Ссылка = &ДокументСсылка";
		
		Запрос.Текст = ТекстЗапроса;
		Возврат Запрос.Выполнить();
		
	КонецФункции // СформироватьЗапросПоШапкеДляПечати()
	
	// Функция формирует табличный документ с печатной формой "Т-60",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьТ60() Экспорт
		
		//Островская Татьяна 17.04.2014 № 17287
		ТочностьСреднего = Константы.ТочностьСреднегоЗаработка.Получить();
		Если ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
			ЗначениеТочностьСреднего = 0;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
			ЗначениеТочностьСреднего = 1;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
			ЗначениеТочностьСреднего = 2;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
			ЗначениеТочностьСреднего = 3;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
			ЗначениеТочностьСреднего = 4;
		иначе
			ЗначениеТочностьСреднего = 0;
		КонецЕсли;
		//Островская Татьяна 18.04.2014 № 17287
		
		// тексты запросов 
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеОтпуска_РасчетСрЗаработка"; //Аверсон 02.06.2023 КВВ СВФР-010909
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапкеДляПечати().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		
		// Определение даты начала и конца оплачиваемого события 
		
		УказанаДатаНачалаОсновногоОтпуска = ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска);
		УказанаДатаНачалаДополнительногоОтпуска = ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачалаДополнительногоОтпуска);
		
		Если УказанаДатаНачалаОсновногоОтпуска Тогда
			
			ДатаНачалаСобытия 			= ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска;
			ИспользуемыйСпособРасчетаОтпуска = ?(ПорядокРасчетаОсновногоОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке);
			Если УказанаДатаНачалаДополнительногоОтпуска тогда	
				ДатаОкончанияСобытия 	= ВыборкаПоШапкеДокумента.ДатаОкончанияДополнительногоОтпуска;
			Иначе	
				ДатаОкончанияСобытия 	= ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска;
			КонецЕсли;	
		Иначе
			ИспользуемыйСпособРасчетаОтпуска = ВидРасчетаДополнительногоОтпуска.СпособРасчета;
			ДатаНачалаСобытия 			= ВыборкаПоШапкеДокумента.ДатаНачалаДополнительногоОтпуска;
			ДатаОкончанияСобытия 		= ВыборкаПоШапкеДокумента.ДатаОкончанияДополнительногоОтпуска;
			Если Не ЗначениеЗаполнено(ДатаНачалаСобытия) Тогда
				ДатаНачалаСобытия		= Мин(КонецМесяца(ПериодРегистрации),ВыборкаПоШапкеДокумента.ДатаДокумента);
				ДатаОкончанияСобытия	= ДатаНачалаСобытия;
			КонецЕсли; 
		КонецЕсли; 
		
		Если Не ПроцедурыУправленияПерсоналом.РегламентированныйКалендарьЗаполнен(НачалоМесяца(ДатаНачалаСобытия),КонецМесяца(ДатаОкончанияСобытия),Истина) Тогда
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;
		
		// Поскольку в документе может выполняться начисление как основного, так и дополнительного отпуска, 
		// а методика расчета у них может отличаться, то при печати будем использовать порядок расчета отпуска, 
		// указанный в первой строке начислений
		// Это также относится к виду учета времени и периоду расчета среднего заработка
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ФизЛицо", Сотрудник.Физлицо);
		//Запрос.УстановитьПараметр("Приказ", Приказ);
		Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаНачалаСобытия);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация" , ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени КАК СуммированныйУчетРабочегоВремени,
		|	Начисления.ПериодРасчетаСреднегоЗаработкаНачало,
		|	Начисления.ПериодРасчетаСреднегоЗаработкаОкончание
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|		Начисления.ПериодРасчетаСреднегоЗаработкаНачало КАК ПериодРасчетаСреднегоЗаработкаНачало,
		|		Начисления.ПериодРасчетаСреднегоЗаработкаОкончание КАК ПериодРасчетаСреднегоЗаработкаОкончание
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
		|	
		|	ГДЕ
		|		Начисления.Регистратор = &Регистратор И
		|		(НЕ(Начисления.Сторно))
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРасчетаСреднегоЗаработкаНачало,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРасчетаСреднегоЗаработкаОкончание
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|	
		|	ГДЕ
		|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &Регистратор И
		|		(НЕ(ДополнительныеНачисленияРаботниковОрганизаций.Сторно))) КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник И Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ИСТИНА)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.СуммированныйУчетРабочегоВремени = Истина  Тогда
				ИспользуемыйВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
			Иначе
				ИспользуемыйВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
			КонецЕсли;
			ИспользуемаяДатаНачалаРасчетногоПериода = Выборка.ПериодРасчетаСреднегоЗаработкаНачало;
			ИспользуемаяДатаОкончанияРасчетногоПериода = КонецДня(Выборка.ПериодРасчетаСреднегоЗаработкаОкончание);
		Иначе	
			Предупреждение("Документ не имеет начислений!");
			Возврат Новый ТабличныйДокумент;
		КонецЕсли;  
		
		МесяцевРасчетногоПериода = Год(ИспользуемаяДатаОкончанияРасчетногоПериода)*12 + Месяц(ИспользуемаяДатаОкончанияРасчетногоПериода)  - (Год(ИспользуемаяДатаНачалаРасчетногоПериода)*12 + Месяц(ИспользуемаяДатаНачалаРасчетногоПериода)) + 1;
		
		// Установим основные параметры запроса
		
		Запрос.УстановитьПараметр("ДатаОкончанияСобытия", ДатаОкончанияСобытия);
		Запрос.УстановитьПараметр("ВидРасчетаОсновнойЗаработок", ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку);
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		
		Запрос.УстановитьПараметр("ИспользуемыйВидУчетаВремени", ИспользуемыйВидУчетаВремени);
		Запрос.УстановитьПараметр("ИспользуемаяДатаНачалаРасчетногоПериода", ИспользуемаяДатаНачалаРасчетногоПериода);
		Запрос.УстановитьПараметр("ИспользуемаяДатаОкончанияРасчетногоПериода", ИспользуемаяДатаОкончанияРасчетногоПериода);
		
		// Запрос выборки доли отработанного времени за расчетный период
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(Основной.ОтработаноДнейПоПятидневке) КАК ОтработаноДнейПоПятидневке,
		|	СУММА(Основной.НормаДнейПоПятидневке) КАК НормаДнейПоПятидневке
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
		|
		|ГДЕ
		|	Основной.Сотрудник = &Сотрудник И
		//|	Основной.Приказ = &Приказ И
		|	Основной.ПериодДействияНачало МЕЖДУ &ИспользуемаяДатаНачалаРасчетногоПериода И &ИспользуемаяДатаОкончанияРасчетногоПериода И
		|	Основной.Организация = &ГоловнаяОрганизация";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Отработано = ?(Выборка.ОтработаноДнейПоПятидневке = NULL,0,Выборка.ОтработаноДнейПоПятидневке);
			Норма = ?(Выборка.НормаДнейПоПятидневке = NULL,0,Выборка.НормаДнейПоПятидневке);
			ДоляОтработанногоВремениЗаРасчетныйПериод = ?(Норма =0, 0, Отработано / Норма);
		Иначе                       
			ДоляОтработанногоВремениЗаРасчетныйПериод = 0;
		КонецЕслИ;		
		
		
		// Запрос выборки среднего заработка
		
		//Аверсон ЕАЕ 28.03.2021 СВФР-007329
		Если РасчетОтОклада Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоОкладу.ДатаНачала,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоОкладу.ДатаОкончания,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоОкладу.РазмерСреднегоЗаработка
			|ИЗ
			|	Документ.НачислениеОтпускаРаботникамОрганизаций.РасчетСреднегоПоОкладу КАК НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоОкладу
			|ГДЕ
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоОкладу.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			ВыборкаСреднегоЗаработка = Запрос.Выполнить().Выбрать();
		Иначе
			//Аверсон СВФР-007329
			
			Запрос.Текст = "ВЫБРАТЬ
			|	СУММА(НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Результат) КАК Результат,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.МесяцВыборки КАК МесяцВыборки,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ТарифнаяСтавкаПериода,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ТекущаяТарифнаяСтавка,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.КоэффициентИндексации,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Включать,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ЧислоМесяцев,
			
			//Аверсон ЕАЕ 19.10.2022 СВФР-009668
			|   СУММА(НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ОтработаноЧасов) КАК ОтработаноЧасов
			//Аверсон СВФР-009668
			
			|ИЗ
			|	Документ.НачислениеОтпускаРаботникамОрганизаций.РасчетСреднегоПоКалендарным КАК НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным
			|ГДЕ
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Результат <> 0
			|	И НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.МесяцВыборки <> &ПустаяДата
			|	И НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ВидРасчета <> &ВидРасчетаПоГодовойПремии
			|	И НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Ссылка = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.МесяцВыборки,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.КоэффициентИндексации,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ТарифнаяСтавкаПериода,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ТекущаяТарифнаяСтавка,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.Включать,
			|	НачислениеОтпускаРаботникамОрганизацийРасчетСреднегоПоКалендарным.ЧислоМесяцев
			
			//толик
			|УПОРЯДОЧИТЬ ПО
			|	МесяцВыборки";
			
			Измерения = Новый Массив(1);
			Измерения[0] = "Сотрудник";
			
			// основные начисления собираем по периодам действия
			РазрезыОсновных = Новый Массив(1);
			РазрезыОсновных[0] = "ПериодДействия";
			
			// дополнительные начисления собираем по периодам регистрации
			РазрезыДополнительных = Новый Массив(2);
			РазрезыДополнительных[0] = "ПериодРегистрации";
			РазрезыДополнительных[1] = "ЧислоМесяцев";
			
			Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
			Запрос.УстановитьПараметр("Измерения", Измерения);
			Запрос.УстановитьПараметр("РазрезыОсновных", РазрезыОсновных);
			Запрос.УстановитьПараметр("РазрезыДополнительных", РазрезыДополнительных);
			Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
			Запрос.УстановитьПараметр("ВидРасчетаПоГодовойПремии", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии);
			Запрос.УстановитьПараметр("МесяцевРасчетногоПериода", МесяцевРасчетногоПериода);
			Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
			Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
			Запрос.УстановитьПараметр("ИспользуемыйСпособРасчетаОтпуска", ИспользуемыйСпособРасчетаОтпуска);
			
			ТаблицаСреднего = Новый ТаблицаЗначений;        
			ТаблицаСреднего.Колонки.Добавить("Месяц");
			ТаблицаСреднего.Колонки.Добавить("Сумма");
			ТаблицаСреднего.Колонки.Добавить("Описание");
			
			ВыборкаСреднегоЗаработка = Запрос.Выполнить().Выбрать();
		КонецЕсли;
		
		// Норма дней по шестидневке в разрезе месяцев расчетного периода
		НормаПоШестидневкеТекст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцПериода,
		|	СУММА(ПроизводственныйКалендарь.Шестидневка) КАК ДнейПоШестидневке
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		|
		|ГДЕ
		|	ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ИспользуемаяДатаНачалаРасчетногоПериода И &ИспользуемаяДатаОкончанияРасчетногоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)";
		
		
		// Выборка отработанного времени за месяцы расчетного периода
		
		ОтработанноеВремяТекст = 
		"ВЫБРАТЬ
		|	Начисления.ПериодДействия КАК МесяцПериода,
		|	СУММА(Начисления.ОтработаноДнейПоПятидневке) КАК ОтработаноДнейПоПятидневке,
		|	СУММА(Начисления.НормаДнейПоПятидневке) КАК НормаДнейПоПятидневке,
		|	СУММА(Начисления.ОтработаноЧасов) КАК ОтработаноЧасов
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
		|
		|ГДЕ
		|	Начисления.Сотрудник = &Сотрудник И
		//|	Начисления.Приказ = &Приказ И
		|	Начисления.ПериодДействияНачало МЕЖДУ &ИспользуемаяДатаНачалаРасчетногоПериода И &ИспользуемаяДатаОкончанияРасчетногоПериода И
		|	Начисления.Организация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ПериодДействия";
		
		
		// Расчет количества отработанных дней для расчета отпуска
		//		если ОтработаноДнейПоПятидневке  < НормаДнейПоПятидневке 
		//		тогда 
		//			если ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = по календарным дням
		//			тогда ОтработаноДнейПоПятидневке * 1.4
		//			иначе ОтработаноДнейПоПятидневке * 1.2
		//		иначе
		//			если по календарным дням
		//			тогда 29.6
		//			иначе норма дней по шестидневке
		// Параллельно считаем отработанные часы за весь расчетный период
		Если ИспользуемыйСпособРасчетаОтпуска = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням Тогда
			ДнейДляРасчетаОтпускаТекст = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
			|	СУММА(ВЫБОР КОГДА ОтработанноеВремя.ОтработаноДнейПоПятидневке < ОтработанноеВремя.НормаДнейПоПятидневке ТОГДА ОтработанноеВремя.ОтработаноДнейПоПятидневке * 1.4 ИНАЧЕ  29.7 КОНЕЦ) КАК ОтработаноДнейДляРасчетаОтпуска,
			|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасовЗаРасчетныйПериод
			|ИЗ 
			|	(" + ОтработанноеВремяТекст + ") КАК ОтработанноеВремя
			|";
		Иначе	
			ДнейДляРасчетаОтпускаТекст = "                             
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Сумма(ВЫБОР КОГДА ОтработанноеВремя.ОтработаноДнейПоПятидневке < ОтработанноеВремя.НормаДнейПоПятидневке ТОГДА ОтработанноеВремя.ОтработаноДнейПоПятидневке * 1.2 ИНАЧЕ НормаПоШестидневке.ДнейПоШестидневке КОНЕЦ) КАК ОтработаноДнейДляРасчетаОтпуска,
			|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасовЗаРасчетныйПериод
			|ИЗ
			|(" + ОтработанноеВремяТекст + ") КАК ОтработанноеВремя
			|	ЛЕВОЕ СОЕДИНЕНИЕ (" +  НормаПоШестидневкеТекст + ") КАК НормаПоШестидневке
			|	ПО НормаПоШестидневке.МесяцПериода = ОтработанноеВремя.МесяцПериода
			|";
		КонецЕсли; 
		
		Запрос.Текст = ДнейДляРасчетаОтпускаТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОтработаноДнейДляРасчетаОтпуска = Выборка.ОтработаноДнейДляРасчетаОтпуска;
			ОтработаноЧасовЗаРасчетныйПериод = Выборка.ОтработаноЧасовЗаРасчетныйПериод;
		Иначе	
			ОтработаноДнейДляРасчетаОтпуска = 0;
			ОтработаноЧасовЗаРасчетныйПериод = 0;
		КонецЕсли; 
		
		// Выборка дней , оплаченных за первый месяц отпуска и последующие месяцы
		
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ) = &ПервыйМесяцОтпуска ТОГДА ""Текущий"" ИНАЧЕ ""Будущий"" КОНЕЦ Как ВидМесяца,
		|	СУММА(ВЫБОР КОГДА Начисления.ВидРасчета В (&ВидыРасчетаОсновнойОтпуск) ТОГДА ПроизводственныйКалендарь.КалендарныеДни ИНАЧЕ 0 КОНЕЦ) КАК ДнейКОплатеОсновногоОтпуска,
		|	СУММА(ВЫБОР КОГДА НЕ(Начисления.ВидРасчета В (&ВидыРасчетаОсновнойОтпуск)) ТОГДА ПроизводственныйКалендарь.КалендарныеДни ИНАЧЕ 0 КОНЕЦ) КАК ДнейКОплатеДополнительногоОтпуска
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(Регистратор = &Регистратор) КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		|		ПО (ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
		|
		|ГДЕ
		|	(НЕ(Начисления.Сторно))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ) = &ПервыйМесяцОтпуска ТОГДА ""Текущий"" ИНАЧЕ ""Будущий"" КОНЕЦ";
		
		Запрос.УстановитьПараметр("ПервыйМесяцОтпуска", НачалоМесяца(ДатаНачалаСобытия));
		
		ВидыРасчетаОсновнойОтпуск = Новый Массив;
		ВидыРасчетаОсновнойОтпуск.Добавить(ВидРасчетаОсновногоОтпуска);
		//	ВидыРасчетаОсновнойОтпуск.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка);
		Запрос.УстановитьПараметр("ВидыРасчетаОсновнойОтпуск", ВидыРасчетаОсновнойОтпуск);
		
		ДнейКОплатеОсновногоОтпускаЗаТекущийМесяц = 0;
		ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц = 0;
		ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы = 0;
		ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы = 0;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидМесяца = "Текущий" Тогда
				ДнейКОплатеОсновногоОтпускаЗаТекущийМесяц = Выборка.ДнейКОплатеОсновногоОтпуска;
				ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц = Выборка.ДнейКОплатеДополнительногоОтпуска;
			Иначе
				ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы = Выборка.ДнейКОплатеОсновногоОтпуска;
				ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы = Выборка.ДнейКОплатеДополнительногоОтпуска;
			КонецЕсли; 
		КонецЦикла; 
		
		// Выборка начисленных сумм за отпуск
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Начисления.НачисленоОтпускных) КАК НачисленоОтпускных,
		|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ) = &ПервыйМесяцОтпуска ТОГДА ""Текущий"" ИНАЧЕ ""Будущий"" КОНЕЦ КАК ВидМесяца
		|ИЗ
		|	(ВЫБРАТЬ
		|		Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		Начисления.Результат КАК НачисленоОтпускных
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
		|	
		|	ГДЕ
		|		Начисления.Регистратор = &Регистратор И
		|		(НЕ(Начисления.Сторно))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|	
		|	ГДЕ
		|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &Регистратор И
		|		(НЕ(ДополнительныеНачисленияРаботниковОрганизаций.Сторно))) КАК Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ) = &ПервыйМесяцОтпуска ТОГДА ""Текущий"" ИНАЧЕ ""Будущий"" КОНЕЦ";
		
		НачисленоОтпускныхЗаТекущийМесяц = 0;
		НачисленоОтпускныхЗаБудущиеМесяцы = 0;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидМесяца = "Текущий" Тогда
				НачисленоОтпускныхЗаТекущийМесяц = Выборка.НачисленоОтпускных;
			Иначе	
				НачисленоОтпускныхЗаБудущиеМесяцы = Выборка.НачисленоОтпускных;
			КонецЕсли;	
		КонецЦикла;
		ВсегоНачисленоОтпускных = НачисленоОтпускныхЗаТекущийМесяц  + НачисленоОтпускныхЗаБудущиеМесяцы;
		
		// Выборка зарегистрированных процентых удержаний за работником
		
		Запрос.Текст = "ВЫБРАТЬ 
		|	Удержания.Показатель1
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо И Организация = &ГоловнаяОрганизация) КАК Удержания
		|
		|ГДЕ
		|	Удержания.ВидРасчета.СпособРасчета В(&МассивСпособыРасчетаПроцентом)";
		
		МассивСпособыРасчетаПроцентом = Новый Массив;
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
		//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы);
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП); //О.Т. Аверсон 04.11.2016 № 1501
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);//О.Т. Аверсон 24.05.2017 № 665
		МассивСпособыРасчетаПроцентом.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела);//О.Т. Аверсон 24.05.2017 № 665
		Запрос.УстановитьПараметр("МассивСпособыРасчетаПроцентом", МассивСпособыРасчетаПроцентом);
		
		ВыборкаУдержаний = Запрос.Выполнить().Выбрать();
		
		// Расчет суммы НДФЛ от ставки налога без учета льгот
		
		//ДанныеОГражданстве = РегистрыСведений.ГражданствоФизЛиц.СрезПоследних(ДатаНачалаСобытия, Новый Структура("ФизЛицо", ВыборкаПоШапкеДокумента.Сотрудник.ФизЛицо));
		//
		//Если ДанныеОГражданстве.Количество()=0 ИЛИ НЕ ДанныеОГражданстве[0].НеЯвляетсяНалоговымРезидентомРФ Тогда
		//	СтавкаНДФЛ = ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
		//	СтавкаНДФЛ = 9;
		//Иначе	
		//	СтавкаНДФЛ = ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛСНерезидента();
		//КонецЕсли; 
		//СуммаНДФЛ =  Окр(ВсегоНачисленоОтпускных * СтавкаНДФЛ/100, 0);
		
		
		// ВЫВОД ДАННЫХ В ОТЧЕТ
		
		//Аверсон ЕАЕ 28.03.2021 СВФР-007329
		Если РасчетОтОклада Тогда
			Макет = ПолучитьМакет("Т_60_ОтОклада");
		Иначе
			//Аверсон СВФР-007329
			Макет = ПолучитьМакет("Т_60");
		КонецЕсли;
		
		// вывод лицевой стороны
		СекцияЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
		//Усков Сергей 07.08.2013 № 16701+
		СекцияЛицеваяСторонаДлительностьОтпуска = Макет.ПолучитьОбласть("ЛицеваяСторонаДлительностьОтпуска");
		СекцияЛицеваяСторонаДлительностьКомпенсации = Макет.ПолучитьОбласть("ЛицеваяСторонаДлительностьКомпенсации");
		СекцияЛицеваяСторонаДлительностьДоп = Макет.ПолучитьОбласть("ЛицеваяСторонаДлительностьДополнительный");//О.Т. Аверсон 14.11.2017 № 1240
		СекцияЛицеваяСторонаИтогоОтпуск = Макет.ПолучитьОбласть("ЛицеваяСторонаИтогоОтпуск");
		//Усков Сергей 07.08.2013 № 16701-
		
		СекцияЛицеваяСторона.Параметры.Заполнить(ВыборкаПоШапкеДокумента);
		
		СекцияЛицеваяСторона.Параметры.ДнейКОплатеОсновногоОтпуска = ДнейКОплатеОсновногоОтпускаЗаТекущийМесяц + ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы;
		СекцияЛицеваяСторона.Параметры.ДнейКОплатеДополнительногоОтпуска = ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц + ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы;
		
		СекцияЛицеваяСторона.Параметры.ДатаНачалаОсновногоОтпускаПрописью = Формат(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска,"ДЛФ=DD; ДП=-");
		СекцияЛицеваяСторона.Параметры.ДатаОкончанияОсновногоОтпускаПрописью = Формат(ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска,"ДЛФ=DD; ДП=-");
		
		СекцияЛицеваяСторона.Параметры.ТекстКалендарныхРабочихОсновного = "календарных";
		СекцияЛицеваяСторона.Параметры.ТекстКалендарныхРабочихДополнительного = "календарных";
		//Островская Татьяна 01.08.2013 № 16678
		//СекцияЛицеваяСторона.Параметры.ВидРасчета = ВидРасчетаОсновногоОтпуска;
		//СекцияЛицеваяСторона.Параметры.ДатаНачала = Формат(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска,"ДЛФ=Д");
		//СекцияЛицеваяСторона.Параметры.ДатаОкончания = Формат(ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска,"ДЛФ=Д");
		//СекцияЛицеваяСторона.Параметры.КолДней = (ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска - ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска)/86400 +1;
		//Островская Татьяна 01.08.2013 № 16678
		
		//Усков Сергей 07.08.2013 № 16701+
		СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ВидРасчета = ВидРасчетаОсновногоОтпуска;
		СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаНачала = Формат(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска,"ДЛФ=Д");
		СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаОкончания = Формат(ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска,"ДЛФ=Д");
		//ПСА 07.12.2021 СВФР-008432+++
		//КоличествоДнейОтпуска = (ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска - ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска)/86400 +1;
		если ВидРасчетаОсновногоОтпуска.ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение Тогда
			КоличествоДнейОтпуска = (ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска - ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска) / мДлинаСуток + 1 - КолвоПраздниковЗаПериод(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска, ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска); 			
		иначе
			Запрос1 = Новый Запрос;
			Запрос1.УстановитьПараметр("ДатаНачалаОтпуска",		ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска);
			Запрос1.УстановитьПараметр("ДатаОкончанияОтпуска",	ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска);
			Запрос1.Текст =
			"ВЫБРАТЬ
			|	СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни) КАК КоличествоДнейОтпуска
			|ИЗ
			|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|ГДЕ
			|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаОтпуска И &ДатаОкончанияОтпуска";	
			Выборка1 = Запрос1.Выполнить().Выбрать();
			Если Выборка1.Следующий() Тогда
				Если Выборка1.КоличествоДнейОтпуска = NULL Тогда
					КоличествоДнейОтпуска = 0;
				Иначе	
					КоличествоДнейОтпуска = Выборка1.КоличествоДнейОтпуска;
				КонецЕсли;
			Иначе
			    КоличествоДнейОтпуска = 0;
			КонецЕсли;
		КонецЕсли;		
		//+++ ПСА 07.12.2021 СВФР-008432
		СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.КолДнейОтпуска = КоличествоДнейОтпуска;
		КоличествоДнейКомпенсации = ВыборкаПоШапкеДокумента.ДнейКомпенсации;
		СекцияЛицеваяСторонаДлительностьКомпенсации.Параметры.КолДнейКомпенсации = КоличествоДнейКомпенсации;
		СекцияЛицеваяСторонаДлительностьКомпенсации.Параметры.ВидРасчетаКомпенсации = ВидРасчетаКомпенсацииОтпуска;
		КоличествоДнейВсего = КоличествоДнейОтпуска+КоличествоДнейКомпенсации+КоличествоДнейДополнительногоОтпуска+КоличествоДнейДополнительногоОтпуска1+КоличествоДнейДополнительногоОтпуска2;
		СекцияЛицеваяСторонаИтогоОтпуск.Параметры.КолДнейВсего = КоличествоДнейВсего;
		//Усков Сергей 07.08.2013 № 16701-
		Запрос.Текст = "ВЫБРАТЬ 
		|	СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни) КАК КоличествоДнейОчередногоОтпуска
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаСобытия И &ДатаОкончанияСобытия";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СекцияЛицеваяСторона.Параметры.Заполнить(Выборка)
		КонецЕсли;
		
		ТабДокумент.Вывести(СекцияЛицеваяСторона);
		//Усков Сергей 07.08.2013 № 16701+
		Если КоличествоДнейОтпуска > 0 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьОтпуска);
		КонецЕсли;
		//О.Т. Аверсон 06.09.2016
		если ЗначениеЗаполнено(ВидРасчетаДополнительногоОтпуска) Тогда 
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ВидРасчета = ВидРасчетаДополнительногоОтпуска;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаНачала = Формат(ДатаНачалаДополнительногоОтпуска,"ДЛФ=Д");
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаОкончания = Формат(ДатаОкончанияДополнительногоОтпуска,"ДЛФ=Д");
			КоличествоДнейОтпуска = (ДатаОкончанияДополнительногоОтпуска - ДатаНачалаДополнительногоОтпуска)/86400 +1;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.КолДнейОтпуска = КоличествоДнейОтпуска;
			//Если КоличествоДнейОтпуска>1 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьОтпуска);
			//КонецЕсли;  			
		КонецЕсли;
		если ЗначениеЗаполнено(ВидРасчетаДополнительногоОтпуска1) Тогда 
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ВидРасчета = ВидРасчетаДополнительногоОтпуска1;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаНачала = Формат(ДатаНачалаДополнительногоОтпуска1,"ДЛФ=Д");
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаОкончания = Формат(ДатаОкончанияДополнительногоОтпуска1,"ДЛФ=Д");
			КоличествоДнейОтпуска = (ДатаОкончанияДополнительногоОтпуска1 - ДатаНачалаДополнительногоОтпуска1)/86400 +1;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.КолДнейОтпуска = КоличествоДнейОтпуска;
			//Если КоличествоДнейОтпуска>1 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьОтпуска);
			//КонецЕсли;  			
		КонецЕсли;
		если ЗначениеЗаполнено(ВидРасчетаДополнительногоОтпуска2) Тогда 
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ВидРасчета = ВидРасчетаДополнительногоОтпуска2;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаНачала = Формат(ДатаНачалаДополнительногоОтпуска2,"ДЛФ=Д");
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.ДатаОкончания = Формат(ДатаОкончанияДополнительногоОтпуска2,"ДЛФ=Д");
			КоличествоДнейОтпуска = (ДатаОкончанияДополнительногоОтпуска2 - ДатаНачалаДополнительногоОтпуска2)/86400 +1;
			СекцияЛицеваяСторонаДлительностьОтпуска.Параметры.КолДнейОтпуска = КоличествоДнейОтпуска;
			//Если КоличествоДнейОтпуска>1 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьОтпуска);
			//КонецЕсли;  			
		КонецЕсли;
		//О.Т. Аверсон 06.09.2016
		
		//О.Т. Аверсон 14.11.2017 № 1240
		//Если КоличествоДнейДополнительногоОтпуска > 0 Тогда 
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.КолДнейДоп = КоличествоДнейДополнительногоОтпуска;
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.ВидРасчетаДоп = ВидРасчетаДополнительногоОтпуска;
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.ДатаНачала = Формат(ДатаНачалаДополнительногоОтпуска,"ДЛФ=Д");
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.ДатаОкончания = Формат(ДатаОкончанияДополнительногоОтпуска2,"ДЛФ=Д");
		
		//	ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьДоп);
		//КонецЕсли;
		//Если КоличествоДнейДополнительногоОтпуска1 > 0 Тогда 
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.КолДнейДоп = КоличествоДнейДополнительногоОтпуска1;
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.ВидРасчетаДоп = ВидРасчетаДополнительногоОтпуска1;
		//	ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьДоп);
		//КонецЕсли;
		//Если КоличествоДнейДополнительногоОтпуска2 > 0 Тогда 
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.КолДнейДоп = КоличествоДнейДополнительногоОтпуска2;
		//	СекцияЛицеваяСторонаДлительностьДоп.Параметры.ВидРасчетаДоп = ВидРасчетаДополнительногоОтпуска2;
		//	ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьДоп);
		//КонецЕсли;
		//О.Т. Аверсон 14.11.2017 № 1240
		
		
		Если КоличествоДнейКомпенсации>0 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаДлительностьКомпенсации);
		КонецЕсли;
		Если КоличествоДнейОтпуска>1 И КоличествоДнейКомпенсации>0 Тогда
			ТабДокумент.Вывести(СекцияЛицеваяСторонаИтогоОтпуск);
		КонецЕсли;
		//Усков Сергей 07.08.2013 № 16701- 
		
		//ПСА 05.11.2021 СВФР-008340 +++
		Если НачислятьМатериальнуюПомощь и ЗначениеЗаполнено(МатериальнаяПомощьДокумент) Тогда
			СекцияМатПомощь = Макет.ПолучитьОбласть("ЛицеваяСторонаНачисленаМатериальнаяПомощь");
			ЗапросМатПомощь = Новый Запрос();
			ЗапросМатПомощь.Текст = 
				"ВЫБРАТЬ
				|	СУММА(Начисления.Сумма) КАК СуммаМатПомощи,
				|	Начисления.Сотрудник
				|ИЗ
				|	(ВЫБРАТЬ
				|		Начисления.Сотрудник КАК Сотрудник,
				|		Начисления.Результат КАК Сумма
				|	ИЗ
				|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Начисления
				|	ГДЕ
				|		Начисления.Регистратор = &Регистратор
				|		И Начисления.Сотрудник = &Сотрудник
				|		И НЕ Начисления.Сторно
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|		ДополнительныеНачисленияРаботниковОрганизаций.Результат
				|	ИЗ
				|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|	ГДЕ
				|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &Регистратор
				|		И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
				|		И НЕ ДополнительныеНачисленияРаботниковОрганизаций.Сторно) КАК Начисления
				|
				|СГРУППИРОВАТЬ ПО
				|	Начисления.Сотрудник";
			ЗапросМатПомощь.УстановитьПараметр("Регистратор", МатериальнаяПомощьДокумент);
			ЗапросМатПомощь.УстановитьПараметр("Сотрудник", Сотрудник);
			ВыборкаМатПомощь = ЗапросМатПомощь.Выполнить().Выбрать();
			Если ВыборкаМатПомощь.Следующий() Тогда
				СекцияМатПомощь.Параметры.Заполнить(ВыборкаМатПомощь)
			КонецЕсли;
			ТабДокумент.Вывести(СекцияМатПомощь);
		КонецЕсли;	
		//+++ПСА 05.11.2021 СВФР-008340
		
		//Аверсон ЕАЕ 28.03.2021 СВФР-007329
		Если РасчетОтОклада Тогда
			СекцияРасчетСреднего = Макет.ПолучитьОбласть("РасчетСреднего");
			НомерСтроки = 0;
			Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
				НомерСтроки = НомерСтроки  + 1;
				СекцияРасчетСреднего.Параметры["ДатаНачала" + НомерСтроки] 		= Формат(ВыборкаСреднегоЗаработка.ДатаНачала, "ДФ=dd.MM.yyyy");
				СекцияРасчетСреднего.Параметры["ДатаОкончания" + НомерСтроки] 	= Формат(ВыборкаСреднегоЗаработка.ДатаОкончания, "ДФ=dd.MM.yyyy");
				СекцияРасчетСреднего.Параметры["Сумма" + НомерСтроки] 		    = Формат(ВыборкаСреднегоЗаработка.РазмерСреднегоЗаработка, "ЧДЦ=4");
			КонецЦикла;
			ТабДокумент.Вывести(СекцияРасчетСреднего);
		Иначе
			//Аверсон СВФР-007329
			
			//Усков Сергей 07.08.2013 № 16701+
			Если ВыборкаСреднегоЗаработка.Количество()>0 Тогда
				// Вывод сведений о порядке расчета среднего заработка
				СекцияРасчетСреднего = Макет.ПолучитьОбласть("РасчетСреднего");
				СекцияРасчетСреднегоДоп = Макет.ПолучитьОбласть("РасчетСреднегоДоп");
				
				// вывод данных о сумме заработка за расчетный период
				НомерСтроки = 0;
				ИтогоЗаработок = 0;
				ИтогоЗаработокОсовр = 0;  КолМесяцев = 0;
				
				//Аверсон ЕАЕ 19.10.2022 СВФР-009668
				ИтогоОтработаноЧасов = 0;
				//Аверсон СВФР-009668
				
				Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
					
					НомерСтроки = НомерСтроки  + 1;
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					ОписаниеСуммы = "Заработок " +  Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
					Коэфф = Окр(ВыборкаСреднегозаработка.КоэффициентИндексации,4,1);
					СуммаРасчета =  Формат(ВыборкаСреднегоЗаработка.Результат * ВыборкаСреднегозаработка.КоэффициентИндексации,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
					Если ВыборкаСреднегоЗаработка.Включать Тогда
						Включать = "вкл.";
						ИтогоЗаработок = ИтогоЗаработок + ВыборкаСреднегоЗаработка.Результат;
						ИтогоЗаработокОсовр = ИтогоЗаработокОсовр + ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСреднегоЗаработка.Результат * ВыборкаСреднегозаработка.КоэффициентИндексации,ПериодРегистрации,1);//О.Т. Аверсон 15.03.2016 № 949
						КолМесяцев = КолМесяцев + ВыборкаСреднегоЗаработка.ЧислоМесяцев;//О.Т. Аверсон 04.01.2016 № 816
						
						//Аверсон ЕАЕ 19.10.2022 СВФР-009668
						ИтогоОтработаноЧасов = ИтогоОтработаноЧасов + ВыборкаСреднегоЗаработка.ОтработаноЧасов;
						//Аверсон СВФР-009668
						Если Этотобъект.РасчетПриНеполныхМесяцах Тогда
						   Включать=ВыборкаСреднегоЗаработка.ОтработаноЧасов;
						КонецЕсли;
					Иначе
						Включать = "не вкл.";
					КонецЕсли;
					
					
					Если НомерСтроки <= 12 Тогда
						СекцияРасчетСреднего.Параметры["Год" + НомерСтроки] 		= Год(ВыборкаСреднегоЗаработка.МесяцВыборки);
						СекцияРасчетСреднего.Параметры["Месяц" + НомерСтроки] 		= Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки);
						СекцияРасчетСреднего.Параметры["Сумма" + НомерСтроки] 		= ОписаниеСуммы;
						СекцияРасчетСреднего.Параметры["Коэфф" + НомерСтроки] 		= Коэфф;
						СекцияРасчетСреднего.Параметры["ОсоврСумма" + НомерСтроки] 	= СуммаРасчета;
						СекцияРасчетСреднего.Параметры["Включать" + НомерСтроки] 	= Включать;
						
						Если НомерСтроки = 12  Тогда
							//толик				Сообщить("Бланк формы не позволяет отразить более 12 записей заработка!");		
						КонецЕсли; 
					иначе
						Если НомерСтроки = 13 Тогда
							ТабДокумент.Вывести(СекцияРасчетСреднего);
						КонецЕсли;
						СекцияРасчетСреднегоДоп.Параметры["Год"] 		= Год(ВыборкаСреднегоЗаработка.МесяцВыборки);
						СекцияРасчетСреднегоДоп.Параметры["Месяц"] 		= Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки);
						СекцияРасчетСреднегоДоп.Параметры["Сумма"] 		= ОписаниеСуммы;
						СекцияРасчетСреднегоДоп.Параметры["Коэфф"] 		= Коэфф;
						СекцияРасчетСреднегоДоп.Параметры["ОсоврСумма"] 	= СуммаРасчета;
						СекцияРасчетСреднегоДоп.Параметры["Включать"] 	= Включать;
						ТабДокумент.Вывести(СекцияРасчетСреднегоДоп);
					КонецЕсли;
				КонецЦикла; 
				
				СтрокиГодовойПремии = РасчетСреднегоПоКалендарным.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии));
				Если СтрокиГодовойПремии.Количество() <> 0 тогда
					СуммаПремии = 0;
					Для каждого СтрокаПремии из СтрокиГодовойПремии цикл
						СуммаПремии = СуммаПремии + СтрокаПремии.Результат;
					КонецЦикла;
					
					Если СуммаПремии <> 0 тогда
						ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
						Если ПериодРегистрации>= Дата(2016,07,1) Тогда //О.Т. Аверсон 22.06.2016 № 949
							ОписаниеСуммы = "ГодоваяПремия "+ Формат(СуммаПремии,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
						иначе                 						
							ОписаниеСуммы = "ГодоваяПремия "+ Формат(СуммаПремии,"ЧЦ=15; ЧДЦ=2");
						КонецЕсли;
						Коэфф = СтрокиГодовойПремии[0].КоэффициентИндексации;
						СуммаРасчета = Формат(СуммаПремии * Коэфф,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
						Если ВыборкаСреднегоЗаработка.Включать Тогда
							Включать = "вкл.";
						Иначе
							Включать = "не вкл.";
						КонецЕсли;
						Если НомерСтроки <= 12 Тогда
							СекцияРасчетСреднего.Параметры["Год" + (НомерСтроки + 1)] 			= Год(СтрокиГодовойПремии[0].МесяцВыборки);
							СекцияРасчетСреднего.Параметры["Месяц" + (НомерСтроки + 1)]			= Месяц(СтрокиГодовойПремии[0].МесяцВыборки);
							СекцияРасчетСреднего.Параметры["Сумма" + (НомерСтроки + 1)] 		= ОписаниеСуммы;
							СекцияРасчетСреднего.Параметры["Коэфф" + (НомерСтроки + 1)] 		= Коэфф;
							СекцияРасчетСреднего.Параметры["ОсоврСумма" + (НомерСтроки + 1)] 	= СуммаРасчета;
							СекцияРасчетСреднего.Параметры["Включать" + (НомерСтроки + 1)] 	= Включать;
						иначе
							Если НомерСтроки = 13 Тогда
								ТабДокумент.Вывести(СекцияРасчетСреднего);
							КонецЕсли;
							СекцияРасчетСреднегоДоп.Параметры["Год"] 		= Год(ВыборкаСреднегоЗаработка.МесяцВыборки);
							СекцияРасчетСреднегоДоп.Параметры["Месяц"] 		= Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки);
							СекцияРасчетСреднегоДоп.Параметры["Сумма"] 		= ОписаниеСуммы;
							СекцияРасчетСреднегоДоп.Параметры["Коэфф"] 		= Коэфф;
							СекцияРасчетСреднегоДоп.Параметры["ОсоврСумма"] 	= СуммаРасчета;
							СекцияРасчетСреднегоДоп.Параметры["Включать"] 	= Включать;
							ТабДокумент.Вывести(СекцияРасчетСреднегоДоп);
							
						КонецЕсли;
						
						Если ВыборкаСреднегоЗаработка.Включать Тогда
							ИтогоЗаработок = ИтогоЗаработок + СуммаПремии;
							ИтогоЗаработокОсовр = ИтогоЗаработокОсовр + СуммаПремии * Коэфф;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				//// вывод среднедневного (часового) заработка
				//Если ИспользуемыйВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням Тогда
				//	СекцияРасчетСреднего.Параметры.ОтработаноДнейДляРасчетаОтпуска = ОтработаноДнейДляРасчетаОтпуска;
				//	СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = ?(ЗначениеНеЗаполнено(ОтработаноДнейДляРасчетаОтпуска), 0, ИтогоЗаработок/ОтработаноДнейДляРасчетаОтпуска);
				//Иначе
				//	СекцияРасчетСреднего.Параметры.ОтработаноЧасовЗаРасчетныйПериод = ОтработаноЧасовЗаРасчетныйПериод;
				//	СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = ?(ЗначениеНеЗаполнено(ОтработаноЧасовЗаРасчетныйПериод), 0, ИтогоЗаработок/ОтработаноЧасовЗаРасчетныйПериод);
				//КонецЕсли; 
				
				Если НомерСтроки <= 12 Тогда
					ТабДокумент.Вывести(СекцияРасчетСреднего);
				КонецЕсли;
			КонецЕсли;
			//Усков Сергей 07.08.2013 № 16701-
			
			// итого средний заработок
			СекцияРасчетСреднегоИтого = Макет.ПолучитьОбласть("РасчетСреднегоИтого");
			//Усков Сергей 12.08.2013 № 16701+
			СекцияРасчетСреднегоИтогоРасшифровка = Макет.ПолучитьОбласть("РасчетСреднегоИтогоРасшифровка");
			СекцияРасчетСреднегоШапка = Макет.ПолучитьОбласть("РасчетСреднегоШапка");
			//Усков Сергей 12.08.2013 № 16701-
			//толик
			
			СрКолвоКДн = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ЭтотОбъект.ПериодРегистрации),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячноеКалендДней)).Размер; //Аверсон 19.04.2022 КВВ СВФР-008957
			СекцияРасчетСреднегоИтогоРасшифровка.Параметры.СрКолвоКДн = СрКолвоКДн;  //Аверсон 19.04.2022 КВВ СВФР-008957
			Если ЭтотОбъект.РучнойРасчетСреднегоЗаработка Тогда
				СекцияРасчетСреднегоИтогоРасшифровка.Параметры.КоличествоМесяцев  = "Ручной ввод";
				СекцияРасчетСреднегоИтогоРасшифровка.Параметры.СреднийЗаработок  = Формат(ЭтотОбъект.РазмерСреднегоЗаработка, "ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"4"));//Островская Татьяна 18.04.2014 № 17287
				ТабДокумент.Вывести(СекцияРасчетСреднегоШапка);
			Иначе
				СекцияРасчетСреднегоИтого.Параметры.ИтогоЗаработок  = ИтогоЗаработок;
				СекцияРасчетСреднегоИтого.Параметры.ИтогоЗаработокОсовр  = ИтогоЗаработокОсовр;
				СекцияРасчетСреднегоИтогоРасшифровка.Параметры.КоличествоМесяцев  = КолМесяцев;				
				
				//Аверсон ЕАЕ 19.10.2022 СВФР-009668
				Если ЭтотОбъект.РасчетПриНеполныхМесяцах Тогда
					СрНормаЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(НачалоМесяца(ЭтотОбъект.ПериодРегистрации),Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов)).Размер;
					СекцияРасчетСреднегоИтогоРасшифровка.Параметры.СреднийЗаработок = Формат(?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Окр((ИтогоЗаработокОсовр / ИтогоОтработаноЧасов) * СрНормаЧасов / СрКолвоКДн,ЗначениеТочностьСреднего),
					(ИтогоЗаработокОсовр / ИтогоОтработаноЧасов) * СрНормаЧасов / СрКолвоКДн),"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"0"));
					СекцияРасчетСреднегоИтого.Параметры.ИтогоЧасы = ИтогоОтработаноЧасов;  
					РасчетПриНеполныхТ = "Расчет при неполных месяцах:"+ИтогоЗаработокОсовр+"/"+ИтогоОтработаноЧасов+"*"+СрНормаЧасов+"/"+СрКолвоКДн;

				Иначе
				//Аверсон СВФР-009668
				
					СекцияРасчетСреднегоИтогоРасшифровка.Параметры.СреднийЗаработок  = Формат(?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Окр(ИтогоЗаработокОсовр/(?(КолМесяцев = 0, 1, КолМесяцев) * СрКолвоКДн),ЗначениеТочностьСреднего),
					ИтогоЗаработокОсовр/(?(КолМесяцев = 0, 1, КолМесяцев) * СрКолвоКДн)),"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"0"));
				КонецЕсли;

				
				//Островская Татьяна 17.04.2014 № 17287
				ТабДокумент.Вывести(СекцияРасчетСреднегоИтого);
			КонецЕсли;
			ТабДокумент.Вывести(СекцияРасчетСреднегоИтогоРасшифровка);
		КонецЕсли;
		
		
		// Вывод подвала
		СекцияПодвал = Макет.ПолучитьОбласть("Подвал");
		//СекцияПодвал.Параметры.ДнейЧасовКомпенсацииОтпуска = ДнейЧасовКомпенсацииОтпуска;
		//СекцияПодвал.Параметры.РезультатКомпенсацииОтпуска = РезультатКомпенсацииОтпуска;
		Если ЭтотОбъект.РасчетПриНеполныхМесяцах Тогда
			СекцияПодвал.Параметры.РасчетПриНеполных=РасчетПриНеполныхТ;
		КонецЕсли;
		СекцияПодвал.Параметры.СтрТекущийМесяц = ПредставлениеПериода(НачалоМесяца(ДатаНачалаСобытия), КонецМесяца(ДатаНачалаСобытия));
		//Усков Сергей 07.08.2013 № 16701+
		//СекцияПодвал.Параметры.ДнейКОплатеЗаТекущийМесяц = "" + ДнейКОплатеОсновногоОтпускаЗаТекущийМесяц + ?(ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц = 0, "", "(" + ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц + ")"); 
		СекцияПодвал.Параметры.ДнейКОплатеЗаТекущийМесяц = "" + (ДнейКОплатеОсновногоОтпускаЗаТекущийМесяц+КоличествоДнейКомпенсации) + ?(ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц = 0, "", "(" + ДнейКОплатеДополнительногоОтпускаЗаТекущийМесяц + ")"); 
		//Усков Сергей 07.08.2013 № 16701-
		СекцияПодвал.Параметры.НачисленоОтпускныхЗаТекущийМесяц = НачисленоОтпускныхЗаТекущийМесяц;
		
		//+ СВЭЙ КДЯ 23.10.19 СВФР-004966
		//Если Месяц(ДатаОкончанияСобытия)>Месяц(ДатаНачалаСобытия) или Год(ДатаОкончанияСобытия)>Год(ДатаНачалаСобытия) Тогда //Островская Татьяна 09.01.2014 № 17010
		//	СекцияПодвал.Параметры.ДнейКОплатеЗаБудущиеМесяцы = "" + ?(ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы = 0, "", ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы) + ?(ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы = 0, "", "(" + ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы + ")"); 
		//	СекцияПодвал.Параметры.СтрБудущиеМесяцы = ПредставлениеПериода(КонецМесяца(ДатаНачалаСобытия) +1, КонецМесяца(ДатаОкончанияСобытия));
		//	СекцияПодвал.Параметры.НачисленоОтпускныхЗаБудущиеМесяцы = НачисленоОтпускныхЗаБудущиеМесяцы;
		//КонецЕсли; 
		//- СВЭЙ КДЯ 23.10.19 СВФР-004966
		
		//+ СВЭЙ КДЯ 23.10.19 СВФР-004966
		ИнтегрированнаяДатаОкончанияОтпуска = Макс( ДатаОкончанияСобытия, 
		ДатаОкончанияОсновногоОтпуска, ДатаОкончанияДополнительногоОтпуска,
		ДатаОкончанияДополнительногоОтпуска1, ДатаОкончанияДополнительногоОтпуска2 );
		
		Если Месяц(ИнтегрированнаяДатаОкончанияОтпуска)>Месяц(ДатаНачалаСобытия) или Год(ИнтегрированнаяДатаОкончанияОтпуска)>Год(ДатаНачалаСобытия) Тогда
			СекцияПодвал.Параметры.ДнейКОплатеЗаБудущиеМесяцы = "" + ?( ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы = 0, "", ДнейКОплатеОсновногоОтпускаЗаБудущиеМесяцы ) 
			+ ?( ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы = 0, "", "(" + ДнейКОплатеДополнительногоОтпускаЗаБудущиеМесяцы + ")" ); 
			СекцияПодвал.Параметры.СтрБудущиеМесяцы = ПредставлениеПериода(КонецМесяца(ДатаНачалаСобытия) +1, КонецМесяца(ИнтегрированнаяДатаОкончанияОтпуска));
			СекцияПодвал.Параметры.НачисленоОтпускныхЗаБудущиеМесяцы = НачисленоОтпускныхЗаБудущиеМесяцы;
		КонецЕсли;
		//- СВЭЙ КДЯ 23.10.19 СВФР-004966
		
		СекцияПодвал.Параметры.ВсегоНачислено = ВсегоНачисленоОтпускных;
		//+СВЭЙ КДЯ 04.04.2019 СВФР-004099
		СекцияПодвал.Параметры.ВсегоНачисленоПрописью = РаботаСДиалогами.СформироватьСуммуПрописью( 
		ВсегоНачисленоОтпускных, Константы.ВалютаРегламентированногоУчета.Получить() );
		//-СВЭЙ КДЯ 04.04.2019 СВФР-004099
		//Островская Татьяна 12.02.2013 № 16216
		СтруктураОтветственный = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Ответственный);
		
		СекцияПодвал.Параметры.ДолжностьФИО = СтруктураОтветственный.Должность;
		СекцияПодвал.Параметры.ОтветственныйФИО = СтруктураОтветственный.ФИО;
		//Островская Татьяна 12.02.2013 № 16216
		//СекцияПодвал.Параметры.СуммаНДФЛ = СуммаНДФЛ;
		
		// вывод сумм прочих процентных удержаний
		//ВсегоУдержано = СуммаНДФЛ;
		//НомерУдержания = 1;             
		//СуммаУдержания = Окр((ВсегоНачисленоОтпускных ) * 1 / 100,0,1);
		//СекцияПодвал.Параметры.Имя17 = "Пенсионный фонд";
		//СекцияПодвал.Параметры["СуммаУдержания" + НомерУдержания] = СуммаУдержания;
		//ВсегоУдержано = ВсегоУдержано + СуммаУдержания;
		//Пока ВыборкаУдержаний.Следующий() Цикл
		//	НомерУдержания = НомерУдержания + 1;
		//	СуммаУдержания = (ВсегоНачисленоОтпускных - СуммаНДФЛ) * ВыборкаУдержаний.Размер / 100;
		//	ВсегоУдержано = ВсегоУдержано + СуммаУдержания;
		//	Если НомерУдержания<=5 Тогда
		//		СекцияПодвал.Параметры["СуммаУдержания" + НомерУдержания] = СуммаУдержания;
		//	КонецЕсли; 
		//	Если НомерУдержания=5 Тогда
		//		Сообщить("Бланк формы не позволяет отразить более 6 удержаний!");		
		//	КонецЕсли; 
		//КонецЦикла; 
		
		КВыплате = ВсегоНачисленоОтпускных;
		//СекцияПодвал.Параметры.СуммаУдержания6 = ВсегоУдержано;
		//СекцияПодвал.Параметры.КВыплате = КВыплате;
		СекцияПодвал.Параметры.КВыплатеПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(КВыплате, Константы.ВалютаРегламентированногоУчета.Получить());
		СекцияПодвал.Параметры.КВыплатеРубли = Цел(КВыплате);
		СекцияПодвал.Параметры.КВыплатеКопейки = ОбщегоНазначения.ОкруглитьЗначение2016((КВыплате - Цел(КВыплате)) * 100,ДатаНачалаСобытия);//О.Т. Аверсон 14.03.2016 № 949
		
		ТабДокумент.Вывести(СекцияПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ60()
	
#КонецЕсли

// Выполняет проверку непрерывности интервалов начислений
//
Процедура ПроверитьНепрерывностьЗаписейНачислений(Отказ)
	
	Если Начисления.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;
	
	ТНачислений = Начисления.Выгрузить();
	ТНачислений.Сортировать("ДатаНачала");
	
	ПредыдущаяДатаОкончания = '00010101';
	СтрокаНеПервая = Ложь;
	Для Каждого Строка ИЗ ТНачислений Цикл
		
		Если Строка.Сторно ИЛИ Строка.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни
			И Строка.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка
			И Строка.ВидРасчета <> ВидРасчетаДополнительногоОтпуска Тогда
			Возврат;
		КонецЕсли;
		
		// если встретили не первую строку начислений
		Если СтрокаНеПервая Тогда
			// строка не первая
			Если Строка.ДатаНачала <> ПредыдущаяДатаОкончания + мДлинаСуток Тогда
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
				""" табл. части ""Начисления"": ";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "нарушено требование непрерывности записей начислений!", Отказ);
			КонецЕсли;
			
		Иначе
			СтрокаНеПервая = Истина;
			
		КонецЕсли;
		ПредыдущаяДатаОкончания = Строка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНепрерывностьЗаписейНачислений()

// Формирует соответствие в котором находятся действующие графики сотрудника 
// на указанные даты
Функция ПолучитьГрафикРаботыСотрудника(Сотрудник, ДатыПолучения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СписокДат", ДатыПолучения);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботыПоВидамВремени.Месяц КАК ДатаПолучения
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.Месяц В(&СписокДат)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДатаПолучения");
	
КонецФункции // ПолучитьГрафикРаботыСотрудника()

// Формирует записи регистра "ОсновныеНачисленияРаботниковОрганизаций" по данным шапки документа
//
Процедура СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборОсновныеНачисления, НаборДополнительныеНачисления) Экспорт
	
	ДатаНачалаСобытия = ПолучитьДатуНачалаСобытия();
	ВидУчетаВремени = ВыборкаПоШапкеДокумента.ВидУчетаВремени; 
	
	// сформируем записи начислений по основному отпуску
	Если ЗначениеЗаполнено(ДатаНачалаОсновногоОтпуска) Тогда
		
		МассивДат = Новый Массив;
		ТекущаяДатаНачала = ДатаНачалаОсновногоОтпуска;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОсновногоОтпуска);
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			МассивДат.Добавить(НачалоМесяца(ТекущаяДатаНачала));
			
			ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
			ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОсновногоОтпуска);
		КонецЦикла;
		МесяцыРасчетаВремениПоТабелю = ПолучитьГрафикРаботыСотрудника(ВыборкаПоШапкеДокумента.Сотрудник, МассивДат);
		ТекущаяДатаНачала = ДатаНачалаОсновногоОтпуска;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОсновногоОтпуска);
		
		//Островская Татьяна 13.03.2014 № 17148
		если Организация.ИНН = "100765738" Тогда 
			
			для Каждого стрОтпуск из Отпуска Цикл 
				если стрОтпуск.ФлагИстина Тогда
					ТекущаяДатаНачала = стрОтпуск.ДатаНачала;
					ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), стрОтпуск.ДатаОкончания);
					Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
						
						// строка движений
						Движение = НаборОсновныеНачисления.Добавить();
						
						// Свойства
						Движение.ПериодРегистрации			= ПериодРегистрации;
						Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
						Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
						Движение.ВидРасчета					= стрОтпуск.ВидОтпуска.ВидРасчета;
						
						// Измерения
						Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
						Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
						Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
						
						// Реквизиты
						Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплатыОсновногоОтпуска;
						Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
						Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
						
						//Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
						//	Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
						//Иначе
						//	Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
						//КонецЕсли; 
						
						//заявка №1745 (база заявок Кристалла) Дмитрук О.Г.
						Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
						//заявка №1745 
						
						Движение.ВидУчетаВремени			= ВидУчетаВремени;
						Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаОсновногоОтпускаНачало;
						Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
						Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
						Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
						Если Движение.РучнойРасчетСреднегоЗаработка тогда
							Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
						КонецЕсли;
						Движение.Авторасчет					= Истина;
						
						ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
						ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), стрОтпуск.ДатаОкончания);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		иначе
			
			
			Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
				
				// строка движений
				Движение = НаборОсновныеНачисления.Добавить();
				
				// Свойства
				Движение.ПериодРегистрации			= ПериодРегистрации;
				Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
				Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
				Движение.ВидРасчета					= ВыборкаПоШапкеДокумента.ВидРасчетаОсновногоОтпуска;
				
				// Измерения
				Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
				Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
				Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
				
				// Реквизиты
				Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплатыОсновногоОтпуска;
				Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
				Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
				
				//заявка №1745 (база заявок Кристалла) Дмитрук О.Г.
				//Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
				//заявка №1745 
				
				//Аверсон 30.03.2020 КВВ СВФР-005746 (
				Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
					Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
				Иначе
					Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
				КонецЕсли; 
				//Аверсон 30.03.2020 КВВ СВФР-005746 )
				
				Движение.ВидУчетаВремени			= ВидУчетаВремени;
				Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаОсновногоОтпускаНачало;
				Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
				Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
				Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
				Если Движение.РучнойРасчетСреднегоЗаработка тогда
					Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
				КонецЕсли;
				Движение.Авторасчет					= Истина;
				
				ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
				ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОсновногоОтпуска);
			КонецЦикла;
		КонецЕсли;
		//Островская Татьяна 13.03.2014 № 17148
		
	КонецЕсли;
	
	// сформируем записи начислений по дополнительному отпуску
	Если ЗначениеЗаполнено(ДатаНачалаДополнительногоОтпуска) Тогда
		
		МассивДат = Новый Массив;
		ТекущаяДатаНачала = ДатаНачалаДополнительногоОтпуска;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска);
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			МассивДат.Добавить(НачалоМесяца(ТекущаяДатаНачала));
			ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
			ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска);
		КонецЦикла;
		МесяцыРасчетаВремениПоТабелю = ПолучитьГрафикРаботыСотрудника(ВыборкаПоШапкеДокумента.Сотрудник, МассивДат);
		
		ТекущаяДатаНачала = ДатаНачалаДополнительногоОтпуска;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска);
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			// строка движений
			Движение = НаборОсновныеНачисления.Добавить();
			
			// Свойства
			Движение.ПериодРегистрации			= ПериодРегистрации;
			Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
			Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
			Движение.ВидРасчета					= ВыборкаПоШапкеДокумента.ВидРасчетаДополнительногоОтпуска;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Реквизиты
			Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплатыДополнительногоОтпуска;
			Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
			Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
			
			Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
			Иначе
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
			КонецЕсли; 
			
			Движение.ВариантАлгоритмаРасчета	= ВыборкаПоШапкеДокумента.ВариантАлгоритмаРасчета;
			Движение.ВидУчетаВремени			= ВидУчетаВремени;
			Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаДополнительногоОтпускаНачало;
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
			Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
			Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
			Если Движение.РучнойРасчетСреднегоЗаработка тогда
				Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
			КонецЕсли;
			Движение.Авторасчет					= Истина;
			
			ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
			ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска);
			
		КонецЦикла;
	КонецЕсли; 
	
	// сформируем записи начислений по компенсации отпуска
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска > 0 Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		
		// Свойства
		Движение.ПериодРегистрации							= Мин(КонецМесяца(ПериодРегистрации),Макс(ПериодРегистрации,ВыборкаПоШапкеДокумента.Дата));
		Движение.ВидРасчета									= ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска;
		
		// Измерения
		Движение.Сотрудник									= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ФизЛицо									= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.Организация								= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		Движение.ОплаченоДнейЧасов							= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска;
		
		// Реквизиты
		Движение.Показатель1								= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска;
		Движение.ГрафикРаботы								= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		Движение.ВидУчетаВремени							= ВыборкаПоШапкеДокумента.ВидУчетаВремени;
		Движение.ДатаНачалаСобытия							= ПолучитьДатуНачалаСобытия();
		Движение.ПодразделениеОрганизации					= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение					= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		
		Движение.ПериодРасчетаСреднегоЗаработкаНачало		= ВыборкаПоШапкеДокумента.ПериодРасчетаКомпенсацииОтпускаНачало;
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
		Если Движение.РучнойРасчетСреднегоЗаработка тогда
			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
		КонецЕсли;
		Движение.Авторасчет									= Истина;
		
	КонецЕсли;
	//Аверсон 24.06.2019 КВВ СВФР-004428 (
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2 > 0 Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации							= Мин(КонецМесяца(ПериодРегистрации),Макс(ПериодРегистрации,ВыборкаПоШапкеДокумента.Дата));
		Движение.ВидРасчета									= ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска2;
		Движение.Сотрудник									= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ФизЛицо									= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.Организация								= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ОплаченоДнейЧасов							= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2;
		Движение.Показатель1								= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2;
		Движение.ГрафикРаботы								= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		Движение.ВидУчетаВремени							= ВыборкаПоШапкеДокумента.ВидУчетаВремени;
		Движение.ДатаНачалаСобытия							= ПолучитьДатуНачалаСобытия();
		Движение.ПодразделениеОрганизации					= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение					= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало		= ВыборкаПоШапкеДокумента.ПериодРасчетаКомпенсацииОтпускаНачало2;
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
		Если Движение.РучнойРасчетСреднегоЗаработка тогда
			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
		КонецЕсли;
		Движение.Авторасчет									= Истина;
	КонецЕсли;
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3 > 0 Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации							= Мин(КонецМесяца(ПериодРегистрации),Макс(ПериодРегистрации,ВыборкаПоШапкеДокумента.Дата));
		Движение.ВидРасчета									= ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска3;
		Движение.Сотрудник									= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ФизЛицо									= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.Организация								= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ОплаченоДнейЧасов							= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3;
		Движение.Показатель1								= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3;
		Движение.ГрафикРаботы								= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		Движение.ВидУчетаВремени							= ВыборкаПоШапкеДокумента.ВидУчетаВремени;
		Движение.ДатаНачалаСобытия							= ПолучитьДатуНачалаСобытия();
		Движение.ПодразделениеОрганизации					= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение					= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало		= ВыборкаПоШапкеДокумента.ПериодРасчетаКомпенсацииОтпускаНачало3;
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
		Если Движение.РучнойРасчетСреднегоЗаработка тогда
			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
		КонецЕсли;
		Движение.Авторасчет									= Истина;
	КонецЕсли;
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4 > 0 Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации							= Мин(КонецМесяца(ПериодРегистрации),Макс(ПериодРегистрации,ВыборкаПоШапкеДокумента.Дата));
		Движение.ВидРасчета									= ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска4;
		Движение.Сотрудник									= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ФизЛицо									= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.Организация								= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ОплаченоДнейЧасов							= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4;
		Движение.Показатель1								= ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4;
		Движение.ГрафикРаботы								= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		Движение.ВидУчетаВремени							= ВыборкаПоШапкеДокумента.ВидУчетаВремени;
		Движение.ДатаНачалаСобытия							= ПолучитьДатуНачалаСобытия();
		Движение.ПодразделениеОрганизации					= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение					= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало		= ВыборкаПоШапкеДокумента.ПериодРасчетаКомпенсацииОтпускаНачало4;
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
		Если Движение.РучнойРасчетСреднегоЗаработка тогда
			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
		КонецЕсли;
		Движение.Авторасчет									= Истина;
	КонецЕсли;
	//Аверсон 24.06.2019 КВВ СВФР-004428 )
	
	//толик
	// сформируем записи начислений по дополнительному отпуску
	Если ЗначениеЗаполнено(ДатаНачалаДополнительногоОтпуска1) Тогда
		
		ТекущаяДатаНачала = ДатаНачалаДополнительногоОтпуска1;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска1);
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			// строка движений
			Движение = НаборОсновныеНачисления.Добавить();
			
			// Свойства
			Движение.ПериодРегистрации			= ПериодРегистрации;
			Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
			Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
			Движение.ВидРасчета					= ВыборкаПоШапкеДокумента.ВидРасчетаДополнительногоОтпуска1;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Реквизиты
			Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплатыДополнительногоОтпуска;
			Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
			Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
			
			Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
			Иначе
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
			КонецЕсли; 
			
			Движение.ВариантАлгоритмаРасчета	= ВыборкаПоШапкеДокумента.ВариантАлгоритмаРасчета;
			Движение.ВидУчетаВремени			= ВидУчетаВремени;
			Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаДополнительногоОтпускаНачало;
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
			Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
			Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
			Если Движение.РучнойРасчетСреднегоЗаработка тогда
				Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
			КонецЕсли;
			Движение.Авторасчет					= Истина;
			
			ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
			ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска1);
			
		КонецЦикла;
	КонецЕсли; 
	
	// сформируем записи начислений по дополнительному отпуску
	Если ЗначениеЗаполнено(ДатаНачалаДополнительногоОтпуска2) Тогда
		
		ТекущаяДатаНачала = ДатаНачалаДополнительногоОтпуска2;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска2);
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			// строка движений
			Движение = НаборОсновныеНачисления.Добавить();
			
			// Свойства
			Движение.ПериодРегистрации			= ПериодРегистрации;
			Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
			Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
			Движение.ВидРасчета					= ВыборкаПоШапкеДокумента.ВидРасчетаДополнительногоОтпуска2;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Реквизиты
			Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплатыДополнительногоОтпуска;
			Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
			Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
			
			Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
			Иначе
				Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
			КонецЕсли; 
			
			Движение.ВариантАлгоритмаРасчета	= ВыборкаПоШапкеДокумента.ВариантАлгоритмаРасчета;
			Движение.ВидУчетаВремени			= ВидУчетаВремени;
			Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаДополнительногоОтпускаНачало;
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
			Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
			Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
			Если Движение.РучнойРасчетСреднегоЗаработка тогда
				Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
			КонецЕсли;
			Движение.Авторасчет					= Истина;
			
			ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
			ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияДополнительногоОтпуска2);
			
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры // СформироватьДвиженияПоНачислениям()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(РассчитываемыеТаблицы=Неопределено)
	
	ДатаНачалаСобытия = ПолучитьДатуНачалаСобытия();
	//толик	
	//добавил для определения ести ли зарплата в этом начале периода
	Если РассчитываемыеТаблицы <> Неопределено Тогда
		Если РассчитываемыеТаблицы.РасчетСреднего Тогда
			мНетЗпВТекущемМесяце = 0;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА Начисления.Результат ЕСТЬ NULL 
			|				ТОГДА 0
			|			ИНАЧЕ Начисления.Результат
			|		КОНЕЦ) КАК Результат
			|ИЗ
			|	(ВЫБРАТЬ                                                           
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(Планвидоврасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет) //О.Т. Аверсон 18.12.2017 № 1360
			|				ТОГДА 1
			|			ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
			|		КОНЕЦ КАК Результат
			
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|	ГДЕ
			|		НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
			|		И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДополнительныеНачисленияРаботниковОрганизаций.Результат
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|	ГДЕ
			|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
			|		И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник) КАК Начисления";
			Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -1)));
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			мСтрока = Запрос.Выполнить().Выбрать(); 
			мСтрока.Следующий();
			Если не ЗначениеЗаполнено(мСтрока.Результат) Тогда
				если не ЗначениеЗаполнено(ДатаНачалаВыборки) Тогда //О.Т. 04.08.2014 № 142
					мНетЗпВТекущемМесяце = -1;
				КонецЕсли;
			КонецЕсли;
			ДатаНачалаСобытия = ДобавитьМесяц(ДатаНачалаСобытия, мНетЗпВТекущемМесяце);
		КонецЕсли;
	Иначе
		мНетЗпВТекущемМесяце = 0;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА Начисления.Результат ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ Начисления.Результат
		|		КОНЕЦ) КАК Результат
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
		|		И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &ПериодРегистрации
		|		И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник) КАК Начисления";
		Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ДобавитьМесяц(ДатаНачалаСобытия, -1)));
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		мСтрока = Запрос.Выполнить().Выбрать(); 
		мСтрока.Следующий();
		Если не ЗначениеЗаполнено(мСтрока.Результат) Тогда
			если не ЗначениеЗаполнено(ДатаНачалаВыборки) Тогда //О.Т. 04.08.2014 № 142
				мНетЗпВТекущемМесяце = -1;
			КонецЕсли;
		КонецЕсли;
		ДатаНачалаСобытия = ДобавитьМесяц(ДатаНачалаСобытия, мНетЗпВТекущемМесяце);
	КонецЕсли;
	//енд	
	//О.Т. Аверсон 25.05.2017 № 672
	ЗапросПрием = Новый Запрос;
	ЗапросПрием.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник = &Сотрудник
	|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
	|	И РаботникиОрганизаций.Организация = &Организация";
	
	ЗапросПрием.УстановитьПараметр("Организация", Организация);
	ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ДатаНачалаСобытия));
	ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ДатаНачалаСобытия));
	ЗапросПрием.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выбрать();	
	Пока РезультатЗапросаПрием.Следующий() Цикл
		//ДатаНачалаСобытия = ?(ДатаНачалаСобытия<РезультатЗапросаПрием.Период,РезультатЗапросаПрием.Период,ДатаНачалаСобытия);
		//ДатаНачалаСобытия = ?(ДатаНачалаСобытия<РезультатЗапросаПрием.Период И РезультатЗапросаПрием.Период <= ДатаНачалаОсновногоОтпуска,РезультатЗапросаПрием.Период,ДатаНачалаСобытия); //Аверсон 16.06.2021 КВВ СВФР-007735
		ДатаНачалаСобытия = ?(ДатаНачалаСобытия<РезультатЗапросаПрием.Период И РезультатЗапросаПрием.Период <= ?(значениезаполнено(ДатаНачалаОсновногоОтпуска),ДатаНачалаОсновногоОтпуска,Дата),РезультатЗапросаПрием.Период,ДатаНачалаСобытия); //дата осн отпуска пусто, берем прием
	КонецЦикла;
	//О.Т. Аверсон 25.05.2017 № 672
	
	
	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",		ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
	Запрос.УстановитьПараметр("МесяцевРасчетаПоЗакону",	?(ДатаНачалаСобытия < ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006(),3,12));
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Отпуск.Дата,
	|	Отпуск.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА Отпуск.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Отпуск.Организация
	|		ИНАЧЕ Отпуск.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА Отпуск.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Отпуск.Организация
	|		ИНАЧЕ Отпуск.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	Отпуск.Организация КАК ОбособленноеПодразделение,
	|	Отпуск.Ссылка,
	|	Отпуск.Сотрудник,
	|	Отпуск.Сотрудник.Физлицо КАК Физлицо,
	|	Отпуск.ДатаНачалаОсновногоОтпуска,
	|	Отпуск.ДатаОкончанияОсновногоОтпуска,
	|	Отпуск.ПорядокРасчетаОсновногоОтпуска,
	|	Отпуск.ДнейЧасовКомпенсацииОтпуска,
	//Аверсон 24.06.2019 КВВ СВФР-004428 (
	|	Отпуск.ДнейЧасовКомпенсацииОтпуска2,
	|	Отпуск.ДнейЧасовКомпенсацииОтпуска3,
	|	Отпуск.ДнейЧасовКомпенсацииОтпуска4,
	//Аверсон 24.06.2019 КВВ СВФР-004428 )
	|	Отпуск.ПорядокРасчетаКомпенсацииОтпуска,
	|	Отпуск.ДатаНачалаДополнительногоОтпуска,
	|	Отпуск.ДатаОкончанияДополнительногоОтпуска,
	|	Отпуск.ВидРасчетаДополнительногоОтпуска,
	//толик
	|	Отпуск.ДатаНачалаДополнительногоОтпуска1,
	|	Отпуск.ДатаОкончанияДополнительногоОтпуска1,
	|	Отпуск.ВидРасчетаДополнительногоОтпуска1,
	|	Отпуск.ДатаНачалаДополнительногоОтпуска2,
	|	Отпуск.ДатаОкончанияДополнительногоОтпуска2,
	|	Отпуск.ВидРасчетаДополнительногоОтпуска2,
	//	
	|	Отпуск.РучнойРасчетСреднегоЗаработка,
	|	Отпуск.РазмерСреднегоЗаработка,
	|	ВЫБОР
	|		КОГДА Отпуск.ИспользоватьСреднеЧасовойЗаработок
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	Отпуск.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	Отпуск.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	Отпуск.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	Отпуск.ПерерассчитываемыйДокумент.Сотрудник КАК СотрудникПерерасчета,
	|	ВЫБОР
	|		КОГДА  РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА  РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|		ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	100 КАК ПроцентОплатыОсновногоОтпуска,
	|	Отпуск.ПроцентОплатыДополнительногоОтпуска,
	|	&ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), СЕКУНДА, -1) КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|		КОГДА Отпуск.Сотрудник.Организация = ВЫБОР
	|				КОГДА Отпуск.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА Отпуск.Организация
	|				ИНАЧЕ Отпуск.Организация.ГоловнаяОрганизация
	|			КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА Отпуск.Дата < Отпуск.ПериодРегистрации
	|			ТОГДА Отпуск.ПериодРегистрации
	|		КОГДА Отпуск.Дата > КОНЕЦПЕРИОДА(Отпуск.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(Отпуск.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ Отпуск.Дата
	|	КОНЕЦ КАК ПериодРегистрацииДополнительныхНачислений";
	
	Если ЗначениеЗаполнено(ДатаНачалаОсновногоОтпуска) Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		//|	ВЫБОР
		//|			КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
		//|				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
		//|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
		//|		КОНЕЦ КАК ВидРасчетаОсновногоОтпуска,
		//|	ПараметрыВидаРасчетаОсновногоОтпуска.СпособРасчета КАК СпособРасчетаОсновногоОтпуска,
		//|	ВЫБОР
		//|		КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
		//|			ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
		//|		ИНАЧЕ &МесяцевРасчетаПоЗакону
		//|	КОНЕЦ КАК ПериодРасчетаОсновногоОтпуска,
		//|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -ВЫБОР
		//|			КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
		//|				ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
		//|			ИНАЧЕ &МесяцевРасчетаПоЗакону
		//|		КОНЕЦ) КАК ПериодРасчетаОсновногоОтпускаНачало";
		|	Отпуск.ВидРасчетаОсновногоОтпуска КАК ВидРасчетаОсновногоОтпуска,
		|	Отпуск.ВидРасчетаОсновногоОтпуска.СпособРасчета КАК СпособРасчетаОсновногоОтпуска,
		|	12 КАК ПериодРасчетаОсновногоОтпуска,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаОсновногоОтпускаНачало";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаДополнительногоОтпуска) Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		|	Отпуск.ВидРасчетаДополнительногоОтпуска.СпособРасчета КАК СпособРасчетаДополнительногоОтпуска,
		|	ВЫБОР
		|		КОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
		|				И Отпуск.ВидРасчетаДополнительногоОтпуска.ОбозначениеВТабелеУчетаРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыАлгоритмовРасчета.ОтпускСОплатойПраздничныхДней)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыАлгоритмовРасчета.ПустаяСсылка)
		|	КОНЕЦ КАК ВариантАлгоритмаРасчета,
		|	12 КАК ПериодРасчетаДополнительногоОтпуска,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаДополнительногоОтпускаНачало";
	КонецЕсли;
	
	Если ДнейЧасовКомпенсацииОтпуска > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		//|	ВЫБОР
		//|					КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
		//|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
		//|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
		//|				КОНЕЦ КАК ВидРасчетаКомпенсацииОтпуска,
		//|	ПараметрыВидаРасчетаКомпенсация.СпособРасчета КАК СпособРасчетаКомпенсацииОтпуска,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска КАК ВидРасчетаКомпенсацииОтпуска,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска.СпособРасчета КАК СпособРасчетаКомпенсацииОтпуска,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
		|	12 КАК ПериодРасчетаКомпенсацииОтпуска,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаКомпенсацииОтпускаНачало";
	КонецЕсли;
	//Аверсон 24.06.2019 КВВ СВФР-004428 (
	Если ДнейЧасовКомпенсацииОтпуска2 > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска2 КАК ВидРасчетаКомпенсацииОтпуска2,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска2.СпособРасчета КАК СпособРасчетаКомпенсацииОтпуска2,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска2.КодДоходаНДФЛ КАК КодДоходаНДФЛ2,
		|	12 КАК ПериодРасчетаКомпенсацииОтпуска2,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаКомпенсацииОтпускаНачало2";
	КонецЕсли;
	Если ДнейЧасовКомпенсацииОтпуска3 > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска3 КАК ВидРасчетаКомпенсацииОтпуска3,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска3.СпособРасчета КАК СпособРасчетаКомпенсацииОтпуска3,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска3.КодДоходаНДФЛ КАК КодДоходаНДФЛ3,
		|	12 КАК ПериодРасчетаКомпенсацииОтпуска3,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаКомпенсацииОтпускаНачало3";
	КонецЕсли;
	Если ДнейЧасовКомпенсацииОтпуска3 > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + ",
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска4 КАК ВидРасчетаКомпенсацииОтпуска4,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска4.СпособРасчета КАК СпособРасчетаКомпенсацииОтпуска4,
		|	Отпуск.ВидРасчетаКомпенсацииОтпуска4.КодДоходаНДФЛ КАК КодДоходаНДФЛ4,
		|	12 КАК ПериодРасчетаКомпенсацииОтпуска4,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачалаСобытия, МЕСЯЦ), МЕСЯЦ, -12) КАК ПериодРасчетаКомпенсацииОтпускаНачало4";
	КонецЕсли;
	//Аверсон 24.06.2019 КВВ СВФР-004428 )
	ТекстЗапроса = ТекстЗапроса + "
	|ИЗ
	|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (РаботникиОрганизацииСрезПоследних.Организация = ВЫБОР
	|				КОГДА Отпуск.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА Отпуск.Организация
	|				ИНАЧЕ Отпуск.Организация.ГоловнаяОрганизация
	|			КОНЕЦ)";
	//Если ЗначениеЗаполнено(ДатаНачалаОсновногоОтпуска) Тогда
	//	ТекстЗапроса = ТекстЗапроса + ",
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаОсновногоОтпуска
	//|		ПО (ПараметрыВидаРасчетаОсновногоОтпуска.Ссылка = ВЫБОР
	//|			КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	//|				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
	//|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
	//|		КОНЕЦ)";
	//КонецЕсли;
	//
	//Если ДнейЧасовКомпенсацииОтпуска > 0 Тогда
	//	ТекстЗапроса = ТекстЗапроса + "
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсация
	//|		ПО (ПараметрыВидаРасчетаКомпенсация.Ссылка = ВЫБОР
	//|					КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	//|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
	//|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
	//|				КОНЕЦ)";
	//КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ГДЕ
	|	Отпуск.Ссылка = &ДокументСсылка";
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части Начисления
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("Сотрудник",						Сотрудник);
	КодОплатыТрудаПоНДФЛ = Новый Массив;
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.КодДоходаПоУмолчанию);
	//РФ Отпускные
	//КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код2012);
	Запрос.УстановитьПараметр("КодОплатыТрудаПоНДФЛ", КодОплатыТрудаПоНДФЛ);
	ДатаНачалаСобытия = ПолучитьДатуНачалаСобытия();
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",				ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("МесяцевРасчетаПоЗакону",			?(ДатаНачалаСобытия < ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006(),3,12));
	//толик добавил отработано дней
	//убрал кадровые отпуска
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.Ссылка.Сотрудник,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	СтрокиНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	СтрокиНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
	|	СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
	|						ТОГДА СтрокиНачисления.ДатаНачала
	|					ИНАЧЕ СтрокиНачисления.Ссылка.ПериодРегистрации
	|				КОНЕЦ
	|		ИНАЧЕ СтрокиНачисления.Ссылка.ПериодРегистрации
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	СтрокиНачисления.ДатаНачала,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаОкончания,
	|	СтрокиНачисления.ДатаНачала КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	СтрокиНачисления.ДатаНачала КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Ссылка.ИспользоватьСреднеЧасовойЗаработок
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.ДополнительныеДанные,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.ОтработаноДнейПоПятидневке,
	|	СтрокиНачисления.ОтработаноЧасовПоПятидневке,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.НормаДнейПоПятидневке,
	|	СтрокиНачисления.НормаЧасовПоПятидневке,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаНачало КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаОкончание КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|							И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|				КОНЕЦ
	|		ИНАЧЕ СтрокиНачисления.Ссылка.Сотрудник
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка) КАК ГрафикРаботыНорма,
	|	СтрокиНачисления.ДатаНачалаСобытия,
	|	СтрокиНачисления.Сторно,
	|	СтрокиНачисления.Авторасчет,
	|	ВЫБОР
	|		КОГДА (НЕ СтрокиНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сторно
	|			ТОГДА СтрокиНачисления.СторнируемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	СтрокиНачисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления,
	|	СтрокиНачисления.ЧислоМесяцев,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЕжегодныхОтпусков.ПустаяСсылка)
	|		ИНАЧЕ СтрокиНачисления.ВидРасчета.ВидЕжегодногоОтпуска
	|	КОНЕЦ КАК ВидЕжегодногоОтпуска,
	|	ЛОЖЬ КАК ЕстьКадровыйОтпуск,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Компенсация,
	|	ЕСТЬNULL(ДанныеРегламентированногоКалендаря.ДнейОтпуска, СтрокиНачисления.ОплаченоДнейЧасов * ВЫБОР
	|			КОГДА СтрокиНачисления.Сторно
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ДнейОтпуска,
	|	СтрокиНачисления.РучнойРасчетСреднегоЗаработка,
	|	СтрокиНачисления.РазмерСреднегоЗаработка,
	|	СтрокиНачисления.ОплаченоДней
	|ИЗ
	|	Документ.НачислениеОтпускаРаботникамОрганизаций.Начисления КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			Документ.НачислениеОтпускаРаботникамОрганизаций.Начисления КАК СтрокиНачисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ПО (РаботникиОрганизации.Период <= СтрокиНачисления.ДатаНачалаСобытия)
	|					И СтрокиНачисления.Ссылка.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтрокиНачисления.НомерСтроки) КАК ПоследниеДаты
	|		ПО СтрокиНачисления.НомерСтроки = ПоследниеДаты.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО (РаботникиОрганизации.Период = ПоследниеДаты.МаксПериод)
	|			И СтрокиНачисления.Ссылка.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			Документ.НачислениеОтпускаРаботникамОрганизаций.Начисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СтрокиНачисления.Ссылка.Сотрудник)
	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаНачала, МЕСЯЦ))
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка) КАК ГрафикРаботыПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|			СУММА(ВЫБОР
	|					КОГДА СтрокиНачисления.ВидРасчета.ВидЕжегодногоОтпуска.СпособРасчетаОстаткаОтпуска = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОстаткаОтпуска.ПоРабочимДням)
	|						ТОГДА ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.Шестидневка, 0)
	|					ИНАЧЕ ЕСТЬNULL(РегламентированныйПроизводственныйКалендарь.КалендарныеДни, 0)
	|				КОНЕЦ) КАК ДнейОтпуска
	|		ИЗ
	|			Документ.НачислениеОтпускаРаботникамОрганизаций.Начисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|				ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ СтрокиНачисления.ДатаНачала И СтрокиНачисления.ДатаОкончания)
	|					И (СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1))
	|					И (СтрокиНачисления.Ссылка = &ДокументСсылка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтрокиНачисления.НомерСтроки) КАК ДанныеРегламентированногоКалендаря
	|		ПО СтрокиНачисления.НомерСтроки = ДанныеРегламентированногоКалендаря.НомерСтроки
	|ГДЕ
	|	СтрокиНачисления.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачислениям()

// Формирует запрос по таблице "РасчетСреднего" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРасчетСреднего()
	
	Запрос = Новый Запрос;
	ДатаНачалаСобытия = ПолучитьДатуНачалаСобытия();
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ПериодРасчетаСреднегоЗаработкаОкончание", НачалоМесяца(ДатаНачалаСобытия)-1);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",		НачалоМесяца(ДатаНачалаСобытия));
	Запрос.УстановитьПараметр("МесяцевРасчетаПоЗакону",	?(ДатаНачалаСобытия < ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006(),3,12));
	
	ГодовыеПремии = Новый Массив(4);
	ГодовыеПремии[0] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
	//ГодовыеПремии[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
	//ГодовыеПремии[2] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииНеИндексируемые;
	//ГодовыеПремии[3] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииНеИндексируемые;
	
	Запрос.УстановитьПараметр("ГодовыеПремии", ГодовыеПремии);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОЗаработке.НомерСтроки,
	|	ДанныеОЗаработке.ВидРасчета,
	|	ДанныеОЗаработке.БазовыйПериодНачало,
	|	ДанныеОЗаработке.БазовыйПериодКонец,
	|	ДанныеОЗаработке.ОтработаноПоПятидневке,
	|	ДанныеОЗаработке.НормаПоПятидневке,
	|	ДанныеОЗаработке.ОтработаноДней,
	|	ДанныеОЗаработке.ОтработаноЧасов,
	|	ДанныеОЗаработке.ЧислоМесяцев,
	|	ДанныеОЗаработке.КоэффициентИндексации,
	|	ДанныеОЗаработке.Результат,
	|   ДанныеОЗаработке.МесяцВыборки,
	|   ДанныеОЗаработке.Включать,
	|	Начисления.СпособРасчета,
	|	Начисления.ПериодРасчетаСреднегоЗаработкаНачало,
	|	&ПериодРасчетаСреднегоЗаработкаОкончание КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	Начисления.ПериодРасчетаСреднегоЗаработка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(&ДатаНачалаСобытия, МЕСЯЦ, -ВЫБОР
	|				КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|					ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|				ИНАЧЕ &МесяцевРасчетаПоЗакону
	|			КОНЕЦ) КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|		ВЫБОР
	|			КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|				ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|			ИНАЧЕ &МесяцевРасчетаПоЗакону
	|		КОНЕЦ КАК ПериодРасчетаСреднегоЗаработка,
	|		ВЫБОР
	|			КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке)
	|		КОНЕЦ КАК СпособРасчета
	|	ИЗ
	|		Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаОсновногоОтпуска
	|			ПО (ПараметрыВидаРасчетаОсновногоОтпуска.Ссылка = ВЫБОР
	|					КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
	|				КОНЕЦ)
	|	ГДЕ
	|		Отпуск.Ссылка = &ДокументСсылка
	|		И Отпуск.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(&ДатаНачалаСобытия, МЕСЯЦ, -ВЫБОР
	|				КОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|					ТОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|				ИНАЧЕ &МесяцевРасчетаПоЗакону
	|			КОНЕЦ),
	|		ВЫБОР
	|			КОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|				ТОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|			ИНАЧЕ &МесяцевРасчетаПоЗакону
	|		КОНЕЦ,
	|		Отпуск.ВидРасчетаДополнительногоОтпуска.СпособРасчета
	|	ИЗ
	|		Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|	ГДЕ
	|		Отпуск.Ссылка = &ДокументСсылка
	|		И Отпуск.ДатаНачалаДополнительногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ДОБАВИТЬКДАТЕ(&ДатаНачалаСобытия, МЕСЯЦ, -ВЫБОР
	|				КОГДА ПараметрыВидаРасчетаКомпенсация.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|					ТОГДА ПараметрыВидаРасчетаКомпенсация.ЧислоМесяцев
	|				ИНАЧЕ &МесяцевРасчетаПоЗакону
	|			КОНЕЦ),
	|		ВЫБОР
	|			КОГДА ПараметрыВидаРасчетаКомпенсация.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|				ТОГДА ПараметрыВидаРасчетаКомпенсация.ЧислоМесяцев
	|			ИНАЧЕ &МесяцевРасчетаПоЗакону
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке)
	|		КОНЕЦ
	|	ИЗ
	|		Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсация
	|			ПО (ПараметрыВидаРасчетаКомпенсация.Ссылка = ВЫБОР
	|					КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
	|				КОНЕЦ)
	|	ГДЕ
	|		Отпуск.Ссылка = &ДокументСсылка
	|		И Отпуск.ДнейЧасовКомпенсацииОтпуска > 0) КАК Начисления  
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтрокаРасчетСреднего.НомерСтроки КАК НомерСтроки,
	|			СтрокаРасчетСреднего.ВидРасчета КАК ВидРасчета,
	|			СтрокаРасчетСреднего.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|			ВЫБОР
	|				КОГДА СтрокаРасчетСреднего.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднего.БазовыйПериодКонец, ДЕНЬ)
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ КАК БазовыйПериодКонец,
	|			СтрокаРасчетСреднего.ОтработаноПоПятидневке КАК ОтработаноПоПятидневке,
	|			СтрокаРасчетСреднего.НормаПоПятидневке КАК НормаПоПятидневке,
	|			СтрокаРасчетСреднего.ОтработаноДней КАК ОтработаноДней,
	|			СтрокаРасчетСреднего.ОтработаноЧасов КАК ОтработаноЧасов,
	|			СтрокаРасчетСреднего.ЧислоМесяцев КАК ЧислоМесяцев,
	|			СтрокаРасчетСреднего.КоэффициентИндексации КАК КоэффициентИндексации,
	|			СтрокаРасчетСреднего.Результат КАК Результат,
	|			СтрокаРасчетСреднего.МесяцВыборки,
	|			ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням) КАК СпособРасчета,
	|			СтрокаРасчетСреднего.Включать	
	|		ИЗ
	|			Документ.НачислениеОтпускаРаботникамОрганизаций.РасчетСреднегоПоКалендарным КАК СтрокаРасчетСреднего
	|		ГДЕ
	|			СтрокаРасчетСреднего.Ссылка = &ДокументСсылка
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СтрокаРасчетСреднего.НомерСтроки,
	|			СтрокаРасчетСреднего.ВидРасчета,
	|			СтрокаРасчетСреднего.БазовыйПериодНачало,
	|			ВЫБОР
	|				КОГДА СтрокаРасчетСреднего.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднего.БазовыйПериодКонец, ДЕНЬ)
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|			КОНЕЦ,
	|			СтрокаРасчетСреднего.ОтработаноПоПятидневке,
	|			СтрокаРасчетСреднего.НормаПоПятидневке,
	|			СтрокаРасчетСреднего.ОтработаноДней,
	|			СтрокаРасчетСреднего.ОтработаноЧасов,
	|			СтрокаРасчетСреднего.ЧислоМесяцев,
	|			СтрокаРасчетСреднего.КоэффициентИндексации,
	|			СтрокаРасчетСреднего.Результат,
	|			СтрокаРасчетСреднего.МесяцВыборки,
	|			ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке),
	|			СтрокаРасчетСреднего.Включать	
	|		ИЗ
	|			Документ.НачислениеОтпускаРаботникамОрганизаций.РасчетСреднегоПоШестидневке КАК СтрокаРасчетСреднего
	|		ГДЕ
	|			СтрокаРасчетСреднего.Ссылка = &ДокументСсылка) КАК ДанныеОЗаработке
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДокумента.ПериодРасчетаСреднегоЗаработка) КАК КоличествоПериодовРасчетаСреднегоЗаработка,
	|				ДанныеДокумента.СпособРасчета КАК СпособРасчета
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ВЫБОР
	|						КОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|							ТОГДА ПараметрыВидаРасчетаОсновногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|						ИНАЧЕ &МесяцевРасчетаПоЗакону
	|					КОНЕЦ КАК ПериодРасчетаСреднегоЗаработка,
	|					ВЫБОР
	|						КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке)
	|					КОНЕЦ КАК СпособРасчета
	|				ИЗ
	|					Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|						ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаОсновногоОтпуска
	|						ПО (ПараметрыВидаРасчетаОсновногоОтпуска.Ссылка = ВЫБОР
	|								КОГДА Отпуск.ПорядокРасчетаОсновногоОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|									ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни)
	|								ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка)
	|							КОНЕЦ)
	|				ГДЕ
	|					Отпуск.Ссылка = &ДокументСсылка
	|					И Отпуск.ДатаНачалаОсновногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|				
	|				ОБЪЕДИНИТЬ
	|				
	|				ВЫБРАТЬ
	|					ВЫБОР
	|						КОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|							ТОГДА Отпуск.ВидРасчетаДополнительногоОтпуска.ПериодРасчетаСреднегоЗаработка
	|						ИНАЧЕ &МесяцевРасчетаПоЗакону
	|					КОНЕЦ,
	|					Отпуск.ВидРасчетаДополнительногоОтпуска.СпособРасчета
	|				ИЗ
	|					Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|				ГДЕ
	|					Отпуск.Ссылка = &ДокументСсылка
	|					И Отпуск.ДатаНачалаДополнительногоОтпуска <> ДАТАВРЕМЯ(1, 1, 1)
	|				
	|				ОБЪЕДИНИТЬ
	|				
	|				ВЫБРАТЬ
	|					ВЫБОР
	|						КОГДА ПараметрыВидаРасчетаКомпенсация.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|							ТОГДА ПараметрыВидаРасчетаКомпенсация.ЧислоМесяцев
	|						ИНАЧЕ &МесяцевРасчетаПоЗакону
	|					КОНЕЦ,
	|					ВЫБОР
	|						КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|							ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|						ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке)
	|					КОНЕЦ
	|				ИЗ
	|					Документ.НачислениеОтпускаРаботникамОрганизаций КАК Отпуск
	|						ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсация
	|						ПО (ПараметрыВидаРасчетаКомпенсация.Ссылка = ВЫБОР
	|								КОГДА Отпуск.ПорядокРасчетаКомпенсацииОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|									ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения)
	|								ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневкаБезУвольнения)
	|							КОНЕЦ)
	|				ГДЕ
	|					Отпуск.Ссылка = &ДокументСсылка
	|					И Отпуск.ДнейЧасовКомпенсацииОтпуска > 0) КАК ДанныеДокумента 
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеДокумента.СпособРасчета) КАК СвойстваВидовРасчета
	|			ПО ДанныеОЗаработке.СпособРасчета = СвойстваВидовРасчета.СпособРасчета
	|		ПО Начисления.СпособРасчета = ДанныеОЗаработке.СпособРасчета
	|			И (ЕСТЬNULL(СвойстваВидовРасчета.КоличествоПериодовРасчетаСреднегоЗаработка, 0) <= 1
	|				ИЛИ (НЕ ДанныеОЗаработке.ВидРасчета В (&ГодовыеПремии))
	|					И Начисления.ПериодРасчетаСреднегоЗаработкаНачало <= ДанныеОЗаработке.БазовыйПериодНачало
	|					И &ПериодРасчетаСреднегоЗаработкаОкончание >= ДанныеОЗаработке.БазовыйПериодКонец
	|				ИЛИ ДанныеОЗаработке.ВидРасчета В (&ГодовыеПремии)
	|					И Начисления.ПериодРасчетаСреднегоЗаработкаНачало = ДанныеОЗаработке.БазовыйПериодНачало
	|					И &ПериодРасчетаСреднегоЗаработкаОкончание = ДанныеОЗаработке.БазовыйПериодКонец)";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРасчетСреднего()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "") 
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется начисление!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник.Организация = Организация
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	УказанаДатаНачалаОсновногоОтпуска = ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска);
	УказанаДатаНачалаДополнительногоОтпуска = ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачалаДополнительногоОтпуска);
	
	// ДатаНачалаОсновногоОтпуска
	Если НЕ УказанаДатаНачалаОсновногоОтпуска И НЕ УказанаДатаНачалаДополнительногоОтпуска и ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Должна быть указана дата начала основного или дополнительного отпуска, или количество дней (часов) компенсации отпуска!", Отказ, Заголовок);
	Иначе
		
		Если УказанаДатаНачалаОсновногоОтпуска Тогда
			
			// проверка дат начала и окончания
			Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания основного отпуска!", Отказ, Заголовок);
			ИначеЕсли ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска < ВыборкаПоШапкеДокумента.ДатаНачалаОсновногоОтпуска Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Дата окончания основного отпуска не должна быть меньше даты начала!", Отказ, Заголовок);
			Иначе
				Если УказанаДатаНачалаДополнительногоОтпуска И ВыборкаПоШапкеДокумента.ДатаНачалаДополнительногоОтпуска <> КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончанияОсновногоОтпуска) + 1 Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Дополнительный отпуск должен начинаться непосредственно после окончания основного!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
			
			// ПорядокРасчетаОсновногоОтпуска
			Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПорядокРасчетаОсновногоОтпуска) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не указан порядок расчета основного отпуска!", Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
		
		Если УказанаДатаНачалаДополнительногоОтпуска Тогда
			
			// проверка дат начала и окончания
			Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончанияДополнительногоОтпуска) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания дополнительного отпуска!", Отказ, Заголовок);
			ИначеЕсли ВыборкаПоШапкеДокумента.ДатаОкончанияДополнительногоОтпуска < ВыборкаПоШапкеДокумента.ДатаНачалаДополнительногоОтпуска Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Дата окончания дополнительного отпуска не должна быть меньше даты начала!", Отказ, Заголовок);
			КонецЕсли;	
			
			// ВидРасчетаДополнительногоОтпуска
			Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидРасчетаДополнительногоОтпуска) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не указан вид дополнительного отпуска!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска > 0 Тогда  
			// ПорядокРасчетаКомпенсацииОтпуска
			Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПорядокРасчетаКомпенсацииОтпуска) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не указан порядок расчета компенсации отпуска!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода исправляемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией исправляемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.СотрудникПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.Сотрудник <> ВыборкаПоШапкеДокумента.СотрудникПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Сотрудник документа должен совпадать с сотрудником исправляемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса к ТЧ документа, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала и окончания
	Если ВыборкаПоСтрокамДокумента.ОсновныеНачисления 
		Или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом
		//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
		или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы
		или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП //О.Т. Аверсон 04.11.2016 № 1501
		Или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СевернаяНадбавка
		Или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом Тогда
		
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала начисления!", Отказ, Заголовок);
		Иначе
			// Дата окончания 
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания начисления!", Отказ, Заголовок);
			Иначе
				Если ВыборкаПоСтрокамДокумента.ДатаОкончания < ВыборкаПоСтрокамДокумента.ДатаНачала Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания начисления не должна быть меньше даты начала!", Отказ, Заголовок);
				ИначеЕсли ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда	
					Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаОкончания) <> НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
					КонецЕсли;
				КонецЕсли;           
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Дата начала события
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия)  И (ВыборкаПоСтрокамДокумента.ОсновныеНачисления или ВыборкаПоСтрокамДокумента.Компенсация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала события!", Отказ, Заголовок);
	КонецЕсли;
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение организации!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
	КонецЕсли;
	
	ДатаНачалаСобытия = ?(ДатаНачалаОсновногоОтпуска = '00010101', ДатаНачалаДополнительногоОтпуска, ДатаНачалаОсновногоОтпуска);
	//заявка №2081 (база заявок Кристалла) Дмитрук О.Г.
	Если ДатаНачалаДополнительногоОтпуска2 = '00010101' Тогда
		Если ДатаНачалаДополнительногоОтпуска1 = '00010101' Тогда
			Если ДатаНачалаДополнительногоОтпуска = '00010101' Тогда
				ДатаОкончанияСобытия = КонецДня(ДатаОкончанияОсновногоОтпуска);
			Иначе
				ДатаОкончанияСобытия = КонецДня(ДатаОкончанияДополнительногоОтпуска);
			КонецЕсли;
		Иначе
			ДатаОкончанияСобытия = КонецДня(ДатаОкончанияДополнительногоОтпуска1);
		КонецЕсли;
	Иначе
		ДатаОкончанияСобытия = КонецДня(ДатаОкончанияДополнительногоОтпуска2);
	КонецЕсли;
	//ДатаОкончанияСобытия = КонецДня(?(ДатаНачалаДополнительногоОтпуска = '00010101', ДатаОкончанияОсновногоОтпуска, ДатаОкончанияДополнительногоОтпуска));
	//заявка №2081
	
	Если НЕ ВыборкаПоСтрокамДокумента.Сторно И ВыборкаПоСтрокамДокумента.ОсновныеНачисления И (ВыборкаПоСтрокамДокумента.ДатаНачала < ДатаНачалаСобытия ИЛИ ВыборкаПоСтрокамДокумента.ДатаНачала > ДатаОкончанияСобытия
		ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания < ДатаНачалаСобытия ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания > ДатаОкончанияСобытия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "период начисления выходит за временные границы оплачиваемого события!", Ложь, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса к ТЧ документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Расчет среднего"": ";
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета среднего заработка!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала базового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала базового периода!", Отказ, Заголовок);
		// Дата окончания базового периода
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания базового периода!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.БазовыйПериодКонец < ВыборкаПоСтрокамДокумента.БазовыйПериодНачало Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала базового периода не может быть больше даты окончания базового периода!", Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРасчетСреднего()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры: 
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, НаборРасчетСреднего)
	
	СуммаРесурсов = ВыборкаПоСтрокамДокумента.Результат + ВыборкаПоСтрокамДокумента.ОтработаноПоПятидневке +
	ВыборкаПоСтрокамДокумента.НормаПоПятидневке + ВыборкаПоСтрокамДокумента.ОтработаноДней + ВыборкаПоСтрокамДокумента.ОтработаноЧасов;
	
	Если СуммаРесурсов <> 0 Тогда
		
		Движение = НаборРасчетСреднего.Добавить();
		
		// Свойства
		Движение.ПериодРегистрации				= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Движение.БазовыйПериодНачало			= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец				= ВыборкаПоСтрокамДокумента.БазовыйПериодКонец;
		Движение.ВидРасчета						= ВыборкаПоСтрокамДокумента.ВидРасчета;
		
		// Измерения
		Движение.Сотрудник						= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.Физлицо						= ВыборкаПоШапкеДокумента.Физлицо;
		Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		Движение.Результат						= ВыборкаПоСтрокамДокумента.Результат;
		Движение.ОтработаноПоПятидневке			= ВыборкаПоСтрокамДокумента.ОтработаноПоПятидневке;
		Движение.НормаПоПятидневке				= ВыборкаПоСтрокамДокумента.НормаПоПятидневке;
		Движение.ОтработаноДней					= ВыборкаПоСтрокамДокумента.ОтработаноДней;
		Движение.ОтработаноЧасов				= ВыборкаПоСтрокамДокумента.ОтработаноЧасов;
		
		// Реквизиты
		Движение.КоэффициентИндексации			= ВыборкаПоСтрокамДокумента.КоэффициентИндексации;
		Движение.ЧислоМесяцев					= ВыборкаПоСтрокамДокумента.ЧислоМесяцев;
		Движение.ПериодРасчетаСреднегоЗаработка	= ВыборкаПоСтрокамДокумента.ПериодРасчетаСреднегоЗаработка;
		Движение.СпособРасчета					= ВыборкаПоСтрокамДокумента.СпособРасчета;
		Движение.ДатаНачалаСобытия				= ВыборкаПоШапкеДокумента.ДатаНачалаСобытия;
		Движение.ДатаНачалаРасчетногоПериода	= ВыборкаПоСтрокамДокумента.ПериодРасчетаСреднегоЗаработкаНачало;
		Движение.ДатаОкончанияРасчетногоПериода	= ВыборкаПоСтрокамДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.МесяцВыборки                   = ВыборкаПоСтрокамДокумента.МесяцВыборки;
		Движение.Включать                       = ВыборкаПоСтрокамДокумента.Включать
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРасчетаСреднего()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//	ВыборкаПоШапкеДокумента						- выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) Тогда
		
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		
		// Свойства
		Движение.Период					= ВыборкаПоТЧ.МесяцНалоговогоПериода;
		
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо				= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.КодДохода				= ВыборкаПоТЧ.КодДоходаНДФЛ;
		Движение.ПериодРегистрации		= ПериодРегистрации;
		
		// Ресурсы
		Движение.СуммаДохода			= ВыборкаПоТЧ.Результат; 
		
		// Реквизиты
		Движение.ОбособленноеПодразделение = ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ИсчисленоИзЗарплаты	= Истина;
		Движение.ПодразделениеОрганизации = ВыборкаПоТЧ.ПодразделениеОрганизации; 
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
	
	// Измерения
	Движение.Организация			= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ФизЛицо				= ВыборкаПоШапкеДокумента.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов = ПериодРегистрации;
	КонецЕсли;
	
	// Ресурсы
	Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) и (ВыборкаПоТЧ.Сторно и (ВыборкаПоТЧ.ДатаНачала < Дата(2016,07,01) и ВыборкаПоТЧ.ДатаНачала <> Дата(1,1,1) ) ) Тогда //О.Т. Аверсон 11.08.2016
		Движение.СуммаВзаиморасчетов	= ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаПоТЧ.Результат/10000,ПериодРегистрации);
	иначе 		
		Движение.СуммаВзаиморасчетов	= ВыборкаПоТЧ.Результат;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа
//	ВыборкаПоОстаткам
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоОстаткам(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям)
	
	Движение = Движения.ФактическиеОтпускаОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= ?(ВыборкаПоНачислениям.Компенсация, ВыборкаПоНачислениям.ДатаНачалаСобытия, ВыборкаПоНачислениям.ДатаНачала);
	
	// Измерения
	Движение.Сотрудник				= ВыборкаПоШапкеДокумента.Сотрудник;
	Движение.ВидЕжегодногоОтпуска	= ВыборкаПоНачислениям.ВидЕжегодногоОтпуска;
	
	// Ресурсы
	Движение.Количество				= ВыборкаПоНачислениям.ДнейОтпуска * ?(ВыборкаПоНачислениям.Сторно, -1, 1);
	
	// Реквизиты
	Движение.ДатаОкончания			= ?(ВыборкаПоНачислениям.Компенсация, Дата(1,1,1), ВыборкаПоНачислениям.ДатаОкончания);
	Движение.ЭтоКомпенсация			= ВыборкаПоНачислениям.Компенсация;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено;
	МатериальнаяПомощьДокумент = Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПустаяСсылка();
	НачислятьМатериальнуюПомощь = Ложь;
	КоэффициентОтпуска= 0
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверим непрерывночть следования записей начислений
	ПроверитьНепрерывностьЗаписейНачислений(Отказ);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
			
			// Получение учетной политики по персоналу организации
			УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			// получим реквизиты табличной части Начисления
			ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					// Заполним записи в наборах записей регистров
					Если ВыборкаПоНачислениям.ОсновныеНачисления Тогда
						//толик						
						СтрокаДвижений = ПроведениеРасчетов.ДобавитьСтрокуОсновныхНачислений(Движения.ОсновныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
						СтрокаДвижений.ОплаченоДней = ВыборкаПоНачислениям.ОплаченоДней;
						
						//Аверсон ЕАЕ 24.01.2022 СВФР-008641
						//Если Организация.ИНН = "100010315"  И РасчетОтОклада Тогда
						//	СтрокаДвижений = ПроведениеРасчетов.ДобавитьСтрокуОсновныхНачислений(Движения.ОсновныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
						//	СтрокаДвижений.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоИнициативеНанимателя;
						//	СтрокаДвижений.Результат = 0;
						//КонецЕсли;
						//Аверсон СВФР-008641
						
					Иначе
						ПроведениеРасчетов.ДобавитьСтрокуДополнительныхНачислений(Движения.ДополнительныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
					КонецЕсли;
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
					
					//Если Не ВыборкаПоНачислениям.ЕстьКадровыйОтпуск И Не ВыборкаПоНачислениям.ВидЕжегодногоОтпуска.Пустая() Тогда
					//	ДобавитьСтрокуВДвиженияПоОстаткам(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
					//КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// получим реквизиты табличной части РасчетСреднего 
			РезультатЗапросаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего();
			ВыборкаПоРасчетСреднего = РезультатЗапросаПоРасчетСреднего.Выбрать();
			
			Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Движения.РасчетСреднегоЗаработка);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				
				// выполним удаление перерасчетов исправленного документа
				Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
					ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
				КонецЕсли;
				
				Для Каждого Набор Из Движения Цикл
					ТипНабораЗаписей = ТипЗнч(Набор);
					Если ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
						Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ДополнительныеНачисленияРаботниковОрганизаций") Тогда
						Набор.Записать();
					КонецЕсли;
				КонецЦикла;
				ПроведениеРасчетов.ОбработатьТаблицуПерерасчетов(Ссылка);
			КонецЕсли;
			
			//Аверсон ЕАЕ 04.10.2021 СВФР-008218
			//Если Организация.ИНН = "100071565" Тогда
			//	Если Не Отказ Тогда
			//		Если НачислятьМатериальнуюПомощь Тогда
			//			Если Не ЗначениеЗаполнено(МатериальнаяПомощьДокумент) Тогда
			//				СоздатьДокументМатериальнаяПомощь();		
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			//Аверсон СВФР-008218
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

////Аверсон ЕАЕ 04.10.2021 СВФР-008218
//Процедура СоздатьДокументМатериальнаяПомощь()
//	НачислениеМатПомощь = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоКоду("170");
//	
//	Если НачислениеМатПомощь.Пустая() Тогда
//		НачислениеМатПомощь = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоКоду("00170");	
//	КонецЕсли;
//	
//	НовыйДокумент = Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций.СоздатьДокумент();
//	НовыйДокумент.Дата = Дата;
//	НовыйДокумент.ПериодРегистрации = ПериодРегистрации;
//	НовыйДокумент.Организация = Организация;
//	НовыйДокумент.Ответственный = глЗначениеПеременной("глТекущийПользователь");
//	НовыйДокумент.Начисление = НачислениеМатПомощь;
//	
//	НоваяСтр = НовыйДокумент.ДополнительныеНачисления.Добавить();
//	НоваяСтр.Сотрудник = Сотрудник;
//	НоваяСтр.ФизЛицо = ФизЛицо;
//	НоваяСтр.ДатаНачала = ПериодРегистрации;
//	НоваяСтр.ДатаОкончания = КонецМесяца(ПериодРегистрации);
//	НоваяСтр.ВидРасчета = НачислениеМатПомощь;
//	Если ЗначениеЗаполнено(НачислениеМатПомощь) Тогда
//		НоваяСтр.КодВычета = НачислениеМатПомощь.КодДоходаНДФЛ.КодВычета;
//	КонецЕсли;
//	НоваяСтр.Результат = РассчитатьРезультат();
//	Попытка
//		НовыйДокумент.Записать();
//		НовыйДокумент.РассчитатьНачисления();
//		МатериальнаяПомощьДокумент = НовыйДокумент.Ссылка;
//	Исключение
//		Сообщить(ОписаниеОшибки());
//	КонецПопытки;
//КонецПроцедуры

//Функция РассчитатьРезультат()
//	СтруктураОтбора = Новый Структура("Включать", Истина);
//	МассивСтрок = РасчетСреднегоПоКалендарным.НайтиСтроки(СтруктураОтбора);
//	ТЗРасчетСреднего = РасчетСреднегоПоКалендарным.Выгрузить(МассивСтрок, "КоэффициентИндексации, Результат, МесяцВыборки");
//	ТЗРасчетСреднего.Колонки.Добавить("РезультатСУчетомКоэф");
//	Для Каждого Стр Из ТЗРасчетСреднего Цикл
//		Стр.РезультатСУчетомКоэф = Стр.Результат * Стр.КоэффициентИндексации;
//	КонецЦикла;
//	ТЗРасчетСреднего.Свернуть("МесяцВыборки", "РезультатСУчетомКоэф");
//	Если ТЗРасчетСреднего.Количество() = 0 Тогда
//		СуммаОтпускных = 0;
//	Иначе
//		СуммаОтпускных = ТЗРасчетСреднего.Итог("РезультатСУчетомКоэф") / ТЗРасчетСреднего.Количество();
//	КонецЕсли;
//	Возврат СуммаОтпускных;
//КонецФункции
////Аверсон СВФР-008218

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
КонецПроцедуры

//ПСА 07.12.2021 СВФР-008432+++
Функция КолвоПраздниковЗаПериод(НачалоП, ОкончаниеП)    
	//Аверсон 06.04.2020 КВВ СВФР-005810 (
	З = Новый Запрос;
	З.Текст = 
	"ВЫБРАТЬ 
	|	СУММА (ВЫБОР 
	|	КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(перечисление.ВидыДнейПроизводственногоКалендаря.Праздник) ТОГДА 1 
	|	ИНАЧЕ 0 КОНЕЦ)  КАК КолвоПраздников
	|ИЗ  РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачалаОтпуска И &ДатаОкончанияОтпуска";
	З.УстановитьПараметр("ДатаНачалаОтпуска", НачалоП);
	З.УстановитьПараметр("ДатаОкончанияОтпуска", ОкончаниеП);
	Выборка = З.Выполнить().Выбрать();
	КолвоДнПраздников = 0;
	Пока Выборка.Следующий() Цикл
		КолвоДнПраздников = Выборка.КолвоПраздников;
	КонецЦикла;
	//Аверсон 06.04.2020 КВВ СВФР-005810 )
	Возврат КолвоДнПраздников;
КонецФункции
//+++ПСА 07.12.2021 СВФР-008432


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400; // в секундах
