
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если РазрядыНаДату.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.РазрядыРаботВЗависимостиОтБуквы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого Стр ИЗ РазрядыНаДату Цикл
		Если ЗначениеЗаполнено(Стр.Разряд) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период	= НачалоДня(Дата);
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.Разряд = Стр.Разряд;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.АвтоматическиеСтавки = Стр.АвтоматическиеСтавки;
			НоваяЗапись.РучныеСтавки = Стр.РучныеСтавки;
		Иначе
			Сообщить("В строке " + СокрЛП(Стр.НомерСтроки) + " не заполнен реквизит ""Разряд"". В регистр внесено не будет." );
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);

КонецЕсли;
КонецПроцедуры
