////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем НачисленияУдержания                        Экспорт; // Таблица значений - внешний источник данных
Перем СохраненнаяНастройка                       Экспорт;            
Перем СписокПолейОтбора                          Экспорт; // Список названий поле схемы компоновки по которым можно устанавливать отбор
Перем ЭлементНастройкиРасчетногоЛистка           Экспорт; // Элемент структуры настройки схемы компоновки данных
Перем ТекстЗапроса                               Экспорт;
Перем ИмяМакетаНачало;
Перем ИмяМакетаКонец;
Перем НастройкаШириныКолонокРасчетногоЛистка     Экспорт;
Перем НастройкаРазмТекстаКолонокРасчетногоЛистка Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

#Если Клиент тогда
	
	// Настраивает отчет
	//
	Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
		
		ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
		
	КонецПроцедуры
	
	// Инициализация отчета
	//
	// Параметры:
	//  Нет.
	//
	Процедура ИнициализацияОтчета() Экспорт
		
	КонецПроцедуры //ИнициализацияОтчета()
	
	// Заполняет отборы и параметры схемы копоновки
	//
	Функция НастроитьОтборыПарметры(Отбор = Неопределено, Параметры = Неопределено) Экспорт
		
		Если Отбор = Неопределено И Параметры = Неопределено тогда
			Возврат ложь;
		КонецЕсли;
		
		Настройки = КомпоновщикНастроек.Настройки;
		
		Если ТипЗнч(Отбор) = Тип("Массив") тогда
			
			Для каждого ЭлементОтбора из Отбор Цикл
				Если ТипЗнч(ЭлементОтбора) = Тип("Структура") тогда
					
					ЛевоеЗначение    = Неопределено;
					ВидСравненияКомп = Неопределено;
					ПравоеЗначение   = Неопределено;
					
					Если НЕ ЭлементОтбора.Свойство("ЛевоеЗначение", ЛевоеЗначение) тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ЭлементОтбора.Свойство("ВидСравнения", ВидСравненияКомп) тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ЭлементОтбора.Свойство("ПравоеЗначение", ПравоеЗначение) тогда
						Возврат ложь;
					КонецЕсли;
					
					ПолеОтбора = Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Строка(ЛевоеЗначение)));
					
					Если ПолеОтбора = Неопределено тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ТипЗнч(ВидСравненияКомп) = Тип("ВидСравненияКомпоновкиДанных") тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ПолеОтбора.Тип.СодержитТип(ТипЗнч(ПравоеЗначение))   тогда
						Возврат ложь;
					КонецЕсли;
					
					ЭлементОтбораКомпоновки = Неопределено;
					
					Для каждого ЭлементОтбораКомп из Настройки.Отбор.Элементы Цикл
						Если ЭлементОтбораКомп.ЛевоеЗначение = ПолеОтбора.Поле тогда
							ЭлементОтбораКомпоновки = ЭлементОтбораКомп;
						КонецЕсли;
					КонецЦикла;
					
					Если ЭлементОтбораКомпоновки = Неопределено тогда
						ЭлементОтбораКомпоновки = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					КонецЕсли;
					
					ЭлементОтбораКомпоновки.ЛевоеЗначение  = ПолеОтбора.Поле;
					ЭлементОтбораКомпоновки.ВидСравнения   = ВидСравненияКомп;
					ЭлементОтбораКомпоновки.ПравоеЗначение = ПравоеЗначение;
					ЭлементОтбораКомпоновки.Использование  = истина;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ТипЗнч(Параметры) = Тип("Массив") тогда
			
			Для каждого ЭлементПараметра из Параметры Цикл
				Если ТипЗнч(ЭлементПараметра) = Тип("Структура") тогда
					
					Параметр = Неопределено;
					Значение = Неопределено;
					
					Если НЕ ЭлементПараметра.Свойство("Параметр", Параметр) тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ЭлементПараметра.Свойство("Значение", Значение) тогда
						Возврат ложь;
					КонецЕсли;
					
					ПараметрКомпоновки = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных(Строка(Параметр)));
					
					Если ПараметрКомпоновки = Неопределено тогда
						Возврат ложь;
					КонецЕсли;
					
					Если НЕ ПараметрКомпоновки.Тип.СодержитТип(ТипЗнч(Значение)) тогда
						Возврат ложь;
					КонецЕсли;
					
					ЗначениеПараметра               = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Строка(Параметр)));
					ЗначениеПараметра.Значение      = Значение;
					ЗначениеПараметра.Использование = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат истина;
		
	КонецФункции
	
	// Вывод заголовка отчета
	//
	Процедура ВыводЗаголовкаОтчета(Результат, ВыводВФормуОтчета = Истина) Экспорт
		
		Если РасширеннаяНастройка Тогда
			Возврат;                                           
		КонецЕсли;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput"));
		ВыводитьЗаголовок = (ЗначениеПараметра.Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить И ЗначениеПараметра.Использование);
		
		Если Не ВыводВФормуОтчета И Не ВыводитьЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		
		МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокТиповогоОтчета");
		ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
		ЗаголовокОтчета = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение;
		ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
		Результат.Вывести(ОбластьЗаголовок);
		
	КонецПроцедуры
	
	// Удаление элементов структуры настройки	
	//	
	Процедура УдалитьГруппировку()
		
		ЗапомнитьНастройкуРасчетногоЛистка();
		
		Настройки = КомпоновщикНастроек.Настройки;
		
		Если Настройки.Структура.Количество() <> 0 тогда
			Настройки.Структура.Удалить(Настройки.Структура[0]);
		КОнецЕсли;
		
		ВосстановитьНастройкуРасчетногоЛистка();
		
	КонецПроцедуры
	
	// Возвращает значение вида сравнения компоновки данных в зависимости от вида сравнения
	//
	Функция ПолучитьВидСравнения(ВидСравненияЭлемента) Экспорт
		
		ВидСравненияДляСхемыКомпоновки = Неопределено;
		Если ВидСравненияЭлемента = ВидСравнения.Равно тогда
			ВидСравненияДляСхемыКомпоновки = ВидСравненияКомпоновкиДанных.Равно;
		ИначеЕсли ВидСравненияЭлемента = ВидСравнения.НеРавно тогда
			ВидСравненияДляСхемыКомпоновки = ВидСравненияКомпоновкиДанных.НеРавно;
		ИначеЕсли ВидСравненияЭлемента = ВидСравнения.ВСписке тогда
			ВидСравненияДляСхемыКомпоновки = ВидСравненияКомпоновкиДанных.ВСписке;
		ИначеЕсли ВидСравненияЭлемента = ВидСравнения.ВСпискеПоИерархии тогда
			ВидСравненияДляСхемыКомпоновки = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		ИначеЕсли ВидСравненияЭлемента = ВидСравнения.ВИерархии тогда
			ВидСравненияДляСхемыКомпоновки = ВидСравненияКомпоновкиДанных.ВИерархии;
		КонецЕсли;
		
		Возврат ВидСравненияДляСхемыКомпоновки;
		
	КонецФункции
	
	
	// Формирование отчета в табличный документ "Результат"
	//
	// Параметры:
	//   Результат         – табличный документ, в который помещается результат вывода расчетных листков.
	//	 ДанныеРасшифровки - данные расшифровки компоновки данных
	//
	Процедура СформироватьОтчет(Результат, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = ложь, ВыводитьПоСтраницам = ложь) Экспорт
		
		Если ДанныеРасшифровки = Неопределено тогда
			ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КонецЕсли;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Группировать"));
		
		Если ЗначениеПараметра.Использование и НЕ ЗначениеПараметра.Значение тогда
			УдалитьГруппировку();
		КонецЕсли;
		
		// Получить настройки схемы компоновки данных
		Настройки = КомпоновщикНастроек.Настройки;
		
		ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидРасчетногоЛистка"));
		ВидРасчетногоЛистка = ЗначениеПараметра.Значение;
		
		// установим параметры и текст запроса построителя запроса
		ПостроительОтчетов = Новый ПостроительОтчета;
		
		НастроитьПостроительЗапросов(ПостроительОтчетов, ВидРасчетногоЛистка);
		
		//// установим отбор р/л без без начислений и удержаний
		ГруппаОтбора                 = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы       = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаОтбора.Использование   = Истина;
		
		ЭлементОтбора                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ВидДвижения")).Поле;
		ЭлементОтбора.ПравоеЗначение = "1";
		
		ЭлементОтбора                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ВидДвиженияУд")).Поле;
		ЭлементОтбора.ПравоеЗначение = "2";
		
		ЭлементОтбора                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.Элементы.Найти("СальдоНачальное").Поле;
		ЭлементОтбора.ПравоеЗначение = 0;
		
		ЭлементОтбора                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.Элементы.Найти("СальдоКонечное").Поле;
		ЭлементОтбора.ПравоеЗначение = 0;
		
		ЭлементОтбора                = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.Элементы.Найти("Оборот").Поле;
		ЭлементОтбора.ПравоеЗначение = 0;
		
		
		ЗначениеОтбораСотрудника = Неопределено;
		ЕстьОтборПоФизЛицу = ложь;
		Для каждого ЭлементОтбора из Настройки.Отбор.Элементы Цикл
			
			// если отбор установлен по сотруднику
			Если ЭлементОтбора.Использование  И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") тогда
				Если ЭлементОтбора.ПравоеЗначение <> Неопределено И ТипЗнч(ЭлементОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") тогда
					ЗначениеОтбораСотрудника = ЭлементОтбора;
				КонецЕсли;
			КонецЕсли;
			
			//если отбор установлен по физлицу
			Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = СписокПолейОтбора.Получить(0).Значение тогда
				Если ЭлементОтбора.ПравоеЗначение <> Неопределено И ТипЗнч(ЭлементОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") тогда
					ЕстьОтборПоФизЛицу = истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьОтборПоФизЛицу И ЗначениеОтбораСотрудника <> Неопределено 
			И ((ТипЗнч(ЗначениеОтбораСотрудника.ПравоеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") 
			И  НЕ ЗначениеОтбораСотрудника.ПравоеЗначение.ЭтоГруппа)
			или ТипЗнч(ЗначениеОтбораСотрудника.ПравоеЗначение) = Тип("СписокЗначений"))тогда
			
			ОтборПоФизЛицу                = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоФизЛицу.ВидСравнения   = ЗначениеОтбораСотрудника.ВидСравнения;
			ОтборПоФизЛицу.Использование  = Истина;
			ОтборПоФизЛицу.ЛевоеЗначение  = Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизЛицо")).Поле;
			
			Если ТипЗнч(ЗначениеОтбораСотрудника.ПравоеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") тогда
				ОтборПоФизЛицу.ПравоеЗначение = ЗначениеОтбораСотрудника.ПравоеЗначение.Физлицо;
			ИначеЕсли ТипЗнч(ЗначениеОтбораСотрудника.ПравоеЗначение) = Тип("СписокЗначений") тогда
				
				СписокЗначенийОтбораФизЛиц = Новый СписокЗначений;
				
				Для каждого ЭлементСписка из ЗначениеОтбораСотрудника.ПравоеЗначение Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("СправочникСсылка.СотрудникиОрганизаций") тогда
						СписокЗначенийОтбораФизЛиц.Добавить(ЭлементСписка.Значение.ФизЛицо);
					КонецЕсли;
				КонецЦикла;
				
				ОтборПоФизЛицу.ПравоеЗначение = СписокЗначенийОтбораФизЛиц;
				
			Иначе
				
				Настройки.Отбор.Элементы.Удалить(ОтборПоФизЛицу);
				
			КонецЕсли;
		КонецЕсли;
		
		// установим отборы в построителе запросов 
		Для каждого ЭлементОтбора из Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И СписокПолейОтбора.НайтиПоЗначению(ЭлементОтбора.ЛевоеЗначение)<>Неопределено 
				тогда
				ВидСравненияОтбора = Неопределено;
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно тогда
					ВидСравненияОтбора = ВидСравнения.Равно;
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке тогда
					ВидСравненияОтбора = ВидСравнения.ВСписке;
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно тогда
					ВидСравненияОтбора = ВидСравнения.НеРавно;
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии тогда
					ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии;
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии тогда
					ВидСравненияОтбора = ВидСравнения.ВИерархии;
				КонецЕсли;
				Если ВидСравненияОтбора <> Неопределено тогда 
					Имя = Строка(ЭлементОтбора.ЛевоеЗначение);
					ПостроительОтчетов.Отбор.Добавить(Имя);
					ПостроительОтчетов.Отбор[Имя].ВидСравнения  = ВидСравненияОтбора;
					Если ЭлементОтбора.ПравоеЗначение <> Неопределено И ТипЗнч(ЭлементОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") тогда
						ПостроительОтчетов.Отбор[Имя].Значение      = ЭлементОтбора.ПравоеЗначение;
					КонецЕсли;
					ПостроительОтчетов.Отбор[Имя].Использование = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// если отбор установлен по сотруднику
			Если ЭлементОтбора.Использование  И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = СписокПолейОтбора.Получить(1).Значение тогда
				Если ЭлементОтбора.ПравоеЗначение <> Неопределено И ТипЗнч(ЭлементОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") тогда
					ЗначениеОтбораСотрудника = ЭлементОтбора;
				КонецЕсли;
			КонецЕсли;
			
			//если отбор установлен по физлицу
			Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = СписокПолейОтбора.Получить(0).Значение тогда
				Если ЭлементОтбора.ПравоеЗначение <> Неопределено И ТипЗнч(ЭлементОтбора.ПравоеЗначение) <> Тип("ПолеКомпоновкиДанных") тогда
					ЕстьОтборПоФизЛицу = истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// заполним ТЗ "НачисленияУдержания"
		ЗаполнитьВнешнийИсточникДанных(ПостроительОтчетов, ВидРасчетногоЛистка);
		
		//Установить параметрыы расшифровки макета
		
		Для каждого МакетГруппировки из СхемаКомпоновкиДанных.МакетыГруппировок Цикл
			Если МакетГруппировки.ИмяГруппировки = "СтрокаНачисленийУдержаний" тогда
				ИмяМакетаСтрокаНачислений = МакетГруппировки.Макет;
			КонецЕсли;
			Если МакетГруппировки.ИмяГруппировки = "ДоходыВНатуральнойФормеВыплата" тогда
				ИмяМакетаДоходыВнатруальнойФорме = МакетГруппировки.Макет;
			КонецЕсли;
			
		КонецЦикла;
		
		СотрудникМесяц = Новый ПараметрКомпоновкиДанных("СотрудникМесяц");
		СотрудникМесяц1 = Новый ПараметрКомпоновкиДанных("СотрудникМесяц");
		
		МакетСтрокиНачисленийУдержаний = СхемаКомпоновкиДанных.Макеты.Найти(ИмяМакетаСтрокаНачислений);
		МакетСтрокиДоходовВыплат       = СхемаКомпоновкиДанных.Макеты.Найти(ИмяМакетаДоходыВнатруальнойФорме);
		
		ЯчейкиСтрокиНачисленийУдержаний = МакетСтрокиНачисленийУдержаний.Макет[0].Ячейки;
		ЯчейкиСтрокиДоходовВыплат       = МакетСтрокиДоходовВыплат.Макет[0].Ячейки;
		Для сч = 0 по 14 Цикл
			ЯчейкиСтрокиНачисленийУдержаний[Сч].Оформление.Элементы.Найти("Details").Значение = СотрудникМесяц;
			ЯчейкиСтрокиДоходовВыплат[Сч].Оформление.Элементы.Найти("Details").Значение       = СотрудникМесяц1;
		КонецЦикла;
		
		// создадим структуру с внешним набором данных
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("НачисленияУдержания", НачисленияУдержания);
		
		// получим макет компоновки данных
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		// создадим и инициализируем процессор компоновки данных
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		
		// очистим результирующий табличный документ
		Результат.Очистить();
		
		Если ВыводВФормуОтчета тогда
			ВыводЗаголовкаОтчета(Результат);
		КонецЕсли;
		
		// удалим отбор пустых строк начислений
		Настройки.Отбор.Элементы.Удалить(ГруппаОтбора);
		Если ОтборПоФизЛицу <> Неопределено тогда
			Настройки.Отбор.Элементы.Удалить(ОтборПоФизЛицу);
		КонецЕсли;
		
		// выведем отчет в табличный документ "Результат"
		ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновки, Результат, ВыводитьПоСтраницам);
		
		Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		Если ВыводВФормуОтчета тогда
			ТиповыеОтчеты.УправлениеОтображениемЗаголовкаТиповогоОтчета(ЭтотОбъект, Результат);
		КонецЕсли;
		
		Результат.Область(1, 1, 1, 1).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Авто;
		
	КонецПроцедуры
	
	// Восстановление настройки печати табличного документа.
	//
	// Параметры:
	//   ТабличныйДокумент – табличный документ.
	//
	Процедура ВосстановитьНастройкуТабличногоДокумента(ТабличныйДокумент) Экспорт
		
		Перем СтруктураПараметров;
		
		СтруктураПараметров = ВосстановитьЗначение("ПАРАМЕТРЫ_ПЕЧАТИ_РасчетногоЛисткаОрганизации");
		
		Если СтруктураПараметров = Неопределено тогда
			СтруктураПараметров = Новый Структура("ПолеСверху, ПолеСлева, ПолеСправа, ПолеСнизу, МасштабПечати, АвтоМасштаб");
			СтруктураПараметров.ПолеСверху    = 10;
			СтруктураПараметров.ПолеСлева     = 20;
			СтруктураПараметров.ПолеСправа    = 10;
			СтруктураПараметров.ПолеСнизу     = 10;
			СтруктураПараметров.МасштабПечати = 100;
			СтруктураПараметров.АвтоМасштаб   = истина;
		КонецЕсли;
		
		ТабличныйДокумент.ПолеСверху    = СтруктураПараметров.ПолеСверху;
		ТабличныйДокумент.ПолеСлева     = СтруктураПараметров.ПолеСлева;
		ТабличныйДокумент.ПолеСправа    = СтруктураПараметров.ПолеСправа;
		ТабличныйДокумент.ПолеСнизу     = СтруктураПараметров.ПолеСнизу;
		ТабличныйДокумент.МасштабПечати = ?(СтруктураПараметров.МасштабПечати = Неопределено, 100, СтруктураПараметров.МасштабПечати);
		ТабличныйДокумент.АвтоМасштаб   = СтруктураПараметров.АвтоМасштаб;
		
		
	КонецПроцедуры
	
	// Сохранение настроек печати табличного документа
	//
	// Параметры:
	//   ТабличныйДокумент – табличный документ.
	//
	Процедура СохранитьНастройкуТабличногоДокумента(ТабличныйДокумент) Экспорт
		
		СтруктураПараметров = Новый Структура("ПолеСверху, ПолеСлева, ПолеСправа, ПолеСнизу, МасштабПечати, АвтоМасштаб");
		
		СтруктураПараметров.ПолеСверху    = ТабличныйДокумент.ПолеСверху;
		СтруктураПараметров.ПолеСлева     = ТабличныйДокумент.ПолеСлева;
		СтруктураПараметров.ПолеСправа    = ТабличныйДокумент.ПолеСправа;
		СтруктураПараметров.ПолеСнизу     = ТабличныйДокумент.ПолеСнизу;
		СтруктураПараметров.МасштабПечати = ТабличныйДокумент.МасштабПечати;
		СтруктураПараметров.АвтоМасштаб   = ТабличныйДокумент.АвтоМасштаб;
		
		СохранитьЗначение("ПАРАМЕТРЫ_ПЕЧАТИ_РасчетногоЛисткаОрганизации", СтруктураПараметров);
		
	КонецПроцедуры	
	
	// Вывод результата компоновки в табличный документ
	//
	Процедура ВывестиРезультатВТабличныйДокумент(ПроцессорКомпоновкиДанных, ТабличныйДокумент, ВыводитьПоСтраницам) Экспорт
		
		// Создадим и инициализируем процессор вывода результата
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
		
		// Обозначим начало вывода
		ПроцессорВывода.НачатьВывод();
		Состояние(НСТР("ru='Если Вы хотите прервать вывод отчета, нажмите Ctrl+Break'"));
		
		// Основной цикл вывода отчета
		Счетчик = 0;
		Пока Истина Цикл
			
			
			// Получим следующий элемент результата компоновки
			ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
			
			// Получим следующий элемент результата компоновки
			Если ЭлементРезультата = Неопределено Тогда
				
				// Следующий элемент не получен - заканчиваем цикл вывода
				Прервать;
				
			Иначе
				
				// Элемент получен - выведем его при помощи процессора вывода
				ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
				
			КонецЕсли;
			
			ОбработкаПрерыванияПользователя();
			
		КонецЦикла;
		
		ПроцессорВывода.ЗакончитьВывод();
		
		Если ВыводитьПоСтраницам тогда
			РазбитьТабличныйДокументПоСтраницам(ТабличныйДокумент);
		КонецЕсли
		
	КонецПроцедуры
	
	// Разбивает табличный документ по страницам
	//
	// Параметры:
	//  ТабличныйДокумент - ссылка на табличный документ.
	//
	Процедура РазбитьТабличныйДокументПоСтраницам(ТабличныйДокумент)
		
		//заявка №1693 (база заявок Кристалла) Дмитрук О.Г.
		Если ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда		
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
		мПечатьРасчетногоЛистка = ПрочиеПроцедуры.ПечатьРасчетногоЛистка(Организация);
		//заявка №1693
		
		Состояние(НСТР("ru='Разделение расчетных листков по страницам ...  (Если вы хотите прервать вывод отчета, нажмите Ctrl+Break)'"));
		
		ТабличныйДокументДляПроверки = Новый ТабличныйДокумент;
		ТабличныйДокументДляПроверки.Очистить();
		
		
		Для сч = 0 по НастройкаШириныКолонокРасчетногоЛистка.ВГраница() Цикл
			ОбластьКолонкиРЛ                  = ТабличныйДокумент.Область(, сч+1, , сч+1);
			ОбластьКолонкиРЛ.ШиринаКолонки    = НастройкаШириныКолонокРасчетногоЛистка[сч];
			ОбластьКолонкиРЛ.РазмещениеТекста = ПолучитьТипРазмещенияТекста(НастройкаРазмТекстаКолонокРасчетногоЛистка[сч]);
		КонецЦикла;
		
		
		Для сч = 0 по НастройкаШириныКолонокРасчетногоЛистка.ВГраница() Цикл
			ОбластьКолонкиРЛ                  = ТабличныйДокументДляПроверки.Область(, сч+1, , сч+1);
			ОбластьКолонкиРЛ.ШиринаКолонки    = НастройкаШириныКолонокРасчетногоЛистка[сч];
			ОбластьКолонкиРЛ.РазмещениеТекста = ПолучитьТипРазмещенияТекста(НастройкаРазмТекстаКолонокРасчетногоЛистка[сч]);
		КонецЦикла;
		
		//О.Т. 09.02.2015 № 347 
		ТабличныйДокументДляПроверки.ПолеСверху    = ТабличныйДокумент.ПолеСверху;
		ТабличныйДокументДляПроверки.ПолеСлева     = ТабличныйДокумент.ПолеСлева;
		ТабличныйДокументДляПроверки.ПолеСправа    = ТабличныйДокумент.ПолеСправа;
		ТабличныйДокументДляПроверки.ПолеСнизу     = ТабличныйДокумент.ПолеСнизу;
		ТабличныйДокументДляПроверки.МасштабПечати = ТабличныйДокумент.МасштабПечати;
		ТабличныйДокументДляПроверки.АвтоМасштаб   = ТабличныйДокумент.АвтоМасштаб;
		ЗаполнитьЗначенияСвойств(ТабличныйДокументДляПроверки,ТабличныйДокумент); 
		//О.Т. 09.02.2015 № 347
		
		ОбластьПервойЯчейки = ТабличныйДокумент.НайтиТекст("Расчетный листок");
		
		//Аверсон ЕАЕ 14.01.2025 СВФР-014546
		//С учетом подразделения 
		Если ОбластьПервойЯчейки <> Неопределено Тогда
			ОбластьПервойЯчейки = ПередвинутьОбластьПервойЯчейкиСУчетомПодразделений(ОбластьПервойЯчейки, ТабличныйДокумент);
		КонецЕсли;
		//Аверсон СВФР-014546
		
		Если ОбластьПервойЯчейки = Неопределено тогда
			Возврат;
		КонецЕсли;
		
		НомерСтрокиНачалаРЛ = ОбластьПервойЯчейки.Верх;
		НомерСтрокиНачалаРЛ = НомерСтрокиНачалаРЛ - 1;
		
		ОбластьГруппировки = ТабличныйДокумент.Область(1, , НомерСтрокиНачалаРЛ - 2, );
		ОбластьПриемник    = ТабличныйДокументДляПроверки.Область(1, , НомерСтрокиНачалаРЛ - 2, );
		ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьГруппировки, ОбластьПриемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		ОбластьПоследнейЯчейки = ТабличныйДокумент.НайтиТекст("Долг за ");
		НомерСтрокиКонцаРЛ     = ОбластьПоследнейЯчейки.Верх + 1;
		
		ОбластьРЛ = ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ, , НомерСтрокиКонцаРЛ, );
		ОбластьПриемник = ТабличныйДокументДляПроверки.Область(ТабличныйДокументДляПроверки.ВысотаТаблицы+1, ,ТабличныйДокументДляПроверки.ВысотаТаблицы + (НомерСтрокиКонцаРЛ - НомерСтрокиНачалаРЛ)+1, );
		ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьРЛ, ОбластьПриемник, , истина);
		
		ОбластьСлед = ТабличныйДокумент.Область(НомерСтрокиКонцаРЛ, , НомерСтрокиКонцаРЛ, );
		ОбластьПервойЯчейки = ТабличныйДокумент.НайтиТекст("Расчетный листок", ОбластьСлед);
		
		//Аверсон ЕАЕ 14.01.2025 СВФР-014546
		//С учетом подразделения 
		Если ОбластьПервойЯчейки <> Неопределено Тогда
			ОбластьПервойЯчейки = ПередвинутьОбластьПервойЯчейкиСУчетомПодразделений(ОбластьПервойЯчейки, ТабличныйДокумент);
		КонецЕсли;
		//Аверсон СВФР-014546
		
		Пока ОбластьПервойЯчейки <> Неопределено Цикл
			
			Если ОбластьПервойЯчейки.Верх - НомерСтрокиКонцаРЛ > 2 тогда
				ОбластьГруппировки = ТабличныйДокумент.Область(НомерСтрокиКонцаРЛ + 1, , ОбластьПервойЯчейки.Верх - 1, );
				ОбластьПриемник    = ТабличныйДокументДляПроверки.Область(ТабличныйДокументДляПроверки.ВысотаТаблицы + 1, ,ТабличныйДокументДляПроверки.ВысотаТаблицы + (ОбластьПервойЯчейки.Верх - НомерСтрокиКонцаРЛ - 2) + 1, );
				ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьГруппировки, ОбластьПриемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
			
			НомерСтрокиНачалаРЛ    = ОбластьПервойЯчейки.Верх - 1;
			
			ОбластьСлед = ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ, , НомерСтрокиНачалаРЛ, );
			ОбластьПоследнейЯчейки = ТабличныйДокумент.НайтиТекст("Долг за ", ОбластьСлед);
			НомерСтрокиКонцаРЛ     = ОбластьПоследнейЯчейки.Верх + 1;
			
			ОбластьРЛ = ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ, , НомерСтрокиКонцаРЛ, );
			ОбластьПриемник = ТабличныйДокументДляПроверки.Область(ТабличныйДокументДляПроверки.ВысотаТаблицы + 1, ,ТабличныйДокументДляПроверки.ВысотаТаблицы + (НомерСтрокиКонцаРЛ - НомерСтрокиНачалаРЛ) + 1, );
			ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьРЛ, ОбластьПриемник, , истина);
			
			//заявка №1693 (база заявок Кристалла) Дмитрук О.Г.
			Если Не мПечатьРасчетногоЛистка Тогда 
				Если ТабличныйДокументДляПроверки.КоличествоСтраниц() > 1 тогда
					
					ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ, , НомерСтрокиНачалаРЛ,).НачалоСтраницы = истина;
					
					ТабличныйДокументДляПроверки.Очистить();
					
					Для сч = 0 по НастройкаШириныКолонокРасчетногоЛистка.ВГраница() Цикл
						ОбластьКолонкиРЛ                  = ТабличныйДокументДляПроверки.Область(, сч+1, , сч+1);
						ОбластьКолонкиРЛ.ШиринаКолонки    = НастройкаШириныКолонокРасчетногоЛистка[сч];
						ОбластьКолонкиРЛ.РазмещениеТекста = ПолучитьТипРазмещенияТекста(НастройкаРазмТекстаКолонокРасчетногоЛистка[сч]);
					КонецЦикла;
					
					ОбластьПриемник = ТабличныйДокументДляПроверки.Область(ТабличныйДокументДляПроверки.ВысотаТаблицы + 1, ,ТабличныйДокументДляПроверки.ВысотаТаблицы + (НомерСтрокиКонцаРЛ - НомерСтрокиНачалаРЛ) + 1, );
					ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьРЛ, ОбластьПриемник, , истина);
					
				КонецЕсли;
			Иначе
				ТабличныйДокумент.Область(НомерСтрокиНачалаРЛ, , НомерСтрокиНачалаРЛ,).НачалоСтраницы = истина;
				
				ТабличныйДокументДляПроверки.Очистить();
				
				Для сч = 0 по НастройкаШириныКолонокРасчетногоЛистка.ВГраница() Цикл
					ОбластьКолонкиРЛ                  = ТабличныйДокументДляПроверки.Область(, сч+1, , сч+1);
					ОбластьКолонкиРЛ.ШиринаКолонки    = НастройкаШириныКолонокРасчетногоЛистка[сч];
					ОбластьКолонкиРЛ.РазмещениеТекста = ПолучитьТипРазмещенияТекста(НастройкаРазмТекстаКолонокРасчетногоЛистка[сч]);
				КонецЦикла;
				
				ОбластьПриемник = ТабличныйДокументДляПроверки.Область(ТабличныйДокументДляПроверки.ВысотаТаблицы + 1, ,ТабличныйДокументДляПроверки.ВысотаТаблицы + (НомерСтрокиКонцаРЛ - НомерСтрокиНачалаРЛ) + 1, );
				ТабличныйДокументДляПроверки.ВставитьОбласть(ОбластьРЛ, ОбластьПриемник, , истина);
			КонецЕсли;
			//заявка №1693
			
			ОбластьСлед = ТабличныйДокумент.Область(НомерСтрокиКонцаРЛ, , НомерСтрокиКонцаРЛ, );
			ОбластьПервойЯчейки    = ТабличныйДокумент.НайтиТекст("Расчетный листок", ОбластьСлед);
			
			//Аверсон ЕАЕ 14.01.2025 СВФР-014546
			//С учетом подразделения
			Если ОбластьПервойЯчейки <> Неопределено Тогда
				ОбластьПервойЯчейки = ПередвинутьОбластьПервойЯчейкиСУчетомПодразделений(ОбластьПервойЯчейки, ТабличныйДокумент);
			КонецЕсли;
			//Аверсон СВФР-014546
			
			ОбработкаПрерыванияПользователя();
			
		КонецЦикла;
		
	КонецПроцедуры
	
	Функция ПолучитьТипРазмещенияТекста(ТипРазмещения)
		
		Если ТипРазмещения = ТипРазмещенияТекстаКомпоновкиДанных.Выступать тогда
			Возврат ТипРазмещенияТекстаТабличногоДокумента.Авто;
		ИначеЕсли ТипРазмещения = ТипРазмещенияТекстаКомпоновкиДанных.Забивать тогда
			Возврат ТипРазмещенияТекстаТабличногоДокумента.Забивать;
		ИначеЕсли ТипРазмещения = ТипРазмещенияТекстаКомпоновкиДанных.Обрезать тогда
			Возврат ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		ИначеЕсли ТипРазмещения = ТипРазмещенияТекстаКомпоновкиДанных.Переносить тогда
			Возврат ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		КонецЕсли;
		
	КонецФункции
	
	// Заполняет таблицу значений "НачисленияУдержания" (внешний источник данных).
	//
	Процедура ЗаполнитьВнешнийИсточникДанных(ПостроительОтчетов, ВидРасчетногоЛистка) Экспорт 
		
		//Аверсон 15.11.2022 КВВ СВФР-009838 (
		ГрР_ЧТСВРЛ = Справочники.ГруппыРасчетов.ЧасовойТарифВРЛ.Основные; 
		ФлагТС = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВыводитьТС").Значение; 
		//Аверсон 15.11.2022 КВВ СВФР-009838 )
		
		ДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение;//О.Т. Аверсон 05.06.2016 № 1189
		ДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Значение;
		// Выполнить запрос 
		ПостроительОтчетов.Выполнить();
		
		// Получим таблицу результатов запроса
		ТаблицаРезультатаЗапроса = ПостроительОтчетов.Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		
		СведенияОВидахРасчета     = Новый Соответствие;
		
		// Сформировать таблицу значений
		НачисленияУдержания.Очистить();
		
		// Если вид расчетного листка подробный сформируем выборку с фактическими периодами действия начислений
		Если ВидРасчетногоЛистка = "Подробно" тогда
			// сформируем начальное и конечное сальдо
			Запрос = Новый Запрос;
			
			ФПДУсловиеТекст = 
			"ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации";
			ПолеОрганизация = Новый ПолеКомпоновкиДанных("Организация");
			ПолеФизЛицо     = Новый ПолеКомпоновкиДанных("ФизЛицо");
			ПолеСотрудник   = Новый ПолеКомпоновкиДанных("Сотрудник");
			
			Для каждого ЭлементОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				
				Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = ПолеОрганизация Тогда
					
					Запрос.УстановитьПараметр("Организация", ЭлементОтбора.ПравоеЗначение);
					
					Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
						ВидСравненияОрганизацииСтрокой = "=" 
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
						ВидСравненияОрганизацииСтрокой = "<>"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
						ВидСравненияОрганизацииСтрокой = "В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
						ВидСравненияОрганизацииСтрокой = "В ИЕРАРХИИ"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
						ВидСравненияОрганизацииСтрокой = " НЕ В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
						ВидСравненияОрганизацииСтрокой = "НЕ В ИЕРАРХИИ"
					КонецЕсли; 
					
					ФПДУсловиеТекст = ФПДУсловиеТекст + " И Организация " + ВидСравненияОрганизацииСтрокой + " (&Организация)";
				КонецЕсли;  
				
				
				Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = ПолеФизЛицо Тогда
					
					Запрос.УстановитьПараметр("РаботникиОрганизации", ЭлементОтбора.ПравоеЗначение);
					
					Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
						ВидСравненияРаботник = "=" 
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
						ВидСравненияРаботник = "<>"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
						ВидСравненияРаботник = "В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
						ВидСравненияРаботник = "В ИЕРАРХИИ"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
						ВидСравненияРаботник = " НЕ В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
						ВидСравненияРаботник = "НЕ В ИЕРАРХИИ"
					КонецЕсли; 
					
					ФПДУсловиеТекст = ФПДУсловиеТекст + " И ФизЛицо " + ВидСравненияРаботник + " (&РаботникиОрганизации)";
				КонецЕсли; 
				
				Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлементОтбора.ЛевоеЗначение = ПолеСотрудник И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
					
					Запрос.УстановитьПараметр("РаботникиОрганизации", ЭлементОтбора.ПравоеЗначение.ФизЛицо);
					
					Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
						ВидСравненияРаботник = "=" 
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
						ВидСравненияРаботник = "<>"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
						ВидСравненияРаботник = "В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
						ВидСравненияРаботник = "В ИЕРАРХИИ"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
						ВидСравненияРаботник = " НЕ В"
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии ИЛИ 
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
						ВидСравненияРаботник = "НЕ В ИЕРАРХИИ"
					КонецЕсли; 
					
					ФПДУсловиеТекст = ФПДУсловиеТекст + " И ФизЛицо " + ВидСравненияРаботник + " (&РаботникиОрганизации)";
				КонецЕсли; 
				
			КонецЦикла;
			
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФактическийПериод.Регистратор КАК Регистратор,
			|	ФактическийПериод.НомерСтроки КАК НомерСтроки,
			|	ФактическийПериод.ПериодДействияНачало,
			|	ФактическийПериод.ПериодДействияКонец
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(" + ФПДУсловиеТекст + ") КАК ФактическийПериод
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	НомерСтроки,
			|	ПериодДействияНачало";
			
			Запрос.Текст = ТекстЗапроса;
			
			
			ДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение;
			ДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Значение;
			Запрос.УстановитьПараметр("ПериодРегистрации", 	  	 ДатаНач);
			Запрос.УстановитьПараметр("КонецПериодаРегистрации", ДатаКон);
			ВыборкаПоФПД = Запрос.Выполнить().Выбрать();
			
		КонецЕсли;
		
		// Заполним таблицу значений
		Для каждого СтрокаОрганизация  из ТаблицаРезультатаЗапроса.Строки Цикл
			Для каждого СтрокаПериодаРегистрации из СтрокаОрганизация.Строки Цикл
				Для каждого СтрокаФизЛицо из СтрокаПериодаРегистрации.Строки Цикл
					ОбработкаПрерыванияПользователя(); //О.Т. Аверсон 18.11.2016 № 30
					Выполнился = истина;
					
					// Получим таблицы значений по каждой из частей расчетного листка
					Начисления              = СтрокаФизЛицо.Строки.Найти("Начислено", "ВидДвижения");
					Удержания               = СтрокаФизЛицо.Строки.Найти("Удержано", "ВидДвижения");
					ДоходыВНатуральнойФорме = СтрокаФизЛицо.Строки.Найти("ДоходыВНатуральнойФорме", "ВидДвижения");
					Выплачено              	= СтрокаФизЛицо.Строки.Найти("Выплата", "ВидДвижения");
					Сальдо                  = СтрокаФизЛицо.Строки.Найти("Сальдо", "ВидДвижения");
					
					// Определим максимальное количество строк из таблиц начислений и удержания
					КолВоСтрокНачислений = ?(Начисления <> Неопределено, Начисления.Строки.Количество(), 0)- 1;
					КолВоСтрокУдержаний  = ?(Удержания <> Неопределено, Удержания.Строки.Количество(), 0) - 1; 
					МаксКолвоСтрок = Макс(КолВоСтрокНачислений, КолВоСтрокУдержаний); 
					
					//Проверяем количество строк в отчет
					Если Сальдо <> Неопределено И Сальдо.Строки.Количество()> 0 тогда
						СтрокаСальдо = Сальдо.Строки[0];
						//О.Т. Аверсон 05.06.2016 № 1189
						Если СтрокаСальдо.ПериодРегистрации >= Дата(2016,07,01) Тогда
							СальдоКон = Окр(СтрокаСальдо.СальдоКонечное,2);
							СальдоНач = Окр(СтрокаСальдо.СальдоНачальное,2);
						иначе
							СальдоКон = Окр(СтрокаСальдо.СальдоКонечное,0);
							СальдоНач = Окр(СтрокаСальдо.СальдоНачальное,0);
						КонецЕсли;
						//О.Т. Аверсон 05.06.2016 № 1189
						Оборот    = СтрокаСальдо.Оборот;
					Иначе
						СальдоКон = 0;
						СальдоНач = 0;
						Оборот    = 0;
					КОнецЕсли; 
					
					Если МаксКолвоСтрок = -1 И СтрокаСальдо <> Неопределено тогда
						СтрокаНачисленияУдержания                            = НачисленияУдержания.Добавить();
						СтрокаНачисленияУдержания.ВидДвижения                = "3";
						СтрокаНачисленияУдержания.ПризнакУпорядочиванияСтрок = 999;
						//О.Т. Аверсон 05.06.2016 № 1189
						Если ДатаКон >= Дата(2016,07,01) Тогда
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,2);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,2);
						иначе
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,0);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,0);
						КонецЕсли;
						//О.Т. Аверсон 05.06.2016 № 1189
						СтрокаНачисленияУдержания.Оборот          = Оборот;
					КонецЕсли;
					
					
					// Перенесем таблицы начисления  значений в таблицу внешнего источника данных 
					Сч = 0;
					
					Пока Сч <= МаксКолвоСтрок Цикл
						
						НомерСтрокиНачисления = 0;
						РегистраторНачисления = "";
						
						// Добавим строку и заполним значений колонок
						СтрокаНачисленияУдержания                            = НачисленияУдержания.Добавить();
						СтрокаНачисленияУдержания.ВидДвижения                = "1";
						СтрокаНачисленияУдержания.ПризнакУпорядочиванияСтрок = Сч;
						//О.Т. Аверсон 05.06.2016 № 1189
						Если ДатаКон >= Дата(2016,07,01) Тогда
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,2);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,2);
						иначе
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,0);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,0);
						КонецЕсли;
						//О.Т. Аверсон 05.06.2016 № 1189
						СтрокаНачисленияУдержания.Оборот          = Оборот;
						
						
						Если Сч <= КолВоСтрокНачислений тогда
							СтрокаНачисленияУдержания.ФизЛицо           = Начисления.Строки[Сч].ФизЛицо;
							СтрокаНачисленияУдержания.Организация       = Начисления.Строки[Сч].Организация;
							СтрокаНачисленияУдержания.ПериодРегистрации = Начисления.Строки[Сч].ПериодРегистрации;
							
							// Если вид расчетного листка подробный, то добавим к начислению периоды действия и показатели
							Если ВидРасчетногоЛистка = "Подробно" И ТипЗнч(Начисления.Строки[Сч].ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") тогда
								
								ВидРасчета = Начисления.Строки[Сч].ВидРасчета;
								ОбъединятьВР = Начисления.Строки[Сч].ОбъединятьВР; //Аверсон 13.05.2021 КВВ СВФР-007584
								
								ВидНачисленияНаименование = Строка(ВидРасчета) + Начисления.Строки[Сч].ДополнениеКВидуРасчета;
								
								НомерСтрокиНачисления = Начисления.Строки[Сч].НомерСтроки;
								РегистраторНачисления = Начисления.Строки[Сч].Регистратор;
								НачалоПериодаДействия = Начисления.Строки[Сч].ПериодДействияНачало;
								КонецПериодаДействия  = Начисления.Строки[Сч].ПериодДействияКонец;
								СчДобавленныхСтрок = 1;
								СведенияОВидеРасчета = РаботаСДиалогами.ПолучитьСведенияОВидеРасчетаСхемыМотивации(СведенияОВидахРасчета, ВидРасчета, "ПриРасчете");
								ПервыйРаз = истина;
								
								Для СчПоказатель = 1 по Мин(СведенияОВидеРасчета["КоличествоПоказателей"], 6) Цикл
									Если СведенияОВидеРасчета["Показатель"+СчПоказатель+"Видимость"] И СведенияОВидеРасчета["Показатель" + СчПоказатель + "Наименование"] <> Null тогда
										Если ПервыйРаз тогда
											ВидНачисленияНаименование = ВидНачисленияНаименование + Символы.ПС + " показатели:";
											ПервыйРаз                 = ложь;
										КонецЕсли;
										ВидНачисленияНаименование = ВидНачисленияНаименование + Символы.ПС + " " + СведенияОВидеРасчета["Показатель" + СчПоказатель + "Наименование"] + " - " + Начисления.Строки[Сч]["Показатель"+СчПоказатель];
									ИначеЕсли СведенияОВидеРасчета["ПоказательТР" + СчПоказатель + "НаименованиеВидимость"] И СведенияОВидеРасчета["ПоказательТР" + СчПоказатель + "Наименование"] <> Null тогда
										Если ПервыйРаз тогда
											ВидНачисленияНаименование = ВидНачисленияНаименование + Символы.ПС + " показатели:";
											ПервыйРаз                 = ложь;
										КонецЕсли;
										ВидНачисленияНаименование = ВидНачисленияНаименование + Символы.ПС + " " + СведенияОВидеРасчета["ПоказательТР" + СчПоказатель + "Наименование"] + " - " + Начисления.Строки[Сч]["Показатель"+СчПоказатель];
									КонецЕсли;                                                                  
								КонецЦикла;
								
								СтрокаНачисленияУдержания.НачисленияУдержанияВидНачисления = ВидНачисленияНаименование;
								
								ВыборкаПоФПД.Сбросить();
								
								Если ВыборкаПоФПД.НайтиСледующий(Новый Структура("Регистратор, НомерСтроки", РегистраторНачисления, НомерСтрокиНачисления)) Тогда
									Если ((ВыборкаПоФПД.ПериодДействияНачало <> НачалоПериодаДействия) или (ВыборкаПоФПД.ПериодДействияКонец <> КонецПериодаДействия)) 
										И ОбъединятьВР = 0 Тогда //Аверсон 13.05.2021 КВВ СВФР-007584
										
										СтрокаНачислений                      = Начисления.Строки.Вставить(Сч+СчДобавленныхСтрок);
										СтрокаНачислений.ВидРасчета           = "  оплачены периоды:";
										СтрокаНачислений.ФизЛицо              = Начисления.Строки[Сч].ФизЛицо;
										СтрокаНачислений.Организация          = Начисления.Строки[Сч].Организация;
										СтрокаНачислений.ПериодРегистрации    = Начисления.Строки[Сч].ПериодРегистрации;
										СтрокаНачислений.ПериодДействияНачало = ВыборкаПоФПД.ПериодДействияНачало;
										СтрокаНачислений.ПериодДействияКонец  = ВыборкаПоФПД.ПериодДействияКонец;
										КолВоСтрокНачислений                  = КолВоСтрокНачислений + 1;
										МаксКолвоСтрок                      = МаксКолвоСтрок + 1;
										СчДобавленныхСтрок                    = СчДобавленныхСтрок + 1;
										
										Пока ВыборкаПоФПД.Следующий() Цикл
											
											Если ВыборкаПоФПД.НомерСтроки <> НомерСтрокиНачисления или ВыборкаПоФПД.Регистратор <> РегистраторНачисления Тогда
												Прервать;
											КонецЕсли;
											
											СтрокаНачислений                      = Начисления.Строки.Вставить(Сч+СчДобавленныхСтрок);
											СтрокаНачислений.ВидРасчета           = "";
											СтрокаНачислений.ФизЛицо              = Начисления.Строки[Сч].ФизЛицо;
											СтрокаНачислений.Организация          = Начисления.Строки[Сч].Организация;
											СтрокаНачислений.ПериодРегистрации    = Начисления.Строки[Сч].ПериодРегистрации;
											СтрокаНачислений.ПериодДействияНачало = ВыборкаПоФПД.ПериодДействияНачало;
											СтрокаНачислений.ПериодДействияКонец  = ВыборкаПоФПД.ПериодДействияКонец;
											КолВоСтрокНачислений                  = КолВоСтрокНачислений + 1;
											МаксКолвоСтрок                      = МаксКолвоСтрок + 1;
											СчДобавленныхСтрок                    = СчДобавленныхСтрок + 1;
											
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
							Иначе
								//Аверсон 15.11.2022 КВВ СВФР-009838 (
								Если ВидРасчетногоЛистка = "Кратко" Тогда
									ПояснениеВР = "";
									Если ФлагТС Тогда
										Массив_ГрР_ЧТСВРЛ = ГрР_ЧТСВРЛ.НайтиСтроки(Новый Структура("ВидРасчета",Начисления.Строки[Сч].ВР)); 
										Если Массив_ГрР_ЧТСВРЛ.Количество()>0 Тогда
											Если Начисления.Строки[Сч].Показатель1 <> 0 Тогда
												ПояснениеВР = " (" + СокрЛП(Начисления.Строки[Сч].Показатель1) + ")";
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
									СтрокаНачисленияУдержания.НачисленияУдержанияВидНачисления = Начисления.Строки[Сч].ВидРасчета + ПояснениеВР;
								Иначе
									//Аверсон 15.11.2022 КВВ СВФР-009838 )
									
									СтрокаНачисленияУдержания.НачисленияУдержанияВидНачисления = Начисления.Строки[Сч].ВидРасчета; 
								КонецЕсли;
							КонецЕсли;
							СтрокаНачисленияУдержания.НачисленияУдержанияОтработанныеДни   = Начисления.Строки[Сч].ОтработаноДней;
							СтрокаНачисленияУдержания.НачисленияУдержанияОтработанныеЧасы  = Начисления.Строки[Сч].ОтработаноЧасов;
							СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеДни     = Начисления.Строки[Сч].ОплаченоДней;
							
							//Островская Татьяна 07.02.2014 № 17065
							Если не ?(Начисления.Строки[Сч].НеВыводитьПоказательРасчета=Неопределено,Истина,Начисления.Строки[Сч].НеВыводитьПоказательРасчета) Тогда //О.Т. Аверсон 22.11.2016 №45
								Если не (Начисления.Строки[Сч].СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням и ОтпускТолькоДни) Тогда 
									СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеЧасы    = Строка(?(Начисления.Строки[Сч].ОплаченоЧасов=0,"",Начисления.Строки[Сч].ОплаченоЧасов))+?(?(Начисления.Строки[Сч].ОплаченоЧасов=Неопределено,0,Начисления.Строки[Сч].ОплаченоЧасов)>0,
									Начисления.Строки[Сч].СтрокаПроцент,"");
								КонецЕсли;
							КонецЕсли;
							//Островская Татьяна 07.02.2014 № 17065
							
							//Аверсон 30.04.2020 КВВ СВФР-005931 (
							НаимВР_ = СокрЛП(Начисления.Строки[Сч].ВидРасчета);
							Если НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоДням.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоЧасам.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифДневной.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифЧасовой.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойОкладПоЧасам.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойТарифЧасовой.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойПоВинеРаботодателя.Наименование ИЛИ
								НаимВР_ = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойПоВинеРаботодателя.Наименование Тогда
								Если Начисления.Строки[Сч].СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ
									Начисления.Строки[Сч].СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
									СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеДни = 0;
								Иначе
									СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеЧасы = 0;
								КонецЕсли;
							КонецЕсли;
							//Аверсон 30.04.2020 КВВ СВФР-005931 )
							
							
							//О.Т. Аверсон 05.06.2016 № 1189
							Если не Начисления.Строки[Сч].Результат = Неопределено Тогда
								Если Начисления.Строки[Сч].ПериодРегистрации >= Дата(2016,07,01) Тогда
									СтрокаНачисленияУдержания.НачисленияУдержанияСуммаНачисления   = Окр(Начисления.Строки[Сч].Результат,2);
								иначе
									СтрокаНачисленияУдержания.НачисленияУдержанияСуммаНачисления   = Окр(Начисления.Строки[Сч].Результат,0);
								КонецЕсли;
							КонецЕсли;
							
							Если ОбъединятьВР = 0 Тогда //Аверсон 13.05.2021 КВВ СВФР-007584
								//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
								Если Начисления.Строки[Сч].ЭтоПроцентныйПоказатель  Тогда  
									СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеЧасы	= 
									СокрЛП( СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеЧасы )
									+ "%";
								КонецЕсли;
								//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
							КонецЕсли;
							
							//О.Т. Аверсон 05.06.2016 № 1189
							Если ВидРасчетногоЛистка = "Подробно" и ТипЗнч(Начисления.Строки[Сч].ПериодДействияНачало) = Тип("Дата") тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодНачисления = ОбщегоНазначения.ОписаниеПериода(Начисления.Строки[Сч].ПериодДействияНачало, Начисления.Строки[Сч].ПериодДействияКонец);
								//толик							
							ИначеЕсли ТипЗнч(Начисления.Строки[Сч].ПериодДействия) = Тип("Дата") тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодНачисления = Формат(Начисления.Строки[Сч].ПериодДействия, "ДФ=MM.yy");
							КонецЕсли;
							
						КонецЕсли;
						
						// Добавим строку 2-го раздела
						Если Сч <= КолВоСтрокУдержаний тогда
							
							СтрокаНачисленияУдержания.ФизЛицо                              = Удержания.Строки[Сч].ФизЛицо;
							СтрокаНачисленияУдержания.Организация                          = Удержания.Строки[Сч].Организация;
							СтрокаНачисленияУдержания.ПериодРегистрации                    = Удержания.Строки[Сч].ПериодРегистрации;
							//Аверсон-софт, Островская Татьяна 28.04.2012 № 15272
							если  Удержания.Строки[Сч].ВидРасчета = "Подоходный налог исчисленный по ставке 12%" или
								Удержания.Строки[Сч].ВидРасчета = "Подоходный налог исчисленный " тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияВидУдержания      =Лев(Удержания.Строки[Сч].ВидРасчета,17);
							иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияВидУдержания      =Удержания.Строки[Сч].ВидРасчета;
							КонецЕсли;
							//Аверсон-софт, Островская Татьяна 28.04.2012 № 15272
							
							Если ВидРасчетногоЛистка = "Подробно" тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодУдержания = ОбщегоНазначения.ОписаниеПериода(Удержания.Строки[Сч].ПериодДействияНачало, Удержания.Строки[Сч].ПериодДействияКонец);
								//толик							
							ИначеЕсли ТипЗнч(Удержания.Строки[Сч].ПериодДействия) = Тип("Дата") тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодУдержания = Формат(Удержания.Строки[Сч].ПериодДействия, "ДФ=MM.yy");
							КонецЕсли;
							//О.Т. Аверсон 05.06.2016 № 1189
							Если Удержания.Строки[Сч].ПериодРегистрации >= Дата(2016,07,01) Тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаУдержания    = Окр(Удержания.Строки[Сч].Результат,2);
							иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаУдержания    = Окр(Удержания.Строки[Сч].Результат,0);
							КонецЕсли;
							//О.Т. Аверсон 05.06.2016 № 1189
						КонецЕсли;
						
						Сч = Сч + 1;
						
					КонецЦикла;
					
					КолВоСтрокДоходыВНатуральнойФорме = ?(ДоходыВНатуральнойФорме <> Неопределено, ДоходыВНатуральнойФорме.Строки.Количество(), 0)-1;
					КолВоСтрокВыплачено               = ?(Выплачено <> Неопределено, Выплачено.Строки.Количество(), 0)-1;
					
					Если МаксКолвоСтрок = -1 И Макс(КолВоСтрокДоходыВНатуральнойФорме, КолВоСтрокВыплачено) = -1 тогда
						СтрокаНачисленияУдержания                            = НачисленияУдержания.Добавить();
						СтрокаНачисленияУдержания.ВидДвижения                = "3";
						СтрокаНачисленияУдержания.ПризнакУпорядочиванияСтрок = 0;
						СтрокаНачисленияУдержания.ФизЛицо           = СтрокаФизЛицо.ФизЛицо;
						СтрокаНачисленияУдержания.Организация       = СтрокаФизЛицо.Организация;
						СтрокаНачисленияУдержания.ПериодРегистрации = СтрокаФизЛицо.ПериодРегистрации;
						//О.Т. Аверсон 05.06.2016 № 1189
						Если СтрокаФизЛицо.ПериодРегистрации >= Дата(2016,07,01) Тогда
							СтрокаНачисленияУдержания.СальдоНачальное   = Окр(СальдоНач,2);
							СтрокаНачисленияУдержания.СальдоКонечное    = Окр(СальдоКон,2);
						иначе
							СтрокаНачисленияУдержания.СальдоНачальное   = Окр(СальдоНач,0);
							СтрокаНачисленияУдержания.СальдоКонечное    = Окр(СальдоКон,0);
						КонецЕсли;
						//О.Т. Аверсон 05.06.2016 № 1189
						СтрокаНачисленияУдержания.Оборот            = Оборот;
					КонецЕсли;
					
					МаксКолвоСтрок = Макс(КолВоСтрокДоходыВНатуральнойФорме, КолВоСтрокВыплачено);
					
					
					
					// заполним строки 3-го и 4-го разделов
					Для Сч = 0 по МаксКолвоСтрок Цикл
						
						СтрокаНачисленияУдержания = НачисленияУдержания.Добавить();
						СтрокаНачисленияУдержания.ВидДвиженияУд = "2";
						//О.Т. Аверсон 05.06.2016 № 1189
						Если ДатаКон >= Дата(2016,07,01) Тогда
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,2);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,2);
						иначе
							СтрокаНачисленияУдержания.СальдоНачальное = Окр(СальдоНач,0);
							СтрокаНачисленияУдержания.СальдоКонечное  = Окр(СальдоКон,0);
						КонецЕсли;
						//О.Т. Аверсон 05.06.2016 № 1189
						
						СтрокаНачисленияУдержания.Оборот          = Оборот;
						
						Если Сч <= КолВоСтрокДоходыВНатуральнойФорме тогда
							
							СтрокаНачисленияУдержания.ФизЛицо                              = ДоходыВНатуральнойФорме.Строки[Сч].ФизЛицо;
							СтрокаНачисленияУдержания.Организация                          = ДоходыВНатуральнойФорме.Строки[Сч].Организация;
							СтрокаНачисленияУдержания.ПериодРегистрации                    = ДоходыВНатуральнойФорме.Строки[Сч].ПериодРегистрации;
							
							Если ВидРасчетногоЛистка = "Подробно" тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияВидНачисления = Строка(ДоходыВНатуральнойФорме.Строки[Сч].ВидРасчета) + ДоходыВНатуральнойФорме.Строки[Сч].ДополнениеКВидуРасчета;
							Иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияВидНачисления = ДоходыВНатуральнойФорме.Строки[Сч].ВидРасчета;
							КонецЕсли;
							
							Если ВидРасчетногоЛистка = "Подробно" тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодНачисления = ОбщегоНазначения.ОписаниеПериода(ДоходыВНатуральнойФорме.Строки[Сч].ПериодДействияНачало, ДоходыВНатуральнойФорме.Строки[Сч].ПериодДействияКонец);
								//толик							
							ИначеЕсли ТипЗнч(ДоходыВНатуральнойФорме.Строки[Сч].ПериодДействия) = Тип("Дата") тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодНачисления = Формат(ДоходыВНатуральнойФорме.Строки[Сч].ПериодДействия, "ДФ=MM.yy");
							КонецЕсли;
							
							СтрокаНачисленияУдержания.НачисленияУдержанияОтработанныеДни   = ДоходыВНатуральнойФорме.Строки[Сч].ОтработаноДней;
							СтрокаНачисленияУдержания.НачисленияУдержанияОтработанныеЧасы  = ДоходыВНатуральнойФорме.Строки[Сч].ОтработаноЧасов;
							СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеДни     = ДоходыВНатуральнойФорме.Строки[Сч].ОплаченоДней;
							//Островская Татьяна 07.02.2014 № 17065
							Если не ДоходыВНатуральнойФорме.Строки[Сч].НеВыводитьПоказательРасчета Тогда //О.Т. Аверсон 22.11.2016  №45
								Если не (ДоходыВНатуральнойФорме.Строки[Сч].СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням и ОтпускТолькоДни) Тогда
									СтрокаНачисленияУдержания.НачисленияУдержанияОплаченныеЧасы    = Строка(ДоходыВНатуральнойФорме.Строки[Сч].ОплаченоЧасов)+
									?(ДоходыВНатуральнойФорме.Строки[Сч].ОплаченоЧасов>0,ДоходыВНатуральнойФорме.Строки[Сч].СтрокаПроцент,"");
								КонецЕсли;
							КонецЕсли;
							//Островская Татьяна 07.02.2014 № 17065
							
							//О.Т. Аверсон 05.06.2016 № 1189
							Если ДоходыВНатуральнойФорме.Строки[Сч].ПериодРегистрации >= Дата(2016,07,01) Тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаНачисления   = Окр(ДоходыВНатуральнойФорме.Строки[Сч].Результат,2);
							иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаНачисления   = Окр(ДоходыВНатуральнойФорме.Строки[Сч].Результат,0);
							КонецЕсли;
							//О.Т. Аверсон 05.06.2016 № 1189
						КонецЕсли;
						
						Если Сч <= КолВоСтрокВыплачено тогда
							
							СтрокаНачисленияУдержания.ФизЛицо                              = Выплачено.Строки[Сч].ФизЛицо;
							СтрокаНачисленияУдержания.Организация                          = Выплачено.Строки[Сч].Организация;
							СтрокаНачисленияУдержания.ПериодРегистрации                    = Выплачено.Строки[Сч].ПериодРегистрации;
							//Аверсон-софт, Островская Татьяна 15.05.2012 № 15355
							Если Найти(Выплачено.Строки[Сч].ВидРасчета,"под расчет")>0 Тогда //О.Т. Аверсон 28.04.2018
								СтрокаНач = Найти(Выплачено.Строки[Сч].ВидРасчета,"под расчет");
								СтрокаНачисленияУдержания.НачисленияУдержанияВидУдержания      = СтрЗаменить(Выплачено.Строки[Сч].ВидРасчета,Сред(Выплачено.Строки[Сч].ВидРасчета,СтрокаНач-1,13),"");
							иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияВидУдержания      = Выплачено.Строки[Сч].ВидРасчета;  
							КонецЕсли;
							//Аверсон-софт, Островская Татьяна 15.05.2012 № 15355
							Если ВидРасчетногоЛистка = "Подробно" тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодУдержания = ОбщегоНазначения.ОписаниеПериода(Выплачено.Строки[Сч].ПериодДействияНачало, Выплачено.Строки[Сч].ПериодДействияКонец);
								//толик							
							ИначеЕсли ТипЗнч(Выплачено.Строки[Сч].ПериодДействия) = Тип("Дата") тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияПериодУдержания = Формат(Выплачено.Строки[Сч].ПериодДействия, "ДФ=MM.yy");
							КонецЕсли;
							//О.Т. Аверсон 05.06.2016 № 1189
							Если Выплачено.Строки[Сч].ПериодРегистрации >= Дата(2016,07,01) Тогда
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаУдержания    = Окр(Выплачено.Строки[Сч].Результат,2);
							иначе
								СтрокаНачисленияУдержания.НачисленияУдержанияСуммаУдержания    = Окр(Выплачено.Строки[Сч].Результат,0);
							КонецЕсли;
							//О.Т. Аверсон 05.06.2016 № 1189
							
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецПроцедуры
	
	
	// Настраивает построитель запросов
	//
	Процедура НастроитьПостроительЗапросов(ПостроительОтчетов, ВидРасчетногоЛистка) Экспорт
		
		ФлагТС = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВыводитьТС").Значение; //Аверсон 15.11.2022 КВВ СВФР-009838
		
		ДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение;
		ДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Значение;
		
		// Заполнить параметры построителя запросов
		ПостроительОтчетов.Параметры.Вставить("парамПустаяОрганизация", 	Справочники.Организации.ПустаяСсылка());
		ПостроительОтчетов.Параметры.Вставить("ПериодРегистрации", 	  	    ДатаНач);
		ПостроительОтчетов.Параметры.Вставить("КонецПериодаРегистрации", 	КонецДня(ДатаКон));
		
		НачислениеВозврат = Новый Массив;
		НачислениеВозврат.Добавить(Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
		НачислениеВозврат.Добавить(Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога);
		
		ПостроительОтчетов.Параметры.Вставить("ВидСтроки",              	НачислениеВозврат);
		ПостроительОтчетов.Параметры.Вставить("ВозвратНалога",              Перечисления.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога);
		
		ПостроительОтчетов.Параметры.Вставить("Расход", 					ВидДвиженияНакопления.Расход);
		ПостроительОтчетов.Параметры.Вставить("Приход", 					ВидДвиженияНакопления.Приход);
		ПостроительОтчетов.Параметры.Вставить("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
		ПостроительОтчетов.Параметры.Вставить("ЗанятостьНеУказана",		    Перечисления.ВидыЗанятостиВОрганизации.ПустаяСсылка());
		ПостроительОтчетов.Параметры.Вставить("Прием",						Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
		
		Авансы = Новый Массив;
		Авансы.Добавить(Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца);
		Авансы.Добавить(Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс);
		
		ПостроительОтчетов.Параметры.Вставить("Аванс",			  Авансы);
		ПостроительОтчетов.Параметры.Вставить("Расчет",		      Перечисления.ХарактерВыплатыЗарплаты.Зарплата);
		ПостроительОтчетов.Параметры.Вставить("ХарактерНеУказан", Перечисления.ХарактерВыплатыЗарплаты.ПустаяСсылка());
		ПостроительОтчетов.Параметры.Вставить("ЧерезКассу",	      Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу);
		ПостроительОтчетов.Параметры.Вставить("ЧерезБанк",		  Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
		ПостроительОтчетов.Параметры.Вставить("Общая",			  Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
		ПостроительОтчетов.Параметры.Вставить("Дивиденды",		  Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09);
		ПостроительОтчетов.Параметры.Вставить("ПустаяКатегория",  Перечисления.КатегорииДолжностейДляСтатистическогоУчета.ПустаяСсылка());
		ПостроительОтчетов.Параметры.Вставить("ПустаяДолжность",  Справочники.ДолжностиОрганизаций.ПустаяСсылка());
		//О.Т. Аверсон 26.01.2017 № 230
		
		//Аверсон 03.12.2022 КВВ СВФР-009934 (
		//ПостроительОтчетов.Параметры.Вставить("Замена",  ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Замены"));
		МассивЗамены = Новый СписокЗначений;
		ВыборкаЗамен = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Выбрать();
		Пока ВыборкаЗамен.Следующий() Цикл
			Если Лев(ВыборкаЗамен.Наименование,6) = "Замены" Тогда
				МассивЗамены.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию(ВыборкаЗамен.Наименование));
			КонецЕсли;
		КонецЦикла;
		ПостроительОтчетов.Параметры.Вставить("Замена",  МассивЗамены);
		//Аверсон 03.12.2022 КВВ СВФР-009934 )
		
		ПостроительОтчетов.Параметры.Вставить("Сверхустановленные",  ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Сверх установленной нормы"));
		//О.Т. Аверсон 26.01.2017 № 230
		
		//О.Т. Аверсон 22.08.2017 № 951
		МассивСверхурочные = Новый СписокЗначений;
		МассивСверхурочные.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаСверхурочные);
		МассивСверхурочные.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаСверхурочных);
		ПостроительОтчетов.Параметры.Вставить("Сверхурочные",  МассивСверхурочные);
		//О.Т. Аверсон 22.08.2017 № 951
		
		//Аверсон 30.04.2020 КВВ СВФР-005931 (
		МассивПростои = Новый СписокЗначений;
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоДням);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоЧасам);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифДневной);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифЧасовой);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойОкладПоЧасам);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойТарифЧасовой);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПочасовойПростойПоВинеРаботодателя);
		МассивПростои.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойПоВинеРаботодателя);
		ПостроительОтчетов.Параметры.Вставить("ВРПростои",  МассивПростои);
		//Аверсон 30.04.2020 КВВ СВФР-005931 )
		
		МассивКодыМатвыгоды = Новый Массив;
		МассивКодыМатвыгоды.Добавить(Справочники.ДоходыНДФЛ.Код99998проценты);
		МассивКодыМатвыгоды.Добавить(Справочники.ДоходыНДФЛ.Код99999товары);
		
		
		ПостроительОтчетов.Параметры.Вставить("КодыМатвыгоды",	МассивКодыМатвыгоды);
		
		МассивСпособРасчетаПроцент = Новый Массив;
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП); //О.Т. Аверсон 04.11.2016 № 1501
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентомОтТС);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки1Разряда);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки1РазрядаПоРаботнику);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиБезКонтракта); 
		//О.Т. Аверсон 10.03.2017 № 392
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки1РазрядаОтрВр);
		МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиПоИнструкции);
		//О.Т. Аверсон 10.03.2017 № 392
		//О.Т. Аверсон 16.05.2017 № 638
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		
		Если Организация.ИНН = "100765738" Тогда 	
			МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность);
			МассивСпособРасчетаПроцент.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредностьОтОтработанногоВремени);
			МассивСпособРасчетаВредность = Новый Массив;
		иначе
			МассивСпособРасчетаВредность = Новый Массив;
			МассивСпособРасчетаВредность.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность);
			МассивСпособРасчетаВредность.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредностьОтОтработанногоВремени);
			
		КонецЕсли;
		//О.Т. Аверсон 16.05.2017 № 638
		
		ПостроительОтчетов.Параметры.Вставить("СпособыРасчетаПроцентом",	МассивСпособРасчетаПроцент);
		ПостроительОтчетов.Параметры.Вставить("СпособыРасчетаВредность",	МассивСпособРасчетаВредность);
		ПостроительОтчетов.Параметры.Вставить("ПустойСпособ",	Перечисления.СпособыРасчетаОплатыТруда.ПустаяСсылка());
		
		// Аверсон 13.05.2021 КВВ СВФР-007584 (
		СписокДляОбъединения = Новый СписокЗначений;
		Если ОбъединятьНачисления Тогда
			ГруппаРасчетов = Справочники.ГруппыРасчетов.ОбъединениеСтрокНачисленийРЛФорма2;
			Для Каждого Стр из ГруппаРасчетов.Основные Цикл 
				СписокДляОбъединения.Добавить(Стр.ВидРасчета);
			КонецЦикла;
		КонецЕсли;
		ПостроительОтчетов.Параметры.Вставить("СписокДляОбъединения",	СписокДляОбъединения);
		//Аверсон 13.05.2021 КВВ СВФР-007584 )
		
		//Аверсон ЕАЕ 16.09.2024 СВФР-013702
		ПостроительОтчетов.Параметры.Вставить("ВидРасчетаВредность", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаВредныеУсловияТруда);
		//Аверсон СВФР-013702
		
		
		// Присвоим текст запроса в зависимости от типа расчетного листка
		//толик изменил сортировку и дни/часы отработано !!!!
		//Островская Татьяна 07.02.2014 № 17065
		Если ВидРасчетногоЛистка = "Кратко" тогда	
			//толик убрал пенсионный фонд из удержаний, ублал "исчисленный"
			ТекстПостроителя = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачисленияУдержания.ВидДвижения КАК ВидДвижения,
			|	НачисленияУдержания.ФизЛицо КАК ФизЛицо,
			|	НачисленияУдержания.Организация КАК Организация,
			|	НачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	НачисленияУдержания.Показатель1 КАК Показатель1,
				|	НачисленияУдержания.ВР КАК ВР,";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|	НачисленияУдержания.ВидРасчета КАК ВидРасчета,
			|	НачисленияУдержания.ОбъединятьВР КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|	НачисленияУдержания.СпособРасчета,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   НачисленияУдержания.ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|	НачисленияУдержания.ПорядокВидаРасчета КАК ПорядокВидаРасчета,
			|	НачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
			|	НачисленияУдержания.ОтработаноЧасов,
			|	НачисленияУдержания.ОплаченоДней,
			|	НачисленияУдержания.ОплаченоЧасов,
			|	НачисленияУдержания.Результат,
			|	НачисленияУдержания.СальдоНачальное,
			|	НачисленияУдержания.СальдоКонечное,
			|	НачисленияУдержания.ПериодДействия,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746
			|   НачисленияУдержания.ПериодДействияНачало,
			//Аверсон СВФР-007746
			
			|	НачисленияУдержания.Оборот,
			|	НачисленияУдержания.СтрокаПроцент,
			|	НачисленияУдержания.НеВыводитьПоказательРасчета
			
			|ПОМЕСТИТЬ ВТ1 //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
			|				ТОГДА ""ДоходыВНатуральнойФорме""
			|			ИНАЧЕ ""Начислено""
			|		КОНЕЦ КАК ВидДвижения,
			|		ОсновныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация,
			|		ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации КАК ПериодРегистрации,
			|		ОсновныеНачисленияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	ОсновныеНачисленияРаботниковОрганизации.Показатель1 КАК Показатель1,
				|	ОсновныеНачисленияРаботниковОрганизации.ВидРасчета КАК ВР,";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.Наименование + ВЫБОР
			|			КОГДА ЕСТЬNULL(ОсновныеНачисленияРаботниковОрганизации.Сотрудник.ВидЗанятости, &ЗанятостьНеУказана) <> &ВнутреннееСовместительство
			|				ТОГДА """"
			|			ИНАЧЕ "" (по внутр. совмест-ву)""
			|		КОНЕЦ КАК ВидРасчета,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1 ИНАЧЕ 0
			|КОНЕЦ КАК ОбъединятьВР, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета как СпособРасчета,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	ВЫРАЗИТЬ( ОсновныеНачисленияРаботниковОрганизации.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций ).СпособРасчета 
			|				= ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ОтСтажаПоСумме) КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""А"" + ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетОтработанногоВремени
			|				ТОГДА ""А""
			|			ИНАЧЕ ""Б""
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетНормыВремени
			|				ТОГДА ""А""
			|			ИНАЧЕ ""Б""
			|		КОНЕЦ + ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.Код КАК ПорядокВидаРасчета,
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)"; //О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|				ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаДней
			|			ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
			|		КОНЕЦ КАК ОтработаноДней,
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|				ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаЧасов
			|			ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
			|		КОНЕЦ КАК ОтработаноЧасов,
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|				ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаДней
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			//|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Замена 
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Замена) //Аверсон 03.12.2022 КВВ СВФР-009934  
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Сверхустановленные
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Сверхурочные)//О.Т. Аверсон 22.08.2017 № 951
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам) //О.Т. Аверсон 16.03.2018 № 1726
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&ВРПростои)//Аверсон 30.04.2020 КВВ СВФР-005931
			|                           ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням) //Аверсон 14.04.2021 КВВ СВФР-007450
			
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДней
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней = 0
			|								ТОГДА ";
			
			//Аверсон 16.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ВЫБОР КОГДА 
				|           ОсновныеНачисленияРаботниковОрганизации.Результат = 0
				|			И
				|			(ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке)
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
				|ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
				|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.НормаДней
				|КОНЕЦ";
			Иначе
				ТекстПостроителя = ТекстПостроителя + "
				|          ОсновныеНачисленияРаботниковОрганизации.НормаДней";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 16.11.2022 КВВ СВФР-009838 )
			
			|							ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
			|						КОНЕЦ
			|				КОНЕЦ
			|		КОНЕЦ КАК ОплаченоДней,
			|		ВЫБОР
			|           КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ОтСтажаПоСумме) ТОГДА ОсновныеНачисленияРаботниковОрганизации.Показатель1 //+ СВЭЙ КДЯ 27.02.20 СВФР-005548
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов > 0
			|				ТОГДА ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|							ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаЧасов
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
			|					КОНЕЦ
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			|				ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)//О.Т. Аверсон 25.01.2017 № 214
			|				ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Праздники)//О.Т. Аверсон 25.05.2017 № 675
			|				ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыРасчетОтСреднегодовой)
			//|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Замена
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Замена) //Аверсон 03.12.2022 КВВ СВФР-009934
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Сверхустановленные
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Сверхурочные) //О.Т. Аверсон 22.08.2017 № 951
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&ВРПростои)//Аверсон 30.04.2020 КВВ СВФР-005931
			|					
			|				ТОГДА выбор когда ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу) или ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ) тогда 0 иначе ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов конец //О.Т. Аверсон 07.05.2018 № 1845 условие
			|			Когда ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам) //О.Т. Аверсон 16.03.2018 № 1726
			|				ТОГДА 0
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизации.Показатель1
			|					КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаВредность) ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ВидРасчетаВредность //Аверсон ЕАЕ 16.09.2024 СВФР-013702 
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула) //О.Т. Аверсон 28.03.2018 № 1759
			|					ИЛИ ТИПЗНАЧЕНИЯ(ОсновныеНачисленияРаботниковОрганизации.Регистратор.Ссылка) = ТИП(Документ.ОплатаПоСреднемуЗаработку) //Аверсон 18.05.2022 КВВ СВФР-009082
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|					ИНАЧЕ ";
			
			//Аверсон 16.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ВЫБОР КОГДА 
				|           ОсновныеНачисленияРаботниковОрганизации.Результат = 0
				|			И
				|			(ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке)
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
				|ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
				|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.НормаЧасов
				|КОНЕЦ";
			Иначе
				ТекстПостроителя = ТекстПостроителя + "
				|          ОсновныеНачисленияРаботниковОрганизации.НормаЧасов";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 16.11.2022 КВВ СВФР-009838 )
			
			|				КОНЕЦ
			|		КОНЕЦ КАК ОплаченоЧасов,
			|		ОсновныеНачисленияРаботниковОрганизации.Результат КАК Результат,
			|		NULL КАК СальдоНачальное,
			|		NULL КАК СальдоКонечное,
			|		ОсновныеНачисленияРаботниковОрганизации.ПериодДействия КАК ПериодДействия,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746
			|       ВЫБОР
			|       КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения)
			|       ТОГДА ОсновныеНачисленияРаботниковОрганизации.ПериодДействия 
			|       ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ПериодДействияНачало
			|       КОНЕЦ КАК ПериодДействияНачало,
			//Аверсон СВФР-007746
			
			|		NULL КАК Оборот,
			|		ВЫБОР
			|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|				ТОГДА """"
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|						ТОГДА ""%""
			|					ИНАЧЕ """"
			|				КОНЕЦ
			|		КОНЕЦ КАК СтрокаПроцент,
			|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.НеВыводитьПоказательРасчета КАК НеВыводитьПоказательРасчета
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизации
			|	ГДЕ
			|		ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И НЕ(ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней = 0
			|					И ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов = 0
			|					И ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|							ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						ИНАЧЕ 0
			|					КОНЕЦ = 0
			|					И ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|							ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						ИНАЧЕ 0
			|					КОНЕЦ = 0
			|					И ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155		
			
			//Аверсон 16.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке)
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам)";
			КонецЕсли;
			//Аверсон 16.11.2022 КВВ СВФР-009838 )
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|							ТОГДА 1
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.Результат
			|					КОНЕЦ = 0)
			|	{ГДЕ
			|		ОсновныеНачисленияРаботниковОрганизации.Сотрудник,
			|		ОсновныеНачисленияРаботниковОрганизации.ФизЛицо,
			|		ОсновныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация}
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
			|				ТОГДА ""ДоходыВНатуральнойФорме""
			|			ИНАЧЕ ""Начислено""
			|		КОНЕЦ,
			|		ДополнительныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение,
			|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.ПериодРегистрации, МЕСЯЦ),
			|		ДополнительныеНачисленияРаботниковОрганизации.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	ДополнительныеНачисленияРаботниковОрганизации.Показатель1,// КАК Показатель1
				|	ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета,";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.Наименование + ВЫБОР
			|			КОГДА ЕСТЬNULL(ДополнительныеНачисленияРаботниковОрганизации.Сотрудник.ВидЗанятости, &ЗанятостьНеУказана) <> &ВнутреннееСовместительство
			|				ТОГДА """"
			|			ИНАЧЕ "" (по внутр. совмест-ву)""
			|		КОНЕЦ,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1 ИНАЧЕ 0
			|КОНЕЦ,// КАК ОбъединятьВР, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|		ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""БААА"" + ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.Код,
			|		0,
			|		0,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|				  ИЛИ ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)  //Аверсон 23.08.2021 КВВ СВФР-008025
			|				ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|			ИНАЧЕ 0
			|		КОНЕЦ,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|				  И НЕ ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)  //Аверсон 23.08.2021 КВВ СВФР-008025
			|				ТОГДА ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|							ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|									ТОГДА ДополнительныеНачисленияРаботниковОрганизации.Показатель1
			|								ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|							КОНЕЦ
			|					КОНЕЦ
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|						ТОГДА 0
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|								ТОГДА ДополнительныеНачисленияРаботниковОрганизации.Показатель1
			|							ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						КОНЕЦ
			|				КОНЕЦ
			|		КОНЕЦ,
			|		ДополнительныеНачисленияРаботниковОрганизации.Результат,
			|		NULL,
			|		NULL,
			|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодНачало, МЕСЯЦ),
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|       НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодНачало, МЕСЯЦ),
			//Аверсон СВФР-007746
			
			|		NULL,
			|		ВЫБОР
			|			КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|				ТОГДА ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|							ТОГДА """"
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|									ТОГДА ""%""
			|								ИНАЧЕ """"
			|							КОНЕЦ
			|					КОНЕЦ
			|			ИНАЧЕ ВЫБОР
			|					КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|						ТОГДА """"
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|								ТОГДА ""%""
			|							ИНАЧЕ """"
			|						КОНЕЦ
			|				КОНЕЦ
			|		КОНЕЦ,
			|		ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.НеВыводитьПоказательРасчета
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизации
			|	ГДЕ
			|		ДополнительныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И НЕ(ДополнительныеНачисленияРаботниковОрганизации.Результат = 0
			|					И ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|							ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						ИНАЧЕ 0
			|					КОНЕЦ = 0
			|					И ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|							ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|						ИНАЧЕ 0
			|					КОНЕЦ = 0)
			|	{ГДЕ
			|		ДополнительныеНачисленияРаботниковОрганизации.Сотрудник,
			|		ДополнительныеНачисленияРаботниковОрганизации.ФизЛицо,
			|		ДополнительныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация}
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""ДоходыВНатуральнойФорме"",
			|		НДФЛСведенияОДоходах.ОбособленноеПодразделение,
			|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|		НДФЛСведенияОДоходах.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		""Мат. выгода по займам (кредитам)"",
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""БААА9"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(НДФЛСведенияОДоходах.СуммаДохода),
			|		NULL,
			|		NULL,
			|		НДФЛСведенияОДоходах.ПериодРегистрации,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|       НДФЛСведенияОДоходах.ПериодРегистрации,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
			|	ГДЕ
			|		НДФЛСведенияОДоходах.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И НДФЛСведенияОДоходах.КодДохода В(&КодыМатвыгоды)
			|		И НДФЛСведенияОДоходах.ИсчисленоИзЗарплаты
			|		И НДФЛСведенияОДоходах.СуммаДохода <> 0
			|	{ГДЕ
			|		НДФЛСведенияОДоходах.ФизЛицо,
			|		НДФЛСведенияОДоходах.ОбособленноеПодразделение КАК Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|		НДФЛСведенияОДоходах.ФизЛицо,
			|		НДФЛСведенияОДоходах.ОбособленноеПодразделение,
			|		НДФЛСведенияОДоходах.ПериодРегистрации
			|	
			
			//Аверсон 12.11.2022 КВВ СВФР-009808 (
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""ДоходыВНатуральнойФорме"",
			|		ДополнительнаяПенсия.Организация,
			|		НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.Период, МЕСЯЦ),
			|		ДополнительнаяПенсия.Сотрудник.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		""Дополнительная пенсия"",
			| 		0, //КАК ОбъединятьВР, 
			|		&ПустойСпособ,
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			|		""БААА9"",
			|		0,
			|		0,
			|		0,
			|		0,
			|		(ДополнительнаяПенсия.СуммаРаботодателя), //СУММА - нет, разными строками
			|		NULL,
			|		NULL,
			|		ДополнительнаяПенсия.ПериодНачисления,
			|       ДополнительнаяПенсия.Период,
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ДополнительнаяПенсия КАК ДополнительнаяПенсия
			|	ГДЕ
			|		ДополнительнаяПенсия.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И ДополнительнаяПенсия.СуммаРаботодателя <> 0
			|	{ГДЕ
			|		ДополнительнаяПенсия.Сотрудник.ФизЛицо,
			|		ДополнительнаяПенсия.Организация КАК Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДополнительнаяПенсия.СуммаРаботодателя,
			|		ДополнительнаяПенсия.ПериодНачисления,
			|		НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.Период, МЕСЯЦ),
			|		ДополнительнаяПенсия.Сотрудник.ФизЛицо,
			|		ДополнительнаяПенсия.Организация,
			|		ДополнительнаяПенсия.Период		
			//Аверсон 12.11.2022 КВВ СВФР-009808 )
			
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Удержано"",
			|		УдержанияРаботниковОрганизации.ОбособленноеПодразделение,
			|		УдержанияРаботниковОрганизации.ПериодРегистрации,
			|		УдержанияРаботниковОрганизации.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		УдержанияРаботниковОрганизации.ВидРасчета.Наименование,
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""АААА"" + УдержанияРаботниковОрганизации.ВидРасчета.Код,
			|		NULL,
			|		NULL,
			|		NULL,
			|		ВЫБОР
			|			КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|				ТОГДА УдержанияРаботниковОрганизации.Показатель1
			|		КОНЕЦ,
			|		УдержанияРаботниковОрганизации.Результат,
			|		NULL,
			|		NULL,                           
			|		УдержанияРаботниковОрганизации.БазовыйПериодНачало, //Аверсон 02.07.2019 КВВ СВФР-004486 (было ПериодРегистрации)
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|       УдержанияРаботниковОрганизации.БазовыйПериодНачало,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		ВЫБОР
			|			КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|				ТОГДА ""%""
			|			ИНАЧЕ """"
			|		КОНЕЦ,
			|		Ложь
			|	ИЗ
			|		РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
			|	ГДЕ
			|		УдержанияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И УдержанияРаботниковОрганизации.Результат <> 0
			|		И УдержанияРаботниковОрганизации.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд)
			|	{ГДЕ
			|		УдержанияРаботниковОрганизации.ФизЛицо,
			|		УдержанияРаботниковОрганизации.ОбособленноеПодразделение}
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Удержано"",
			|		ЕСНИсчисленный.ОбособленноеПодразделение,
			|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ),
			|		ЕСНИсчисленный.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		""Пенсионный фонд"",
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""БААА"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(ЕСНИсчисленный.ПенсионныйФонд),
			|		NULL,
			|		NULL,
			|		ЕСНИсчисленный.ПериодВзаиморасчетов,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|		ЕСНИсчисленный.ПериодВзаиморасчетов,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			|	ГДЕ
			|		ЕСНИсчисленный.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И ЕСНИсчисленный.ПенсионныйФонд <> 0
			|	{ГДЕ
			|		ЕСНИсчисленный.ФизЛицо,
			|		ЕСНИсчисленный.ОбособленноеПодразделение КАК Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ),
			|		ЕСНИсчисленный.ФизЛицо,
			|		ЕСНИсчисленный.ОбособленноеПодразделение,
			|		ЕСНИсчисленный.ПериодВзаиморасчетов
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Удержано"",
			|		НДФЛРасчетыСБюджетом.ОбособленноеПодразделение,
			|		НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ),
			|		НДФЛРасчетыСБюджетом.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		ВЫБОР
			|			КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = &ВозвратНалога
			|				ТОГДА ""Подоходный налог возврат налога""
			|			ИНАЧЕ ""Подоходный налог исчисленный ""
			|		КОНЕЦ,
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""БААА"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(НДФЛРасчетыСБюджетом.Налог),
			|		NULL,
			|		NULL,
			|		НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|       НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
			|	ГДЕ
			|		НДФЛРасчетыСБюджетом.ИсчисленоИзЗарплаты
			|		И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И НДФЛРасчетыСБюджетом.ВидСтроки В(&ВидСтроки)
			|		И НДФЛРасчетыСБюджетом.Налог <> 0
			|	{ГДЕ
			|		НДФЛРасчетыСБюджетом.ФизЛицо,
			|		НДФЛРасчетыСБюджетом.ОбособленноеПодразделение КАК Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ),
			|		НДФЛРасчетыСБюджетом.ФизЛицо,
			|		НДФЛРасчетыСБюджетом.ОбособленноеПодразделение,
			|		ВЫБОР
			|			КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = &ВозвратНалога
			|				ТОГДА ""Подоходный налог возврат налога""
			|			ИНАЧЕ ""Подоходный налог исчисленный ""
			|		КОНЕЦ,
			|		НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Удержано"",
			|		ПогашениеЗаймовРаботникамиОрганизаций.Организация,
			|		НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|		ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		""Погашение займа"",
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""ВААА"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(ПогашениеЗаймовРаботникамиОрганизаций.ОсновнойДолг + ПогашениеЗаймовРаботникамиОрганизаций.Проценты),
			|		NULL,
			|		NULL,
			|		ПогашениеЗаймовРаботникамиОрганизаций.Период,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|       ПогашениеЗаймовРаботникамиОрганизаций.Период,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ПогашениеЗаймовРаботникамиОрганизаций КАК ПогашениеЗаймовРаботникамиОрганизаций
			|	ГДЕ
			|		ПогашениеЗаймовРаботникамиОрганизаций.ВидДвижения = &Расход
			|		И ПогашениеЗаймовРаботникамиОрганизаций.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И ПогашениеЗаймовРаботникамиОрганизаций.УдержаноИзЗарплаты
			|		И ПогашениеЗаймовРаботникамиОрганизаций.ОсновнойДолг + ПогашениеЗаймовРаботникамиОрганизаций.Проценты <> 0
			|	{ГДЕ
			|		ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ПогашениеЗаймовРаботникамиОрганизаций.ДоговорЗайма,
			|		НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|		ПогашениеЗаймовРаботникамиОрганизаций.Организация,
			|		ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо,
			|		ПогашениеЗаймовРаботникамиОрганизаций.Период
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Выплата"",
			|		Взаиморасчеты.Организация,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		Взаиморасчеты.Физлицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		ВЫБОР
			|			КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|				ТОГДА ВЫБОР
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|							ТОГДА ""Через кассу ""
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|							ТОГДА ""Перечислено в банк ""
			|						ИНАЧЕ ""Способ выплаты не указан ""
			|					КОНЕЦ + ВЫБОР
			|						КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|							ТОГДА ""(аванс)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|							ТОГДА ""(под расчет)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|							ТОГДА ""(не указано)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|							ТОГДА ""(погашено задолженности)""
			|						ИНАЧЕ ""(межрасчет)""
			|					КОНЕЦ
			//Аверсон ЕАЕ 21.06.2021 СВФР-007740
			|               + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						    КОНЕЦ
			//Аверсон СВФР-007740
			|			ИНАЧЕ ""Задепонировано""
			|		КОНЕЦ,
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""ГААА1"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(Взаиморасчеты.СуммаВзаиморасчетов),
			|		NULL,
			|		NULL,
			|		Взаиморасчеты.Период,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|		Взаиморасчеты.Период,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|	ГДЕ
			|		Взаиморасчеты.ВидДвижения = &Расход
			|		И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|		И Взаиморасчеты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И НЕ(Взаиморасчеты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|					И Взаиморасчеты.СпособВыплаты = &ЧерезБанк)
			|	{ГДЕ
			|		Взаиморасчеты.Физлицо,
			|		Взаиморасчеты.Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Взаиморасчеты.Организация,
			|		Взаиморасчеты.Физлицо,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		ВЫБОР
			|			КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|				ТОГДА ВЫБОР
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|							ТОГДА ""Через кассу ""
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|							ТОГДА ""Перечислено в банк ""
			|						ИНАЧЕ ""Способ выплаты не указан ""
			|					КОНЕЦ + ВЫБОР
			|						КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|							ТОГДА ""(аванс)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|							ТОГДА ""(под расчет)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|							ТОГДА ""(не указано)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|							ТОГДА ""(погашено задолженности)""
			|						ИНАЧЕ ""(межрасчет)""
			|					КОНЕЦ
			//Аверсон ЕАЕ 21.06.2021 СВФР-007740
			|               + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						    КОНЕЦ
			//Аверсон СВФР-007740
			|			ИНАЧЕ ""Задепонировано""
			|		КОНЕЦ,
			|		&ПустойСпособ,
			|		Взаиморасчеты.Период
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ВидыДвижения.ВидДвижения,
			|		Взаиморасчеты.Организация,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		Взаиморасчеты.Физлицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		""Компенсация за задержку выплаты заработной платы"",
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""ГААА2"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты),
			|		NULL,
			|		NULL,
			|		Взаиморасчеты.Период,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|		Взаиморасчеты.Период,
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|			ПО Взаиморасчеты.Физлицо = ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
			|				И Взаиморасчеты.Ведомость = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка,
			|		(ВЫБРАТЬ
			|			""Начислено"" КАК ВидДвижения
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Выплата"") КАК ВидыДвижения
			|	ГДЕ
			|		Взаиморасчеты.ВидДвижения = &Расход
			|		И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|		И Взаиморасчеты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты <> 0
			|	{ГДЕ
			|		Взаиморасчеты.Физлицо,
			|		Взаиморасчеты.Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Взаиморасчеты.Организация,
			|		Взаиморасчеты.Физлицо,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		ВидыДвижения.ВидДвижения,
			|		Взаиморасчеты.Период
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Сальдо"",
			|		Сальдо.Организация,
			|		Периоды.ПериодРегистрации,
			|		Сальдо.Физлицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		"""",
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""ЯЯЯЯ"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(ВЫБОР
			|				КОГДА Сальдо.Период < Периоды.ПериодРегистрации
			|					ТОГДА Сальдо.СуммаВзаиморасчетовОстаток
			|				ИНАЧЕ 0
			|			КОНЕЦ),
			|		СУММА(ВЫБОР
			|				КОГДА Сальдо.Период <= Периоды.ПериодРегистрации
			|					ТОГДА Сальдо.СуммаВзаиморасчетовОстаток
			|				ИНАЧЕ 0
			|			КОНЕЦ),
			|		NULL,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|		NULL,
			//Аверсон СВФР-007746
			
			|		СУММА(Сальдо.СуммаВзаиморасчетовОборот),
			|		"""",
			|		Ложь
			|	ИЗ
			|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|			НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК ПериодРегистрации
			|		ИЗ
			|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|		ГДЕ
			|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации) КАК Периоды
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ВзаиморасчетыСРаботникамиОрганизацийОстатки.Организация КАК Организация,
			|				ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -1) КАК Период,
			|				ВзаиморасчетыСРаботникамиОрганизацийОстатки.Физлицо КАК Физлицо,
			|				ВзаиморасчетыСРаботникамиОрганизацийОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
			|				NULL КАК СуммаВзаиморасчетовОборот
			|			ИЗ
			|				РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&ПериодРегистрации, {(Физлицо), (Организация)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОстатки
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Организация,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Период,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Физлицо,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.СуммаВзаиморасчетовОборот,
			|				NULL
			|			ИЗ
			|				РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (Физлицо)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОбороты
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				НДФЛКЗачету.Организация,
			|				ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -1),
			|				НДФЛКЗачету.ФизЛицо,
			|				НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток,
			|				NULL
			|			ИЗ
			|				РегистрНакопления.НДФЛКЗачету.Остатки(&ПериодРегистрации, {(ФизЛицо), (Организация)}) КАК НДФЛКЗачету
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				НДФЛКЗачету.Организация,
			|				НДФЛКЗачету.Период,
			|				НДФЛКЗачету.ФизЛицо,
			|				НДФЛКЗачету.СуммаНДФЛКЗачетуОборот,
			|				NULL
			|			ИЗ
			|				РегистрНакопления.НДФЛКЗачету.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (ФизЛицо)}) КАК НДФЛКЗачету
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Организация,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Период,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.Физлицо,
			|				NULL,
			|				ВзаиморасчетыСРаботникамиОрганизацийОбороты.СуммаВзаиморасчетовОборот
			|			ИЗ
			|				РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (Физлицо)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОбороты) КАК Сальдо
			|			ПО (Сальдо.Период <= Периоды.ПериодРегистрации)
			|	{ГДЕ
			|		Сальдо.Организация,
			|		Сальдо.Физлицо}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Сальдо.Организация,
			|		Сальдо.Физлицо,
			|		Периоды.ПериодРегистрации
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		""Выплата"",
			|		Взаиморасчеты.Организация,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		Взаиморасчеты.Физлицо,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	0,// КАК Показатель1
				|	"""",";  //КАК ВР
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|		ВЫБОР
			|			КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|				ТОГДА ВЫБОР
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|							ТОГДА ""Через кассу ""
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|							ТОГДА ""Перечислено в банк ""
			|						ИНАЧЕ ""Способ выплаты не указан ""
			|					КОНЕЦ + ВЫБОР
			|						КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|							ТОГДА ""(аванс)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|							ТОГДА ""(под расчет)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|							ТОГДА ""(не указано)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|							ТОГДА ""(погашено задолженности)""
			|						ИНАЧЕ ""(межрасчет)""
			|					КОНЕЦ
			//Аверсон ЕАЕ 21.06.2021 СВФР-007740
			|               + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						    КОНЕЦ
			//Аверсон СВФР-007740
			|			ИНАЧЕ ""Задепонировано""
			|		КОНЕЦ,
			| 		0, //КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			
			|		&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   	Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		""ГААА1"",
			|		NULL,
			|		NULL,
			|		NULL,
			|		NULL,
			|		СУММА(Взаиморасчеты.СуммаВзаиморасчетов),
			|		NULL,
			|		NULL,
			|		НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ),
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746 ПериодДействияНачало
			|		НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ),
			//Аверсон СВФР-007746
			
			|		NULL,
			|		"""",
			|		Ложь
			|	ИЗ
			|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.ПеречислениеЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты
			|			ПО Взаиморасчеты.Регистратор = ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка
			|		И Взаиморасчеты.Ведомость = ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость //О.Т. Аверсон 04.12.2017 № 1318
			|	ГДЕ
			|		Взаиморасчеты.ВидДвижения = &Расход
			|		И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|		И ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.Дата МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		И Взаиморасчеты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|		И Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|	{ГДЕ
			|		Взаиморасчеты.Физлицо,
			|		Взаиморасчеты.Организация}
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Взаиморасчеты.Организация,
			|		Взаиморасчеты.Физлицо,
			|		ВЫБОР
			|			КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|				ТОГДА ВЫБОР
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|							ТОГДА ""Через кассу ""
			|						КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|							ТОГДА ""Перечислено в банк ""
			|						ИНАЧЕ ""Способ выплаты не указан ""
			|					КОНЕЦ + ВЫБОР
			|						КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|							ТОГДА ""(аванс)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|							ТОГДА ""(под расчет)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|							ТОГДА ""(не указано)""
			|						КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|								И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|							ТОГДА ""(погашено задолженности)""
			|						ИНАЧЕ ""(межрасчет)""
			|					КОНЕЦ
			//Аверсон ЕАЕ 21.06.2021 СВФР-007740
			|               + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						    КОНЕЦ
			//Аверсон СВФР-007740
			|			ИНАЧЕ ""Задепонировано""
			|		КОНЕЦ,
			|		&ПустойСпособ,
			|		НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|		НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ)) КАК НачисленияУдержания
			|{ГДЕ
			|	НачисленияУдержания.ФизЛицо.*,
			|	НачисленияУдержания.Организация.*}
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|; 
			|ВЫБРАТЬ *
			|ПОМЕСТИТЬ ВТ3
			|ИЗ ВТ1 КАК ВТ1
			|ГДЕ ОбъединятьВР = 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|ВТ2.ВидДвижения КАК ВидДвижения,
			|ВТ2.ФизЛицо КАК ФизЛицо,
			|ВТ2.Организация КАК Организация,
			|ВТ2.ПериодРегистрации КАК ПериодРегистрации,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	ВТ2.Показатель1 КАК Показатель1,
				|	ВТ2.ВР КАК ВР,";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|ВТ2.ВидРасчета КАК ВидРасчета,
			|ВТ2.ОбъединятьВР КАК ОбъединятьВР, 
			|ВТ2.СпособРасчета,
			|	ВТ2.ЭтоПроцентныйПоказатель, 
			|ВТ2.ПорядокВидаРасчета КАК ПорядокВидаРасчета,
			|СУММА(ВТ2.ОтработаноДней) КАК ОтработаноДней,
			|СУММА(ВТ2.ОтработаноЧасов) КАК ОтработаноЧасов,
			|СУММА(ВТ2.ОплаченоДней) КАК ОплаченоДней,
			|СУММА(ВТ2.ОплаченоЧасов) КАК ОплаченоЧасов,
			|СУММА(ВТ2.Результат) КАК Результат,
			|СУММА(ВТ2.СальдоНачальное) КАК СальдоНачальное,
			|СУММА(ВТ2.СальдоКонечное) КАК СальдоКонечное,
			|ВТ2.ПериодДействия,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746
			|ВТ2.ПериодДействияНачало,
			//Аверсон СВФР-007746
			
			|СУММА(ВТ2.Оборот) КАК Оборот,
			|ВТ2.СтрокаПроцент,
			|ВТ2.НеВыводитьПоказательРасчета
			|ИЗ ВТ1 КАК ВТ2
			|ГДЕ ОбъединятьВР = 1
			|СГРУППИРОВАТЬ ПО
			|ВТ2.ВидДвижения,
			|ВТ2.ФизЛицо,
			|ВТ2.Организация,
			|ВТ2.ПериодРегистрации,";
			
			//Аверсон 15.11.2022 КВВ СВФР-009838 (
			Если ФлагТС Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|	ВТ2.Показатель1,
				|	ВТ2.ВР,";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 15.11.2022 КВВ СВФР-009838 )
			
			|ВТ2.ВидРасчета,
			|ВТ2.ОбъединятьВР, 
			|ВТ2.СпособРасчета,
			|	ВТ2.ЭтоПроцентныйПоказатель, 
			|ВТ2.ПорядокВидаРасчета,
			|ВТ2.ПериодДействия,
			|ВТ2.СтрокаПроцент,
			|ВТ2.НеВыводитьПоказательРасчета,
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746
			|ВТ2.ПериодДействияНачало
			//Аверсон СВФР-007746
			
			|;
			|
			|ВЫБРАТЬ *
			|ИЗ ВТ3 КАК ВТ3
			|УПОРЯДОЧИТЬ ПО ";
			
			Если НЕ (Организация.ИНН = "100765738" ИЛИ Организация.ИНН = "190530779") Тогда //Аверсон 12.10.2021 КВВ СВФР-008203 //Госпиталь
				ТекстПостроителя = ТекстПостроителя + "
				//Аверсон ЕАЕ 01.07.2021 СВФР-007797
				|ПериодДействияНачало,";
				//Аверсон СВФР-007797
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			
			|ПериодРегистрации,
			|Организация,
			|ФизЛицо,
			|ПорядокВидаРасчета,
			|ВидРасчета
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007746
			//|ПериодДействияНачало
			//Аверсон СВФР-007746
			
			|ИТОГИ ПО
			|Организация,
			|ПериодРегистрации,
			|ФизЛицо,
			|ВидДвижения
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|";
			//|УПОРЯДОЧИТЬ ПО
			//|	ПериодРегистрации,
			//|	Организация,
			//|	ФизЛицо,
			//|	ПорядокВидаРасчета,
			//|	ВидРасчета
			//|ИТОГИ ПО
			//|	Организация,
			//|	ПериодРегистрации,
			//|	ФизЛицо,
			//|	ВидДвижения"; //О.Т. 17.09.2014 № 228 Для отпуска за свой счет
			
		Иначе
			
			ТекстПостроителя = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачисленияУдержания.ВидДвижения КАК ВидДвижения,
			|	НачисленияУдержания.ФизЛицо КАК ФизЛицо,
			|	НачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
			|	НачисленияУдержания.ВидРасчета КАК ВидРасчета,
			|	НачисленияУдержания.ОбъединятьВР КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|	НачисленияУдержания.СпособРасчета,
			|	НачисленияУдержания.ПорядокВидаРасчета КАК ПорядокВидаРасчета,
			|	НачисленияУдержания.ОтработаноДней,
			|	НачисленияУдержания.ОтработаноЧасов,
			|	НачисленияУдержания.ОплаченоДней,
			|	НачисленияУдержания.Результат,
			|	НачисленияУдержания.ОплаченоЧасов,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|	НачисленияУдержания.ЭтоПроцентныйПоказатель,
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|	НачисленияУдержания.ПериодДействияНачало КАК ПериодДействияНачало,
			|	НачисленияУдержания.ПериодДействияКонец,
			|	НачисленияУдержания.Регистратор,
			|	НачисленияУдержания.НомерСтроки,
			|	НачисленияУдержания.Организация КАК Организация,
			|	НачисленияУдержания.ДополнениеКВидуРасчета,
			|	НачисленияУдержания.Показатель1,
			|	НачисленияУдержания.Показатель2,
			|	НачисленияУдержания.Показатель3,
			|	НачисленияУдержания.Показатель4,
			|	НачисленияУдержания.Показатель5,
			|	НачисленияУдержания.Показатель6,
			|	НачисленияУдержания.СальдоНачальное,
			|	НачисленияУдержания.СальдоКонечное,
			|	НачисленияУдержания.Обороты КАК Оборот,
			|	НачисленияУдержания.СтрокаПроцент,
			|	НачисленияУдержания.НеВыводитьПоказательРасчета
			|ПОМЕСТИТЬ ВТ1 //Аверсон 13.05.2021 КВВ СВФР-007584
			|ИЗ
			|	(ВЫБРАТЬ
			|		НачисленияУдержания.ВидДвижения КАК ВидДвижения,
			|		НачисленияУдержания.ФизЛицо КАК ФизЛицо,
			|		НачисленияУдержания.Организация КАК Организация,
			|		НачисленияУдержания.ПериодРегистрации КАК ПериодРегистрации,
			|		НачисленияУдержания.ВидРасчета КАК ВидРасчета,
			|		НачисленияУдержания.ОбъединятьВР КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		НачисленияУдержания.ЭтоПроцентныйПоказатель,
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|		НачисленияУдержания.СпособРасчета,
			|		НачисленияУдержания.ПорядокВидаРасчета КАК ПорядокВидаРасчета,
			|		НачисленияУдержания.ОтработаноДней КАК ОтработаноДней,
			|		НачисленияУдержания.ОтработаноЧасов КАК ОтработаноЧасов,
			|		НачисленияУдержания.ОплаченоДней КАК ОплаченоДней,
			|		НачисленияУдержания.ОплаченоЧасов КАК ОплаченоЧасов,
			|		НачисленияУдержания.Результат КАК Результат,
			|		НачисленияУдержания.ПериодДействияНачало КАК ПериодДействияНачало,
			|		НачисленияУдержания.ПериодДействияКонец КАК ПериодДействияКонец,
			|		НачисленияУдержания.Регистратор КАК Регистратор,
			|		НачисленияУдержания.НомерСтроки КАК НомерСтроки,
			|		НачисленияУдержания.ДополнениеКВидуРасчета КАК ДополнениеКВидуРасчета,
			|		НачисленияУдержания.Показатель1 КАК Показатель1,
			|		НачисленияУдержания.Показатель2 КАК Показатель2,
			|		НачисленияУдержания.Показатель3 КАК Показатель3,
			|		НачисленияУдержания.Показатель4 КАК Показатель4,
			|		НачисленияУдержания.Показатель5 КАК Показатель5,
			|		НачисленияУдержания.Показатель6 КАК Показатель6,
			|		НачисленияУдержания.СальдоНачальное КАК СальдоНачальное,
			|		НачисленияУдержания.СальдоКонечное КАК СальдоКонечное,
			|		НачисленияУдержания.Обороты КАК Обороты,
			|		НачисленияУдержания.СтрокаПроцент КАК СтрокаПроцент,
			|		НачисленияУдержания.НеВыводитьПоказательРасчета как НеВыводитьПоказательРасчета
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
			|					ТОГДА ""ДоходыВНатуральнойФорме""
			|				ИНАЧЕ ""Начислено""
			|			КОНЕЦ КАК ВидДвижения,
			|			ОсновныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация,
			|			ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации КАК ПериодРегистрации,
			|			ОсновныеНачисленияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1 ИНАЧЕ 0
			|КОНЕЦ КАК ОбъединятьВР, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|	     	ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета как СпособРасчета,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		ВЫРАЗИТЬ( ОсновныеНачисленияРаботниковОрганизации.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций ).СпособРасчета 
			|				= ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ОтСтажаПоСумме) КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""А"" + ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетОтработанногоВремени
			|					ТОГДА ""А""
			|				ИНАЧЕ ""Б""
			|			КОНЕЦ + ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетНормыВремени
			|					ТОГДА ""А""
			|				ИНАЧЕ ""Б""
			|			КОНЕЦ + ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.Код КАК ПорядокВидаРасчета,
			|			ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаДней
			|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
			|			КОНЕЦ КАК ОтработаноДней,
			|			ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДеньДонора) //Аверсон 14.04.2021 КВВ СВФР-007450
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ)//О.Т. Аверсон 21.02.2018 № 1631
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка) //О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника)//О.Т. Аверсон 16.08.2018 № 2307
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый) //Кухарчук, Аверсон 19.07.2018 № СВФР-003738
			|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)";//О.Т. Аверсон 25.10.2017 № 1155
			
			//Аверсон 10.03.2022 КВВ СВФР-008831 (
			Если ВыводитьВРНулеваяСумма Тогда
				ТекстПостроителя = ТекстПостроителя + "
				|			ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.НулеваяСумма)";
			КонецЕсли;
			ТекстПостроителя = ТекстПостроителя + "
			//Аверсон 10.03.2022 КВВ СВФР-008831 )
			
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.НормаЧасов
			|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
			|			КОНЕЦ КАК ОтработаноЧасов,
			|			ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			//|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Замена
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Замена) //Аверсон 03.12.2022 КВВ СВФР-009934
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Сверхустановленные
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Сверхурочные) //О.Т. Аверсон 22.08.2017 № 951
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам) //О.Т. Аверсон 16.03.2018 № 1726
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&ВРПростои)//Аверсон 30.04.2020 КВВ СВФР-005931
			|                       ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням) //Аверсон 14.04.2021 КВВ СВФР-007450
			
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДней
			|				ИНАЧЕ ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней > 0
			|							ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.НормаДней
			|					КОНЕЦ
			|			КОНЕЦ КАК ОплаченоДней,
			|			ВЫБОР
			|               КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ОтСтажаПоСумме) ТОГДА ОсновныеНачисленияРаботниковОрганизации.Показатель1 //+ СВЭЙ КДЯ 27.02.20 СВФР-005548
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
			|				        ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)//О.Т. Аверсон 25.01.2017 № 214
			|						ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(справочник.КлассификаторИспользованияРабочегоВремени.Праздники)//О.Т. Аверсон 25.05.2017 № 675
			|				        ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасыРасчетОтСреднегодовой)
			//|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Замена
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Замена) //Аверсон 03.12.2022 КВВ СВФР-009934
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &Сверхустановленные
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&Сверхурочные) //О.Т. Аверсон 22.08.2017 № 951
			|							ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета в (&ВРПростои)//Аверсон 30.04.2020 КВВ СВФР-005931
			|					ТОГДА выбор когда ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу) или ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ) тогда 0 иначе ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов конец //О.Т. Аверсон 07.05.2018 № 1845 условие
			|				Когда ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам) //О.Т. Аверсон 16.03.2018 № 1726
			|					ТОГДА 0
			|				ИНАЧЕ ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов > 0
			|							ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|									ТОГДА ОсновныеНачисленияРаботниковОрганизации.Показатель1
			|					КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаВредность) ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ВидРасчетаВредность //Аверсон ЕАЕ 16.09.2024 СВФР-013702 
			|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)//О.Т. Аверсон 28.03.2018 № 1759
			|					ИЛИ ТИПЗНАЧЕНИЯ(ОсновныеНачисленияРаботниковОрганизации.Регистратор.Ссылка) = ТИП(Документ.ОплатаПоСреднемуЗаработку) //Аверсон 18.05.2022 КВВ СВФР-009082
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|								ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.НормаЧасов
			|							КОНЕЦ
			|					КОНЕЦ
			|			КОНЕЦ КАК ОплаченоЧасов,
			|			ОсновныеНачисленияРаботниковОрганизации.Результат КАК Результат,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			//|			ОсновныеНачисленияРаботниковОрганизации.ПериодДействияНачало КАК ПериодДействияНачало,
			//|			ОсновныеНачисленияРаботниковОрганизации.ПериодДействияКонец КАК ПериодДействияКонец,
			|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизации.ПериодДействияКонец,МЕСЯЦ)
			| ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ПериодДействияНачало
			|КОНЕЦ КАК ПериодДействияНачало,
			
			|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизации.ПериодДействияКонец,МЕСЯЦ)
			| ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ПериодДействияКонец
			|КОНЕЦ КАК ПериодДействияКонец, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|			ОсновныеНачисленияРаботниковОрганизации.Регистратор КАК Регистратор,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			//|			ОсновныеНачисленияРаботниковОрганизации.НомерСтроки КАК НомерСтроки,
			|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1
			| ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.НомерСтроки
			|КОНЕЦ КАК НомерСтроки, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ОсновныеНачисленияРаботниковОрганизации.Сотрудник.ВидЗанятости, &ЗанятостьНеУказана) <> &ВнутреннееСовместительство
			|					ТОГДА """"
			|				ИНАЧЕ "" (по внутр. совмест-ву)""
			|			КОНЕЦ КАК ДополнениеКВидуРасчета,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель1 КАК Показатель1,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель2 КАК Показатель2,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель3 КАК Показатель3,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель4 КАК Показатель4,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель5 КАК Показатель5,
			|			ОсновныеНачисленияРаботниковОрганизации.Показатель6 КАК Показатель6,
			|			NULL КАК СальдоНачальное,
			|			NULL КАК СальдоКонечное,
			|			NULL КАК Обороты,
			|			ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|					ТОГДА """"
			|				ИНАЧЕ ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|							ТОГДА ""%""
			|						ИНАЧЕ """"
			|					КОНЕЦ
			|			КОНЕЦ КАК СтрокаПроцент,
			|			ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.НеВыводитьПоказательРасчета как НеВыводитьПоказательРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизации
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		{ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизации.Сотрудник,
			|			ОсновныеНачисленияРаботниковОрганизации.ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация}
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ВЫБОР
			|				КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
			|					ТОГДА ""ДоходыВНатуральнойФорме""
			|				ИНАЧЕ ""Начислено""
			|			КОНЕЦ,
			|			ДополнительныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.ПериодРегистрации, МЕСЯЦ),
			|			ДополнительныеНачисленияРаботниковОрганизации.ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1 ИНАЧЕ 0
			|КОНЕЦ, // КАК ОбъединятьВР, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|	     	ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета как СпособРасчета,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""БААА"" + ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.Код,
			|			0,
			|			0,
			|			ВЫБОР
			|				КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|					ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|				ИНАЧЕ 0
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|					ТОГДА ВЫБОР
			|							КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|								ТОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|							ИНАЧЕ ВЫБОР
			|									КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|										ТОГДА ДополнительныеНачисленияРаботниковОрганизации.Показатель1
			|									ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|							ТОГДА 0
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|									ТОГДА ДополнительныеНачисленияРаботниковОрганизации.Показатель1
			|								ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов
			|							КОНЕЦ
			|					КОНЕЦ
			|			КОНЕЦ,
			|			ДополнительныеНачисленияРаботниковОрганизации.Результат,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			//|			ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодНачало,
			//|			ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодКонец,
			|ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			//|ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодНачало,МЕСЯЦ)
			|ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодКонец,МЕСЯЦ)
			| ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодНачало
			|КОНЕЦ,// КАК ПериодДействияНачало, 
			
			|ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодКонец,МЕСЯЦ)
			| ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.БазовыйПериодКонец
			|КОНЕЦ,// КАК ПериодДействияКонец, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|			ДополнительныеНачисленияРаботниковОрганизации.Регистратор,
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			//	|			ДополнительныеНачисленияРаботниковОрганизации.НомерСтроки,
			|ВЫБОР КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета В (&СписокДляОбъединения) 
			|ТОГДА 1
			| ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизации.НомерСтроки
			|КОНЕЦ,// КАК НомерСтроки, 
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ДополнительныеНачисленияРаботниковОрганизации.Сотрудник.ВидЗанятости, &ЗанятостьНеУказана) <> &ВнутреннееСовместительство
			|					ТОГДА """"
			|				ИНАЧЕ "" (по внутр. совмест-ву)""
			|			КОНЕЦ,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			ВЫБОР
			|				КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
			|					ТОГДА ВЫБОР
			|							КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|								ТОГДА """"
			|							ИНАЧЕ ВЫБОР
			|									КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|										ТОГДА ""%""
			|									ИНАЧЕ """"
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизации.ОплаченоДнейЧасов > 0
			|							ТОГДА """"
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|									ТОГДА ""%""
			|								ИНАЧЕ """"
			|							КОНЕЦ
			|					КОНЕЦ
			|			КОНЕЦ,
			|			ДополнительныеНачисленияРаботниковОрганизации.ВидРасчета.НеВыводитьПоказательРасчета
			|		ИЗ
			|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизации
			|		ГДЕ
			|			ДополнительныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		{ГДЕ
			|			ДополнительныеНачисленияРаботниковОрганизации.Сотрудник,
			|			ДополнительныеНачисленияРаботниковОрганизации.ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация}
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""ДоходыВНатуральнойФорме"",
			|			НДФЛСведенияОДоходах.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|			НДФЛСведенияОДоходах.ФизЛицо,
			|			""Мат. выгода по займам (кредитам)"",
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""БААА9"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(НДФЛСведенияОДоходах.СуммаДохода),
			|			НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
			|		ГДЕ
			|			НДФЛСведенияОДоходах.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И НДФЛСведенияОДоходах.КодДохода В(&КодыМатвыгоды)
			|			И НДФЛСведенияОДоходах.ИсчисленоИзЗарплаты
			|		{ГДЕ
			|			НДФЛСведенияОДоходах.ФизЛицо,
			|			НДФЛСведенияОДоходах.ОбособленноеПодразделение КАК Организация}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			КОНЕЦПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|			НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
			|			НДФЛСведенияОДоходах.ФизЛицо,
			|			НДФЛСведенияОДоходах.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)
			|		
			
			//Аверсон 12.11.2022 КВВ СВФР-009808 (
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""ДоходыВНатуральнойФорме"",
			|			ДополнительнаяПенсия.Организация,
			|			НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.Период, МЕСЯЦ),
			|			ДополнительнаяПенсия.Сотрудник.ФизЛицо,
			|			""Дополнительная пенсия"",
			|			0, // КАК ОбъединятьВР, 
			|			&ПустойСпособ,
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			|			""БААА9"",
			|			0,
			|			0,
			|			0,
			|			0,
			|			(ДополнительнаяПенсия.СуммаРаботодателя),  //СУММА - нет, разными строками
			|			НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.ПериодНачисления, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(ДополнительнаяПенсия.ПериодНачисления, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ДополнительнаяПенсия КАК ДополнительнаяПенсия
			|		ГДЕ
			|			ДополнительнаяПенсия.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И ДополнительнаяПенсия.СуммаРаботодателя <> 0
			|		{ГДЕ
			|			ДополнительнаяПенсия.Сотрудник.ФизЛицо,
			|			ДополнительнаяПенсия.Организация КАК Организация}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ДополнительнаяПенсия.СуммаРаботодателя,
			|			КОНЕЦПЕРИОДА(ДополнительнаяПенсия.ПериодНачисления, МЕСЯЦ),
			|			НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.ПериодНачисления, МЕСЯЦ),
			|			ДополнительнаяПенсия.Сотрудник.ФизЛицо,
			|			ДополнительнаяПенсия.Организация,
			|			НАЧАЛОПЕРИОДА(ДополнительнаяПенсия.Период, МЕСЯЦ)
			|		
			//Аверсон 12.11.2022 КВВ СВФР-009808 )
			
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Удержано"",
			|			УдержанияРаботниковОрганизации.ОбособленноеПодразделение,
			|			УдержанияРаботниковОрганизации.ПериодРегистрации,
			|			УдержанияРаботниковОрганизации.ФизЛицо,
			|			УдержанияРаботниковОрганизации.ВидРасчета.Наименование,
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""АААА"" + УдержанияРаботниковОрганизации.ВидРасчета.Код,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			УдержанияРаботниковОрганизации.Результат,
			|			УдержанияРаботниковОрганизации.БазовыйПериодНачало,
			|			УдержанияРаботниковОрганизации.БазовыйПериодКонец,
			|			NULL,
			|			NULL,
			|			NULL,
			|			ВЫБОР
			|				КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|					ТОГДА УдержанияРаботниковОрганизации.Показатель1
			|			КОНЕЦ,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			ВЫБОР
			|				КОГДА УдержанияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&СпособыРасчетаПроцентом)
			|					ТОГДА ""%""
			|				ИНАЧЕ """"
			|			КОНЕЦ,
			|			Ложь
			|		ИЗ
			|			РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
			|		ГДЕ
			|			УдержанияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		{ГДЕ
			|			УдержанияРаботниковОрганизации.ФизЛицо,
			|			УдержанияРаботниковОрганизации.ОбособленноеПодразделение КАК Организация}
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Удержано"",
			|			ЕСНИсчисленный.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ),
			|			ЕСНИсчисленный.ФизЛицо,
			|			""Пенсионный фонд исчисленный"",
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""БААА"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(ЕСНИсчисленный.ПенсионныйФонд),
			|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			|		ГДЕ
			|			ЕСНИсчисленный.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И ЕСНИсчисленный.ПенсионныйФонд <> 0
			|		{ГДЕ
			|			ЕСНИсчисленный.ФизЛицо,
			|			ЕСНИсчисленный.ОбособленноеПодразделение КАК Организация}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ),
			|			ЕСНИсчисленный.ФизЛицо,
			|			ЕСНИсчисленный.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Удержано"",
			|			НДФЛРасчетыСБюджетом.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ),
			|			НДФЛРасчетыСБюджетом.ФизЛицо,
			|			ВЫБОР
			|				КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = &ВозвратНалога
			|					ТОГДА ""Подоходный налог возврат налога ""
			|				ИНАЧЕ ""Подоходный налог исчисленный ""
			|			КОНЕЦ + ВЫБОР
			|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Общая
			|					ТОГДА ""по ставке 12%""
			|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Дивиденды
			|					ТОГДА ""по дивидендам""
			|				ИНАЧЕ ""по ставке 15%""
			|			КОНЕЦ,
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""БААА"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(НДФЛРасчетыСБюджетом.Налог),
			|			НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
			|		ГДЕ
			|			НДФЛРасчетыСБюджетом.ВидСтроки В(&ВидСтроки)
			|			И НДФЛРасчетыСБюджетом.ИсчисленоИзЗарплаты
			|			И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|		{ГДЕ
			|			НДФЛРасчетыСБюджетом.ФизЛицо,
			|			НДФЛРасчетыСБюджетом.ОбособленноеПодразделение КАК Организация}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.Период, МЕСЯЦ),
			|			НДФЛРасчетыСБюджетом.ФизЛицо,
			|			НДФЛРасчетыСБюджетом.ОбособленноеПодразделение,
			|			НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),
			|			ВЫБОР
			|				КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = &ВозвратНалога
			|					ТОГДА ""Подоходный налог возврат налога ""
			|				ИНАЧЕ ""Подоходный налог исчисленный ""
			|			КОНЕЦ + ВЫБОР
			|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Общая
			|					ТОГДА ""по ставке 12%""
			|				КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Дивиденды
			|					ТОГДА ""по дивидендам""
			|				ИНАЧЕ ""по ставке 15%""
			|			КОНЕЦ
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Удержано"",
			|			ПогашениеЗаймовРаботникамиОрганизаций.Организация,
			|			НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|			ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо,
			|			""Погашение займа"",
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""ВААА"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(ПогашениеЗаймовРаботникамиОрганизаций.ОсновнойДолг + ПогашениеЗаймовРаботникамиОрганизаций.Проценты),
			|			НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ПогашениеЗаймовРаботникамиОрганизаций КАК ПогашениеЗаймовРаботникамиОрганизаций
			|		ГДЕ
			|			ПогашениеЗаймовРаботникамиОрганизаций.ВидДвижения = &Расход
			|			И ПогашениеЗаймовРаботникамиОрганизаций.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И ПогашениеЗаймовРаботникамиОрганизаций.УдержаноИзЗарплаты
			|		{ГДЕ
			|			ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ПогашениеЗаймовРаботникамиОрганизаций.ДоговорЗайма,
			|			НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|			ПогашениеЗаймовРаботникамиОрганизаций.Организация,
			|			ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо,
			|			КОНЕЦПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ),
			|			НАЧАЛОПЕРИОДА(ПогашениеЗаймовРаботникамиОрганизаций.Период, МЕСЯЦ)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Выплата"",
			|			Взаиморасчеты.Организация,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			Взаиморасчеты.Физлицо,
			|			ВЫБОР
			|				КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|					ТОГДА ВЫБОР
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|								ТОГДА ""Через кассу ""
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|								ТОГДА ""Перечислено в банк ""
			|							ИНАЧЕ ""Способ выплаты не указан ""
			|						КОНЕЦ + ВЫБОР
			|							КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|								ТОГДА ""(аванс)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|								ТОГДА ""(под расчет)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|								ТОГДА ""(не указано)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|								ТОГДА ""(погашено задолженности)""
			|							ИНАЧЕ ""(межрасчет)""
			|						КОНЕЦ + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						КОНЕЦ
			|				ИНАЧЕ ""Задепонировано №"" + Взаиморасчеты.Ведомость.Номер
			|			КОНЕЦ,
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""ГААА1"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(Взаиморасчеты.СуммаВзаиморасчетов),
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА КОНЕЦПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|		ГДЕ
			|			Взаиморасчеты.ВидДвижения = &Расход
			|			И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|			И Взаиморасчеты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И НЕ(Взаиморасчеты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|						И Взаиморасчеты.СпособВыплаты = &ЧерезБанк)
			|		{ГДЕ
			|			Взаиморасчеты.Организация,
			|			Взаиморасчеты.Физлицо}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Взаиморасчеты.Организация,
			|			Взаиморасчеты.Физлицо,
			|			ВЫБОР
			|				КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|					ТОГДА ВЫБОР
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|								ТОГДА ""Через кассу ""
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|								ТОГДА ""Перечислено в банк ""
			|							ИНАЧЕ ""Способ выплаты не указан ""
			|						КОНЕЦ + ВЫБОР
			|							КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|								ТОГДА ""(аванс)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|								ТОГДА ""(под расчет)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|								ТОГДА ""(не указано)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|								ТОГДА ""(погашено задолженности)""
			|							ИНАЧЕ ""(межрасчет)""
			|						КОНЕЦ + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						КОНЕЦ
			|				ИНАЧЕ ""Задепонировано №"" + Взаиморасчеты.Ведомость.Номер
			|			КОНЕЦ,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА КОНЕЦПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			ВидыДвижения.ВидДвижения,
			|			Взаиморасчеты.Организация,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			Взаиморасчеты.Физлицо,
			|			""Компенсация за задержку выплаты заработной платы"",
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""ГААА2"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты),
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|				ПО Взаиморасчеты.Физлицо = ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
			|					И Взаиморасчеты.Ведомость = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка,
			|			(ВЫБРАТЬ
			|				""Начислено"" КАК ВидДвижения
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				""Выплата"") КАК ВидыДвижения
			|		ГДЕ
			|			Взаиморасчеты.ВидДвижения = &Расход
			|			И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|			И Взаиморасчеты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты <> 0
			|		{ГДЕ
			|			Взаиморасчеты.Физлицо,
			|			Взаиморасчеты.Организация}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Взаиморасчеты.Организация,
			|			Взаиморасчеты.Физлицо,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			ВидыДвижения.ВидДвижения,
			|			КОНЕЦПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Сальдо"",
			|			Сальдо.Организация,
			|			Периоды.ПериодРегистрации,
			|			Сальдо.Физлицо,
			|			"""",
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""ЯЯЯЯ"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(ВЫБОР
			|					КОГДА Сальдо.Период < Периоды.ПериодРегистрации
			|						ТОГДА Сальдо.СуммаВзаиморасчетовОстаток
			|					ИНАЧЕ 0
			|				КОНЕЦ),
			|			СУММА(ВЫБОР
			|					КОГДА Сальдо.Период <= Периоды.ПериодРегистрации
			|						ТОГДА Сальдо.СуммаВзаиморасчетовОстаток
			|					ИНАЧЕ 0
			|				КОНЕЦ),
			|			СУММА(Сальдо.СуммаВзаиморасчетовОборот),
			|			"""",
			|			Ложь
			|		ИЗ
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК ПериодРегистрации
			|			ИЗ
			|				РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|			ГДЕ
			|				РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации) КАК Периоды
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ВзаиморасчетыСРаботникамиОрганизацийОстатки.Организация КАК Организация,
			|					ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -1) КАК Период,
			|					ВзаиморасчетыСРаботникамиОрганизацийОстатки.Физлицо КАК Физлицо,
			|					ВзаиморасчетыСРаботникамиОрганизацийОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
			|					NULL КАК СуммаВзаиморасчетовОборот
			|				ИЗ
			|					РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&ПериодРегистрации, {(Физлицо), (Организация)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОстатки
			|				
			|				ОБЪЕДИНИТЬ ВСЕ
			|				
			|				ВЫБРАТЬ
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Организация,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Период,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Физлицо,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.СуммаВзаиморасчетовОборот,
			|					NULL
			|				ИЗ
			|					РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (Физлицо)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОбороты
			|				
			|				ОБЪЕДИНИТЬ ВСЕ
			|				
			|				ВЫБРАТЬ
			|					НДФЛКЗачету.Организация,
			|					ДОБАВИТЬКДАТЕ(&ПериодРегистрации, МЕСЯЦ, -1),
			|					НДФЛКЗачету.ФизЛицо,
			|					НДФЛКЗачету.СуммаНДФЛКЗачетуОстаток,
			|					NULL
			|				ИЗ
			|					РегистрНакопления.НДФЛКЗачету.Остатки(&ПериодРегистрации, {(ФизЛицо), (Организация)}) КАК НДФЛКЗачету
			|				
			|				ОБЪЕДИНИТЬ ВСЕ
			|				
			|				ВЫБРАТЬ
			|					НДФЛКЗачету.Организация,
			|					НДФЛКЗачету.Период,
			|					НДФЛКЗачету.ФизЛицо,
			|					НДФЛКЗачету.СуммаНДФЛКЗачетуОборот,
			|					NULL
			|				ИЗ
			|					РегистрНакопления.НДФЛКЗачету.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (ФизЛицо)}) КАК НДФЛКЗачету
			|				
			|				ОБЪЕДИНИТЬ ВСЕ
			|				
			|				ВЫБРАТЬ
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Организация,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Период,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.Физлицо,
			|					NULL,
			|					ВзаиморасчетыСРаботникамиОрганизацийОбороты.СуммаВзаиморасчетовОборот
			|				ИЗ
			|					РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(&ПериодРегистрации, &КонецПериодаРегистрации, Месяц, {(Организация), (Физлицо)}) КАК ВзаиморасчетыСРаботникамиОрганизацийОбороты) КАК Сальдо
			|				ПО (Сальдо.Период <= Периоды.ПериодРегистрации)
			|		{ГДЕ
			|			Сальдо.Организация,
			|			Сальдо.Физлицо}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Сальдо.Организация,
			|			Сальдо.Физлицо,
			|			Периоды.ПериодРегистрации
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			""Выплата"",
			|			Взаиморасчеты.Организация,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			Взаиморасчеты.Физлицо,
			|			ВЫБОР
			|				КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|					ТОГДА ВЫБОР
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|								ТОГДА ""Через кассу ""
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|								ТОГДА ""Перечислено в банк ""
			|							ИНАЧЕ ""Способ выплаты не указан ""
			|						КОНЕЦ + ВЫБОР
			|							КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|								ТОГДА ""(аванс)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|								ТОГДА ""(под расчет)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|								ТОГДА ""(не указано)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|								ТОГДА ""(погашено задолженности)""
			|							ИНАЧЕ ""(межрасчет)""
			|						КОНЕЦ + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						КОНЕЦ
			|				ИНАЧЕ ""Задепонировано №"" + Взаиморасчеты.Ведомость.Номер
			|			КОНЕЦ,
			|			0, // КАК ОбъединятьВР, //Аверсон 13.05.2021 КВВ СВФР-007584
			|			&ПустойСпособ,
			//+ СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|   		Ложь КАК ЭтоПроцентныйПоказатель, 
			//- СВЭЙ КДЯ 16.03.20 СВФР-005548 2 часть
			|			""ГААА1"",
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			СУММА(Взаиморасчеты.СуммаВзаиморасчетов),
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА КОНЕЦПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			NULL,
			|			"""",
			|			Ложь
			|		ИЗ
			|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручениеИсходящее.ПеречислениеЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты
			|				ПО Взаиморасчеты.Регистратор = ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка
			|		И Взаиморасчеты.Ведомость = ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость //О.Т. Аверсон 04.12.2017 № 1318
			|		ГДЕ
			|			Взаиморасчеты.ВидДвижения = &Расход
			|			И Взаиморасчеты.СуммаВзаиморасчетов <> 0
			|			И ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.Дата МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
			|			И Взаиморасчеты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|			И Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|		{ГДЕ
			|			Взаиморасчеты.Организация,
			|			Взаиморасчеты.Физлицо}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			Взаиморасчеты.Организация,
			|			Взаиморасчеты.Физлицо,
			|			ВЫБОР
			|				КОГДА НЕ Взаиморасчеты.Регистратор ССЫЛКА Документ.ДепонированиеОрганизаций
			|					ТОГДА ВЫБОР
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезКассу
			|								ТОГДА ""Через кассу ""
			|							КОГДА Взаиморасчеты.СпособВыплаты = &ЧерезБанк
			|								ТОГДА ""Перечислено в банк ""
			|							ИНАЧЕ ""Способ выплаты не указан ""
			|						КОНЕЦ + ВЫБОР
			|							КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
			|								ТОГДА ""(аванс)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &Расчет
			|								ТОГДА ""(под расчет)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов > 0
			|								ТОГДА ""(не указано)""
			|							КОГДА Взаиморасчеты.ХарактерВыплаты = &ХарактерНеУказан
			|									И Взаиморасчеты.СуммаВзаиморасчетов < 0
			|								ТОГДА ""(погашено задолженности)""
			|							ИНАЧЕ ""(межрасчет)""
			|						КОНЕЦ + "" № "" + ВЫБОР
			|							КОГДА Взаиморасчеты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|								ТОГДА ВЫРАЗИТЬ(Взаиморасчеты.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Номер
			|							ИНАЧЕ Взаиморасчеты.Ведомость.Номер
			|						КОНЕЦ
			|				ИНАЧЕ ""Задепонировано №"" + Взаиморасчеты.Ведомость.Номер
			|			КОНЕЦ,
			|			НАЧАЛОПЕРИОДА(Взаиморасчеты.Период, МЕСЯЦ),
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА НАЧАЛОПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ,
			|			ВЫБОР
			|				КОГДА Взаиморасчеты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА КОНЕЦПЕРИОДА(ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость.ПериодРегистрации, МЕСЯЦ)
			|				ИНАЧЕ КОНЕЦПЕРИОДА(Взаиморасчеты.ПериодВзаиморасчетов, МЕСЯЦ)
			|			КОНЕЦ) КАК НачисленияУдержания) КАК НачисленияУдержания
			|{ГДЕ
			|	НачисленияУдержания.ФизЛицо,
			|	НачисленияУдержания.ПериодРегистрации}
			
			//Аверсон 13.05.2021 КВВ СВФР-007584 (
			|; 
			|ВЫБРАТЬ *
			|ПОМЕСТИТЬ ВТ3
			|ИЗ ВТ1 КАК ВТ1
			|ГДЕ ОбъединятьВР = 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	ВТ2.ВидДвижения КАК ВидДвижения,
			|	ВТ2.ФизЛицо КАК ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ВТ2.ПериодРегистрации,МЕСЯЦ) КАК ПериодРегистрации,
			|	ВТ2.ВидРасчета КАК ВидРасчета,
			|	ВТ2.ОбъединятьВР КАК ОбъединятьВР, 
			|	ВТ2.СпособРасчета,
			|	ВТ2.ПорядокВидаРасчета КАК ПорядокВидаРасчета,
			|	СУММА(ВТ2.ОтработаноДней),
			|	СУММА(ВТ2.ОтработаноЧасов),
			|	СУММА(ВТ2.ОплаченоДней),
			|	СУММА(ВТ2.Результат),
			|	СУММА(ВТ2.ОплаченоЧасов),
			|	ВТ2.ЭтоПроцентныйПоказатель,
			|	ВТ2.ПериодДействияНачало КАК ПериодДействияНачало,
			|	ВТ2.ПериодДействияКонец,
			|	ВТ2.Регистратор,
			|	ВТ2.НомерСтроки,
			|	ВТ2.Организация КАК Организация,
			|	ВТ2.ДополнениеКВидуРасчета,
			|	ВТ2.Показатель1,
			|	ВТ2.Показатель2,
			|	ВТ2.Показатель3,
			|	ВТ2.Показатель4,
			|	ВТ2.Показатель5,
			|	ВТ2.Показатель6,
			|	СУММА(ВТ2.СальдоНачальное),
			|	СУММА(ВТ2.СальдоКонечное),
			|	СУММА(ВТ2.Оборот) КАК Оборот,
			|	ВТ2.СтрокаПроцент,
			|	ВТ2.НеВыводитьПоказательРасчета
			
			|ИЗ ВТ1 КАК ВТ2
			|ГДЕ ОбъединятьВР = 1
			|СГРУППИРОВАТЬ ПО
			|	ВТ2.ВидДвижения,
			|	ВТ2.ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ВТ2.ПериодРегистрации,МЕСЯЦ),
			|	ВТ2.ВидРасчета,
			|	ВТ2.ОбъединятьВР, 
			|	ВТ2.СпособРасчета,
			|	ВТ2.ПорядокВидаРасчета,
			|	ВТ2.ЭтоПроцентныйПоказатель,
			|	ВТ2.ПериодДействияНачало,
			|	ВТ2.ПериодДействияКонец,
			|	ВТ2.Регистратор,
			|	ВТ2.НомерСтроки,
			|	ВТ2.Организация,
			|	ВТ2.ДополнениеКВидуРасчета,
			|	ВТ2.Показатель1,
			|	ВТ2.Показатель2,
			|	ВТ2.Показатель3,
			|	ВТ2.Показатель4,
			|	ВТ2.Показатель5,
			|	ВТ2.Показатель6,
			|	ВТ2.СтрокаПроцент,
			|	ВТ2.НеВыводитьПоказательРасчета
			|;
			|
			|ВЫБРАТЬ *
			|ИЗ ВТ3 КАК ВТ3
			|УПОРЯДОЧИТЬ ПО ";
			
			Если НЕ (Организация.ИНН = "100765738" ИЛИ Организация.ИНН = "190530779") Тогда //Аверсон 12.10.2021 КВВ СВФР-008203 //Госпиталь
				ТекстПостроителя = ТекстПостроителя + "
				//Аверсон ЕАЕ 01.07.2021 СВФР-007797
				|	ПериодДействияНачало,";
				//Аверсон СВФР-007797
			КонецЕсли;
			
			ТекстПостроителя = ТекстПостроителя + "
			|	ПериодРегистрации,
			|	ФизЛицо,
			|	ВидДвижения,
			|	ПорядокВидаРасчета,
			|	ВидРасчета
			
			//Аверсон ЕАЕ 01.07.2021 СВФР-007797
			//|	ПериодДействияНачало
			//Аверсон СВФР-007797
			
			|ИТОГИ ПО
			|	Организация,
			|	ПериодРегистрации,
			|	ФизЛицо,
			|	ВидДвижения
			//Аверсон 13.05.2021 КВВ СВФР-007584 )
			
			|";
			//|УПОРЯДОЧИТЬ ПО
			//|	ПериодРегистрации,
			//|	ФизЛицо,
			//|	ВидДвижения,
			//|	ПорядокВидаРасчета,
			//|	ВидРасчета,
			//|	ПериодДействияНачало
			//|ИТОГИ ПО
			//|	Организация,
			//|	ПериодРегистрации,
			//|	ФизЛицо,
			//|	ВидДвижения"; //О.Т. 18.09.2014 № 228 ,433
			
		КонецЕсли;
		//Островская Татьяна 07.02.2014 № 17065
		ПостроительОтчетов.Текст = ТекстПостроителя;
		
		// Подготовим построитель запросов к настройке отборов
		ПостроительОтчетов.ЗаполнитьНастройки();
		ПостроительОтчетов.Отбор.Сбросить();
		
	КонецПроцедуры
	
	// Запоминает настройку группировки расчетного листка
	//
	Процедура ЗапомнитьНастройкуРасчетногоЛистка() Экспорт  
		
		// Найдем элемент группировки с названием "ШапкаРасчетногоЛистка"
		ЭлементНайден = Ложь;
		Для Каждого ЭлементСтруктурыГруппировки из КомпоновщикНастроек.Настройки.Структура Цикл
			
			Если ЭлементСтруктурыГруппировки.Имя = "ШапкаРасчетногоЛистка" тогда
				
				ЭлементНастройкиРасчетногоЛистка = ЭлементСтруктурыГруппировки;
				КомпоновщикНастроек.Настройки.Структура.Удалить(ЭлементСтруктурыГруппировки);
				ЭлементНайден = Истина;
				Возврат;
				
			Иначе
				
				// Рекурсивно проверим остальные элементы структуры
				ПроверитьВложенныеЭлементы(ЭлементСтруктурыГруппировки , ЭлементНайден);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
	
	// Осуществляет рекурсивный поиск элемента группировки с именем "ШапкаРасчетногоЛистка"
	//
	Процедура ПроверитьВложенныеЭлементы(ЭлементСтруктурыГруппировки , ЭлементНайден)
		
		Для Каждого ЭлементСтруктуры из ЭлементСтруктурыГруппировки.Структура Цикл
			
			Если ЭлементНайден тогда
				Возврат;
			КонецЕсли;
			
			Если ЭлементСтруктуры.Имя = "ШапкаРасчетногоЛистка" тогда
				
				ЭлементНастройкиРасчетногоЛистка = ЭлементСтруктуры;
				ЭлементСтруктурыГруппировки.Структура.Удалить(ЭлементСтруктуры);
				ЭлементНайден = истина;
				Возврат;
				
			Иначе
				
				ПроверитьВложенныеЭлементы(ЭлементСтруктуры , ЭлементНайден);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура ДобавитьСтруктуруРасчетногоЛистка(Структура) 
		
		ЭлементСтруктурыРасчетногоЛистка = Структура.Добавить(ТипЗнч(ЭлементНастройкиРасчетногоЛистка));
		
		ТиповыеОтчеты.СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыРасчетногоЛистка, ЭлементНастройкиРасчетногоЛистка);
		
		ЭлементСтруктурыРасчетногоЛистка.Имя                           = "ШапкаРасчетногоЛистка";
		ЭлементСтруктурыРасчетногоЛистка.Структура[0].Имя              = "Начисление";
		ЭлементСтруктурыРасчетногоЛистка.Структура[0].Структура[0].Имя = "СтрокаНачисленийУдержаний";
		ЭлементСтруктурыРасчетногоЛистка.Структура[1].Имя              = "Удержание";
		ЭлементСтруктурыРасчетногоЛистка.Структура[1].Структура[0].Имя = "СтрокаНачисленийУдержаний";
		ЭлементСтруктурыРасчетногоЛистка.Структура[2].Имя              = "Сальдо";
		
	КонецПроцедуры
	
	// Добавление расчетного листка в настройку схемы компоновки
	//
	Процедура ВосстановитьНастройкуРасчетногоЛистка() Экспорт  
		
		Если КомпоновщикНастроек.Настройки.Структура.Количество() = 0 тогда
			
			ДобавитьСтруктуруРасчетногоЛистка(КомпоновщикНастроек.Настройки.Структура);
			
		Иначе
			
			Для Каждого ЭлементСтруктурыГруппировки из КомпоновщикНастроек.Настройки.Структура Цикл
				
				Если ТипЗнч(ЭлементСтруктурыГруппировки) <> Тип("ГруппировкаКомпоновкиДанных") тогда
					КомпоновщикНастроек.Настройки.Структура.Удалить(ЭлементСтруктурыГруппировки);
					ДобавитьСтруктуруРасчетногоЛистка(КомпоновщикНастроек.Настройки.Структура);
					Возврат;
				КонецЕсли;
				
				Если ЭлементСтруктурыГруппировки.Структура.Количество() <> 0 тогда
					Если ЭлементСтруктурыГруппировки.ПоляГруппировки.Элементы.Количество() <> 0 тогда
						
						ДобавитьГруппировкиВВыводимыеПоля(ЭлементСтруктурыГруппировки); 
						НайтиСледующийУровень(ЭлементСтруктурыГруппировки);
						
					Иначе
						
						КомпоновщикНастроек.Настройки.Структура.Удалить(ЭлементСтруктурыГруппировки);
						
						ДобавитьСтруктуруРасчетногоЛистка(КомпоновщикНастроек.Настройки.Структура);
						
					КонецЕсли;
					
				Иначе
					
					Если ЭлементСтруктурыГруппировки.ПоляГруппировки.Элементы.Количество() = 0 тогда
						
						КомпоновщикНастроек.Настройки.Структура.Удалить(ЭлементСтруктурыГруппировки);
						ДобавитьСтруктуруРасчетногоЛистка(КомпоновщикНастроек.Настройки.Структура);
						
					Иначе
						
						ДобавитьГруппировкиВВыводимыеПоля(ЭлементСтруктурыГруппировки);
						ДобавитьСтруктуруРасчетногоЛистка(ЭлементСтруктурыГруппировки.Структура);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецПроцедуры
	
	
	// Поиск последнего уровня иерархии группировки
	//
	Процедура НайтиСледующийУровень(ЭлементСтруктурыГруппировки)
		
		Для Каждого ЭлементСтруктуры из ЭлементСтруктурыГруппировки.Структура Цикл
			
			Если ЭлементСтруктуры.Имя = "ШапкаРасчетногоЛистка" тогда
				ЭлементСтруктурыГруппировки.Структура.Удалить(ЭлементСтруктуры);
				ДобавитьСтруктуруРасчетногоЛистка(ЭлементСтруктурыГруппировки.Структура);
				Возврат;
			КонецЕсли;
			
			Если ЭлементСтруктуры.Структура.Количество() <> 0 тогда
				Если ЭлементСтруктуры.ПоляГруппировки.Элементы.Количество() <> 0 тогда
					
					ДобавитьГруппировкиВВыводимыеПоля(ЭлементСтруктуры);
					НайтиСледующийУровень(ЭлементСтруктуры);
					
				Иначе
					
					ЭлементСтруктурыГруппировки.Структура.Удалить(ЭлементСтруктуры);
					
					ДобавитьСтруктуруРасчетногоЛистка(ЭлементСтруктурыГруппировки.Структура);
					
				КонецЕсли;
			Иначе
				Если ЭлементСтруктуры.ПоляГруппировки.Элементы.Количество() = 0 тогда
					
					ЭлементСтруктурыГруппировки.Структура.Удалить(ЭлементСтруктуры);
					ДобавитьСтруктуруРасчетногоЛистка(ЭлементСтруктурыГруппировки.Структура);
					
				Иначе
					
					ДобавитьГруппировкиВВыводимыеПоля(ЭлементСтруктуры);
					ДобавитьСтруктуруРасчетногоЛистка(ЭлементСтруктуры.Структура);
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецПроцедуры
	
	// Добавление поля в таблицу выбранных полей из таблицы группировок
	//
	Процедура ДобавитьГруппировкиВВыводимыеПоля(ЭлементСтруктуры)
		
		ЭлементСтруктуры.Выбор.Элементы.Очистить();
		
		ЭлементСтруктуры.ПараметрыВывода.Элементы.Найти("TemplateType").Значение      = ТипМакетаГруппировкиКомпоновкиДанных.Вертикальный;
		ЭлементСтруктуры.ПараметрыВывода.Элементы.Найти("TemplateType").Использование = истина;
		
		Для каждого ЭлементИсточник Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
			
			ДоступноеПоле = ЭлементСтруктуры.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Строка(ЭлементИсточник.Поле)));
			Если ДоступноеПоле <> Неопределено тогда
				ЭлементПриемник               = ЭлементСтруктуры.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ЭлементПриемник.Поле          = ДоступноеПоле.Поле;
				ЭлементПриемник.Заголовок     = ДоступноеПоле.Заголовок;
				ЭлементПриемник.Использование = истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	// Сохранение настроек схемы компоновки
	//
	Процедура СохранитьНастройку() Экспорт
		
		СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
		СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
		
	КонецПроцедуры
	
	// Заполнение параметров отчета по элементу справочника из переменной СохраненнаяНастройка.
	//
	Процедура ПрименитьНастройку() Экспорт
		
		Если СохраненнаяНастройка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
		
	КонецПроцедуры
	
	//Аверсон ЕАЕ 14.01.2025 СВФР-014546
	Функция ПередвинутьОбластьПервойЯчейкиСУчетомПодразделений(Обл, ТабДок)
		ОблИтог = Обл;
		С = Обл.Верх;
		СПодр = С - 3; //Ищем нижнее подразделение
		ОблПодр = ТабДок.Область(СПодр, 1, СПодр, 1);
		Если ОблПодр.Текст = "Подразделение организации" Тогда
			ОблИтог = ОблПодр;
			//Ищем верхнее подразделение
			СПодр = СПодр - 2;
			ОблПодр = ТабДок.Область(СПодр, 1, СПодр, 1);
			Пока ОблПодр.Текст = "Подразделение организации" Цикл
				ОблИтог = ОблПодр;
				СПодр = СПодр - 2;
				ОблПодр = ТабДок.Область(СПодр, 1, СПодр, 1);	
			КонецЦикла;
		КонецЕсли; 
		Возврат ОблИтог;
	КонецФункции
	//Аверсон СВФР-014546
	
	НастройкаПериода = Новый НастройкаПериода;
#КонецЕсли

НастройкаШириныКолонокРасчетногоЛистка     = Новый Массив();
НастройкаРазмТекстаКолонокРасчетногоЛистка = Новый Массив();

#Если Клиент тогда
	Для каждого МакетГруппировки из СхемаКомпоновкиДанных.МакетыГруппировок Цикл
		Если МакетГруппировки.ИмяГруппировки = "ШапкаРасчетногоЛистка" тогда
			ИмяМакетаШапкаРасчетногоЛистка = МакетГруппировки.Макет;
		КонецЕсли;
	КонецЦикла;
	МакетШапкаРасчетногоЛистка = СхемаКомпоновкиДанных.Макеты.Найти(ИмяМакетаШапкаРасчетногоЛистка);
	
	// запомнить настройки макета
	ЯчейкиМакета = МакетШапкаРасчетногоЛистка.Макет[0].Ячейки;
	
	Для каждого Ячейка из ЯчейкиМакета Цикл
		НастройкаШириныКолонокРасчетногоЛистка.Вставить(ЯчейкиМакета.Индекс(Ячейка), Ячейка.Оформление.Элементы.Найти("MaximumWidth").Значение);
		НастройкаРазмТекстаКолонокРасчетногоЛистка.Вставить(ЯчейкиМакета.Индекс(Ячейка), Ячейка.Оформление.Элементы.Найти("Placement").Значение);
	КонецЦикла;
	
	НастройкаРазмТекстаКолонокРасчетногоЛистка[1] = ТипРазмещенияТекстаКомпоновкиДанных.Выступать;
	
	МакетШапкаРасчетногоЛистка = Неопределено;
	ЯчейкиМакета               = Неопределено;
	
#КонецЕсли

НачисленияУдержания = Новый ТаблицаЗначений();
НачисленияУдержания.Колонки.Добавить("ВидДвижения");
НачисленияУдержания.Колонки.Добавить("ВидДвиженияУд");
НачисленияУдержания.Колонки.Добавить("ФизЛицо");
НачисленияУдержания.Колонки.Добавить("Организация");
НачисленияУдержания.Колонки.Добавить("ПериодРегистрации");
НачисленияУдержания.Колонки.Добавить("ПризнакУпорядочиванияСтрок");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияВидНачисления");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияПериодНачисления");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияОтработанныеДни");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияОтработанныеЧасы");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияОплаченныеДни");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияОплаченныеЧасы");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияСуммаНачисления");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияВидУдержания");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияПериодУдержания");
НачисленияУдержания.Колонки.Добавить("НачисленияУдержанияСуммаУдержания");
НачисленияУдержания.Колонки.Добавить("СальдоНачальное");
НачисленияУдержания.Колонки.Добавить("СальдоКонечное");
НачисленияУдержания.Колонки.Добавить("Оборот");

СписокПолейОтбора = Новый СписокЗначений;
СписокПолейОтбора.Добавить(Новый ПолеКомпоновкиДанных("ФизЛицо"));
СписокПолейОтбора.Добавить(Новый ПолеКомпоновкиДанных("ПериодРегистрации"));
СписокПолейОтбора.Добавить(Новый ПолеКомпоновкиДанных("Организация"));


