
Процедура СформироватьОтчет(НачДата, КонДата, ТабДок, ИзФормы) Экспорт
	Макет = ЭтотОбъект.ПолучитьМакет("Макет1");
	ЗапросИ = Новый Запрос;
	ЗапросИ.Текст = 
		"ВЫБРАТЬ
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка КАК Документ,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПользовательОК,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПользовательООТиЗ
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
		|ГДЕ
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала МЕЖДУ &НачДата И &КонДата
		|	И (НЕ КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПометкаУдаления)
		|	И (КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПользовательОК = """"
		|			ИЛИ КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка.ПользовательООТиЗ = """")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка,
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник,
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ПользовательОК,
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ПользовательООТиЗ
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|ГДЕ
		|	(НЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ПометкаУдаления)
		|	И (ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ПользовательОК = """"
		|			ИЛИ ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.ПользовательООТиЗ = """")
		|	И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема МЕЖДУ &НачДата И &КонДата";

	ЗапросИ.УстановитьПараметр("КонДата", КонДата);
	ЗапросИ.УстановитьПараметр("НачДата", НачДата);

	Результат = ЗапросИ.Выполнить();
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если ВыборкаОбщийИтог.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьГруппа1 = Макет.ПолучитьОбласть("Группа1");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Шапка = "Отчет по непроверенным документам" + Символы.ПС+ " с "+Формат(НачДата, "ДФ='dd.MM.yyyy'")+" по "+Формат(КонДата, "ДФ='dd.MM.yyyy'");
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);

	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр = Истина;
	Если НЕ ИзФормы Тогда
		РаботаСДиалогами.НапечататьДокумент(ТабДок);
	КонецЕсли;
	
КонецПроцедуры
