
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	//если ФормироватьПромежуточнуюВедомость Тогда 
	//	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
	//		Возврат Новый Структура("Т53,Т49,КО2,Реестр","Форма Т-53","Форма Т-49","РКО","Реестр депонированных сумм");
	//	Иначе
	//		Возврат Новый Структура("ПереченьПолностью, ФормированиеФайлаВБанк, ФормированиеФайлаЗПБелагропромбанк,РПВ", "Список плательщиков в банк", "Формирование файла","Формирование файла для ЗП Белагропромбанк","РПВ"); // №14657 18.01.2012 , Дыма 		
	//	КонецЕсли;
	//иначе
	//КонецЕсли;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()