Перем АдресРесурсовОбозревателя Экспорт; // В переменной содержится значение 
										 // адреса ресурса данной конфигурации
Перем глОбщиеЗначения Экспорт;

Перем ОсновнаяОрганизация Экспорт;//Островская Татьяна 20.11.2013 № 16927
Перем глФЛ_СписокРедактируемыхФайлов Экспорт;//Островская Татьяна 20.11.2013 № 16927
Перем глСклонение Экспорт; //Островская Татьяна 21.11.2013 № 16927

Перем СообщенияДляЖурналаРегистрации Экспорт; //О.Т. Аверсон 23.10.2015 № 658

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	УправлениеПользователями.ПроверитьВозможностьРаботыПользователя(Отказ);
	
КонецПроцедуры                           

Процедура ПриНачалеРаботыСистемы()
	
	//О.Т. 29.12.2014 № 
	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
		|ГДЕ
		|	НастройкиПользователей.Пользователь = &Пользователь
		|	И НастройкиПользователей.Настройка = &Настройка";
	
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию("Отключить стандартные команды"));
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		если ВыборкаДетальныеЗаписи.Значение Тогда 
			Для каждого ТекИнтерфейс Из ГлавныйИнтерфейс Цикл  
				если Найти(ТекИнтерфейс,"Общий")>0 Тогда 
					ТекИнтерфейс.Переключаемый = Ложь;
					ТекИнтерфейс.Видимость = Ложь;
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	//О.Т. 29.12.2014 № 
	ВыполнитьОбновлениеИнформационнойБазы();
	ЗавершениеРаботыПользователей.УстановитьКонтрольРежимаЗавершенияРаботыПользователей();
		
	Если ПравоДоступа("Использование", Метаданные.Обработки.МенеджерКонтактов)
		И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеЭлектроннойПочтыПриЗапускеПрограммы") = Истина Тогда
		Обработки.МенеджерКонтактов.ПолучитьФорму().Открыть();
	КонецЕсли;
	
	Если ПравоДоступа("Использование", Метаданные.Обработки.НаборПерсонала)
	   И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеНабораПриЗапускеПрограммы") = Истина Тогда
		Обработки.НаборПерсонала.ПолучитьФорму().Открыть();
	КонецЕсли;
	
	ПроверятьПриЗапуске = ВосстановитьЗначение("ПроверкаНаличияОбновленияПроверятьПриЗапуске");
	ПроверятьПриЗапуске = ?(ТипЗнч(ПроверятьПриЗапуске) = Тип("Неопределено"), Ложь, ПроверятьПриЗапуске);

	Если ПроверятьПриЗапуске Тогда

		Обозреватель = Обработки.Обозреватель.Создать();
		Форма        = Обозреватель.ПолучитьФорму("ПроверкаНаличияОбновления");

		Если Обозреватель.Проверить(Форма.ЭлементыФормы) Тогда

			ПоказПриПоявленииНовойВерсии = ВосстановитьЗначение("ПроверкаНаличияОбновленияПоказПриПоявленииНовойВерсии");
			ПоказПриПоявленииНовойВерсии = ?(ТипЗнч(ПоказПриПоявленииНовойВерсии)=Тип("Неопределено"),Ложь,ПоказПриПоявленииНовойВерсии);

			ВерсияДистрибутива = ВосстановитьЗначение("ПроверкаНаличияОбновленияПоследняяВерсия");

			Если ПоказПриПоявленииНовойВерсии Тогда

				Если ВерсияДистрибутива <> Форма.ЭлементыФормы.ВерсияДистрибутива.Значение Тогда
					Форма.Открыть();
				КонецЕсли;

			Иначе
				Форма.Открыть();
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	
	ПроверитьПодключениеОбработчикаОжидания();
	
	ПолучитьВнешниеКомпонентыПриНеобходимости();
	
	// Подключение компоненты для склонения ФИО
	Попытка
		// Загружаем внешнюю компоненту
		//Аверсон ЕАЕ 30.10.2019
		//ЗагрузитьВнешнююКомпоненту("NameDecl.dll");
		//глКомпонентаСклоненияФИО = Новый("AddIn.NameDeclension");
		глКомпонентаСклоненияФИО = ОбщегоНазначения.ПодключитьКомпонентуИзМакета("CNameDecl", "ОбщийМакет.КомпонентаСклоненияФИО");
		//Аверсон
	Исключение
		// Не удалось выполнить операции с внешней компонентой
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка загрузки внешней компоненты для склонения ФИО! Функции склонения будут недоступны!");
		
	КонецПопытки;
	
	ОткрытьТекущиеЗадачиПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОткрыватьПриЗапускеСписокТекущихЗадачПользователя")
										И ПравоДоступа("Использование", Метаданные.Обработки.ТекущиеЗадачи);
	
	Если ОткрытьТекущиеЗадачиПользователя Тогда
		Обработки.ТекущиеЗадачи.ПолучитьФорму().Открыть();
	КонецЕсли;

	// Календарь бухгалтера. Регламентированная отчетность.
	ПроверитьНапоминанияКалендарьБухгалтераСобытия();

	// Начнем проверку динамического обновления конфигурации
	НачатьПроверкуДинамическогоОбновленияИБ();
	
	ЭтоФайловаяИБ = ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая();
		
	Если ЭтоФайловаяИБ Тогда
					
		ПользовательДляВыполненияРеглЗаданий = Константы.ПользовательДляВыполненияРегламентныхЗаданийВФайловомВарианте.Получить();
		
		Если глЗначениеПеременной("глТекущийПользователь") = ПользовательДляВыполненияРеглЗаданий Тогда
			
			// с интервалом секунд вызываем процедуру работы с регламентными заданиями
			ПоддержкаРегламентныхЗаданиеДляФайловойВерсии();
			
			ИнтервалДляОпроса = Константы.ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте.Получить();
			
			Если ИнтервалДляОпроса = Неопределено
				ИЛИ ИнтервалДляОпроса = 0 Тогда
				
				ИнтервалДляОпроса = 30;	
				
			КонецЕсли;
			
			ПодключитьОбработчикОжидания("ПоддержкаРегламентныхЗаданиеДляФайловойВерсии", ИнтервалДляОпроса);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// автообмен данными
	Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") <> Неопределено Тогда
		
		// подключим обработчик обменов данными
		ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));
			
	КонецЕсли;
	
	// Открытие дополнительной информации
	//Форма = Обработки.ДополнительнаяИнформация.ПолучитьФорму("ФормаРабочийСтол");
	//Форма.Открыть();
	//Островская Татьяна 21.11.2013 № 16927
	Попытка
		//Аверсон ЕАЕ 30.10.2019
		//ЗагрузитьВнешнююКомпоненту("NameDecl.dll");
		//глСклонение = Новый("AddIn.NameDeclension", Неопределено);
		глСклонение = ОбщегоНазначения.ПодключитьКомпонентуИзМакета("CNameDecl", "ОбщийМакет.КомпонентаСклоненияФИО");
		//Аверсон
	Исключение
	КонецПопытки;
	//Островская Татьяна 21.11.2013 № 16927
	
	//Аверсон 15.10.2019 КВВ СВФР-004918 (
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если СокрЛП(Орг.ИНН) = "806000046" И РольДоступна("ОК") Тогда
		ПроверкаДекретчиц();  
	КонецЕсли;
	//Аверсон 15.10.2019 КВВ СВФР-004918 )
	
КонецПроцедуры // ПриНачалеРаботыСистемы()

Процедура ПроверкаДекретчиц()
	//Аверсон 15.10.2019 КВВ СВФР-004918 (
	ТекущаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеРаботниковОрганизаций.Сотрудник,
	|	СостояниеРаботниковОрганизаций.Организация,
	|	СостояниеРаботниковОрганизаций.ПериодЗавершения
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ СостояниеРаботниковОрганизаций.ПериодЗавершения >= &НачалоПериода
	|	И СостояниеРаботниковОрганизаций.ПериодЗавершения <= &ОкончаниеПериода
	|	И СостояниеРаботниковОрганизаций.Организация = &Организация
	|	И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|	 УПОРЯДОЧИТЬ ПО ПериодЗавершения";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(ТекущаяДата - 86400*10));
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонецДня(ТекущаяДата + 86400*10));
	Запрос.УстановитьПараметр("Организация", УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить("По сотруднику " + Выборка.Сотрудник.Наименование + " (ТН " + Выборка.Сотрудник.Код + ") отпуск по уходу за ребенком окончен " + Формат(НачалоДня(Выборка.ПериодЗавершения)-1, "ДФ='дд.ММ.гггг'") + ". Проверьте условия оплаты труда!");
	КонецЦикла;
	//Аверсон 15.10.2019 КВВ СВФР-004918 )
КонецПроцедуры

// Процедура осуществляет проверку на необходимость обмена данными с заданным интервалом
Процедура ПроверкаОбменаДанными() Экспорт

	Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	ОтключитьОбработчикОжидания("ПроверкаОбменаДанными");
	
	// проводим обмен данными
	глЗначениеПеременной("глОбработкаАвтоОбменДанными").ПровестиОбменДанными(); 
		
	ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));

КонецПроцедуры

// процедура служит для поддержки работы регламентных заданий в файловой версии
Процедура ПоддержкаРегламентныхЗаданиеДляФайловойВерсии() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
КонецПроцедуры

Процедура ОповещенияДопПенсияСервернаяБаза() Экспорт 
	//Аверсон 03.11.2022 КВВ СВФР-009612 ( 
	 ТекстПериодовДопПенсии = "
		|ВЫБРАТЬ
		|ИсторияИзмененияУровней.Сотрудник КАК Сотрудник,
		|ИсторияИзмененияУровней.ПроцентРаботника КАК ПроцентРаботника,
		|ИсторияИзмененияУровней.Период КАК Период
		|ПОМЕСТИТЬ ВТУровни
		|ИЗ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник КАК ИсторияИзмененияУровней
		//|ГДЕ ИсторияИзмененияУровней.Период <= &ДатаНачала
		|;
		|ВЫБРАТЬ
		|ВТУровни.Сотрудник КАК Сотрудник,
		|МАКСИМУМ(ВТУровни.Период) КАК Период
		|ПОМЕСТИТЬ ВтМаксимальныеПериод
		|ИЗ ВТУровни КАК ВТУровни
		|СГРУППИРОВАТЬ ПО
		|ВТУровни.Сотрудник
		|;		
		|ВЫБРАТЬ
		|ВТУровни.Сотрудник КАК Сотрудник,
		|ВТУровни1.Период КАК НачалоПериода,
		|МИНИМУМ(ДОБАВИТЬКДАТЕ(ВТУровни.Период, СЕКУНДА, -1)) КАК КонецПериода
		|ПОМЕСТИТЬ ВТПЕРИОДЫ
		|ИЗ ВТУровни КАК ВТУровни
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни1
		|ПО ВТУровни.Сотрудник = ВТУровни1.Сотрудник
		|И ВТУровни.Период > ВТУровни1.Период
		|СГРУППИРОВАТЬ ПО
		|ВТУровни.Сотрудник,
		|ВТУровни1.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|ВтМаксимальныеПериод.Сотрудник,
		|ВтМаксимальныеПериод.Период,
		|ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
		|ИЗ ВтМаксимальныеПериод КАК ВтМаксимальныеПериод
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни1
		|ПО ВтМаксимальныеПериод.Сотрудник = ВТУровни1.Сотрудник
		|И ВтМаксимальныеПериод.Период = ВТУровни1.Период
		|;
		|ВЫБРАТЬ
		|ВТПЕРИОДЫ.Сотрудник КАК Сотрудник,
		|ВТПЕРИОДЫ.НачалоПериода КАК НачалоПериода,
		|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) КАК КонецПериода,
		|ВТУровни.ПроцентРаботника КАК ПроцентРаботника
		|ПОМЕСТИТЬ ВтПериодыДопПенсии
		|ИЗ ВТПЕРИОДЫ КАК ВТПЕРИОДЫ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни
		|ПО ВТПЕРИОДЫ.Сотрудник = ВТУровни.Сотрудник
		|И ВТПЕРИОДЫ.НачалоПериода = ВТУровни.Период
		//|ГДЕ ВТУровни.ПроцентРаботника <> 0
		|;
		|";
		
		СписокСотрудников = Новый СписокЗначений;

		//основные уволенные (
		ЗапросОсновныеУволенные = Новый Запрос;
		ЗапросОсновныеУволенные.Текст = ТекстПериодовДопПенсии + "
		|ВЫБРАТЬ 
		|Работники.Сотрудник,
		|Работники.ТипРаботника,
		|Работники.ПодразделениеОрганизации,
		|КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) КАК ДатаУвольнения
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники   		
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
		|ПО Работники.Сотрудник = ВтПериодыДопПенсии.Сотрудник
		|ГДЕ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)		
		|И Работники.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Постоянный)
		|И НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
		|И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
		|И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) МЕЖДУ ВтПериодыДопПенсии.НачалоПериода И ВтПериодыДопПенсии.КонецПериода		
		|И Работники.Сотрудник.НеОповещатьДопПенсияУволенные = Ложь";
		ЗапросОсновныеУволенные.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
		ЗапросОсновныеУволенные.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
		РезЗЗапросОсновныеУволенные = ЗапросОсновныеУволенные.Выполнить().Выгрузить();
		//основные уволенные )
		
		
		//договора подряда уволенные (
		ЗапросДогПодУволенные = Новый Запрос;
		ЗапросДогПодУволенные.Текст = ТекстПериодовДопПенсии + "
		
		//СВЭЙ 03.10.2023 КВВ СВФР-011551 (
		|ВЫБРАТЬ
		|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник
		|ПОМЕСТИТЬ ВтДействующиеДальшеДогПодряда
		|ИЗ Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
		|ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = ВтПериодыДопПенсии.Сотрудник
		|ГДЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
		|И НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
		|И ДоговорНаВыполнениеРаботСФизЛицом.Ссылка.НеОповещатьДопПенсия = Ложь
		|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) > &ДатаОкончания
		|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) МЕЖДУ ВтПериодыДопПенсии.НачалоПериода И ВтПериодыДопПенсии.КонецПериода
		|И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
		|;
		|
		//СВЭЙ 03.10.2023 КВВ СВФР-011551 )
		
		|ВЫБРАТЬ
		|ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
		|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник
		|ИЗ Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
		|ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = ВтПериодыДопПенсии.Сотрудник
		
		//СВЭЙ 03.10.2023 КВВ СВФР-011551 (
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтДействующиеДальшеДогПодряда
		|ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = ВтДействующиеДальшеДогПодряда.Сотрудник
		//СВЭЙ 03.10.2023 КВВ СВФР-011551 )
		
		|ГДЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
		|И НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
		|И ВтДействующиеДальшеДогПодряда.Сотрудник ЕСТЬ NULL //СВЭЙ 03.10.2023 КВВ СВФР-011551
		|И ДоговорНаВыполнениеРаботСФизЛицом.Ссылка.НеОповещатьДопПенсия = Ложь
		|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
		|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) МЕЖДУ ВтПериодыДопПенсии.НачалоПериода И ВтПериодыДопПенсии.КонецПериода
		|И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
		ЗапросДогПодУволенные.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
		ЗапросДогПодУволенные.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
		РезЗЗапросДогПодУволенные = ЗапросДогПодУволенные.Выполнить().Выгрузить();
		//договора подряда уволенные )		
		
		
		//пересчет (
		ЗапросПересчет = Новый Запрос;
		ЗапросПересчет.Текст = ТекстПериодовДопПенсии + "
		|ВЫБРАТЬ 
		|ОснНУ.Сотрудник
		|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНУ
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
		|ПО ОснНУ.Сотрудник = ВтПериодыДопПенсии.Сотрудник
		|ГДЕ
		|НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
		|И НАЧАЛОПЕРИОДА(ОснНУ.ПериодДействия,МЕСЯЦ) < НАЧАЛОПЕРИОДА(ОснНУ.ПериодРегистрации,МЕСЯЦ)
		|И ОснНУ.Сотрудник.НеОповещатьДопПенсияПересчет = ЛОЖЬ
		|И НАЧАЛОПЕРИОДА(ОснНУ.ПериодРегистрации,МЕСЯЦ) = &ПериодРегистрации
		|СГРУППИРОВАТЬ ПО 
		|ОснНУ.Сотрудник
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ 
		|ДопНУ.Сотрудник
		|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДопНУ
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
		|ПО ДопНУ.Сотрудник = ВтПериодыДопПенсии.Сотрудник
		|ГДЕ
		|НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
		|И НАЧАЛОПЕРИОДА(ДопНУ.БазовыйПериодНачало,МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДопНУ.ПериодРегистрации,МЕСЯЦ)
		|И ДопНУ.Сотрудник.НеОповещатьДопПенсияПересчет = ЛОЖЬ
		|И НАЧАЛОПЕРИОДА(ДопНУ.ПериодРегистрации,МЕСЯЦ) = &ПериодРегистрации
		|СГРУППИРОВАТЬ ПО 
		|ДопНУ.Сотрудник";
		ЗапросПересчет.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
		ЗапросПересчет.УстановитьПараметр("ПериодРегистрации", ?(День(ТекущаяДата())<19,НачалоМесяца(НачалоМесяца(ТекущаяДата())-1),НачалоМесяца(ТекущаяДата())));
		РезЗЗапросПересчет = ЗапросПересчет.Выполнить().Выгрузить();

		//пересчет )
		
		
		Если РезЗЗапросОсновныеУволенные.Количество() > 0 ИЛИ РезЗЗапросДогПодУволенные.Количество() > 0 ИЛИ РезЗЗапросПересчет.Количество() > 0 Тогда
			
			Для Каждого Стр1 ИЗ РезЗЗапросОсновныеУволенные Цикл
				СписокСотрудников.Добавить(Стр1.Сотрудник,1);
			КонецЦикла;
			Для Каждого Стр1 ИЗ РезЗЗапросДогПодУволенные Цикл
				СписокСотрудников.Добавить(Стр1.Сотрудник,2);
			КонецЦикла;	
			Для Каждого Стр1 ИЗ РезЗЗапросПересчет Цикл
				СписокСотрудников.Добавить(Стр1.Сотрудник,3);
			КонецЦикла;
			
			Попытка
				Форма1 = ПолучитьОбщуюФорму("ОповещенияДопПенсия");				
				Форма1.СписокСотрудников = СписокСотрудников;
				Форма1.Открыть();				
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
       //Аверсон 03.11.2022 КВВ СВФР-009612 )
КонецПроцедуры

// Процедура проверяет и при необходимости подключает обработчик ожидания
// на запуск процедуры ПроверитьНапоминания()
//
// Параметры:
//  Нет.
//
Процедура ПроверитьПодключениеОбработчикаОжидания() Экспорт

	ИнтервалПроверкиНапоминанийВСекундах = Константы.ИнтервалПроверкиНапоминанийВСекундах.Получить();
	
	//Аверсон 03.11.2022 КВВ СВФР-009612 (
	Организация_ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	Если Организация_.УчетДополнительнойПенсии
		И НЕ СтрЧислоВхождений(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") Тогда //серверная
		//И ИнтервалПроверкиНапоминанийВСекундах > 0 Тогда  
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ *
		|ИЗ РегистрСведений.ОповещенияДопПенсия КАК РегОпДП
		|ГДЕ
		|НАЧАЛОПЕРИОДА(РегОпДП.Период,ДЕНЬ) <= &ДатаПроверки
		|И РегОпДП.Пользователь = &Пользователь";
		З.УстановитьПараметр("Пользователь",глЗначениеПеременной("глТекущийПользователь"));
		З.УстановитьПараметр("ДатаПроверки",НачалоДня(ТекущаяДата()));
		РезЗ = З.Выполнить().Выгрузить(); 
		Если РезЗ.Количество() > 0 Тогда   
			ИнтервалОповещенияДопПенсии = ?(РезЗ[0].ИнтервалВСек=0,60,РезЗ[0].ИнтервалВСек);
			ПодключитьОбработчикОжидания("ОповещенияДопПенсияСервернаяБаза", ИнтервалОповещенияДопПенсии);  		
			//	УправлениеКонтактами.ОповещенияДопПенсия();
		Иначе
			ОтключитьОбработчикОжидания("ОповещенияДопПенсияСервернаяБаза");			
		КонецЕсли; 		
	Иначе
		ОтключитьОбработчикОжидания("ОповещенияДопПенсияСервернаяБаза");
	КонецЕсли;  	
	//Аверсон 03.11.2022 КВВ СВФР-009612 )
	
	Если глЗначениеПеременной("глТекущийПользователь") <> Неопределено
		 И ТипЗнч(глЗначениеПеременной("глТекущийПользователь")) = Тип("СправочникСсылка.Пользователи")
		 И НЕ глЗначениеПеременной("глТекущийПользователь").Пустая()
		 И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ИспользоватьНапоминания")
		 И ИнтервалПроверкиНапоминанийВСекундах > 0 Тогда
		 
		ПодключитьОбработчикОжидания("ПроверитьНапоминания", ИнтервалПроверкиНапоминанийВСекундах);

		УправлениеКонтактами.ПроверитьНапоминанияПользователя(глЗначениеПеременной("глТекущийПользователь"));

	Иначе

		ОтключитьОбработчикОжидания("ПроверитьНапоминания");

	КонецЕсли; 

КонецПроцедуры

// ПроверитьНапоминанияПользователяКалендарьБухгалтераСобытия
//
Процедура ПроверитьНапоминанияКалендарьБухгалтераСобытия() Экспорт
	РегламентированнаяОтчетность.ПроверитьНапоминанияПользователяКалендарьБухгалтераСобытия(глЗначениеПеременной("глТекущийПользователь"));
КонецПроцедуры // ПроверитьНапоминанияПользователяКалендарьБухгалтераСобытия

// Процедура проверяет, есть ли необходимость выполнять обновление информационной базы.
// Если необходимо - выполняется обновление.
// Если обновление не удалось выполнить - предлагается завершить работу системы.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт

	// Проверка необходимости обновления информационной базы.
	Если НЕ ПустаяСтрока(Метаданные.Версия)
	   И Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда
	    //+ СВЭЙ КДЯ СВФР-004430 07.06.19
		//Предупреждение("Изменился номер версии конфигурации. Будет выполнено обновление информационной базы.");
	    //- СВЭЙ КДЯ СВФР-004430 07.06.19
	    //+ СВЭЙ КДЯ СВФР-004430 07.06.19
		Сообщить("Изменился номер версии конфигурации. Будет выполнено обновление информационной базы.", СтатусСообщения.Внимание);
	    //- СВЭЙ КДЯ СВФР-004430 07.06.19
	Иначе
		Возврат;
	КонецЕсли;

	// Проверка наличия прав для обновления информационной базы.
	Если НЕ ПравоДоступа("МонопольныйРежим", Метаданные) 
	 ИЛИ НЕ ПравоДоступа("Использование",    Метаданные.Обработки.ОбновлениеИнформационнойБазы) 
	 ИЛИ НЕ ПравоДоступа("Просмотр",         Метаданные.Обработки.ОбновлениеИнформационнойБазы) Тогда

		Предупреждение("Недостаточно прав для выполнения обновления. Работа системы будет завершена.");

		ЗавершитьРаботуСистемы();
		Возврат;
	КонецЕсли;

	// Установка монопольного режима для обновления информационной базы.
	Попытка
		УстановитьМонопольныйРежим(Истина);
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
		Предупреждение("Не удалось установить монопольный режим. Работа системы будет завершена.");

		ЗавершитьРаботуСистемы();
		Возврат;
	КонецПопытки;

	// Обновление информационной базы.
	Обработки.ОбновлениеИнформационнойБазы.Создать().ВыполнитьОбновление();

	// Откючение монопольного режима.
	УстановитьМонопольныйРежим(Ложь);

	// Проверка выполнения обновления информационной базы.
	Если Константы.НомерВерсииКонфигурации.Получить() <> Метаданные.Версия Тогда
		Текст = "Не выполнено обновление информационной базы! Завершить работу системы?";
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );

		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗавершитьРаботуСистемы();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  // ВыполнитьОбновлениеИнформационнойБазы

// Процедура подключает внешние компоненты, которые поставляются с конфигурацией.
//
Процедура ПолучитьВнешниеКомпонентыПриНеобходимости()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеКомпоненты.ИмяФайла,
	|	ВнешниеКомпоненты.ДатаИзмененияФайла
	|ИЗ
	|	РегистрСведений.ВнешниеКомпоненты КАК ВнешниеКомпоненты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Файл = Новый Файл(КаталогПрограммы()+ Выборка.ИмяФайла);
		
		Если Не Файл.Существует() Или Не Файл.ПолучитьВремяИзменения() = Выборка.ДатаИзмененияФайла Тогда
			НаборЗаписей = РегистрыСведений.ВнешниеКомпоненты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИмяФайла.Установить(Выборка.ИмяФайла);
			НаборЗаписей.Прочитать();
			
			Попытка
				НаборЗаписей[0].ХранилищеФайла.Получить().Записать(КаталогПрограммы()+ Выборка.ИмяФайла);
				Файл = Новый Файл(КаталогПрограммы()+ Выборка.ИмяФайла);
				Файл.УстановитьВремяИзменения(Выборка.ДатаИзмененияФайла);
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьВнешниеКомпонентыПриНеобходимости()

// Функция возвращает значение экспортных переменных модуля приложенийа
//
// Параметры
//  Имя - строка, содержит имя переменной целиком 
//
// Возвращаемое значение:
//   значение соответствующей экспортной переменной
Функция глЗначениеПеременной(Имя) Экспорт

	Возврат ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры

// функция вызова формы редактирования настройки файла обновления конфигурации
Процедура ОткрытьФормуРедактированияНастройкиФайлаОбновления() Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Константы.НастройкаФайлаОбновленияКонфигурации) Тогда
		
		Предупреждение("Нет прав на чтение данных константы ""Настройка файла обновления конфигурации""", 30, "Настройка файла обновления конфигурации");		
		Возврат;
		
	КонецЕсли;

	ФормаРедактирования = ПолучитьОбщуюФорму("НастройкаФайлаОбновленияКонфигурации");
	ФормаРедактирования.СтруктураПараметров = ПроцедурыОбменаДанными.ПолучитьНастройкиДляФайлаОбновленияКонфигурации(); 
	ФормаРедактирования.Открыть();
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),"ЗапрашиватьПодтверждениеПриЗакрытии") Тогда
		Ответ = Вопрос("Завершить работу с программой?", РежимДиалогаВопрос.ДаНет);
		Отказ = (Ответ = КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// отдельно получаем настройки для которых нужно выполнить обмен при выходе из программы
		ПроцедурыОбменаДанными.ВыполнитьОбменПриЗавершенииРаботыПрограммы(глЗначениеПеременной("глОбработкаАвтоОбменДанными"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

	// Показ финальной дополнительной информации
	Форма = Обработки.ДополнительнаяИнформация.Создать();
	Форма.ВыполнитьДействие();
	//

КонецПроцедуры

Процедура РасчетЗарплатыОрганизацийДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция глПередОткрытиемЭлементаСправочника(прОбъект, прФорма) Экспорт  //Островская Татьяна 20.11.2013 № 16927
	Перем лкВидСтр;
	Попытка
		прФорма.ЭлементыФормы.Код.Доступность = Ложь;
	Исключение
	КонецПопытки;
	лкВидСтр = обТипСтрокой(прОбъект, 2);
	Если прОбъект.ЭтоНовый() Тогда
		Если Не прОбъект.ЭтоГруппа И обСуществуетРеквизит(прОбъект, "Организация") Тогда
			прОбъект.Организация = ОсновнаяОрганизация;
		КонецЕсли;
	КонецЕсли;
	Если прФорма.ЭлементыФормы.Найти("тхтОрганизация") <> Неопределено Тогда
		прФорма.ЭлементыФормы.тхтОрганизация.Заголовок = ?(не ЗначениеЗаполнено(прОбъект.Организация), "<Все организации>", Строка(прОбъект.Организация));
	КонецЕсли;
	//обУстановитьЗаголовокФормыОбъекта(прФорма, прОбъект);
	ИнициализацияКнопкиПечать(прФорма, прОбъект);
	Возврат Истина;
КонецФункции


Функция глПередЗаписьюСправочника(прОбъект) Экспорт  //Островская Татьяна 20.11.2013 № 16927
	Перем Имя, ЕстьВладельцы, ЭтоНовый;
	Имя = прОбъект.Метаданные().Имя;
	ЕстьВладельцы = прОбъект.Метаданные().Владельцы.Количество() <> 0;
	ЭтоНовый = прОбъект.ЭтоНовый();
	Запрос = Новый Запрос("ВЫБРАТЬ Разрешенные
	|	Строки.Наименование
	|ИЗ
	|	Справочник." + Имя + " КАК Строки
	|ГДЕ
	|	Строки.Наименование = &Наименование" + ?(ЕстьВладельцы, " И Строки.Владелец=&Владелец", "") + ?(Не ЭтоНовый, " И Строки.Ссылка<>&Ссылка", ""));

	Запрос.УстановитьПараметр("Наименование", прОбъект.Наименование);
	Запрос.УстановитьПараметр("Владелец", прОбъект.Владелец);
	Запрос.УстановитьПараметр("Ссылка", прОбъект.Ссылка);
	Возврат Запрос.Выполнить().Пустой();
КонецФункции //Островская Татьяна 20.11.2013 № 16927

Процедура ПолныйДействие() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры



АдресРесурсовОбозревателя = "HRMBE"; // Не допускается изменять значение данной переменной
//Островская Татьяна 20.11.2013 № 16927
глФЛ_СписокРедактируемыхФайлов = Новый ТаблицаЗначений;
глФЛ_СписокРедактируемыхФайлов.Колонки.Добавить("ФайлОбъект", Новый ОписаниеТипов("СправочникОбъект.ФЛ_Файлы"));
глФЛ_СписокРедактируемыхФайлов.Колонки.Добавить("ФайлСсылка", Новый ОписаниеТипов("СправочникСсылка.ФЛ_Файлы"));
глФЛ_СписокРедактируемыхФайлов.Колонки.Добавить("Путь", Новый ОписаниеТипов("Строка"));
//Островская Татьяна 20.11.2013 № 16927
