////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//	Название макета печати передается в качестве параметра,
//	по переданному названию находим имя макета в соответствии.
//
// Параметры:
//	НазваниеМакета	- строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	// Получить экземпляр документа на печать
	ИмяФормы = "";
	Если ИмяМакета = "Т6а_от_5_1_2004" Тогда
		ИмяФормы = " (форма Т-6а)";
		ТабДокумент = ПечатьТ6а_2004();
		
	ИначеЕсли ИмяМакета = "Т6_от_5_1_2004" Тогда
		ИмяФормы = " (форма Т-6)";
		ТабДокумент = ПечатьТ6_2004();
	//Островская Татьяна 18.02.2013 № 16243
	ИначеЕсли ИмяМакета = "ЗапискаОбОтпуске" Тогда
		ИмяФормы = " (Записка об отпуске)";
		ТабДокумент = ПечатьЗапискаОбОтпуске();
	//О.Т. Аверсон 01.03.2016 № 926
	ИначеЕсли ИмяМакета = "Приказ" Тогда
		ИмяФормы = " (Приказ о предоставлении отпуска)";
		ТабДокумент = ПечатьПриказОПредоставленииОтпуска();   
	//СВЭЙ СВФР-015992 СОА 12.06.2025 (	
	ИначеЕсли ИмяМакета = "ОтпускБезОплаты" Тогда
		ИмяФормы = " (Приказ о предоставлении отпуска без оплаты)";
		ПечатьПриказОПредоставленииОтпускаБезОплаты();
		//СВЭЙ СВФР-015992 СОА 12.06.2025 )
		//СВЭЙ СВФР-016002 СОА 12.06.2025 (
	ИначеЕсли ИмяМакета = "ТрудовойОтпуск" Тогда
		ИмяФормы = "";
		ПечатьПриказОПредоставленииТрудовогоОтпуска();
		//СВЭЙ СВФР-016002 СОА 12.06.2025 )
	КонецЕсли;
	//О.Т. Аверсон 01.03.2016 № 926
	
	//Островская Татьяна 18.02.2013 № 16243


	Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним + ИмяФормы));

КонецФункции // Печать()

#КонецЕсли

// Заполняет табличную часть документа отпусками по графику отпусков
//
// Параметры
//	ДатаНачала, ДатаОкончания	– даты начала и окончания
//								  просмотра графика отпусков	
//
Процедура Автозаполнение(ДатаНачала, ДатаОкончания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) или НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Сообщить("Не указаны границы периода просмотра графика отпусков!");
		Возврат
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДатаНачала",				ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",			ДатаОкончания);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ГрафикОтпусковОрганизации.Сотрудник КАК Сотрудник,
	|	ГрафикОтпусковОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|	ГрафикОтпусковОрганизации.Период КАК ДатаНачала,
	|	ГрафикОтпусковОрганизации.ДатаОкончания,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный) КАК ПричинаОтсутствия
	|ИЗ
	|	РегистрСведений.ГрафикОтпусковОрганизаций КАК ГрафикОтпусковОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацииСрезПоследних
	|		ГДЕ
	|			ВЫБОР
	|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачала
	|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|				КОНЕЦ = &Организация
	|			И ВЫБОР
	|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачала
	|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			РаботникиОрганизации.Сотрудник
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ГДЕ
	|			РаботникиОрганизации.Организация = &ГоловнаяОрганизация
	|			И РаботникиОрганизации.Период > &ДатаНачала
	|			И РаботникиОрганизации.Период <= &ДатаОкончания
	|			И РаботникиОрганизации.ОбособленноеПодразделение = &Организация
	|			И РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Работники.Сотрудник
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК Работники
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|				ПО ПериодыПерекрытия.Период <= Работники.ПериодЗавершения
	|					И ПериодыПерекрытия.Период > Работники.Период
	|					И ПериодыПерекрытия.Сотрудник = Работники.Сотрудник
	|					И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
	|		ГДЕ
	|			Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			И Работники.Организация = &ГоловнаяОрганизация
	|			И Работники.ОбособленноеПодразделениеЗавершения = &Организация
	|			И Работники.ПериодЗавершения > &ДатаНачала
	|			И Работники.ПериодЗавершения <= &ДатаОкончания
	|			И Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			И ПериодыПерекрытия.Период ЕСТЬ NULL ) КАК РаботникиОрганизации
	|		ПО ГрафикОтпусковОрганизации.Сотрудник = РаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ГрафикОтпусковОрганизации.Организация = &ГоловнаяОрганизация
	|	И ГрафикОтпусковОрганизации.Период <= &ДатаОкончания
	|	И ГрафикОтпусковОрганизации.Период >= &ДатаНачала
	|	И ГрафикОтпусковОрганизации.Состояние = ЗНАЧЕНИЕ(Перечисление.ТипыПериодическихЗадачРаботника.ОтпускЕжегодный)";
	
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение()

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Т6а_от_5_1_2004",	"Форма Т-6а");
	СтруктураМакетов.Вставить("Т6_от_5_1_2004",		"Форма Т-6");
	//Островская Татьяна 18.02.2013 № 16243
	СтруктураМакетов.Вставить("ЗапискаОбОтпуске",		"Записка об отпуске");
	//Островская Татьяна 18.02.2013 № 16243
	СтруктураМакетов.Вставить("Приказ",		"Приказ о предоставлении отпуска");//О.Т. Аверсон 01.03.2016 № 926
	//СВЭЙ СВФР-015992 СОА 12.06.2025 (
	СтруктураМакетов.Вставить("ОтпускБезОплаты", "Отпуск без оплаты");
	//СВЭЙ СВФР-015992 СОА 12.06.2025 ) 
	//СВЭЙ СВФР-016002 СОА 12.06.2025 (
	СтруктураМакетов.Вставить("ТрудовойОтпуск", "Трудовой отпуск"); 
	//СВЭЙ СВФР-016002 СОА 12.06.2025 )
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

#Если Клиент Тогда

// Формирует запрос по документу и связанным регистрам сведений
//
// Параметры: 
//	Режим	- строка, может принимать значения:
//			  "ПоРеквизитамДокумента"
//			  "ПоТабличнойЧастиДокумента"
//
// Возвращаемое значение:
//	Результат запроса с данными об организации или о работниках из табличной части
//
Функция СформироватьЗапросДляПечати(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ТекущийДокумент",	Ссылка);
	Запрос.УстановитьПараметр("Руководитель",		Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",		Дата);

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтпускаОрганизаций.ДатаПриказа КАК ДатаДок,//О.Т. 03.10.2014 № 
		|	ОтпускаОрганизаций.НомерПриказа КАК НомерДок,//О.Т. 03.10.2014 № 
		|	ВЫРАЗИТЬ(ОтпускаОрганизаций.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
		|	ОтпускаОрганизаций.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Представление КАК ДолжностьРуководителя,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтпускаОрганизаций.Организация.Префикс,
		|	ОтпускаОрганизаций.Организация
		|ИЗ
		|	Документ.ОтпускаОрганизаций КАК ОтпускаОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО ОтпускаОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ОтпускаОрганизаций.Ссылка = &ТекущийДокумент";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда

		Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("Праздник",				Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
		Запрос.УстановитьПараметр("ЕжегодныйОтпуск",		Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный);
		
//толик		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ОтпускаОрганизацииРаботники.Сотрудник.Наименование) КАК Работник,
		|	ОтпускаОрганизацииРаботники.ДатаНачала,
		|	ОтпускаОрганизацииРаботники.ДатаОкончания,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОтпускаОрганизацииРаботники.РабочийГодС, ГОД, 1), ДЕНЬ, -1) КАК РабочийГодПо,
		|	ОтпускаОрганизацииРаботники.РабочийГодС,
		|	ОтпускаОрганизацииРаботники.ПричинаОтсутствия,
		|	ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска.Представление,
		|	ВЫБОР
		|		КОГДА ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииНаименование
		|	КОНЕЦ КАК ПодразделениеРаботника_ст,
		|	ВЫБОР
		|		КОГДА ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеОРаботникахОрганизации.ДолжностьЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ДолжностьНаименование
		|	КОНЕЦ КАК Должность_ст,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия <> &ЕжегодныйОтпуск
		|			ТОГДА РАЗНОСТЬДАТ(ОтпускаОрганизацииРаботники.ДатаНачала, ОтпускаОрганизацииРаботники.ДатаОкончания, ДЕНЬ) + 1
		|		ИНАЧЕ СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни)
		|	КОНЕЦ КАК КоличествоДней,
		|	ОтпускаОрганизацииРаботники.НомерСтроки КАК НомерСтроки,
		|	ОтпускаОрганизацииРаботники.Сотрудник.Код КАК ТабельныйНомер,
		|	ОтпускаОрганизацииРаботники.Основной,
		|	ОтпускаОрганизацииРаботники.ЗаВредность,
		|	ОтпускаОрганизацииРаботники.Ненормированный,
		|	ОтпускаОрганизацииРаботники.ЗаКонтракт,
		|	ОтпускаОрганизацииРаботники.ЗаСтаж,
		|	ОтпускаОрганизацииРаботники.Подразделение КАК ПодразделениеРаботника,
		|	ОтпускаОрганизацииРаботники.Должность КАК Должность,
		|	ОтпускаОрганизацииРаботники.КоличествоДнейКомпенсации КАК КолДнейКомпенсации,
		|	ОтпускаОрганизацииРаботники.Сотрудник
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|				&ДатаДокумента,
		|				ФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ОтпускаОрганизацииРаботники.Сотрудник.Физлицо
		|					ИЗ
		|						Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|					ГДЕ
		|						ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент)) КАК ФИОФизЛиц
		|		ПО ОтпускаОрганизацииРаботники.Сотрудник.Физлицо = ФИОФизЛиц.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|			РаботникиОрганизации.Должность.Наименование КАК ДолжностьНаименование,
		|			РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование КАК ПодразделениеОрганизацииЗавершенияНаименование,
		|			РаботникиОрганизации.ДолжностьЗавершения.Наименование КАК ДолжностьЗавершенияНаименование,
		|			РаботникиОрганизации.ПериодЗавершения КАК ПериодЗавершения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизаций
		|					ПО РаботникиВнутри.Период < ОтпускаОрганизаций.ДатаНачала
		|						И РаботникиВнутри.Сотрудник = ОтпускаОрганизаций.Сотрудник
		|			ГДЕ
		|				ОтпускаОрганизаций.Ссылка = &ТекущийДокумент
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиВнутри.Сотрудник) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник
		|					И СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период) КАК ДанныеОРаботникахОрганизации
		|		ПО ОтпускаОрганизацииРаботники.Сотрудник = ДанныеОРаботникахОрганизации.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтпускаОрганизацииРаботники.ДатаНачала И ОтпускаОрганизацииРаботники.ДатаОкончания)
		|ГДЕ
		|	ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаОрганизацииРаботники.ДатаНачала,
		|	ОтпускаОрганизацииРаботники.ДатаОкончания,
		|	ОтпускаОрганизацииРаботники.РабочийГодС,
		|	ОтпускаОрганизацииРаботники.ПричинаОтсутствия,
		|	ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска,
		|	ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска.Представление,
		|	ОтпускаОрганизацииРаботники.НомерСтроки,
		|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ОтпускаОрганизацииРаботники.Сотрудник.Наименование),
		|	ОтпускаОрганизацииРаботники.Сотрудник.Код,
		|	ВЫБОР
		|		КОГДА ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииНаименование
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеОРаботникахОрганизации.ДолжностьЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ДолжностьНаименование
		|	КОНЕЦ,
		|	ОтпускаОрганизацииРаботники.Основной,
		|	ОтпускаОрганизацииРаботники.ЗаВредность,
		|	ОтпускаОрганизацииРаботники.Ненормированный,
		|	ОтпускаОрганизацииРаботники.ЗаКонтракт,
		|	ОтпускаОрганизацииРаботники.ЗаСтаж,
		|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОтпускаОрганизацииРаботники.РабочийГодС, ГОД, 1), ДЕНЬ, -1),
		|	ОтпускаОрганизацииРаботники.Подразделение,
		|	ОтпускаОрганизацииРаботники.Должность,
		|	ОтпускаОрганизацииРаботники.КоличествоДнейКомпенсации,
		|	ОтпускаОрганизацииРаботники.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати()

// Формирует запрос по документу и связанным регистрам сведений
//
// Параметры: 
//  Режим - строка, может принимать значения:
//			"ПоРеквизитамДокумента"
//			"ПоТабличнойЧастиДокумента"
//
// Возвращаемое значение:
//  Результат запроса с данными об организации или о работниках из табличной части
//
Функция СформироватьЗапросДляПечати2004(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	 Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	 Дата);
	Запрос.УстановитьПараметр("ЕжегодныйОтпуск", Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный);
	Запрос.УстановитьПараметр("ПустойОтпуск",	 ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка());

	Если Режим = "ПоРеквизитамДокумента" Тогда

		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтпускаОрганизаций.ДатаПриказа КАК ДатаДок,//О.Т. 03.10.2014 № 
		|	ОтпускаОрганизаций.НомерПриказа КАК НомерДок,//О.Т. 03.10.2014 № 
		|	ВЫРАЗИТЬ(ОтпускаОрганизаций.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
		|	ОтпускаОрганизаций.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Представление КАК ДолжностьРуководителя,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтпускаОрганизаций.Организация.Префикс
		|ИЗ
		|	Документ.ОтпускаОрганизаций КАК ОтпускаОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО ОтпускаОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ОтпускаОрганизаций.Ссылка = &ТекущийДокумент";

	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда

		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("Праздник", Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ОтпускаОрганизацииРаботники.Сотрудник.Наименование) КАК Работник,
		|	ВЫБОР
		|		КОГДА  ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ТОГДА ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ПодразделениеОрганизацииНаименование
		|	КОНЕЦ КАК ПодразделениеРаботника,
 		|	ВЫБОР
		|		КОГДА ДанныеОРаботникахОрганизации.ПериодЗавершения <= ОтпускаОрганизацииРаботники.ДатаНачала
		|				И ДанныеОРаботникахОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ТОГДА ДанныеОРаботникахОрганизации.ДолжностьЗавершенияНаименование
		|		ИНАЧЕ ДанныеОРаботникахОрганизации.ДолжностьНаименование 
		|	КОНЕЦ КАК Должность,
		|	ОтпускаОрганизацииРаботники.НомерСтроки КАК НомерСтроки,
		|	ОтпускаОрганизацииРаботники.ДатаНачала КАК ДатаНачалаВсего,
		|	ОтпускаОрганизацииРаботники.ДатаОкончания КАК ДатаОкончанияВсего,
		|	ОтпускаОрганизацииРаботники.РабочийГодПо,
		|	ОтпускаОрганизацииРаботники.РабочийГодС,
		|	ОтпускаОрганизацииРаботники.ПричинаОтсутствия,
		|	ОтпускаОрганизацииРаботники.Основание,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия = &ЕжегодныйОтпуск
		|			ТОГДА ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска.Наименование
		|		ИНАЧЕ ОтпускаОрганизацииРаботники.ПричинаОтсутствия
		|	КОНЕЦ КАК ВидДопОтпуска,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска <> &ПустойОтпуск
		|			ТОГДА ОтпускаОрганизацииРаботники.ДатаНачалаДоп
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия = &ЕжегодныйОтпуск
		|					ТОГДА """"
		|				ИНАЧЕ ОтпускаОрганизацииРаботники.ДатаНачала
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаСДоп,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия <> &ЕжегодныйОтпуск
		|				ИЛИ ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска <> &ПустойОтпуск
		|			ТОГДА ОтпускаОрганизацииРаботники.ДатаОкончания
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаПоДоп,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия = &ЕжегодныйОтпуск
		|			ТОГДА ВЫБОР
		|					КОГДА ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска = &ПустойОтпуск
		|							ИЛИ ОтпускаОрганизацииРаботники.ДатаНачалаДоп = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ОтпускаОрганизацииРаботники.ДатаНачала
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ОтпускаОрганизацииРаботники.ДатаНачала < ОтпускаОрганизацииРаботники.ДатаНачалаДоп
		|								ТОГДА ОтпускаОрганизацииРаботники.ДатаНачала
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия = &ЕжегодныйОтпуск
		|			ТОГДА ВЫБОР
		|					КОГДА ОтпускаОрганизацииРаботники.ВидДополнительногоОтпуска = &ПустойОтпуск
		|							ИЛИ ОтпускаОрганизацииРаботники.ДатаНачалаДоп = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ОтпускаОрганизацииРаботники.ДатаОкончания
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ОтпускаОрганизацииРаботники.ДатаНачала < ОтпускаОрганизацииРаботники.ДатаНачалаДоп
		|								ТОГДА ДОБАВИТЬКДАТЕ(ОтпускаОрганизацииРаботники.ДатаНачалаДоп, ДЕНЬ, -1)
		|							ИНАЧЕ """"
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия <> &ЕжегодныйОтпуск
		|			ТОГДА РАЗНОСТЬДАТ(ОтпускаОрганизацииРаботники.ДатаНачала, ОтпускаОрганизацииРаботники.ДатаОкончания, ДЕНЬ) + 1
		|		ИНАЧЕ ЕСТЬNULL(КалендарьДнейВсего.КалендарныеДни, 0)
		|	КОНЕЦ КАК ПродолжительностьВсего,
		|	ВЫБОР
		|		КОГДА ОтпускаОрганизацииРаботники.ПричинаОтсутствия <> &ЕжегодныйОтпуск
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(КалендарьОсновногоОтпуска.КалендарныеДни, 0)
		|	КОНЕЦ КАК Продолжительность,
		|	ОтпускаОрганизацииРаботники.Сотрудник.Код КАК ТабельныйНомер,
		|	ОтпускаОрганизацииРаботники.Сотрудник
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|			РаботникиОрганизации.Должность.Наименование КАК ДолжностьНаименование,
		|			СписокДат.НомерСтроки КАК НомерСтроки,
		|			РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование КАК ПодразделениеОрганизацииЗавершенияНаименование,
		|			РаботникиОрганизации.ДолжностьЗавершения.Наименование КАК ДолжностьЗавершенияНаименование,
		|           РаботникиОрганизации.ПериодЗавершения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения,
		|				ОтпускаОрганизаций.НомерСтроки КАК НомерСтроки
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизаций
		|					ПО РаботникиВнутри.Период < ОтпускаОрганизаций.ДатаНачала
		|						И РаботникиВнутри.Сотрудник = ОтпускаОрганизаций.Сотрудник
		|			ГДЕ
		|				ОтпускаОрганизаций.Ссылка = &ТекущийДокумент
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ОтпускаОрганизаций.НомерСтроки,
		|				РаботникиВнутри.Сотрудник) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период
		|					И СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник) КАК ДанныеОРаботникахОрганизации
		|		ПО ОтпускаОрганизацииРаботники.НомерСтроки = ДанныеОРаботникахОрганизации.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтпускаОрганизацииРаботники.НомерСтроки КАК НомерСтроки,
		|			СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни) КАК КалендарныеДни
		|		ИЗ
		|			Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|				ПО (РегламентированныйПроизводственныйКалендарь.ВидДня <> &Праздник)
		|					И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтпускаОрганизацииРаботники.ДатаНачала И ОтпускаОрганизацииРаботники.ДатаОкончания)
		|		ГДЕ
		|			ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОтпускаОрганизацииРаботники.НомерСтроки) КАК КалендарьДнейВсего
		|		ПО ОтпускаОрганизацииРаботники.НомерСтроки = КалендарьДнейВсего.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОтпускаОрганизацииРаботники.НомерСтроки КАК НомерСтроки,
		|			СУММА(РегламентированныйПроизводственныйКалендарь.КалендарныеДни) КАК КалендарныеДни
		|		ИЗ
		|			Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|				ПО (РегламентированныйПроизводственныйКалендарь.ВидДня <> &Праздник)
		|					И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтпускаОрганизацииРаботники.ДатаНачала И ВЫБОР
		|						КОГДА ОтпускаОрганизацииРаботники.ДатаНачалаДоп = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ОтпускаОрганизацииРаботники.ДатаОкончания
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ОтпускаОрганизацииРаботники.ДатаНачалаДоп, ДЕНЬ, -1)
		|					КОНЕЦ)
		|		ГДЕ
		|			ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент
		|			И ОтпускаОрганизацииРаботники.ПричинаОтсутствия = &ЕжегодныйОтпуск
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОтпускаОрганизацииРаботники.НомерСтроки) КАК КалендарьОсновногоОтпуска
		|		ПО ОтпускаОрганизацииРаботники.НомерСтроки = КалендарьОсновногоОтпуска.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&ДатаДокумента,
		|		ФизЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ОтпускаОрганизацииРаботники.Сотрудник.Физлицо
		|			ИЗ
		|				Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацииРаботники
		|			ГДЕ
		|				ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент)) КАК ФИОФизЛиц
		|		ПО ОтпускаОрганизацииРаботники.Сотрудник.Физлицо = ФИОФизЛиц.ФизЛицо
		|ГДЕ
		|	ОтпускаОрганизацииРаботники.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	Иначе
		Возврат Неопределено
	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросДляПечати()

// Функция формирует табличный документ с печатной формой "Т-6а",
//
// Возвращаемое значение:
//	Табличный документ - печатная форма
//
Функция ПечатьТ6а_2004()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_Т6а";

	// получаем данные для печати
	ВыборкаДляШапкиИПодвала = СформироватьЗапросДляПечати2004("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати2004("ПоТабличнойЧастиДокумента").Выбрать();

	// подсчитываем количество страниц документа - для корректного разбиения на страницы
	ВсегоСтрокДокумента = ВыборкаРаботники.Количество();

	// запоминаем области макета
	Макет = ПолучитьМакет("Т6а_от_5_1_2004");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
	ПовторятьПриПечатиСтроки = Макет.ПолучитьОбласть("ПовторятьПриПечати"); // повторяющаяся шапка страницы
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Строка"); // строка работника

	// массив с двумя строками - для разбиения на страницы
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакета);
	
	// выводим данные о руководителях организации
	Если ВыборкаДляШапкиИПодвала.Следующий() Тогда 
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Шапка документа.
 		ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Для подвала
	КонецЕсли;

	// Начинаем формировать выходной документ
	ТабДокумент.Вывести(ОбластьМакетаШапка); // Шапка документа.
	ВыведеноСтрок = 0;

	// выводим строки по работникам
	Пока ВыборкаРаботники.Следующий() Цикл

		// Данные по работнику
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета.Параметры.Продолжительность = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаНачала) И ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончания),ВыборкаРаботники.Продолжительность,"");
		ОбластьМакета.Параметры.ПродолжительностьВсего = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаНачалаВсего) И ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончанияВсего),ВыборкаРаботники.ПродолжительностьВсего,"");
		ОбластьМакета.Параметры.ВидДопОтпуска = Строка(ВыборкаРаботники.ВидДопОтпуска) + ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаПоДоп),"; " + (ВыборкаРаботники.ПродолжительностьВсего - ВыборкаРаботники.Продолжительность)+ " "+ ВыборкаРаботники.Основание,"");

		//уберем из табельного номера префикс
		ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
		
		// разбиение на страницы
		ВыведеноСтрок = ВыведеноСтрок + 1;

		// Проверим, уместится ли строка на странице или надо открывать новую страницу
		ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
			ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		КонецЕсли;
		Если ВывестиПодвалЛиста Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ПовторятьПриПечатиСтроки);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	// если не было ни одного работника - выводим пустой бланк
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакета);
	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
	Для Сч = 1 По ОбластьМакета.Параметры.Количество() Цикл
		ОбластьМакета.Параметры.Установить(Сч - 1,""); 
	КонецЦикла;
	ОбластьМакета.Параметры.Работник = " " + Символы.ПС + " ";
	Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	// выводим предварительно подготовленный Подвал документа.
	ТабДокумент.Вывести(ОбластьМакетаПодвал);

	Возврат ТабДокумент;

КонецФункции // ПечатьТ6а()

// Функция формирует табличный документ с печатной формой "Т-6",
//
// Возвращаемое значение:
//	Табличный документ - печатная форма
//
Функция ПечатьТ6_2004()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_Т6";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки = СформироватьЗапросДляПечати2004("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати2004("ПоТабличнойЧастиДокумента").Выбрать();

	// запоминаем области макета
	Макет = ПолучитьМакет("Т6_от_5_1_2004");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); // Подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Работник"); // строка работника
	ОбластьМакета1 = Макет.ПолучитьОбласть("Работник2"); // строка работника
	ОбластьМакетаТабл = Макет.ПолучитьОбласть("РаботникТабл"); // строка работника
	

	// выводим данные о руководителях организации
	Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
 		ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки); // Для подвала.
		НомерДокДляПечати	= ВыборкаДляШапки.НомерДок;//О.Т. 03.10.2014 № 
	КонецЕсли;

	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		// Шапка документа.
		Если РаботникиОрганизации.Количество() > 1 Тогда
			ОбластьМакетаШапка.Параметры.НомерДок = НомерДокДляПечати + "/" + ВыборкаРаботники.НомерСтроки
		КонецЕсли; 
		ТабДокумент.Вывести(ОбластьМакетаШапка);

		// Данные по работнику.
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета1.Параметры.Заполнить(ВыборкаРаботники);

		//уберем из табельного номера префикс
		ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
		//МассивОснОтпуск = Отпуска.НайтиСтроки(Новый Структура("Сотрудник,РабочийГодС,РабочийГодПо,ВидОтпуска",ВыборкаРаботники.Сотрудник,ВыборкаРаботники.РабочийГодС,ВыборкаРаботники.РабочийГодПо,Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск)); 
		Если ВыборкаРаботники.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный или ВыборкаРаботники.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть
			Тогда 
			Если ВыборкаРаботники.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный Тогда 
				ДатаОтсчета = ВыборкаРаботники.ДатаНачала;
			иначе
				ДатаОтсчета = ВыборкаРаботники.ДатаСДоп;
			КонецЕсли;
			ОснОтпуск = 0;
			МассивОтпуска = Отпуска.НайтиСтроки(Новый Структура("Сотрудник,РабочийГодС,РабочийГодПо",ВыборкаРаботники.Сотрудник,ВыборкаРаботники.РабочийГодС,ВыборкаРаботники.РабочийГодПо)); 
			Для Каждого стрОтпуск из МассивОтпуска Цикл 
				Если стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
					ОснОтпуск = ОснОтпуск + стрОтпуск.КоличествоДней;
					ОбластьМакета.Параметры.Продолжительность = ОснОтпуск;
					ОбластьМакета.Параметры.ДатаНачала = ДатаОтсчета;
					ОбластьМакета.Параметры.ДатаОкончания = ДатаОтсчета + (стрОтпуск.КоличествоДней*86400)-1;
					ДатаОтсчета = ДатаОтсчета + (стрОтпуск.КоличествоДней*86400);
					ТабДокумент.Вывести(ОбластьМакета);
					Прервать;               					
				КонецЕсли;                 				
			КонецЦикла;
			
			СтрокаДопБ = "Б.";

			МассивОтпуска = Отпуска.НайтиСтроки(Новый Структура("Сотрудник,РабочийГодС,РабочийГодПо",ВыборкаРаботники.Сотрудник,ВыборкаРаботники.РабочийГодС,ВыборкаРаботники.РабочийГодПо));
			Для Каждого стрОтпуск из МассивОтпуска Цикл 
				Если  не стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
					 ОбластьМакетаТабл.Параметры.ВидДопОтпуска = "" + Строка(стрОтпуск.ВидОтпуска) + "; " + ВыборкаРаботники.Основание;
					 ОбластьМакетаТабл.Параметры.ПродолжительностьДоп = ?(ОбластьМакетаТабл.Параметры.ПродолжительностьДоп = Неопределено,0,ОбластьМакетаТабл.Параметры.ПродолжительностьДоп) + стрОтпуск.КоличествоДней;
					 ОбластьМакетаТабл.Параметры.ДатаСДоп = ДатаОтсчета;
					 ОбластьМакетаТабл.Параметры.ДатаПоДоп = ДатаОтсчета + (стрОтпуск.КоличествоДней*86400)-1;
					 ДатаОтсчета = ДатаОтсчета + (стрОтпуск.КоличествоДней*86400);
					 ОбластьМакетаТабл.Параметры.Б =СтрокаДопБ;
					 ТабДокумент.Вывести(ОбластьМакетаТабл);
					 СтрокаДопБ = "";
				КонецЕсли;
				
			КонецЦикла;

			Если не СтрокаДопБ = "" Тогда 
				ОбластьМакетаТабл.Параметры.Б =СтрокаДопБ;
				ТабДокумент.Вывести(ОбластьМакетаТабл);
			КонецЕсли;

		иначе
			
			ОбластьМакетаТабл.Параметры.Заполнить(ВыборкаРаботники);
			ОбластьМакета.Параметры.Продолжительность = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаНачала) И ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончания),ВыборкаРаботники.Продолжительность,"");
			ТабДокумент.Вывести(ОбластьМакета);
			ОбластьМакетаТабл.Параметры.ПродолжительностьДоп = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаСДоп) И ЗначениеЗаполнено(ВыборкаРаботники.ДатаПоДоп),ВыборкаРаботники.ПродолжительностьВсего - ВыборкаРаботники.Продолжительность,"");
			ОбластьМакетаТабл.Параметры.ВидДопОтпуска = ?(ЗначениеЗаполнено(ВыборкаРаботники.ВидДопОтпуска),"" + ВыборкаРаботники.ВидДопОтпуска + "; ","") + ВыборкаРаботники.Основание;
			ТабДокумент.Вывести(ОбластьМакетаТабл);
		КонецЕсли;  
		ОбластьМакета1.Параметры.ПродолжительностьВсего = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаНачалаВсего) И ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончанияВсего),ВыборкаРаботники.ПродолжительностьВсего,"");
			

		
		ТабДокумент.Вывести(ОбластьМакета1);

		// Подвал документа.
		
		//Аверсон ЕАЕ 12.03.2025 СВФР-015197
		ДанныеОтветственныеЛица = ПолучитьОтветственныеЛицаОрганизации();
		ОбластьМакетаПодвал.Параметры.ДолжностьРуководителя = СокрЛП(ДанныеОтветственныеЛица.ДолжностьРуководителя);
		ОбластьМакетаПодвал.Параметры.ФИОРуководителя = ОбщегоНазначения.ФамилияИнициалыФизЛица(ДанныеОтветственныеЛица.ФИОРуководителя);
		//Аверсон СВФР-015197
		
		ТабДокумент.Вывести(ОбластьМакетаПодвал);

	КонецЦикла;

	// если не было ни одного работника - выводим пустой бланк
	Если ТабДокумент.ВысотаТаблицы = 0 Тогда
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.Вывести(ОбластьМакетаТабл);
		ТабДокумент.Вывести(ОбластьМакета1);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	КонецЕсли;

	Возврат ТабДокумент;

КонецФункции // ПечатьТ6()

//Аверсон ЕАЕ 12.03.2025 СВФР-015197
Функция ПолучитьОтветственныеЛицаОрганизации()
	ДанныеОтветственныеЛица = Новый Структура;
	ДанныеОтветственныеЛица.Вставить("ДолжностьРуководителя", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	ДанныеОтветственныеЛица.Вставить("ФИОРуководителя", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОрганизацииОтветственныеЛица.Должность КАК ДолжностьРуководителя,
		|	ОрганизацииОтветственныеЛица.Сотрудник КАК ФИОРуководителя,
		|   ОрганизацииОтветственныеЛица.Дата КАК Дата
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.Ссылка = &Организация
		|	И ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
		|   И ОрганизацииОтветственныеЛица.Дата <= &Дата
		|УПОРЯДОЧИТЬ ПО
		|	ОрганизацииОтветственныеЛица.Дата Убыв
		|";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДанныеОтветственныеЛица.ДолжностьРуководителя = ВыборкаДетальныеЗаписи.ДолжностьРуководителя;
		ДанныеОтветственныеЛица.ФИОРуководителя       = ВыборкаДетальныеЗаписи.ФИОРуководителя;
	КонецЕсли;
	
	Возврат ДанныеОтветственныеЛица;
КонецФункции
//Аверсон СВФР-015197

// Функция формирует табличный документ с печатной формой "Т-6а",
//
// Возвращаемое значение:
//	Табличный документ - печатная форма
//
Функция ПечатьТ6а()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_Т6а";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	// получаем данные для печати
	ВыборкаДляШапкиИПодвала = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();

	// подсчитываем количество страниц документа - для корректного разбиения на страницы
	ВсегоСтрокДокумента = ВыборкаРаботники.Количество();

	// запоминаем области макета
	Макет = ПолучитьМакет("Т6а_от_6_4_2001");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
	ПовторятьПриПечатиСтроки = Макет.ПолучитьОбласть("ПовторятьПриПечати"); // повторяющаяся шапка страницы
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Строка"); // строка работника

	// массив с двумя строками - для разбиения на страницы
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакета);
	
	// выводим данные о руководителях организации
	Если ВыборкаДляШапкиИПодвала.Следующий() Тогда 
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Шапка документа.
 		ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Для подвала
	КонецЕсли;

	// Начинаем формировать выходной документ
	ТабДокумент.Вывести(ОбластьМакетаШапка); // Шапка документа.
	ВыведеноСтрок = 0;

	// выводим строки по работникам
	Пока ВыборкаРаботники.Следующий() Цикл

		// Данные по работнику
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета.Параметры.Продолжительность = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончания),ВыборкаРаботники.КоличествоДней,"");
		ОбластьМакета.Параметры.ВидОтпуска = ?(ЗначениеЗаполнено(ВыборкаРаботники.ВидДополнительногоОтпускаПредставление),"Отпуск дополнительный " + ВыборкаРаботники.ВидДополнительногоОтпускаПредставление,ВыборкаРаботники.ПричинаОтсутствия);

		//уберем из табельного номера префикс
		ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
		
		// разбиение на страницы
		ВыведеноСтрок = ВыведеноСтрок + 1;

		// Проверим, уместится ли строка на странице или надо открывать новую страницу
		ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
			ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		КонецЕсли;
		Если ВывестиПодвалЛиста Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ПовторятьПриПечатиСтроки);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла;

	// если не было ни одного работника - выводим пустой бланк
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакета);
	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
	Для Сч = 1 По ОбластьМакета.Параметры.Количество() Цикл
		ОбластьМакета.Параметры.Установить(Сч - 1,""); 
	КонецЦикла;
	ОбластьМакета.Параметры.Работник = " " + Символы.ПС + " ";
	Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	// выводим предварительно подготовленный Подвал документа.
	ТабДокумент.Вывести(ОбластьМакетаПодвал);

	Возврат ТабДокумент;

КонецФункции // ПечатьТ6а()

// Функция формирует табличный документ с печатной формой "Т-6",
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьТ6()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_Т6";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// получаем данные для печати
	ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();

	// запоминаем области макета
	Макет = ПолучитьМакет("Т6_от_6_4_2001");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); // Подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Работник"); // строка работника

	// выводим данные о руководителях организации
	Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
 		ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
		ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки); // Для подвала.
		НомерДокДляПечати	= ВыборкаДляШапки.НомерДок;
	КонецЕсли;

	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл

		// Каждый приказ на отдельной странице.
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		// Шапка документа.
		Если РаботникиОрганизации.Количество() > 1 Тогда
			ОбластьМакетаШапка.Параметры.НомерДок = НомерДокДляПечати + "/" + ВыборкаРаботники.НомерСтроки
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаШапка);

		// Данные по работнику.
		ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
		ОбластьМакета.Параметры.Продолжительность = ?(ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончания),ВыборкаРаботники.КоличествоДней,"");
		ОбластьМакета.Параметры.ВидОтпуска = ?(ЗначениеЗаполнено(ВыборкаРаботники.ВидДополнительногоОтпускаПредставление),"Отпуск дополнительный " + ВыборкаРаботники.ВидДополнительногоОтпускаПредставление,ВыборкаРаботники.ПричинаОтсутствия);
		
		//уберем из табельного номера префикс
		ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
		
		ТабДокумент.Вывести(ОбластьМакета);

		// Подвал документа.
		ТабДокумент.Вывести(ОбластьМакетаПодвал);

	КонецЦикла;

	// если не было ни одного работника - выводим пустой бланк
	Если ТабДокумент.ВысотаТаблицы = 0 Тогда
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	КонецЕсли;

	Возврат ТабДокумент;

КонецФункции // ПечатьТ6()


//Островская Татьяна 18.02.2013 № 16243
Функция ПечатьЗапискаОбОтпуске()
    ПараметрПрописи = "день, дня, дней, м, , , , м, 0";
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_ЗапискаОбОтпуске";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	// получаем данные для печати
	ВыборкаДляШапкиИПодвала = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
    ШапкаДокумента = ВыборкаДляШапкиИПодвала; 
	ШапкаДокумента.Следующий();
	
	ВсегоСтрокДокумента = ВыборкаРаботники.Количество();

	// запоминаем области макета
	Макет = ПолучитьМакет("ЗапискаОбОтпуске");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Заголовок"); // Шапка документа.
	ОбластьОсновойОтпуск = Макет.ПолучитьОбласть("ОбластьОсновнойОтпуск"); // Шапка
	ОбластьМакетаШапка1 = Макет.ПолучитьОбласть("Заголовок1"); // Шапка документа.
	ОбластьМакета = Макет.ПолучитьОбласть("ВидОтпускаСтрока"); // повторяющаяся строка
	ОбластьСоцОтпуск = Макет.ПолучитьОбласть("ОбластьСоцОтпуск");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа


	//// выводим строки по работникам
	Пока ВыборкаРаботники.Следующий() Цикл
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапкиИПодвала); // Шапка документа.
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаРаботники); //О.Т. Аверсон 23.10.2015 № 660
		ОбластьМакетаШапка.Параметры.ДатаДокумента = Формат(ШапкаДокумента.ДатаДок,"ДФ=""дд.ММ.гггг""");
		ОбластьМакетаШапка.Параметры.НомерДокумента = ШапкаДокумента.НомерДок;//О.Т. 03.10.2014 № 
		ОбластьОсновойОтпуск.Параметры.Заполнить(ВыборкаРаботники);
		если ВыборкаРаботники.КоличествоДней >0 Тогда
			ЧислоЗамена = ЧислоПрописью(ВыборкаРаботники.КоличествоДней,"Л = ru_RU; НП = ложь; ДП = Истина",ПараметрПрописи);		
			ОбластьОсновойОтпуск.Параметры.КоличествоДней1 = Строка(ВыборкаРаботники.КоличествоДней) + СтрЗаменить(ЧислоПрописью(ВыборкаРаботники.КоличествоДней,"Л = ru_RU; ДП = Истина",ПараметрПрописи),ЧислоЗамена,"");
		КонецЕсли;
		// Данные по работнику
		
		ЗапросВидОтпуска = Новый Запрос;
		ЗапросВидОтпуска.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаОрганизацийОтпуска.Ссылка,
		|	ОтпускаОрганизацийОтпуска.НомерСтроки,
		|	ОтпускаОрганизацийОтпуска.ВидОтпуска,
		|	ОтпускаОрганизацийОтпуска.КоличествоДней,
		|	ОтпускаОрганизацийОтпуска.Сотрудник
		|ИЗ
		|	Документ.ОтпускаОрганизаций.Отпуска КАК ОтпускаОрганизацийОтпуска
		|ГДЕ
		|	ОтпускаОрганизацийОтпуска.Ссылка = &Ссылка
		|	И ОтпускаОрганизацийОтпуска.Сотрудник = &Сотрудник
		|	И ОтпускаОрганизацийОтпуска.ВидОтпуска = &ВидОтпуска";
		ЗапросВидОтпуска.УстановитьПараметр("Ссылка",Ссылка);
		ЗапросВидОтпуска.УстановитьПараметр("Сотрудник",ВыборкаРаботники.Сотрудник);
		ЗапросВидОтпуска.УстановитьПараметр("ВидОтпуска",Справочники.ВидыЕжегодныхОтпусков.НайтиПоНаименованию("Основной отпуск") );
		РезЗапрос= ЗапросВидОтпуска.Выполнить().Выбрать();
		если  РезЗапрос.Количество()>0 Тогда
			если РезЗапрос.Следующий() Тогда 
				если РезЗапрос.КоличествоДней >0 Тогда
					если РезЗапрос.КоличествоДней >0 Тогда
						ЧислоЗамена = ЧислоПрописью(РезЗапрос.КоличествоДней,"Л = ru_RU; НП = ложь; ДП = Истина",ПараметрПрописи);
						ОбластьОсновойОтпуск.Параметры.КоличествоДней1 = Строка(РезЗапрос.КоличествоДней)+ СтрЗаменить(ЧислоПрописью(РезЗапрос.КоличествоДней,"Л = ru_RU; ДП = Истина",ПараметрПрописи),ЧислоЗамена,"");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ОбластьОсновойОтпуск.Параметры.ЕстьДопОтпуск = "1.2. Дополнительный отпуск:"; 
			ТабДокумент.Вывести(ОбластьМакетаШапка); 
		иначе
			ТабДокумент.Вывести(ОбластьМакетаШапка);			
		КонецЕсли;                 
		если не ВыборкаРаботники.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины Тогда
			ОбластьОсновойОтпуск.Параметры.ДатаНачала = Формат(ВыборкаРаботники.РабочийГодС,"ДФ=""дд.ММ.гггг""");
			ОбластьОсновойОтпуск.Параметры.ДатаОкончания = Формат(ВыборкаРаботники.РабочийГодПо,"ДФ=""дд.ММ.гггг""");
			ТабДокумент.Вывести(ОбластьОсновойОтпуск);
		КонецЕсли;
		
		ЗапросВидОтпуска = Новый Запрос;
		ЗапросВидОтпуска.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаОрганизацийОтпуска.Ссылка,
		|	ОтпускаОрганизацийОтпуска.НомерСтроки,
		|	ОтпускаОрганизацийОтпуска.ВидОтпуска,
		|	ОтпускаОрганизацийОтпуска.КоличествоДней,
		|	ОтпускаОрганизацийОтпуска.Сотрудник
		|ИЗ
		|	Документ.ОтпускаОрганизаций.Отпуска КАК ОтпускаОрганизацийОтпуска
		|ГДЕ
		|	ОтпускаОрганизацийОтпуска.Ссылка = &Ссылка
		|	И ОтпускаОрганизацийОтпуска.Сотрудник = &Сотрудник
		|	И не ОтпускаОрганизацийОтпуска.ВидОтпуска = &ВидОтпуска";
		ЗапросВидОтпуска.УстановитьПараметр("Ссылка",Ссылка);
		ЗапросВидОтпуска.УстановитьПараметр("Сотрудник",ВыборкаРаботники.Сотрудник);
		ЗапросВидОтпуска.УстановитьПараметр("ВидОтпуска",Справочники.ВидыЕжегодныхОтпусков.НайтиПоНаименованию("Основной отпуск") );

		РезЗапрос= ЗапросВидОтпуска.Выполнить().Выбрать();
		
		
		пока РезЗапрос.Следующий() Цикл   
			если РезЗапрос.КоличествоДней >0 Тогда
				ЧислоЗамена = ЧислоПрописью(РезЗапрос.КоличествоДней,"Л = ru_RU; НП = ложь; ДП = Истина",ПараметрПрописи);
				ОбластьМакета.Параметры.ВидОтпуска = Строка(РезЗапрос.ВидОтпуска) + " "+ Строка(РезЗапрос.КоличествоДней) + СтрЗаменить(ЧислоПрописью(РезЗапрос.КоличествоДней,"Л = ru_RU; ДП = Истина",ПараметрПрописи),ЧислоЗамена,"");
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);   
		КонецЦикла;


		если ВыборкаРаботники.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины Тогда 
			
			ОбластьСоцОтпуск.Параметры.Заполнить(ВыборкаРаботники);
			если ВыборкаРаботники.КоличествоДней >0 Тогда 
				ЧислоЗамена = ЧислоПрописью(ВыборкаРаботники.КоличествоДней,"Л = ru_RU; НП = ложь; ДП = Истина",ПараметрПрописи);
				ОбластьСоцОтпуск.Параметры.КоличествоДней = Строка(ВыборкаРаботники.КоличествоДней)+ СтрЗаменить(ЧислоПрописью(ВыборкаРаботники.КоличествоДней,"Л = ru_RU; ДП = Истина",ПараметрПрописи),ЧислоЗамена,"");
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьСоцОтпуск);
		КонецЕсли;
		ОбластьМакетаШапка1.Параметры.ДатаНачала = Формат(ВыборкаРаботники.ДатаНачала,"ДФ=""дд.ММ.гггг""");
		ОбластьМакетаШапка1.Параметры.ДатаОкончания = Формат(ВыборкаРаботники.ДатаОкончания,"ДФ=""дд.ММ.гггг""");
		ТабДокумент.Вывести(ОбластьМакетаШапка1);
		
		ДиректорОрганизации = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизации(ШапкаДокумента.Организация);
		для Каждого стр из ДиректорОрганизации Цикл 
			если стр.Должность = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Директор") Тогда 
				ФИОРуководителяИнициалы = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стр.Сотрудник.ФизЛицо);
				ОбластьМакетаПодвал.Параметры.ФИОРук = ФИОРуководителяИнициалы.ФИО;
				ОбластьМакетаПодвал.Параметры.ДолжностьРук = стр.Должность;
			КонецЕсли;
		КонецЦикла;
		
		РаботникИнициалы = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВыборкаРаботники.Сотрудник.ФизЛицо);
		
		ОбластьМакетаПодвал.Параметры.Работник = РаботникИнициалы.ФИО;

		ТабДокумент.Вывести(ОбластьМакетаПодвал);
	КонецЦикла;
	
	// выводим предварительно подготовленный Подвал документа.
	

	Возврат ТабДокумент;

КонецФункции // ПечатьЗапискаОбОтпуске()
//Островская Татьяна 18.02.2013 № 16243

Функция ПечатьПриказОПредоставленииОтпуска()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// запоминаем области макета
	Макет = ПолучитьМакет("Приказ");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Заголовок"); // Шапка документа
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); // Подвал документа
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка"); // строка работника

	ОбластьМакетаШапка.Параметры.Номер = НомерПриказа;
	ОбластьМакетаШапка.Параметры.Дата = Формат(Дата,"ДЛФ=Д");
	Если РаботникиОрганизации.Количество()>0 Тогда 
		ОбластьМакетаШапка.Параметры.Подразделение = РаботникиОрганизации[0].Подразделение;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
	|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо,
	|	МИНИМУМ(ОтпускаОрганизацийРаботникиОрганизации.РабочийГодС) КАК РабочийГодС,
	|	МАКСИМУМ(ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания) КАК ДатаОкончания,
	|	СУММА(ОтпускаОрганизацийРаботникиОрганизации.КоличествоДней) КАК КоличествоДней,
	|	ОтпускаОрганизацийРаботникиОрганизации.Должность,
	|	МИНИМУМ(ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала) КАК ДатаНачала,
	|	ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
	|ГДЕ
	|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
	|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо,
	|	ОтпускаОрганизацийРаботникиОрганизации.Должность,
	|	ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	стр = Запрос.Выполнить().Выбрать();	
	КолСтрок = 0;
	Пока стр.Следующий() Цикл
		ОбластьМакетаСтрока.Параметры.Должность = стр.Должность;
		ОбластьМакетаСтрока.Параметры.ФИО = стр.ФизЛицо;
		ОбластьМакетаСтрока.Параметры.ТабНомер = стр.ФизЛицо.Код;
		МассивОтпуск = Отпуска.НайтиСтроки(Новый Структура("Сотрудник",стр.Сотрудник));
		ГодПрошл = Дата(1,1,1);
		Для Каждого стрОтпуск из МассивОтпуск Цикл
			Если стрОтпуск.РабочийГодС < ГодПрошл или ГодПрошл = Дата(1,1,1) Тогда 
				ОбластьМакетаСтрока.Параметры.РабочийГодС = Формат(стрОтпуск.РабочийГодС,"ДЛФ=Д");
				ГодПрошл = стрОтпуск.РабочийГодС;
			КонецЕсли;
		КонецЦикла;
		если не ЗначениеЗаполнено(ОбластьМакетаСтрока.Параметры.РабочийГодС) Тогда 
			ОбластьМакетаСтрока.Параметры.РабочийГодС = Формат(стр.РабочийГодС,"ДЛФ=Д");
		КонецЕсли;
		ОбластьМакетаСтрока.Параметры.КалендДни = стр.КоличествоДней;
		ОбластьМакетаСтрока.Параметры.ПериодПо = Формат(стр.ДатаНачала,"ДФ=""дд.ММ""") +"-" +Формат(стр.ДатаОкончания,"ДФ=""дд.ММ""");
		
		МассивОтпуск = Отпуска.НайтиСтроки(Новый Структура("Сотрудник",стр.Сотрудник));
		ОбластьМакетаСтрока.Параметры.Основной = 0;
		ОбластьМакетаСтрока.Параметры.ЗаСтаж = 0;
		ОбластьМакетаСтрока.Параметры.ВредныеУсл = 0;
		ОбластьМакетаСтрока.Параметры.ЗаКонтракт = 0;
		Для Каждого стрОтпуск из МассивОтпуск Цикл
			Если стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда 
				ОбластьМакетаСтрока.Параметры.Основной = стрОтпуск.КоличествоДней;
			КонецЕсли;
			Если стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаСтаж Тогда 
				ОбластьМакетаСтрока.Параметры.ЗаСтаж = стрОтпуск.КоличествоДней;
			КонецЕсли;
			Если стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ВредныеУсловия Тогда 
				ОбластьМакетаСтрока.Параметры.ВредныеУсл = стрОтпуск.КоличествоДней;
			КонецЕсли;
			Если стрОтпуск.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт Тогда 
				ОбластьМакетаСтрока.Параметры.ЗаКонтракт = стрОтпуск.КоличествоДней;
			КонецЕсли;
			
		КонецЦикла;		
		ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КолСтрок = КолСтрок + 1;
		
		
	КонецЦикла;
	ОбластьМакетаПодвал.Параметры.Итог = КолСтрок;
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	
	Возврат ТабДокумент;

КонецФункции // ПечатьТ6()

Процедура ПечатьПриказОПредоставленииОтпускаБезОплаты()
	//СВЭЙ СВФР-015992 СОА 12.06.2025 (
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСлева = 30;
	ТабДокумент.ПолеСправа = 8;
	ТабДокумент.ПолеСверху = 20;
	ТабДокумент.ПолеСнизу = 20;
	ТабДокумент.ОтображатьСетку =Ложь;
	ТабДокумент.ОтображатьЗаголовки =Ложь;
	ТабДокументПодписи = Новый ТабличныйДокумент;
	
	// запоминаем области макета
	Макет = ПолучитьМакет("ОтпускБезОплаты");
	ОбластьМакета = Макет.ПолучитьОбласть("Область1");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодписьРуководителя =  Макет.ПолучитьОбласть("ОбластьПодписьРуководителя");
	ОбластьПодпись =  Макет.ПолучитьОбласть("ОбластьПодпись"); 
	
	// получаем данные для печати 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
		|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
		|	Организации.Наименование,
		|	ОрганизацииОтветственныеЛица.Дата КАК Дата,
		|	ОрганизацииОтветственныеЛица.Должность
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И Организации.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Руководитель = Результат.Сотрудник; 
			ДолжностьРуководителя = Результат.Должность;
		КонецЦикла; 
		ЗапросФИО = Новый Запрос;
			ЗапросФИО.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ФИОФизЛиц.Фамилия,
			|	ФИОФизЛиц.Имя,
			|	ФИОФизЛиц.Отчество,
			|	ФИОФизЛиц.ФизЛицо
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
			|ГДЕ
			|	ФИОФизЛиц.ФизЛицо = &ФизЛицо
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИОФизЛиц.Период УБЫВ";
		Если не Руководитель = Неопределено Тогда 
	
			ЗапросФИО.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
			
			Результат1 = ЗапросФИО.Выполнить().Выбрать();
			Пока Результат1.Следующий() цикл
				Фамилия = Результат1.Фамилия;
				Имя = Лев(Результат1.Имя,1);
				Отчество = Лев(Результат1.Отчество,1);
				ФИО = Имя+"."+Отчество+"."+ " "+Фамилия;
			КонецЦикла;
		КонецЕсли; 
	
	
	ВидАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Организация);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Поле4 КАК Город
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		печГород = "";
	Иначе 
		печГород = РезультатЗапроса.Выгрузить()[0].Город;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
		|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо,
		|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо.Пол КАК Пол,
		|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала,
		|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания,
		|	ОтпускаОрганизацийРаботникиОрганизации.Должность,
		|	ОтпускаОрганизацийРаботникиОрганизации.Основание,
		|	ОтпускаОрганизацийРаботникиОрганизации.КоличествоДней
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|ГДЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка = &Ссылка";
	 Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		ВыводитьНомерСтроки = Ложь;
		НомерСтроки = 1;
		ДатаОзнакомлен = Формат(Дата,"ДЛФ=Д");
	Иначе
		ВыводитьНомерСтроки = Истина;	
		НомерСтроки = 1;
		ДатаОзнакомлен = "____________";
	КонецЕсли;
	ОбластьМакета.Параметры.Организация = Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.НомерПриказа = НомерПриказа;
	ОбластьМакета.Параметры.ДатаПриказа = Формат(Дата,"ДЛФ=Д"); 
	
	ОбластьМакета.Параметры.Город = печГород;	
	ОбластьПодписьРуководителя.Параметры.ФИОРуководителя = ФИО;
	ОбластьПодписьРуководителя.Параметры.ДолжностьРуководителя = ДолжностьРуководителя;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Пока Выборка.Следующий() Цикл
		
	   
		ПолСотрудника = Выборка.Пол;
		Если ПолСотрудника = Перечисления.ПолФизическихЛиц.Женский Тогда
		  ОбластьПодпись.Параметры.ОзнакомленОзнакомлена = "С приказом ознакомлена";
		Иначе	
		  ОбластьПодпись.Параметры.ОзнакомленОзнакомлена = "С приказом ознакомлен";
		КонецЕсли;
		ОбластьСтрока.Параметры.ФИОРаботника = УправлениеОтчетами.CклонятьФИО(глСклонение,Выборка.Сотрудник.Наименование,3,ПолСотрудника,,ложь);
		СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
		Выборка.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
		ОбластьСтрока.Параметры.Продолжительность = СтрокаКалендарныхДней;
		ОбластьСтрока.Параметры.ДатаНач = Формат(Выборка.ДатаНачала,"ДЛФ=Д");
		ОбластьСтрока.Параметры.ДатаКон = Формат(Выборка.ДатаОкончания,"ДЛФ=Д");
		РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Выборка.Должность.Наименование, 3, , Выборка.Должность, 1);
		ОбластьСтрока.Параметры.Должность = РезультатСклоненияДолжность;
		ЗапросФИО.УстановитьПараметр("ФизЛицо",Выборка.ФизЛицо);
		ФИОсотрудника = Выборка.Сотрудник.Наименование;	
		Результат1 = ЗапросФИО.Выполнить().Выбрать();
		Пока Результат1.Следующий() цикл
			Фамилия = Результат1.Фамилия;
			Имя = Лев(Результат1.Имя,1);
			Отчество = Лев(Результат1.Отчество,1);
			ФИОсотрудника = Имя+"."+Отчество+"."+ " "+Фамилия;
		КонецЦикла;
		ОбластьСтрока.Параметры.Основание = Выборка.Основание;
		ОбластьПодпись.Параметры.ФИО =  ФИОсотрудника;
		ОбластьПодпись.Параметры.Дата =ДатаОзнакомлен;
		Если ВыводитьНомерСтроки Тогда
			ОбластьСтрока.Параметры.Номер = Строка(НомерСтроки) + ". ";		
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьСтрока);
		ТабДокументПодписи.Вывести(ОбластьПодпись);
		НомерСтроки = НомерСтроки +1;
	КонецЦикла; 
	ТабДокумент.Вывести(ОбластьПодписьРуководителя);
	ТабДокумент.Вывести(ТабДокументПодписи);
	ТабДокумент.Показать("Приказ о предоставлении отпуска без оплаты");
	//СВЭЙ СВФР-015992 СОА 12.06.2025)
КонецПроцедуры

Процедура ПечатьПриказОПредоставленииТрудовогоОтпуска()
	//СВЭЙ СВФР-016002 СОА 12.06.2025 (
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСлева = 30;
	ТабДокумент.ПолеСправа = 8;
	ТабДокумент.ПолеСверху = 20;
	ТабДокумент.ПолеСнизу = 20;
	ТабДокумент.ОтображатьСетку =Ложь;
	ТабДокумент.ОтображатьЗаголовки =Ложь;
	ТабДокументПодписи = Новый ТабличныйДокумент;
	
	// запоминаем области макета
	Макет = ПолучитьМакет("ТрудовойОтпуск");
	ОбластьМакета = Макет.ПолучитьОбласть("Область1");
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодписьРуководителя =  Макет.ПолучитьОбласть("ОбластьПодписьРуководителя");
	ОбластьПодпись =  Макет.ПолучитьОбласть("ОбластьПодпись");
	
	// получаем данные для печати 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
		|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
		|	Организации.Наименование,
		|	ОрганизацииОтветственныеЛица.Дата КАК Дата,
		|	ОрганизацииОтветственныеЛица.Должность
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И Организации.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Руководитель = Результат.Сотрудник; 
			ДолжностьРуководителя = Результат.Должность;
		КонецЦикла; 
		ЗапросФИО = Новый Запрос;
			ЗапросФИО.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ФИОФизЛиц.Фамилия,
			|	ФИОФизЛиц.Имя,
			|	ФИОФизЛиц.Отчество,
			|	ФИОФизЛиц.ФизЛицо
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
			|ГДЕ
			|	ФИОФизЛиц.ФизЛицо = &ФизЛицо
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФИОФизЛиц.Период УБЫВ";
		Если не Руководитель = Неопределено Тогда 
	
			ЗапросФИО.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
			
			Результат1 = ЗапросФИО.Выполнить().Выбрать();
			Пока Результат1.Следующий() цикл
				Фамилия = Результат1.Фамилия;
				Имя = Лев(Результат1.Имя,1);
				Отчество = Лев(Результат1.Отчество,1);
				ФИО = Имя+"."+Отчество+"."+ " "+Фамилия;
			КонецЦикла;
		КонецЕсли; 
	
	
	ВидАдреса = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Организация);
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид"   , ВидАдреса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Поле4 КАК Город
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		печГород = "";
	Иначе 
		печГород = РезультатЗапроса.Выгрузить()[0].Город;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
		|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо,
		|	ОтпускаОрганизацийРаботникиОрганизации.ФизЛицо.Пол КАК Пол,
		|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала,
		|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания,
		|	ОтпускаОрганизацийРаботникиОрганизации.Должность,
		|	ОтпускаОрганизацийРаботникиОрганизации.КоличествоДней,
		|	ОтпускаОрганизацийРаботникиОрганизации.РабочийГодС,
		|	ОтпускаОрганизацийРаботникиОрганизации.РабочийГодПо,
		|	ОтпускаОрганизацийРаботникиОрганизации.Подразделение
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|ГДЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка = &Ссылка";
	 Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		ВыводитьНомерСтроки = Ложь;
		НомерСтроки = 1;
		ДатаОзнакомлен = Формат(Дата,"ДЛФ=Д");
	Иначе
		ВыводитьНомерСтроки = Истина;	
		НомерСтроки = 1;
		ДатаОзнакомлен = "____________";
	КонецЕсли;
	 
	
	ОбластьМакета.Параметры.Организация = Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.НомерПриказа = НомерПриказа;
	ОбластьМакета.Параметры.ДатаПриказа = Формат(Дата,"ДЛФ=Д"); 
	
	ОбластьМакета.Параметры.Город = печГород;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьПодписьРуководителя.Параметры.ФИОРуководителя = ФИО;
	ОбластьПодписьРуководителя.Параметры.ДолжностьРуководителя = ДолжностьРуководителя;
	
	Пока Выборка.Следующий() Цикл
		
		ПолСотрудника = Выборка.Пол;
		Если ПолСотрудника = Перечисления.ПолФизическихЛиц.Женский Тогда
		  ОбластьПодпись.Параметры.ОзнакомленОзнакомлена = "С приказом ознакомлена";
		Иначе	
		  ОбластьПодпись.Параметры.ОзнакомленОзнакомлена = "С приказом ознакомлен";
		КонецЕсли;
		ОбластьСтрока.Параметры.ФИОРаботника = УправлениеОтчетами.CклонятьФИО(глСклонение,Выборка.Сотрудник.Наименование,3,ПолСотрудника,,ложь);
		СтрокаКалендарныхДней = СтрокаСЧислом("; %1 календарный день;; %1 календарных дня; %1 календарных дней; %1 календарных дня",
		Выборка.КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
		ОбластьСтрока.Параметры.Продолжительность = СтрокаКалендарныхДней;
		ОбластьСтрока.Параметры.ДатаНач = Формат(Выборка.ДатаНачала,"ДЛФ=Д");
		ОбластьСтрока.Параметры.ДатаКон = Формат(Выборка.ДатаОкончания,"ДЛФ=Д");
		РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),Выборка.Должность.Наименование, 3, , Выборка.Должность, 1);
		ОбластьСтрока.Параметры.Должность = РезультатСклоненияДолжность;
		ОбластьСтрока.Параметры.Подразделение =  Выборка.Подразделение;
		ЗапросФИО.УстановитьПараметр("ФизЛицо",Выборка.ФизЛицо);
		ФИОсотрудника = Выборка.Сотрудник.Наименование;	
		Результат1 = ЗапросФИО.Выполнить().Выбрать();
		Пока Результат1.Следующий() цикл
			Фамилия = Результат1.Фамилия;
			Имя = Лев(Результат1.Имя,1);
			Отчество = Лев(Результат1.Отчество,1);
			ФИОсотрудника = Имя+"."+Отчество+"."+ " "+Фамилия;
		КонецЦикла;
		ОбластьСтрока.Параметры.РабочийГодНач =   Формат(Выборка.РабочийГодС,"ДЛФ=Д");
		ОбластьСтрока.Параметры.РабочийГодКон =  Формат(Выборка.РабочийГодПО,"ДЛФ=Д");
		Если ВыводитьНомерСтроки Тогда
			ОбластьСтрока.Параметры.Номер = Строка(НомерСтроки) + ". ";		
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		ОбластьПодпись.Параметры.ФИО =  ФИОсотрудника;
		ОбластьПодпись.Параметры.Дата = ДатаОзнакомлен;
		ТабДокументПодписи.Вывести(ОбластьПодпись);
		НомерСтроки = НомерСтроки +1;
	КонецЦикла; 
	
	ТабДокумент.Вывести(ОбластьПодписьРуководителя);
	ТабДокумент.Вывести(ТабДокументПодписи);
	ТабДокумент.Показать("Приказ о предоставлении трудового отпуска");
	//СВЭЙ СВФР-016002 СОА 12.06.2025 )
КонецПроцедуры

//
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтпускаОрганизаций.Дата,
	|	ОтпускаОрганизаций.Организация,
	|	ОтпускаОрганизаций.Комментарий,
	|	ВЫБОР
	|		КОГДА ОтпускаОрганизаций.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОтпускаОрганизаций.Организация
	|		ИНАЧЕ ОтпускаОрганизаций.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ОтпускаОрганизаций.Ссылка
	|ИЗ
	|	Документ.ОтпускаОрганизаций КАК ОтпускаОрганизаций
	|ГДЕ
	|	ОтпускаОрганизаций.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса. В запросе данные документа дополняются значениями
//	проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	
	//+ СВЭЙ 25.03.19 КДЯ СВФР-004100
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	//|	ТЧРаботникиОрганизации.Сотрудник,
	//|	ТЧРаботникиОрганизации.Сотрудник.Наименование,
	//|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	//|	ТЧРаботникиОрганизации.ДатаНачала,
	//|	ТЧРаботникиОрганизации.ДатаОкончания,
	//|	ТЧРаботникиОрганизации.ДатаНачалаДоп,
	//|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении,
	//|	ТЧРаботникиОрганизации.ОсвобождатьСтавку,
	//|	ТЧРаботникиОрганизации.ВидДополнительногоОтпуска,
	//|	ТЧРаботникиОрганизации.ПричинаОтсутствия,
	//|	ТЧРаботникиОрганизации.КоличествоДней,	
	//|	ТЧРаботникиОрганизации.РабочийГодС,
	//|	ТЧРаботникиОрганизации.РабочийГодПо,
	//|	ВЫБОР
	//|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
	//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
	//|	КОНЕЦ КАК ПодразделениеОрганизации,
	//|	ВЫБОР
	//|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
	//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
	//|	КОНЕЦ КАК Должность,
	//|	ВЫБОР
	//|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
	//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
	//|	КОНЕЦ КАК ЗанимаемыхСтавок,
	//|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	//|	ИмеющиесяСостояния.Состояние КАК КонфликтноеСостояние,
	//|	ИмеющиесяСостояния.Регистратор.Представление КАК КонфликтныйДокумент,
	//|	ВЫБОР
	//|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	//|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение,
	//|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии

	//|ИЗ
	//|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	//|			МАКСИМУМ(Работники.Период) КАК Период
	//|		ИЗ
	//|			Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	//|				ПО Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала
	//|					И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
	//|		ГДЕ
	//|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ТЧРаботникиОрганизации.НомерСтроки) КАК ДатыПоследнихДвиженийРаботников
	//|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДатыПоследнихДвиженийРаботников.НомерСтроки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	//|		ПО ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период
	//|			И ТЧРаботникиОрганизации.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник
	//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	//|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	//|		ИЗ
	//|			Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
	//|				ПО (ТЧРаботникиОрганизации2.Ссылка = &ДокументСсылка)
	//|					И ТЧРаботникиОрганизации.НомерСтроки <> ТЧРаботникиОрганизации2.НомерСтроки
	//|					И ТЧРаботникиОрганизации.ДатаНачала <= ТЧРаботникиОрганизации2.ДатаНачала
	//|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
	//|					И (ВЫБОР
	//|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|							ТОГДА ИСТИНА
	//|						КОГДА (ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	//|							ТОГДА ИСТИНА
	//|						ИНАЧЕ ТЧРаботникиОрганизации.ДатаОкончания >= ТЧРаботникиОрганизации2.ДатаНачала
	//|					КОНЕЦ)
	//|		ГДЕ
	//|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	//|		
	//|		СГРУППИРОВАТЬ ПО
	//|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
	//|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК ИмеющиесяСостояния
	//|		ПО ТЧРаботникиОрганизации.ДатаНачала = ИмеющиесяСостояния.Период
	//|		И (ТЧРаботникиОрганизации.Ссылка <> ИмеющиесяСостояния.Регистратор
	//|					И НЕ ИмеющиесяСостояния.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций) //О.Т. Аверсон 18.02.2019 № 3015
	//|			И ТЧРаботникиОрганизации.Сотрудник = ИмеющиесяСостояния.Сотрудник
	//|ГДЕ
	//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка 
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки";
	//- СВЭЙ 25.03.19 КДЯ СВФР-004100

	//+ СВЭЙ 25.03.19 КДЯ СВФР-004100
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧРаботникиОрганизации.Ссылка,
	|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Сотрудник.Наименование,
	|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|	ТЧРаботникиОрганизации.ДатаНачала,
	|	ТЧРаботникиОрганизации.ДатаОкончания,
	|	ТЧРаботникиОрганизации.ДатаНачалаДоп,
	|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении,
	|	ТЧРаботникиОрганизации.ОсвобождатьСтавку,
	|	ТЧРаботникиОрганизации.ВидДополнительногоОтпуска,
	|	ТЧРаботникиОрганизации.ПричинаОтсутствия,
	|	ТЧРаботникиОрганизации.КоличествоДней,	
	|	ТЧРаботникиОрганизации.РабочийГодС,
	|	ТЧРаботникиОрганизации.РабочийГодПо,
	|	ТЧРаботникиОрганизации.Сотрудник.Организация КАК Организация,
	|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
	|	ПОМЕСТИТЬ ВтСотрудники
	|ИЗ
	|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка 
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.НомерСтроки,
	|	МАКСИМУМ( Состояния.Состояние ) КАК КонфликтноеСостояние,
	|	МАКСИМУМ( Состояния.Регистратор ) КАК КонфликтныйДокумент,
	|   СУММА( РАЗНОСТЬДАТ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаНачала < Состояния.Период 
	|			ТОГДА Состояния.Период	
	|   	ИНАЧЕ Сотрудники.ДатаНачала	
	|   КОНЕЦ , ВЫБОР
	|   	КОГДА Сотрудники.ДатаОкончания > НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) 
	|			ТОГДА НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )	
	|   	ИНАЧЕ Сотрудники.ДатаОкончания	
	|   КОНЕЦ , ДЕНЬ ) + 1 ) КАК ЧислоДиапазонов,
	|   МИНИМУМ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаНачала < Состояния.Период 
	|			ТОГДА Состояния.Период	
	|   	ИНАЧЕ Сотрудники.ДатаНачала	
	|   КОНЕЦ ) КАК ДатаНач,
	|   МАКСИМУМ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаОкончания > НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) 
	|			ТОГДА НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )	
	|   	ИНАЧЕ Сотрудники.ДатаОкончания	
	|   КОНЕЦ ) КАК ДатаКон
	//|   1 КАК ЧислоДиапазонов,
	//|	Состояния.Состояние КАК КонфликтноеСостояние,
	//|	Состояния.Регистратор КАК КонфликтныйДокумент,
	//|   ВЫБОР
	//|   	КОГДА Сотрудники.ДатаНачала < Состояния.Период 
	//|			ТОГДА Состояния.Период	
	//|   	ИНАЧЕ Сотрудники.ДатаНачала	
	//|   КОНЕЦ КАК ДатаНач,
	//|   ВЫБОР
	//|   	КОГДА Сотрудники.ДатаОкончания > НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) 
	//|			ТОГДА НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )	
	//|   	ИНАЧЕ Сотрудники.ДатаОкончания	
	//|   КОНЕЦ КАК ДатаКон,
	//|	Состояния.Период КАК Период,	
	//|	НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) КАК ПериодЗавершения,	
	//|  	Сотрудники.ДатаНачала,	
	//|   Сотрудники.ДатаОкончания	
	|
	| 	ПОМЕСТИТЬ ВтДиапазоныНеРаботы
	|ИЗ
	|   ВтСотрудники КАК Сотрудники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
	|		ПО Сотрудники.Сотрудник = Состояния.Сотрудник
	|          И ( Сотрудники.Ссылка <> Состояния.Регистратор
	|				И НЕ Состояния.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций ) //О.Т. Аверсон 18.02.2019 № 3015
	|		   И ( 
	|				Сотрудники.ДатаНачала <= Состояния.Период И Сотрудники.ДатаОкончания >= Состояния.Период
	|				ИЛИ Сотрудники.ДатаНачала <= НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )
	|					И Сотрудники.ДатаОкончания >= НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )
	|		     ) 
	|		   И Состояния.Период <= НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ) ) 
	|		   И Состояния.Состояние <> ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.Работает ) 
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.НомерСтроки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.НомерСтроки,
	|   СУММА( РАЗНОСТЬДАТ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаНачала < Состояния.Период 
	|			ТОГДА Состояния.Период	
	|   	ИНАЧЕ Сотрудники.ДатаНачала	
	|   КОНЕЦ , ВЫБОР
	|   	КОГДА Сотрудники.ДатаОкончания > НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) 
	|			ТОГДА НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )	
	|   	ИНАЧЕ Сотрудники.ДатаОкончания	
	|   КОНЕЦ , ДЕНЬ ) + 1 ) КАК ЧислоДиапазонов,
	|   МИНИМУМ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаНачала < Состояния.Период 
	|			ТОГДА Состояния.Период	
	|   	ИНАЧЕ Сотрудники.ДатаНачала	
	|   КОНЕЦ ) КАК ДатаНач,
	|   МАКСИМУМ( ВЫБОР
	|   	КОГДА Сотрудники.ДатаОкончания > НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ ) 
	|			ТОГДА НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ), ДЕНЬ )	
	|   	ИНАЧЕ Сотрудники.ДатаОкончания	
	|   КОНЕЦ ) КАК ДатаКон
	|
	| 	ПОМЕСТИТЬ ВтДиапазоныРаботы
	|ИЗ
	|   ВтСотрудники КАК Сотрудники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
	|		ПО Сотрудники.Сотрудник = Состояния.Сотрудник
	|          И ( Сотрудники.Ссылка <> Состояния.Регистратор
	|				И НЕ Состояния.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций ) //О.Т. Аверсон 18.02.2019 № 3015
	|		   И ( 
	|				Сотрудники.ДатаНачала <= Состояния.Период И Сотрудники.ДатаОкончания >= Состояния.Период
	
	//Аверсон ЕАЕ 21.10.2024 СВФР-013965
	//|				ИЛИ Сотрудники.ДатаНачала <= Состояния.ПериодЗавершения И Сотрудники.ДатаОкончания >= Состояния.ПериодЗавершения
	|				ИЛИ Сотрудники.ДатаНачала <= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Состояния.ПериодЗавершения,ДЕНЬ,-1)) И 
	|                   Сотрудники.ДатаОкончания >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Состояния.ПериодЗавершения,ДЕНЬ,-1))
	//Аверсон СВФР-013965
	
	|		     ) 
	|		   И Состояния.Период <= НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( Состояния.ПериодЗавершения, ДЕНЬ, - 1 ) ) 
	|		   И Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.Работает ) 
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.НомерСтроки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДиапазоныНеРаботы.НомерСтроки,
	|	ДиапазоныНеРаботы.КонфликтноеСостояние,
	|	ДиапазоныНеРаботы.КонфликтныйДокумент.Представление КАК КонфликтныйДокумент
	|
	| 	ПОМЕСТИТЬ ВтКонфликтующиеДиапазоны
	|ИЗ
	|   ВтДиапазоныНеРаботы КАК ДиапазоныНеРаботы	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтДиапазоныРаботы КАК ДиапазоныРаботы
	|		ПО ДиапазоныНеРаботы.НомерСтроки = ДиапазоныРаботы.НомерСтроки
	|ГДЕ
	|	ДиапазоныРаботы.НомерСтроки IS NULL
	|	ИЛИ
	|	НЕ ДиапазоныРаботы.НомерСтроки IS NULL
	|	И (
	|	ДиапазоныРаботы.ДатаНач > ДиапазоныНеРаботы.ДатаНач
	|	ИЛИ
	|	ДиапазоныРаботы.ДатаКон < ДиапазоныНеРаботы.ДатаКон
	|	ИЛИ
	|	ДиапазоныРаботы.ЧислоДиапазонов < ДиапазоныНеРаботы.ЧислоДиапазонов
	|   )
	|;
	|
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Сотрудник.Наименование,
	|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|	ТЧРаботникиОрганизации.ДатаНачала,
	|	ТЧРаботникиОрганизации.ДатаОкончания,
	|	ТЧРаботникиОрганизации.ДатаНачалаДоп,
	|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении,
	|	ТЧРаботникиОрганизации.ОсвобождатьСтавку,
	|	ТЧРаботникиОрганизации.ВидДополнительногоОтпуска,
	|	ТЧРаботникиОрганизации.ПричинаОтсутствия,
	|	ТЧРаботникиОрганизации.КоличествоДней,	
	|	ТЧРаботникиОрганизации.РабочийГодС,
	|	ТЧРаботникиОрганизации.РабочийГодПо,
	|	ВЫБОР
	|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
	|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА  ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
	|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	|	КонфликтующиеДиапазоны.КонфликтноеСостояние,
	|	КонфликтующиеДиапазоны.КонфликтныйДокумент,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение,
	|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
	|
	|ИЗ
	|	ВтСотрудники КАК ТЧРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|			МАКСИМУМ(Работники.Период) КАК Период
	|		ИЗ
	|			ВтСотрудники КАК ТЧРаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|				ПО Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала
	|					И Работники.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизации.НомерСтроки) КАК ДатыПоследнихДвиженийРаботников
	|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДатыПоследнихДвиженийРаботников.НомерСтроки
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|		ПО ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период
	|			И ДанныеПоРаботникуДоНазначения.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			ВтСотрудники КАК ТЧРаботникиОрганизации
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК ТЧРаботникиОрганизации2
	|				ПО 
	|					ТЧРаботникиОрганизации.НомерСтроки <> ТЧРаботникиОрганизации2.НомерСтроки
	|					И ТЧРаботникиОрганизации.ДатаНачала <= ТЧРаботникиОрганизации2.ДатаНачала
	|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
	|					И (ВЫБОР
	|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ИСТИНА
	|						КОГДА (ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ТЧРаботникиОрганизации.ДатаОкончания >= ТЧРаботникиОрганизации2.ДатаНачала
	|					КОНЕЦ)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
	|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКонфликтующиеДиапазоны КАК КонфликтующиеДиапазоны
	|		ПО ТЧРаботникиОрганизации.НомерСтроки = КонфликтующиеДиапазоны.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	//- СВЭЙ 25.03.19 КДЯ СВФР-004100
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Возврат Результат;

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()
// островская
Функция СформироватьЗапросПоРаботникиОрганизацииОтпуска(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	//Островская Татьяна 11.03.2014 № 17188
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ТЧРаботникиОрганизации.Сотрудник,
	//|	ТЧРаботникиОрганизации.ДатаНачала,
	//|	ТЧРаботникиОрганизации.ДатаОкончания,
	//|	ОтпускаОрганизацийОтпуска.ВидОтпуска,
	//|	ОтпускаОрганизацийОтпуска.КоличествоДней,
	//|	ТЧРаботникиОрганизации.РабочийГодС,
	//|	ТЧРаботникиОрганизации.РабочийГодПо,
	//|	ТЧРаботникиОрганизации.РабочийГодСНов,
	//|	ТЧРаботникиОрганизации.РабочийГодПоНов,
	//|	ОтпускаОрганизацийОтпуска.РабочийГодС КАК РабочийГодСОтпуск,
	//|	ОтпускаОрганизацийОтпуска.РабочийГодПо КАК РабочийГодПоОтпуск,
	//|	ОтпускаОрганизацийОтпуска.РабочийГодСНов КАК РабочийГодСНовОтпуск,
	//|	ОтпускаОрганизацийОтпуска.РабочийГодПоНов КАК РабочийГодПоНовОтпуск
	//|ИЗ
	//|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.Отпуска КАК ОтпускаОрганизацийОтпуска
	//|		ПО ТЧРаботникиОрганизации.Сотрудник = ОтпускаОрганизацийОтпуска.Сотрудник
	//|			И ТЧРаботникиОрганизации.Ссылка = ОтпускаОрганизацийОтпуска.Ссылка
	//|			И ТЧРаботникиОрганизации.РабочийГодС = ОтпускаОрганизацийОтпуска.РабочийГодС
	//|			И ТЧРаботникиОрганизации.РабочийГодПо = ОтпускаОрганизацийОтпуска.РабочийГодПо
	//|ГДЕ
	//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
	//Островская Татьяна 11.03.2014 № 17188	
	
	//О.Т. Аверсон 19.01.2018 № 1460
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтпускаОрганизацийОтпуска.Сотрудник,
	|	ОтпускаОрганизацийОтпуска.ВидОтпуска,
	|	ОтпускаОрганизацийОтпуска.КоличествоДней,
	|	ОтпускаОрганизацийОтпуска.РабочийГодС КАК РабочийГодСОтпуск,
	|	ОтпускаОрганизацийОтпуска.РабочийГодПо КАК РабочийГодПоОтпуск,
	|	ОтпускаОрганизацийОтпуска.РабочийГодСНов КАК РабочийГодСНовОтпуск,
	|	ОтпускаОрганизацийОтпуска.РабочийГодПоНов КАК РабочийГодПоНовОтпуск
	|ИЗ
	|	Документ.ОтпускаОрганизаций.Отпуска КАК ОтпускаОрганизацийОтпуска
	|ГДЕ
	|	ОтпускаОрганизацийОтпуска.Ссылка = &ДокументСсылка";
	//О.Т. Аверсон 19.01.2018 № 1460
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	// Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, работники которой отправляются в отпуск!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка
//								  из результата запроса по работникам,
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";

	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;

	// ДатаНачала
	НетДатыНачала = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала);
	Если НетДатыНачала Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала отпуска!", Отказ, Заголовок);
	КонецЕсли;

	// Причина отсутствия
	НетВидаОтпуска = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПричинаОтсутствия);
	Если НетВидаОтпуска Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид отпуска!", Отказ, Заголовок);
	Иначе
		ПричинаОтсутствия = ВыборкаПоСтрокамДокумента.ПричинаОтсутствия;
		Если ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный 
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебныйНеоплачиваемый
			//Островская Татьяна 13.02.2014 № 17105
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.БольничныйПоБеременностиИРодам
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком
			//Островская Татьяна 13.02.2014 № 17105
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоКоллДоговору
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоИнициативеНанимателя //Аверсон 11.05.2020 КВВ СВФР-005970
			//Аверсон 22.03.2021 КВВ СВФР-007331 (
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоСостояниюЗдоровья
			и ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСамоизоляция 
			//Аверсон 22.03.2021 КВВ СВФР-007331 )
			
			и ?(Организация.ИНН = "806000046", ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСоциальныйПоБолезни, Истина) //Аверсон ЕАЕ 17.04.2024 СВФР-012781
			
			Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "вместо отпуска указана иная причина отсутствия!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	Если НетСотрудника ИЛИ НетДатыНачала ИЛИ НетВидаОтпуска Тогда
		Возврат;
	КонецЕсли;

	Если  ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) и ВыборкаПоСтрокамДокумента.ДатаНачала > ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала отпуска не может превышать дату окончания отпуска!", Отказ, Заголовок);
	КонецЕсли;

	//Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидДополнительногоОтпуска) 
	//	И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачалаДоп)
	//	И (ВыборкаПоСтрокамДокумента.ДатаНачалаДоп > ВыборкаПоСтрокамДокумента.ДатаОкончания Или ВыборкаПоСтрокамДокумента.ДатаНачалаДоп < ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "неверно указана дата начала дополнительного отпуска!", Отказ, Заголовок);
	//КонецЕсли;
		
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
		
	// Проверка: ранее работник должен быть принят на работу
	Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = NULL Тогда
		СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " еще не принят на работу!";
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке, Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = 0 Тогда	
		СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен!";
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке, Отказ, Заголовок);
	КонецЕсли; 

	// Проверка: противоречие другой строке документа
	Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
		СтрокаСообщениеОбОшибке = "период отпуска пересекается с периодом строки " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка: в регистре уже есть такое движение
	Если ВыборкаПоСтрокамДокумента.КонфликтноеСостояние <> NULL Тогда
		Если НЕ Организация.ИНН = "100092167" Тогда //Аверсон 23.01.2020 КВВ СВФР-005034 
			СтрокаСообщениеОбОшибке = "работник уже переведен в состояние """ + ВыборкаПоСтрокамДокумента.КонфликтноеСостояние + """ документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа,
//	ВыборкаПоРаботникиОрганизации
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Мин)
	
	Если ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия <> Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация Тогда
		Причина = ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия;
		
		// движения по дате "с"
		Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();
		
		// Свойства
		Движение.Период			= ВыборкаПоРаботникиОрганизации.ДатаНачала;
		
		// Измерения
		Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
		Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		// здесь принято следующее соглашение - на каждую причину отсутствия обязательно есть одноименное состояние работника
		Движение.Состояние = Перечисления.СостоянияРаботникаОрганизации[Причина.Метаданные().ЗначенияПеречисления[Перечисления[Причина.Метаданные().Имя].Индекс(Причина)].Имя];
		
		Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаОкончания) Тогда
			// Свойства
			Движение.ПериодЗавершения = ВыборкаПоРаботникиОрганизации.ДатаОкончания + мДлинаСуток;
			// Ресурсы
			Движение.СостояниеЗавершения = Перечисления.СостоянияРаботникаОрганизации.Работает;
			
			Если ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
				
				Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
				
				// Свойства
				Движение.Период				= ВыборкаПоРаботникиОрганизации.ДатаОкончания + мДлинаСуток;
				
				// Измерения
				Движение.Сотрудник			= ВыборкаПоРаботникиОрганизации.Сотрудник;
				Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
				Движение.ДатаИзменения		= ВыборкаПоРаботникиОрганизации.ДатаОкончания + мДлинаСуток;
				// здесь принято следующее соглашение - на каждую причину отсутствия обязательно есть одноименное планируемое изменение работника
				Движение.ПланируемоеСобытие	= Перечисления.НамеченныеСобытияПоПерсоналу[Причина.Метаданные().ЗначенияПеречисления[Перечисления[Причина.Метаданные().Имя].Индекс(Причина)].Имя];
				
				// Реквизиты
				Движение.ЗанимаемыхСтавок	= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок;
				Движение.ЗаниматьСтавку		= ВыборкаПоРаботникиОрганизации.ОсвобождатьСтавку;
				Движение.НеНапоминатьОСобытии = ВыборкаПоРаботникиОрганизации.НеНапоминатьОСобытии;
			КонецЕсли;
			
		КонецЕсли;
		
		//добавим движение в регистр ПериодыСостоянийРаботниковОрганизаций
		Движение = Движения.ПериодыСостоянийРаботниковОрганизаций.Добавить();
		
		// Измерения
		Движение.Сотрудник			= ВыборкаПоРаботникиОрганизации.Сотрудник;
		Движение.ДатаНачала			= ВыборкаПоРаботникиОрганизации.ДатаНачала;
		Если ВыборкаПоРаботникиОрганизации.ДатаОкончания <> '0001-01-01' И
			НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
			Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаОкончания + мДлинаСуток;
		КонецЕсли;
	КонецЕсли;	
	
	// заявка №1585 (база заявок Кристалла) Дмитрук О.Г.
	//добавим движение в регистр ОтпускаФактическиеПоСотрудникам
	Движение = Движения.ОтпускаФактическиеПоСотрудникам.Добавить();
	
	// Свойства
	Движение.Период			= ВыборкаПоШапкеДокумента.Дата + Мин * 60;
	
	// Измерения
	Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
	Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	// Ресурсы
	Движение.Состояние = ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия;
	Движение.НачалоОтпуска	= ВыборкаПоРаботникиОрганизации.ДатаНачала;
	Движение.ОкончаниеОтпуска	= ВыборкаПоРаботникиОрганизации.ДатаОкончания;
	Движение.КоличествоДней	= ВыборкаПоРаботникиОрганизации.КоличествоДней;
	
	//СВЭЙ 08.02.2024 КВВ СВФР-012300 (
	Если ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный 
		ИЛИ ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть 
		ИЛИ ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация Тогда
		//СВЭЙ 08.02.2024 КВВ СВФР-012300 )
		
		Движение.РабочийПериодС	= ВыборкаПоРаботникиОрганизации.РабочийГодС;
		Движение.РабочийПериодПо = ВыборкаПоРаботникиОрганизации.РабочийГодПо;
	КонецЕсли;

	Движение.Комментарий    = ВыборкаПоШапкеДокумента.Комментарий;

    //заявка №1585
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа
//	ВыборкаПоРаботникиОрганизации
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)

	Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
	
	// Свойства
	Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
	Движение.Период							= ВыборкаПоРаботникиОрганизации.ДатаНачала;

	// Измерения
	Движение.ПодразделениеОрганизации		= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
	Движение.Должность						= ВыборкаПоРаботникиОрганизации.Должность;
	
	Движение.УсловияТрудаИзмерение = ВыборкаПоРаботникиОрганизации.УсловияТрудаИзмерение;

	// Ресурсы
	Движение.КоличествоСтавок				= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок; 

	Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаОкончания) и НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда

		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();

		// Свойства
		Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаОкончания + мДлинаСуток;
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
		Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
		
		Движение.УсловияТрудаИзмерение = ВыборкаПоРаботникиОрганизации.УсловияТрудаИзмерение;

		// Ресурсы
		Движение.КоличествоСтавок			= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
		
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда
			ВыборкаПоРаботникиОрганизации = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			// островская
			ВыборкаПоРаботникиОрганизацииОтпуска = СформироватьЗапросПоРаботникиОрганизацииОтпуска(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Мин = 1;
			Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Мин);
					
					Если ВыборкаПоРаботникиОрганизации.ОсвобождатьСтавку Тогда
						ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации);
						
					КонецЕсли;
					Пока ВыборкаПоРаботникиОрганизацииОтпуска.Следующий() Цикл
						ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоРаботникиОрганизацииОтпуска,ВыборкаПоШапкеДокумента);//Островская Татьяна 19.12.2013 № 16975
					КонецЦикла;
					Мин = Мин + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон ЕАЕ 15.10.2021 СВФР-008217
	Если Организация.ИНН = "700067572" Тогда
		ПроверкаДнейОтпуска(Отказ);
	КонецЕсли;
	//Аверсон СВФР-008217
	
	//Аверсон ЕАЕ 29.10.2024 СВФР-014052
	//Стравита
	Если Организация.ИНН = "806000046" Тогда
		ПроверкаДнейСоцОтпуска(Отказ);
	КонецЕсли;
	//Аверсон СВФР-014052
	
КонецПроцедуры // ОбработкаПроведения()

//Аверсон ЕАЕ 15.10.2021 СВФР-008217
Процедура ПроверкаДнейОтпуска(Отказ)
	СтруктураОтбора = Новый Структура("ПричинаОтсутствия", Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный);
	МассивСтрок = РаботникиОрганизации.НайтиСтроки(СтруктураОтбора);
	ТЗРаботники = РаботникиОрганизации.Выгрузить(МассивСтрок, "Сотрудник,КоличествоДней");
	
	СтруктураОтбораЧасть = Новый Структура("ПричинаОтсутствия", Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть);
	МассивСтрокЧасть = РаботникиОрганизации.НайтиСтроки(СтруктураОтбораЧасть);
	Для Каждого Эл Из МассивСтрокЧасть Цикл
		НоваяСтр = ТЗРаботники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Эл);
	КонецЦикла;
	ТЗРаботники.Свернуть("Сотрудник", "КоличествоДней");
	
	ТЗОтпуска = Отпуска.Выгрузить(, "Сотрудник,КоличествоДней");
	ТЗОтпуска.Свернуть("Сотрудник", "КоличествоДней");
	ТЗОтпуска.Колонки.Добавить("Проверено", Новый ОписаниеТипов("Булево"));
	ТЗОтпуска.ЗаполнитьЗначения(Ложь, "Проверено");
	
	Для Каждого СтрРаботники Из ТЗРаботники Цикл
		СтрОтпуска = ТЗОтпуска.Найти(СтрРаботники.Сотрудник, "Сотрудник");
		
		Если СтрОтпуска = Неопределено Тогда
			Сообщить("В ТЧ Виды отпусков и в ТЧ Работники организаций по сотруднику " + СокрЛП(СтрРаботники.Сотрудник) + " не совпадает количество дней отпуска.");
			Отказ = Истина;
			Прервать;	
		КонецЕсли;
		
		Если СтрРаботники.КоличествоДней <> СтрОтпуска.КоличествоДней Тогда
			Сообщить("В ТЧ Виды отпусков и в ТЧ Работники организаций по сотруднику " + СокрЛП(СтрРаботники.Сотрудник) + " не совпадает количество дней отпуска.");
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
		СтрОтпуска.Проверено = Истина;
	КонецЦикла;
	
	Если Не Отказ Тогда
		СтрОтпускаНеПроверено = ТЗОтпуска.Найти(Ложь, "Проверено");
		Если СтрОтпускаНеПроверено <> Неопределено Тогда
			Сообщить("В ТЧ Виды отпусков и в ТЧ Работники организаций по сотруднику " + СокрЛП(СтрОтпускаНеПроверено.Сотрудник) + " не совпадает количество дней отпуска.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Аверсон СВФР-008217

//Аверсон ЕАЕ 29.10.2024 СВФР-014052
Процедура ПроверкаДнейСоцОтпуска(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
		|	ОтпускаОрганизацийРаботникиОрганизации.ПричинаОтсутствия,
		|	СУММА(ОтпускаОрганизацийРаботникиОрганизации.КоличествоДней) КАК КоличествоДней
		|ПОМЕСТИТЬ ВТСотрудникиССоцОтпуском
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|ГДЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Ссылка = &Ссылка
		|	И ОтпускаОрганизацийРаботникиОрганизации.ПричинаОтсутствия = &Состояние
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
		|	ОтпускаОрганизацийРаботникиОрганизации.ПричинаОтсутствия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтпускаФактическиеПоСотрудникам.Сотрудник,
		|	СУММА(ОтпускаФактическиеПоСотрудникам.КоличествоДней) КАК КоличествоДней
		|ПОМЕСТИТЬ ВТКоличествоДнейСоцОтпуска
		|ИЗ
		|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
		|ГДЕ
		|	ОтпускаФактическиеПоСотрудникам.Состояние = &Состояние
		|	И ОтпускаФактическиеПоСотрудникам.Сотрудник В
		|			(ВЫБРАТЬ
		|				ВТСотрудникиССоцОтпуском.Сотрудник
		|			ИЗ
		|				ВТСотрудникиССоцОтпуском)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаФактическиеПоСотрудникам.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиССоцОтпуском.Сотрудник,
		|	ВТСотрудникиССоцОтпуском.КоличествоДней КАК КоличествоДнейИзДокумента,
		|	ЕСТЬNULL(ВТКоличествоДнейСоцОтпуска.КоличествоДней,0) КАК КоличествоДнейРанее
		|ИЗ
		|	ВТСотрудникиССоцОтпуском КАК ВТСотрудникиССоцОтпуском
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоДнейСоцОтпуска КАК ВТКоличествоДнейСоцОтпуска
		|		ПО ВТСотрудникиССоцОтпуском.Сотрудник = ВТКоличествоДнейСоцОтпуска.Сотрудник
		|ГДЕ
		|	ВТСотрудникиССоцОтпуском.КоличествоДней + ЕСТЬNULL(ВТКоличествоДнейСоцОтпуска.КоличествоДней,0) > 3";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоСостояниюЗдоровья);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Сотрудником " + СокрЛП(ВыборкаДетальныеЗаписи.Сотрудник) + " использовано больше 3 дней соц.отпуска с сохранением зп (по состоянию здоровья).");
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры
//Аверсон СВФР-014052

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Островская Татьяна 09.03.2014
	если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		если Проведен Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Островская Татьяна 09.03.2014

	//Аверсон ЕАЕ 18.04.2024 СВФР-012781
	Если Организация.ИНН = "806000046" Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПроверкаКоличестваДнейСоцОтпуска(Отказ);
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-012781
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Организация) И Организация.ИНН = "700103211" Тогда
		КраткийСоставДокМП = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"МатериальнаяПомощь");
	КонецЕсли;
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 )
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.КадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период		= Дата;
		ЗаписьРегистрации.Регистратор	= Ссылка;
	КонецЕсли;
	
	Движения.ПериодыСостоянийРаботниковОрганизаций.РежимЗаписиРегистратора = РежимЗаписи;
	
КонецПроцедуры // ПередЗаписью()

//Аверсон ЕАЕ 18.04.2024 СВФР-012781
Процедура ПроверкаКоличестваДнейСоцОтпуска(Отказ)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПричинаОтсутствия", Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСоциальныйПоБолезни);
	ТЗ = РаботникиОрганизации.Выгрузить(СтруктураОтбора, "Сотрудник,КоличествоДней");
	Если ТЗ.Количество() > 0 Тогда
		ТЗ.Свернуть("Сотрудник", "КоличествоДней");
		МассивСотрудников = ТЗ.ВыгрузитьКолонку("Сотрудник");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник,
		|	СУММА(ОтпускаОрганизацийРаботникиОрганизации.КоличествоДней) КАК КоличествоДней
		|ИЗ
		|	Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|ГДЕ
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник В(&СписокСотрудников)
		|	И ОтпускаОрганизацийРаботникиОрганизации.Ссылка <> &ТекСсылка
		|	И ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала <= &ДатаПо
		|	И ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания >= &ДатаС
		|	И ОтпускаОрганизацийРаботникиОрганизации.Ссылка.Проведен
		|   И ОтпускаОрганизацийРаботникиОрганизации.ПричинаОтсутствия = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСоциальныйПоБолезни)
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаОрганизацийРаботникиОрганизации.Сотрудник";
		
		Запрос.УстановитьПараметр("ДатаПо", КонецГода(Дата));
		Запрос.УстановитьПараметр("ДатаС", НачалоГода(Дата));
		Запрос.УстановитьПараметр("СписокСотрудников", МассивСотрудников);
		Запрос.УстановитьПараметр("ТекСсылка", Ссылка);
		
		ТЗПрошл = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			НужнаяСтр = ТЗПрошл.Найти(Стр.Сотрудник, "Сотрудник");
			КоличествоДнейПрошл = 0; 
			Если НужнаяСтр <> Неопределено Тогда
				КоличествоДнейПрошл = НужнаяСтр.КоличествоДней;
			КонецЕсли;
			КолДней = КоличествоДнейПрошл + Стр.КоличествоДней;
			Если КолДней > 3 Тогда
				Сообщить("Количество дней соц.отпуска всего по сотруднику " + СокрЛП(Стр.Сотрудник) + " за год не должно превышать 3 дня.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
//Аверсон СВФР-012781

Процедура ОбработкаЗаполнения(Основание)
	// Вставить содержимое обработчика.
КонецПроцедуры

//Островская Татьяна 19.12.2013 № 16975
Процедура ДобавитьСтрокуВДвиженияПоРегиструОтпускаПоТрудовымДоговорам(ВыборкаПоДокументу,ВыборкаПоШапкеДокумента)
	
	//Островская Татьяна 11.03.2014 № 17188
	если СдвинутьРабочийГод Тогда 
		
		Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
		
		//Измерения
		Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
		//Островская Татьяна 21.03.2014
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоОтпуск;
		//Островская Татьяна 21.03.2014
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;

		Движение.Корректировка = Истина;
		
		// Вторая запись
		Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
		
		//Измерения
		Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСНовОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоНовОтпуск;
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;

		Движение.Корректировка = Ложь;
	иначе
		
		Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();
		
		//Измерения
		Движение.ВидДвижения    = ВидДвиженияНакопления.Расход;
		//Островская Татьяна 21.03.2014
		Движение.Период         = ВыборкаПоДокументу.РабочийГодСОтпуск;
		Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоОтпуск;
		//Островская Татьяна 21.03.2014
		Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
		Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
		
		//Ресурсы
		Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;
		
		//ПСА 25.10.2021 СВФР-008300 +++
		Если ВыборкаПоДокументу.ВидОтпуска.Наименование = "за ДПД" Тогда
			Движение = Движения.ОтпускаПоТрудовымДоговорам.Добавить();

			//Измерения
			Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
			//Островская Татьяна 21.03.2014
			Движение.Период         = ВыборкаПоДокументу.РабочийГодСОтпуск;
			Движение.ДатаОкончания	= ВыборкаПоДокументу.РабочийГодПоОтпуск;
			//Островская Татьяна 21.03.2014
			Движение.Сотрудник      = ВыборкаПоДокументу.Сотрудник;
			Движение.ВидОтпуска     = ВыборкаПоДокументу.ВидОтпуска;
			
			//Ресурсы
			Движение.КоличествоДней = ВыборкаПоДокументу.КоличествоДней;
		КонецЕсли;	

		//+++ПСА 25.10.2021 СВФР-008300
	КонецЕсли;
	//Островская Татьяна 11.03.2014 № 17188
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
