Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокФлюрографии, ДокументРезультат)
	
	Пока ВыборкаСтрокФлюрографии.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокФлюрографии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокФлюрографии.ПодразделениеОрганизации Тогда			
			мНомер = 0;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокФлюрографии.ПодразделениеОрганизации.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
			
			Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда
				ОбластьДетальныхЗаписей.Параметры.ТипОбучения = ВыборкаСтрокФлюрографии.ТипОбучения;
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаНачала;
				ОбластьДетальныхЗаписей.Параметры.Специальность = ВыборкаСтрокФлюрографии.Специальность;
				ОбластьДетальныхЗаписей.Параметры.Тематика = ВыборкаСтрокФлюрографии.Тематика;
				ОбластьДетальныхЗаписей.Параметры.Профессия = ВыборкаСтрокФлюрографии.Профессия;
				ОбластьДетальныхЗаписей.Параметры.УчебноеЗаведение = ВыборкаСтрокФлюрографии.УчебноеЗаведение;
				ОбластьДетальныхЗаписей.Параметры.Разряд = ВыборкаСтрокФлюрографии.Разряд;
				ОбластьДетальныхЗаписей.Параметры.Стоимость = ВыборкаСтрокФлюрографии.Стоимость;
				ОбластьДетальныхЗаписей.Параметры.Период = ВыборкаСтрокФлюрографии.Период;

				ОбластьДетальныхЗаписей.Параметры.НомерПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.НомерПриказа,ВыборкаСтрокФлюрографии.Регистратор.Номер); //СВЭЙ 21.05.2024 КВВ СВФР-012926
				ОбластьДетальныхЗаписей.Параметры.ДатаПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.ДатаПриказа,ВыборкаСтрокФлюрографии.Регистратор.Дата); //СВЭЙ 21.05.2024 КВВ СВФР-012926
			Иначе 
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаПовышенияКвалификацииПлановая;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			
		Иначе
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокФлюрографии.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокФлюрографии.Сотрудник.Наименование;				
			
			Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда
				ОбластьДетальныхЗаписей.Параметры.ТипОбучения = ВыборкаСтрокФлюрографии.ТипОбучения;
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаНачала;
				ОбластьДетальныхЗаписей.Параметры.Специальность = ВыборкаСтрокФлюрографии.Специальность;
				ОбластьДетальныхЗаписей.Параметры.Тематика = ВыборкаСтрокФлюрографии.Тематика;
				ОбластьДетальныхЗаписей.Параметры.Профессия = ВыборкаСтрокФлюрографии.Профессия;
				ОбластьДетальныхЗаписей.Параметры.УчебноеЗаведение = ВыборкаСтрокФлюрографии.УчебноеЗаведение;
				ОбластьДетальныхЗаписей.Параметры.Разряд = ВыборкаСтрокФлюрографии.Разряд;
				ОбластьДетальныхЗаписей.Параметры.Стоимость = ВыборкаСтрокФлюрографии.Стоимость;
				ОбластьДетальныхЗаписей.Параметры.Период = ВыборкаСтрокФлюрографии.Период;

				ОбластьДетальныхЗаписей.Параметры.НомерПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.НомерПриказа,ВыборкаСтрокФлюрографии.Регистратор.Номер); //СВЭЙ 21.05.2024 КВВ СВФР-012926
				ОбластьДетальныхЗаписей.Параметры.ДатаПр = ?(Организация.ИНН = "700103211",ВыборкаСтрокФлюрографии.Регистратор.ДатаПриказа,ВыборкаСтрокФлюрографии.Регистратор.Дата); //СВЭЙ 21.05.2024 КВВ СВФР-012926

			Иначе 
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокФлюрографии.ДатаПовышенияКвалификацииПлановая;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокФлюрографии.ПодразделениеОрганизации;
			
		КонецЕсли;
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	Если ДатаПлановогоПовышенияКвалификации = Ложь Тогда 
		мМакет = ПолучитьМакет("МакетПрофОбучение");
	Иначе
		мМакет = ПолучитьМакет("МакетПрофОбучениеПлановаое");
	конецесли;
	ТекПодр = "";

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
	|	ОбучениеИПереподготовка.Сотрудник КАК Сотрудник,
	|	ОбучениеИПереподготовка.ТипОбучения,
	|	ОбучениеИПереподготовка.Специальность,
	|	ОбучениеИПереподготовка.Организация,
	|	ОбучениеИПереподготовка.ДатаНачала,
	|	ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая,
	|	ОбучениеИПереподготовка.Тематика КАК Тематика,
	|	ОбучениеИПереподготовка.Профессия КАК Профессия,
	|	ОбучениеИПереподготовка.УчебноеЗаведение КАК УчебноеЗаведение,
	|	ОбучениеИПереподготовка.Разряд КАК Разряд,
	|	ОбучениеИПереподготовка.Стоимость КАК Стоимость,
	|	ОбучениеИПереподготовка.Регистратор КАК Регистратор,
	|	ОбучениеИПереподготовка.Статус КАК Статус,
	|	ОбучениеИПереподготовка.Период
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбучениеИПереподготовка КАК ОбучениеИПереподготовка
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ОбучениеИПереподготовка.Сотрудник
	|	
	|ГДЕ
	|	ОбучениеИПереподготовка.ДатаНачала >= &ДатаНачала
	|	И ОбучениеИПереподготовка.ДатаНачала <= &ДатаОкончания
	|	//И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения
	|	И ОбучениеИПереподготовка.Организация = &Организация
	|	//1 И ОбучениеИПереподготовка.Специальность = &Специальность
	|	//И ОбучениеИПереподготовка.Статус = &Статус
	|	//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)
	|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926

	|
	|СГРУППИРОВАТЬ ПО
	|	ОбучениеИПереподготовка.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|	ОбучениеИПереподготовка.Сотрудник,
	|	ОбучениеИПереподготовка.ТипОбучения,
	|	ОбучениеИПереподготовка.Специальность,
	|	ОбучениеИПереподготовка.ДатаНачала,
	|	ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая,
	|	ОбучениеИПереподготовка.Тематика,
	|	ОбучениеИПереподготовка.Профессия,
	|	ОбучениеИПереподготовка.УчебноеЗаведение,
	|	ОбучениеИПереподготовка.Разряд,
	|	ОбучениеИПереподготовка.Стоимость,
	|	ОбучениеИПереподготовка.Регистратор,
	|	ОбучениеИПереподготовка.Статус,
	|	ОбучениеИПереподготовка.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет Возр,
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация",      Организация);

	Если ДатаПлановогоПовышенияКвалификации = Истина Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ОбучениеИПереподготовка.ДатаНачала >= &ДатаНачала","ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая >= &ДатаНачала");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ОбучениеИПереподготовка.ДатаНачала <= &ДатаОкончания","ОбучениеИПереподготовка.ДатаПовышенияКвалификацииПлановая <= &ДатаОкончания");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТипОбучения) тогда
		Запрос.УстановитьПараметр("ТипОбучения",      ТипОбучения);
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения","И ОбучениеИПереподготовка.ТипОбучения = &ТипОбучения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Специальность) тогда
		Запрос.УстановитьПараметр("Специальность",      Специальность);
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ОбучениеИПереподготовка.Специальность = &Специальность","И ОбучениеИПереподготовка.Специальность = &Специальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Статус) тогда
		Запрос.УстановитьПараметр("Статус",      Статус);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ОбучениеИПереподготовка.Статус = &Статус","И ОбучениеИПереподготовка.Статус = &Статус");
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда 
		Запрос.УстановитьПараметр("Подразделение",      Подразделение);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)","И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
	КонецЕсли;
	
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Категория) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.Категория = &Категория","И РаботникиОрганизацийСрезПоследних.Категория = &Категория");
		Запрос.УстановитьПараметр("Категория", Категория);
	КонецЕсли;
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 )
	
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли

