
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СведенияПоРасчетноПлатежнойВедомостиУдержания
	Движения.СведенияПоРасчетноПлатежнойВедомостиУдержания.Записывать = Истина;
	Движения.СведенияПоРасчетноПлатежнойВедомостиУдержания.Очистить();
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.СведенияПоРасчетноПлатежнойВедомостиУдержания.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ФизЛицо = ТекСтрокаУдержания.ФизЛицо;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.ПериодУдержания = ТекСтрокаУдержания.ПериодУдержания;
		Движение.Результат = ТекСтрокаУдержания.Результат;
		Движение.ОтработаноДней = ТекСтрокаУдержания.ОтработаноДней;
		Движение.ОтработаноЧасов = ТекСтрокаУдержания.ОтработаноЧасов;
		Движение.ПримененныйВычетЛичный = ТекСтрокаУдержания.ПримененныйВычетЛичный;
		Движение.ПримененныйВычетНаДетей = ТекСтрокаУдержания.ПримененныйВычетНаДетей;
		Движение.ПримененныйВычетНаДетейЛьгота = ТекСтрокаУдержания.ПримененныйВычетНаДетейЛьгота;
		Движение.ПримененныйвычетДополнительный = ТекСтрокаУдержания.ПримененныйвычетДополнительный;
		Движение.ПримененныйВычетИмущественныйРасход = ТекСтрокаУдержания.ПримененныйВычетИмущественныйРасход;
		Движение.ПримененныйВычетСоциальныйСПроцентами = ТекСтрокаУдержания.ПримененныйВычетСоциальныйСПроцентами;
		Движение.ПримененныйВычетСтраховойРасход = ТекСтрокаУдержания.ПримененныйВычетСтраховойРасход;
		Движение.Должность = ТекСтрокаУдержания.Должность;
		Движение.ТабельныйНомер = ТекСтрокаУдержания.ТабельныйНомер;
		//ПСА 04.10.2021 СВФР-008215 +++
		Движение.Сотрудник = ВернутьСотрудника(ТекСтрокаУдержания.ФизЛицо, ТекСтрокаУдержания.ТабельныйНомер); 
	КонецЦикла;

	// регистр СведенияПоРасчетноПлатежнойВедомости
	Движения.СведенияПоРасчетноПлатежнойВедомости.Записывать = Истина;
	Движения.СведенияПоРасчетноПлатежнойВедомости.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.СведенияПоРасчетноПлатежнойВедомости.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ФизЛицо = ТекСтрокаНачисления.ФизЛицо;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ПериодНачисления;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ПериодНачисленияКонец;
		Движение.Результат = ТекСтрокаНачисления.Результат;
		Движение.ОтработаноДней = ТекСтрокаНачисления.ОтработаноДней;
		Движение.ОтработаноЧасов = ТекСтрокаНачисления.ОтработаноЧасов;
		Движение.Должность = ТекСтрокаНачисления.Должность;
		Движение.ТабельныйНомер = ТекСтрокаНачисления.ТабельныйНомер;
		//ПСА 04.10.2021 СВФР-008215 +++
		Движение.Сотрудник = ВернутьСотрудника(ТекСтрокаНачисления.ФизЛицо, ТекСтрокаНачисления.ТабельныйНомер); 
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//ПСА 04.10.2021 СВФР-008215 +++
Функция ВернутьСотрудника(ВыбФизЛицо, ВыбТабельныйНомер)
	НайденныйСотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Код = &Код
		|	И СотрудникиОрганизаций.Физлицо = &Физлицо";
	
	Запрос.УстановитьПараметр("Код", ВыбТабельныйНомер);
	Запрос.УстановитьПараметр("Физлицо", ВыбФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		НайденныйСотрудник = Выборка.Ссылка;	
	КонецЕсли;
	Возврат НайденныйСотрудник;
КонецФункции	
//+++ПСА 04.10.2021 СВФР-008215 


