Перем мВалютаРегламентированногоУчета;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполняет документ работниками, работавшими в праздники
//
Процедура ЗаполнитьРаботавшимиВПраздники(Запрос = Неопределено, Реквизиты = Неопределено, ДопВидыВремени = Неопределено, мВыборКнопки = "РаботавшимиВПраздники") Экспорт //Островская 15.03.2014 № //Аверсон ЕАЕ СВФР-008600 (параметр ДопВидыВремени) //Аверсон ЕАЕ 24.05.2024 СВФР-012937
	Если Запрос = Неопределено Или Реквизиты = Неопределено Тогда // не передали необходимых для заполнения данных
		Возврат;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// создаем временную таблицу ВТСписокРаботников с сотрудниками, отобранными по критериям пользователя 
	// 
	// Поля:
	//   Сотрудник
	//   Физлицо
	//   ФИО
	//   Подразделение
	//   ГрафикРаботы
	//
	Запрос.Выполнить();
	//Наркевич 15.03.2014 №
	
	ДатаАктЗапроса = Запрос.Параметры.ДатаАктуальности; //Аверсон 21.07.2021 КВВ СВФР-007858
	ЗаПериодЗапрос = Запрос.Параметры.ЗаПериод; //Аверсон 10.08.2021 КВВ СВФР-007858
	
	//Аверсон 12.12.2022 КВВ СВФР-010003 (
	ЕстьВыборкаПоКатегории = Ложь; 	ЗнПарамКат = ""; НомерПараметра = 0; ЗначениеПараметраКатегорий = ""; ТекстЗПоКат = "";
	Попытка 
		ЗнПарамКат =  СокрЛП(ТипЗнч(Запрос.Параметры.Параметр4));
	Исключение
	КонецПопытки;
	Если ЗначениеЗаполнено(ЗнПарамКат) Тогда
		Если (СокрЛП(ТипЗнч(Запрос.Параметры.Параметр4)) = "Категории работников")
			ИЛИ (СокрЛП(ТипЗнч(Запрос.Параметры.Параметр4)) = "Список значений" И СокрЛП(Запрос.Параметры.Параметр4.ТипЗначения) = "Категории работников") Тогда    
			ЕстьВыборкаПоКатегории = Истина; 
			НомерПараметра = 4;  
			ЗначениеПараметраКатегорий = Запрос.Параметры.Параметр4;
		Иначе  
			ЗнПарамКат = "";
			Попытка 
				ЗнПарамКат =  СокрЛП(ТипЗнч(Запрос.Параметры.Параметр6));
			Исключение
			КонецПопытки; 
			Если ЗначениеЗаполнено(ЗнПарамКат) Тогда
				Если (СокрЛП(ТипЗнч(Запрос.Параметры.Параметр6)) = "Категории работников")
					ИЛИ (СокрЛП(ТипЗнч(Запрос.Параметры.Параметр6)) = "Список значений" И СокрЛП(Запрос.Параметры.Параметр6.ТипЗначения) = "Категории работников") Тогда
					ЕстьВыборкаПоКатегории = Истина;  
					НомерПараметра = 6; 
					ЗначениеПараметраКатегорий = Запрос.Параметры.Параметр6;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	    
	Если ЕстьВыборкаПоКатегории Тогда
		ТекстЗПоКат = СокрЛП(Сред(Запрос.Текст,Найти(Запрос.Текст,").Категория ")+11,Найти(Запрос.Текст,"&Параметр"+СокрЛП(НомерПараметра))-Найти(Запрос.Текст,").Категория ")-11));
		Если НЕ (ТекстЗПоКат = "=" ИЛИ ТекстЗПоКат = "<>" ИЛИ Лев(ТекстЗПоКат,3) = "В (") Тогда
			ЕстьВыборкаПоКатегории = Ложь;  
		ИначеЕсли Лев(ТекстЗПоКат,3) = "В (" Тогда
			Если Сред(Запрос.Текст,Найти(Запрос.Текст,").Категория ")-259,11) = "И НЕ (ВЫБОР" Тогда  
				ТекстЗПоКат = "НЕ В (";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 12.12.2022 КВВ СВФР-010003 )
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Праздники);
	//Список.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни); не буква В в оплату
	
	//Аверсон ЕАЕ 12.01.2022 СВФР-008600
	Если ДопВидыВремени <> Неопределено Тогда
		Для Каждого Сп Из ДопВидыВремени Цикл
			Если Список.НайтиПоЗначению(Сп.Значение) = Неопределено Тогда
				Список.Добавить(Сп.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон СВФР-008600
	
	Начисления.Очистить();
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Аверсон ЕАЕ 12.10.2021 СВФР-008258
	Если ЗаПериодЗапрос Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТСписокРаботников.Сотрудник,
		|	ВТСписокРаботников.ФИО,
		|	ВТСписокРаботников.ФизЛицо,
		|	ВТСписокРаботников.ГрафикРаботы,
		|	ВТСписокРаботников.ЗанимаемыхСтавок,
		|	ВТСписокРаботников.Подразделение,
		|	ВТСписокРаботников.Должность,
		|	ВТСписокРаботников.ДолжностьНаименование,
		|	ВТСписокРаботников.ДолжностьПриоритет,
		|	ВТСписокРаботников.ПодразделениеНаименование,
		|	ВТСписокРаботников.ПодразделениеПриоритет,
		|	ВТСписокРаботников.Период,
		|	ВТСписокРаботников.Период КАК ДатаС,
		|	ВТСписокРаботников.ТекущаяДата,
		|	ВТСписокРаботников.Код,
		|	ВТСписокРаботников.ВидРасчетаОклад,
		|	ВТСписокРаботников.Пол,
		|	ЕСТЬNULL(МИНИМУМ(ДОБАВИТЬКДАТЕ(ВТСписокРаботниковБольше.Период, СЕКУНДА, -1)), &ОкончаниеПериода) КАК ДатаПо
		|ПОМЕСТИТЬ ВТСписокРаботниковПериоды
		|ИЗ ВТСписокРаботников
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ВТСписокРаботниковБольше
		|ПО ВТСписокРаботников.Сотрудник = ВТСписокРаботниковБольше.Сотрудник
		|	И ВТСписокРаботников.Период < ВТСписокРаботниковБольше.Период
		|СГРУППИРОВАТЬ ПО
		|	ВТСписокРаботников.Сотрудник,
		|	ВТСписокРаботников.Период,
		|	ВТСписокРаботников.Подразделение,
		|	ВТСписокРаботников.Должность,
		|	ВТСписокРаботников.ФИО,
		|	ВТСписокРаботников.ФизЛицо,
		|	ВТСписокРаботников.ГрафикРаботы,
		|	ВТСписокРаботников.ЗанимаемыхСтавок,
		|	ВТСписокРаботников.ДолжностьНаименование,
		|	ВТСписокРаботников.ДолжностьПриоритет,
		|	ВТСписокРаботников.ПодразделениеНаименование,
		|	ВТСписокРаботников.ПодразделениеПриоритет,
		|	ВТСписокРаботников.ТекущаяДата,
		|	ВТСписокРаботников.Код,
		|	ВТСписокРаботников.ВидРасчетаОклад,
		|	ВТСписокРаботников.Пол
		|;
		|/////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РабочееВремяРаботниковОрганизаций.Период КАК Период,
		|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
		|	РабочееВремяРаботниковОрганизаций.Часов КАК Часов,
		|	РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Организация КАК Организация,
		|	РабочееВремяРаботниковОрганизаций.Регистратор КАК Регистратор,
		|	РабочееВремяРаботниковОрганизаций.ДатаНачала //О.Т. Аверсон 14.12.2016 № 100
		|ИЗ
		|	ВТСписокРаботниковПериоды КАК ВТСписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|		ПО ВТСписокРаботников.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
		|		И РабочееВремяРаботниковОрганизаций.Период МЕЖДУ ВТСписокРаботников.ДатаС И ВТСписокРаботников.ДатаПо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ОкончаниеПериода, ) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ВТСписокРаботников.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени)
		|	И РабочееВремяРаботниковОрганизаций.Период >= &НачалоПериода
		|	И РабочееВремяРаботниковОрганизаций.Период <= &ОкончаниеПериода
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация" ;
		//Аверсон СВФР-008258
	Иначе
		Запрос.Текст =
		//"ВЫБРАТЬ
		//|	ВТСписокРаботников.Сотрудник
		//|ИЗ
		//|	ВТСписокРаботников КАК ВТСписокРаботников" ;
		//Островская 15.03.2014 №
		"ВЫБРАТЬ
		|	РабочееВремяРаботниковОрганизаций.Период КАК Период,
		|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидИспользованияРабочегоВремени,
		|	РабочееВремяРаботниковОрганизаций.Часов КАК Часов,
		|	РабочееВремяРаботниковОрганизаций.Тариф КАК Тариф,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Организация КАК Организация,
		|	РабочееВремяРаботниковОрганизаций.Регистратор КАК Регистратор,
		|	РабочееВремяРаботниковОрганизаций.ДатаНачала //О.Т. Аверсон 14.12.2016 № 100
		|ИЗ
		|	ВТСписокРаботников КАК ВТСписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|		ПО ВТСписокРаботников.Сотрудник = РабочееВремяРаботниковОрганизаций.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ОкончаниеПериода, ) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ВТСписокРаботников.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|ГДЕ
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&ВидИспользованияРабочегоВремени)
		|	И РабочееВремяРаботниковОрганизаций.Период >= &НачалоПериода
		|	И РабочееВремяРаботниковОрганизаций.Период <= &ОкончаниеПериода
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация" ;
	КонецЕсли;
	//Островская 15.03.2014 №
	//"ВЫБРАТЬ
	//|	РабочееВремяРаботниковОрганизаций.Период,
	//|	РабочееВремяРаботниковОрганизаций.Сотрудник,
	//|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
	//|	РабочееВремяРаботниковОрганизаций.Часов,
	//|	РабочееВремяРаботниковОрганизаций.Тариф,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	//|	РаботникиОрганизацийСрезПоследних.Организация,
	//|	РабочееВремяРаботниковОрганизаций.Регистратор
	//|ИЗ
	//|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, ) КАК РаботникиОрганизацийСрезПоследних
	//|		ПО РабочееВремяРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	//|ГДЕ
	//|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В (&ВидИспользованияРабочегоВремени)
	//|	И РабочееВремяРаботниковОрганизаций.Период >= &НачалоПериода
	//|	И РабочееВремяРаботниковОрганизаций.Период <= &ОкончаниеПериода
	//|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(ПериодРегистрации));
	//Запрос.УстановитьПараметр("ОкончаниеПериода",КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонецДня(ДатаАктЗапроса)); //Аверсон 21.07.2021 КВВ СВФР-007858
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ВидИспользованияРабочегоВремени", Список);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если Выборка.Количество() > 0 тогда
	
	Пока Выборка.Следующий() цикл
		
		//Аверсон ЕАЕ 24.05.2024 СВФР-012937
		Если мВыборКнопки = "РаботавшимиВПраздникиБезНарядов" Тогда
			Если БылНаряд(Выборка.Сотрудник, Выборка.Период) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-012937
		
		//Аверсон 10.08.2021 КВВ СВФР-007858 (
		ВКакомПодр = Выборка.ПодразделениеОрганизации;
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) И ЗаПериодЗапрос Тогда
			ДатаВыходаПроверки = ?(Организация.ИНН = "100765738",Выборка.ДатаНачала,Выборка.Период);
			ПодрНаДатуПроверки = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаВыходаПроверки,Новый Структура("Сотрудник",Выборка.Сотрудник)).ПодразделениеОрганизации;
			З = Новый Запрос;
			З.Текст = "
			|ВЫБРАТЬ ВЫБОР КОГДА 
			|&ПодрСотр В ИЕРАРХИИ(&ПодрШапки) 
			|ТОГДА Истина
			|ИНАЧЕ Ложь
			|КОНЕЦ КАК Входит
			|";
			З.УстановитьПараметр("ПодрСотр",ПодрНаДатуПроверки);
			З.УстановитьПараметр("ПодрШапки",ПодразделениеОрганизации);
			РезЗ = З.Выполнить().Выгрузить();
			Если НЕ РезЗ[0].Входит Тогда
				//	Сообщить("НЕТ " + СокрЛП(Выборка.Сотрудник) + " - " + СокрЛП(ДатаВыходаПроверки) + " - " + СокрЛП(ПодрНаДатуПроверки));
				Продолжить;
			КонецЕсли;
			ВКакомПодр = ПодрНаДатуПроверки;
		КонецЕсли;
		//Аверсон 10.08.2021 КВВ СВФР-007858 )
		//Островская Татьяна 08.02.2013
		Запрос1 = Новый Запрос;
		Запрос1.Текст =
		"ВЫБРАТЬ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета";
		Запрос1.УстановитьПараметр("Организация", Выборка.Организация);
		Запрос1.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
		Запрос1.УстановитьПараметр("Период", Выборка.Период);
		мСписокВидов = Новый СписокЗначений;
		мСписок = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
		Пока мСписок.Следующий() Цикл
			мСписокВидов.Добавить(мСписок.ВидРасчета);
		КонецЦикла;
		Запрос1.УстановитьПараметр("ВидРасчета", мСписокВидов);
		
		мРезультат = Запрос1.Выполнить().Выбрать();
		
		Если мРезультат.Количество() = 0 Тогда
			//Возврат 0;
		Иначе
			Пока мРезультат.Следующий() Цикл
				ВидРасчета = мРезультат.ВидРасчета;
			КонецЦикла;
		КонецЕсли;
		//Островская Татьяна 08.02.2013
		
		
		
		//начисления из нарядов не будем добавлять, все рассчеты идут из наряда
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.СдельныйНаряд") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Часов = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		//Аверсон 12.12.2022 КВВ СВФР-010003 (
		Если ЕстьВыборкаПоКатегории Тогда
			_ДатаВыхода_ = ?(Организация.ИНН = "100765738",Выборка.ДатаНачала,Выборка.Период);
			КатПоДолж = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецДня(_ДатаВыхода_),Новый Структура("Сотрудник",Выборка.Сотрудник)).Должность.Категория;
			Если ТекстЗПоКат = "=" Тогда
				Если КатПоДолж <> ЗначениеПараметраКатегорий Тогда 
					Продолжить;
				КонецЕсли;
			ИначеЕсли ТекстЗПоКат = "<>" Тогда
				Если КатПоДолж = ЗначениеПараметраКатегорий Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли Лев(ТекстЗПоКат,3) = "В (" Тогда
				Если ЗначениеПараметраКатегорий.НайтиПоЗначению(КатПоДолж) = Неопределено Тогда	
					Продолжить;
				КонецЕсли;
			ИначеЕсли Лев(ТекстЗПоКат,6) = "НЕ В (" Тогда
				Если ЗначениеПараметраКатегорий.НайтиПоЗначению(КатПоДолж) <> Неопределено Тогда	
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 12.12.2022 КВВ СВФР-010003 )
		
		если ОплатаВДвойномРазмере  Тогда //Островская Татьяна 14.02.2013 № 16232
			//один тариф на ОплатаПраздничныхИВыходных
			Строка = Начисления.Добавить();
			Строка.Сотрудник = Выборка.Сотрудник;
			
			//Аверсон 10.08.2021 КВВ СВФР-007858 (
			//Строка.ПодразделениеОрганизации = Выборка.ПодразделениеОрганизации;
			Строка.ПодразделениеОрганизации = ВКакомПодр;
			//Аверсон 10.08.2021 КВВ СВФР-007858 )
			
			если Организация.ИНН = "100765738" Тогда  //О.Т. Аверсон 14.12.2016 № 100
				Строка.ДатаВыхода = Выборка.ДатаНачала;
			иначе
				Строка.ДатаВыхода = Выборка.Период;
			КонецЕсли;
			//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
			//Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходные;
			Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПраздничныхИВыходных;
			//заявка №1799
			Строка.ОтработаноЧасов = Выборка.Часов;
			Строка.ОтработаноДней = 1;
			Если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
				Строка.Размер = Окр(ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,,СпособРасчетаВЧасах), 1);//Островская Татьяна 28.04.2014 № 17310
			иначе
				Если Организация.ИНН = "100071565"  Тогда
					Строка.Размер = ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,Истина,СпособРасчетаВЧасах);//без контракта
				Иначе
					Строка.Размер = ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,,СпособРасчетаВЧасах);//Островская Татьяна 28.04.2014 № 17310 949
				КонецЕсли;
			КонецЕсли;
			
			//О.Т. Аверсон 19.03.2019 № 4089
			Если РасчетСПовышениями и Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные.Количество()>0 Тогда 
				ЗапросПлановые = Новый Запрос;
				ЗапросПлановые.Текст = 
				"ВЫБРАТЬ
				|	НачисленияРаботниковОрганизации.Показатель1
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
				|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
				|ГДЕ
				|	ВЫБОР
				|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
				|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|	И ВЫБОР
				|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
				|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА ВЫБОР
				|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
				|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
				|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
				|					КОНЕЦ
				|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
				|		КОНЕЦ В (&ВидыРасчетаПовышения)";
				
				ЗапросПлановые.УстановитьПараметр("парамНачало", ?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации)); //Аверсон 26.09.2019 КВВ СВФР-004826
				ЗапросПлановые.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
				
				ВидыПовышений = Новый СписокЗначений;
				Для Каждого стр из Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные Цикл 
					ВидыПовышений.Добавить(стр.ВидРасчета);
				КонецЦикла;
				
				ЗапросПлановые.УстановитьПараметр("ВидыРасчетаПовышения", ВидыПовышений);
				
				РезультатЗапроса = ЗапросПлановые.Выполнить().Выбрать();
				СуммаПовышений = 0;
				пока РезультатЗапроса.Следующий() Цикл 
					//СуммаПовышений = СуммаПовышений + ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * РезультатЗапроса.Показатель1/100, ПериодРегистрации, 1);
					
					//СВЭЙ 22.02.2024 КВВ СВФР-012096 (
					Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.РасчетПоСуммам Тогда
						СуммаПовышений = СуммаПовышений + РезультатЗапроса.Показатель1;
					Иначе
						//СВЭЙ 22.02.2024 КВВ СВФР-012096 )
						
						//Аверсон ЕАЕ 25.11.2025 СВФР-017393
						//СуммаПовышений = СуммаПовышений + Строка.Размер * РезультатЗапроса.Показатель1/100;  //Аверсон 26.09.2019 КВВ СВФР-004826
						СуммаПовышений = СуммаПовышений + ?(ОкруглениеКаждогоПовышения, ОбщегоНазначения.ОкруглитьПоВалюте(Строка.Размер * РезультатЗапроса.Показатель1/100, Константы.ВалютаРегламентированногоУчета.Получить()), 
															Строка.Размер * РезультатЗапроса.Показатель1/100);  
						//Аверсон СВФР-017393

					КонецЕсли;
				КонецЦикла;
				
				//СВЭЙ 22.02.2024 КВВ СВФР-012096 (
				Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.РасчетПоСуммам Тогда
					//Если ЗначениеЗаполнено(СтрокаДвижений.ГрафикРаботы) Тогда 
					//	ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
					//	Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),СтрокаДвижений.ГрафикРаботы));
					//	Если ЧасовВГоду.Размер = 0 Тогда 
					//		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
					//		Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
					//	КонецЕсли;
					//Иначе                        		
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
					Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
					//КонецЕсли;
					Если ЧасовВГоду.Размер <> 0 Тогда
						Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда
							СуммаПовышений = СуммаПовышений/ЧасовВГоду.Размер;
						КонецЕсли;  						
					КонецЕсли;
					Строка.Размер = СуммаПовышений;
					Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(СуммаПовышений * Выборка.Часов, ПериодРегистрации, 1);
				Иначе
					//СВЭЙ 22.02.2024 КВВ СВФР-012096 )
					
					если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням и не СпособРасчетаВЧасах Тогда //Островская Татьяна 24.04.2014 № 17310
						Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((Строка.Размер+СуммаПовышений) * Строка.ОтработаноДней, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
					иначе
						Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((Строка.Размер+СуммаПовышений) * Выборка.Часов, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
					КонецЕсли;
					
				КонецЕсли;
				
			иначе
				
				если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням и не СпособРасчетаВЧасах Тогда //Островская Татьяна 24.04.2014 № 17310
					Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * Строка.ОтработаноДней, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
				иначе
					Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * Выборка.Часов, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
				КонецЕсли;
				
			КонецЕсли;			
			//О.Т. Аверсон 19.03.2019 № 4089
			
			
		КонецЕсли;
		//один тариф на ДоплатаЗаПраздничныеИВыходные
		//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
		Строка = Начисления.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		
		//Аверсон 10.08.2021 КВВ СВФР-007858 (
		//Строка.ПодразделениеОрганизации = Выборка.ПодразделениеОрганизации;
		Строка.ПодразделениеОрганизации = ВКакомПодр;
		//Аверсон 10.08.2021 КВВ СВФР-007858 )
		
		если Организация.ИНН = "100765738" Тогда  //О.Т. Аверсон 14.12.2016 № 100
			Строка.ДатаВыхода = Выборка.ДатаНачала;
		иначе
			Строка.ДатаВыхода = Выборка.Период;
		КонецЕсли;
		
		//Аверсон ЕАЕ 13.01.2022 СВФР-008600
		//Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходные;
		Если Организация.ИНН = "100071565" Тогда //Вторчермет
			Если ДопВидыВремени = Неопределено Тогда
				Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПраздничныхИВыходных;	
			Иначе
				Если ДопВидыВремени.НайтиПоЗначению(Выборка.ВидИспользованияРабочегоВремени) = Неопределено Тогда
					Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходныеПоГрафику;	
				Иначе
					Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходные;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Строка.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходные;
		КонецЕсли;
		//Аверсон СВФР-008600
		
		Если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
			Строка.Размер = Окр(ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,,СпособРасчетаВЧасах), 1); //Островская Татьяна 28.04.2014 № 17310
		иначе
			Если Организация.ИНН = "100071565" Тогда 
				Строка.Размер =  ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,Истина,СпособРасчетаВЧасах); //Без контракта
			Иначе
				Строка.Размер =  ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, Выборка.Сотрудник, Строка.ДатаВыхода, Выборка.Сотрудник, Истина, Истина,,,,,СпособРасчетаВЧасах); //Островская Татьяна 28.04.2014 № 17310  949
			КонецЕсли;
		КонецЕсли;
		Строка.ОтработаноДней = 1;
		если не ОплатаВДвойномРазмере  Тогда
			Строка.ОтработаноЧасов = Выборка.Часов;//Островская Татьяна 17.04.2014 № 17282
		КонецЕсли;
		
		
		//О.Т. Аверсон 19.03.2019 № 4089
		Если РасчетСПовышениями и Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные.Количество()>0 Тогда 
			ЗапросПлановые = Новый Запрос;
			ЗапросПлановые.Текст = 
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Показатель1
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
			|			&парамНачало,
			|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
			|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
			|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА ВЫБОР
			|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
			|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
			|					КОНЕЦ
			|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
			|		КОНЕЦ В (&ВидыРасчетаПовышения)";
			
			ЗапросПлановые.УстановитьПараметр("парамНачало", ?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации)); //Аверсон 26.09.2019 КВВ СВФР-004826
			ЗапросПлановые.УстановитьПараметр("Сотрудник", Выборка.Сотрудник);
			
			ВидыПовышений = Новый СписокЗначений;
			Для Каждого стр из Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные Цикл 
				ВидыПовышений.Добавить(стр.ВидРасчета);
			КонецЦикла;
			
			ЗапросПлановые.УстановитьПараметр("ВидыРасчетаПовышения", ВидыПовышений);
			
			РезультатЗапроса = ЗапросПлановые.Выполнить().Выбрать();
			СуммаПовышений = 0;
			пока РезультатЗапроса.Следующий() Цикл 
				//СуммаПовышений = СуммаПовышений + ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * РезультатЗапроса.Показатель1/100, ПериодРегистрации, 1);
				
				//СВЭЙ 22.02.2024 КВВ СВФР-012096 (
				Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.РасчетПоСуммам Тогда
					СуммаПовышений = СуммаПовышений + РезультатЗапроса.Показатель1;
				Иначе
					//СВЭЙ 22.02.2024 КВВ СВФР-012096 )
					
					//Аверсон ЕАЕ 25.11.2025 СВФР-017393
					//СуммаПовышений = СуммаПовышений + Строка.Размер * РезультатЗапроса.Показатель1/100;  //Аверсон 26.09.2019 КВВ СВФР-004826
					СуммаПовышений = СуммаПовышений + ?(ОкруглениеКаждогоПовышения, ОбщегоНазначения.ОкруглитьПоВалюте(Строка.Размер * РезультатЗапроса.Показатель1/100, Константы.ВалютаРегламентированногоУчета.Получить()), 
														Строка.Размер * РезультатЗапроса.Показатель1/100);  
					//Аверсон СВФР-017393
					
				КонецЕсли;
			КонецЦикла;
			
			//СВЭЙ 22.02.2024 КВВ СВФР-012096 (
			Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.РасчетПоСуммам Тогда
				//Если ЗначениеЗаполнено(СтрокаДвижений.ГрафикРаботы) Тогда 
				//	ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
				//	Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),СтрокаДвижений.ГрафикРаботы));
				//	Если ЧасовВГоду.Размер = 0 Тогда 
				//		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
				//		Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
				//	КонецЕсли;
				//Иначе                        		
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(Строка.ДатаВыхода),Строка.ДатаВыхода,ПериодРегистрации),
				Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
				//КонецЕсли;
				Если ЧасовВГоду.Размер <> 0 Тогда
					Если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам Тогда
						СуммаПовышений = СуммаПовышений/ЧасовВГоду.Размер;
					КонецЕсли;					
				КонецЕсли;
				Строка.Размер = СуммаПовышений;
				Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((СуммаПовышений) * Выборка.Часов, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
			Иначе
				//СВЭЙ 22.02.2024 КВВ СВФР-012096 )
				если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням и не СпособРасчетаВЧасах Тогда //Островская Татьяна 24.04.2014 № 17310
					Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((Строка.Размер+СуммаПовышений) * Строка.ОтработаноДней, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
				иначе
					Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((Строка.Размер+СуммаПовышений) * Выборка.Часов, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
				КонецЕсли;
				
			КонецЕсли;			
			
		иначе
			
			если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням и не СпособРасчетаВЧасах Тогда //Островская Татьяна 24.04.2014 № 17310
				Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * Строка.ОтработаноДней, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
			иначе
				Строка.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(Строка.Размер * Выборка.Часов, ПериодРегистрации, 1);//О.Т. Аверсон 16.03.2016 № 949
			КонецЕсли;
			
		КонецЕсли;			
		//О.Т. Аверсон 19.03.2019 № 4089
		
		
		//заявка №1799
	КонецЦикла;
	//	Возврат Истина
	//Иначе
	//	Возврат Ложь
	//КонецЕсли;
	
КонецПроцедуры //ЗаполнитьРаботавшимиВПраздники()

//Аверсон ЕАЕ 24.05.2024 СВФР-012937
Функция БылНаряд(Сотр, Дат)
	Был = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
		|	И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,ДЕНЬ) = &Дат
		|   И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&СписокВидовРасчета)
		|   И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.СдельныйНаряд
		|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Праздники";
	
	Запрос.УстановитьПараметр("Дат", НачалоДня(Дат));
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	СписокВидовРасчета = Новый Массив;
	ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("сдельно выходной", Истина);
	Если Не ВР.Пустая() Тогда
		СписокВидовРасчета.Добавить(ВР);
	КонецЕсли;
	ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Сдельные допл. наряды и доплата за выходные", Истина);
	Если Не ВР.Пустая() Тогда
		СписокВидовРасчета.Добавить(ВР);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокВидовРасчета", СписокВидовРасчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Был = Истина;
	КонецЕсли;
	
	Возврат Был;
КонецФункции
//Аверсон СВФР-012937

// Выполняет перерасчет по заданному списку физлиц
// Если передан пустой список физлиц - перерасчет не проводится
// Если в качестве списка физлиц передан не массив, а Неопределено - перерасчет по всем физлицам 
// регистратора по которым требуется перерасчет
//
// Параметры
// 	Физлица - список значений - ссылки на физлиц
// Возвращаемое значение
//  Нет
//
Процедура Перерассчитать() Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	Если Не ПроведениеРасчетов.НеобходимостьПерерасчета(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////
	// Начисления
	
	НачатьТранзакцию();
	Прочитать();
	Выборка = СформироватьЗапросДляПерерасчета(Ссылка, ПериодРегистрации, , Истина).Выбрать();
	ЗафиксироватьТранзакцию();
	
	// если не перерассчитываем никого - возврат
	Если Выборка.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		СтрокаНачисления = Начисления.Найти(Выборка.НомерСтроки,"НомерСтроки");
		
		СтрокаНачисления.ПодразделениеОрганизации = Выборка.НовоеПодразделениеОрганизации;
		СтрокаНачисления.Размер = ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.НоваяТарифнаяСтавка,Константы.ВалютаРегламентированногоУчета.Получить());
		СтрокаНачисления.Результат = ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.НоваяТарифнаяСтавка * СтрокаНачисления.ОтработаноЧасов,Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЦикла;
	
	// записываем документ перед запросом для обновления регистров
	Записать();
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	// Получение учетной политики по персоналу организации
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	// получим реквизиты табличной части
	РезультатЗапросаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента);
	ВыборкаПоНачислениям = РезультатЗапросаПоНачислениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл 
		// Заполним записи в наборах записей регистров
		ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
	КонецЦикла;
	
	// записываем движения по регистрам
	Для Каждого НаборЗаписей Из Движения Цикл
		НаборЗаписей.Записать();
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////
	// Удалим записи перерасчета, по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры  // Перерассчитать()

// Заполняет документ для отобранного пользователем списка работников
//
// Параметры:
//	Запрос - запрос, полученный из настроенного пользователем построителя отчета
//							в обработке ФормированиеСпискаРаботников
//	Реквизиты - структура данных для заполнения, соответствующих реквизитам 
//							 т.ч.документа, пришедшая из обработки ФормированиеСпискаРаботников
//
Процедура Автозаполнение(Запрос = Неопределено, Реквизиты = Неопределено) Экспорт
	
	Если Запрос = Неопределено Или Реквизиты = Неопределено Тогда // не передали необходимых для заполнения данных
		Возврат
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// создаем временную таблицу ВТСписокРаботников с сотрудниками, отобранными по критериям пользователя 
	// 
	// Поля:
	//   Сотрудник
	//   Физлицо
	//   ФИО
	//   Подразделение
	//   ГрафикРаботы
	//
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("РегламентВалюта",	Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаВалютногоУчета",	ПериодРегистрации);
	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Год",				Год(Реквизиты.ДатаВыхода));
	Запрос.УстановитьПараметр("ТекущийМесяц",		НачалоМесяца(Реквизиты.ДатаВыхода));
	Запрос.УстановитьПараметр("ДатаВыхода",			Реквизиты.ДатаВыхода);
	Запрос.УстановитьПараметр("ОтработаноЧасов",	Реквизиты.ОтработаноЧасов);
	
	// НормаВремениПоСводнымИндивидуальнымГрафикам
	//		Сотрудники, для которых введены сводные данные об их графике
	// 
	//	Поля:
	//		Сотрудник
	//		ЧасовЗаМесяц - указанное пользователем значение
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоСводнымИндивидуальнымГрафикам
	|ИЗ
	|	ВТСписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	|			И (СводныеИндивидуальныеГрафики.Месяц = &ТекущийМесяц)
	|ГДЕ
	|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// НормаВремениПоЕжедневнымИндивидуальнымГрафикам
	//		Таблица сотрудников и нормы времени в часах, введенной индивидуальными графиками
	// 
	//	Поля:
	//		Сотрудник,
	//		ЧасовЗаМесяц - суммируем все часы рабочего времени
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени,	
	//	введенные доками ВводИндивидуальныхГрафиков, т.е. по строкам с выставленным флажком План
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам
	|ИЗ
	|	ВТСписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &ТекущийМесяц)
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРаботников.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// НормаВремениПоОбщимГрафикам
	//		Таблица сотрудников и нормы времени в часах по общим графикам
	// 
	//	Поля:
	//		Сотрудник,
	//		ЧасовЗаМесяц - суммируем все часы рабочего времени
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени для общих графиков
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоОбщимГрафикам
	|ИЗ
	|	ВТСписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО (ВЫБОР
	|				КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
	|						И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|					ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|				ИНАЧЕ СписокРаботников.ГрафикРаботы
	|			КОНЕЦ = ГрафикиРаботыПоВидамВремени.ГрафикРаботы)
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &ТекущийМесяц)
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРаботников.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// ДанныеИндивидуальныхГрафиковИТабелей
	//		Таблица сотрудников и рабочих дней при табельном учете времени
	// 
	//	Поля:
	//		РабочийДень - дата, отмеченная как рабочий день при табельном учете времени
	//		Сотрудник,
	//		Часы - суммируем все часы рабочего времени
	//      План - строка регистра записана либо инд.графиком либо табелем
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени,	
	//	введенные доками ВводИндивидуальныхГрафиков или Табель
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботыПоВидамВремени.План,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК Часы
	|ПОМЕСТИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	|ИЗ
	|	ВТСписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &ТекущийМесяц)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|			И (ГрафикиРаботыПоВидамВремени.Дата = &ДатаВыхода)
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// ОбщиеГрафикиРаботы
	//		Данные графиков работы
	// 
	//	Поля:
	//		РабочийДень - дата, отмеченная как рабочий день в индивидуальном графике
	//		ГрафикРаботы,
	//		Часы
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени для элементов спр-ка ГрафикиРаботы
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК Часы
	|ПОМЕСТИТЬ ВТОбщиеГрафикиРаботы
	|ИЗ
	|	ВТСписокРаботников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО (ВЫБОР
	|				КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
	|						И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|					ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|				ИНАЧЕ СписокРаботников.ГрафикРаботы
	|			КОНЕЦ = ГрафикиРаботыПоВидамВремени.ГрафикРаботы)
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &ТекущийМесяц)
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|			И (ГрафикиРаботыПоВидамВремени.Дата = &ДатаВыхода)
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// СотрудникиРазмерыНачислений 
	// таблица сотрудников с рассчитанной для каждого часовой тарифной ставкой
	// Поля:
	//   Сотрудник
	//   Физлицо
	//   ФИО
	//   ПодразделениеОрганизации
	//   ГрафикРаботы
	//   ДатаВыхода
	//   ОтработаноЧасов
	//   Размер
	//
	// Описание:
	//	
	// 	1) выбираем из ВТСписокРаботников список сотрудников, присоединяем из рег-ра ПлановыеНачисленияРаботниковОрганизаций
	//		данные об "основном" начислении - способ расчета, размер и валюту (с учетом возможжного использования тарифных разрядов)
	// 	2) рассчитываем часовую тарифную ставку в зависимости от порядка расчета основного начисления и от используемого 
	//      пользователями алгоритма пересчета оклада: либо по общероссийскому производственному календарю (с использованием
	//      среднемесячного количества часов и длительности рабочей недели графика), либо по графику работника
	//      данные по рабочим и предпраздничным дням выбираются из РегистрСведений.РегламентированныйПроизводственныйКалендарь	
	//      
	
	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиИНачисления.Сотрудник,
	|	РаботникиИНачисления.Физлицо,
	|	РаботникиИНачисления.ФИО,
	|	РаботникиИНачисления.ПодразделениеОрганизации,
	|	РаботникиИНачисления.ГрафикРаботы,
	|	&ТекущийМесяц КАК ТекущийМесяц,
	|	&ДатаВыхода КАК ДатаВыхода,
	|	&ОтработаноЧасов КАК ОтработаноЧасов,
	|	РаботникиИНачисления.ДлительностьРабочейНедели,ДанныеПроизводственногоКалендаря.ЧислоРабочихДней,ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней,
	|	ВЫБОР
	|		КОГДА РаботникиИНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
	|			ТОГДА РаботникиИНачисления.ОкладТариф
	|		КОГДА РаботникиИНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням))
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую, ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)) = ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) = 0
	|										ТОГДА 0
	|									КОГДА РаботникиИНачисления.ДлительностьРабочейНедели = 0
	|										ТОГДА 0
	|									ИНАЧЕ РаботникиИНачисления.ОкладТариф / (РаботникиИНачисления.ДлительностьРабочейНедели / 5 * (ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) + ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) - ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) * 12
	|								КОНЕЦ
	|						КОГДА ВЫБОР
	|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
	|							КОНЕЦ = 0
	|							ТОГДА 0
	|						ИНАЧЕ РаботникиИНачисления.ОкладТариф / ВЫБОР
	|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
	|		КОГДА РаботникиИНачисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА РаботникиИНачисления.ДлительностьРабочейНедели = 0
	|							ТОГДА 0
	|						ИНАЧЕ РаботникиИНачисления.ОкладТариф / РаботникиИНачисления.ДлительностьРабочейНедели * ВЫБОР
	|								КОГДА РаботникиИНачисления.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
	|									ТОГДА 6
	|								ИНАЧЕ 5
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, "+ЗначениеОкругления+"))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Размер
	|ПОМЕСТИТЬ ВТСотрудникиРазмерыНачислений
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокРаботников.Сотрудник КАК Сотрудник,
	|		СписокРаботников.ФИО КАК ФИО,
	|		СписокРаботников.Физлицо КАК Физлицо,
	|		СписокРаботников.Подразделение КАК ПодразделениеОрганизации,
	|		СписокРаботников.ГрафикРаботы КАК ГрафикРаботы,
	|		ЕСТЬNULL(ВЫБОР
	|				КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
	|						И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|					ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели
	|				ИНАЧЕ СписокРаботников.ГрафикРаботы.ДлительностьРабочейНедели
	|			КОНЕЦ, 0) КАК ДлительностьРабочейНедели,
	|		СписокРаботников.ГрафикРаботы.ВидГрафика КАК ВидГрафика,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаВыхода
	|					И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|							ТОГДА РазмерТарифныхСтавокСрезПоследних.Размер
	|						ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1Завершения
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.ТребуетВводаТарифногоРазряда
	|						ТОГДА РазмерТарифныхСтавокСрезПоследних.Размер
	|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
	|				КОНЕЦ
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаВыхода
	|							И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ВЫБОР
	|								КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|									ТОГДА РазмерТарифныхСтавокСрезПоследних.Валюта
	|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1Завершения
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.ТребуетВводаТарифногоРазряда
	|								ТОГДА РазмерТарифныхСтавокСрезПоследних.Валюта
	|							ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1
	|						КОНЕЦ
	|				КОНЕЦ В (&РегламентВалюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
	|		КОНЕЦ КАК ОкладТариф,
	|		ВЫБОР
	|			КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаВыхода
	|					И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаЗавершения.СпособРасчета
	|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.СпособРасчета
	|		КОНЕЦ КАК СпособРасчета
	|	ИЗ
	|		ВТСписокРаботников КАК СписокРаботников
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|					&ДатаВыхода,
	|					ВидРасчетаИзмерение.Ссылка ЕСТЬ NULL 
	|						И Сотрудник В
	|							(ВЫБРАТЬ
	|								ВТСписокРаботников.Сотрудник
	|							ИЗ
	|								ВТСписокРаботников)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ДатаВыхода, ) КАК РазмерТарифныхСтавокСрезПоследних
	|				ПО (ВЫБОР
	|						КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаВыхода
	|								И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ТарифныйРазряд1Завершения
	|						ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ТарифныйРазряд1
	|					КОНЕЦ = РазмерТарифныхСтавокСрезПоследних.ТарифныйРазряд)
	|			ПО СписокРаботников.Сотрудник = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
	|			ПО (Валюты.Период = &ДатаВалютногоУчета)
	|				И (Валюты.Валюта = ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаВыхода
	|							И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ВЫБОР
	|								КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|									ТОГДА РазмерТарифныхСтавокСрезПоследних.Валюта
	|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1Завершения
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета.ТребуетВводаТарифногоРазряда
	|								ТОГДА РазмерТарифныхСтавокСрезПоследних.Валюта
	|							ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Валюта1
	|						КОНЕЦ
	|				КОНЕЦ)) КАК РаботникиИНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоСводнымИндивидуальнымГрафикам КАК НормаВремениПоСводнымИндивидуальнымГрафикам
	|		ПО РаботникиИНачисления.Сотрудник = НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам КАК НормаВремениПоЕжедневнымИндивидуальнымГрафикам
	|		ПО РаботникиИНачисления.Сотрудник = НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоОбщимГрафикам КАК НормаВремениПоОбщимГрафикам
	|		ПО РаботникиИНачисления.Сотрудник = НормаВремениПоОбщимГрафикам.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоРабочихДней,
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоПредпраздничныхДней
	|		ИЗ
	|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ГДЕ
	|			РегламентированныйПроизводственныйКалендарь.Год = &Год) КАК ДанныеПроизводственногоКалендаря
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
	|		ПО (ИСТИНА)";
	Запрос.Выполнить();
	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокРаботников.ФИО КАК ФИО,
	|	СписокРаботников.Сотрудник,
	|	СписокРаботников.Физлицо,
	|	СписокРаботников.ПодразделениеОрганизации,
	|	СписокРаботников.ДатаВыхода КАК ДатаВыхода,
	|	СписокРаботников.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ВЫРАЗИТЬ(СписокРаботников.Размер КАК ЧИСЛО(15, "+ЗначениеОкругления+")) КАК Размер,
	|	ВЫРАЗИТЬ(СписокРаботников.ОтработаноЧасов * СписокРаботников.Размер КАК ЧИСЛО(15, "+ЗначениеОкругления+"))  КАК Результат,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФактическиОтработано.Часы, 0) = 0 И ЕСТЬNULL(ДанныеИндивидуальныхГрафиков.Часы, ОбщиеГрафикиРаботы.Часы) = 0 
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходные)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаПраздничныеИВыходныеПоГрафику) 
	|	КОНЕЦ КАК ВидРасчета
	|ИЗ
	|	ВТСотрудникиРазмерыНачислений КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщиеГрафикиРаботы КАК ОбщиеГрафикиРаботы
	|		ПО СписокРаботников.Сотрудник = ОбщиеГрафикиРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ДанныеИндивидуальныхГрафиков
	|		ПО СписокРаботников.Сотрудник = ДанныеИндивидуальныхГрафиков.Сотрудник
	|			И (ДанныеИндивидуальныхГрафиков.План)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ФактическиОтработано
	|		ПО СписокРаботников.Сотрудник = ФактическиОтработано.Сотрудник
	|			И ((НЕ ФактическиОтработано.План))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокРаботников.ФИО,
	|	СписокРаботников.Сотрудник,
	|	СписокРаботников.Физлицо,
	|	СписокРаботников.ПодразделениеОрганизации,
	|	СписокРаботников.ДатаВыхода,
	|	СписокРаботников.ОтработаноЧасов,
	|	СписокРаботников.Размер,
	|	ВЫРАЗИТЬ(СписокРаботников.ОтработаноЧасов * СписокРаботников.Размер КАК ЧИСЛО(15, "+ЗначениеОкругления+")),
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПраздничныхИВыходных)
	|ИЗ
	|	ВТСотрудникиРазмерыНачислений КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщиеГрафикиРаботы КАК ОбщиеГрафикиРаботы
	|		ПО СписокРаботников.Сотрудник = ОбщиеГрафикиРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ДанныеИндивидуальныхГрафиков
	|		ПО СписокРаботников.Сотрудник = ДанныеИндивидуальныхГрафиков.Сотрудник
	|			И (ДанныеИндивидуальныхГрафиков.План)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ФактическиОтработано
	|		ПО СписокРаботников.Сотрудник = ФактическиОтработано.Сотрудник
	|			И ((НЕ ФактическиОтработано.План))
	|ГДЕ
	|	ЕСТЬNULL(ФактическиОтработано.Часы, 0) = 0
	|	И ЕСТЬNULL(ДанныеИндивидуальныхГрафиков.Часы, ОбщиеГрафикиРаботы.Часы) = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО,
	|	ВидРасчета";
	
	Результ = Запрос.Выполнить().Выгрузить();
	//О.Т. Аверсон 19.05.2017 № 656 изменен расчет Ставки
	Начисления.Очистить();
	Для Каждого стр из Результ Цикл 
		СтрНачисления = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНачисления,стр);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник
		|				И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета";
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Сотрудник", стр.Сотрудник);
		Запрос.УстановитьПараметр("Период", ПериодРегистрации);
		мСписокВидов = Новый СписокЗначений;
		мСписок = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
		Пока мСписок.Следующий() Цикл
			мСписокВидов.Добавить(мСписок.ВидРасчета);
		КонецЦикла;
		Запрос.УстановитьПараметр("ВидРасчета", мСписокВидов);
		
		мРезультат = Запрос.Выполнить().Выбрать();
		
		Пока мРезультат.Следующий() Цикл
			ВидРасчета = мРезультат.ВидРасчета;
		КонецЦикла;
		
		
		
		ДатаАктуальности = ?(ЗначениеЗаполнено(стр.ДатаВыхода), стр.ДатаВыхода, Дата);
		
		
		// Рассчитаем часовую тарифную ставку работника 
		мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
		Новый Структура("Организация, Сотрудник", Организация, стр.Сотрудник));
		
		Если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
			ЧасовойТариф = Окр(ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, стр.Сотрудник, ДатаАктуальности, мСтрока.ГрафикРаботы, Истина, Ложь,,,,,СпособРасчетаВЧасах), 3);//О.Т. 27.01.2015
		иначе
			Если Организация.ИНН = "100071565" Тогда 
				ЧасовойТариф =  ОбщегоНазначения.ОкруглитьЗначение2016(ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, стр.Сотрудник, ДатаАктуальности, мСтрока.ГрафикРаботы, Истина, Ложь,,,,Истина,СпособРасчетаВЧасах), ПериодРегистрации);//Без контракта
			Иначе
				ЧасовойТариф =  ОбщегоНазначения.ОкруглитьЗначение2016(ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, стр.Сотрудник, ДатаАктуальности, мСтрока.ГрафикРаботы, Истина, Ложь,,,,,СпособРасчетаВЧасах), ПериодРегистрации);//О.Т. 27.01.2015 949
			КонецЕсли;
		КонецЕсли;
		
		СтрНачисления.Размер = ЧасовойТариф;
		
		// Расчет суммы начисления
		мСумма = Прочиепроцедуры.ПолучитьВыработкуЗаДень(ДатаАктуальности, ДатаАктуальности, стр.Сотрудник, Организация);
		Если мСумма <> 0 Тогда
			СтрНачисления.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(мСумма, ПериодРегистрации);//О.Т. Аверсон 16.03.2016 № 949
		Иначе
			//Островская Татьяна 08.02.2013 № 16
			если ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням и не СпособРасчетаВЧасах Тогда //Островская Татьяна 13.05.2014 № 17353
				СтрНачисления.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(СтрНачисления.Размер * СтрНачисления.ОтработаноДней, ПериодРегистрации); //О.Т. Аверсон 16.03.2016 № 949
			иначе
				СтрНачисления.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(СтрНачисления.Размер * СтрНачисления.ОтработаноЧасов, ПериодРегистрации);//О.Т. Аверсон 16.03.2016 № 949
			КонецЕсли;
			//Островская Татьяна 08.02.2013 № 16
		КонецЕсли;
		
	КонецЦикла;
	//О.Т. Аверсон 19.05.2017 № 656
	
КонецПроцедуры //Автозаполнение()

// Заполняет документ по перерассчитываемому документу
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
	"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	
	ПериодПерерассчитываемогоДокумента = ИсходныйДокумент.ПериодРегистрации;
	Выборка = СформироватьЗапросДляПерерасчета(ПерерассчитываемыйДокумент, ПериодПерерассчитываемогоДокумента, Сотрудники).Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// сторно-строка
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Сотрудник					= Выборка.Сотрудник;
		НоваяСтрока.Физлицо						= Выборка.Физлицо;
		НоваяСтрока.ПодразделениеОрганизации	= Выборка.ПодразделениеОрганизации;
		НоваяСтрока.ДатаВыхода					= Выборка.ДатаВыхода;
		НоваяСтрока.ВидРасчета					= Выборка.ВидРасчета;
		НоваяСтрока.Размер						= Выборка.Размер;
		НоваяСтрока.ОтработаноЧасов				= - Выборка.ОтработаноЧасов;
		НоваяСтрока.Результат					= - Выборка.Результат;
		НоваяСтрока.Сторно						= Истина;
		
		// новая рассчитываемая строка
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Сотрудник					= Выборка.Сотрудник;
		НоваяСтрока.Физлицо						= Выборка.Физлицо;
		НоваяСтрока.ПодразделениеОрганизации	= Выборка.НовоеПодразделениеОрганизации;
		НоваяСтрока.ДатаВыхода					= Выборка.ДатаВыхода;
		НоваяСтрока.ВидРасчета					= Выборка.ВидРасчета;
		НоваяСтрока.Размер						= ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.НоваяТарифнаяСтавка,Константы.ВалютаРегламентированногоУчета.Получить());
		НоваяСтрока.ОтработаноЧасов				= Выборка.ОтработаноЧасов;
		НоваяСтрока.Результат					= ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.НоваяТарифнаяСтавка * Выборка.ОтработаноЧасов,Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЦикла;
	
КонецПроцедуры  // ЗаполнитьПоПерерассчитываемомуДокументу()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует запрос для заполнения ТЧ документа по данным перерасчетов
Функция СформироватьЗапросДляПерерасчета(ДокументСсылка, ПериодРегистрацииДокумента, Сотрудники = Неопределено, ПоЗаписямПерерасчета = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ДокументСсылка",		ДокументСсылка);
	Запрос.УстановитьПараметр("РегламентВалюта",	Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаВалютногоУчета",	ПериодРегистрацииДокумента);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Сотрудники",			Сотрудники);
	Запрос.УстановитьПараметр("ПоВсемСотрудникам",	Ложь);
	
	Если ЗначениеЗаполнено(Сотрудники) Тогда // этих сотрудников попросил исправить пользователь
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка В(&Сотрудники)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";	
	ИначеЕсли ПоЗаписямПерерасчета Тогда //  список физлиц для перерасчета получим из таблицы перерасчетов
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Сотрудник КАК Ссылка
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &ДокументСсылка
		|	И СотрудникиОрганизаций.Физлицо В
		|			(ВЫБРАТЬ
		|				Перерасчет.ФизЛицо
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
		|			ГДЕ
		|				Перерасчет.ОбъектПерерасчета = &ДокументСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	Иначе 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Ссылка
		|ПОМЕСТИТЬ ВТСотрудники";
		Запрос.УстановитьПараметр("ПоВсемСотрудникам",	Истина);
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	Начисления.ПодразделениеОрганизации,
	|	Начисления.ДатаВыхода,
	|	НАЧАЛОПЕРИОДА(Начисления.ДатаВыхода, МЕСЯЦ) КАК ТекущийМесяц,
	|	Начисления.ВидРасчета,
	|	Начисления.Размер,
	|	Начисления.ОтработаноЧасов,
	|	Начисления.Результат
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &ДокументСсылка
	|	И (НЕ Начисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ Начисления.Сотрудник В
	|				(ВЫБРАТЬ
	|					Сотрудники.Ссылка
	|				ИЗ
	|					ВТСотрудники КАК Сотрудники))
	|	И Начисления.Ссылка.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// НормаВремениПоСводнымИндивидуальнымГрафикам
	//		Таблица строк документа и нормы времени в часах, введенной сводными индивидуальными графиками
	// 
	//	Поля:
	//		НомерСтроки,
	//		ЧасовЗаМесяц - суммируем все часы рабочего времени
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра СводныеИндивидуальныеГрафики, соответствующие дате из строки документа	
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.НомерСтроки КАК НомерСтроки,
	|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоСводнымИндивидуальнымГрафикам
	|ИЗ
	|	ВТНачисления КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	|			И СписокРаботников.ТекущийМесяц = СводныеИндивидуальныеГрафики.Месяц
	|ГДЕ
	|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// НормаВремениПоЕжедневнымИндивидуальнымГрафикам
	//		Таблица строк документа и нормы времени в часах, введенной индивидуальными графиками
	// 
	//	Поля:
	//		НомерСтроки,
	//		ЧасовЗаМесяц - суммируем все часы рабочего времени
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени,	
	//	введенные доками ВводИндивидуальныхГрафиков, т.е. по строкам с выставленным флажком План
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.НомерСтроки КАК НомерСтроки,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам
	|ИЗ
	|	ВТНачисления КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СписокРаботников.ТекущийМесяц = ГрафикиРаботыПоВидамВремени.Месяц
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРаботников.НомерСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// РаботникиИНачисления
	//		Таблица строк документа с добавленными сведениями о работниках и их начислениях
	// 
	//	Поля:
	//		НомерСтроки,
	//		Сотрудник 
	//		ДатаВыхода 
	//		ОкладТариф - размер основного начисления по состоянию на дату ДатаВыхода 
	//		СпособРасчета - способ расчета основного начисления по состоянию на дату ДатаВыхода 
	//		НовоеПодразделениеОрганизации - подразделение сотрудника по состоянию на дату ДатаВыхода 
	//		ГрафикРаботы - график сотрудника по состоянию на дату ДатаВыхода 
	//		ВидГрафика,
	//		ДлительностьРабочейНедели - реквизиты графика сотрудника по состоянию на дату ДатаВыхода 
	// 
	// Описание:
	//
	//	1. к каждой строке документа приписываем данные из "псевдосрезов" последних по регистрам	
	//	ПлановыеНачисленияРаботниковОрганизаций и РаботникиОрганизаций
	//  2. для определения размер основного начисления по состоянию на дату ДатаВыхода дополнительно
	//  пользуемся "псевдосрезом" последних по регистру РазмерТарифныхСтавок и курсами валют
	//
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.Сотрудник,
	|	Начисления.ДатаВыхода,
	|	Начисления.ТекущийМесяц,
	|	ВЫБОР
	|		КОГДА ОсновноеНачисление.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА РазмерТарифныхСтавок.Размер
	|					ИНАЧЕ ОсновноеНачисление.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА РазмерТарифныхСтавок.Размер
	|				ИНАЧЕ ОсновноеНачисление.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ * ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОсновноеНачисление.ПериодЗавершения <= Начисления.ДатаВыхода
	|						И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ВЫБОР
	|							КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|								ТОГДА РазмерТарифныхСтавок.Валюта
	|							ИНАЧЕ ОсновноеНачисление.Валюта1Завершения
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|							ТОГДА РазмерТарифныхСтавок.Валюта
	|						ИНАЧЕ ОсновноеНачисление.Валюта1
	|					КОНЕЦ
	|			КОНЕЦ В (&РегламентВалюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
	|	КОНЕЦ КАК ОкладТариф,
	|	ВЫБОР
	|		КОГДА ОсновноеНачисление.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновноеНачисление.ВидРасчетаЗавершения.СпособРасчета
	|		ИНАЧЕ ОсновноеНачисление.ВидРасчета.СпособРасчета
	|	КОНЕЦ КАК СпособРасчета,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
	|	КОНЕЦ КАК НовоеПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СокращенноеРабочееВремя
	|							И РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени
	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботыЗавершения
	|				КОНЕЦ
	|		КОГДА РаботникиОрганизации.ГрафикРаботы.СокращенноеРабочееВремя
	|				И РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СокращенноеРабочееВремя
	|							И РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели
	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботыЗавершения.ДлительностьРабочейНедели
	|				КОНЕЦ
	|		КОГДА РаботникиОрганизации.ГрафикРаботы.СокращенноеРабочееВремя
	|				И РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ДлительностьРабочейНедели
	|	КОНЕЦ КАК ДлительностьРабочейНедели,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= Начисления.ДатаВыхода
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.ВидГрафика
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ВидГрафика
	|	КОНЕЦ КАК ВидГрафика
	|ПОМЕСТИТЬ ВТРаботникиИНачисления
	|ИЗ
	|	ВТНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Начисления.НомерСтроки КАК НомерСтроки,
	|			Начисления.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	|		ИЗ
	|			ВТНачисления КАК Начисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ПО Начисления.ДатаВыхода >= РаботникиОрганизации.Период
	|					И Начисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Начисления.НомерСтроки,
	|			Начисления.Сотрудник) КАК ДатыПоследнихНазначений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|			ПО ДатыПоследнихНазначений.Период = РаботникиОрганизации.Период
	|				И ДатыПоследнихНазначений.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ПО Начисления.НомерСтроки = ДатыПоследнихНазначений.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Начисления.НомерСтроки КАК НомерСтроки,
	|			Начисления.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ПлановыеНачисления.Период) КАК Период
	|		ИЗ
	|			ВТНачисления КАК Начисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисления
	|				ПО Начисления.Сотрудник = ПлановыеНачисления.Сотрудник
	|					И Начисления.ДатаВыхода >= ПлановыеНачисления.Период
	|					И (ПлановыеНачисления.ВидРасчетаИзмерение.Ссылка ЕСТЬ NULL )
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Начисления.НомерСтроки,
	|			Начисления.Сотрудник) КАК ДатыПоследнихПлановыхНачислений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ОсновноеНачисление
	|			ПО ДатыПоследнихПлановыхНачислений.Сотрудник = ОсновноеНачисление.Сотрудник
	|				И ДатыПоследнихПлановыхНачислений.Период = ОсновноеНачисление.Период
	|				И (ОсновноеНачисление.ВидРасчетаИзмерение.Ссылка ЕСТЬ NULL )
	|		ПО Начисления.НомерСтроки = ДатыПоследнихПлановыхНачислений.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Начисления.НомерСтроки КАК НомерСтроки,
	|			РазмерТарифныхСтавок.ТарифныйРазряд КАК ТарифныйРазряд,
	|			МАКСИМУМ(РазмерТарифныхСтавок.Период) КАК ПериодРазряда
	|		ИЗ
	|			ВТНачисления КАК Начисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
	|				ПО Начисления.ДатаВыхода >= РазмерТарифныхСтавок.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РазмерТарифныхСтавок.ТарифныйРазряд,
	|			Начисления.НомерСтроки) КАК ДатыТарифныхРазрядов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
	|			ПО ДатыТарифныхРазрядов.ПериодРазряда = РазмерТарифныхСтавок.Период
	|				И ДатыТарифныхРазрядов.ТарифныйРазряд = РазмерТарифныхСтавок.ТарифныйРазряд
	|		ПО Начисления.НомерСтроки = ДатыТарифныхРазрядов.НомерСтроки
	|			И (ВЫБОР
	|				КОГДА ОсновноеНачисление.ПериодЗавершения <= Начисления.ДатаВыхода
	|						И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ВЫБОР
	|							КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|								ТОГДА ОсновноеНачисление.ТарифныйРазряд1
	|							ИНАЧЕ NULL
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|							ТОГДА ОсновноеНачисление.ТарифныйРазряд1
	|						ИНАЧЕ NULL
	|					КОНЕЦ
	|			КОНЕЦ = ДатыТарифныхРазрядов.ТарифныйРазряд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
	|		ПО (Валюты.Валюта = ВЫБОР
	|				КОГДА ОсновноеНачисление.ПериодЗавершения <= Начисления.ДатаВыхода
	|						И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ВЫБОР
	|							КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|								ТОГДА РазмерТарифныхСтавок.Валюта
	|							ИНАЧЕ ОсновноеНачисление.Валюта1Завершения
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|							ТОГДА РазмерТарифныхСтавок.Валюта
	|						ИНАЧЕ ОсновноеНачисление.Валюта1
	|					КОНЕЦ
	|			КОНЕЦ)
	|			И (Валюты.Период = &ДатаВалютногоУчета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// НормаВремениПоОбщимГрафикам
	//		Таблица строк документа и нормы времени в часах по общим графикам
	// 
	//	Поля:
	//		Сотрудник,
	//		ЧасовЗаМесяц - суммируем все часы рабочего времени
	// 
	// Описание:
	//
	//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени для общих графиков
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписокРаботников.НомерСтроки КАК НомерСтроки,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
	|ПОМЕСТИТЬ ВТНормаВремениПоОбщимГрафикам
	|ИЗ
	|	ВТРаботникиИНачисления КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СписокРаботников.ТекущийМесяц = ГрафикиРаботыПоВидамВремени.Месяц
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокРаботников.НомерСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// основной запрос - по собранным данным рассчитываем часовую тарифную ставку в зависимости 
	// от порядка расчета основного начисления и от используемого пользователями алгоритма пересчета оклада: 
	// либо по общероссийскому производственному календарю (с использованием 
	// среднемесячного количества часов и длительности рабочей недели графика), либо по графику работника
	// данные по рабочим и предпраздничным дням выбираются из РегистрСведений.РегламентированныйПроизводственныйКалендарь	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.НомерСтроки,
	|	Начисления.Сотрудник,
	|	Начисления.Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаВыхода,
	|	Начисления.Размер,
	|	Начисления.Результат,
	|	Начисления.ПодразделениеОрганизации,
	|	Начисления.ОтработаноЧасов,
	|	РаботникиИНачисления.НовоеПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиИНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
	|			ТОГДА РаботникиИНачисления.ОкладТариф
	|		КОГДА РаботникиИНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням))
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую, ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)) = ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) = 0
	|										ТОГДА 0
	|									КОГДА РаботникиИНачисления.ДлительностьРабочейНедели = 0
	|										ТОГДА 0
	|									ИНАЧЕ РаботникиИНачисления.ОкладТариф / (РаботникиИНачисления.ДлительностьРабочейНедели / 5 * (ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) + ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) - ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) * 12
	|								КОНЕЦ
	|						КОГДА ВЫБОР
	|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.НомерСтроки ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.НомерСтроки ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
	|							КОНЕЦ = 0
	|							ТОГДА 0
	|						ИНАЧЕ РаботникиИНачисления.ОкладТариф / ВЫБОР
	|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.НомерСтроки ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.НомерСтроки ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, 3))
	|		КОГДА РаботникиИНачисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА РаботникиИНачисления.ДлительностьРабочейНедели = 0
	|							ТОГДА 0
	|						ИНАЧЕ РаботникиИНачисления.ОкладТариф / РаботникиИНачисления.ДлительностьРабочейНедели * ВЫБОР
	|								КОГДА РаботникиИНачисления.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
	|									ТОГДА 6
	|								ИНАЧЕ 5
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, 3))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НоваяТарифнаяСтавка
	|ИЗ
	|	ВТНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиИНачисления КАК РаботникиИНачисления
	|		ПО Начисления.НомерСтроки = РаботникиИНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоСводнымИндивидуальнымГрафикам КАК НормаВремениПоСводнымИндивидуальнымГрафикам
	|		ПО Начисления.НомерСтроки = НормаВремениПоСводнымИндивидуальнымГрафикам.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам КАК НормаВремениПоЕжедневнымИндивидуальнымГрафикам
	|		ПО Начисления.НомерСтроки = НормаВремениПоЕжедневнымИндивидуальнымГрафикам.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоОбщимГрафикам КАК НормаВремениПоОбщимГрафикам
	|		ПО Начисления.НомерСтроки = НормаВремениПоОбщимГрафикам.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГодаОплаты.ГодВыхода КАК ГодВыхода,
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоРабочихДней,
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоПредпраздничныхДней
	|		ИЗ
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ГОД(ОплатаПраздничных.ДатаВыхода) КАК ГодВыхода
	|			ИЗ
	|				ВТНачисления КАК ОплатаПраздничных) КАК ГодаОплаты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|				ПО (ГодаОплаты.ГодВыхода = ГОД(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГодаОплаты.ГодВыхода) КАК ДанныеПроизводственногоКалендаря
	|		ПО (ГОД(Начисления.ДатаВыхода) = ДанныеПроизводственногоКалендаря.ГодВыхода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
	|		ПО (ИСТИНА)";
	
	Возврат Запрос.Выполнить();
	
КонецФункции  // СформироватьЗапросДляПерерасчета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Дата,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация,
	|	ВЫБОР
	|		КОГДА ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация
	|		ИНАЧЕ ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация КАК ОбособленноеПодразделение,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПериодРегистрации,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ответственный,
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ссылка
	|ИЗ
	|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций КАК ОплатаПраздничныхИВыходныхДнейОрганизаций
	|ГДЕ
	|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры:
//	Режим		- режим проведения.
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	
	Запрос = Новый Запрос;
	
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ПустаяДата",						'00010101');
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ГоловнаяОрганизация);
	КодОплатыТрудаПоНДФЛ = Новый Массив;
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.КодДоходаПоУмолчанию);
	//КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код2012);
	Запрос.УстановитьПараметр("КодОплатыТрудаПоНДФЛ", КодОплатыТрудаПоНДФЛ);
	
	// Описание текста запроса:
	// 1. Выборка "ТЧНачисления":
	//		Выбираются строки документа.
	// 2. Выборка "ПересекающиесяСтроки":
	//		Среди остальных строк документа ищем строки, имеющие пересекающийся период действия
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник,
	|	ТЧНачисления.Сотрудник.Наименование,
	|	ТЧНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|	ТЧНачисления.ПодразделениеОрганизации,
	|	ТЧНачисления.ДатаВыхода КАК ДатаВыхода,
	|	ЕСТЬNULL(ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени, 0) КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ТЧНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
	|			ТОГДА ТЧНачисления.ДатаВыхода
	|		ИНАЧЕ ТЧНачисления.Ссылка.ПериодРегистрации
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	ТЧНачисления.Размер,
	|	ТЧНачисления.Результат,
	|	ТЧНачисления.Сторно,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.Сторно
	|			ТОГДА ТЧНачисления.Ссылка.ПерерассчитываемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧНачисления.ДатаВыхода
	|							И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> &ПустаяДата
	|						ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
	|					ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
	|				КОНЕЦ
	|		ИНАЧЕ ТЧНачисления.Сотрудник
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧНачисления.ДатаВыхода
	|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> &ПустаяДата
	|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
	|	ВЫБОР
	|		КОГДА (НЕ ТЧНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ДатыПоследнихДвиженийРаботников.Период КАК ДатаПоследнегоДвиженияПоРаботнику
	|ИЗ
	|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК Период
	|		ИЗ
	|			Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК ТЧНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ПО (РаботникиОрганизации.Период <= ТЧНачисления.ДатаВыхода)
	|					И ТЧНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ГДЕ
	|			ТЧНачисления.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧНачисления.НомерСтроки) КАК ДатыПоследнихДвиженийРаботников
	|		ПО ТЧНачисления.НомерСтроки = ДатыПоследнихДвиженийРаботников.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|		ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
	|			И ТЧНачисления.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧНачисления2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК ТЧНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК ТЧНачисления2
	|				ПО (ТЧНачисления2.Ссылка = &ДокументСсылка)
	|					И ТЧНачисления.ВидРасчета = ТЧНачисления2.ВидРасчета
	|					И ТЧНачисления.НомерСтроки > ТЧНачисления2.НомерСтроки
	|					И ТЧНачисления.ДатаВыхода = ТЧНачисления2.ДатаВыхода
	|					И ТЧНачисления.Сотрудник = ТЧНачисления2.Сотрудник
	|		ГДЕ
	|			ТЧНачисления.Ссылка = &ДокументСсылка
	|			И (НЕ ТЧНачисления.Сторно)
	|			И (НЕ ТЧНачисления2.Сторно)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧНачисления.НомерСтроки) КАК ПересекающиесяСтроки
	|		ПО ТЧНачисления.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ПО СтрокиНачисления.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаВыхода, МЕСЯЦ))
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка) КАК ГрафикРаботыПоСотруднику
	|		ПО ТЧНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|ГДЕ
	|	ТЧНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации (месяц)!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса по товарам документа, 
//	Отказ 						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение организации!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаВыхода
	НетДатаВыхода = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаВыхода);
	Если НетДатаВыхода Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата выхода на работу!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид оплаты!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НетСотрудника ИЛИ НетДатаВыхода Тогда
		Возврат; // Дальше не проверяем
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + " указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка: ранее работник должен быть принят на работу
	Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = NULL Тогда
		СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаВыхода, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " еще не принят на работу!";
		Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = 0 Тогда
		СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаВыхода, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен (с " + Формат(ВыборкаПоСтрокамДокумента.ДатаПоследнегоДвиженияПоРаботнику, "ДЛФ=DD") + ")!";
		Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		
	КонецЕсли;
	
	// График работы
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан рабочий график!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка: противоречие другой строке документа
	Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
		Сообщить("указана повторяющаяся строка (см. строку  № " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"); 
		//Отказ = Ложь;
		//ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачислений()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Движение = Движения.ОсновныеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.ПериодРегистрации			= ВыборкаПоШапкеДокумента.ПериодРегистрации;
	Движение.ПериодДействияНачало		= ВыборкаПоСтрокамДокумента.ДатаВыхода;
	Движение.ПериодДействияКонец		= КонецДня(ВыборкаПоСтрокамДокумента.ДатаВыхода);
	Движение.ВидРасчета					= ВыборкаПоСтрокамДокумента.ВидРасчета;
	Движение.Сторно						= ВыборкаПоСтрокамДокумента.Сторно;
	
	// Измерения
	Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ФизЛицо					= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	// Ресурсы
	Движение.Результат					= ВыборкаПоСтрокамДокумента.Результат;
	Движение.ОплаченоДнейЧасов		= ВыборкаПоСтрокамДокумента.ОтработаноЧасов;
	//толик
	
	//заявка №1799 (база заявок Кристалла) Дмитрук О.Г.
	//Движение.ОплаченоДней			= 1;
	Движение.ОплаченоДней			= ВыборкаПоСтрокамДокумента.ОтработаноЧасов / 8;
	//заявка №1799
	
	// ресурсы по отработанному времени
	Если ВыборкаПоСтрокамДокумента.ЗачетОтработанногоВремени Тогда
		//толик		
		Движение.ОтработаноЧасов		= ВыборкаПоСтрокамДокумента.ОтработаноЧасов;//О.Т. 28.05.2015 № Раскомментировать
		//не надо		
		Движение.ОтработаноДней			= ?(ВыборкаПоСтрокамДокумента.ОтработаноЧасов < 0,-1,1);//О.Т. 28.05.2015 № Раскомментировать
	КонецЕсли;
	
	// Реквизиты
	Движение.Показатель1				= ВыборкаПоСтрокамДокумента.Размер;
	Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
	Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
	Движение.ВидУчетаВремени			= Перечисления.ВидыУчетаВремени.ПоЧасам;
	Движение.ДатаНачалаСобытия			= ВыборкаПоСтрокамДокумента.ДатаВыхода;
	Движение.СторнируемыйДокумент		= ВыборкаПоСтрокамДокумента.СторнируемыйДокумент;	
	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента						- выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) Тогда
		
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоТЧ.МесяцНалоговогоПериода;
		
		// Измерения
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо					= ВыборкаПоТЧ.ФизЛицо;
		Движение.КодДохода					= ВыборкаПоТЧ.КодДоходаНДФЛ;
		Движение.ПериодРегистрации			= НачалоМесяца(ПериодРегистрации);
		
		// Ресурсы
		Движение.СуммаДохода				= ВыборкаПоТЧ.Результат;
		
		// Реквизиты
		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ИсчисленоИзЗарплаты		= Истина;
		Движение.ПодразделениеОрганизации = ВыборкаПоТЧ.ПодразделениеОрганизации; 
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
	// Измерения
	Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
	Движение.ФизЛицо				= ВыборкаПоТЧ.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
	КонецЕсли;
	
	// Ресурсы
	Движение.СуммаВзаиморасчетов	= ВыборкаПоТЧ.Результат;
	
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// Получение учетной политики по персоналу организации
			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
			
			// получим реквизиты табличной части
			РезультатЗапросаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента);
			ВыборкаПоНачислениям = РезультатЗапросаПоНачислениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
				КонецЕсли;
				
			КонецЦикла;
			
			// выполним удаление перерасчетов исправленного документа
			Если Не Отказ И ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
				ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Аверсон ЕАЕ 02.04.2025 СВФР-014085
	//Бобруйскводоканал
	Если Организация.ИНН = "790041382" Тогда
		СформироватьДвиженияДанныеДляСвода();
	КонецЕсли;
	//Аверсон СВФР-014085
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Начисления);
	
КонецПроцедуры // ПередЗаписью()

//Аверсон ЕАЕ 02.04.2025 СВФР-014085
//Бобруйскводоканал
Процедура СформироватьДвиженияДанныеДляСвода()
	ДвиженияДанныеДляСвода = Движения.ДанныеДляСвода;
	ДвиженияДанныеДляСвода.Записывать = Истина;
	
	Для Каждого Стр Из Начисления Цикл
		НоваяЗапись = ДвиженияДанныеДляСвода.Добавить();
		НоваяЗапись.Период       = ПериодРегистрации;
		НоваяЗапись.Сотрудник    = Стр.Сотрудник;
		НоваяЗапись.Объект       = НоменклатурнаяГруппа;
		НоваяЗапись.ДатаС        = Стр.ДатаВыхода;
		НоваяЗапись.ДатаПо       = Стр.ДатаВыхода;
		НоваяЗапись.СтатьяЗатрат = СтатьяЗатрат;
		НоваяЗапись.Сумма        = Стр.Результат;
		
		//
		НоваяЗапись.Часов        = Стр.ОтработаноЧасов;
		НоваяЗапись.ВидРасчета   = Стр.ВидРасчета;
		НоваяЗапись.Документ     = Ссылка;
		//
		
	КонецЦикла;
КонецПроцедуры
//Аверсон СВФР-014085

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();