Перем мМакет, мНомер;
Перем ТЗ;

#Если Клиент Тогда

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция ПросклонятьСтр(Компонента, Знач Фраза = "", Падеж = 1, Пол = Неопределено)
	
	Результат = "";
	
	#Если Клиент Тогда
		
	МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ РегламентированнаяОтчетность.ФИОНаписаноВерно(СтрокаМассива) Тогда
			Результат = Результат + СтрокаМассива + " ";
			Продолжить;
		КонецЕсли;
		
		Попытка
			Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
			
		Исключение
			Результат = Фраза;
			Возврат Ложь;
			
		КонецПопытки;
			
	КонецЦикла;
	
	Результат = СокрЛП(Результат);
	
	Возврат Результат;
	
	#Иначе
		
	Возврат Ложь;
	
	#КонецЕсли
	
КонецФункции // Просклонять()

// <Описание функции>
//возвращаемого значения>
//
Функция СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",Перечисления.ТипТрудовогоДоговора.Заключен);
    Запрос.УстановитьПараметр("Сотрудник",ВыбСотрудник);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
	|	ТрудовыеДоговораСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговораСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
	|ГДЕ
	|   ТрудовыеДоговораСрезПоследних.Сотрудник = &Сотрудник 
	|	И ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора = &ДействиеТрудовогоДоговора
	|	И ТрудовыеДоговораСрезПоследних.ВидДоговора = &ВидДоговора";

	РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()
	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокКонтракта, ДокументРезультат)
  
	Пока ВыборкаСтрокКонтракта.Следующий() Цикл 
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокКонтракта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 3) (
		Если СокрЛП(Организация.ИНН) = "700067572" Тогда
		Если ВыводитьПоОсновнымДоговорам Тогда
			Если ВыборкаСтрокКонтракта.Регистратор <> ВыборкаСтрокКонтракта.Сотрудник.ТрудовойДоговор Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		КонецЕсли;
		//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 3) )
		
		ПолныхЛет = 0; Год = 0;  НачалоЗаключенногоКонтракта = Дата(1,1,1);
		
		//найдем последний заключенный контракт
		ЗаключенныйКонтракт = СформируемЗапросПоЗаключенномуКонтракту(ВыборкаСтрокКонтракта.Сотрудник).Выбрать();
		Пока ЗаключенныйКонтракт.Следующий() Цикл
			НачалоЗаключенногоКонтракта = ЗаключенныйКонтракт.НачалоДоговора;
		КонецЦикла; 
		
		//подсчет максимальное продление контракта
		Если НачалоЗаключенногоКонтракта <> Дата(1,1,1) Тогда
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ВыборкаСтрокКонтракта.ОкончаниеДоговора + 86400,НачалоЗаключенногоКонтракта, Лет, Месяцев, Дней);
			Если Лет < 5 Тогда
				ПолныхЛет = 5 - Лет;
			Иначе
				ПолныхЛет = 5;
			КонецЕсли;
		КонецЕсли;
		//Если ПолныхЛет <> 0 Тогда
		мНомер = мНомер + 1;
		ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
		ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
		ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
		ОбластьДетальныхЗаписей.Параметры.ПодразделениеКод = СокрЛП(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииКод);
		ОбластьДетальныхЗаписей.Параметры.ПодразделениеНаименование = НРег(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование);
		ОбластьДетальныхЗаписей.Параметры.Должность = НРег(ВыборкаСтрокКонтракта.Должность);
		ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
		ОбластьДетальныхЗаписей.Параметры.ПроцентПоКонтракту = ВыборкаСтрокКонтракта.ПроцентПоКонтракту;
		Лет = 0;
		Месяцев = 0;
		Дней = 0; 
		ОбщегоНазначения.РазобратьРазностьДат(РабочаяДата,ВыборкаСтрокКонтракта.Сотрудник.Физлицо.ДатаРождения, Лет, Месяцев, Дней);
		ОбластьДетальныхЗаписей.Параметры.Возраст = Лет;			
		ОбластьДетальныхЗаписей.Параметры.ПродлениеКонтракта = ПолныхЛет;	
		ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокКонтракта.Регистратор.ТипТрудовогоДоговора;	
		ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		//КонецЕсли;
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	
	//найдем ответственное лицо = руководитель и руководитель кадровой службы
	РуководительФИО =""; РуководительОКФИО = "";
	СпрОрганизации = Организация.ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); НашлиОК = 0; Нашли = 0;
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и Нашли = 0 Тогда
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НоваяСтр.Сотрудник.Наименование, 3, НоваяСтр.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО);
				Нашли = 1;
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы и НашлиОК = 0 Тогда
				РуководительОКФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(НоваяСтр.Сотрудник.Наименование);			
				НашлиОК = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	
 	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,	
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговора.Период,
	|	ТрудовыеДоговора.Регистратор,
	|	ТрудовыеДоговора.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговора.ВидДоговора,
	|	ТрудовыеДоговора.НомерТД,
	|	ТрудовыеДоговора.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговора.НачалоДоговора,
	|	ТрудовыеДоговора.ОкончаниеДоговора,
	|	ТрудовыеДоговора.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период,) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник
	//|		И РаботникиОрганизацийСрезПоследних.Сотрудник.ТрудовойДоговор = ТрудовыеДоговора.Регистратор //Аверсон 27.11.2019 КВВ СВФР-005128 (Закомментировано)
	|ГДЕ
	|	ТрудовыеДоговора.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.ОкончаниеДоговора <= &ОкончаниеПериода
	|   И ТрудовыеДоговора.ВидДоговора = &ВидДоговора
	|   И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0	
  	|   И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачПериод);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонПериод);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("Период",      РабочаяДата);

	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.ФИО_Директора = РуководительФИО;
	Область.Параметры.ФИО_НачальникаОК = РуководительОКФИО;
	Область.Параметры.ДатаОтчета = Формат(ОбщегоНазначения.ПолучитьРабочуюДату(),"ДФ=dd.MM.yyyy");
	Стр = ПросклонятьСтр(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(НачПериод), "ДФ=""ММММ.гггг"""), 6, );
	Область.Параметры.ДатаМесяцГод = НРег(Стр);
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетОтчета");

#КонецЕсли

