
// Формирует типовой отчет в строку XML, табличный документ или поле табличного документа	
Функция СформироватьТиповойОтчет(ОтчетОбъект, Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено, ВыводитьШапкуОтчетаНаВсехСтраницах = истина) Экспорт
	
	//для Каждого МакетОф из ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы Цикл 
	//	если МакетОф.Значение = "БезОформления" Тогда 
	//		МакетОф.Значение = "Основной";
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		ДанныеРасшифровки = Неопределено;
		// Вывод отчета в XML
		Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			СохранениеНастроек = Новый Структура;
		Иначе
			СохранениеНастроек.ЗаполнитьНастройкиПриОткрытииОтчета(ОтчетОбъект);
		КонецЕсли;
		ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
		// Сгенерируем макет компоновки данных при помощи компоновщика макета
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(ОтчетОбъект.СхемаКомпоновкиДанных, ОтчетОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
		// Создадим и инициализируем процессор компоновки
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		Если ВнешниеНаборыДанных = Неопределено Тогда
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
		Иначе
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		КонецЕсли;
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьНачалоЭлемента("result");
		Пока Истина Цикл
			ЭлементРезультата = ПроцессорКомпоновки.Следующий();
			Если ЭлементРезультата = Неопределено Тогда
				Прервать;
			КонецЕсли;
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ЭлементРезультата, "item", "http://v8.1c.ru/8.1/data-composition-system/result");
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		Результат = ЗаписьXML.Закрыть();
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.УстановитьСтроку();
		ЗаписьXML.ЗаписатьНачалоЭлемента("details");
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ДанныеРасшифровки, "item", "http://v8.1c.ru/8.1/data-composition-system/details");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ДанныеРасшифровки = ЗаписьXML.Закрыть();		
		
	ИначеЕсли ВыводВФормуОтчета Тогда
	#Если Клиент Тогда
		// Вывод отчета в форму отчета                           
		Результат.Очистить();
		Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
		
		//Аверсон ЕАЕ 25.05.2021 СВФР-007611
		//ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект);
		Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест")
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений")	Тогда
			ВыводЗаголовкаПриРасширеннойНастройке = Истина;
		Иначе
			ВыводЗаголовкаПриРасширеннойНастройке = Ложь;
		КонецЕсли;
		ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект,,ВыводЗаголовкаПриРасширеннойНастройке);
		//Аверсон СВФР-007611
		
		//Аверсон ЕАЕ 24.05.2021 СВФР-007611
		//ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета);
		ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета, ВыводЗаголовкаПриРасширеннойНастройке);
		//Аверсон СВФР-007611
		
		ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
		ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных, ВыводитьШапкуОтчетаНаВсехСтраницах);
		
		//Аверсон ЕАЕ 03.06.2021 СВФР-007644
		Если (ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный") 
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест")
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений")) 
			И ОтчетОбъект.ЭтоРасшифровка Тогда
			ВыводТабельногоНомера(Настройки, ОтчетОбъект);
		КонецЕсли;
		//Аверсон СВФР-007644
		
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		
		//Аверсон ЕАЕ 24.05.2021 СВФР-007611
		//УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат);
		УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводЗаголовкаПриРасширеннойНастройке);
		//Аверсон СВФР-007611
		
	Иначе
		// Вывод отчета в табличный документ
		Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
		ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект);
		ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета);
		ОтчетОбъект.ДоработатьКомпоновщикПередВыводом();
		ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	#КонецЕсли
	КонецЕсли;
	
КонецФункции

//Аверсон ЕАЕ 03.06.2021 СВФР-007644
Процедура ВыводТабельногоНомера(НастройкиОтчета, ОтчетОбъект) Экспорт
	ГруппировкиСтруктуры = НастройкиОтчета.Структура;
	СотрудникНайден = Ложь;
	СотрудникКодНайден = Ложь;
	Поля = Неопределено;
	ИндексСотрудника = Неопределено;
	Для Каждого ГруппировкаСтруктуры Из ГруппировкиСтруктуры Цикл
		Если ТипЗнч(ГруппировкаСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для Каждого Строка Из ГруппировкаСтруктуры.Строки Цикл
				ПоляГруппировки = Строка.ПоляГруппировки.Элементы;
				//ПСА 10.06.2021 СВФР-007680+++
				ПорядокГруппировки = Строка.Порядок.Элементы;
				Для Каждого ПолеГруппировки Из ПоляГруппировки Цикл
					Если ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сотрудник.Код") И ПолеГруппировки.Использование = Истина Тогда
						СотрудникКодНайден = Истина;
						Прервать;
					КонецЕсли;
					Если ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сотрудник") И ПолеГруппировки.Использование = Истина Тогда
						
						ИндексСотрудника = ПоляГруппировки.Индекс(ПолеГруппировки);
						
						Поля = ПоляГруппировки;
						//ПСА 10.06.2021 СВФР-007680+++
						ПоляПорядка = ПорядокГруппировки;
						СотрудникНайден = Истина;
					КонецЕсли;
				КонецЦикла;
				Если СотрудникКодНайден Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ПоляГруппировки = ГруппировкаСтруктуры.ПоляГруппировки.Элементы;
			//ПСА 10.06.2021 СВФР-007680+++
			ПорядокГруппировки = ГруппировкаСтруктуры.Порядок.Элементы;
			Для Каждого ПолеГруппировки Из ПоляГруппировки Цикл
				Если ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сотрудник.Код") И ПолеГруппировки.Использование = Истина Тогда
					СотрудникКодНайден = Истина;
					Прервать;
				КонецЕсли;
				Если ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сотрудник") И ПолеГруппировки.Использование = Истина Тогда
					
					ИндексСотрудника = ПоляГруппировки.Индекс(ПолеГруппировки);
					
					Поля = ПоляГруппировки;
					//ПСА 10.06.2021 СВФР-007680+++
					ПоляПорядка = ПорядокГруппировки;
					СотрудникНайден = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если СотрудникКодНайден Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СотрудникНайден И Не СотрудникКодНайден И Поля <> Неопределено И ИндексСотрудника <> Неопределено Тогда
		ОтчетОбъект.РасширеннаяНастройка = Истина;
		
		НовоеПолеГруппировки = Поля.Вставить(ИндексСотрудника, Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Сотрудник.Код");
		НовоеПолеГруппировки.Использование = Истина;
		
		ЭлементВывода = НастройкиОтчета.ПараметрыВывода.Элементы.Найти("РасположениеРеквизитов");
		ЭлементВывода.Использование = Истина;
		ЭлементВывода.Значение = РасположениеРеквизитовКомпоновкиДанных.Отдельно;
		//ПСА 10.06.2021 СВФР-007680+++
		ОтключенАвтоПорядок = Ложь;
		Для Каждого ПолеПорядка Из ПоляПорядка Цикл
			Если ТипЗНЧ(ПолеПорядка) = ТИп("АвтоЭлементПорядкаКомпоновкиДанных") Тогда 
				ПолеПорядка.Использование = Ложь;
				ОтключенАвтоПорядок = Истина;
			КонецЕсли;
		КонецЦикла;	
		Если ОтключенАвтоПорядок Тогда
			НовыйПорядок = ПоляПорядка.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("Сотрудник");
			НовыйПорядок.Использование = Истина; 
			НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		КонецЕсли;
		//+++ПСА 10.06.2021 СВФР-007680
	КонецЕсли;
КонецПроцедуры
//Аверсон СВФР-007644

Функция ЭтоПроизвольныйОтчет(ОтчетОбъект = Неопределено) Экспорт
	
	Если ОтчетОбъект <> Неопределено Тогда
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ОтчетОбъект));
		Если ТипЗнч(ОтчетОбъект) = Тип("Структура") 
		 ИЛИ МетаданныеОбъекта <> Неопределено 
		   И Метаданные.Справочники.Найти(Метаданные.НайтиПоТипу(ТипЗнч(ОтчетОбъект)).Имя) <> Неопределено Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат (Найти(Метаданные.Имя, "Консолидация") > 0);
	КонецЕсли;
	
КонецФункции

// По структуре параметров восстанавливает состояние отчета
Процедура ПрименитьСтруктуруПараметровОтчета(ОтчетОбъект, СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ОтчетОбъект, СтруктураПараметров);
	ОтчетОбъект.ИнициализацияОтчета();
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураПараметров.НастройкиКомпоновщика);
	
КонецПроцедуры

Процедура ИнициализацияТиповогоОтчета(ОтчетОбъект) Экспорт
	
КонецПроцедуры

// Возвращает структуру параметров отчета для сохранения
Функция ПолучитьСтруктуруПараметровТиповогоОтчета(ОтчетОбъект) Экспорт
	
	СтруктураПараметров = Новый Структура;
	Для каждого Реквизит Из ОтчетОбъект.Метаданные().Реквизиты Цикл
		Если Реквизит.Имя = "СхемаКомпоновкиДанных" 
		 ИЛИ Реквизит.Имя = "ДатаВерсииИсточникаДанных"
		 ИЛИ Реквизит.Имя = "ИсточникДанныхОтчета"
		 ИЛИ Реквизит.Имя = "Описание"
		 ИЛИ Реквизит.Имя = "ПодлежитПередачеВПодчиненныеУзлыПриОбменеПоОрганизации" Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПараметров.Вставить(Реквизит.Имя, ОтчетОбъект[Реквизит.Имя])
	КонецЦикла;
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) И ОтчетОбъект.Ссылка = ОтчетОбъект Тогда
		СтруктураПараметров.Вставить("НастройкиКомпоновщика", ОтчетОбъект.СхемаКомпоновкиДанных.Получить().НастройкиПоУмолчанию);
	Иначе
		СтруктураПараметров.Вставить("НастройкиКомпоновщика", ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли;
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Возврат ОтчетОбъект.СхемаКомпоновкиДанных.Получить();
	Иначе
		Возврат ОтчетОбъект.СхемаКомпоновкиДанных;
	КонецЕсли;
	
КонецФункции

#Если Клиент Тогда

Функция ДобавитьРодителей(ЭлементРасшифровки, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы = Ложь)
	
	Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Для каждого Поле Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Новый ПолеКомпоновкиДанных(Поле.Поле), ТекущийОтчет);
			Если ДоступноеПоле = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ВключатьРесурсы И ДоступноеПоле.Ресурс Тогда
				Продолжить;
			КонецЕсли;
			МассивПолейРасшифровки.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	Для каждого Родитель Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
		ДобавитьРодителей(Родитель, ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	КонецЦикла;
	
КонецФункции

// Возвращает массив, по которому следует расшифровать отчет
Функция ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, ТекущийОтчет = Неопределено, ВключатьРесурсы = Ложь) Экспорт
	
	МассивПолейРасшифровки = Новый Массив;
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") 
	   И ТипЗнч(Расшифровка) <> Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		Возврат МассивПолейРасшифровки;
	КонецЕсли;
	
	Если ТекущийОтчет = Неопределено Тогда
		ТекущийОтчет = ДанныеРасшифровки;
	КонецЕсли;
	
	// Добавим поля родительских группировок
	ДобавитьРодителей(ДанныеРасшифровки.Элементы[Расшифровка], ТекущийОтчет, МассивПолейРасшифровки, ВключатьРесурсы);
	
	Количество = МассивПолейРасшифровки.Количество();
	Для Индекс = 1 По Количество Цикл
		ОбратныйИндекс = Количество - Индекс;
		Для ИндексВнутри = 0 По ОбратныйИндекс - 1 Цикл
			Если МассивПолейРасшифровки[ОбратныйИндекс].Поле = МассивПолейРасшифровки[ИндексВнутри].Поле Тогда
				МассивПолейРасшифровки.Удалить(ОбратныйИндекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Добавим отбор, установленный в отчете
	Для каждого ЭлементОтбора Из ТекущийОтчет.Настройки.Отбор.Элементы Цикл
		Если Не ЭлементОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		МассивПолейРасшифровки.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	
	Возврат МассивПолейРасшифровки;
	
КонецФункции

// Компирует элементы из одной коллекции в другую
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ПроверятьДоступность = Ложь, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
	 ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
	 ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет одну коллекцию элементов на основании другой
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Копирует настройки компоновки данных из одного компоновщика настроек в другой
Процедура СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник, НастройкиИсточник) Экспорт
	
	Если НастройкиИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиПриемник) = Тип("НастройкиКомпоновкиДанных") Тогда
		Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
			ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
			Если ЗначениеПараметра <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник.Настройки, НастройкиИсточник.Настройки);
		Возврат;
	КонецЕсли;
	
	// Копирование настроек
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		ЗаполнитьЭлементы(НастройкиПриемник.ПараметрыДанных, НастройкиИсточник.ПараметрыДанных);
		СкопироватьЭлементы(НастройкиПриемник.ПользовательскиеПоля, НастройкиИсточник.ПользовательскиеПоля);
		СкопироватьЭлементы(НастройкиПриемник.Отбор,         НастройкиИсточник.Отбор);
		СкопироватьЭлементы(НастройкиПриемник.Порядок,       НастройкиИсточник.Порядок);
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		СкопироватьЭлементы(НастройкиПриемник.ПоляГруппировки, НастройкиИсточник.ПоляГруппировки);
		СкопироватьЭлементы(НастройкиПриемник.Отбор,           НастройкиИсточник.Отбор);
		СкопироватьЭлементы(НастройкиПриемник.Порядок,         НастройкиИсточник.Порядок);
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		
	КонецЕсли;
	
	СкопироватьЭлементы(НастройкиПриемник.Выбор,              НастройкиИсточник.Выбор);
	СкопироватьЭлементы(НастройкиПриемник.УсловноеОформление, НастройкиИсточник.УсловноеОформление);
	ЗаполнитьЭлементы(НастройкиПриемник.ПараметрыВывода,      НастройкиИсточник.ПараметрыВывода);
	
	// Копирование структуры
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить(ТипЗнч(ЭлементСтруктурыИсточник));
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ТаблицаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Строки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Строки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Колонки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Колонки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Серии Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Серии.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Точки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Точки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Заменяет цвета в диаграмме
Процедура ЗаменитьЦветаВДиаграмме(Диаграмма, ТаблицаЦветовСерий) Экспорт
	
	Серии = Диаграмма.Серии;
	
	Для каждого Серия Из Серии Цикл
		
		СтруктураПоиска = Новый Структура("Текст", Серия.Текст);
		МассивЦветовСерий = ТаблицаЦветовСерий.НайтиСтроки(СтруктураПоиска);
		
		Если МассивЦветовСерий.Количество() > 0 Тогда
			Серия.Цвет = МассивЦветовСерий[0].Цвет;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает картинку представления элемента отчета
Функция ПолучитьКартинкуПредставленияЭлементаОтчета(ПредставлениеЭлементаОтчета) Экспорт
	
	Если ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Таблица Тогда
		Возврат  БиблиотекаКартинок.Таблица;
	ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.КроссТаблица Тогда
		Возврат  БиблиотекаКартинок.КроссТаблица;
	ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Диаграмма Тогда
		Возврат БиблиотекаКартинок.Диаграмма;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Удаляет недоступные элементы отбора из компоновщика
Процедура УдалитьНедоступныеПоляИзОтбора(КомпоновщикНастроек) Экспорт
	
	Количество = КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество();
	Для Индекс = 1 По Количество Цикл
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы[Количество - Индекс];
		ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Если КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает компоновщик настроек по схеме компоновки и настройкам компоновщика
Функция ПолучитьКомопновщикПоСхемеИНастройкам(Схема, Настройки = Неопределено) Экспорт
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	Если Настройки <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	Возврат КомпоновщикНастроек;
	
КонецФункции

// Добавляет в группировку автовыбранное поле
Функция ДобавитьАвтоВыбранноеПоле(Структура) Экспорт
	
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Возврат ВыбранноеПоле;
	
КонецФункции

// Добавляет в группировку автоэлемент порядка
Процедура ДобавитьАвтоЭлементПорядка(Строка) Экспорт
	
	ПолеПолеПорядок = Строка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
КонецПроцедуры

// Возвращает представление по типу элемента структуры
Функция ПолучитьПредставлениеПоЭлементуСтруктуры(ЭлементСтруктуры) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда
		Возврат Перечисления.ПредставленияЭлементовОтчетов.Таблица;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
		Возврат Перечисления.ПредставленияЭлементовОтчетов.КроссТаблица;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		Возврат Перечисления.ПредставленияЭлементовОтчетов.Диаграмма;
	КонецЕсли;
	
КонецФункции

// Возвращает тип элемента структуры по представлению
Функция ПолучитьТипЭлементаПоПредставлению(Представление) Экспорт
	
	Если Представление = Перечисления.ПредставленияЭлементовОтчетов.Таблица Тогда
		Возврат Тип("ГруппировкаКомпоновкиДанных")
	ИначеЕсли Представление = Перечисления.ПредставленияЭлементовОтчетов.КроссТаблица Тогда
		Возврат Тип("ТаблицаКомпоновкиДанных")
	ИначеЕсли Представление = Перечисления.ПредставленияЭлементовОтчетов.Диаграмма Тогда
		Возврат Тип("ДиаграммаКомпоновкиДанных")
	КонецЕсли;
	
КонецФункции

//Процедура назначает форме уникальный ключ идентификации для возможности открытия нескольких одинаковых форм
Процедура НазначитьФормеУникальныйКлючИдентификации(Форма) Экспорт
	
	Если Форма.КлючУникальности = Неопределено Тогда
		Форма.КлючУникальности = Новый УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// ОбЩИЕ ПРОЦЕДУРЫ ОТЧЕТОВ

// Открывает форму настройки типового очтета для редактирования
Функция РедактироватьНастройкиТиповогоОтчета(ОтчетОбъект, ФормаОтчета, ПараметрыФормы = Неопределено) Экспорт
	
	// Сохраним настройки на случай отмены редактирования
	СохраненныеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	// Откроем форму настройки
	ФормаНастройки = ПолучитьОбщуюФорму("ФормаНастройкиСтруктурыОтчета", ФормаОтчета);
	ФормаНастройки.КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	ФормаНастройки.ОтчетОбъект = ОтчетОбъект;
	ФормаНастройки.ОтрицательноеКрасным = ОтчетОбъект.ОтрицательноеКрасным;
	ФормаНастройки.НастройкаПериода = ОтчетОбъект.НастройкаПериода;
	ФормаНастройки.ПараметрыФормы = ПараметрыФормы;
	ФормаНастройки.РасширеннаяНастройка = ОтчетОбъект.РасширеннаяНастройка;
	ФормаНастройки.ОсновнаяНастройка = Истина;
	
	Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.ОстаткиОтпусковПоРабочимГодам") 
		ИЛИ Найти(Сокрлп(ОтчетОбъект),"ОстаткиОтпусковПоРабочимГодам") > 0 Тогда //СВЭЙ 20.05.2024 КВВ СВФР-012949
		ФормаНастройки.ЭлементыФормы.ОсновныеДействияФормыПользовательские1.Кнопки.Сформировать.Текст = "";
		ФормаНастройки.ЭлементыФормы.ОсновныеДействияФормыПользовательские1.Кнопки.Сформировать.Доступность = Ложь;
	КонецЕсли;
	
	РезультатОткрытия = ФормаНастройки.ОткрытьМодально();
	
	// Проверим результат открытия
	Если РезультатОткрытия <> Неопределено Тогда 
		// Обновим форму типового отчета
		Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			ОбновитьФормуТиповогоОтчетаПоКомпоновщику(ОтчетОбъект, ФормаОтчета);
			
			//Аверсон ЕАЕ 25.05.2021 СВФР-007611
			//УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, ФормаОтчета.ЭлементыФормы.Результат);
			Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный") Тогда
				ВыводЗаголовкаПриРасширеннойНастройке = Истина;
			Иначе
				ВыводЗаголовкаПриРасширеннойНастройке = Ложь;
			КонецЕсли;
			УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, ФормаОтчета.ЭлементыФормы.Результат, ВыводЗаголовкаПриРасширеннойНастройке);
			//Аверсон СВФР-007611
			
		КонецЕсли;
		// Перерисуем форму отчета
		ОтчетОбъект.РасширеннаяНастройка = ФормаНастройки.РасширеннаяНастройка;
		Возврат РезультатОткрытия;
	Иначе
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СохраненныеНастройки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция РедактироватьСтруктуруОтчета(ОтчетОбъект, ФормаОтчета, ПараметрыФормы = Неопределено) Экспорт
	
	СохраненнаяМодифицированность = ФормаОтчета.Модифицированность;
	// Подготовим отчет к открытию формы настройки
	ЗагрузитьВРеквизитЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
	
	// Сохраним настройки на случай отмены редактирования
	СохраненныеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	// Откроем форму настройки
	ФормаНастройки = ПолучитьОбщуюФорму("ФормаНастройкиСтруктурыОтчета", ФормаОтчета);
	ФормаНастройки.КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	ФормаНастройки.ОтчетОбъект = ОтчетОбъект;
	ФормаНастройки.ОтрицательноеКрасным = ОтчетОбъект.ОтрицательноеКрасным;
	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		ФормаНастройки.НастройкаПериода = ОтчетОбъект.НастройкаПериода;
	КонецЕсли;
	ФормаНастройки.ПараметрыФормы = ПараметрыФормы;
	ФормаНастройки.РасширеннаяНастройка = ОтчетОбъект.РасширеннаяНастройка;
	ФормаНастройки.ОсновнаяНастройка = ОтчетОбъект.СохраненнаяНастройка.Пустая();
	РезультатОткрытия = ФормаНастройки.ОткрытьМодально();
	
	// Проверим результат открытия
	Если РезультатОткрытия <> Неопределено Тогда 
		// Обновим форму типового отчета
		Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			ОбновитьФормуТиповогоОтчетаПоКомпоновщику(ОтчетОбъект, ФормаОтчета);
			УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, ФормаОтчета.ЭлементыФормы.Результат);
		КонецЕсли;
		// Перерисуем форму отчета
		ПерерисоватьПанельНастроек(ОтчетОбъект, ФормаОтчета);
		ОтчетОбъект.РасширеннаяНастройка = ФормаНастройки.РасширеннаяНастройка;
		ФормаОтчета.Модифицированность = Истина;
		Возврат РезультатОткрытия;
	Иначе
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(СохраненныеНастройки);
		ФормаОтчета.Модифицированность = СохраненнаяМодифицированность;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Скрывает или отображает быстрый отбор на форме
Процедура УправлениеОтображениемЭлементовФормыТиповогоОтчета(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		
		ФормаОтчета.ЭлементыФормы.ДействияФормы.Кнопки.Отбор.Пометка = ОтчетОбъект.ПоказыватьБыстрыйОтбор;
		Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			Если ФормаОтчета.ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка Тогда
				Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить;
			Иначе
				Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
			КонецЕсли;
			
			ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput")).Значение = Значение;
		КонецЕсли;
		
		Если ОтчетОбъект.ПоказыватьБыстрыйОтбор Тогда
			// Нужно показывать отбор
			ФормаОтчета.ЭлементыФормы.Разделитель.Свертка = РежимСверткиЭлементаУправления.Нет;
			ФормаОтчета.ЭлементыФормы.ПанельОтбора.Свертка = РежимСверткиЭлементаУправления.Нет;
			//ФормаОтчета.ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ФормаОтчета.Панель, ГраницаЭлементаУправления.Верх, ФормаОтчета.Панель, ГраницаЭлементаУправления.Низ);
			//ФормаОтчета.ЭлементыФормы.ПанельОтбора.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ФормаОтчета.ЭлементыФормы.Разделитель, ГраницаЭлементаУправления.Верх);
			
		Иначе
			// Не нужно показывать отбор
			ФормаОтчета.ЭлементыФормы.ПанельОтбора.УстановитьПривязку(ГраницаЭлементаУправления.Низ);
			ФормаОтчета.ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ФормаОтчета.ЭлементыФормы.ПанельОтбора, ГраницаЭлементаУправления.Низ);
			ФормаОтчета.ЭлементыФормы.ПанельОтбора.Свертка = РежимСверткиЭлементаУправления.Верх;
			ФормаОтчета.ЭлементыФормы.Разделитель.Свертка = РежимСверткиЭлементаУправления.Верх;
		КонецЕсли;
		
	Иначе
		Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			
			ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект, ФормаОтчета);
			ЗначенияНастроек["ВыводитьЗаголовокОтчета"] = ФормаОтчета.ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.Заголовок.Пометка;
			ОтчетОбъект.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ЗначенияНастроек);
			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Скрывает и показывает заголовок типового отчета
Процедура УправлениеОтображениемЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводЗаголовкаПриРасширеннойНастройке = Ложь) Экспорт //Аверсон ЕАЕ 24.05.2021 СВФР-007611 параметр ВыводЗаголовкаПриРасширеннойНастройке
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект)
		
	 //Аверсон ЕАЕ 24.05.2021 СВФР-007611
	 //ИЛИ ОтчетОбъект.РасширеннаяНастройка
	 ИЛИ (ОтчетОбъект.РасширеннаяНастройка И Не ВыводЗаголовкаПриРасширеннойНастройке)
	 //Аверсон СВФР-007611
	 
	 ИЛИ Результат.ВысотаТаблицы = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = Результат.Области.Найти("Заголовок");
	Если ОбластьЗаголовок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		ПоказыватьЗаголовок = (ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput")).Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить);
	Иначе
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
		ПоказыватьЗаголовок = ЗначенияНастроек["ВыводитьЗаголовокОтчета"];
	КонецЕсли;
	
	ОбластьЗаголовок.Видимость = ПоказыватьЗаголовок;
	
КонецПроцедуры

// Открывает копию отчета в новом окне
Процедура ОткрытьВНовомОкнеТиповойОтчет(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если Строка(ОтчетОбъект) = "ВнешнийОтчетОбъект." + ОтчетОбъект.Метаданные().Имя Тогда
		Предупреждение("Данный отчет является внешним." + Символы.ПС + "Открытие нового отчета возможно только для объектов конфигурации.");
		Возврат;
	Иначе
		НовыйОтчет = Отчеты[ОтчетОбъект.Метаданные().Имя].Создать();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйОтчет, ОтчетОбъект,, "СохраненнаяНастройка");
	НовыйОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки());
	ФормаНовогоОтчета = НовыйОтчет.ПолучитьФорму();
	НазначитьФормеУникальныйКлючИдентификации(ФормаНовогоОтчета);
	ФормаНовогоОтчета.ЭтоОтработкаРасшифровки = Истина;
	ФормаНовогоОтчета.Открыть();
	СформироватьТиповойОтчет(НовыйОтчет, ФормаНовогоОтчета.ЭлементыФормы.Результат, ФормаНовогоОтчета.ДанныеРасшифровки);
	ФормаНовогоОтчета.ЭтоОтработкаРасшифровки = Ложь;
	
КонецПроцедуры

// Выводит заголовок типового отчета в табличный документ
Процедура ВыводЗаголовкаТиповогоОтчета(ОтчетОбъект, Результат, ВыводВФормуОтчета = Истина, ВыводЗаголовкаПриРасширеннойНастройке = Ложь) //Аверсон ЕАЕ 24.05.2021 СВФР-007611 параметр ВыводЗаголовкаПриРасширеннойНастройке
	
	//Аверсон ЕАЕ 25.05.2021 СВФР-007611
	//Если ОтчетОбъект.РасширеннаяНастройка Тогда
	Если ОтчетОбъект.РасширеннаяНастройка И Не ВыводЗаголовкаПриРасширеннойНастройке Тогда
	//Аверсон СВФР-007611
	
		Возврат;                                           
	КонецЕсли;
	
	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		ЗначениеПараметра = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput"));
		ВыводитьЗаголовок = (ЗначениеПараметра.Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить И ЗначениеПараметра.Использование);
		Если Не ВыводВФормуОтчета И Не ВыводитьЗаголовок Тогда
			Возврат;
		КонецЕсли;
		
		МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокТиповогоОтчета");
		
		//Аверсон ЕАЕ 02.07.2021 б/н
		
		//Аверсон ЕАЕ 16.11.2021 СВФР-008385
		Бригады = Новый СписокЗначений;
		//Аверсон СВФР-008385
		
		Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест") 
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений") Тогда
			ОбластьТекДата = МакетЗаголовок.ПолучитьОбласть("ТекДата");
			ОбластьТекДата.Параметры.ТекДата = ТекущаяДата();
			Результат.Вывести(ОбластьТекДата);
			
			//Аверсон ЕАЕ 16.11.2021 СВФР-008385
			Бригады = ОтчетОбъект.Бригада;
			//Аверсон СВФР-008385
			
			//Аверсон ЕАЕ 17.01.2022 СВФР-008610
			Если ОтчетОбъект.ЭтоРасшифровка Тогда
				ОбластьВидРасчета = МакетЗаголовок.ПолучитьОбласть("ВидРасчета");
				Если ОтчетОбъект.ВыводитьВидРасчетаВРасшифровке = Истина Тогда
					ЭлементыОтбора = ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы;
					ВидРасчета = "не определен";
					Для Каждого Эл Из ЭлементыОтбора Цикл
						Если ТипЗнч(Эл) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
							Продолжить;
						КонецЕсли;
						Если Эл.Использование = Истина И Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидРасчета") Тогда
							ВидРасчета = Эл.ПравоеЗначение;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					ВидРасчетаВШапку = "Вид расчета: " + СокрЛП(ВидРасчета);
				Иначе
					ВидРасчетаВШапку = "По всем видам расчета";
				КонецЕсли;
				ОбластьВидРасчета.Параметры.ВидРасчета = ВидРасчетаВШапку;
				Результат.Вывести(ОбластьВидРасчета);
			КонецЕсли;
			//Аверсон СВФР-008610
		КонецЕсли;
		//Аверсон
		
		ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
		ЗаголовокОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение;
		
		//Аверсон ЕАЕ 16.11.2021 СВФР-008385
		Если Бригады.Количество() > 0 Тогда
			ЗаголовокОтчетаСвод = "Свод начисленной зарплаты по: ";
			//Если Бригады.Количество() = 1 Тогда
			//	ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + "бригаде ";	
			//Иначе
			//	ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + "бригадам ";	
			//КонецЕсли;
			н = 0;
			Для Каждого ЭлСписка Из Бригады Цикл
				н = н + 1;
				ЗаголовокОтчетаСвод = ЗаголовокОтчетаСвод + ?(н = 1, "", ", ") + """" + СокрЛП(ЭлСписка.Значение) + """";	
			КонецЦикла;
			ЗаголовокОтчета = ЗаголовокОтчетаСвод;
		КонецЕсли;
		//Аверсон СВФР-008385
		
		ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
		ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета = ПолучитьОписаниеНастроекОтчета(ОтчетОбъект.КомпоновщикНастроек);
		Результат.Вывести(ОбластьЗаголовок);
	Иначе
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
		ВыводитьЗаголовокОтчета = Истина;
		Если ЗначенияНастроек = Неопределено
         ИЛИ Не ЗначенияНастроек.Свойство("ВыводитьЗаголовокОтчета", ВыводитьЗаголовокОтчета) Тогда
			ВыводитьЗаголовок = Истина;	
		Иначе
			ВыводитьЗаголовок = ВыводитьЗаголовокОтчета;
		КонецЕсли;
		
		Если Не ВыводВФормуОтчета И Не ВыводитьЗаголовок Тогда
			Возврат;
		КонецЕсли;
		МакетЗаголовок = ПолучитьОбщийМакет("ЗаголовокТиповогоОтчета");
		
		//Аверсон ЕАЕ 02.07.2021 б/н
		Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальныйТест") 
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийПервоначальный")
			ИЛИ ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СводНачисленнойЗарплатыОрганизацийБезПодразделений") Тогда
			ОбластьТекДата = МакетЗаголовок.ПолучитьОбласть("ТекДата");
			ОбластьТекДата.Параметры.ТекДата = ТекущаяДата();
			Результат.Вывести(ОбластьТекДата);
		КонецЕсли;
		//Аверсон
		
		ОбластьЗаголовок = МакетЗаголовок.ПолучитьОбласть("Заголовок");
		ЗначениеПараметра = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
		ЗаголовокОтчета = ЗначениеПараметра.Значение;
		Если ПустаяСтрока(ЗаголовокОтчета) Тогда
			ЗаголовокОтчета = ПолучитьЗаголовокОтчета(ОтчетОбъект);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ЗаголовокОтчета;
		ОбластьЗаголовок.Параметры.ОписаниеНастроекОтчета = ПолучитьОписаниеНастроекОтчета(ОтчетОбъект.КомпоновщикНастроек);
		Результат.Вывести(ОбластьЗаголовок);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОписаниеНастроекОтчета(КомпоновщикНастроек)
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Период
	ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	
	Если ЗначениеПараметраНачалоПериода <> Неопределено 
	   И ЗначениеПараметраКонецПериода <> Неопределено Тогда
		НачалоПериода = ЗначениеПараметраНачалоПериода.Значение;
		КонецПериода = ЗначениеПараметраКонецПериода.Значение;
		Если НачалоПериода = '00010101' И КонецПериода = '00010101' Тогда
			ОписаниеПериода = НСтр("ru='Период не установлен'");
		ИначеЕсли НачалоПериода = '00010101' ИЛИ КонецПериода = '00010101' Тогда
			ОписаниеПериода = Формат(НачалоПериода, "ДФ = дд.ММ.гггг; ДП = ...") + " - " + Формат(КонецПериода, "ДФ = дд.ММ.гггг; ДП = ...");
		ИначеЕсли НачалоПериода <= КонецПериода Тогда
			ОписаниеПериода = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ОписаниеПериода = НСтр("ru='Неправильно задан период!'");
		КонецЕсли;
	ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
		Период = ЗначениеПараметраПериод.Значение;
		Если Период = '00010101' Тогда
			ОписаниеПериода = НСтр("ru='на '") + Формат(ТекущаяДата(), "ДП = ...");
		Иначе
			ОписаниеПериода = НСтр("ru='на конец дня '") + Формат(Период, "ДФ = дд.ММ.гггг; ДП = ...");
		КонецЕсли;
	Иначе
		ОписаниеПериода = "";
	КонецЕсли;
	Если Не ПустаяСтрока(ОПисаниеПериода) Тогда
		ОписаниеПериода = "Период: " + ОписаниеПериода + Символы.ПС;
	КонецЕсли;
	
	ЭлементОтчета = КомпоновщикНастроек.Настройки.Структура[0];
	ПредставлениеЭлементаОтчета = ПолучитьПредставлениеПоЭлементуСтруктуры(ЭлементОтчета);
	Если ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Таблица Тогда
		Строки = ПолучитьМассивГруппировок(ЭлементОтчета, КомпоновщикНастроек);
		ТипСтрок = "Группировки строк";
	ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.КроссТаблица Тогда
		Если ЭлементОтчета.Строки.Количество() > 0 Тогда
			Строки = ПолучитьМассивГруппировок(ЭлементОтчета.Строки[0], КомпоновщикНастроек);
		Иначе
			Строки = Новый Массив;
		КонецЕсли;
		ТипСтрок = "Группировки строк";
		Если ЭлементОтчета.Колонки.Количество() > 0 Тогда
			Колонки = ПолучитьМассивГруппировок(ЭлементОтчета.Колонки[0], КомпоновщикНастроек); 
		Иначе
			Колонки = Новый Массив;
		КонецЕсли;
		ТипКолонок = "Группировки колонок";
	ИначеЕсли ПредставлениеЭлементаОтчета = Перечисления.ПредставленияЭлементовОтчетов.Диаграмма Тогда
		Если ЭлементОтчета.Серии.Количество() > 0 Тогда
			Строки = ПолучитьМассивГруппировок(ЭлементОтчета.Серии[0], КомпоновщикНастроек);
		Иначе
			Строки = Новый Массив;
		КонецЕсли;
		ТипСтрок = "Группировки серий";
		Если ЭлементОтчета.Точки.Количество() > 0 Тогда
			Колонки = ПолучитьМассивГруппировок(ЭлементОтчета.Точки[0], КомпоновщикНастроек); 
		Иначе
			Колонки = Новый Массив;
		КонецЕсли;
		ТипКолонок = "Группировки точек";
	КонецЕсли;
	
	Показатели = ПолучитьПоказатели(КомпоновщикНастроек);
	ДополнительныеПоля = ПолучитьДополнительныеПоля(КомпоновщикНастроек);
	
	СтрокаОтбор = Строка(КомпоновщикНастроек.Настройки.Отбор);
	ОписаниеНастроекОтчета = 
	ОписаниеПериода +
	СформироватьСтрокуПолей(ТипСтрок, Строки) + 
	СформироватьСтрокуПолей(ТипКолонок, Колонки) + 
	СформироватьСтрокуПолей("Дополнительные поля", ДополнительныеПоля) +
	СформироватьСтрокуПолей("Показатели", Показатели) +
	?(ПустаяСтрока(СтрокаОтбор) , "", "Отбор: " + СтрокаОтбор);
	
	Возврат ОписаниеНастроекОтчета;		
	
КонецФункции

Функция СформироватьСтрокуПолей(ТипПолей, МассивПолей)
	
	Если МассивПолей = Неопределено ИЛИ МассивПолей.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	СтрокаПолей = ТипПолей + ": ";
	Для каждого Поле Из МассивПолей Цикл
		СтрокаПолей = СтрокаПолей + Поле + "; ";
	КонецЦикла;
	
	СтрокаПолей = СтрокаПолей + Символы.ПС;     	
	
	Возврат СтрокаПолей;
	
КонецФункции

Функция ПолучитьПоказатели(КомпоновщикНастроек)
	
	Элементы = Новый Массив;
	ВыбранныеПоля = ПолучитьВыбранныеПоля(КомпоновщикНастроек);
	
	Для каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		ДоступноеПоле = ПолучитьДоступноеПоле(ВыбранноеПоле.Поле, КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора);
		Если ДоступноеПоле <> Неопределено и ДоступноеПоле.Ресурс Тогда
			Элементы.Добавить(ДоступноеПоле.Заголовок);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Элементы;
	
КонецФункции

Функция ПолучитьДополнительныеПоля(КомпоновщикНастроек)
	
	Элементы = Новый Массив;
	ВыбранныеПоля = ПолучитьВыбранныеПоля(КомпоновщикНастроек);
	
	Для каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		ДоступноеПоле = ПолучитьДоступноеПоле(ВыбранноеПоле.Поле, КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора);
		Если ДоступноеПоле <> Неопределено И Не ДоступноеПоле.Ресурс Тогда
			Элементы.Добавить(ДоступноеПоле.Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Элементы;
	
КонецФункции

Функция ПолучитьДоступноеПоле(Знач Поле, ОбластьПоиска) Экспорт
	
	Возврат ОбластьПоиска.НайтиПоле(Поле);
	
КонецФункции

// Возвращает массив группировок компоновщика настроек
Функция ПолучитьМассивГруппировок(ЭлементСтруктуры, КомпоновщикНастроек, МассивГруппировок = Неопределено) Экспорт
	
	Если МассивГруппировок = Неопределено Тогда
		МассивГруппировок = Новый Массив;
	КонецЕсли;
	
	Для каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
		Если Не ПолеГруппировки.Использование Тогда
			Продолжить;
		КонецЕсли;
		ДоступноеПоле = ПолучитьДоступноеПоле(ПолеГруппировки.Поле, КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок);
		Если ДоступноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивГруппировок.Добавить(ДоступноеПоле.Заголовок);
	КонецЦикла;
	
	Если ЭлементСтруктуры.Структура.Количество() = 0 Тогда
		Возврат МассивГруппировок;
	Иначе
		
		
		//Островская Татьяна 28.01.2014 № 17052
		Если ТипЗнч(ЭлементСтруктуры.Структура[0]) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Возврат ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0], КомпоновщикНастроек);
			ТипСтрок = "Группировки строк";
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Структура[0]) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Если ЭлементСтруктуры.Структура[0].Строки.Количество() > 0 Тогда
				Возврат ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0].Строки[0], КомпоновщикНастроек);
			Иначе
				Возврат Новый Массив;
			КонецЕсли;
			ТипСтрок = "Группировки строк";
			Если ЭлементСтруктуры.Структура[0].Колонки.Количество() > 0 Тогда
				Возврат ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0].Колонки[0], КомпоновщикНастроек); 
			Иначе
				Возврат Новый Массив;
			КонецЕсли;
			ТипКолонок = "Группировки колонок";
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Структура[0]) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Если ЭлементСтруктуры.Структура[0].Серии.Количество() > 0 Тогда
				Возврат ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0].Серии[0], КомпоновщикНастроек);
			Иначе
				Возврат Новый Массив;
			КонецЕсли;
			ТипСтрок = "Группировки серий";
			Если ЭлементСтруктуры.Структура[0].Точки.Количество() > 0 Тогда
				Возврат  ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0].Точки[0], КомпоновщикНастроек); 
			Иначе
				Возврат Новый Массив;
			КонецЕсли;
			ТипКолонок = "Группировки точек";

		КонецЕсли;
		//Островская Татьяна 28.01.2014 № 17052
		
		
		//Возврат ПолучитьМассивГруппировок(ЭлементСтруктуры.Структура[0], КомпоновщикНастроек, МассивГруппировок);
	КонецЕсли;
	
КонецФункции

// Выводит типовой отчет в табличный документ
Процедура ВывестиТиповойОтчет(ОтчетОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено, ВыводитьШапкуОтчетаНаВсехСтраницах = истина)
	
	ОтчетОбъект.КомпоновщикНастроек.Восстановить();
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект);
	
	//Сгенерируем макет компоновки данных при помощи компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Попытка
		
	//В качестве схемы компоновки будет выступать схема самого отчета
	//В качестве настроек отчета - текущие настройки отчета
	//Данные расшифровки будем помещать в ДанныеРасшифровки
	Если ВыводВФормуОтчета Тогда
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, ОтчетОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
		ДополнитьМакетыМакетаКомпоновкиРасшифровкойРесурсов(МакетКомпоновки, ОтчетОбъект.КомпоновщикНастроек);
		//Создадим и инициализируем процессор компоновки
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		Если ВнешниеНаборыДанных = Неопределено Тогда
			
			//Аверсон ЕАЕ 14.10.2024 СВФР-013946
			Если ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СпискиРаботниковОрганизаций") Тогда
				Для н = 1 По 50 Цикл
					СтрПоиск = "КонтактнаяИнформация" + СокрЛП(н) + ".Представление";
					СтрЗамена = "ВЫРАЗИТЬ(КонтактнаяИнформация" + СокрЛП(н) + ".Представление КАК Строка(500))";
					МакетКомпоновки.НаборыДанных.Данные.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.Данные.Запрос, СтрПоиск, СтрЗамена);
				КонецЦикла;
			КонецЕсли;
			//Аверсон СВФР-013946
			
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
		Иначе
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
		КонецЕсли;
	Иначе
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, ОтчетОбъект.КомпоновщикНастроек.Настройки);
		//Создадим и инициализируем процессор компоновки
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		Если ВнешниеНаборыДанных = Неопределено Тогда
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		Иначе
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, , Истина);
		КонецЕсли;
	КонецЕсли;
	
	//Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	//Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	Состояние(НСТР("ru='Если Вы хотите прервать вывод отчета, нажмите Ctrl+Break'"));
	
	ТаблицаЗафиксирована = Не ВыводВФормуОтчета;
	
	Результат.ФиксацияСверху = 0;
	//Основной цикл вывода отчета
	Пока Истина Цикл
		
		ОбработкаПрерыванияПользователя();
		//Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		
		Если ЭлементРезультата = Неопределено Тогда
			//Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
			
		Иначе
			
			// Зафиксируем шапку
			Если Не ОтчетОбъект.РасширеннаяНастройка 
			   И Не ТаблицаЗафиксирована 
				  И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 
				  И ТипЗнч(ОтчетОбъект.КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ДиаграммаКомпоновкиДанных") Тогда
				ТаблицаЗафиксирована = Истина;
				Результат.ФиксацияСверху = Результат.ВысотаТаблицы;
				Если ВыводитьШапкуОтчетаНаВсехСтраницах тогда
					ОбластьШапки = Результат.Область(3, ,Результат.ВысотаТаблицы, );
					Результат.ПовторятьПриПечатиСтроки = ОбластьШапки;
				КонецЕсли;
			КонецЕсли;
			
			//Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			                    
		КонецЕсли;
		
	КонецЦикла;
	
	//Обозначем завершение вывода
	ПроцессорВывода.ЗакончитьВывод();

	Исключение
	Вопрос("Отчет не сформирован!" + Символы.ПС + ПолучитьОписаниеРодительскойПричиныИнформацииОбОшибке(ИнформацияОбОшибке()), РежимДиалогаВопрос.ОК);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОписаниеРодительскойПричиныИнформацииОбОшибке(ИнформацияОбОшибке) Экспорт
	
	Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
		ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
	КонецЦикла;
	Возврат ИнформацияОбОшибке.Описание;

КонецФункции

Функция ПолучитьСписокПериодов(ПериодСохраненный, Параметры)
		
	СписокПериодов = Новый СписокЗначений;
	Если ПериодСохраненный = Справочники.Периоды.ПустаяСсылка() Тогда
		СписокПериодов.Добавить(ПериодСохраненный);
		Возврат СписокПериодов;
	КонецЕсли;
	Периодичность = ПериодСохраненный.Периодичность;	
	Строка = Параметры.ДоступныеПериодичности.НайтиСтроки(Новый Структура("Периодичность", Периодичность))[0];
	РассчитыватьЧерез = Строка.РассчитыватьЧерез;
	Если Периодичность = РассчитыватьЧерез Тогда
		СписокПериодов.Добавить(ПериодСохраненный);
		Возврат СписокПериодов;
	КонецЕсли;
	
	Найдено = Ложь;
	ТекстРодитель = "Родитель";
	Пока Не Найдено Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ Разрешенные
		|	Периоды.Ссылка
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды." + ТекстРодитель + " = &Родитель";
		Запрос.УстановитьПараметр("Родитель", ПериодСохраненный);
		ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
		Если ТаблицаРезультат.Количество() = 0 Тогда
			СписокПериодов.Добавить(ПериодСохраненный);
			Возврат СписокПериодов;
		ИначеЕсли ТаблицаРезультат[0].Ссылка.Периодичность = РассчитыватьЧерез Тогда
			Для каждого Строка Из ТаблицаРезультат Цикл
				СписокПериодов.Добавить(Строка.Ссылка);
			КонецЦикла;
			Возврат СписокПериодов;
		Иначе
			ТекстРодитель = ТекстРодитель + ".Родитель";
		КонецЕсли;
		
	КонецЦикла
	
КонецФункции

// Дорабатывает отчет перед выводом
Процедура ДоработатьТиповойОтчетПередВыводом(ОтчетОбъект, КомпоновщикНастроек = Неопределено, ВыводЗаголовкаПриРасширеннойНастройке = Ложь) Экспорт //Аверсон ЕАЕ 24.05.2021 СВФР-007611 параметр ВыводЗаголовкаПриРасширеннойНастройке
	
	Если КомпоновщикНастроек = Неопределено тогда
		КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	КонецЕсли;
	
	// Отработка "Отрицательное красным"
	Если ОтчетОбъект.ОтрицательноеКрасным И Не ОтчетОбъект.РасширеннаяНастройка Тогда
	
		Для каждого Ресурс Из ПолучитьВыбранныеПоля(КомпоновщикНастроек) Цикл
			Если Не КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Ресурс.Поле).Ресурс Тогда
				Продолжить;
			КонецЕсли;
			НовыйЭлемент = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
			// Настройка отбора
			ЭлементОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ЛевоеЗначение = Ресурс.Поле;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
			ЭлементОтбора.ПравоеЗначение = 0;
			// Настройка оформления
			ЗначениеПараметра = НовыйЭлемент.Оформление.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("MarkNegatives"));
			ЗначениеПараметра.Использование = Истина;
			ЗначениеПараметра.Значение = Истина;
			// Настройка полей
			Поле = НовыйЭлемент.Поля.Элементы.Добавить();
			Поле.Поле = Ресурс.Поле;
		КонецЦикла;
	КонецЕсли;
	
	
	
	//Аверсон ЕАЕ 25.05.2021 СВФР-007611
	//Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) И Не ОтчетОбъект.РасширеннаяНастройка Тогда
	Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) И (Не ОтчетОбъект.РасширеннаяНастройка ИЛИ ВыводЗаголовкаПриРасширеннойНастройке) Тогда
	//Аверсон СВФР-007611
	
		// Убрать вывод заголовка, т.к. он выводится нестандартно
		УстановитьПараметрВывода(КомпоновщикНастроек, "TitleOutput", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	КонецЕсли;
	
КонецПроцедуры

// Дорабатывает отчет перед выводом
Процедура ПолучитьПримененуюНастройку(ОтчетОбъект, КомпоновщикНастроек = Неопределено) Экспорт
	
	Если КомпоновщикНастроек = Неопределено Тогда
		КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	КонецЕсли;

	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПанели  = ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект);
	ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
	Если ПараметрыПанели = Неопределено
	 ИЛИ ЗначенияНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Установка Настроек компоновки на панели настроек
	Для каждого ВидимостьСтраницы Из ЗначенияНастроек.ВидимостьСтраниц Цикл
		Если Не ВидимостьСтраницы.Значение Тогда
			Продолжить;
		КонецЕсли;
		Если ВидимостьСтраницы.Ключ = "Параметры" Тогда
			ЗаполнитьЭлементы(КомпоновщикНастроек.Настройки.ПараметрыДанных, ЗначенияНастроек.НастройкиКомпоновщика.ПараметрыДанных);
		Иначе
			СкопироватьЭлементы(КомпоновщикНастроек.Настройки[ВидимостьСтраницы.Ключ], ЗначенияНастроек.НастройкиКомпоновщика[ВидимостьСтраницы.Ключ], , Ложь);
		КонецЕсли;
	КонецЦикла;
	
	// Установим у всех параметров использование
	Для каждого ЗначениеПараметра Из ЗначенияНастроек.НастройкиКомпоновщика.ПараметрыДанных.Элементы Цикл
		ЗначениеПараметра.Использование = Истина;
	КонецЦикла;
 
	// Установка параметра ПериодОтчета
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	ЕстьПериод = ПараметрыПанели.ДеревоНастроекСтандартныхСтраниц.Строки.НайтиСтроки(Новый Структура("Имя", "Период"))[0].Использование;
	Если ЕстьПериод И ЗначениеПараметра <> Неопределено Тогда
		Периоды = ПолучитьСписокПериодов(ЗначенияНастроек.НастройкаПериода.Период, ПараметрыПанели);
		ЗначениеПараметра.Использование = Периоды.Количество() <> 0;
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
			ЗначениеПараметра.Значение = Периоды;
		Иначе
			ЗначениеПараметра.Значение = Периоды[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыПанели.ДеревоНастроекСтандартныхСтраниц.Строки.Найти("Период").Использование Тогда
		// Установка Стандартного периода
		ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		ЗначениеПараметраКонецПериода  = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		Если ЗначениеПараметраНачалоПериода <> Неопределено И ЗначениеПараметраКонецПериода <> Неопределено Тогда
			
			СтандартныйПериод = Неопределено;
			ЗначенияНастроек.Свойство("СтандартныйПериод", СтандартныйПериод);
			Если СтандартныйПериод <> Неопределено Тогда
				Если СтандартныйПериод.ДатаНачала <> '00010101' Тогда
					ЗначениеПараметраНачалоПериода.Использование = Истина;
					ЗначениеПараметраНачалоПериода.Значение = СтандартныйПериод.ДатаНачала;
				КонецЕсли;
				Если СтандартныйПериод.ДатаОкончания <> '00010101' Тогда
					ЗначениеПараметраКонецПериода.Использование = Истина;
					ЗначениеПараметраКонецПериода.Значение = СтандартныйПериод.ДатаОкончания;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Установка Стандартной даты начала
		ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Если ЗначениеПараметраПериод <> Неопределено Тогда
			
			СтандартнаяДатаНачала = Неопределено;
			ЗначенияНастроек.Свойство("СтандартнаяДатаНачала", СтандартнаяДатаНачала);
			Если СтандартнаяДатаНачала <> Неопределено Тогда
				Если СтандартнаяДатаНачала.Дата <> '00010101' Тогда
					ЗначениеПараметраПериод.Использование = Истина;
					ЗначениеПараметраПериод.Значение = СтандартнаяДатаНачала.Дата;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	// Установка Динамических отборов
	Для каждого СтрокаОтбора Из ПараметрыПанели.Отборы Цикл
		ЗначениеОтбора = ЗначенияНастроек.ДинамическиеОтборы[СтрокаОтбора.Поле];
		Если ЗначениеОтбора = Неопределено ИЛИ Не ЗначениеОтбора.Использование Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаОтбора.ВидОтбора = "Список" ИЛИ СтрокаОтбора.ВидОтбора = "ДлинныйСписок" Тогда
			Если ЗначениеОтбора.ВидСравнения = "" Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеОтбора.ВидСравнения = "Исключая" Тогда
				ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных["Не" + СтрокаОтбора.ВидСравнения];
			Иначе
				ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных[СтрокаОтбора.ВидСравнения];
			КонецЕсли;
		Иначе
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных[СтрокаОтбора.ВидСравнения];
		КонецЕсли;
		
		ДобавитьОтбор(КомпоновщикНастроек, ЗначениеОтбора.Поле, ЗначениеОтбора.Значение, ВидСравненияКомпоновки);
	КонецЦикла;
	УдалитьДублиОтбора(КомпоновщикНастроек);
КонецПроцедуры

// Обновляет заголовок типового отчета
Процедура ОбновитьЗаголовокТиповогоОтчета(ОтчетОбъект, ФормаОтчета) Экспорт
	
	ФормаОтчета.Заголовок = ПолучитьЗаголовокОтчета(ОтчетОбъект, ФормаОтчета);
		
КонецПроцедуры

Функция ПолучитьЗаголовокОтчета(ОтчетОбъект, ФормаОтчета = Неопределено) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Если ФормаОтчета.РежимРедактированияНастройки Тогда
			Заголовок = "Отчет: " + ОтчетОбъект.Наименование + ": " + ФормаОтчета.ПредставлениеНастройки;
		ИначеЕсли ОтчетОбъект.СохраненнаяНастройка.Пустая() ИЛИ ОтчетОбъект.СохраненнаяНастройка.ХранилищеНастроек.Получить() = Неопределено Тогда
			//Заголовок = "Отчет: " + ОтчетОбъект.Наименование + " [" + "<Основной вариант отчета>" + "]";
			
			Заголовок = "Отчет: " + ОтчетОбъект.Наименование;
		Иначе
			Заголовок = "Отчет: " + ОтчетОбъект.Наименование + " [" + ОтчетОбъект.СохраненнаяНастройка + "]";
		КонецЕсли;
	Иначе
		Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
			Если ЗначениеЗаполнено(ОтчетОбъект.СохраненнаяНастройка) Тогда
				ТекстСохраненнаяНастройка = " (" + ОтчетОбъект.СохраненнаяНастройка + ")";
			Иначе
				ТекстСохраненнаяНастройка = "";
			КонецЕсли;
			ЗаголовокОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение;
			Заголовок = ЗаголовокОтчета + ТекстСохраненнаяНастройка;
		Иначе
			Если ОтчетОбъект.СохраненнаяНастройка.Пустая() Тогда
				ТекстСохраненнаяНастройка = "";
			Иначе
				ТекстСохраненнаяНастройка = " [" + ОтчетОбъект.СохраненнаяНастройка + "]";
			КонецЕсли;
			ЗаголовокОтчета = ОтчетОбъект.Метаданные().Синоним;
			Заголовок = ЗаголовокОтчета + ТекстСохраненнаяНастройка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Заголовок;
	
КонецФункции

// Открывает форму настройки периода
Функция НастроитьПериод(НастройкаПериода, НачалоПериода, КонецПериода) Экспорт
	
	НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	НастройкаПериода.УстановитьПериод(НачалоПериода, ?(КонецПериода='0001-01-01', КонецПериода, КонецДня(КонецПериода)));
	НастройкаПериода.РедактироватьКакИнтервал = Истина;
	НастройкаПериода.РедактироватьКакПериод = Истина;
	Если НастройкаПериода.Редактировать() Тогда
		НачалоПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонецПериода = НастройкаПериода.ПолучитьДатуОкончания();
		Возврат НастройкаПериода;
	КонецЕсли;
	
КонецФункции

// Обновляет параметры периода в компоновщике настроек по данным формы
Процедура ОбновитьПараметрыПериодаПоФорме(КомпоновщикНастроек, Форма) Экспорт
	
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ЗначениеПараметраКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ЗначениеПараметраПериод = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметраНачалоПериода <> Неопределено Тогда
		ЗначениеПараметраНачалоПериода.Значение = Форма.НачалоПериода;
		ЗначениеПараметраНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеПараметраКонецПериода <> Неопределено Тогда
		ЗначениеПараметраКонецПериода.Значение = ?(Форма.КонецПериода = '0001-01-01', Форма.КонецПериода, КонецДня(Форма.КонецПериода));
		ЗначениеПараметраКонецПериода.Использование = Истина;
	КонецЕсли;
	
	Если ЗначениеПараметраПериод <> Неопределено Тогда
		ЗначениеПараметраПериод.Значение = ?(Форма.Период = '0001-01-01', Форма.Период, КонецДня(Форма.Период));
		ЗначениеПараметраПериод.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

//Обновляет элементы формы типового отчета по компоновщику настроек
Процедура ОбновитьФормуТиповогоОтчетаПоКомпоновщику(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
		// Параметры периода
		ЗначениеПараметраНачалоПериода = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		ЗначениеПараметраКонецПериода = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		ЗначениеПараметраПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		Если ЗначениеПараметраНачалоПериода <> Неопределено 
		   И ЗначениеПараметраКонецПериода <> Неопределено Тогда
			ФормаОтчета.НачалоПериода = ЗначениеПараметраНачалоПериода.Значение;
			ФормаОтчета.КонецПериода = ЗначениеПараметраКонецПериода.Значение;
			ФормаОтчета.ЭлементыФормы.ПанельПериод.ТекущаяСтраница = ФормаОтчета.ЭлементыФормы.ПанельПериод.Страницы.Интервал;
		ИначеЕсли ЗначениеПараметраПериод <> Неопределено Тогда
			//Островская Татьяна 02.09.2013 № 16745
			если ЗначениеЗаполнено(ЗначениеПараметраПериод.Значение) Тогда 
				ФормаОтчета.Период = ЗначениеПараметраПериод.Значение;
			КонецЕсли;
			Если ТипЗнч(ОтчетОбъект) <> Тип("ОтчетОбъект.ОстаткиОтпусковПоРабочимГодам") 
				И Найти(Сокрлп(ОтчетОбъект),"ОстаткиОтпусковПоРабочимГодам") = 0 Тогда //СВЭЙ 20.05.2024 КВВ СВФР-012949
				если не Тип(ОтчетОбъект) = тип(Отчеты.СпискиРаботников.Создать()) Тогда 
					ФормаОтчета.ЭлементыФормы.ПанельПериод.ТекущаяСтраница = ФормаОтчета.ЭлементыФормы.ПанельПериод.Страницы.Период;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТипЗнч(ОтчетОбъект) <> Тип("ОтчетОбъект.ОстаткиОтпусковПоРабочимГодам") 
				И Найти(Сокрлп(ОтчетОбъект),"ОстаткиОтпусковПоРабочимГодам") = 0 Тогда //СВЭЙ 20.05.2024 КВВ СВФР-012949
				
				если не Тип(ОтчетОбъект) = тип(Отчеты.СпискиРаботников.Создать()) Тогда
					ФормаОтчета.ЭлементыФормы.ПанельПериод.ТекущаяСтраница = ФормаОтчета.ЭлементыФормы.ПанельПериод.Страницы.Пустой;
				КонецЕсли;
			КонецЕсли;
			//Островская Татьяна 02.09.2013 № 16745
		КонецЕсли;
		
		// Вывод заголовка отменяется
		Значение = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("TitleOutput")).Значение;
		Пометка = (Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить);
		//Островская Татьяна 02.09.2013 № 16745
		если Тип(ОтчетОбъект) = тип(Отчеты.СпискиРаботников.Создать()) Тогда
			ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
			ВыводитьЗаголовокОтчета = Истина;
			Если ЗначенияНастроек = Неопределено
				ИЛИ Не ЗначенияНастроек.Свойство("ВыводитьЗаголовокОтчета", ВыводитьЗаголовокОтчета) Тогда
				ВыводитьЗаголовок = Истина;	
			Иначе
				ВыводитьЗаголовок = ВыводитьЗаголовокОтчета;
			КонецЕсли;
			ФормаОтчета.ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.Заголовок.Пометка = ВыводитьЗаголовок;
			
		иначе
			Если ТипЗнч(ОтчетОбъект) <> Тип("ОтчетОбъект.ОстаткиОтпусковПоРабочимГодам") 
				И Найти(Сокрлп(ОтчетОбъект),"ОстаткиОтпусковПоРабочимГодам") = 0 Тогда //СВЭЙ 20.05.2024 КВВ СВФР-012949
				ФормаОтчета.ЭлементыФормы.ДействияФормы.Кнопки.Заголовок.Пометка = Пометка;
			КонецЕсли;
		КонецЕсли;
		//Островская Татьяна 02.09.2013 № 16745
	Иначе
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
		ВыводитьЗаголовокОтчета = Истина;
		Если ЗначенияНастроек = Неопределено
			ИЛИ Не ЗначенияНастроек.Свойство("ВыводитьЗаголовокОтчета", ВыводитьЗаголовокОтчета) Тогда
			ВыводитьЗаголовок = Истина;	
		Иначе
			ВыводитьЗаголовок = ВыводитьЗаголовокОтчета;
		КонецЕсли;
		ФормаОтчета.ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.Заголовок.Пометка = ВыводитьЗаголовок;
		
		ДополнительныеНастройкиОтчета = Новый Массив;
		Попытка 
			ДополнительныеНастройкиОтчета = ОтчетОбъект.ПолучитьДополнительныеНастройкиОтчета();
		Исключение
		КонецПопытки;
		Для каждого ДопНастройка из ДополнительныеНастройкиОтчета Цикл
			ЗначениеФлажка = ДопНастройка.ЗначениеПоУмолчанию;
			Если ЗначенияНастроек = Неопределено
				ИЛИ Не ЗначенияНастроек.Свойство(ДопНастройка.Имя, ЗначениеФлажка) Тогда
				Флажок = ложь;	
			Иначе
				Флажок = ЗначениеФлажка;
			КонецЕсли;
			Если ФормаОтчета.ЭлементыФормы.Найти(ДопНастройка.Имя) <> Неопределено тогда
				ФормаОтчета.ЭлементыФормы[ДопНастройка.Имя].Значение = Флажок;
			КонецЕсли;
		КонецЦИкла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоДетальнаяЗапись(ДанныеРасшифровки, Расшифровка)
	
	ЭтоДетальнаяЗапись = Ложь;
	Элемент = ДанныеРасшифровки.Элементы[Расшифровка];
	Если ТипЗнч(Элемент) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
		Элементы = Элемент.ПолучитьРодителей();
		Если Элементы.Количество() > 0 Тогда
			Элемент = Элементы[0];
			Если ТипЗнч(Элемент) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
				ЭтоДетальнаяЗапись = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ЭтоДетальнаяЗапись;
	
КонецФункции
	
Функция ЭтоВнешнийОбъект(ОтчетОбъект)
	
	Если Строка(ОтчетОбъект) = "ВнешнийОтчетОбъект." + ОтчетОбъект.Метаданные().Имя Тогда
		ЭтоВнешнийОтчет = Истина;
	Иначе 
		ЭтоВнешнийОтчет = Ложь;
	КонецЕсли;
	Возврат ЭтоВнешнийОтчет;

КонецФункции

// Процедура РезультатОбработкаРасшифровки
// Действие, выполняемое при вызове расшифровки пользователем
Процедура СтандартнаяОбработкаРасшифровкиТиповогоОтчета(ОтчетОбъект, ФормаОтчета, Расшифровка, СтандартнаяОбработка)

	Перем ВыполненноеДействие;

	// Запретим стандартную обработку расшифровки
	СтандартнаяОбработка = Ложь;

	// Создадим и инициализируем обработчик расшифровки
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ФормаОтчета.ДанныеРасшифровки, 
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект)));

	// Осуществим выбор действия расшифровки пользователем
	Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие);

	Если Настройки <> Неопределено Тогда
		// Пользователь выбрал действие, для которого нужно менять настройки

		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить Тогда
			// Если требется упорядочить - упорядочим в текущем отчете
			ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
			ФормаОтчета.ОбновитьОтчет();

		Иначе
			
			НовыйОтчет = Отчеты[ОтчетОбъект.Метаданные().Имя].Создать();
			ЗаполнитьЗначенияСвойств(НовыйОтчет, ОтчетОбъект, , "СохраненнаяНастройка");
			НовыйОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
			
			ФормаНовогоОтчета = НовыйОтчет.ПолучитьФорму();
			НазначитьФормеУникальныйКлючИдентификации(ФормаНовогоОтчета);
			ФормаНовогоОтчета.ЭтоОтработкаРасшифровки = Истина;
			Если Не ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
				ФормаНовогоОтчета.РежимРедактированияНастройки = Истина;
				ФормаНовогоОтчета.ПредставлениеНастройки = "Расшифровка " + Символы.ПС + ОтчетОбъект.СохраненнаяНастройка;
			КонецЕсли;
			ФормаНовогоОтчета.Открыть();
			ФормаНовогоОтчета.ОбновитьОтчет();
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Отрабатывает расшифровки типового отчета
Процедура ОбработкаРасшифровкиТиповогоОтчета(Расшифровка, СтандартнаяОбработка, ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		ФормаОтчета.ОбработкаРасшифровкиАналитическогоОтчета(Расшифровка, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
		
	Если ОтчетОбъект.РасширеннаяНастройка Тогда
		СтандартнаяОбработкаРасшифровкиТиповогоОтчета(ОтчетОбъект, ФормаОтчета, Расшифровка, СтандартнаяОбработка);
		Возврат;
	КонецЕсли;
	
	ЭтоВнешнийОтчет = ЭтоВнешнийОбъект(ОтчетОбъект);
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоДетальнаяЗапись = ЭтоДетальнаяЗапись(ФормаОтчета.ДанныеРасшифровки, Расшифровка);
	МассивПолейРасшифровки = ПолучитьМассивПолейРасшифровки(Расшифровка, ФормаОтчета.ДанныеРасшифровки);
	МассивПолейРасшифровкиСРесурсами = ПолучитьМассивПолейРасшифровки(Расшифровка, ФормаОтчета.ДанныеРасшифровки, , Истина);
	
	// Получим имена полей расшифровываемой ячейки
	МассивПолей = Новый Массив; 
	Для каждого ПолеРасшифровки Из МассивПолейРасшифровкиСРесурсами Цикл
		Если ТипЗнч(ПолеРасшифровки) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда 
			МассивПолей.Добавить(ПолеРасшифровки.Поле);
		КонецЕсли;
	КонецЦикла;
	
	СписокДоступныхРасшифровок = Новый СписокЗначений;
	
	// Добавим в список выбора расшифровки другие отчеты
	Если ОтчетОбъект.Расшифровки <> Неопределено И ТипЗнч(ОтчетОбъект.Расшифровки) <> Тип("СписокЗначений") Тогда
		Расшифровки = ОтчетОбъект.Расшифровки.Получить();
		Для каждого ОтчетРасшифровки Из Расшифровки Цикл
			
			ПолеНайдено = ОтчетРасшифровки.Поля.Количество() = 0;
			Для каждого Поле Из МассивПолей Цикл
				Если ОтчетРасшифровки.Поля.НайтиПоЗначению(Поле) <> Неопределено Тогда
					ПолеНайдено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ПолеНайдено Тогда
				Продолжить;
			КонецЕсли;
			СписокДоступныхРасшифровок.Добавить(ОтчетРасшифровки, ОтчетРасшифровки.Представление,, );
			
		КонецЦикла;
	КонецЕсли;
	
	// Добавим в список выбора расшифровки Открыть значение
	Индекс = 0;
	Для каждого ПолеРасшифровки Из МассивПолейРасшифровки Цикл
		Если ТипЗнч(ПолеРасшифровки) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных")
		   И ПолеРасшифровки.Значение <> Null Тогда
			СписокДоступныхРасшифровок.Добавить("ОткрытьЗначение" + Формат(Индекс, "ЧЦ=2; ЧН=; ЧВН="), "Открыть: " + ПолеРасшифровки.Поле + " = """ +  ПолеРасшифровки.Значение + """",,БиблиотекаКартинок.Лупа);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если Не ЭтоДетальнаяЗапись И Не ЭтоВнешнийОтчет Тогда
		СписокДоступныхРасшифровок.Добавить("Расшифровать", "Расшифровать...",,);
	КонецЕсли;
	
	Если СписокДоступныхРасшифровок.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли СписокДоступныхРасшифровок.Количество() = 1 Тогда
		ВыбранноеЗначение = СписокДоступныхРасшифровок[0];
	Иначе
		ВыбранноеЗначение = ФормаОтчета.ВыбратьИзМеню(СписокДоступныхРасшифровок);
	КонецЕсли;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	ИначеЕсли ВыбранноеЗначение.Значение = "СтандартнаяРасшифровка" Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	ИначеЕсли Лев(ВыбранноеЗначение.Значение, 15) = "ОткрытьЗначение" Тогда
		// Открыть значение
		ОткрытьЗначение(МассивПолейРасшифровки[Число(Прав(ВыбранноеЗначение.Значение,2))].Значение);
	ИначеЕсли ВыбранноеЗначение.Значение = "Расшифровать" Тогда
		// Расшифровать собственным отчетом
		ФормаВыбораПоля = ПолучитьОбщуюФорму("ФормаВыбораДоступногоПоляКомпоновщикаНастроек");
		ФормаВыбораПоля.КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
		РодителиПоля = Новый Массив;
		ДобавитьРодителей(ФормаОтчета.ДанныеРасшифровки.Элементы[Расшифровка], ФормаОтчета.ДанныеРасшифровки, РодителиПоля);
		ФормаВыбораПоля.РодителиПоля = РодителиПоля;
		Результат = ФормаВыбораПоля.ОткрытьМодально();
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ФормаОтчета.ДанныеРасшифровки, 
		  Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОтчетОбъект.СхемаКомпоновкиДанных));
		
		НастройкиКомпоновки = ОбработкаРасшифровки.Расшифровать(Расшифровка, Результат.Поле);
		
		НовыйОтчет = Отчеты[ОтчетОбъект.Метаданные().Имя].Создать();
		ЗаполнитьЗначенияСвойств(НовыйОтчет, ОтчетОбъект, , "СохраненнаяНастройка");
		НовыйОтчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);

		Группировка = ПолучитьПоследнийЭлементСтруктуры(НовыйОтчет.КомпоновщикНастроек);
		Если Группировка.Порядок.Элементы.Количество() = 0 Тогда
			ДобавитьАвтоЭлементПорядка(Группировка);
		КонецЕсли;
		
		ФормаНовогоОтчета = НовыйОтчет.ПолучитьФорму();
		НазначитьФормеУникальныйКлючИдентификации(ФормаНовогоОтчета);
		ФормаНовогоОтчета.ЭтоОтработкаРасшифровки = Истина;
		Если Не ЭтоСтараяВерсияОтчета(ОтчетОбъект) Тогда
			ФормаНовогоОтчета.РежимРедактированияНастройки = Истина;
			ФормаНовогоОтчета.ПредставлениеНастройки = "Расшифровка " + Символы.ПС + ОтчетОбъект.СохраненнаяНастройка;
		КонецЕсли;
		ФормаНовогоОтчета.Открыть();
		ФормаНовогоОтчета.ОбновитьОтчет();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение.Значение) = Тип("СтрокаТаблицыЗначений") Тогда
		// Расшифровать другим отчетом
		НовыйОтчет = Отчеты[ВыбранноеЗначение.Значение.Отчет].Создать();
		НовыйОтчет.СохраненнаяНастройка = ВыбранноеЗначение.Значение.СохраненнаяНастройка;
		НовыйОтчет.ПрименитьНастройку();
		НовыйОтчет.Настроить(МассивПолейРасшифровки);
		ФормаНовогоОтчета = НовыйОтчет.ПолучитьФорму();
		НазначитьФормеУникальныйКлючИдентификации(ФормаНовогоОтчета);
		ФормаНовогоОтчета.ЭтоОтработкаРасшифровки = Истина;
		ФормаНовогоОтчета.РежимРедактированияНастройки = Истина;
		ФормаНовогоОтчета.ПредставлениеНастройки = "Расшифровка " + Символы.ПС + ОтчетОбъект.СохраненнаяНастройка;
		ФормаНовогоОтчета.Открыть();
		ФормаНовогоОтчета.ОбновитьОтчет()
	КонецЕсли;
	
КонецПроцедуры

// На основании отбора настраивает расшифровываемый отчет
Процедура НастроитьТиповойОтчет(ОтчетОбъект, Отбор, КомпоновщикОсновногоОтчета = Неопределено) Экспорт
	
	Если ТипЗнч(Отбор) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если ОтчетОбъект.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Настройка параметров
	Если КомпоновщикОсновногоОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для каждого ПараметрОсновногоОтчета Из КомпоновщикОсновногоОтчета.Настройки.ПараметрыДанных.Элементы Цикл
		ЗначениеПараметра = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрОсновногоОтчета.Параметр);
		Если ЗначениеПараметра <> Неопределено Тогда
			ЗначениеПараметра.Значение = ПараметрОсновногоОтчета.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выводит на печать без предварительного просмотра табличный документ
Процедура ПечатьТиповогоОтчета(Результат) Экспорт
	
	Результат.Напечатать();
	
КонецПроцедуры

// Открывает форму редактирования пользовательского поля
Процедура РедактироватьПользовательскиеПоля(КомпоновщикНастроек, ОтчетОбъект) Экспорт
	
	КонструкторПользовательскихПолей = Обработки.КонструкторПользовательскихПолей.Создать();
	Форма = КонструкторПользовательскихПолей.ПолучитьФорму("Форма", );
	Форма.ОтчетОбъект = ОтчетОбъект;	
	Форма.КомпоновщикНастроек = КомпоновщикНастроек;
	Форма.ОткрытьМодально();
	
КонецПроцедуры

// Возвращает имя формы, с помощью которого следует редактировать пользовательское поле
Функция ПолучитьИмяФормыРедактированияПользовательскогоПоля(ПользовательскоеПоле) Экспорт
	
	Если ТипЗнч(ПользовательскоеПоле) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
		Если ПолучитьВыражениеАгрегатаИтоговыхЗаписей(ПользовательскоеПоле) <> Неопределено Тогда
			ИмяФормы = "Форма" + "Формула";
			Возврат ИмяФормы;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ПользовательскоеПоле.Варианты.Элементы.Количество() > 0
	   И ПолучитьПараметрИзСтроки(ПользовательскоеПоле.Варианты.Элементы[0].Значение) = "ДоработкаТаблицы" Тогда
		ИмяФормы = "Форма" + ПолучитьПараметрИзСтроки(ПользовательскоеПоле.Варианты.Элементы[0].Значение, 2);
	КонецЕсли;
	Если ПользовательскоеПоле.Варианты.Элементы.Количество() > 2
	   И (ПользовательскоеПоле.Варианты.Элементы[0].Значение = "1Тренд"
	 ИЛИ ПользовательскоеПоле.Варианты.Элементы[0].Значение = "1Состояние") Тогда
		ИмяФормы = "ФормаИнтервал";
	ИначеЕсли ПользовательскоеПоле.Варианты.Элементы.Количество() > 1
			И ПользовательскоеПоле.Варианты.Элементы[0].Значение = "0ИГ" Тогда
		ИмяФормы = "ФормаИнтервалы";
	КонецЕсли;
	Возврат ИмяФормы;
	
КонецФункции

Функция ПолучитьВыражениеАгрегатаИтоговыхЗаписей(ПользовательскоеПоле) Экспорт
	
	ВыражениеДетальныхЗаписей = ПользовательскоеПоле.ПолучитьПредставлениеВыраженияДетальныхЗаписей();
	ВыражениеИтоговыхЗаписей = ПользовательскоеПоле.ПолучитьПредставлениеВыраженияИтоговыхЗаписей();
	ВыражениеАгрегата = СтрЗаменить(ВыражениеИтоговыхЗаписей, ВыражениеДетальныхЗаписей, "");
	ВыражениеАгрегата = СтрЗаменить(ВыражениеАгрегата, ")", "");
	Если ВыражениеАгрегата = "Сумма("
	 ИЛИ ВыражениеАгрегата = "Количество(Различные "
	 ИЛИ ВыражениеАгрегата = "Количество("
	 ИЛИ ВыражениеАгрегата = "Максимум("
	 ИЛИ ВыражениеАгрегата = "Минимум("
	 ИЛИ ВыражениеАгрегата = "Среднее(" Тогда
		Возврат ВыражениеАгрегата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрИзСтроки(Знач Строка, НомерПараметра = 1) Экспорт
	
	Для Индекс = 1 По НомерПараметра Цикл
		ПоложениеЗапятой = Найти(Строка, ",");
		Если ПоложениеЗапятой = 0 Тогда
			ПодСтрока = Строка;
			Возврат Подстрока;
		Иначе
			ПодСтрока = Лев(Строка, ПоложениеЗапятой - 1);
		КонецЕсли;
		Строка = Сред(Строка, ПоложениеЗапятой + 1);
	КонецЦикла;
	
	Возврат ПодСтрока;
	
КонецФункции

// Возвращает список доступных для выбора ресурсов
Функция ПолучитьСписокДоступныхРесурсов(КомпоновщикНастроек, ВключаяПользовательскиеПоляВыражение = Истина, ВключаяПользовательскиеПоляВыбор = Истина) Экспорт
	
	СписокРесурсов = Новый СписокЗначений;
	ДобавитьРесурсы(СписокРесурсов, КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора, КомпоновщикНастроек, ВключаяПользовательскиеПоляВыражение, ВключаяПользовательскиеПоляВыбор);
	Возврат СписокРесурсов;
	
КонецФункции

Функция ДобавитьРесурсы(СписокРесурсов, КоллекцияПолей, КомпоновщикНастроек, ВключаяПользовательскиеПоляВыражение, ВключаяПользовательскиеПоляВыбор)
	
	Для каждого ДоступноеПоле Из КоллекцияПолей.Элементы Цикл
		Если ДоступноеПоле.Ресурс Тогда
			ПользовательскоеПоле = НайтиПользовательскоеПоле(КомпоновщикНастроек, ДоступноеПоле.Поле);
			Если ПользовательскоеПоле <> Неопределено Тогда
				Если Не (ТипЗнч(ПользовательскоеПоле) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") И ВключаяПользовательскиеПоляВыражение
					ИЛИ ТипЗнч(ПользовательскоеПоле) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") И ВключаяПользовательскиеПоляВыбор) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СписокРесурсов.Добавить(ДоступноеПоле.Поле, ДоступноеПоле.Заголовок);
		КонецЕсли;
		Если ДоступноеПоле.Папка Тогда
			ДобавитьРесурсы(СписокРесурсов, ДоступноеПоле, КомпоновщикНастроек, ВключаяПользовательскиеПоляВыражение, ВключаяПользовательскиеПоляВыбор);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Возвращает доступное поле по полю компоновки
Функция ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ПолеКомпоновкиДанных, ОбластьПоиска) Экспорт
	
	Если ТипЗнч(ПолеКомпоновкиДанных) = Тип("Строка") Тогда
		ПолеПоиска = Новый ПолеКомпоновкиДанных(ПолеКомпоновкиДанных);
	Иначе
		ПолеПоиска = ПолеКомпоновкиДанных;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПоиска) = Тип("КомпоновщикНастроекКомпоновкиДанных")
	 ИЛИ ТипЗнч(ОбластьПоиска) = Тип("ДанныеРасшифровкиКомпоновкиДанных")
	 ИЛИ ТипЗнч(ОбластьПоиска) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		Возврат ОбластьПоиска.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеПоиска);
	Иначе
		Возврат ОбластьПоиска.НайтиПоле(ПолеПоиска);
	КонецЕсли;
	
КонецФункции

// Заполняет отбор построителя по отбору компоновщика
Процедура ЗаполнитьОтборПоОтборуКомпоновщика(Отбор, ОтборКомпоновщика) Экспорт
	
	ЗаполнитьЗначенияСвойств(Отбор, ОтборКомпоновщика, "Использование, Представление");
	
	Если ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		Отбор.ВидСравнения = ВидСравнения.Больше;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		Отбор.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		Отбор.ВидСравнения = ВидСравнения.ВИерархии;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		Отбор.ВидСравнения = ВидСравнения.ВСписке;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		Отбор.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		Отбор.ВидСравнения = ВидСравнения.Меньше;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		Отбор.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		Отбор.ВидСравнения = ВидСравнения.НеВИерархии;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		Отбор.ВидСравнения = ВидСравнения.НеВСписке;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		Отбор.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		Отбор.ВидСравнения = ВидСравнения.НеРавно;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		Отбор.ВидСравнения = ВидСравнения.НеСодержит;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		Отбор.ВидСравнения = ВидСравнения.Равно;
	ИначеЕсли ОтборКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
		Отбор.ВидСравнения = ВидСравнения.Содержит;
	Иначе
		// Не нашли соответствие - не применяем отбор
		Отбор.Использование = Ложь;
		Возврат;
	КонецЕсли;
	
	Отбор.Значение = ОтборКомпоновщика.ПравоеЗначение;
	
КонецПроцедуры

// Возвращает список всех группировок компоновщика настроек
Функция ПолучитьГруппировки(КомпоновщикНастроек) Экспорт
	
	СписокПолей = Новый СписокЗначений;
	
	Структура = КомпоновщикНастроек.Настройки.Структура;
	ДобавитьГруппировки(Структура, СписокПолей);
	Возврат СписокПолей;
	
КонецФункции

Процедура ДобавитьГруппировки(Структура, СписокПолей)
	
	Для каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ДобавитьГруппировки(ЭлементСтруктуры.Строки, СписокПолей);
			ДобавитьГруппировки(ЭлементСтруктуры.Колонки, СписокПолей);
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			ДобавитьГруппировки(ЭлементСтруктуры.Серии, СписокПолей);
			ДобавитьГруппировки(ЭлементСтруктуры.Точки, СписокПолей);
		Иначе
			СписокПолей.Добавить(ЭлементСтруктуры);
			ДобавитьГруппировки(ЭлементСтруктуры.Структура, СписокПолей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив полей группировок всех группировок компоновщика настроек
Функция ПолучитьМассивПолейГруппировки(КомпоновщикНастроек, БезПользовательскихПолей = Ложь) Экспорт
	
	МассивПолей = Новый Массив;
	
	Структура = КомпоновщикНастроек.Настройки.Структура;
	ДобавитьПоляГруппировкиВМассив(Структура, МассивПолей, БезПользовательскихПолей);
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьПоляГруппировкиВМассив(Структура, МассивПолей, БезПользовательскихПолей)
	
	Для каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ДобавитьПоляГруппировкиВМассив(ЭлементСтруктуры.Строки, МассивПолей, БезПользовательскихПолей);
			ДобавитьПоляГруппировкиВМассив(ЭлементСтруктуры.Колонки, МассивПолей, БезПользовательскихПолей);
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			ДобавитьПоляГруппировкиВМассив(ЭлементСтруктуры.Серии, МассивПолей, БезПользовательскихПолей);
			ДобавитьПоляГруппировкиВМассив(ЭлементСтруктуры.Точки, МассивПолей, БезПользовательскихПолей);
		Иначе
			Для каждого ТекущееПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				ДоступноеПоле = ЭлементСтруктуры.Выбор.ДоступныеПоляВыбора.НайтиПоле(ТекущееПолеГруппировки.Поле);
				Если ДоступноеПоле <> Неопределено 
				  И (ДоступноеПоле.Родитель = Неопределено ИЛИ Не БезПользовательскихПолей ИЛИ ДоступноеПоле.Родитель.Поле <> Новый ПолеКомпоновкиДанных("UserFields")) Тогда
                	МассивПолей.Добавить(ТекущееПолеГруппировки);
				КонецЕсли;
			КонецЦикла;
			ДобавитьПоляГруппировкиВМассив(ЭлементСтруктуры.Структура, МассивПолей, БезПользовательскихПолей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список полей группировок всех группировок компоновщика настроек
Функция ПолучитьПоляГруппировок(КомпоновщикНастроек, БезПользовательскихПолей = Ложь) Экспорт
	
	СписокПолей = Новый СписокЗначений;
	
	Структура = КомпоновщикНастроек.Настройки.Структура;
	ДобавитьПоляГруппировки(Структура, СписокПолей, БезПользовательскихПолей);
	Возврат СписокПолей;
	
КонецФункции

Процедура ДобавитьПоляГруппировки(Структура, СписокПолей, БезПользовательскихПолей)
	
	Для каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ДобавитьПоляГруппировки(ЭлементСтруктуры.Строки, СписокПолей, БезПользовательскихПолей);
			ДобавитьПоляГруппировки(ЭлементСтруктуры.Колонки, СписокПолей, БезПользовательскихПолей);
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			ДобавитьПоляГруппировки(ЭлементСтруктуры.Серии, СписокПолей, БезПользовательскихПолей);
			ДобавитьПоляГруппировки(ЭлементСтруктуры.Точки, СписокПолей, БезПользовательскихПолей);
		Иначе
			Для каждого ТекущееПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				ДоступноеПоле = ЭлементСтруктуры.Выбор.ДоступныеПоляВыбора.НайтиПоле(ТекущееПолеГруппировки.Поле);
				Если ДоступноеПоле <> Неопределено 
				  И (ДоступноеПоле.Родитель = Неопределено ИЛИ Не БезПользовательскихПолей ИЛИ ДоступноеПоле.Родитель.Поле <> Новый ПолеКомпоновкиДанных("UserFields")) Тогда
					СписокПолей.Добавить(Строка(ДоступноеПоле.Поле), ДоступноеПоле.Заголовок);
				КонецЕсли;
			КонецЦикла;
			ДобавитьПоляГруппировки(ЭлементСтруктуры.Структура, СписокПолей, БезПользовательскихПолей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает группировку по полю группировки
Функция ПолучитьЭлементСтруктурыПоПолюГруппировки(ПолеГруппировки, КомпоновщикНастроек) Экспорт
	
	Структура = КомпоновщикНастроек.Настройки.Структура;
	Возврат НайтиЭлементСтруктурыПоПолюГруппировки(Структура, ПолеГруппировки);
	
КонецФункции

Функция НайтиЭлементСтруктурыПоПолюГруппировки(Структура, ПолеГруппировки)
	
	Для каждого ЭлементСтруктуры Из Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ЭлементСтруктуры = НайтиЭлементСтруктурыПоПолюГруппировки(ЭлементСтруктуры.Строки, ПолеГруппировки);
			Если ЭлементСтруктуры = Неопределено Тогда
				Возврат НайтиЭлементСтруктурыПоПолюГруппировки(ЭлементСтруктуры.Колонки, ПолеГруппировки);
			Иначе
				Возврат ЭлементСтруктуры;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			НайденныйЭлементСтруктуры = НайтиЭлементСтруктурыПоПолюГруппировки(ЭлементСтруктуры.Серии, ПолеГруппировки);
			Если НайденныйЭлементСтруктуры = Неопределено Тогда
				Возврат НайтиЭлементСтруктурыПоПолюГруппировки(ЭлементСтруктуры.Точки, ПолеГруппировки);
			Иначе
				Возврат ЭлементСтруктуры;
			КонецЕсли;
		Иначе
			Для каждого ТекущееПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				Если ПолеГруппировки = ТекущееПолеГруппировки.Поле Тогда
					Возврат ЭлементСтруктуры;
				КонецЕсли;
			КонецЦикла;
			Возврат НайтиЭлементСтруктурыПоПолюГруппировки(ЭлементСтруктуры.Структура, ПолеГруппировки);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Возвращает пользовательское поле по полю компоновки данных
Функция НайтиПользовательскоеПоле(КомпоновщикНастроек, ПолеКомпоновкиДанных) Экспорт
	
	Для каждого ПользовательскоеПоле Из КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы Цикл
		Если ПользовательскоеПоле.ПутьКДанным = Строка(ПолеКомпоновкиДанных) Тогда
			Возврат ПользовательскоеПоле;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Возвращает массив наборов данных - запрос в схеме компоновки данных
Функция ПолучитьНаборыДанныхЗапрос(СхемаКомпоновкиДанных, НаборыДанных = Неопределено, МассивНаборовДанных = Неопределено) Экспорт
	
	Если МассивНаборовДанных = Неопределено Тогда
		МассивНаборовДанных = Новый Массив;
	КонецЕсли;
	Если НаборыДанных = Неопределено Тогда
		НаборыДанных = СхемаКомпоновкиДанных.НаборыДанных;
	КонецЕсли;
	
	Для каждого НаборДанных Из НаборыДанных Цикл
		Если ТипЗнч(НаборДанных) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			МассивНаборовДанных.Добавить(НаборДанных);
		ИначеЕсли ТипЗнч(НаборДанных) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
			ПолучитьНаборыДанныхЗапрос(СхемаКомпоновкиДанных, НаборДанных.Элементы, МассивНаборовДанных)
		КонецЕсли;
	КонецЦикла;
	Возврат МассивНаборовДанных;
	
КонецФункции

// Возвращает группировку - детальные записи компоновщика настроек
Функция ПолучитьЭлементСтруктурыДетальныеЗаписи(КомпоновщикНастроек) Экспорт
	
	ПоследнийЭлементСтруктуры = ПолучитьПоследнийЭлементСтруктуры(КомпоновщикНастроек, Истина);
	Если ТипЗнч(ПоследнийЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных")
	 ИЛИ ТипЗнч(ПоследнийЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(ПоследнийЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		Если ПоследнийЭлементСтруктуры.ПоляГруппировки.Элементы.Количество() = 0 Тогда
			Возврат ПоследнийЭлементСтруктуры;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает последний элемент структуры - группировку
Функция ПолучитьПоследнийЭлементСтруктуры(КомпоновщикНастроек, Строки = Истина) Экспорт
	
	Структура = КомпоновщикНастроек.Настройки.Структура;
	Если Структура.Количество() = 0 Тогда
		Возврат КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	Если Строки Тогда
		ИмяСтруктурыТаблицы = "Строки";
		ИмяСтруктурыДиаграммы = "Серии";
	Иначе
		ИмяСтруктурыТаблицы = "Колонки";
		ИмяСтруктурыДиаграммы = "Точки";
	КонецЕсли;
	
	Пока Истина Цикл
		ЭлементСтруктуры = Структура[0];
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") И ЭлементСтруктуры[ИмяСтруктурыТаблицы].Количество() > 0 Тогда
			Если ЭлементСтруктуры[ИмяСтруктурыТаблицы][0].Структура.Количество() = 0 Тогда
				Структура = ЭлементСтруктуры[ИмяСтруктурыТаблицы];
				Прервать;
			КонецЕсли;
			Структура = ЭлементСтруктуры[ИмяСтруктурыТаблицы][0].Структура;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных") И ЭлементСтруктуры[ИмяСтруктурыДиаграммы].Количество() > 0 Тогда
			Если ЭлементСтруктуры[ИмяСтруктурыДиаграммы][0].Структура.Количество() = 0 Тогда
				Структура = ЭлементСтруктуры[ИмяСтруктурыДиаграммы];
				Прервать;
			КонецЕсли;
			Структура = ЭлементСтруктуры[ИмяСтруктурыДиаграммы][0].Структура;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных")
			  ИЛИ ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
			  ИЛИ ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
			Если ЭлементСтруктуры.Структура.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			Структура = ЭлементСтруктуры.Структура;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Возврат ЭлементСтруктуры[ИмяСтруктурыТаблицы];
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ДиаграммаКомпоновкиДанных")	Тогда
			Возврат ЭлементСтруктуры[ИмяСтруктурыДиаграммы];
		Иначе
			Возврат ЭлементСтруктуры;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Структура[0];
	
КонецФункции

////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ ПРОГРАММНОЙ НАСТРОЙКИ КОМПОНОВЩИКА НАСТРОЕК

// Устанавливает параметр данных компоновщика настроек
Функция УстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, Значение) Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = Значение;
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
КонецФункции

// Устанавливает параметр вывода компоновщика настроек
Функция УстановитьПараметрВывода(КомпоновщикНастроек, ИмяПараметра, Значение) Экспорт
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = Значение;
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
КонецФункции

// Добавляет отбор в набор отборов компоновщика или группы отборов
Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение, ВидСравнения = Неопределено) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Поле;
	НовыйЭлемент.ВидСравнения = ВидСравнения;
	НовыйЭлемент.ПравоеЗначение = Значение;
	Возврат НовыйЭлемент;
	
КонецФункции

// Удаляет отбор из компоновщика настроек, если поле не указано, очищает отбор
Функция УдалитьОтбор(КомпоновщикНастроек, Знач Поле = Неопределено) Экспорт
	
	Если Поле = Неопределено Тогда
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Возврат Истина;
	КонецЕсли;
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	ПолеУдалено = Ложь;
	Элементы = ПолучитьЭлементыОтбора(КомпоновщикНастроек);
	Для каждого Элемент Из Элементы Цикл
		Если Элемент.Использование И Элемент.ЛевоеЗначение = Поле Тогда
			Элемент.Использование = Ложь;
			ПолеУдалено = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ПолеУдалено;
	
КонецФункции

// Удаляет указанное выбранное поле из компоновщика настроек, если поле не указано - очищает все поля
Функция УдалитьВыбранноеПоле(ЭлементСтруктуры, Знач Поле = Неопределено) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Если Поле = Неопределено Тогда
		ВыбранныеПоля.Элементы.Очистить();
		Возврат Истина;
	КонецЕсли;
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	ПолеУдалено = Ложь;
	Элементы = ПолучитьВыбранныеПоля(ВыбранныеПоля);
	Для каждого Элемент Из Элементы Цикл
		Если Элемент.Использование И Элемент.Поле = Поле Тогда
			Элемент.Использование = Ложь;
			ПолеУдалено = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ПолеУдалено;
	
КонецФункции

// Добавляет группировку в компоновщик настроек в самый нижний уровень структуры, если поле не укзано - детальные поля
Функция ДобавитьГруппировку(КомпоновщикНастроек, Знач Поле = Неопределено, Строки = Истина) Экспорт
	
	ЭлементСтруктуры = ПолучитьПоследнийЭлементСтруктуры(КомпоновщикНастроек, Строки);
	Если ЭлементСтруктуры = Неопределено 
	 ИЛИ ПолучитьЭлементСтруктурыДетальныеЗаписи(КомпоновщикНастроек) <> Неопределено 
	   И Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
	 ИЛИ ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		НоваяГруппировка = ЭлементСтруктуры.Структура.Добавить();
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных")
			ИЛИ ТипЗнч(ЭлементСтруктуры) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
		НоваяГруппировка = ЭлементСтруктуры.Добавить();
	Иначе
		НоваяГруппировка = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	
	НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	Если Поле <> Неопределено Тогда
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Поле;
	КонецЕсли;
	Возврат НоваяГруппировка;
	
КонецФункции

// Функция удаляет из компоновщика настроек указанную в параметре группировку, если параметр не указан, удаляет все группировки
Функция УдалитьГруппировку(КомпоновщикНастроек, Знач Поле = Неопределено, Строки = Истина) Экспорт
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Элемент = КомпоновщикНастроек.Настройки.Структура[0];
	Если ТипЗнч(Элемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
		Если Строки И Элемент.Строки.Количество() > 0 Тогда
			Элемент = Элемент.Строки[0];
		ИначеЕсли Не Строки И Элемент.Колонки.Количество() > 0 Тогда
			Элемент = Элемент.Колонки[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Элемент) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		Если Строки И Элемент.Серии.Количество() > 0 Тогда
			Элемент = Элемент.Серии[0];
		ИначеЕсли Не Строки И Элемент.Точки.Количество() > 0 Тогда
			Элемент = Элемент.Точки[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если Поле = Неопределено Тогда
		КомпоновщикНастроек.Настройки.Структура.Очистить();
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	Пока Истина Цикл
		Если Элемент.ПоляГруппировки.Элементы.Количество() > 0 
		   И Элемент.ПоляГруппировки.Элементы[0].Поле = Поле Тогда
			Элемент.Родитель.Структура.Очистить();
			Прервать;
			Возврат Истина;
		ИначеЕсли Элемент.Структура.Количество() > 0 Тогда
			Элемент = Элемент.Структура[0];
		Иначе 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

// Возвращает массив элементов отбора или групп элементов отбора
Функция ПолучитьЭлементыОтбора(КомпоновщикНастроек, ТолькоГруппы = Ложь) Экспорт
	
	МассивПолей = Новый Массив;
	ДобавитьЭлементыОтбораВМассив(КомпоновщикНастроек.Настройки.Отбор.Элементы, МассивПолей, ТолькоГруппы);
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьЭлементыОтбораВМассив(Элементы, МассивПолей, ТолькоГруппы = Ложь)
	
	Для каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
			ДобавитьЭлементыОтбораВМассив(Элемент.Элементы, МассивПолей, ТолькоГруппы);
		Иначе
			Если Не ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив выбранных полей или групп выбранных полей
Функция ПолучитьВыбранныеПоля(ЭлементСтруктуры, ТолькоГруппы = Ложь) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") 
	 ИЛИ ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных")  Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	ДобавитьВыбранныеПоляВМассив(ВыбранныеПоля.Элементы, МассивПолей, ТолькоГруппы);
	Возврат МассивПолей;
	
КонецФункции

Процедура ДобавитьВыбранныеПоляВМассив(ЭлементСтруктуры, МассивПолей, ТолькоГруппы = Ложь)
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Для каждого Элемент Из ЭлементСтруктуры Цикл
		Если ТипЗнч(Элемент) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Если ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
			ДобавитьВыбранныеПоляВМассив(Элемент.Элементы, МассивПолей, ТолькоГруппы);
		Иначе
			Если Не ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Функция проверяет, могут ли в отчете выводиться детальные поля
Функция ВСтруктуреМогутБытьДетальныеПоля(КомпоновщикНастроек) Экспорт
	
	ПоляГруппировки = ПолучитьМассивПолейГруппировки(КомпоновщикНастроек);
	ВыбранныеПоля = ПолучитьВыбранныеПоля(КомпоновщикНастроек);
	МогутБытьДетальныеПоля = Ложь;
	Для каждого ВыбранноеПоле Из ВыбранныеПоля Цикл
		ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(ВыбранноеПоле.Поле, КомпоновщикНастроек);
		Если ДоступноеПоле = Неопределено ИЛИ ДоступноеПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ВыбранноеПоле.Использование Тогда
			Продолжить;
		КонецЕсли;
		ЕстьРодитель = Ложь;
		Для каждого ПолеГруппировки Из ПоляГруппировки Цикл
			Если Не ПолеГруппировки.Использование ИЛИ ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("") Тогда
				Продолжить;
			КонецЕсли;
			Если ПолеЯвляетсяРодителемДругого(КомпоновщикНастроек, ПолеГруппировки.Поле, ВыбранноеПоле.Поле) Тогда
				ЕстьРодитель = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Не ЕстьРодитель Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
		
КонецФункции

Функция ПолеЯвляетсяРодителемДругого(КомпоновщикНастроек, Поле1, Поле2)
	
	ДоступноеПоле1 = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Поле1, КомпоновщикНастроек);
	ДоступноеПоле2 = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(Поле2, КомпоновщикНастроек);
	Если ДоступноеПоле1 = ДоступноеПоле2 Тогда
		Возврат Истина;
	КонецЕсли;
	Пока ДоступноеПоле2.Родитель <> Неопределено Цикл
		ДоступноеПоле2 = ДоступноеПоле2.Родитель;
		Если ДоступноеПоле1 = ДоступноеПоле2 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции

// Добавляет в набор данных поле набора данных
Функция ДобавитьПолеНабораДанных(НаборДанных, Поле, Заголовок, ПутьКДанным = Неопределено) Экспорт
	
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = Поле;
	КонецЕсли;
	
	ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанных.Поле        = Поле;
	ПолеНабораДанных.Заголовок   = Заголовок;
	ПолеНабораДанных.ПутьКДанным = ПутьКДанным;
	Возврат ПолеНабораДанных;
	
КонецФункции

// Добавляет в набор данных поля периода Период секунда, минута, час ....
Функция ДобавитьПоляПериодаВНаборДанных(НаборДанных) Экспорт
	
	СписокПериодов = Новый СписокЗначений;
	СписокПериодов.Добавить("ПериодСекунда",   "Период секунда");
	СписокПериодов.Добавить("ПериодМинута",    "Период минута");
	СписокПериодов.Добавить("ПериодЧас",       "Период час");
	СписокПериодов.Добавить("ПериодДень",      "Период день");
	СписокПериодов.Добавить("ПериодНеделя",    "Период неделя");
	СписокПериодов.Добавить("ПериодДекада",    "Период декада");
	СписокПериодов.Добавить("ПериодМесяц",     "Период месяц");
	СписокПериодов.Добавить("ПериодКвартал",   "Период квартал");
	СписокПериодов.Добавить("ПериодПолугодие", "Период полугодие");
	СписокПериодов.Добавить("ПериодГод",       "Период год");
	
	ИмяПапки = "Периоды";
	СписокПолейНабораДанных = Новый СписокЗначений;
	ПапкаПолейНабораДанных = НаборДанных.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
	ПапкаПолейНабораДанных.Заголовок   = ИмяПапки;
	ПапкаПолейНабораДанных.ПутьКДанным = ИмяПапки;
	
	Для каждого Период Из СписокПериодов Цикл
		ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле        = Период.Значение;
		ПолеНабораДанных.Заголовок   = Период.Представление;
		ПолеНабораДанных.ПутьКДанным = ИмяПапки + "." + Период.Значение;
		СписокПолейНабораДанных.Добавить(ПолеНабораДанных);
	КонецЦикла;
	
	Возврат СписокПолейНабораДанных;
	
КонецФункции

// Функция добавляет поле итога в схему компоновки данных. Если параметр Выражение не указан, используется Сумма(ПутьКДанным)
Функция ДобавитьПолеИтога(СхемаКомпоновкиДанных, ПутьКДанным, Выражение = Неопределено) Экспорт
	
	Если Выражение = Неопределено Тогда
		Выражение = "Сумма(" + ПутьКДанным + ")";
	КонецЕсли;
	
	ПолеИтога = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = ПутьКДанным;
	ПолеИтога.Выражение = Выражение;
	Возврат ПолеИтога;
	
КонецФункции

// Функция добавляет выбранное поле в набор выбранных полей
Функция ДобавитьВыбранноеПоле(ЭлементСтруктуры, Знач Поле, Заголовок = Неопределено) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	ВыбранноеПоле = ВыбранныеПоля.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Поле;
	Если Заголовок <> Неопределено Тогда
		ВыбранноеПоле.Заголовок = Заголовок;
	КонецЕсли;
	Возврат ВыбранноеПоле;
	
КонецФункции

// Функция добавляет в схему компоновки источник данных с типом "Local"
Функция ДобавитьЛокальныйИсточникДанных(СхемаКомпоновкиДанных) Экспорт
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	Возврат ИсточникДанных;
	
КонецФункции

// Функция добавляет набор данных - запрос в указанную в параметре коллекцию наборов данных
Функция ДобавитьНаборДанныхЗапрос(НаборыДанных, ИсточникДанных, ИмяНабораДанных = "НаборДанных1") Экспорт
	
	НаборДанных = НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = ИмяНабораДанных;
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	Возврат НаборДанных;
	
КонецФункции

// Функция добавляет набор данных - объединение в указанную в параметре коллекцию наборов данных
Функция ДобавитьНаборДанныхОбъединение(НаборыДанных, ИсточникДанных, ИмяНабораДанных = "НаборДанных1") Экспорт
	
	НаборДанных = НаборыДанных.Добавить(Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных"));
	НаборДанных.Имя = ИмяНабораДанных;
	Возврат НаборДанных;
	
КонецФункции

Процедура ЗаполнитьПолеНабораДанныхОстаток(ПолеНабораДанных, ГруппаОстатка) Экспорт
	
	ПутьКДанным = ПолеНабораДанных.ПутьКДанным;
	
	Если Найти(ПутьКДанным, "НачальныйОстаток") > 0 ИЛИ Найти(ПутьКДанным, "КонечныйОстаток") > 0 Тогда
		ПолеНабораДанных.Роль.Остаток = Истина;
		ПолеНабораДанных.Роль.ГруппаОстатка = ГруппаОстатка;
		Если ВРег(Прав(ПутьКДанным, 2)) = "ДТ" Тогда
			ПолеНабораДанных.Роль.ТипБухгалтерскогоОстатка = ТипБухгалтерскогоОстаткаКомпоновкиДанных.Дебет
		ИначеЕсли ВРег(Прав(ПутьКДанным, 2)) = "КТ" Тогда
			ПолеНабораДанных.Роль.ТипБухгалтерскогоОстатка = ТипБухгалтерскогоОстаткаКомпоновкиДанных.Кредит
		Иначе
			ПолеНабораДанных.Роль.ТипБухгалтерскогоОстатка = ТипБухгалтерскогоОстаткаКомпоновкиДанных.Нет
		КонецЕсли;
		Если Найти(ПутьКДанным, "НачальныйОстаток") > 0 Тогда
			ПолеНабораДанных.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.НачальныйОстаток;
		ИначеЕсли Найти(ПутьКДанным, "КонечныйОстаток") > 0 Тогда
			ПолеНабораДанных.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.КонечныйОстаток;
		Иначе
			ПолеНабораДанных.Роль.ТипОстатка = ТипОстаткаКомпоновкиДанных.Нет;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПоказатьСхему(СхемаКомпоновкиДанных, КомпоновщикНастроек, Форма) Экспорт
	
	СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.ПолучитьНастройки());
	Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
	Конструктор.Редактировать(Форма);
	
	Возврат Истина;
	
КонецФункции

// Добавляет в макеты макета компоновки расшифровку для ресурсов
Процедура ДополнитьМакетыМакетаКомпоновкиРасшифровкойРесурсов(МакетКомпоновки, КомпоновщикНастроек) Экспорт
	
	Для каждого Макет Из МакетКомпоновки.Макеты Цикл
		// Получим массив параметров расшифровки
		МассивВыраженийПолей = Новый Массив;
		Для каждого Параметр Из Макет.Параметры Цикл
			Если ТипЗнч(Параметр) <> Тип("ПараметрОбластиРасшифровкаКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Для каждого ВыражениеПоля Из Параметр.ВыраженияПолей Цикл
				Если Не ЭтоВыражениеПоляПараметраРасшифровкиРесурс(ВыражениеПоля, КомпоновщикНастроек) Тогда
					МассивВыраженийПолей.Добавить(ВыражениеПоля);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		// Установим параметры расшифровки у ресурсов
		Для каждого Параметр Из Макет.Параметры Цикл
			Если ТипЗнч(Параметр) <> Тип("ПараметрОбластиРасшифровкаКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Ресурс = Ложь;
			Для каждого ВыражениеПоля Из Параметр.ВыраженияПолей Цикл
				Если ЭтоВыражениеПоляПараметраРасшифровкиРесурс(ВыражениеПоля, КомпоновщикНастроек) Тогда
					Ресурс = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не Ресурс Тогда
				Продолжить;
			КонецЕсли;
			Для каждого ВыражениеПоля Из МассивВыраженийПолей Цикл
				Если Параметр.ВыраженияПолей.Найти(ВыражениеПоля.Поле) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НовоеВыражениеПоля = Параметр.ВыраженияПолей.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеВыражениеПоля, ВыражениеПоля);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоВыражениеПоляПараметраРасшифровкиРесурс(ВыражениеПоля, КомпоновщикНастроек)
	
	ДоступныеРесурсы = ПолучитьСписокДоступныхРесурсов(КомпоновщикНастроек);
	ДостуныйРесурс = ДоступныеРесурсы.НайтиПоЗначению(Новый ПолеКомпоновкиДанных(ВыражениеПоля.Поле));
	Возврат ДостуныйРесурс <> Неопределено;
	
КонецФункции

Процедура ОбработкаИзмененияТиповогоОтчетаНаФормеОтчета(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если ОтчетОбъект.СохраненнаяНастройка <> Неопределено 
	   И ОтчетОбъект.СохраненнаяНастройка.СохранятьАвтоматически Тогда
		ФормаОтчета.СохранитьНастройку();
	КонецЕсли;
	
КонецПроцедуры

Функция СериализоватьОбъект(Объект) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект);
	СтрокаXML = ЗаписьXML.Закрыть();
	Возврат СтрокаXML;
	
КонецФункции

Процедура УдалитьДублиОтбора(КомпоновщикНастроек) Экспорт
	
	Отбор = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Количество = Отбор.Количество();
	Для Индекс = 1 По Количество Цикл
		ЭлементСКонца = Отбор[Количество - Индекс];
		Для ИндексВнутр = 0 По Количество - Индекс - 1 Цикл
			ЭлементВнутр = Отбор[ИндексВнутр];
			Если ТипЗнч(ЭлементВнутр) = Тип("ЭлементОтбораКомпоновкиДанных")
			   И ТипЗнч(ЭлементСКонца) = Тип("ЭлементОтбораКомпоновкиДанных")
			   И ЭлементВнутр.ЛевоеЗначение = ЭлементСКонца.ЛевоеЗначение
			   И ЭлементВнутр.ВидСравнения = ЭлементСКонца.ВидСравнения
			   И ЭлементВнутр.Использование = ЭлементСКонца.Использование
			   И ПравыеЗначенияОтборовСовпадают(ЭлементВнутр.ПравоеЗначение, ЭлементСКонца.ПравоеЗначение)
		       И ЭлементВнутр.Применение = ЭлементСКонца.Применение Тогда
				Отбор.Удалить(ЭлементСКонца);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	      	
КонецПроцедуры

Функция ПравыеЗначенияОтборовСовпадают(Значение1, Значение2)
	
	Если ТипЗнч(Значение1) <> ТипЗнч(Значение2) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Значение1) <> Тип("СписокЗначений") Тогда
		Возврат Значение1 = Значение2;
 	ИначеЕсли ТипЗнч(Значение1) = Тип("СписокЗначений") Тогда
		Если Значение1.Количество() <> Значение2.Количество() Тогда
			Возврат Ложь;
		КонецЕсли;
		Совпадают = Истина;
		Для каждого Элемент1 Из Значение1 Цикл
			Если Значение2.НайтиПоЗначению(Элемент1.Значение) = Неопределено Тогда
				Совпадают = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для каждого Элемент2 Из Значение2 Цикл
			Если Значение1.НайтиПоЗначению(Элемент2.Значение) = Неопределено Тогда
				Совпадают = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат Совпадают;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////////////////////
// ДИНАМИЧЕСКИЕ ОТБОРЫ

Процедура НарисоватьСтандартныйПериод(ОтчетОбъект, ФормаОтчета, ЗначенияНастроек, Параметры)
	
	Если Не Параметры.ДеревоНастроекСтандартныхСтраниц.Строки.Найти("Период").Использование Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	
	ЦветФонаКнопки = Новый Цвет(246, 244, 236);
	// Закладка Стандартный Период
	ЗначениеПараметраНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	ЗначениеПараметраКонецПериода  = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ЗначениеПараметраПериод        = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));

	// Стандартный период
	Если ЗначениеПараметраНачалоПериода <> Неопределено
	   И ЗначениеПараметраКонецПериода <> Неопределено Тогда
		//НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Вставить(0, "ДинамическийОтборСтандартныйПериод", "Период");
		НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Добавить("ДинамическийОтборСтандартныйПериод", "Период");
		Количество = ЭлементыФормы.ПанельЗакладок.Страницы.Количество();
		ЭлементыФормы.ПанельЗакладок.Страницы.Сдвинуть(НоваяСтраница, -(Количество-1));
		НоваяСтраница.Раскрыта = Истина;
		
		ЭлементыФормы.ПанельЗакладок.ТекущаяСтраница = НоваяСтраница;
		Верх = 6;
		
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтборСтандартныйПериод",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Данные = "СтандартныйПериод";
		НовыйЭлемент.Видимость = Ложь;
		
		// Поле выбора Стандартный период
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВыбора"), "ДинамическийОтборСтандартныйПериодПользователя",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = 292;
		НовыйЭлемент.ТипЗначения = Новый ОписаниеТипов("Строка");
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		СписокВыбора = ПолучитьСписокВыбораСтандартногоПериодаПользователя(Параметры);;
		НовыйЭлемент.СписокВыбора = СписокВыбора;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиСтандартныйПериодПользователяПриИзменении;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", Действие);
		УстановитьПравуюПривязку(НовыйЭлемент, ЭлементыФормы.ПанельЗакладок);
		
		// Восстанавливаем значение
		Если ЗначенияНастроек.Свойство("СтандартныйПериод") Тогда
			СтандартныйПериод = ЗначенияНастроек.СтандартныйПериод;
			Если СписокВыбора.НайтиПоЗначению(СтандартныйПериод.Вариант) <> Неопределено Тогда
				НовыйЭлемент.Значение = СтандартныйПериод.Вариант;
				ФормаОтчета.СтандартныйПериод = СтандартныйПериод;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьДопустимоеЗначениеСпискаВыбора(НовыйЭлемент, ФормаОтчета.СтандартныйПериод);
		
		Верх = Верх + НовыйЭлемент.Высота + 6;
		
		// Надпись с
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтборНадписьС",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.Заголовок = "с:";
		
		// Дата с
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтборДатаНачала",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 20;
		НовыйЭлемент.Ширина = 80;
		НовыйЭлемент.ТипЗначения = Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Дата));
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		НовыйЭлемент.Данные = "СтандартныйПериод.ДатаНачала";
		НовыйЭлемент.Доступность = СписокВыбора.НайтиПоЗначению(ВариантСтандартногоПериода.ПроизвольныйПериод) <> Неопределено;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиДатаСтандартногоПериодаПриИзменении;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", Действие);
		
		// Надпись по
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтборНадписьПо",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 110;
		НовыйЭлемент.Ширина = 6;
		НовыйЭлемент.Заголовок = "по:";
		
		// Дата по
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтборДатаОкончания",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 128;
		НовыйЭлемент.Ширина = 80;
		НовыйЭлемент.ТипЗначения = Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Дата));
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		НовыйЭлемент.Данные = "СтандартныйПериод.ДатаОкончания";
		НовыйЭлемент.Доступность = СписокВыбора.НайтиПоЗначению(ВариантСтандартногоПериода.ПроизвольныйПериод) <> Неопределено;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиДатаСтандартногоПериодаПриИзменении;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", Действие);
		
	КонецЕсли;
	
	// Стандартная дата начала
	Если ЗначениеПараметраПериод <> Неопределено Тогда
		//НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Вставить(0, "ДинамическийОтборСтандартнаяДатаНачала", "Период");
		НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Добавить("ДинамическийОтборСтандартнаяДатаНачала", "Период");
		Количество = ЭлементыФормы.ПанельЗакладок.Страницы.Количество();
		ЭлементыФормы.ПанельЗакладок.Страницы.Сдвинуть(НоваяСтраница, -(Количество-1));
		НоваяСтраница.Раскрыта = Истина;
		
		ЭлементыФормы.ПанельЗакладок.ТекущаяСтраница = НоваяСтраница;
		
		Верх = 6;
		
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтборСтандартнаяДатаНачала",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Данные = "СтандартнаяДатаНачала";
		НовыйЭлемент.Видимость = Ложь;
		
		// Поле выбора Стандартная дата начала
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВыбора"), "ДинамическийОтборСтандартнаяДатаНачалаПользователя",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = 292;
		НовыйЭлемент.ТипЗначения = Новый ОписаниеТипов("Строка");
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		СписокВыбора = ПолучитьСписокВыбораСтандартнойДатыНачалаПользователя(Параметры);
		НовыйЭлемент.СписокВыбора = СписокВыбора;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиСтандартнаяДатаНачалаПользователяПриИзменении;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", Действие);
		УстановитьПравуюПривязку(НовыйЭлемент, ЭлементыФормы.ПанельЗакладок);
		
		// Восстанавливаем значение варианта стандартной даты начала
		Если ЗначенияНастроек.Свойство("СтандартнаяДатаНачала") Тогда
			СтандартнаяДатаНачала = ЗначенияНастроек.СтандартнаяДатаНачала;
			Если СписокВыбора.НайтиПоЗначению(СтандартнаяДатаНачала.Вариант) <> Неопределено Тогда
				НовыйЭлемент.Значение = СтандартнаяДатаНачала.Вариант;
				ФормаОтчета.СтандартнаяДатаНачала = СтандартнаяДатаНачала;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьДопустимоеЗначениеСпискаВыбора(НовыйЭлемент, ФормаОтчета.СтандартнаяДатаНачала);
		
		Верх = Верх + 19 + 6;
		
		// Надпись дата
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтборНадписьДата",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх + 3;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = 26;
		НовыйЭлемент.Заголовок = "дата:";
		
		// Поле ввода даты
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтборДата",, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 40;
		НовыйЭлемент.Ширина = 80;
		НовыйЭлемент.ТипЗначения = Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.Дата));
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		НовыйЭлемент.Данные = "СтандартнаяДатаНачала.Дата";
		НовыйЭлемент.Доступность = СписокВыбора.НайтиПоЗначению(ВариантСтандартнойДатыНачала.ПроизвольнаяДата) <> Неопределено;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиДатаСтандартнойДатыНачалаПриИзменении;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", Действие);
		
		// Восстанавливаем значение
		Если ЗначенияНастроек.Свойство("СтандартнаяДатаНачала") Тогда
			СтандартнаяДатаНачала = ЗначенияНастроек.СтандартнаяДатаНачала;
			НовыйЭлемент.Значение = СтандартнаяДатаНачала.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДопустимоеЗначениеСпискаВыбора(Элемент, Значение = Неопределено)
	
	Если Значение = Неопределено Тогда
		Значение = Элемент.Значение;
	КонецЕсли;
	
	НайденноеЗначение = Элемент.СписокВыбора.НайтиПоЗначению(Значение);
	Если НайденноеЗначение = Неопределено И Элемент.СписокВыбора.Количество() > 0 Тогда
		Значение.Вариант = Элемент.СписокВыбора[0].Значение;
		Элемент.Значение = Элемент.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура НарисоватьДинамическийОтборФлажокЗначение(ФормаОтчета, Индекс, Верх, ЦветФонаКнопки, СтрокаОтбора, ЭлементДинамическогоОтбора, ДоступноеПоле)
	
	
	ЭлементыФормы        = ФормаОтчета.ЭлементыФормы;
	ШиринаПанелиЗакладки = ЭлементыФормы.ПанельЗакладок.Ширина;
	
	Если СтрокаОтбора.ВидОтбора = "Флажок" ИЛИ СтрокаОтбора.ВидОтбора = "ФлажокЗначение" Тогда
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Флажок"), "ДинамическийОтбор" + Индекс + "Флажок", Истина, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = 143 * ?(СтрокаОтбора.ВидОтбора = "ФлажокЗначение", 1, 2);
		НовыйЭлемент.Заголовок = СтрокаОтбора.Представление;
		НовыйЭлемент.Значение = СтрокаОтбора.Использование;
		//Получить из значений
		Если ЭлементДинамическогоОтбора <> Неопределено 
		   И ТипЗнч(ЭлементДинамическогоОтбора.Использование) = Тип("Булево") Тогда
			// Восстановим значение
			НовыйЭлемент.Значение = ЭлементДинамическогоОтбора.Использование;
		Иначе
			// Установим значение по умолчанию
			НовыйЭлемент.Значение = СтрокаОтбора.Использование;
		КонецЕсли;
		Если СтрокаОтбора.ВидОтбора = "Флажок" Тогда
			УстановитьПравуюПривязку(НовыйЭлемент, ЭлементыФормы.ПанельЗакладок);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаОтбора.ВидОтбора = "Значение" Тогда
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтбор" + Индекс + "Надпись", Истина, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 6;
		НовыйЭлемент.Ширина = ШиринаПанелиЗакладки - 19;
		НовыйЭлемент.Заголовок = СтрокаОтбора.Представление;
	КонецЕсли;

	Если СтрокаОтбора.ВидОтбора = "Значение" ИЛИ СтрокаОтбора.ВидОтбора = "ФлажокЗначение" Тогда
		НовыйЭлемент = ЭлементыФормы.Добавить(Тип("ПолеВвода"), "ДинамическийОтбор" + Индекс + "ПолеВвода", Истина, ЭлементыФормы.ПанельЗакладок);
		НовыйЭлемент.Верх = Верх;
		НовыйЭлемент.Лево = 153;
		НовыйЭлемент.Ширина = ШиринаПанелиЗакладки - 153 - 9;
		НовыйЭлемент.ТипЗначения = ДоступноеПоле.Тип;
		НовыйЭлемент.ЦветФонаКнопки = ЦветФонаКнопки;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиИзменениеЗначенияДинамическогоОтбора);
		УстановитьПравуюПривязку(НовыйЭлемент, ЭлементыФормы.ПанельЗакладок);
		//Получить из значений
		Если ЭлементДинамическогоОтбора <> Неопределено  Тогда
			// Восстановим значение
			НовыйЭлемент.Значение = ЭлементДинамическогоОтбора.Значение;
		Иначе
			// Установим значение по умолчанию
			НовыйЭлемент.Значение = СтрокаОтбора.Значение;
		КонецЕсли;
	КонецЕсли;
	Верх = Верх + 19 + 6;
КонецПроцедуры

Процедура НарисоватьДинамическийОтборСписок(ФормаОтчета, Индекс, Верх, ЦветФонаКнопки, СтрокаОтбора, ЭлементДинамическогоОтбора, ДоступноеПоле)
	
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	
	ШиринаПанелиЗакладки = ЭлементыФормы.ПанельЗакладок.Ширина;
	
	// Добавление Поля выбора вида сравнения
	ЭлементВидСравнения        = ЭлементыФормы.Добавить(Тип("ПолеВыбора"), "ДинамическийОтбор" + Индекс + "ВидСравения", Истина, ЭлементыФормы.ПанельЗакладок);
	//ЭлементВидСравнения.ИзменяетДанные = Истина;
	ЭлементВидСравнения.Лево   = 6;
	ЭлементВидСравнения.Верх   = Верх;
	ЭлементВидСравнения.Ширина = 125;//(ШиринаПанелиЗакладки - 6 - 179);
	ЭлементВидСравнения.Высота = 19;
	ЭлементВидСравнения.ЦветФонаКнопки = ЦветФонаКнопки;
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("", "Не отбирать");
	СписокВыбора.Добавить("Выбранные", "Только выбранные");
	Если СтрокаОтбора.ДоступенВариантИсключить Тогда
		СписокВыбора.Добавить("Исключая", "Кроме выбранных");
	КонецЕсли;
	ЭлементВидСравнения.СписокВыбора = СписокВыбора;
	ЭлементВидСравнения.Значение = СписокВыбора[0].Значение;
	Если ЭлементДинамическогоОтбора <> Неопределено
	   И ТипЗнч(ЭлементДинамическогоОтбора.ВидСравнения) = Тип("Строка")
	   И СписокВыбора.НайтиПоЗначению(ЭлементДинамическогоОтбора.ВидСравнения) <> Неопределено Тогда
	 	// Восстановим значение
		ЭлементВидСравнения.Значение = ЭлементДинамическогоОтбора.ВидСравнения;
	Иначе
		// Возьмем значение по умолчанию
		Если СтрокаОтбора.Использование Тогда
			ЭлементВидСравнения.Значение = "Выбранные";
		КонецЕсли;
	КонецЕсли;
	
	// Сохранить загрузить список
	Если СтрокаОтбора.СохранятьСписок Тогда
		// Добавление надписи Сохранить список
		ЭлементНадпись        = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтбор" + Индекс + "СохранитьСписок", Истина, ЭлементыФормы.ПанельЗакладок);
		ЭлементНадпись.Лево   = ШиринаПанелиЗакладки - 125;
		ЭлементНадпись.Верх   = Верх - 5;
		ЭлементНадпись.Ширина = 30;
		ЭлементНадпись.Высота = 30;
		ЭлементНадпись.Заголовок  = "";
		ЭлементНадпись.Картинка   = БиблиотекаКартинок.СохранитьСписок;
		ЭлементНадпись.ГиперСсылка = Истина;
		ЭлементНадпись.Подсказка = "Сохранить этот список";
		ЭлементНадпись.УстановитьДействие("Нажатие", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиСохранитьСписок);
		УстановитьПравуюПривязку(ЭлементНадпись, ЭлементыФормы.ПанельЗакладок);
		УстановитьПравуюПривязкуПолностью(ЭлементНадпись, ЭлементыФормы.ПанельЗакладок);
		// Добавление надписи Загрузить список
		ЭлементНадпись        = ЭлементыФормы.Добавить(Тип("Надпись"), "ДинамическийОтбор" + Индекс + "ЗагрузитьСписок", Истина, ЭлементыФормы.ПанельЗакладок);
		ЭлементНадпись.Лево   = ШиринаПанелиЗакладки - 105;
		ЭлементНадпись.Верх   = Верх - 5;
		ЭлементНадпись.Ширина = 30;
		ЭлементНадпись.Высота = 30;
		ЭлементНадпись.Заголовок  = "";
		ЭлементНадпись.Картинка   = БиблиотекаКартинок.ЗагрузитьСписок;
		ЭлементНадпись.Подсказка = "Загрузить сохраненный список";
		ЭлементНадпись.ГиперСсылка = Истина;
		ЭлементНадпись.УстановитьДействие("Нажатие", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиЗагрузитьСписок);
		УстановитьПравуюПривязку(ЭлементНадпись, ЭлементыФормы.ПанельЗакладок);
		УстановитьПравуюПривязкуПолностью(ЭлементНадпись, ЭлементыФормы.ПанельЗакладок);
	КонецЕсли;
	
		
	// Добавление Кнопки Подбор
	КнопкаПодбор = ЭлементыФормы.Добавить(Тип("Кнопка"), "ДинамическийОтбор" + Индекс + "КнопкаПодбор", Истина, ЭлементыФормы.ПанельЗакладок);
	КнопкаПодбор.Лево   = ШиринаПанелиЗакладки - 85;
	КнопкаПодбор.Верх   = Верх;
	КнопкаПодбор.Ширина = 75;
	КнопкаПодбор.Высота = 19;
	КнопкаПодбор.ЦветФонаКнопки = ЦветФонаКнопки;
	Верх = Верх + 19 + 6;
	Если ДоступноеПоле <> Неопределено И ДоступноеПоле.Тип.Типы().Количество() > 1 тогда
		КнопкаПодбор.Заголовок = "Подбор...";
	Иначе
		КнопкаПодбор.Заголовок = "Подбор";
	КонецЕсли;
	КнопкаПодбор.УстановитьДействие("Нажатие", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиКнопкаПодборНажатие);
	УстановитьПравуюПривязкуПолностью(КнопкаПодбор, ЭлементыФормы.ПанельЗакладок);
	
	// Добавление Табличного поля для списка
	ЭлементТабличноеПоле = ЭлементыФормы.Добавить(Тип("ТабличноеПоле"), "ДинамическийОтбор" + Индекс + "ТабличноеПоле", Истина, ЭлементыФормы.ПанельЗакладок);
	ЭлементТабличноеПоле.Лево           = 6;
	ЭлементТабличноеПоле.Верх           = Верх;
	ЭлементТабличноеПоле.Ширина         = ШиринаПанелиЗакладки - 15;
	ЭлементТабличноеПоле.Высота         = 79 * ?(СтрокаОтбора.ВидОтбора = "Список", 1, 2);
	Верх = Верх + ЭлементТабличноеПоле.Высота + 6;
	ЭлементТабличноеПоле.ТолькоПросмотр = Ложь;
	ЭлементТабличноеПоле.Шапка          = Ложь;
	ЭлементТабличноеПоле.Значение       = Новый ТаблицаЗначений;
	УстановитьПравуюПривязку(ЭлементТабличноеПоле, ЭлементыФормы.ПанельЗакладок);
	
	ЭлементТабличноеПоле.Значение.Колонки.Добавить("Значение", ДоступноеПоле.Тип);
	НоваяКолонка                             = ЭлементТабличноеПоле.Колонки.Добавить("Значение", "");
	НоваяКолонка.Данные                      = "Значение";
	ЭлементТабличноеПоле.ГоризонтальныеЛинии = Ложь;
	//Получить из значений
	Если ЭлементДинамическогоОтбора <> Неопределено 
	   И ТипЗнч(ЭлементДинамическогоОтбора.Значение) = Тип("СписокЗначений") Тогда
	    // Восстановим значение списка отбора
		Для каждого ЭлементСписка Из ЭлементДинамическогоОтбора.Значение Цикл
			НоваяСтрока = ЭлементТабличноеПоле.Значение.Добавить();
			НоваяСтрока.Значение = ЭлементСписка.Значение;
		КонецЦикла;
	Иначе
		// Проверим есть ли значение по умолчанию
		Если СтрокаОтбора.Значение.Количество() > 0 Тогда
			Для каждого ЭлементСписка Из СтрокаОтбора.Значение Цикл
				НоваяСтрока = ЭлементТабличноеПоле.Значение.Добавить();
				НоваяСтрока.Значение = ЭлементСписка.Значение;
				Если Не ЗначениеЗаполнено(НоваяСтрока.Значение) Тогда
					ЭлементТабличноеПоле.Значение.Удалить(НоваяСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементТабличноеПоле.УстановитьДействие("ПриОкончанииРедактирования", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиОкончаниеРедактированиеТабличногоПоля);
	ЭлементТабличноеПоле.УстановитьДействие("ПослеУдаления", ФормаОтчета.ДействияЭлементовФормы.ДействияПанелиУдалениеСтрокиТабличногоПоля);
	
КонецПроцедуры

Процедура УстановитьПравуюПривязку(Элемент, Панель) Экспорт
	
	Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Право, Панель, ГраницаЭлементаУправления.Право);
	
КонецПроцедуры

Процедура УстановитьПравуюПривязкуПолностью(Элемент, Панель)
	
	Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Право, Панель, ГраницаЭлементаУправления.Право);
	Элемент.УстановитьПривязку(ГраницаЭлементаУправления.Лево, Панель, ГраницаЭлементаУправления.Право);
	
КонецПроцедуры

// Заполняет отбор компоновщика по отбору построителя
Функция ПолучитьТаблицуДоступныхВариантов(НастраиваемыйОбъект, Пользователь = Неопределено, СПомеченнымиНаУдаление = Ложь) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Разрешенные
	|	СохраненныеНастройкиПользователи.Ссылка,
	|	СохраненныеНастройкиПользователи.Ссылка.Наименование КАК Наименование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СохраненныеНастройкиПользователи.ПравоИзменения
	|					ИЛИ &ПолныеПрава
	|					ИЛИ &ПолныеПраваБезЭкономики
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ПравоИзменения,
	|	СохраненныеНастройкиПользователи.Ссылка.Описание
	|ИЗ
	|	Справочник.СохраненныеНастройки.Пользователи КАК СохраненныеНастройкиПользователи
	|ГДЕ
	|	СохраненныеНастройкиПользователи.Ссылка.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|	И (СохраненныеНастройкиПользователи.Пользователь.Ссылка = &Пользователь
	|			ИЛИ СохраненныеНастройкиПользователи.Пользователь.Ссылка В
	|				(ВЫБРАТЬ
	|					ГруппыПользователейПользователиГруппы.Ссылка
	|				ИЗ
	|					Справочник.ГруппыПользователей.ПользователиГруппы КАК ГруппыПользователейПользователиГруппы
	|				ГДЕ
	|					ГруппыПользователейПользователиГруппы.Пользователь.Ссылка = &Пользователь)
	|			ИЛИ СохраненныеНастройкиПользователи.Пользователь.Ссылка = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи))
	|	И (&СПомеченнымиНаУдаление ИЛИ НЕ СохраненныеНастройкиПользователи.Ссылка.ПометкаУдаления)
	|	И (НЕ СохраненныеНастройкиПользователи.Ссылка.ЭтоГруппа)
	|	И СохраненныеНастройкиПользователи.Ссылка.ТипНастройки = &ТипНастройки
	|
	|СГРУППИРОВАТЬ ПО
	|	СохраненныеНастройкиПользователи.Ссылка,
	|	СохраненныеНастройкиПользователи.Ссылка.Наименование,
	|	СохраненныеНастройкиПользователи.Ссылка.Описание
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);
	Запрос.УстановитьПараметр("ТипНастройки", Перечисления.ТипыНастроек.НастройкиОтчета);
	Запрос.УстановитьПараметр("ПолныеПрава", РольДоступна("ПолныеПрава"));
	Запрос.УстановитьПараметр("ПолныеПраваБезЭкономики", РольДоступна("ПолныеПраваБезЭкономики")); //О.Т. Аверсон 17.03.2017 № 335
	Запрос.УстановитьПараметр("СПомеченнымиНаУдаление", СПомеченнымиНаУдаление);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСписокДоступныхВариантов(НастраиваемыйОбъект, Пользователь = Неопределено, СПомеченнымиНаУдаление = Ложь) Экспорт
	
	СписокНастроек = Новый СписокЗначений;
	
	ТаблицаДоступныхНастроек = ПолучитьТаблицуДоступныхВариантов(НастраиваемыйОбъект, Пользователь, СПомеченнымиНаУдаление);
	Для каждого Строка Из ТаблицаДоступныхНастроек Цикл
		СписокНастроек.Добавить(Строка.Ссылка, Строка.Наименование, Строка.ПравоИзменения);
	КонецЦикла;
	
	Возврат СписокНастроек;
	
КонецФункции
	
Функция НастройкиКомпоновщикаПростые(КомпоновщикНастроек) Экспорт
	
	Если КомпоновщикНастроек.Настройки.Структура.Количество() = 1 Тогда
		Если ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Возврат ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0]);
		ИначеЕсли ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Возврат ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0].Строки)
			      И ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0].Колонки)
				  И ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0]);
		ИначеЕсли ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) = Тип("ДиаграммаКомпоновкиДанных") Тогда
			Возврат ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0].Серии)
			      И ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0].Точки)
				  И ЭтоПростаяСтруктура(КомпоновщикНастроек.Настройки.Структура[0]);
		КонецЕсли;
	ИначеЕсли КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
				
	Возврат Ложь;
	
КонецФункции

Функция ЭтоПростаяСтруктура(Структура)
	
	// Количество структур везде должно быть 1
	// Таблица и Диаграмма могут быть только на верхнем уровне
	НастройкиПростые = Истина;
	Если ТипЗнч(Структура) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗнч(Структура) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных") Тогда
		Если Структура.Количество() > 1
		ИЛИ (Структура.Количество() = 1 И Не ЭтоПростаяСтруктура(Структура[0])) Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Структура) = Тип("ГруппировкаКомпоновкиДанных") 
		  ИЛИ ТипЗнч(Структура) = Тип("ГруппировкаТаблицыКомпоновкиДанных") 
		  ИЛИ ТипЗнч(Структура) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		Если Структура.Структура.Количество() > 1
		   ИЛИ (Структура.Структура.Количество() = 1 И Не ЭтоПростаяСтруктура(Структура.Структура[0])) Тогда
			Возврат Ложь;
		КонецЕсли;
		Если Структура.Выбор.Элементы.Количество() <> 1 ИЛИ ТипЗнч(Структура.Выбор.Элементы[0]) <> Тип("АвтоВыбранноеПолеКомпоновкиДанных")
		 ИЛИ Структура.Порядок.Элементы.Количество() <> 1 ИЛИ ТипЗнч(Структура.Порядок.Элементы[0]) <> Тип("АвтоЭлементПорядкаКомпоновкиДанных")
		 ИЛИ Структура.Отбор.Элементы.Количество() > 0
		 ИЛИ Структура.УсловноеОформление.Элементы.Количество() > 0
		 ИЛИ Структура.ПоляГруппировки.Элементы.Количество() > 1 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат ЭтоПростаяСтруктура(Структура.ПараметрыВывода);
	ИначеЕсли ТипЗнч(Структура) = Тип("ТаблицаКомпоновкиДанных") Тогда
		Если Структура.Выбор.Элементы.Количество() <> 0
		 ИЛИ Структура.УсловноеОформление.Элементы.Количество() > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат ЭтоПростаяСтруктура(Структура.ПараметрыВывода);
	ИначеЕсли ТипЗнч(Структура) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		Если Структура.Выбор.Элементы.Количество() <> 1 ИЛИ ТипЗнч(Структура.Выбор.Элементы[0]) <> Тип("АвтоВыбранноеПолеКомпоновкиДанных")
		 ИЛИ Структура.УсловноеОформление.Элементы.Количество() > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат ЭтоПростаяСтруктура(Структура.ПараметрыВывода);
	ИначеЕсли ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных")
		  ИЛИ ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных")
		  ИЛИ ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных")
		  ИЛИ ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаКомпоновкиДанных")
		  ИЛИ ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаТаблицыКомпоновкиДанных")
		  ИЛИ ТипЗнч(Структура) = Тип("ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных") Тогда
		  
		Для каждого Элемент Из Структура.Элементы Цикл
			Если Элемент.Использование Тогда
				Возврат Ложь;
			КонецЕсли;
			НастройкиПростые = ЭтоПростаяСтруктура(Элемент.ЗначенияВложенныхПараметров);
			Если Не НастройкиПростые Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Структура) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		Для каждого Элемент Из Структура Цикл
			Если Элемент.Использование Тогда
				Возврат Ложь;
			КонецЕсли;
			НастройкиПростые = ЭтоПростаяСтруктура(Элемент.ЗначенияВложенныхПараметров);
			Если Не НастройкиПростые Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Возврат Истина;

КонецФункции

Функция ПолучитьТаблицуСтандартныхПериодов()

	ТаблицаСтандартныхПериодов = Новый ТаблицаЗначений;
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Периодичность");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Время");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("СтандартныйПериод");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Представление");
	
	// Произвольный
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "", "ПроизвольныйПериод", ВариантСтандартногоПериода.ПроизвольныйПериод, "Произвольный период");
	// День
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "День", "Предыдущий",    ВариантСтандартногоПериода.Вчера, "Вчера");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "День", "Текущий",       ВариантСтандартногоПериода.Сегодня, " Сегодня");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "День", "Следующий",     ВариантСтандартногоПериода.Завтра, "  Завтра");
	// Неделя
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Неделя", "Предыдущий",  ВариантСтандартногоПериода.ПрошлаяНеделя, "Предыдущая неделя");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Неделя", "Текущий",     ВариантСтандартногоПериода.ЭтаНеделя, " Эта неделя");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Неделя", "Следующий",   ВариантСтандартногоПериода.СледующаяНеделя, " Следующая неделя");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Неделя", "СНачала",     ВариантСтандартногоПериода.СНачалаЭтойНедели, "С начала этой недели");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Неделя", "ДоКонца",     ВариантСтандартногоПериода.ДоКонцаЭтойНедели, "До конца этой недели");
	// Декада
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Декада", "Предыдущий",  ВариантСтандартногоПериода.ПрошлаяДекада, "Предыдущая декада");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Декада", "Текущий",     ВариантСтандартногоПериода.ЭтаДекада, " Эта декада");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Декада", "Следующий",   ВариантСтандартногоПериода.СледующаяДекада, "  Следующая декада");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Декада", "СНачала",     ВариантСтандартногоПериода.СНачалаЭтойДекады, "С начала этой декады");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Декада", "ДоКонца",     ВариантСтандартногоПериода.ДоКонцаЭтойДекады, "До конца этой декады");
	// Месяц
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Месяц", "Предыдущий",   ВариантСтандартногоПериода.ПрошлыйМесяц, "Предыдущий месяц");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Месяц", "Текущий",      ВариантСтандартногоПериода.ЭтотМесяц, " Этот месяц");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Месяц", "Следующий",    ВариантСтандартногоПериода.СледующийМесяц, "  Следующий месяц");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Месяц", "СНачала",      ВариантСтандартногоПериода.СНачалаЭтогоМесяца, "С начала этого месяца");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Месяц", "ДоКонца",      ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца, "До конца этого месяца");
	// Квартал
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Квартал", "Предыдущий", ВариантСтандартногоПериода.ПрошлыйКвартал, "Предыдущий квартал");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Квартал", "Текущий",    ВариантСтандартногоПериода.ЭтотКвартал, " Этот квартал");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Квартал", "Следующий",  ВариантСтандартногоПериода.СледующийКвартал, "  Следующий квартал");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Квартал", "СНачала",    ВариантСтандартногоПериода.СНачалаЭтогоКвартала, "С начала этого квартала");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Квартал", "ДоКонца",    ВариантСтандартногоПериода.ДоКонцаЭтогоКвартала, "До конца этого квартала");
	// Полугодие
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Полугодие", "Предыдущий", ВариантСтандартногоПериода.ПрошлоеПолугодие, "Предыдущее полугодие");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Полугодие", "Текущий",    ВариантСтандартногоПериода.ЭтоПолугодие, " Это полугодие");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Полугодие", "Следующий",  ВариантСтандартногоПериода.СледующееПолугодие, "  Следующее полугодие");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Полугодие", "СНачала",    ВариантСтандартногоПериода.СНачалаЭтогоПолугодия, "С начала этого полугодия");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Полугодие", "ДоКонца",    ВариантСтандартногоПериода.ДоКонцаЭтогоПолугодия, "До конца этого полугодия");
	// Год
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Год", "Предыдущий",     ВариантСтандартногоПериода.ПрошлыйГод, "Предыдущий год");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Год", "Текущий",        ВариантСтандартногоПериода.ЭтотГод, " Этот год");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Год", "Следующий",      ВариантСтандартногоПериода.СледующийГод, "  Следующий год");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Год", "СНачала",        ВариантСтандартногоПериода.СНачалаЭтогоГода, "С начала этого года");
	ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, "Год", "ДоКонца",        ВариантСтандартногоПериода.ДоКонцаЭтогоГода, "До конца этого года");
	Возврат ТаблицаСтандартныхПериодов;
	
КонецФункции

Функция ПолучитьТаблицуСтандартныхДатНачала()

	ТаблицаСтандартныхПериодов = Новый ТаблицаЗначений;
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Периодичность");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Время");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("СтандартнаяДатаНачала");
	ТаблицаСтандартныхПериодов.Колонки.Добавить("Представление");
	
	// Произвольная
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "", "ПроизвольнаяДата",  ВариантСтандартнойДатыНачала.ПроизвольнаяДата, "Произвольная дата");
	// День
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "День", "Предыдущий",    ВариантСтандартнойДатыНачала.НачалоПрошлогоДня, "Начало вчерашнего дня");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "День", "Текущий",       ВариантСтандартнойДатыНачала.НачалоЭтогоДня, " Начало сегодняшнего дня");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "День", "Следующий",     ВариантСтандартнойДатыНачала.НачалоСледующегоДня, "  Начало завтрашнего дня");
	// Неделя
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Неделя", "Предыдущий",  ВариантСтандартнойДатыНачала.НачалоПрошлойНедели, "Начало предыдущей недели");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Неделя", "Текущий",     ВариантСтандартнойДатыНачала.НачалоЭтойНедели, " Начало этой недели");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Неделя", "Следующий",   ВариантСтандартнойДатыНачала.НачалоСледующейНедели, "  Начало следующей недели");
	// Декада
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Декада", "Предыдущий",  ВариантСтандартнойДатыНачала.НачалоПрошлойДекады, "Начало предыдущей декады");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Декада", "Текущий",     ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца, " Начало этой декады");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Декада", "Следующий",   ВариантСтандартнойДатыНачала.НачалоСледующейДекады, "  Начало следующей декады");
	// Месяц
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Месяц", "Предыдущий",   ВариантСтандартнойДатыНачала.НачалоПрошлогоМесяца, "Начало предыдущего месяца");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Месяц", "Текущий",      ВариантСтандартнойДатыНачала.НачалоЭтогоМесяца, " Начало этого месяца");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Месяц", "Следующий",    ВариантСтандартнойДатыНачала.НачалоСледующегоМесяца, "  Начало следующего месяца");
	// Квартал
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Квартал", "Предыдущий", ВариантСтандартнойДатыНачала.НачалоПрошлогоКвартала, "Начало предыдущего квартала");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Квартал", "Текущий",    ВариантСтандартнойДатыНачала.НачалоЭтогоКвартала, " Начало этого квартала");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Квартал", "Следующий",  ВариантСтандартнойДатыНачала.НачалоСледующегоКвартала, "  Начало следующего квартала");
	// Полугодие
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Полугодие", "Предыдущий", ВариантСтандартнойДатыНачала.НачалоПрошлогоПолугодия, "Начало предыдущего полугодия");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Полугодие", "Текущий",    ВариантСтандартнойДатыНачала.НачалоЭтогоПолугодия, " Начало этого полугодия");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Полугодие", "Следующий",  ВариантСтандартнойДатыНачала.НачалоСледующегоПолугодия, "  Начало следующего полугодия");
	// Год
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Год", "Предыдущий",     ВариантСтандартнойДатыНачала.НачалоПрошлогоГода, "Начало предыдущего года");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Год", "Текущий",        ВариантСтандартнойДатыНачала.НачалоЭтогоГода, " Начало этого года");
	ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, "Год", "Следующий",      ВариантСтандартнойДатыНачала.НачалоСледующегоГода, "  Начало этого года");
	Возврат ТаблицаСтандартныхПериодов;
	
КонецФункции

Процедура ДобавитьСтрокуСтандартногоПериода(ТаблицаСтандартныхПериодов, Периодичность, Время, СтандартныйПериод, Представление)

	НоваяСтрока = ТаблицаСтандартныхПериодов.Добавить();
	НоваяСтрока.Периодичность = Периодичность;
	НоваяСтрока.Время = Время;
	НоваяСтрока.СтандартныйПериод = СтандартныйПериод;
	НоваяСтрока.Представление = Представление;
	
КонецПроцедуры

Процедура ДобавитьСтрокуСтандартнойДатыНачала(ТаблицаСтандартныхПериодов, Периодичность, Время, СтандартнаяДатаНачала, Представление)

	НоваяСтрока = ТаблицаСтандартныхПериодов.Добавить();
	НоваяСтрока.Периодичность = Периодичность;
	НоваяСтрока.Время = Время;
	НоваяСтрока.СтандартнаяДатаНачала = СтандартнаяДатаНачала;
	НоваяСтрока.Представление = Представление;
	
КонецПроцедуры

Функция ПолучитьСписокВыбораСтандартногоПериодаПользователя(Параметры)
	
	ТаблицаСтандартныхПериодов = ПолучитьТаблицуСтандартныхПериодов();
	ВспомогательныйПериод = Новый СтандартныйПериод;
	СписокВыбораПериодовПользователя = Новый СписокЗначений;
	
	Если Параметры.ПроизвольныйПериод Тогда
		СписокВыбораПериодовПользователя.Вставить(0, ВариантСтандартногоПериода.ПроизвольныйПериод, "Произвольный период");
	КонецЕсли;
	
	Для каждого ОтносительноеВремя Из Параметры.СписокДоступныхОтносительныхПериодов Цикл
		Если Не ОтносительноеВремя.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Для каждого Периодичность Из Параметры.ДоступныеПериодичности Цикл
			Если Не Периодичность.Использование Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Время", ОтносительноеВремя.Значение);
			СтруктураПоиска.Вставить("Периодичность", Периодичность.Периодичность);
			НайденныеСтроки = ТаблицаСтандартныхПериодов.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 1 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				Если  Периодичность.Периодичность = "Декада" 
				 ИЛИ Периодичность.Периодичность = "Неделя" 
				 ИЛИ ОтносительноеВремя.Значение = "СНачала" 
				 ИЛИ ОтносительноеВремя.Значение = "ДоКонца" Тогда
					Представление = ""
				Иначе
					ВспомогательныйПериод.Вариант = НайденнаяСтрока.СтандартныйПериод;
					Представление = " (" + ПредставлениеПериода(ВспомогательныйПериод.ДатаНачала, ВспомогательныйПериод.ДатаОкончания) + ")";
				КонецЕсли;
				СписокВыбораПериодовПользователя.Добавить(НайденнаяСтрока.СтандартныйПериод, НайденнаяСтрока.Представление + Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокВыбораПериодовПользователя;
	
КонецФункции

Функция ПолучитьСписокВыбораСтандартнойДатыНачалаПользователя(Параметры)
	
	ТаблицаСтандартныхДатНачала = ПолучитьТаблицуСтандартныхДатНачала();
	ВспомогательныйПериод = Новый СтандартнаяДатаНачала;
	СписокВыбораПериодовПользователя = Новый СписокЗначений;
	
	Если Параметры.ПроизвольныйПериод Тогда
		СписокВыбораПериодовПользователя.Вставить(0, ВариантСтандартнойДатыНачала.ПроизвольнаяДата, "Произвольная дата");
	КонецЕсли;
	
	Для каждого ОтносительноеВремя Из Параметры.СписокДоступныхОтносительныхПериодов Цикл
		Если Не ОтносительноеВремя.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Для каждого Периодичность Из Параметры.ДоступныеПериодичности Цикл
			Если Не Периодичность.Использование Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Время", ОтносительноеВремя.Значение);
			СтруктураПоиска.Вставить("Периодичность", Периодичность.Периодичность);
			НайденныеСтроки = ТаблицаСтандартныхДатНачала.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 1 Тогда
				НайденнаяСтрока = НайденныеСтроки[0];
				
				ВспомогательныйПериод.Вариант = НайденнаяСтрока.СтандартнаяДатаНачала;
				Представление = " (" + Формат(ВспомогательныйПериод.Дата, "ДФ=dd.MM.yyyy") + ")";
			
				СписокВыбораПериодовПользователя.Добавить(НайденнаяСтрока.СтандартнаяДатаНачала, НайденнаяСтрока.Представление + Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокВыбораПериодовПользователя;
	
КонецФункции

Функция ПолучитьНастройкуПользователяНастройкиОтчета(НастраиваемыйОбъект, Пользователь = Неопределено)
	
	Если Пользователь = Неопределено Тогда
		Пользователь = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Разрешенные
	|	СохраненныеНастройкиПользователи.Ссылка
	|ИЗ
	|	Справочник.СохраненныеНастройки.Пользователи КАК СохраненныеНастройкиПользователи
	|ГДЕ
	|	СохраненныеНастройкиПользователи.Пользователь = &Пользователь
	|	И СохраненныеНастройкиПользователи.Ссылка.ТипНастройки = &ТипНастройки
	|	И СохраненныеНастройкиПользователи.Ссылка.НастраиваемыйОбъект = &НастраиваемыйОбъект";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ТипНастройки", Перечисления.ТипыНастроек.НастройкиПользователяНастройкиОтчета);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьВСхемуНастройкиКомпоновщика(Схема, Настройки) Экспорт
	
	НастройкиXDTO = СериализаторXDTO.ЗаписатьXDTO(Настройки);
	СхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(Схема);
	Если НастройкиXDTO <> Неопределено Тогда
		
		СхемаXDTO.defaultSettings = НастройкиXDTO;
		
	КонецЕсли;
	Схема = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	
КонецПроцедуры

Функция ПолучитьПараметрыПанелиПользователяПоУмолчанию(ОтчетОбъект)
	
	ДеревоНастроекСтандартныхСтраниц  = Новый ДеревоЗначений;
	ДеревоНастроекСтандартныхСтраниц.Колонки.Добавить("Использование");
	ДеревоНастроекСтандартныхСтраниц.Колонки.Добавить("Имя");
	ДеревоНастроекСтандартныхСтраниц.Колонки.Добавить("Представление");
	
	АналитическиеОтборы = ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Истина, "Период", "Период");
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		АналитическиеОтборы = ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Истина, "Прогноз", "Прогноз");
		АналитическиеОтборы = ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Истина, "АналитическиеОтборы", "Аналитические отборы");
		ДобавитьИЗаполнитьСтроку(АналитическиеОтборы, Истина, "КоличествоЗаписей", "Ограничение на количество записей");
		ДобавитьИЗаполнитьСтроку(АналитическиеОтборы, Истина, "Порог", "Порог существенности");
		ДобавитьИЗаполнитьСтроку(АналитическиеОтборы, Истина, "Индикаторы", "Индикаторы (тренд, состояние)");
		ДобавитьИЗаполнитьСтроку(АналитическиеОтборы, Истина, "ABCКлассификация", "ABC - Классификация");
		ДобавитьИЗаполнитьСтроку(АналитическиеОтборы, Истина, "СкрытьНулевые", "Скрытие нулевых строк и колонок");
	КонецЕсли;
	ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Истина, "Параметры", "Параметры");
	ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Истина, "Отбор", "Отбор");
	ДобавитьИЗаполнитьСтроку(ДеревоНастроекСтандартныхСтраниц, Ложь, "Порядок", "Сортировка");
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДеревоНастроекСтандартныхСтраниц", ДеревоНастроекСтандартныхСтраниц);
	Параметры.Вставить("Отборы", Новый ТаблицаЗначений);
	
	СписокДоступныхОтносительныхПериодов = Новый СписокЗначений;
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		СписокДоступныхОтносительныхПериодов.Добавить("Предыдущий", "Предыдущий", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("Текущий", "Текущий", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("Следующий", "Следующий", Истина);
	Иначе
		СписокДоступныхОтносительныхПериодов.Добавить("Предыдущий", "Предыдущий", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("СНачала", "С начала текущего", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("Текущий", "Текущий", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("ДоКонца", "До конца текущего", Истина);
		СписокДоступныхОтносительныхПериодов.Добавить("Следующий", "Следующий", Истина);
	КонецЕсли;
	Параметры.Вставить("СписокДоступныхОтносительныхПериодов", СписокДоступныхОтносительныхПериодов);
	
	Параметры.Вставить("ПроизвольныйПериод", Истина);
	ДополнительныеНастройкиОтчета = Новый Массив;
	Попытка 
		ДополнительныеНастройкиОтчета = ОтчетОбъект.ПолучитьДополнительныеНастройкиОтчета();
	Исключение
	КонецПопытки;
	Для каждого ДопНастройка из ДополнительныеНастройкиОтчета Цикл
		Параметры.Вставить(ДопНастройка.Имя, ДопНастройка.ЗначениеПоУмолчанию);
	КонецЦикла;
	//Если ДополнительныеНастройкиОтчета.Количество = Тип("ДиаграммаГанта")  тогда
	//	Параметры.Вставить("ВыводитьДиаграммуГантаВОтчете", Истина);
	//	Параметры.Вставить("ПризнакВыводаДиаграммыГантаНаПанель", Истина);
	//КонецЕсли;
	ДоступныеПериодичности = Новый ТаблицаЗначений;
	ДоступныеПериодичности.Колонки.Добавить("Периодичность");
	ДоступныеПериодичности.Колонки.Добавить("РассчитыватьЧерез");
	ДоступныеПериодичности.Колонки.Добавить("Использование");
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ Разрешенные
		|	Периодичность.Ссылка
		|ИЗ
		|	Перечисление.Периодичность КАК Периодичность";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ДоступныеПериодичности.Добавить();
			НоваяСтрока.Периодичность = Выборка.Ссылка;
			НоваяСтрока.РассчитыватьЧерез = Выборка.Ссылка;
			НоваяСтрока.Использование = Истина;
		КонецЦикла;
	Иначе
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Год",       Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Полугодие", Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Квартал",   Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Месяц",     Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Декада",    Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "Неделя",    Истина);
		ДобавитьСтрокуПериодичности(ДоступныеПериодичности, "День",      Истина);
	КонецЕсли;
	
	Параметры.Вставить("ДоступныеПериодичности", ДоступныеПериодичности);
	
	Возврат Параметры;
			
КонецФункции

Функция УстановитьВариантПоУмолчанию(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если Не ФормаОтчета.ЭтоОтработкаРасшифровки И Не ФормаОтчета.РежимРедактированияНастройки Тогда
		Вариант = ПолучитьПоследнийИспользуемыйВариант(ПолучитьИдентификаторОбъекта(ОтчетОбъект));
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ссылка", Вариант);
		НайденныеСтроки = ОтчетОбъект.ТаблицаВариантовОтчета.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ОтчетОбъект.СохраненнаяНастройка = НайденныеСтроки[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПоследнийИспользуемыйВариант(Ссылка)
	
	Значение = ВосстановитьЗначение("ПоследниеИспользованныеНастройкиПользователя");
	Если Значение = Неопределено ИЛИ Значение[Ссылка] = Неопределено Тогда
		Возврат Справочники.СохраненныеНастройки.ПустаяСсылка();
	Иначе
		Возврат Значение[Ссылка];
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьТаблицуДоступныхНастроекПользователю(ОтчетОбъект) Экспорт
	
	ОтчетОбъект.ТаблицаВариантовОтчета = ПолучитьТаблицуДоступныхВариантов(ПолучитьИдентификаторОбъекта(ОтчетОбъект), глЗначениеПеременной("глТекущийПользователь"));

КонецПроцедуры

Процедура ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ОтчетОбъект, ПредставлениеНастройки, РежимРедактированияНастройки) Экспорт
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	Если РежимРедактированияНастройки Тогда
		// Добавим одну некликабельную кнопку
	
		ПолеКартинки = ЭлементыФормы.Добавить(Тип("ПолеКартинки"), "ПолеКартинкиВыбораВарианта" + "НастройкаЭлементаПанели", Истина, ЭлементыФормы.ПанельВыбораВариантов);
		ПолеКартинки.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭлементыФормы.ПолеКартинкиОсновнойВариант, ГраницаЭлементаУправления.Низ);
		ПолеКартинки.Лево = 0;
		ПолеКартинки.Верх = 0;
		ПолеКартинки.Ширина = 150;
		ПолеКартинки.Высота = ЭлементыФормы.ПолеКартинкиОсновнойВариант.Высота;
		ПолеКартинки.ТекстНевыбраннойКартинки = ПредставлениеНастройки;
		ПолеКартинки.АвтоКонтекстноеМеню = Ложь;
		ПолеКартинки.Подсказка = "Расшифровка";
		ПолеКартинки.Шрифт = Новый Шрифт(ПолеКартинки.Шрифт, "Verdana");
		ПолеКартинки.ЦветФона = Новый Цвет(255, 248, 220);
		ПолеКартинки.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
		Действие = ФормаОтчета.ДействияЭлементовФормы.ОбработкаНажатияКнопкиСохраненнойНастройки;
		ПолеКартинки.УстановитьДействие("Нажатие", Действие);
	
		Возврат;
	КонецЕсли;
	
	//Добавление основной настройки
	НоваяСтрока = ОтчетОбъект.ТаблицаВариантовОтчета.Вставить(0);
	НоваяСтрока.Ссылка = Справочники.СохраненныеНастройки.ПустаяСсылка();
	
	//НоваяСтрока.Наименование = "<Основной вариант отчета>";
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		НоваяСтрока.Наименование = ОтчетОбъект.Наименование;
	Иначе
		НоваяСтрока.Наименование = ОтчетОбъект.Метаданные().Синоним;
	КонецЕсли;
	
	НоваяСтрока.Описание = "Основной вариант отчета, отображаемый всем пользователям";
	НоваяСтрока.ПравоИзменения = Ложь;
	
	// Удалим старые кнопки
	Количество = ЭлементыФормы.Количество();
	Для Индекс = 1 По Количество Цикл
		ЭлементФормы = ЭлементыФормы[Количество - Индекс];
		Если Лев(ЭлементФормы.Имя, 26) = "ПолеКартинкиВыбораВарианта" ИЛИ Лев(ЭлементФормы.Имя, 19) = "РамкаВыбораВарианта" Тогда
			ЭлементыФормы.Удалить(ЭлементФормы);
		КонецЕсли;
	КонецЦикла;
	
	// Добавим кнопки выбора вариантов
	Для Индекс = 0 По ОтчетОбъект.ТаблицаВариантовОтчета.Количество() - 1 Цикл
		Строка = ОтчетОбъект.ТаблицаВариантовОтчета.Получить(Индекс);
		ДобавитьКнопкуВыбораВариантаОтчета(ФормаОтчета, Индекс, Строка.Наименование, Строка.Ссылка = ОтчетОбъект.СохраненнаяНастройка, Строка.ПравоИзменения, Строка.Описание);
	КонецЦикла;
	
	ЭлементыФормы.РазделительПанелиВыбораВариантов.Верх = ЭлементыФормы.РазделительПанелиВыбораВариантов.Верх + 1;
	ЭлементыФормы.РазделительПанелиВыбораВариантов.Верх = ЭлементыФормы.РазделительПанелиВыбораВариантов.Верх - 1;
	
КонецПроцедуры

Процедура ДобавитьКнопкуВыбораВариантаОтчета(ФормаОтчета, Индекс, Заголовок, Пометка, ПравоИзменения, Описание)
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	ПолеКартинки = ЭлементыФормы.Добавить(Тип("ПолеКартинки"), "ПолеКартинкиВыбораВарианта" + Индекс, Истина, ЭлементыФормы.ПанельВыбораВариантов);
	ПолеКартинки.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭлементыФормы.ПолеКартинкиОсновнойВариант, ГраницаЭлементаУправления.Низ);
	ПолеКартинки.Лево = (Индекс) * 103 + 0;
	ПолеКартинки.Верх = 0;
	ПолеКартинки.Ширина = 102;
	ПолеКартинки.Высота = ЭлементыФормы.ПолеКартинкиОсновнойВариант.Высота;
	ПолеКартинки.ГиперСсылка = Истина;
	ПолеКартинки.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	ПолеКартинки.ЦветТекста = WebЦвета.ТемноСиний;
	ПолеКартинки.ТекстНевыбраннойКартинки = Заголовок;
	ПолеКартинки.АвтоКонтекстноеМеню = Ложь;
	ПолеКартинки.Подсказка = Описание;
	ПолеКартинки.Шрифт = Новый Шрифт(ПолеКартинки.Шрифт, "Verdana");
	Если Пометка Тогда
		ПолеКартинки.КонтекстноеМеню = ЭлементыФормы.КонтекстноеМенюКартинкиВыбораСохраненнойНастройки;
	КонецЕсли;
	Если Пометка Тогда
		ПолеКартинки.ЦветФона = Новый Цвет(255, 248, 220);
		ПолеКартинки.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли;
	Действие = ФормаОтчета.ДействияЭлементовФормы.ОбработкаНажатияКнопкиСохраненнойНастройки;
	ПолеКартинки.УстановитьДействие("Нажатие", Действие);
	
	Рамка = ЭлементыФормы.Добавить(Тип("РамкаГруппы"), "РамкаВыбораВарианта" + Индекс, Истина, ЭлементыФормы.ПанельВыбораВариантов);
	Рамка.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭлементыФормы.ПолеКартинкиОсновнойВариант, ГраницаЭлементаУправления.Низ);
	Рамка.Лево = (Индекс + 1) * 103 - 2;
	Рамка.Верх = 0;
	Рамка.Ширина = 1;
	Рамка.Высота = ЭлементыФормы.ПолеКартинкиОсновнойВариант.Высота;
	Рамка.ЦветРамки = ЦветаСтиля.ЦветРамки;
	Рамка.ЦветТекста = WebЦвета.ТемноСиний;
	
КонецПроцедуры

Функция ДобавитьИЗаполнитьСтроку(Родитель, Использование, Имя, Представление)

	НоваяСтрока = Родитель.Строки.Добавить();
	НоваяСтрока.Использование = Использование;
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Представление = Представление;
	Возврат НоваяСтрока;
	
КонецФункции

Функция ДобавитьСтрокуПериодичности(Таблица, Периодичность, Использование)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Периодичность = Периодичность;
	НоваяСтрока.Использование = Использование;
	Возврат НоваяСтрока;
	
КонецФункции

Процедура СохранитьПоследнююИспользуемуюНастройку(ОтчетОбъект) Экспорт
	
	Значение = ВосстановитьЗначение("ПоследниеИспользованныеНастройкиПользователя");
	Если Значение = Неопределено ИЛИ ТипЗнч(Значение) <> Тип("Соответствие") Тогда
		Значение = Новый Соответствие;
	КонецЕсли;
	
	Значение[ПолучитьИдентификаторОбъекта(ОтчетОбъект)] = ОтчетОбъект.СохраненнаяНастройка;
	СохранитьЗначение("ПоследниеИспользованныеНастройкиПользователя", Значение);
	
КонецПроцедуры

Процедура ОбновитьЦветаДиаграммы(Результат, ТаблицаЦветовСерий) Экспорт
	
	Если ТаблицаЦветовСерий = Неопределено 
	 ИЛИ ТаблицаЦветовСерий.Колонки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Рисунки = Результат.Рисунки;
	Для каждого Рисунок Из Рисунки Цикл
		Если ТипЗнч(Рисунок.Объект) <> Тип("Диаграмма") Тогда
			Продолжить;
		КонецЕсли;
		Серии = Рисунок.Объект.Серии;
		Для каждого Серия Из Серии Цикл
			СтруктураПоиска = Новый Структура("Текст", Серия.Текст);
			МассивЦветовСерий = ТаблицаЦветовСерий.НайтиСтроки(СтруктураПоиска);
			Если МассивЦветовСерий.Количество() > 0 Тогда
				Серия.Цвет = МассивЦветовСерий[0].Цвет;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеВЭлементеПоСтруктуре(Структура, Ключ, ЭлементФормы) Экспорт

	Значение = ПолучитьЗначенияЭлементаСтруктуры(Структура, Ключ);
	Если Значение <> Неопределено Тогда
		ЭлементФормы.Значение = Значение;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьЗначенияЭлементаСтруктуры(Структура, Ключ) Экспорт
	
	Если Структура = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Значение = Неопределено;
	Структура.Свойство(Ключ, Значение);
	Возврат Значение;
	
КонецФункции

Процедура УстановитьДопустимоеЗначениеВПолеВыбора(Элемент, Значение, УстанавливатьПервоеЗначение = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Элемент.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение <> Неопределено И Элемент.СписокВыбора.НайтиПоЗначению(Значение) <> Неопределено Тогда
		Элемент.Значение = Значение;
	КонецЕсли;
	
	Если Элемент.Значение = Неопределено И УстанавливатьПервоеЗначение И Элемент.СписокВыбора.Количество() > 1 Тогда
		Элемент.Значение = Элемент.СписокВыбора[1].Значение;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруДинамическихОтборов(Параметры, ЭлементыФормы)
	
	Соответствие = Новый Соответствие;
	Если Параметры = Неопределено Тогда
		Возврат Соответствие;
	КонецЕсли;
	
	Для каждого СтрокаОтбора Из Параметры.Отборы Цикл
		Индекс = Параметры.Отборы.Индекс(СтрокаОтбора);
		
		ЕстьСписок = СтрокаОтбора.ВидОтбора = "Список" ИЛИ СтрокаОтбора.ВидОтбора = "ДлинныйСписок";
		ЕстьЗначение = СтрокаОтбора.ВидОтбора = "ФлажокЗначение" ИЛИ СтрокаОтбора.ВидОтбора = "Значение";
		ЕстьФлажок = СтрокаОтбора.ВидОтбора = "Флажок" ИЛИ СтрокаОтбора.ВидОтбора = "ФлажокЗначение";
		
		Использование = Истина;
		Значение = Неопределено;
		ВыбранныйВидСравнения = Неопределено;
		
		Если ЕстьСписок Тогда
			Список = Новый СписокЗначений;
			Список.ЗагрузитьЗначения(ЭлементыФормы["ДинамическийОтбор" + Индекс + "ТабличноеПоле"].Значение.ВыгрузитьКолонку("Значение"));
			Значение = Список;
			ВыбранныйВидСравнения = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ВидСравения"].Значение;
		ИначеЕсли ЕстьЗначение Тогда
			Значение = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ПолеВвода"].Значение;
		Иначе
			Значение = СтрокаОтбора.Значение;
		КонецЕсли;
		Если ЕстьФлажок Тогда
			Использование = ЭлементыФормы["ДинамическийОтбор" + Индекс + "Флажок"].Значение;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Использование", Использование);
		СтруктураОтбора.Вставить("Поле", СтрокаОтбора.Поле);
		СтруктураОтбора.Вставить("ВидСравнения", ВыбранныйВидСравнения);
		СтруктураОтбора.Вставить("Значение", Значение);
		Соответствие[СтрокаОтбора.Поле] = СтруктураОтбора;
	КонецЦикла;
	Возврат Соответствие;
	
КонецФункции

Процедура ПрименитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект) Экспорт
	
	СсылкаНаОбъект = ПолучитьИдентификаторОбъекта(ОтчетОбъект); 
	НастраиваемыйОбъект = ?(ОтчетОбъект.СохраненнаяНастройка.Пустая(), СсылкаНаОбъект, ОтчетОбъект.СохраненнаяНастройка);
	Настройка = ПолучитьНастройкуПользователяНастройкиОтчета(НастраиваемыйОбъект);
	Если Настройка <> Неопределено Тогда
		Настройка = Настройка.ПолучитьОбъект();
		Значение = Настройка.ХранилищеНастроек.Получить();
		ОтчетОбъект.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(Значение["ЗначенияНастроекПанелиПользователя"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьКопиюРезультата(Результат) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(Результат);
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.СохранятьСвойстваОтображения = Истина;
	ТабДок.Показать();

КонецПроцедуры

Функция ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета) Экспорт
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	ЗначенияНастроек = Новый Структура;
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		
		//АналитическиеОтборы
		ЗначенияАналитическихОтборов = Новый Структура;
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыКоличествоТоп");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПроцентТоп");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПолеТоп");
		
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПроцентПорог");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыРесурсПорог");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПолеПорог");
		
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПолеОтборТренд");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыЗначениеОтборТренд");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПолеОтборСостояние");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыЗначениеОтборСостояние");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыПолеОтборABCКлассификация");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыЗначениеОтборABCКлассификация");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияАналитическихОтборов, "АналитическиеОтборыСкрытьНулевые");
		ЗначенияНастроек.Вставить("АналитическиеОтборы", ЗначенияАналитическихОтборов);
		
		//НастройкиПрогноза
		ЗначенияНастроекПрогноза = Новый Структура;
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаПрогноз");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаДатаОтсчета");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаКоличествоАнализ");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаКоличествоПрогноз");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаПоказательПрогноза");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаПолеПрогноза");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаПериодичность");
		ВставитьЗначениеЭлементаФормы(ЭлементыФормы, ЗначенияНастроекПрогноза, "НастройкиПрогнозаКратность");
		ЗначенияНастроек.Вставить("НастройкиПрогноза", ЗначенияНастроекПрогноза);
		
		// НастройкаПериода
		НП = Новый Структура;
		НП.Вставить("Период", ФормаОтчета.Период);
		НП.Вставить("ТекущаяДата", ТекущаяДата());
		ЗначенияНастроек.Вставить("НастройкаПериода", НП);
		
	Иначе
		ЗначенияНастроек.Вставить("ВыводитьЗаголовокОтчета", ФормаОтчета.ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.Заголовок.Пометка);
		ЗначенияНастроек.Вставить("ФормироватьПриОткрытии", Ложь);
	КонецЕсли;
	
	//ДинамическиеОтборы
	ЗначенияНастроек.Вставить("ДинамическиеОтборы", ПолучитьСтруктуруДинамическихОтборов(ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект), ЭлементыФормы));
	
	ЗначенияНастроек.Вставить("НастройкиКомпоновщика", ФормаОтчета.КомпоновщикНастроекПользователя.ПолучитьНастройки());
	
	ДополнительныеНастройкиОтчета = Новый Массив;
	Попытка 
		ДополнительныеНастройкиОтчета = ОтчетОбъект.ПолучитьДополнительныеНастройкиОтчета();
	Исключение
	КонецПопытки;
	Для каждого ДопНастройка из ДополнительныеНастройкиОтчета Цикл
		Если ЭлементыФормы.Найти(ДопНастройка.Имя) <>  Неопределено тогда
			ЗначенияНастроек.Вставить(ДопНастройка.Имя, ЭлементыФормы[ДопНастройка.Имя].Значение);
		КонецЕсли;
	КонецЦИкла;
	
		
	// Запомним видимость страниц компоновки чтобы при загрузке значений знать,
	// брать из значений по умолчанию или из запомненных значений
	ВидимостьСтраниц = Новый Соответствие;
	ВидимостьСтраниц.Вставить("Параметры", ЭлементыФормы.ПанельЗакладок.Страницы.Параметры.Видимость);
	ВидимостьСтраниц.Вставить("Отбор", ЭлементыФормы.ПанельЗакладок.Страницы.Отбор.Видимость);
	ВидимостьСтраниц.Вставить("Порядок", ЭлементыФормы.ПанельЗакладок.Страницы.Порядок.Видимость);
	ЗначенияНастроек.Вставить("ВидимостьСтраниц", ВидимостьСтраниц);
	
	// Стандартный период
	ЗначенияНастроек.Вставить("СтандартныйПериод", ФормаОтчета.СтандартныйПериод);
	
	// Стандартная дата начала
	ЗначенияНастроек.Вставить("СтандартнаяДатаНачала", ФормаОтчета.СтандартнаяДатаНачала);
	
	Возврат ЗначенияНастроек;
	
КонецФункции

Функция ПолучитьЗначенияНастроекПанелиПользователяПоУмолчанию(ОтчетОбъект)
	
	ЗначенияНастроек = Новый Структура;
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		
		//АналитическиеОтборы
		ЗначенияАналитическихОтборов = Новый Структура;
		ЗначенияАналитическихОтборов.Вставить("ОтборыКоличествоТоп", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыПроцентТоп", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыПолеТоп", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыПолеОтборТренд", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыЗначениеОтборТренд", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыПолеОтборСостояние", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыЗначениеОтборСостояние", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыПолеОтборABCКлассификация", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыЗначениеОтборABCКлассификация", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ОтборыСкрытьНулевые", Неопределено);
		ЗначенияНастроек.Вставить("АналитическиеОтборы", ЗначенияАналитическихОтборов);
		
		//НастройкиПрогноза
		ЗначенияНастроекПрогноза = Новый Структура;
		ЗначенияАналитическихОтборов.Вставить("Прогноз", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ДатаОтсчета", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("КоличествоАнализ", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("КоличествоПрогноз", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ПоказательПрогноза", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("ПолеПрогноза", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("Периодичность", Неопределено);
		ЗначенияАналитическихОтборов.Вставить("Кратность", Неопределено);
		ЗначенияНастроек.Вставить("НастройкиПрогноза", ЗначенияНастроекПрогноза);
		
		// НастройкаПериода
		НП = Новый Структура;
		НП.Вставить("Период", Справочники.Периоды.ПустаяСсылка());
		НП.Вставить("ТекущаяДата", ТекущаяДата());
		ЗначенияНастроек.Вставить("НастройкаПериода", НП);
		
	Иначе
		ЗначенияНастроек.Вставить("ВыводитьЗаголовокОтчета", Истина);
		ЗначенияНастроек.Вставить("ФормироватьПриОткрытии", Ложь);
	КонецЕсли;
	
	//ДинамическиеОтборы
	ЗначенияНастроек.Вставить("ДинамическиеОтборы", Новый Соответствие);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаОбъекта = ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект);
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаОбъекта));
	ЗаполнитьЭлементы(Компоновщик.Настройки["ПараметрыДанных"], СхемаОбъекта.НастройкиПоУмолчанию["ПараметрыДанных"]);
	
	ЗначенияНастроек.Вставить("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	
	
	// Запомним видимость страниц компоновки чтобы при загрузке значений знать,
	// брать из значений по умолчанию или из запомненных значений
	ВидимостьСтраниц = Новый Соответствие;
	ВидимостьСтраниц.Вставить("Параметры", Истина);
	ВидимостьСтраниц.Вставить("Отбор", Истина);
	ВидимостьСтраниц.Вставить("Порядок", Ложь);
	ЗначенияНастроек.Вставить("ВидимостьСтраниц", ВидимостьСтраниц);
	
	// Стандартный период
	ЗначенияНастроек.Вставить("СтандартныйПериод", Новый СтандартныйПериод);
	
	// Стандартная дата начала
	ЗначенияНастроек.Вставить("СтандартнаяДатаНачала", Новый СтандартнаяДатаНачала);
	
	Возврат ЗначенияНастроек;
	
КонецФункции

Процедура ЗагрузитьВРеквизитЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета) Экспорт

	ОтчетОбъект.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета));
	
КонецПроцедуры

Процедура ВставитьЗначениеЭлементаФормы(ЭлементыФормы, Структура, Имя)
	
	Ключ = СтрЗаменить(Имя, "АналитическиеОтборы", "");
	Ключ = СтрЗаменить(Ключ, "НастройкиПрогноза", "");
		
	Если ЭлементыФормы.Найти(Имя) <> Неопределено Тогда
		Структура.Вставить(Ключ, ЭлементыФормы[Имя].Значение);
	Иначе
		Структура.Вставить(Ключ, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерерисоватьПанельНастроек(ОтчетОбъект, ФормаОтчета, ЗначенияНастроек = Неопределено) Экспорт
	
	ЦветФонаКнопки = Новый Цвет(246, 244, 236);
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	ЭлементыФормы.ПанельЗакладок.Видимость = Ложь;
	ЭлементыФормы.ПанельЗакладок.РежимПрокручиваемыхСтраниц = Ложь;
	ШиринаФормы = ФормаОтчета.Ширина;
	ШиринаПанели = ЭлементыФормы.ПанельПользователя.Ширина;
	Лево = ЭлементыФормы.Разделитель.Лево;
	Если ШиринаПанели < 306 тогда
		ЭлементыФормы.Разделитель.Лево = ШиринаФормы - 295;
	КонецЕсли;
		
	// Инициализация ЗначенияНастроек
	Если ЗначенияНастроек = Неопределено Тогда
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект);
		
		//Аверсон ЕАЕ 22.04.2025 СВФР-015531
		//Климовичи
		Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Если Орг.ИНН = "700103211" И ТипЗнч(ОтчетОбъект) = Тип("ОтчетОбъект.СпискиРаботниковОрганизаций") Тогда
			ЗначенияНастроек.СтандартнаяДатаНачала = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
		КонецЕсли;
		//Аверсон СВФР-015531
		
	КонецЕсли;
	Если ЗначенияНастроек = Неопределено Тогда
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователяПоУмолчанию(ОтчетОбъект);
	КонецЕсли;
	
	// Инициализация Параметры
	Параметры = ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект);
	Если Параметры = Неопределено Тогда
		Параметры = ПолучитьПараметрыПанелиПользователяПоУмолчанию(ОтчетОбъект);
		СохраненнаяМодифицированность = ФормаОтчета.Модифицированность;
		ОтчетОбъект.ПараметрыПанелиПользователя = Новый ХранилищеЗначения(Параметры);
		ФормаОтчета.Модифицированность = СохраненнаяМодифицированность;
	КонецЕсли;
	
	Схема = ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект);
	ФормаОтчета.КомпоновщикНастроекПользователя.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	
	// Управление видимостью стандартных страниц
	ДеревоНастроекСтандартныхСтраниц = Параметры.ДеревоНастроекСтандартныхСтраниц;
	Для каждого НастройкаСтраницы Из ДеревоНастроекСтандартныхСтраниц.Строки Цикл
		Если Не ЭтоПроизвольныйОтчет(ОтчетОбъект) И НастройкаСтраницы.Имя = "Период" Тогда
			Продолжить;
		КонецЕсли;
		ЭлементыФормы.ПанельЗакладок.Страницы.Найти(НастройкаСтраницы.Имя).Видимость = НастройкаСтраницы.Использование;
	КонецЦикла;
	
	Для каждого ВидимостьСтраницы Из ЗначенияНастроек.ВидимостьСтраниц Цикл
		Если Не ЭлементыФормы.ПанельЗакладок.Страницы.Найти(ВидимостьСтраницы.Ключ).Видимость Тогда
			Продолжить;
		КонецЕсли;
		Если ВидимостьСтраницы.Значение Тогда
			// Восстанавливаем значение
			ТекущиеНастройкиКомпоновщика = ЗначенияНастроек.НастройкиКомпоновщика;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ВидимостьСтраницы.Ключ = "Параметры" Тогда
			ЗаполнитьЭлементы(ФормаОтчета.КомпоновщикНастроекПользователя.Настройки["ПараметрыДанных"], ТекущиеНастройкиКомпоновщика["ПараметрыДанных"]);
		Иначе
			СкопироватьЭлементы(ФормаОтчета.КомпоновщикНастроекПользователя.Настройки[ВидимостьСтраницы.Ключ], ТекущиеНастройкиКомпоновщика[ВидимостьСтраницы.Ключ]);
		КонецЕсли;
	КонецЦикла;
	
	ФормаОтчета.ЭлементыФормы.Сортировка.Верх      = 6;
	ФормаОтчета.ЭлементыФормы.Отбор.Верх           = 6;
	ФормаОтчета.ЭлементыФормы.ПараметрыДанных.Верх = 6;
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		// Закладка Период для Аналитических отчетов
		ФормаОтчета.НарисоватьСтраницуПериод(Параметры, ЗначенияНастроек);
	КонецЕсли;
	
	// Установка высоты табличного поля параметры
	Если ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры <> Неопределено Тогда
		КоличествоПараметров = 0;
		Для каждого Параметр Из ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.Элементы Цикл
			Если Параметр.Видимость Тогда
				КоличествоПараметров = КоличествоПараметров + 1;
			КонецЕсли;
		КонецЦикла;
		Если КоличествоПараметров = 0 Тогда
			// Спрячем закладку Параметры, если параметров нет
			ЭлементыФормы.ПанельЗакладок.Страницы.Параметры.Видимость = Ложь;
		Иначе
			// Сделаем высоту списка параметров впритык всем параметрам
			ЭлементыФормы.ПараметрыДанных.Высота = 17 * (1 + КоличествоПараметров);
		КонецЕсли;
	КонецЕсли;
	
	// Удаление старых закладок с динамическими отборами
	Количество = ЭлементыФормы.ПанельЗакладок.Страницы.Количество();
	Для Индекс = 1 По Количество Цикл
		Страница = ЭлементыФормы.ПанельЗакладок.Страницы[Количество - Индекс];
		Если Лев(Страница.Имя, 17) = "ДинамическийОтбор" Тогда
			ЭлементыФормы.ПанельЗакладок.Страницы.Удалить(Количество - Индекс);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим старые элементы с динамическими отборами
	Количество = ЭлементыФормы.Количество();
	Для Индекс = 1 По Количество Цикл
		Элемент = ЭлементыФормы[Количество - Индекс];
		Если Лев(Элемент.Имя, 17) = "ДинамическийОтбор" Тогда
			ЭлементыФормы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	НарисоватьСтандартныйПериод(ОтчетОбъект, ФормаОтчета, ЗначенияНастроек, Параметры);
	
	// Добавим закладки динамических отборов
	Отборы = Параметры.Отборы;
	ЕстьДополнительнаяСтраница = Ложь;
	
	
	ВерхДопСтраница = 6;
	Для каждого СтрокаОтбора Из Отборы Цикл
		
		Индекс = Отборы.Индекс(СтрокаОтбора);
		ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(СтрокаОтбора.Поле, ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора);
		ЭлементДинамическогоОтбора = Неопределено;
		Если ЗначенияНастроек.Свойство("ДинамическиеОтборы") Тогда
			ЭлементДинамическогоОтбора = ЗначенияНастроек.ДинамическиеОтборы[СтрокаОтбора.Поле];
		КонецЕсли;
		
		Если СтрокаОтбора.Расположение = "НоваяСтраница" Тогда
			НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Добавить("ДинамическийОтбор" + Индекс, СтрокаОтбора.Представление, СтрокаОтбора.Поле);
			НоваяСтраница.Раскрыта = Истина;
			Верх = 6;
		ИначеЕсли СтрокаОтбора.Расположение = "ДополнительнаяСтраница" Тогда
			Если Не ЕстьДополнительнаяСтраница Тогда
				ЕстьДополнительнаяСтраница = Истина;
				НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Добавить("ДинамическийОтбор" + "ДополнительнаяСтраница", "Отборы", СтрокаОтбора.Поле);
			КонецЕсли;
			НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы["ДинамическийОтбор" + "ДополнительнаяСтраница"];
			Верх = ВерхДопСтраница;
		Иначе
		КонецЕсли;
		ЭлементыФормы.ПанельЗакладок.ТекущаяСтраница = НоваяСтраница;
		
		Если СтрокаОтбора.ВидОтбора = "Список" ИЛИ СтрокаОтбора.ВидОтбора = "ДлинныйСписок" Тогда
			НарисоватьДинамическийОтборСписок(ФормаОтчета, Индекс, Верх, ЦветФонаКнопки, СтрокаОтбора, ЭлементДинамическогоОтбора, ДоступноеПоле);
		ИначеЕсли СтрокаОтбора.ВидОтбора = "Флажок" ИЛИ СтрокаОтбора.ВидОтбора = "ФлажокЗначение" ИЛИ СтрокаОтбора.ВидОтбора = "Значение" Тогда
			НарисоватьДинамическийОтборФлажокЗначение(ФормаОтчета, Индекс, Верх, ЦветФонаКнопки, СтрокаОтбора, ЭлементДинамическогоОтбора, ДоступноеПоле);
		КонецЕсли;
		Если ЕстьДополнительнаяСтраница И НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы["ДинамическийОтбор" + "ДополнительнаяСтраница"] Тогда
			ВерхДопСтраница = Верх;
		КонецЕсли;
		
	КонецЦикла;

	ДополнительныеНастройкиОтчета = Новый Массив;
	Попытка 
		ДополнительныеНастройкиОтчета = ОтчетОбъект.ПолучитьДополнительныеНастройкиОтчета();
	Исключение
	КонецПопытки;
	
	Для каждого ДопНастройка из ДополнительныеНастройкиОтчета Цикл
		Если Не ЕстьДополнительнаяСтраница тогда
			НоваяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы.Добавить("ДинамическийОтбор" + "ДополнительнаяСтраница", "Дополнительные настройки", "ДиаграммаГанта");
		КонецЕсли;
		ЭлементыФормы.ПанельЗакладок.ТекущаяСтраница = ЭлементыФормы.ПанельЗакладок.Страницы["ДинамическийОтбор" + "ДополнительнаяСтраница"];
		НарисоватьФлажокДопНастроек(ФормаОтчета, ВерхДопСтраница, ДопНастройка.Имя, ДопНастройка.Заголовок, ДопНастройка.ЗначениеПоУмолчанию);
	КонецЦикла;
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		// Управление видимостью аналитических отборов для Аналитического отчета
		НастройкаСтраницы = ДеревоНастроекСтандартныхСтраниц.Строки.Найти("АналитическиеОтборы", "Имя");
		ФормаОтчета.НарисоватьАналитическиеОтборы(НастройкаСтраницы, ЗначенияНастроек);
	КонецЕсли;
	
	// Сдвинем страницу Сортировка в самый конец
	Индекс = ЭлементыФормы.ПанельЗакладок.Страницы.Индекс(ЭлементыФормы.ПанельЗакладок.Страницы.Порядок);
	Количество = ЭлементыФормы.ПанельЗакладок.Страницы.Количество();
	ЭлементыФормы.ПанельЗакладок.Страницы.Сдвинуть(ЭлементыФормы.ПанельЗакладок.Страницы.Порядок, Количество - 1 - Индекс);
	
	ЭлементыФормы.ПанельЗакладок.РежимПрокручиваемыхСтраниц = Истина;
	
	Соответствие = Новый Соответствие;
	Для каждого Страница Из ЭлементыФормы.ПанельЗакладок.Страницы Цикл
		Соответствие.Вставить(Страница, Страница.Раскрыта);
	КонецЦикла;
	Для каждого Страница Из ЭлементыФормы.ПанельЗакладок.Страницы Цикл
		Страница.Раскрыта = Ложь;
	КонецЦикла;
	Количество = ЭлементыФормы.ПанельЗакладок.Страницы.Количество();
	Для Индекс = 1 По Количество Цикл
		Страница = ЭлементыФормы.ПанельЗакладок.Страницы[Количество - Индекс];
		Страница.Раскрыта = Соответствие[Страница];
	КонецЦикла;
	
	ЭлементыФормы.ПанельЗакладок.Видимость = Истина;
	//
	//Если ШиринаПанели < 306 тогда
	//	ЭлементыФормы.Разделитель.Лево = Лево;
	//КонецЕсли;
КонецПроцедуры

Процедура НарисоватьФлажокДопНастроек(ФормаОтчета, ВерхДопСтр, ИмяФлажка, НазваниеФлажка, ЗначениеПоУмолчанию)
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	НовыйЭлемент = ЭлементыФормы.Добавить(Тип("Флажок"), ИмяФлажка, Истина, ЭлементыФормы.ПанельЗакладок);
	НовыйЭлемент.Верх      = ВерхДопСтр;
	НовыйЭлемент.Лево      = 6;
	НовыйЭлемент.Ширина    = 143 * 2;
	НовыйЭлемент.Заголовок = НазваниеФлажка;
	НовыйЭлемент.Значение  = ЗначениеПоУмолчанию;
	УстановитьПравуюПривязку(НовыйЭлемент, ЭлементыФормы.ПанельЗакладок);
КонецПроцедуры

Процедура СохранитьРезультатВНастройке(ОтчетОбъект, ФормаОтчета) Экспорт 
	
	Если Не ФормаОтчета.ЭтоОтработкаРасшифровки И Не ФормаОтчета.РежимРедактированияНастройки Тогда
		СохранитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект, ФормаОтчета);
	КонецЕсли;
	
	СсылкаНаОбъект = ПолучитьИдентификаторОбъекта(ОтчетОбъект); 
	НастраиваемыйОбъект = ?(ОтчетОбъект.СохраненнаяНастройка.Пустая(), СсылкаНаОбъект, ОтчетОбъект.СохраненнаяНастройка);
	Настройка = ПолучитьНастройкуПользователяНастройкиОтчета(НастраиваемыйОбъект);
	Если Настройка <> Неопределено Тогда
		Настройка = Настройка.ПолучитьОбъект();
		Значение = Настройка.ХранилищеНастроек.Получить();
	Иначе
		Настройка = Справочники.СохраненныеНастройки.СоздатьЭлемент();
		Настройка.НастраиваемыйОбъект = НастраиваемыйОбъект;
		Настройка.ТипНастройки = Перечисления.ТипыНастроек.НастройкиПользователяНастройкиОтчета;
		Настройка.Владелец = глЗначениеПеременной("глТекущийПользователь");
		Настройка.Наименование = "НастройкиПользователяНастройкиОтчета";
		НовыйПользователь = Настройка.Пользователи.Добавить();
		НовыйПользователь.Пользователь = глЗначениеПеременной("глТекущийПользователь");
		Значение = Новый Соответствие;
	КонецЕсли;
	ТД = Новый ТабличныйДокумент;
	ТД.Вывести(ФормаОтчета.ЭлементыФормы.Результат);
	Значение["Результат"] = ТД;
	Настройка.ХранилищеНастроек = Новый ХранилищеЗначения(Значение);
	Настройка.Записать();

КонецПроцедуры

Процедура СохранитьРезультатССохраненным(ОтчетОбъект, ФормаОтчета) Экспорт
	
	СсылкаНаОбъект = ПолучитьИдентификаторОбъекта(ОтчетОбъект); 
	НастраиваемыйОбъект = ?(ОтчетОбъект.СохраненнаяНастройка.Пустая(), СсылкаНаОбъект, ОтчетОбъект.СохраненнаяНастройка);
	Настройка = ПолучитьНастройкуПользователяНастройкиОтчета(НастраиваемыйОбъект);
	Если Настройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Значение = Настройка.ХранилищеНастроек.Получить();
	ТД = Значение["Результат"];
	Если ТД = Неопределено Тогда
		Вопрос("Отсутствует сохраненный результат", РежимДиалогаВопрос.ОК);
		Возврат;
	ИначеЕсли ТД.ВысотаТаблицы = 0 Тогда
		Вопрос("Сохраненный результат пустой", РежимДиалогаВопрос.ОК);
		Возврат;
	ИначеЕсли ФормаОтчета.ЭлементыФормы.Результат.ВысотаТаблицы = 0 Тогда
		Вопрос("Текущий результат пустой", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	ТД2 = Новый ТабличныйДокумент;
	ТД2.Вывести(ФормаОтчета.ЭлементыФормы.Результат);
	
	Файл1 = ПолучитьИмяВременногоФайла("ФайлСравнения1.mxl");
	Файл2 = ПолучитьИмяВременногоФайла("ФайлСравнения2.mxl");
	ТД2.Записать(Файл1);
	ТД.Записать(Файл2);
	СравнениеФайлов = Новый СравнениеФайлов;
	СравнениеФайлов.ПервыйФайл = Файл1;
	СравнениеФайлов.ВторойФайл = Файл2;
	СравнениеФайлов.СпособСравнения = СпособСравненияФайлов.ТабличныйДокумент;
	
	Если СравнениеФайлов.Сравнить() Тогда
		Вопрос("Результаты совпадают", РежимДиалогаВопрос.ОК);
	Иначе
		СравнениеФайлов.ПоказатьРазличия();
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьТекущуюНастройку(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если Не ОтчетОбъект.СохраненнаяНастройка.Пустая() И ОтчетОбъект.СохраненнаяНастройка.ПолучитьОбъект() = Неопределено Тогда
		// Вариант отчета удален. Сбрасываем вариант отчета на основной и предлагаем сохранить как
		ОтчетОбъект.СохраненнаяНастройка = Справочники.СохраненныеНастройки.ПустаяСсылка();
		ТиповыеОтчеты.СохранитьТекущуюНастройкуКак(ОтчетОбъект, ФормаОтчета);
		ОбновитьЗаголовокТиповогоОтчета(ОтчетОбъект, ФормаОтчета);
		Возврат;
	КонецЕсли;
	
	Если Не ТиповыеОтчеты.ЗаписьОтчетаДоступна(ОтчетОбъект) Тогда
		ТиповыеОтчеты.СохранитьТекущуюНастройкуКак(ОтчетОбъект, ФормаОтчета);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьВРеквизитЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
	Если ОтчетОбъект.СохраненнаяНастройка.Пустая() Тогда
		Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
			Схема = ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект);
			ЗагрузитьВСхемуНастройкиКомпоновщика(Схема, Настройки);
			ОтчетОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(Схема);
		КонецЕсли;
		ФормаОтчета.ЗаписатьВФорме();
	Иначе
		ОтчетОбъект.СохранитьНастройку();
	КонецЕсли;
	ФормаОтчета.Модифицированность = Ложь;
	ОбновитьЗаголовокТиповогоОтчета(ОтчетОбъект, ФормаОтчета);
	ФормаОтчета.Модифицированность = Ложь;
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		ФормаОтчета.ЭлементыФормы.СохранитьИЗакрыть.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьТекущуюНастройкуКак(ОтчетОбъект, ФормаОтчета) Экспорт

	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Если ОтчетОбъект.Ссылка.Пустая() Тогда
			Предупреждение("Отчет еще не записан!", , "Сохранение настройки пользователя");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СохраненнаяСохраненнаяНастройка = ОтчетОбъект.СохраненнаяНастройка;
	СохранениеНастроек.ВыбратьНастройкуФормы(ОтчетОбъект.СохраненнаяНастройка, ФормаОтчета, ПолучитьИдентификаторОбъекта(ОтчетОбъект), Истина);
	
	Если Не ФормаОтчета.РежимРедактированияНастройки Тогда
		ОбновитьТаблицуДоступныхНастроекПользователю(ОтчетОбъект);
		ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ОтчетОбъект, ФормаОтчета.ПредставлениеНастройки, ФормаОтчета.РежимРедактированияНастройки);
	Иначе
		// Сохранили настройки отчета в СохраненнуюНастройку
		ОтчетОбъект.СохраненнаяНастройка = СохраненнаяСохраненнаяНастройка;
	КонецЕсли;
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		ФормаОтчета.ЭлементыФормы.СохранитьИЗакрыть.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура РедактироватьПанельПользователя(ОтчетОбъект, ФормаОтчета) Экспорт
	
	ФормаНастройки = ПолучитьОбщуюФорму("ФормаНастройкиПараметровПанелиПользователя", ФормаОтчета);
	ФормаНастройки.ОтчетОбъект = ОтчетОбъект;
	
	ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
	Если ФормаНастройки.ОткрытьМодально() = Истина Тогда
		ПерерисоватьПанельНастроек(ОтчетОбъект, ФормаОтчета, ЗначенияНастроек);
		ФормаОтчета.Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОткрытьФормуСохраненнойНастройки(ОтчетОбъект, ФормаОтчета) Экспорт
	
	Если Не ОтчетОбъект.СохраненнаяНастройка.Пустая() Тогда
		
		Если ОтчетОбъект.СохраненнаяНастройка.ПолучитьОбъект() = Неопределено Тогда
			ОтчетОбъект.СохраненнаяНастройка = Справочники.СохраненныеНастройки.ПустаяСсылка();
			Вопрос("Текущий вариант отчета удален.", РежимДиалогаВопрос.ОК);
			ТиповыеОтчеты.ОбновитьТаблицуДоступныхНастроекПользователю(ОтчетОбъект);
			ТиповыеОтчеты.ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ОтчетОбъект, ФормаОтчета.ПредставлениеНастройки, ФормаОтчета.РежимРедактированияНастройки);
			ОбновитьЗаголовокТиповогоОтчета(ОтчетОбъект, ФормаОтчета);
			Возврат;
		КонецЕсли;

		ФормаЭлемента = ОтчетОбъект.СохраненнаяНастройка.ПолучитьФорму(, ФормаОтчета);
		ФормаЭлемента.ОткрытьМодально();
		ОбновитьТаблицуДоступныхНастроекПользователю(ОтчетОбъект);
		ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ОтчетОбъект, ФормаОтчета.ПредставлениеНастройки, ФормаОтчета.РежимРедактированияНастройки);
	Иначе
		Вопрос("Основной вариант не содержит описания и виден всем пользователям", РежимДиалогаВопрос.ОК);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗакрытияНастройкиОтчета(ОтчетОбъект, ФормаОтчета, Отказ = Ложь, СтандартнаяОбработка = Истина) Экспорт
	
	Если Не ОтчетОбъект.СохраненнаяНастройка.Пустая() И ОтчетОбъект.СохраненнаяНастройка.ПолучитьОбъект() = Неопределено Тогда
		// Вариант отчета удален
		Возврат;
	КонецЕсли;
	
	Если Не ФормаОтчета.ЭтоОтработкаРасшифровки И Не ФормаОтчета.РежимРедактированияНастройки Тогда
		СохранитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект, ФормаОтчета);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗаписьОтчетаДоступна(ОтчетОбъект) ИЛИ Не ФормаОтчета.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтчетОбъект.СохраненнаяНастройка.Пустая() Тогда
		// Сохраним сам отчет
		РезультатВопроса = Вопрос(НСТР("ru='Сохранить изменения в основном варианте отчета?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			СохранитьТекущуюНастройку(ОтчетОбъект, ФормаОтчета);
		ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Иначе
			Отказ = Истина;
		КонецЕсли;
	Иначе
		// Сохраним настройку
		РезультатВопроса = Вопрос("Сохранить изменения в варианте отчета " 
			  + """" + ОтчетОбъект.СохраненнаяНастройка.Наименование + """?", РежимДиалогаВопрос.ДаНетОтмена);
		Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
			СохранитьТекущуюНастройку(ОтчетОбъект, ФормаОтчета);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект, ФормаОтчета)
	
	СсылкаНаОбъект = ПолучитьИдентификаторОбъекта(ОтчетОбъект); 
	НастраиваемыйОбъект = ?(ОтчетОбъект.СохраненнаяНастройка.Пустая(), СсылкаНаОбъект, ОтчетОбъект.СохраненнаяНастройка);
	
	Настройка = ПолучитьНастройкуПользователяНастройкиОтчета(НастраиваемыйОбъект);
	Если Настройка <> Неопределено Тогда
		Настройка = Настройка.ПолучитьОбъект();
		Значение = Настройка.ХранилищеНастроек.Получить();
	Иначе
		Настройка = Справочники.СохраненныеНастройки.СоздатьЭлемент();
		Настройка.НастраиваемыйОбъект = НастраиваемыйОбъект;
		Настройка.ТипНастройки = Перечисления.ТипыНастроек.НастройкиПользователяНастройкиОтчета;
		Настройка.Владелец = глЗначениеПеременной("глТекущийПользователь");
		Настройка.Наименование = "НастройкиПользователяНастройкиОтчета";
		НовыйПользователь = Настройка.Пользователи.Добавить();
		НовыйПользователь.Пользователь = глЗначениеПеременной("глТекущийПользователь");
		Значение = Новый Соответствие;
	КонецЕсли;
	Значение["ЗначенияНастроекПанелиПользователя"] = ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
	Настройка.ХранилищеНастроек = Новый ХранилищеЗначения(Значение);
	Настройка.Записать();
	
КонецПроцедуры

Процедура ВыборВариантаОтчетаНаПанелиВариантов(ОтчетОбъект, ФормаОтчета, Элемент) Экспорт
	
	Индекс = Число(Сред(Элемент.Имя, 27));
	ВыбраннаяСохраненнаяНастройка = ОтчетОбъект.ТаблицаВариантовОтчета[Индекс].Ссылка;
	Если Не ВыбраннаяСохраненнаяНастройка.Пустая() И ВыбраннаяСохраненнаяНастройка.ПолучитьОбъект() = Неопределено Тогда
		Вопрос("Операция невозможна. Вариант отчета """ + Элемент.ТекстНевыбраннойКартинки + """ удален.", РежимДиалогаВопрос.ОК);
		ТиповыеОтчеты.ОбновитьТаблицуДоступныхНастроекПользователю(ОтчетОбъект);
		ТиповыеОтчеты.ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ОтчетОбъект, ФормаОтчета.ПредставлениеНастройки, ФормаОтчета.РежимРедактированияНастройки);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОбработкаЗакрытияНастройкиОтчета(ОтчетОбъект, ФормаОтчета, Отказ);
	// Затерем значения настроек панели чтобы они не перешли на другой вариант отчета
	ОтчетОбъект.ЗначенияНастроекПанелиПользователя = Новый ХранилищеЗначения(Неопределено);
	ОтчетОбъект.ПараметрыПанелиПользователя = Новый ХранилищеЗначения(ПолучитьПараметрыПанелиПользователяПоУмолчанию(ОтчетОбъект));
	ФормаОтчета.КомпоновщикНастроекПользователя = Новый КомпоновщикНастроекКомпоновкиДанных;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Сохраним результат
    Если ФормаОтчета.СоответствиеНастройкаРезультат[ОтчетОбъект.СохраненнаяНастройка] <> Неопределено Тогда
		ФормаОтчета.ЭлементыФормы.Удалить(ФормаОтчета.СоответствиеНастройкаРезультат[ОтчетОбъект.СохраненнаяНастройка].Результат);
	КонецЕсли;
	Результат = ФормаОтчета.ЭлементыФормы.Добавить(Тип("ПолеТабличногоДокумента"), , Ложь);
	Результат.Вывести(ФормаОтчета.ЭлементыФормы.Результат);
	Структура = Новый Структура;
	Структура.Вставить("Результат", Результат);
	Структура.Вставить("ФиксацияСверху",    ФормаОтчета.ЭлементыФормы.Результат.ФиксацияСверху);
	Структура.Вставить("ДанныеРасшифровки", ФормаОтчета.ДанныеРасшифровки);
	ФормаОтчета.СоответствиеНастройкаРезультат[ОтчетОбъект.СохраненнаяНастройка] = Структура;
	
	// Обновим кнопки выбора настройки
	Для каждого ЭлементСписка Из ОтчетОбъект.ТаблицаВариантовОтчета Цикл
		Кнопка = ФормаОтчета.ЭлементыФормы["ПолеКартинкиВыбораВарианта" + ОтчетОбъект.ТаблицаВариантовОтчета.Индекс(ЭлементСписка)];
		Кнопка.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;;
		Кнопка.ЦветТекста = WebЦвета.ТемноСиний;
		Кнопка.КонтекстноеМеню = Неопределено;
	КонецЦикла;
	Элемент.ЦветФона = Новый Цвет(255, 248, 220);
	Элемент.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	
	// Установим настройку
	ОтчетОбъект.СохраненнаяНастройка = ОтчетОбъект.ТаблицаВариантовОтчета[Индекс].Ссылка;
	
	Элемент.КонтекстноеМеню = ФормаОтчета.ЭлементыФормы.КонтекстноеМенюКартинкиВыбораСохраненнойНастройки;
	
	// Загрузим результат, если есть сохраненный
	ФормаОтчета.ЭлементыФормы.Результат.Очистить();
	ФормаОтчета.ЭлементыФормы.Результат.ФиксацияСверху = 0;
	Структура = ФормаОтчета.СоответствиеНастройкаРезультат[ОтчетОбъект.СохраненнаяНастройка];
	Если Структура <> Неопределено Тогда
		ФормаОтчета.ЭлементыФормы.Результат.Вывести(Структура.Результат);
		ФормаОтчета.ДанныеРасшифровки = Структура.ДанныеРасшифровки;
		ФормаОтчета.ЭлементыФормы.Результат.ФиксацияСверху = Структура.ФиксацияСверху;
		ФормаОтчета.Обновить();
	КонецЕсли;
	
	// Загрузим саму настройку
	Если ОтчетОбъект.СохраненнаяНастройка.Пустая() Тогда
		Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
			ОтчетОбъект.Прочитать();
		КонецЕсли;
		
		ПрименитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект);
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьСхемуКомпоновкиОбъекта(ОтчетОбъект).НастройкиПоУмолчанию);
	Иначе
		ОтчетОбъект.ПрименитьНастройку();
		ПрименитьНастройкуПользователяНастройкиОтчета(ОтчетОбъект);
	КонецЕсли;
	ОбработкаФормыПослеПримененияНастройки(ОтчетОбъект, ФормаОтчета);
	
КонецПроцедуры

Процедура ОбработкаФормыПослеПримененияНастройки(ОтчетОбъект, ФормаОтчета, ИспользоватьЗначенияНастроекНаФорме = Ложь) Экспорт

	Если ИспользоватьЗначенияНастроекНаФорме Тогда
		ЗначенияНастроек = ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
	КонецЕсли;
	ПерерисоватьПанельНастроек(ОтчетОбъект, ФормаОтчета, ЗначенияНастроек);
	ОбновитьФормуТиповогоОтчетаПоКомпоновщику(ОтчетОбъект, ФормаОтчета);
	ОбновитьЗаголовокТиповогоОтчета(ОтчетОбъект, ФормаОтчета);
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		ФормаОтчета.ЭлементыФормы.ДействияФормыСлева.Кнопки.Администрирование.Кнопки.Дополнительно.Доступность = ОтчетОбъект.СохраненнаяНастройка.Пустая();
		ФормаОтчета.ЭлементыФормы.ДействияФормыСлева.Кнопки.Администрирование.Кнопки.СхемаКомпоновки.Доступность = ОтчетОбъект.СохраненнаяНастройка.Пустая();
	КонецЕсли;
	
	ФормаОтчета.Модифицированность = Ложь;
	
КонецПроцедуры

Процедура УправлениеОтображениемПанелиПользователя(ФормаОтчета) Экспорт
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	//Если ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.ПанельПользователя.Пометка Тогда
	//	ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Нет;
	//Иначе
	//	ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Право
	//КонецЕсли;
	
	Если Не ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.ПанельПользователя.Пометка тогда
		ЭлементыФормы.ПанельПользователя.УстановитьПривязку(ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы.ПанельПользователя, ГраницаЭлементаУправления.Лево);
		ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Право;
		ЭлементыФормы.Разделитель.Свертка        = РежимСверткиЭлементаУправления.Право;
	Иначе
		ЭлементыФормы.ПанельПользователя.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.Разделитель.Свертка        = РежимСверткиЭлементаУправления.Нет;
		ШиринаПанели = ЭлементыФормы.ПанельПользователя.Ширина;
		ЭлементыФормы.Разделитель.УстановитьПривязку(ГраницаЭлементаУправления.Право, ЭлементыФормы.ПанельВыбораВариантов, ГраницаЭлементаУправления.Право);
		ЭлементыФормы.ПанельПользователя.УстановитьПривязку(ГраницаЭлементаУправления.Лево, ЭлементыФормы.Разделитель, ГраницаЭлементаУправления.Право);
		ЭлементыФормы.Разделитель.Лево            = ФормаОтчета.Ширина - ШиринаПанели - 7 - 8; // 330 - 323   513
		ЭлементыФормы.Результат.Ширина            = ФормаОтчета.Ширина - 16 - 7 - ШиринаПанели;
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеОтображениемПанелиВариантов(ФормаОтчета) Экспорт
	
	ЭлементыФормы = ФормаОтчета.ЭлементыФормы;
	Если ЭлементыФормы.КоманднаяПанельДействияСОтчетом.Кнопки.ПанельВариантов.Пометка Тогда
		ЭлементыФормы.РазделительПанелиВыбораВариантов.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.ПанельВыбораВариантов.Свертка = РежимСверткиЭлементаУправления.Нет;
		ЭлементыФормы.РазделительПанелиВыбораВариантов.УстановитьПривязку(ГраницаЭлементаУправления.Верх);
		ЭлементыФормы.ПанельВыбораВариантов.УстановитьПривязку(ГраницаЭлементаУправления.Низ, ЭлементыФормы.РазделительПанелиВыбораВариантов, ГраницаЭлементаУправления.Верх);
		ЭлементыФормы.Сформировать.Высота = ЭлементыФормы.Сформировать.Высота - 2;
	Иначе
		ЭлементыФормы.ПанельВыбораВариантов.УстановитьПривязку(ГраницаЭлементаУправления.Низ);
		ЭлементыФормы.РазделительПанелиВыбораВариантов.УстановитьПривязку(ГраницаЭлементаУправления.Верх, ЭлементыФормы.ПанельВыбораВариантов, ГраницаЭлементаУправления.Низ);
		ЭлементыФормы.ПанельВыбораВариантов.Свертка = РежимСверткиЭлементаУправления.Верх;
		ЭлементыФормы.РазделительПанелиВыбораВариантов.Свертка = РежимСверткиЭлементаУправления.Верх;
		ЭлементыФормы.Сформировать.Высота = ЭлементыФормы.Сформировать.Высота + 2;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьИзмененияТабличногоПоля(ЭлементыФормы, Элемент) Экспорт
	
	Если ТипЗнч(Элемент) = Тип("Число") Тогда
		Индекс = Элемент;
	Иначе
		Индекс = Число(Сред(Элемент.Имя, 18, 1));
	КонецЕсли;
	 
	ЭлементТабличноеПоле = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ТабличноеПоле"];
	ЭлементВидСравнения = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ВидСравения"];
	
	// При очистке списка можно смело выставлять вид сравнения в "Не отбирать"
	Если ЭлементТабличноеПоле.Значение.Количество() = 0 И ЭлементВидСравнения.Значение <> "" Тогда
		ЭлементВидСравнения.Значение = "";
	КонецЕсли;
	
	// Если список не пуст, а вид сравнения "Не отбирать", установим вид сравнения в "Только выбранные"
	Если ЭлементТабличноеПоле.Значение.Количество() > 0 И ЭлементВидСравнения.Значение = "" Тогда
		ЭлементВидСравнения.Значение = "Выбранные";
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаНажатияКнопкиПодбор(ОтчетОбъект, ФормаОтчета, Элемент) Экспорт
	
	Параметры = ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект);
	Индекс = Число(Сред(Элемент.Имя, 18, 1));
	СтрокаОтбора = Параметры.Отборы[Индекс];
	ДоступноеПоле = ПолучитьДоступноеПолеПоПолюКомпоновкиДанных(СтрокаОтбора.Поле, ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора);
	МассивТипов = ДоступноеПоле.Тип.Типы();
	
	Если МассивТипов.Количество() > 1 Тогда
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(МассивТипов);
		ВыбранныйТип = ФормаОтчета.ВыбратьИзМеню(СписокТипов);
		Если ВыбранныйТип = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТипПоля = ВыбранныйТип.Значение;
	ИначеЕсли МассивТипов.Количество() = 1 Тогда
		ТипПоля = МассивТипов[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипПоля);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаВыбора = Справочники[ОбъектМетаданных.Имя].ПолучитьФормуВыбора(, ФормаОтчета, "ОтборПо" + Индекс);
	ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

Процедура ОбработкаИзмененияЗначенияДинамическогоОтбора(ЭлементыФормы, Элемент) Экспорт
	
	Индекс = Число(Сред(Элемент.Имя, 18, 1));
	ЭлементФлажок = ЭлементыФормы.Найти("ДинамическийОтбор" + Индекс + "Флажок");
	Если ЭлементФлажок <> Неопределено Тогда
		ЭлементФлажок.Значение = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьСписокВТабличноеПоле(ОтчетОбъект, ЭлементыФормы, Элемент) Экспорт
	
	Параметры = ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект);
	Индекс = Число(Сред(Элемент.Имя, 18, 1));
	СтрокаОтбора = Параметры.Отборы[Индекс];
	ЭлементТабличноеПоле = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ТабличноеПоле"];
	
	Отказ = Ложь;
	Значение = ВосстановитьЗначение("ДинамическиеОтборы_СохраненныеСписки");
	Если Значение = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Список = Значение[СтрокаОтбора.Поле];
	Если Список = Неопределено ИЛИ Список.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Вопрос("Сохраненные списки отсутствуют", РежимДиалогаВопрос.ОК, , , "Загрузка списка");
		Возврат;
	КонецЕсли;
	
	ФормаРаботыСоСпискомЗначений = ПолучитьОбщуюФорму("ФормаРаботыСоСпискомЗначений");
	ФормаРаботыСоСпискомЗначений.СписокЗначений = Список;
	ЭлементСписка = ФормаРаботыСоСпискомЗначений.ОткрытьМодально();
	Если ЭлементСписка <> Неопределено Тогда
		ЭлементТабличноеПоле.Значение.Очистить();
		Для каждого ЭлементСпискаСписка Из ЭлементСписка.Значение Цикл
			НоваяСтрока = ЭлементТабличноеПоле.Значение.Добавить();
			НоваяСтрока.Значение = ЭлементСпискаСписка.Значение;
		КонецЦикла;
	КонецЕсли;
	Список = ФормаРаботыСоСпискомЗначений.СписокЗначений;
	Значение[СтрокаОтбора.Поле] = Список;
	СохранитьЗначение("ДинамическиеОтборы_СохраненныеСписки", Значение);
	ОбновитьИзмененияТабличногоПоля(ЭлементыФормы, Элемент);

КонецПроцедуры

Процедура СохранитьСписокВТабличномПоле(ОтчетОбъект, ЭлементыФормы, Элемент) Экспорт
	
	Параметры = ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект);
	Индекс = Число(Сред(Элемент.Имя, 18, 1));
	СтрокаОтбора = Параметры.Отборы[Индекс];
	ЭлементТабличноеПоле = ЭлементыФормы["ДинамическийОтбор" + Индекс + "ТабличноеПоле"];
	Если ЭлементТабличноеПоле.Значение.Количество() = 0 Тогда
		Вопрос("Список пуст", РежимДиалогаВопрос.ОК);
		Возврат;
	КонецЕсли;
	
	ЗначениеСписка = Новый СписокЗначений;
	ЗначениеСписка.ЗагрузитьЗначения(ЭлементТабличноеПоле.Значение.ВыгрузитьКолонку("Значение"));
	
	НазваниеСписка = Строка(ЗначениеСписка);
	Результат = ВвестиЗначение(НазваниеСписка, "Введите название сохраняемого списка");
	Если Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ВосстановитьЗначение("ДинамическиеОтборы_СохраненныеСписки");
	Если Значение = Неопределено Тогда
		Значение = Новый Соответствие;
	КонецЕсли;
	НовыйСписок = Значение[СтрокаОтбора.Поле];
	Если НовыйСписок = Неопределено Тогда
		НовыйСписок = Новый СписокЗначений;
	КонецЕсли;
	НовыйСписок.Добавить(ЗначениеСписка, НазваниеСписка);
	Значение[СтрокаОтбора.Поле] = НовыйСписок;
	СохранитьЗначение("ДинамическиеОтборы_СохраненныеСписки", Значение);
		
КонецПроцедуры

Процедура ОбработкаВыбораФормыОтчета(ОтчетОбъект, ФормаОтчета, ЗначениеВыбора, Источник) Экспорт
	
	Если ТипЗнч(ЗначениеВыбора) = Тип("СхемаКомпоновкиДанных") Тогда
	
		Если Не ЗаписьОтчетаДоступна(ОтчетОбъект) Тогда
			Предупреждение("Право на изменение отчета имеет только владелец");
			Возврат;
		КонецЕсли;
		
		// Запишем схему компоновки в реквизит
		ОтчетОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(ЗначениеВыбора);
		
		ИнициализироватьКомпоновщикНастроек(ОтчетОбъект, ЗначениеВыбора);
		ФормаОтчета.КомпоновщикНастроекПользователя.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЗначениеВыбора));
 		ОтчетОбъект.ПрименитьНастройку();
		ОбработкаФормыПослеПримененияНастройки(ОтчетОбъект, ФормаОтчета, Истина);
		ФормаОтчета.Модифицированность = Истина;
		
	ИначеЕсли Найти(Источник.КлючУникальности, "ОтборПо") <> 0 тогда
		
		Индекс = Число(Прав(Источник.КлючУникальности, СтрДлина(Источник.КлючУникальности)-7));
		СтрокаТаблицыЗначений = ФормаОтчета.ЭлементыФормы["ДинамическийОтбор" + Индекс + "ТабличноеПоле"].Значение.Добавить();
		СтрокаТаблицыЗначений.Значение = ЗначениеВыбора;
		ОбновитьИзмененияТабличногоПоля(ФормаОтчета.ЭлементыФормы, Индекс);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИдентификаторОбъекта(ОтчетОбъект) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		СсылкаНаОбъект = ?(ОтчетОбъект.ЭтоНовый(), ОтчетОбъект.ПолучитьСсылкуНового(), ОтчетОбъект.Ссылка); 
		Возврат СсылкаНаОбъект;
	Иначе
		Возврат "ОтчетОбъект." + ОтчетОбъект.Метаданные().Имя;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ОтчетОбъект, ФормаОтчета = Неопределено) Экспорт
	
	Если ОтчетОбъект.ЗначенияНастроекПанелиПользователя = Неопределено Тогда
		Если ФормаОтчета <> Неопределено Тогда
			Возврат ПолучитьЗначенияНастроекПанелиПользователя(ОтчетОбъект, ФормаОтчета);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат ОтчетОбъект.ЗначенияНастроекПанелиПользователя.Получить();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрыПанелиПользователяОбъекта(ОтчетОбъект) Экспорт
	
	Если ОтчетОбъект.ПараметрыПанелиПользователя = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОтчетОбъект.ПараметрыПанелиПользователя.Получить();
	КонецЕсли;
	
КонецФункции

Функция ИнициализироватьКомпоновщикНастроек(ОтчетОбъект, Схема = Неопределено, ЗагружатьНастройкиПоУмолчанию = Ложь) Экспорт
	
	Если Не ТиповыеОтчеты.ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Схема = ОтчетОбъект.СхемаКомпоновкиДанных;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема = ОтчетОбъект.СхемаКомпоновкиДанных.Получить();
	КонецЕсли;
	Если Схема = Неопределено Тогда
		// Если схема компоновки еще не редактировалась, создадим новую
		ОтчетОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(Новый СхемаКомпоновкиДанных);
	КонецЕсли;
	
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	
	Если ЗагружатьНастройкиПоУмолчанию Тогда
		// Загрузим настройки по умолчанию
		ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;
	
	Возврат Схема;
	
КонецФункции

Функция ЭтоСтараяВерсияОтчета(ОтчетОбъект) Экспорт
	
//толик	
	//Попытка
	//	Возврат Не ЭтоПроизвольныйОтчет(ОтчетОбъект) И (ОтчетОбъект.НастройкаПериода <> Неопределено);
	//Исключение
		Возврат Не ЭтоПроизвольныйОтчет(ОтчетОбъект) И (ОтчетОбъект.Метаданные().Реквизиты.Найти("НастройкаПериода") <> Неопределено);
	//КонецПопытки
	
	
КонецФункции

Функция ПолучитьСписокТиповыхОтчетов()
	
	СписокОтчетов = Новый СписокЗначений;
	Для каждого Отчет Из Метаданные.Отчеты Цикл
		Если Отчет.Имя <> "ШаблонТиповогоОтчета"
		   И Отчет.Реквизиты.Найти("ПериодОтчета") = Неопределено
		   И Отчет.Реквизиты.Найти("ЗначенияНастроекПанелиПользователя") <> Неопределено Тогда
			СписокОтчетов.Добавить(Отчет.Имя, Отчет.Синоним);
		КонецЕсли;
	КонецЦикла;
	Возврат СписокОтчетов;
	
КонецФункции

Процедура ОбработкаНачалаВыбораОтчета(ОтчетОбъект, Элемент, СтандартнаяОбработка) Экспорт
	
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = Справочники.ПроизвольныеОтчеты.ПолучитьФормуВыбора(, Элемент);
		ФормаВыбора.Открыть();
	Иначе
		СписокОтчетов = ПолучитьСписокТиповыхОтчетов();
		ВыбранныйЭлемент = СписокОтчетов.ВыбратьЭлемент("Выберете отчет");
		Если ВыбранныйЭлемент <> Неопределено Тогда
			Элемент.Значение = ВыбранныйЭлемент.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписьОтчетаДоступна(ОтчетОбъект, ПроверяемаяСохраненнаяНастройка = Неопределено) Экспорт
	
	Если ПроверяемаяСохраненнаяНастройка = Неопределено Тогда
		ПроверяемаяСохраненнаяНастройка = ОтчетОбъект.СохраненнаяНастройка;
	КонецЕсли;
		
	СписокДоступныхНастроек = ТиповыеОтчеты.ПолучитьСписокДоступныхВариантов(ТиповыеОтчеты.ПолучитьИдентификаторОбъекта(ОтчетОбъект), глЗначениеПеременной("глТекущийПользователь"));
	Элемент = СписокДоступныхНастроек.НайтиПоЗначению(ПроверяемаяСохраненнаяНастройка);
	Если ЭтоПроизвольныйОтчет(ОтчетОбъект) Тогда
		Возврат ОтчетОбъект.ЭтоНовый()
			ИЛИ ПроверяемаяСохраненнаяНастройка.Пустая() И ОтчетОбъект.Ссылка.Владелец = глЗначениеПеременной("глТекущийПользователь")
			ИЛИ Элемент <> Неопределено И Элемент.Пометка
			ИЛИ РольДоступна("ПолныеПрава")
			ИЛИ РольДоступна("ПолныеПраваБезЭкономики");//О.Т. Аверсон 17.03.2017 № 335
	Иначе
		Если ПроверяемаяСохраненнаяНастройка.Пустая() Тогда
			// Основную настройку типового отчета сохранять нельзя
			Возврат Ложь;
		Иначе
			Возврат Элемент <> Неопределено И Элемент.Пометка 
		        ИЛИ РольДоступна("ПолныеПрава")
				ИЛИ РольДоступна("ПолныеПраваБезЭкономики"); //О.Т. Аверсон 17.03.2017 № 335
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецЕсли