
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Движения.ПлатежиВФСЗН.Записывать = Истина;
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			ДобавитьСтрокуПлатежиЗадолж(ВыборкаПоШапкеДокумента, Движения.ПлатежиВФСЗН);
			
			ДобавитьСтрокуПлатежиЗадолжБГС(ВыборкаПоШапкеДокумента, Движения.ПлатежиВБелгосстрах);

			
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ПлатежиВФСЗН);
				КонецЕсли;
			КонецЦикла;
			
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисленияБГС(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ПлатежиВБелгосстрах);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Ссылка,
	|	ПлатежиВФСЗН.ПометкаУдаления,
	|	ПлатежиВФСЗН.Номер,
	|	ПлатежиВФСЗН.Дата,
	|	ПлатежиВФСЗН.Проведен,
	|	ПлатежиВФСЗН.Задолженность,
	|	ПлатежиВФСЗН.ЗадолженностьБГС,
	|	ПлатежиВФСЗН.СуммаВзносы1,
	|	ПлатежиВФСЗН.СуммаВзносы2,
	|	ПлатежиВФСЗН.СуммаВзносы3,
	|	ПлатежиВФСЗН.СуммаВзносы4,
	|	ПлатежиВФСЗН.СуммаВзносы5,
	|	ПлатежиВФСЗН.СуммаВзносы6,
	|	ПлатежиВФСЗН.СуммаВзносы7,
	|	ПлатежиВФСЗН.СуммаВзносы8,
	|	ПлатежиВФСЗН.СуммаВзносы9,
	|	ПлатежиВФСЗН.СуммаВзносы10,
	|	ПлатежиВФСЗН.СуммаВзносы11,
	|	ПлатежиВФСЗН.СуммаВзносы12,
	|	ПлатежиВФСЗН.Организация
	|ИЗ
	|	Документ.ПлатежиВФСЗН КАК ПлатежиВФСЗН
	|ГДЕ
	|	ПлатежиВФСЗН.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняются начисления!", Отказ, Заголовок);
	КонецЕсли;
			
КонецПроцедуры // ПроверитьЗаполнениеШапки()

Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
		
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗНПлатежи.Ссылка,
	|	ПлатежиВФСЗНПлатежи.ДатаПл,
	|	ПлатежиВФСЗНПлатежи.СуммаПл,
	|	ПлатежиВФСЗНПлатежи.НомерСтроки
	|ИЗ
	|	Документ.ПлатежиВФСЗН.Платежи КАК ПлатежиВФСЗНПлатежи
	|ГДЕ
	|	ПлатежиВФСЗНПлатежи.Ссылка = &Ссылка";	
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

Функция СформироватьЗапросПоНачисленияБГС(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
		
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежиВФСЗНПлатежи.Ссылка,
	|	ПлатежиВФСЗНПлатежи.ДатаПл,
	|	ПлатежиВФСЗНПлатежи.СуммаПл,
	|	ПлатежиВФСЗНПлатежи.НомерСтроки
	|ИЗ
	|	Документ.ПлатежиВФСЗН.ПлатежиБГС КАК ПлатежиВФСЗНПлатежи
	|ГДЕ
	|	ПлатежиВФСЗНПлатежи.Ссылка = &Ссылка";	
	
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()


Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Платежи"": ";
	
		
	// Дата 
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаПл) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата платежа!", Отказ, Заголовок);
	КонецЕсли;
	
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

Процедура ДобавитьСтрокуПлатежи(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
	Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
	Движение.Дата               = ВыборкаПоНачислениям.ДатаПл;
	Движение.Сумма				= ВыборкаПоНачислениям.СуммаПл;
	Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
	Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Платеж;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры 


Процедура ДобавитьСтрокуПлатежиЗадолж(ВыборкаПоШапкеДокумента, НаборЗаписей)
	ЗапросЗадолженность = Новый Запрос;
	ЗапросЗадолженность.Текст = 
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Период,
	|	ПлатежиВФСЗН.Сумма
	|ИЗ
	|	РегистрНакопления.ПлатежиВФСЗН КАК ПлатежиВФСЗН
	|ГДЕ
	|	ГОД(ПлатежиВФСЗН.Период) = &ПериодГод
	|	И ПлатежиВФСЗН.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВФСЗН.Задолженность)
	|	И ПлатежиВФСЗН.Регистратор <> &Ссылка";
	ЗапросЗадолженность.УстановитьПараметр("ПериодГод", Год(Дата));
	ЗапросЗадолженность.УстановитьПараметр("Ссылка",		Ссылка);
	РезультатЗадолж = ЗапросЗадолженность.Выполнить().Выбрать();
	Если не РезультатЗадолж.Следующий()и ВыборкаПоШапкеДокумента.Задолженность <> 0 Тогда
		Движение = НаборЗаписей.Добавить();
	    Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
		Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
		Движение.Дата               = Дата(Дата(СтрЗаменить((Год(ВыборкаПоШапкеДокумента.Дата))," ","")+"0101000000"));
		Движение.Сумма				= ВыборкаПоШапкеДокумента.Задолженность;
		Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
		Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Задолженность;
	КонецЕсли;  

	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры 

Процедура ДобавитьСтрокуПлатежиЗадолжБГС(ВыборкаПоШапкеДокумента, НаборЗаписей)
	ЗапросЗадолженность = Новый Запрос;
	ЗапросЗадолженность.Текст = 
	"ВЫБРАТЬ
	|	ПлатежиВФСЗН.Период,
	|	ПлатежиВФСЗН.Сумма
	|ИЗ
	|	РегистрНакопления.ПлатежиВБелгосстрах КАК ПлатежиВФСЗН
	|ГДЕ
	|	ГОД(ПлатежиВФСЗН.Период) = &ПериодГод
	|	И ПлатежиВФСЗН.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВФСЗН.Задолженность)
	|	И ПлатежиВФСЗН.Регистратор <> &Ссылка";
	ЗапросЗадолженность.УстановитьПараметр("ПериодГод", Год(Дата));
	ЗапросЗадолженность.УстановитьПараметр("Ссылка",		Ссылка);
	РезультатЗадолж = ЗапросЗадолженность.Выполнить().Выбрать();
	Если не РезультатЗадолж.Следующий()и ВыборкаПоШапкеДокумента.Задолженность <> 0 Тогда
		Движение = НаборЗаписей.Добавить();
	    Движение.Регистратор        = ВыборкаПоШапкеДокумента.Ссылка;
		Движение.Период             = ВыборкаПоШапкеДокумента.Дата;
		Движение.Дата               = Дата(Дата(СтрЗаменить((Год(ВыборкаПоШапкеДокумента.Дата))," ","")+"0101000000"));
		Движение.Сумма				= ВыборкаПоШапкеДокумента.ЗадолженностьБГС;
		Движение.Организация		= ВыборкаПоШапкеДокумента.Организация;
		Движение.Вид	            =  Перечисления.ВидыПлатежейВФСЗН.Задолженность;
	КонецЕсли;  

	Попытка
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки; 
	
КонецПроцедуры 


