//Островская Татьяна 20.11.2013 № 16927
Процедура СформироватьПодменюМакеты(ЭтотОбъект, ЭлементыФормы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	| ПечатныеФормыWord.Код,
	| ПечатныеФормыWord.Наименование
	|ИЗ
	| Справочник.ПечатныеФормыWord КАК ПечатныеФормыWord
	|ГДЕ
	| ПечатныеФормыWord.ИмяМетоданных = &ИмяМетоданных
	| И ПечатныеФормыWord.ТипМетаданных = &ТипМетаданных";

	ИмяТаблицыОбъекта = "";
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Документ");
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Справочник");
	ИначеЕсли Метаданные.Отчеты.Содержит(МетаданныеОбъекта) Тогда
		Запрос.УстановитьПараметр("ТипМетаданных", "Отчет");
	Иначе
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИмяМетоданных", МетаданныеОбъекта.Имя);
	ВыборкаWord = Запрос.Выполнить().Выбрать();
	Если ВыборкаWord.Количество() Тогда
		КнопкаПодменю = ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Вставить(0, "ПодменюМакеты", ТипКнопкиКоманднойПанели.Подменю, "Макеты");
		КнопкаПодменю.Текст = "Печатные формы";
		КнопкаПодменю.Картинка = БиблиотекаКартинок.Печать;
		КнопкаПодменю.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
		КнопкаПодменю.Кнопки.Добавить();
		Если ВыборкаWord.Количество() Тогда
			ДействиеПечать = Новый Действие("ДействиеПолучитьДинамическийМакетWord");
			Пока ВыборкаWord.Следующий() Цикл
				КнопкаПодменю.Кнопки.Добавить("Имя" + ВыборкаWord.Код, ТипКнопкиКоманднойПанели.Действие, ВыборкаWord.Наименование, ДействиеПечать);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры




