/////////////////////////////////////////////////////////////////////////////////
// БазоваяФункциональность
//

// Возвращает структуру параметров, необходимых для работы клиентского кода
// конфигурации. 
//
// Не предназначена для прямого вызова из клиентского кода. 
// Вместо нее следует использовать одноименную функцию из 
// модуля СтандартныеПодсистемыКлиентПовтИсп.
//
// Реализация:
//   Для установки параметров работы клиента можно использовать шаблон:
//
//     Параметры.Вставить(<ИмяПараметра>, <код получения значения параметра>);
//
// Возвращаемое значение:
//   Структура - структура параметров работы клиента.
//
Функция ПараметрыРаботыКлиента() Экспорт
	
	Параметры = Новый Структура();
	
	ПользователюРазрешенЗапускКонфигурации = ПользователюРазрешенЗапускКонфигурации();
	Параметры.Вставить("ПользователюРазрешенЗапускКонфигурации", ПользователюРазрешенЗапускКонфигурации);

	Если НЕ ПользователюРазрешенЗапускКонфигурации Тогда
		// Дальше нет необходимости выполнения, т.к. могут быть ошибки нарушения прав
		Возврат Параметры;
	КонецЕсли; 
	
	Параметры.Вставить("ТекущийПользователь", Строка(ПараметрыСеанса.ТекущийПользователь));
	
	// СтандартныеПодсистемы
	ДобавитьПараметрыРаботыКлиентскойЛогикиСтандартныхПодсистем(Параметры);
	// Конец СтандартныеПодсистемы
	
	Возврат Новый ФиксированнаяСтруктура(Параметры);
	
КонецФункции

// Заполняет структуру параметров, необходимых для работы клиентского кода
// конфигурации. 
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ДобавитьПараметрыРаботыКлиентскойЛогикиСтандартныхПодсистем(Параметры) 
	
	// БазоваяФункциональность
	СтандартныеПодсистемыСервер.ДобавитьПараметрыРаботыКлиента(Параметры);
	// Конец БазоваяФункциональность
	
	//// ЗавершениеРаботыПользователей
	//Параметры.Вставить("ПараметрыБлокировкиСеансов", Новый ФиксированнаяСтруктура(СоединенияИБ.ПараметрыБлокировкиСеансов()));
	//// Конец ЗавершениеРаботыПользователей
	//
	//// ОбновлениеИнформационнойБазы
	//Параметры.Вставить("ПервыйЗапуск", Ложь);
	//// Конец ОбновлениеИнформационнойБазы
	//
	//// ОбновлениеКонфигурации
	//Параметры.Вставить("НастройкиОбновления", 
	//	Новый ФиксированнаяСтруктура(ОбновлениеКонфигурации.ПолучитьНастройкиОбновления()));
	//// Конец ОбновлениеКонфигурации
	//
	//// ПроверкаЛегальностиПолученияОбновлений
	//Параметры.Вставить("ЭтоГлавныйУзел", ПланыОбмена.ГлавныйУзел() = Неопределено);
	//// Конец ПроверкаЛегальностиПолученияОбновлений
	//
	//// ПолучениеФайловИзИнтернета
	//Параметры.Вставить("НастройкиПроксиСервера", ПолучениеФайловИзИнтернета.ПолучитьНастройкуПроксиСервера());
	//// Конец ПолучениеФайловИзИнтернета
	//
	//// РегламентныеЗадания
	//Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
	//	Параметры.Вставить("ПараметрыЗапускаОтдельногоСеансаВыполненияРегламентныхЗаданий", 
	//		Новый ФиксированнаяСтруктура(РегламентныеЗаданияСервер.ПараметрыЗапускаОтдельногоСеансаВыполненияРегламентныхЗаданий(Истина)));
	//КонецЕсли;
	//// Конец РегламентныеЗадания
	//
	//// НапоминанияПользователя
	//Параметры.Вставить("НастройкиНапоминаний", 
	//	Новый ФиксированнаяСтруктура(НапоминанияПользователяСервер.ПолучитьНастройкиНапоминаний()));
	//// Конец НапомианияПользователя
	//
	//// ФайловыеФункции
	//Параметры.Вставить("ПерсональныеНастройкиРаботыСФайлами",
	//	Новый ФиксированнаяСтруктура(ФайловыеФункцииПереопределяемый.ПолучитьПерсональныеНастройкиРаботыСФайлами()));
	//// Конец ФайловыеФункции
	//
	//// ЭлектроннаяЦифроваяПодпись
	//Параметры.Вставить("ПерсональныеНастройкиРаботыСЭЦП",
	//	Новый ФиксированнаяСтруктура(ЭлектроннаяЦифроваяПодпись.ПолучитьПерсональныеНастройкиРаботыСЭЦПСервер()));
	//// Конец ЭлектроннаяЦифроваяПодпись
	
КонецПроцедуры

Функция ПользователюРазрешенЗапускКонфигурации() Экспорт
	
	Если НЕ РольДоступна("Пользователь")
		И (НЕ РольДоступна("ПолныеПрава")) 
		И (НЕ РольДоступна("ПолныеПраваБезЭкономики"))Тогда //О.Т. Аверсон 17.03.2017 № 335
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Записать настройку подтверждения завершения работы программы
// для текущего пользователя.
// 
// Параметры:
//   Значение - Булево   - значение настройки.
// 
Процедура СохранитьНастройкуПодтвержденияПриЗавершенииПрограммы(Значение) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбщиеНастройкиПользователя", "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", Значение);
	
КонецПроцедуры
