////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток, мНаборЗаписей;
Перем СоответствиеВалютныеСпособыРасчета;
Перем ТЗНовыхМТСБобруйск; //Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1)

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		// Получить экземпляр документа на печать
		Если Лев(ИмяМакета,3) = "Т5_" Тогда
			ТабДокумент = ПечатьТ5(ИмяМакета);
			
		ИначеЕсли Лев(ИмяМакета,3) = "Т5а" тогда
			ТабДокумент = ПечатьТ5а(ИмяМакета); 
		//СВЭЙ СВФР-015593 СОА 25.04.2025(	
		ИначеЕсли ИмяМакета = "ПриказОКадровомПеремещении" Тогда
			
			ТабДокумент = ПечатьПриказОКадровомПеремещении("ВсеСотрудники");
		//СВЭЙ СВФР-015593 СОА 25.04.2025	
		КонецЕсли;
		
		Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Кадровое перемещение "));
		
	КонецФункции // Печать()
	
	// Возвращает доступные варианты печати документа
	//
	// Вовращаемое значение:
	//  Струткура, каждая строка которой соответствует одному из вариантов печати
	//  
	Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
		
		СтруктураМакетов = Новый Структура;
		
		СтруктураМакетов.Вставить("Т5а_от_5_1_2004",	"Форма Т-5а");
		СтруктураМакетов.Вставить("Т5_от_5_1_2004",		"Форма Т-5");
		//СВЭЙ СВФР-015593 СОА 25.04.2025(
		СтруктураМакетов.Вставить("ПриказОКадровомПеремещении", "Приказ о кадровом перемещении");
		//СВЭЙ СВФР-015593 СОА 25.04.2025 )
		Возврат СтруктураМакетов;
		
	КонецФункции // ПолучитьСтруктуруПечатныхФорм()
	
#КонецЕсли

Процедура ДобавитьСтрокиНачисленийПоРаботнику(Сотрудник, ДатаАктуальности = Неопределено,ТЧРаботники = Неопределено) Экспорт //О.Т. 03.02.2015 № 17845
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = Дата
	КонецЕсли;
	
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
	ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
	
	ЗапросНачисления.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель2Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель2
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель3Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель3
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель4Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель4
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд1Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд1
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд2Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд2
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд3Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд3
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд4Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд4
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта1Завершения
	|		ИНАЧЕ Начисления.Валюта1
	|	КОНЕЦ КАК Валюта1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта2Завершения
	|		ИНАЧЕ Начисления.Валюта2
	|	КОНЕЦ КАК Валюта2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта3Завершения
	|		ИНАЧЕ Начисления.Валюта3
	|	КОНЕЦ КАК Валюта3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта4Завершения
	|		ИНАЧЕ Начисления.Валюта4
	|	КОНЕЦ КАК Валюта4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель1ВВалютеЗавершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель1ВВалюте
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель1ВВалюте //О.Т. Аверсон 13.04.2016 № 1041
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|			&Период,
	|			Сотрудник В (&Сотрудник)
	|				И ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
	|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|				И Регистратор <> &Регистратор) КАК Начисления
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Начисления.ПериодЗавершения <= &Период
	|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА Начисления.ДействиеЗавершения
	|			ИНАЧЕ Начисления.Действие
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = ЗапросНачисления.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета");
	
	Пока Выборка.Следующий() Цикл
		//О.Т. 26.01.2015 № 17845
		если ЗначениеЗаполнено(ТЧРаботники) Тогда 
			МассивРаботники = ТЧРаботники.НайтиСтроки(Новый Структура("Сотрудник",Выборка.Сотрудник));
			для Каждого стрРаб из МассивРаботники Цикл 
				ТекСтрокаРаботники = стрРаб;
			КонецЦикла;
		КонецЕсли;
		//О.Т. 26.01.2015 № 17845
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,Выборка);
		
		//О.Т. 26.01.2015 № 17845
		Округление1 = Константы.ОкруглениеЧасовойТС.Получить();
		если Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
			ЗначениеОкругления = 0;
		ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
			ЗначениеОкругления = 1;
		ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
			ЗначениеОкругления = 2;
		ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
			ЗначениеОкругления = 3;
		ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
			ЗначениеОкругления = 4;
		иначе
			ЗначениеОкругления = 0;
		КонецЕсли;
		
		мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
		если СтрОсновныеНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой Тогда 
			//О.Т. Аверсон 05.02.2018 № 1547
			мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Дата,
			Новый Структура("Организация, Сотрудник", Организация, Выборка.Сотрудник));
			Если ЗначениеЗаполнено(мСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),мСтрока.ГрафикРаботы));
				Если ЧасовВГоду.Размер = 0 Тогда 
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
					Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
				КонецЕсли;
				
			иначе
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
			КонецЕсли;
			если не ТекСтрокаРаботники = Неопределено Тогда 
				Если мНеобходимоВыделятьКонтракт Тогда
					Тариф = ТекСтрокаРаботники.ТарифныйСПовышениемПоИнструкции;
					ТарифВВалюте = ТекСтрокаРаботники.ОкладСПовышениемВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				Иначе
					Тариф = ТекСтрокаРаботники.МесячнаяТарифнаяСтавка;
					ТарифВВалюте = ТекСтрокаРаботники.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				КонецЕсли;
				ЗанимаемыхСтавок = ТекСтрокаРаботники.ЗанимаемыхСтавок;
				Если ЧасовВГоду.Размер <> 0 тогда
					//временное перемещение
					Если ТекСтрокаРаботники.Временно Тогда
						мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(ТекСтрокаРаботники.ДатаНачала - 86400,
						Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, ТекСтрокаРаботники.Сотрудник, Неопределено));
						СтрОсновныеНачисления.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
						СтрОсновныеНачисления.Показатель3 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						СтрОсновныеНачисления.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель3 = 0;
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					СтрОсновныеНачисления.Показатель2 = ТекСтрокаРаботники.ПроцентПоКонтракту;
					СтрОсновныеНачисления.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//О.Т. 26.01.2015 № 17845
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокиНачисленийПоРаботнику()

// простовляет в табличную часть КоэфПовышенияТО данные по Сторуднику
Процедура ДобавитьСтрокиКоэфПовышенияТО(Сотрудники, ДатаАктуальности = Неопределено,КорректКоэфф) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоэфПовышенияТОСрезПоследних.Сотрудник,
	|	КоэфПовышенияТОСрезПоследних.Коэффициент,
	|	КоэфПовышенияТОСрезПоследних.Размер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие
	|ИЗ
	|	РегистрСведений.КоэфПовышенияТО.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК КоэфПовышенияТОСрезПоследних
	|ГДЕ
	|	КоэфПовышенияТОСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, Коэффициент");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = КоэфПовышенияТО.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаКоэф = КоэфПовышенияТО.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКоэф,Выборка);  
		//Островская Татьяна 24.02.2014 № 17141
		Если Выборка.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("корр. коэф") Тогда  
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("КоррКоэф", КорректКоэфф);
			Запрос.УстановитьПараметр("Организация", Организация);
			
			Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КорректирующийКоэффициентСрезПоследних.Размер
			|ИЗ
			|	РегистрСведений.КорректирующийКоэффициент.СрезПоследних(
			|			&Дата,
			|			КорректирующийКоэффициент = &КоррКоэф
			|				И Организация = &Организация) КАК КорректирующийКоэффициентСрезПоследних";
			Результ = Запрос.Выполнить().Выбрать();
			Пока Результ.Следующий() Цикл
				СтрокаКоэф.Размер = Результ.Размер;
			КонецЦикла;
		КонецЕсли;
		//Островская Татьяна 24.02.2014 № 17141
	КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры

Процедура ДобавитьСтрокиКоэфПовышенияТОПриСменеДолжности(Сотрудники, ДатаАктуальности = Неопределено,КорректКоэфф,мСтрокаТабЧасти) Экспорт 
	
	
	ЗапросКоэф = Новый Запрос;
	ЗапросКоэф.Текст = 
	"ВЫБРАТЬ
	|	ЕдинаяТарифнаяСеткаРБКоэффициенты.Коэффициент,
	|	ЕстьNull(ЕдинаяТарифнаяСеткаРБКоэффициенты.КорректКоэффициент.Размер,0) как КорректКоэффициент,
	|	ЕдинаяТарифнаяСеткаРБКоэффициенты.ПовышКоэффициент,
	|	ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентСложность,
	|	ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентТехнологОперации
	|ИЗ
	|	Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдинаяТарифнаяСеткаРБ.Коэффициенты КАК ЕдинаяТарифнаяСеткаРБКоэффициенты
	|		ПО ДолжностиОрганизаций.СтрокаЕТС = ЕдинаяТарифнаяСеткаРБКоэффициенты.Ссылка
	|ГДЕ
	|	ДолжностиОрганизаций.Ссылка = &Ссылка";
	ЗапросКоэф.УстановитьПараметр("Ссылка",мСтрокаТабЧасти.Должность);
	Выборка = ЗапросКоэф.Выполнить().Выбрать();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сотрудник", мСтрокаТабЧасти.Сотрудник);
	НайденныеСтроки = КоэфПовышенияТО.НайтиСтроки(ПараметрыОтбора);
	если НайденныеСтроки.Количество() > 0 Тогда 
		Количество =  НайденныеСтроки.Количество()-1;
		пока Количество  >= 0  цикл
			КоэфПовышенияТО.Удалить(Количество);
			Количество = Количество-1;
		КонецЦикла;
		
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		
		если  Выборка.КорректКоэффициент > 0 Тогда 
			
			мСтрока = КоэфПовышенияТО.Добавить();
			ЗаполнитьЗначенияСвойств(мСтрока, Выборка);
			мСтрока.Сотрудник = мСтрокаТабЧасти.Сотрудник;
			мСтрока.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("корр. коэф");
			мСтрока.Размер = Выборка.КорректКоэффициент;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("КоррКоэф", КорректКоэфф);
			Запрос.УстановитьПараметр("Организация", Организация);
			
			Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КорректирующийКоэффициентСрезПоследних.Размер
			|ИЗ
			|	РегистрСведений.КорректирующийКоэффициент.СрезПоследних(
			|			&Дата,
			|			КорректирующийКоэффициент = &КоррКоэф
			|				И Организация = &Организация) КАК КорректирующийКоэффициентСрезПоследних";
			Результ = Запрос.Выполнить().Выбрать();
			Пока Результ.Следующий() Цикл
				мСтрока.Размер = Результ.Размер;
			КонецЦикла;
			
		КонецЕсли;	
		если  Выборка.ПовышКоэффициент > 0 Тогда 
			мСтрока = КоэфПовышенияТО.Добавить();
			ЗаполнитьЗначенияСвойств(мСтрока, Выборка);
			мСтрока.Сотрудник = мСтрокаТабЧасти.Сотрудник;
			мСтрока.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("Повыш. коэффициент");
			мСтрока.Размер = Выборка.ПовышКоэффициент;
		КонецЕсли;
		если  Выборка.КоэффициентСложность > 0 Тогда 
			мСтрока = КоэфПовышенияТО.Добавить();
			ЗаполнитьЗначенияСвойств(мСтрока, Выборка);
			мСтрока.Сотрудник = мСтрокаТабЧасти.Сотрудник;
			мСтрока.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("ПовышКоэффициентСложность");
			мСтрока.Размер = Выборка.КоэффициентСложность;
			
		КонецЕсли;
		если  Выборка.КоэффициентТехнологОперации > 0 Тогда 
			мСтрока = КоэфПовышенияТО.Добавить();
			ЗаполнитьЗначенияСвойств(мСтрока, Выборка);
			мСтрока.Сотрудник = мСтрокаТабЧасти.Сотрудник;
			мСтрока.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("коэффициент по технологическим видам работ");
			мСтрока.Размер = Выборка.КоэффициентТехнологОперации;
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры


// простовляет в табличную часть ПовышенияПоИнструкции данные по Сторуднику
Процедура ДобавитьСтрокиПовышенияПоИнструкции(Сотрудники, ДатаАктуальности = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПовышенияПоИнструкцииСрезПоследних.Сотрудник,
	|	ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
	|	ПовышенияПоИнструкцииСрезПоследних.Размер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие
	|ИЗ
	|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК ПовышенияПоИнструкцииСрезПоследних
	|ГДЕ
	|	ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, Коэффициент");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений =ПовышенияПоИнструкции.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//СВЭЙ 19.02.2024 КВВ СВФР-012329 (
		Если НЕ ЗначениеЗаполнено(Выборка.Коэффициент) И Выборка.Размер = 0 Тогда
			Продолжить;
		КонецЕсли;
		//СВЭЙ 19.02.2024 КВВ СВФР-012329 )
		
		ЗаполнитьЗначенияСвойств(ПовышенияПоИнструкции.Добавить(),Выборка);
	КонецЦикла;	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	Дата);
	
	Если Режим = "ПоРеквизитамДокумента" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	КадровоеПеремещениеОрганизаций.Номер КАК НомерДок,
		|	КадровоеПеремещениеОрганизаций.Дата КАК ДатаДок,
		|	ВЫРАЗИТЬ(КадровоеПеремещениеОрганизаций.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
		|	КадровоеПеремещениеОрганизаций.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
		|	КадровоеПеремещениеОрганизаций.Организация.Префикс,
		|	КадровоеПеремещениеОрганизаций.НомерД,
		|	КадровоеПеремещениеОрганизаций.НомерПриказа,
		|	КадровоеПеремещениеОрганизаций.ДатаПриказа
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель)
		|			И КадровоеПеремещениеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	КадровоеПеремещениеОрганизаций.Ссылка = &ДокументСсылка";
		
	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
		
		Запрос.УстановитьПараметр("РеглВалюта",	Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
		Запрос.УстановитьПараметр("Прием",		Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.ДатаНачала,
		|	Док.ДатаОкончания,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, Док.Сотрудник.Наименование) КАК Работник,
		|	ЕСТЬNULL(Док.Сотрудник.ДатаДоговора, &ПустаяДата) КАК ТрудовойДоговорДата,
		|	ЕСТЬNULL(Док.Сотрудник.НомерДоговора, """") КАК ТрудовойДоговорНомер,
		|	ВЫБОР
		|		КОГДА Док.Сотрудник.НомерДоговора ЕСТЬ NULL
		|			ТОГДА Док.ОснованиеПеремещения
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОснованиеПеремещения,
		|	Док.НомерСтроки КАК НомерСтроки,
		|	Док.ПодразделениеОрганизации.Наименование КАК НовоеПодразделение,
		|	Док.Должность.Наименование КАК НоваяДолжность,
		|	ВЫБОР
		|		КОГДА Работники.ПериодЗавершения <= Док.ДатаНачала
		|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Работники.ПодразделениеОрганизацииЗавершенияНаименование
		|		ИНАЧЕ Работники.ПодразделениеОрганизацииНаименование
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА Работники.ПериодЗавершения <= Док.ДатаНачала
		|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Работники.ДолжностьЗавершенияНаименование
		|		ИНАЧЕ Работники.ДолжностьНаименование
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Начисления.Валюта1, &РеглВалюта) = &РеглВалюта
		|			ТОГДА """"
		|		ИНАЧЕ Начисления.Валюта1.Наименование
		|	КОНЕЦ КАК ВалютаТарифнойСтавки,
		|	ЕСТЬNULL(Начисления.Показатель1, 0) КАК ОкладТарифнаяСтавка,
		|	Работники.Сотрудник.Код КАК ТабельныйНомер,
		|	Док.РазрядЕТС,
		|	Док.ФизЛицо
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|			РаботникиОрганизации.Должность.Наименование КАК ДолжностьНаименование,
		|			РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование КАК ПодразделениеОрганизацииЗавершенияНаименование,
		|			РаботникиОрганизации.ДолжностьЗавершения.Наименование КАК ДолжностьЗавершенияНаименование,
		|			РаботникиОрганизации.ПериодЗавершения КАК ПериодЗавершения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Док
		|					ПО РаботникиВнутри.Период < Док.ДатаНачала
		|						И РаботникиВнутри.Сотрудник = Док.Сотрудник
		|			ГДЕ
		|				Док.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиВнутри.Сотрудник) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период
		|					И СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник) КАК Работники
		|		ПО Док.Сотрудник = Работники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.ОсновныеНачисления КАК Начисления
		|		ПО Док.Ссылка = Начисления.Ссылка
		|			И (Начисления.ВидРасчета.ЗачетОтработанногоВремени)
		|			И (Начисления.ВидРасчета.ЗачетНормыВремени)
		|			И Док.Сотрудник = Начисления.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|				&ДатаДокумента,
		|				ФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						КадровоеПеремещениеОрганизацииРаботники.Сотрудник.Физлицо
		|					ИЗ
		|						Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацииРаботники
		|					ГДЕ
		|						КадровоеПеремещениеОрганизацииРаботники.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
		|		ПО Док.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	Док.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()

#Если Клиент Тогда
	
	// Функция формирует табличный документ с печатной формой "Т-5а",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьТ5а(ИмяМакета)
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещениеОрганизации_Т5а";
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// получаем данные для печати
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		// запоминаем области макета
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
		ПовторятьПриПечатиСтроки = Макет.ПолучитьОбласть("ПовторятьПриПечати"); // повторяющаяся шапка страницы
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРаботник"); // строка работника
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакета);
		
		// выводим данные о руководителях организации
		Если ВыборкаДляШапки.Следующий() Тогда
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
			ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки);// Для подвала.
		КонецЕсли;
		
		// Начинаем формировать выходной документ
		ТабДокумент.Вывести(ОбластьМакетаШапка); // Шапка документа.
		
		ВыведеноСтрок = 0;
		// выводим строки по работникам
		Пока ВыборкаРаботники.Следующий() Цикл
			
			// Данные по работнику.
			ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
			Если ЗначениеЗаполнено(ВыборкаРаботники.ВалютаТарифнойСтавки) Тогда
				Если Дата >=Дата(2016,07,1) тогда
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					ОбластьМакета.Параметры.ОкладТарифнаяСтавка = "" + Формат(ВыборкаРаботники.ОкладТарифнаяСтавка,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления)+"; ЧН=' '") + Символы.ПС + "(" + ВыборкаРаботники.ВалютаТарифнойСтавки +")";
				иначе
					ОбластьМакета.Параметры.ОкладТарифнаяСтавка = "" + Формат(ВыборкаРаботники.ОкладТарифнаяСтавка,"ЧЦ=15; ЧДЦ=2; ЧН=' '") + Символы.ПС + "(" + ВыборкаРаботники.ВалютаТарифнойСтавки +")";
				КонецЕсли;
			КонецЕсли;
			
			//уберем из табельного номера префикс
			ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ПовторятьПриПечатиСтроки);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ИмяМакета = "Т5а_от_5_1_2004" И ЗначениеЗаполнено(ВыборкаРаботники.ОснованиеПеремещения) Тогда
				ВысотаДока = ТабДокумент.ВысотаТаблицы;
				ОбластьДокумента = ТабДокумент.Область(ВысотаДока,14,ВысотаДока,17);
				ОбластьДокумента.Объединить();
				ОбластьДокумента.Текст = ВыборкаРаботники.ОснованиеПеремещения;
			КонецЕсли;
			
		КонецЦикла;
		
		// если не было ни одного работника - выводим пустой бланк
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакета);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакета.Параметры.Количество() Цикл
			ОбластьМакета.Параметры.Установить(Сч - 1,"");
		КонецЦикла;
		ОбластьМакета.Параметры.Работник = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		// выводим предварительно подготовленный Подвал документа.
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ5а()
	
	// Функция формирует табличный документ с печатной формой "Т-5",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьТ5(ИмяМакета)
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещениеОрганизации_Т5";
		
		// получаем данные для печати
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
		
		// запоминаем области макета
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); // Подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Работник"); // строка работника
		
		// выводим данные о руководителях организации
		Если ВыборкаДляШапки.Следующий() Тогда
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
			ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки); // Для подвала.
			НомерДокДляПечати	= ВыборкаДляШапки.НомерДок;
		КонецЕсли;
		
		// Начинаем формировать выходной документ
		Пока ВыборкаРаботники.Следующий() Цикл
			
			// Каждый приказ на отдельной странице.
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			// Шапка документа.
			Если РаботникиОрганизации.Количество() > 1 Тогда
				ОбластьМакетаШапка.Параметры.НомерДок = НомерДокДляПечати + "/" + ВыборкаРаботники.НомерСтроки;
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			// Данные по работнику.
			ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
			
			//уберем из табельного номера префикс
			//толик
			Попытка
				ОбластьМакета.Параметры.ТабельныйНомер = ВыборкаРаботники.ТабельныйНомер;
			Исключение
			КонецПопытки;
			
			Если ЗначениеЗаполнено(ВыборкаРаботники.ДатаОкончания) Тогда
				ОбластьМакета.Параметры.ВидПеревода = "временно";
				
			Иначе
				ОбластьМакета.Параметры.ВидПеревода = "постоянно";
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.ОкладЦелаяЧасть = "" + Цел(ВыборкаРаботники.ОкладТарифнаяСтавка) 
			+ ?(ЗначениеЗаполнено(ВыборкаРаботники.ВалютаТарифнойСтавки)," (" + ВыборкаРаботники.ВалютаТарифнойСтавки+")","");
			
			ДробнаяЧасть = ВыборкаРаботники.ОкладТарифнаяСтавка - Цел(ВыборкаРаботники.ОкладТарифнаяСтавка);
			ОбластьМакета.Параметры.ОкладДробнаяЧасть = ?(ДробнаяЧасть = 0, "00", ДробнаяЧасть*100); 
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Подвал документа.
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
			
		КонецЦикла;
		
		// если не было ни одного работника - выводим пустой бланк
		Если ТабДокумент.ВысотаТаблицы = 0 Тогда
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			ТабДокумент.Вывести(ОбластьМакета);
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
		КонецЕсли;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ5()

	//СВЭЙ СВФР-015593 СОА 25.04.2025(
	
	// Функция формирует табличный документ с печатной формой "ПечатьПриказОКадровомПеремещении",
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриказОКадровомПеремещении(ВидПечатнойФормы)
	Если ВидПечатнойФормы = "ОдинСотрудник" Тогда
		Форма = ПолучитьФорму("ФормаДокумента");
		Форма.Активизировать();
		ФизЛицо = Форма.ЭлементыФормы.РаботникиОрганизации.ТекущаяСтрока.ФизЛицо;
    Иначе
		Физлицо = Неопределено;
	КонецЕсли;	
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьПриказОКадровомПеремещении";
	
	// получаем данные для печати 
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
		|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
		|	Организации.Наименование,
		|	ОрганизацииОтветственныеЛица.Дата КАК Дата,
		|	ОрганизацииОтветственныеЛица.Должность
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И Организации.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Руководитель = Результат.Сотрудник; 
			ДолжностьРуководителя = Результат.Должность;
		КонецЦикла;
		Если не Руководитель = Неопределено Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФИОФизЛиц.Фамилия,
			|	ФИОФизЛиц.Имя,
			|	ФИОФизЛиц.Отчество,
			|	ФИОФизЛиц.ФизЛицо
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
			|ГДЕ
			|	ФИОФизЛиц.ФизЛицо = &ФизЛицо";
			
			Запрос.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
			
			Результат1 = Запрос.Выполнить().Выбрать();
			Пока Результат1.Следующий() цикл
				Фамилия = Результат1.Фамилия;
				Имя = Лев(Результат1.Имя,1);
				Отчество = Лев(Результат1.Отчество,1);
				ФИО = Имя+"."+Отчество+"."+ " "+Фамилия;
			КонецЦикла;
		КонецЕсли; 
	ЗапросСклонения = Новый Запрос;
	ЗапросСклонения.Текст = 
	"ВЫБРАТЬ
	|	Склонение.Значение
	|ИЗ
	|	РегистрСведений.Склонение КАК Склонение
	|ГДЕ
	|	Склонение.Объект = &Объект
	|	И Склонение.Падеж = &Падеж";
	
	ЗапросСклонения.УстановитьПараметр("Падеж", Перечисления.Падеж.Родительный);
	
	ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	// запоминаем области макета
	Макет = ПолучитьМакет("ПриказОКадровомПеремещении");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
	ОбластьМакетаРуководитель = Макет.ПолучитьОбласть("Руководитель"); 	
	ОбластьМакетаФизлицо = Макет.ПолучитьОбласть("Физлицо"); 	
	ОбластьМакетаДата = Макет.ПолучитьОбласть("Дата"); 	

	// выводим данные о руководителях организации
	Если ВыборкаДляШапки.Следующий() Тогда
		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
		ОбластьМакетаРуководитель.Параметры.Заполнить(ВыборкаДляШапки); 
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Работник"); 
	
	НомерДокДляПечати = ВыборкаДляШапки.НомерПриказа;
	ДатаНаПечать = Формат(ВыборкаДляШапки.ДатаПриказа, "ДФ='дд ММММ гггг'"); 
	
	
	                                                                  
	ОбластьМакетаШапка.Параметры.ДатаПриказа = ДатаНаПечать; 
	ОбластьМакетаШапка.Параметры.НомерПриказа = НомерДокДляПечати; 
	ОбластьМакетаШапка.Параметры.НаселенныйПункт = "г.Минск"; 
	
	Если ВыборкаРаботники.Количество() > 1 Тогда
		ОбластьМакетаШапка.Параметры.ФизлицоСокращено = ".";
		ТабДокумент.Вывести(ОбластьМакетаШапка);
	КонецЕсли;	
		
	ОбластьМакетаДата.Параметры.ДатаДок = ДатаНаПечать; 
	
	МассивФизлиц = Новый Массив();
	
	КоличествоСтрок = ВыборкаРаботники.Количество();
	
	// Начинаем формировать выходной документ
	Пока ВыборкаРаботники.Следующий() Цикл
		
		Если Не Физлицо = Неопределено Тогда
			ОбластьМакета.Параметры.НомерСтроки = 1; 
		Иначе	
			ОбластьМакета.Параметры.НомерСтроки = ВыборкаРаботники.НомерСтроки;
		КонецЕсли;	
		
		// Данные по работнику.
		печФизЛицо = ВыборкаРаботники.Физлицо;
		ПолСотрудника = печФизЛицо.Пол;
		
		ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ВыборкаРаботники.Работник,2,ПолСотрудника,,ложь);
		ФразаСклоненнаяДолжностьНовая = ""; 
		ЗапросСклонения.УстановитьПараметр("Объект", ВыборкаРаботники.НоваяДолжность);
		РезультатЗапросаСклонения = ЗапросСклонения.Выполнить();
		Если РезультатЗапросаСклонения.Пустой() Тогда
			УправлениеОтчетами.Просклонять(глСклонение,НРег(ВыборкаРаботники.НоваяДолжность),2,ФразаСклоненнаяДолжностьНовая,,ложь);
		Иначе	
			ВыборкаСклонения = РезультатЗапросаСклонения.Выбрать();
			ВыборкаСклонения.Следующий();
			ФразаСклоненнаяДолжностьНовая = ВыборкаСклонения.Значение;
		КонецЕсли;
		ФразаСклоненнаяДолжностьПрежняя = ""; 
		ЗапросСклонения.УстановитьПараметр("Объект", ВыборкаРаботники.ПрежняяДолжность);
		РезультатЗапросаСклонения = ЗапросСклонения.Выполнить();
		Если РезультатЗапросаСклонения.Пустой() Тогда
			УправлениеОтчетами.Просклонять(глСклонение,НРег(ВыборкаРаботники.ПрежняяДолжность),2,ФразаСклоненнаяДолжностьПрежняя,,ложь);
		Иначе	
			ВыборкаСклонения = РезультатЗапросаСклонения.Выбрать();
			ВыборкаСклонения.Следующий();
			ФразаСклоненнаяДолжностьПрежняя = ВыборкаСклонения.Значение;
		КонецЕсли;
		ОбластьМакета.Параметры.Работник             = УправлениеОтчетами.CклонятьФИО(глСклонение,ВыборкаРаботники.Работник,4,ПолСотрудника,,ложь);;
		ОбластьМакета.Параметры.ПрежняяДолжность     = ФразаСклоненнаяДолжностьПрежняя; 
		ОбластьМакета.Параметры.ПрежнееПодразделение = НРег(ВыборкаРаботники.ПрежнееПодразделение); 
		ОбластьМакета.Параметры.ДатаНачала           = НРег(ВыборкаРаботники.ДатаНачала); 
		ОбластьМакета.Параметры.НоваяДолжность       = ФразаСклоненнаяДолжностьНовая;
		ОбластьМакета.Параметры.НовоеПодразделение   = НРег(ВыборкаРаботники.НовоеПодразделение);
		Если НЕ ВыборкаРаботники = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
			печВидРасчета       = "оклад";	
		Иначе	
			печВидРасчета       = НРег(ВыборкаРаботники.СпособРасчета);			
		КонецЕсли;
		ОбластьМакета.Параметры.ВидРасчета           = печВидРасчета; 
		ОбластьМакета.Параметры.ОкладТарифнаяСтавка  = ВыборкаРаботники.ОкладТарифнаяСтавка;
		ОбластьМакета.Параметры.ФизлицоСокращено     = ФИОСклон;   
		 
		ОбластьМакета.Параметры.ДатаНачала = Формат(ВыборкаРаботники.ДатаНачала, "ДФ= 'дд.ММ.гггг'"); 
		
		Если КоличествоСтрок = 1 Тогда
			
			ОбластьМакета.Параметры.ФизлицоСокращено = ФИОСклон; 
			ТабДокумент.Вывести(ОбластьМакетаШапка);
		
			ТабДокумент.Вывести(ОбластьМакета); 
			ОбластьМакетаРуководитель.Параметры.ДолжностьРуководителя = ДолжностьРуководителя;
			ОбластьМакетаРуководитель.Параметры.ФИОРуководителя =  ФИО;
			ТабДокумент.Вывести(ОбластьМакетаРуководитель); 
			ОбластьМакетаФизлицо.Параметры.ФизлицоСокращено =  ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ВыборкаРаботники.Работник);
			ТабДокумент.Вывести(ОбластьМакетаФизлицо);
			ТабДокумент.Вывести(ОбластьМакетаДата);
			
		Иначе
			ТабДокумент.Вывести(ОбластьМакета);
			МассивФизлиц.Добавить(ВыборкаРаботники.Работник);
			//МассивФизлиц.Добавить(ДанныеФизлица.Представление);
		КонецЕсли;
		
	КонецЦикла;
	Если КоличествоСтрок > 1 Тогда
		ТабДокумент.Вывести(ОбластьМакетаРуководитель);
		
		Для Каждого Элемент Из МассивФизлиц Цикл
			ОбластьМакетаФизлицо.Параметры.ФизлицоСокращено = Элемент; 
			ТабДокумент.Вывести(ОбластьМакетаФизлицо);
		КонецЦикла;
			
		ТабДокумент.Вывести(ОбластьМакетаДата);
	КонецЕсли;
	
	ТабДокумент.Защита              = Ложь;
	ТабДокумент.ТолькоПросмотр      = Ложь;
	
	ТабДокумент.ПолеСверху      = 20;
	ТабДокумент.ПолеСлева       = 30;
	ТабДокумент.ПолеСправа      = 8;
	ТабДокумент.ПолеСнизу       = 20;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьПриказОПриемеНаРаботу()
 //СВЭЙ СВФР-015593 СОА 25.04.2025) 
 
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровоеПеремещениеОрганизаций.Дата,
	|	КадровоеПеремещениеОрганизаций.Организация,
	|	ВЫБОР КОГДА КадровоеПеремещениеОрганизаций.Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА КадровоеПеремещениеОрганизаций.Организация ИНАЧЕ КадровоеПеремещениеОрганизаций.Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация,
	|	КадровоеПеремещениеОрганизаций.Ссылка,
	|	КадровоеПеремещениеОрганизаций.ИндексацияЗаработка
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
	|
	|ГДЕ
	|	КадровоеПеремещениеОрганизаций.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим, ПроверкаШтатногоРасписания, ТЗДатыНачалаРС = Неопределено) //Аверсон ЕАЕ 16.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Аверсон ЕАЕ 16.12.2024 СВФР-014218
	//Гродно
	Если ТЗДатыНачалаРС <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|ТЗ.Сотрудник,
		|ТЗ.ДатаНачалаРС
		|ПОМЕСТИТЬ ВТДатыНачалаРС
		|ИЗ &ТЗ КАК ТЗ
		|"; 
		Запрос.УстановитьПараметр("ТЗ", ТЗДатыНачалаРС);
		Запрос.Выполнить();
	КонецЕсли;
	//Аверсон СВФР-014218
	
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
	СписокСтруктурныхПодразделений.Добавить(Организация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ПустаяДата",						Дата('00010101'));
	Запрос.УстановитьПараметр("Прием",							Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	// Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвиженийКадров": 
	// 1. Выборка "ТЧРаботникиОрганизации": 
	//		Выбираются строки документа.  
	// 2. Выборка "ДанныеПоРаботникиДоНазначения": 
	//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по регистру РаботникиОрганизации на дату ДатаНачала
	//		для выполнения движений и проверки "Работает ли работник на дату перемещения"
	//		(Использует данные выборки "ДатыПоследнихДвиженийРаботников")
	// 3. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки, имеющие пересекающийся период действия
	//
	// Вторая часть запроса - вид строки запроса "КонфликтныйДокумент" - поиск конфликтных документов: 
	// 1. Выборка "ТЧРаботникиОрганизации":
	//		Выбираются строки документа 
	// 2. Выборка "РаботникиОрганизации":
	//		Для каждой строки ТЧРаботникиОрганизации ищем движения по регистру РаботникиОрганизации за период [ДатаНачала, ДатаОкончания]
	
	//толик - добавил временно
	
	Если ПроверкаШтатногоРасписания Тогда
		
		// определим самую раннюю дату перемещения, чтобы с нее начать расчет остатков штатных единиц
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(КадровоеПеремещениеОрганизацииРаботникиОрганизации.ДатаНачала) КАК ДатаНачала
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацииРаботникиОрганизации
		|ГДЕ
		|	КадровоеПеремещениеОрганизацииРаботникиОрганизации.Ссылка = &ДокументСсылка
		|	И КадровоеПеремещениеОрганизацииРаботникиОрганизации.ДатаНачала <> &ПустаяДата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаС = ?(ЗначениеЗаполнено(Выборка.ДатаНачала),Выборка.ДатаНачала,Дата)
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала",	ДатаС);
		Запрос.УстановитьПараметр("Приход",		ВидДвиженияНакопления.Приход);
		
		//  Дополнительно используем выборки: 
		// 1. ШтатноеРасписаниеОрганизаций
		//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по регистру ШтатноеРасписаниеОрганизаций на дату ДатаНачала
		//		для проверки наличия ставок в штатном расписании
		//		(Использует данные выборки "ДатыШтатногоРасписания")
		// 2. ЗанятоСтавок
		//		Для каждой строки ТЧРаботникиОрганизации на дату ДатаНачала
		//		подсчитываем количество занятых ставок (с учетом "предшествующих" данных текущего документа)
		//
		//толик		
		ТекстЗапроса = "
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		//|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		//|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		//|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		//|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		//|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		//|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|	ТЧРаботникиОрганизации.Должность КАК Должность,
		//|	ТЧРаботникиОрганизации.РазрядЕТС КАК РазрядЕТС,
		//|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		//|	ТЧРаботникиОрганизации.Категория КАК Категория,
		//|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		//|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		//|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		//|	ТЧРаботникиОрганизации.Временно КАК Временно,
		//|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		//|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		//|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		//|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		//|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		//|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		//|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		//|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		//|	ВЫБОР
		//|		КОГДА НЕ ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		//|	ВЫБОР
		//|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
		//|	КОНЕЦ КАК ПрежнееПодразделение,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение
		//|	КОНЕЦ КАК ПрежняяОрганизация,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
		//|	КОНЕЦ КАК ПрежняяДолжность,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
		//|	КОНЕЦ КАК ПрежняяСтавка,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
		//|	КОНЕЦ КАК ПрежнийГрафикРаботы,
		//|	ВЫБОР
		//|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		//|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения
		//|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Период
		//|	КОНЕЦ КАК ДатаПоследнегоДвиженияПоРаботнику,
		//|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		//|	NULL КАК КонфликтныйДокумент,
		//|	ВЫБОР
		//|		КОГДА ТЧРаботникиОрганизации.Сотрудник.НомерДоговора ЕСТЬ НЕ NULL 
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ТрудовойДоговорПрисутствует,
		//|	СвободноСтавокНаДатуПриема.ОстатокСтавок КАК ОстатокСтавок,
		//|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		//|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		//|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		//|	ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ПрежнийТарифнаяСтавкаПервогоРазряда,
		//|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК ПрежнийУсловияТрудаИзмерение,
		//|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		//|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		//|	ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ПрежнийВидДеятельностиИзмерение,
		//|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638 
		//|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		//|	ТЧРаботникиОрганизации.ОкладВВалюте,
		//|	ТЧРаботникиОрганизации.Валюта,
		//|	ТЧРаботникиОрганизации.СуммаВВалюте,
		//|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		//|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		//|	ТЧРаботникиОрганизации.ДляПечати, //О.Т. Аверсон 13.04.2016 № 1041
		//|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004418
		//|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		//|ИЗ
		//|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		//|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		//|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		//|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		//|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		//|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		//|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения КАК ЗанимаемыхСтавокЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения КАК ОбособленноеПодразделениеЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения КАК ПодразделениеОрганизацииЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения КАК ДолжностьЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ПериодЗавершения КАК ПериодЗавершения,
		//|			ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ТарифнаяСтавкаПервогоРазряда,
		//|			ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение,
		//|			ДанныеПоРаботникуДоНазначения.ТипРаботника КАК ТипРаботника,
		//|			ДанныеПоРаботникуДоНазначения.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		//|			ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ВидДеятельностиИзмерение
		//|		ИЗ
		//|			(ВЫБРАТЬ
		//|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		//|				МАКСИМУМ(Работники.Период) КАК Период,
		//|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник
		//|			ИЗ
		//|				Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		//|					ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		//|						И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		//|			ГДЕ
		//|				ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				ТЧРаботникиОрганизации.НомерСтроки,
		//|				ТЧРаботникиОрганизации.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
		//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		//|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		//|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		//|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		//|		ИЗ
		//|			Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		//|				ПО (ТЧРаботникиОрганизации2.Ссылка = ТЧРаботникиОрганизации.Ссылка)
		//|					И ТЧРаботникиОрганизации.НомерСтроки < ТЧРаботникиОрганизации2.НомерСтроки
		//|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		//|		ГДЕ
		//|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			МаксимальныеПериодыШР.НомерСтроки КАК НомерСтроки,
		//|			ЕСТЬNULL(ШтатноеРасписание.КоличествоСтавок, 0) - ЕСТЬNULL(Вакансии.КоличествоСтавок, 0) - ЕСТЬNULL(РанееЗанятоСтавок.КоличествоСтавок, 0) + ЕСТЬNULL(ОсвобождаетсяСтавок.КоличествоСтавок, 0) КАК ОстатокСтавок
		//|		ИЗ
		//|			(ВЫБРАТЬ
		//|				Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|				Работники.Должность КАК Должность,
		//|				Работники.НомерСтроки КАК НомерСтроки,
		//|				МАКСИМУМ(ШтатноеРасписание.Период) КАК МаксПериод
		//|			ИЗ
		//|				Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|						ЕСТЬNULL(ШтатноеРасписание.Период, &ДатаНачала) КАК Период,
		//|						Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|						Работники.Должность КАК Должность
		//|					ИЗ
		//|						Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|							ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|								И Работники.Должность = ШтатноеРасписание.Должность
		//|					ГДЕ
		//|						Работники.Ссылка = &ДокументСсылка) КАК ШтатноеРасписание
		//|					ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|						И Работники.Должность = ШтатноеРасписание.Должность
		//|						И Работники.ДатаНачала >= ШтатноеРасписание.Период
		//|			ГДЕ
		//|				Работники.Ссылка = &ДокументСсылка
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				Работники.ПодразделениеОрганизации,
		//|				Работники.НомерСтроки,
		//|				Работники.Должность) КАК МаксимальныеПериодыШР
		//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|				ПО МаксимальныеПериодыШР.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|					И МаксимальныеПериодыШР.Должность = ШтатноеРасписание.Должность
		//|					И МаксимальныеПериодыШР.МаксПериод = ШтатноеРасписание.Период
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					СУММА(ВЫБОР
		//|							КОГДА Вакансии.ВидДвижения = &Приход
		//|								ТОГДА Вакансии.КоличествоСтавок
		//|							ИНАЧЕ -Вакансии.КоличествоСтавок
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеШтатныеЕдиницыОрганизаций КАК Вакансии
		//|						ПО Работники.ПодразделениеОрганизации = Вакансии.ПодразделениеОрганизации
		//|							И Работники.Должность = Вакансии.Должность
		//|							И Работники.ДатаНачала >= Вакансии.Период
		//|							И (Вакансии.Регистратор <> &ДокументСсылка)
		//|				ГДЕ
		//|					Работники.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					Работники.ПодразделениеОрганизации,
		//|					Работники.Должность,
		//|					Работники.НомерСтроки) КАК Вакансии
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = Вакансии.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		//|					СУММА(ВЫБОР
		//|							КОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала <= СтрокиДокумента.ДатаНачала
		//|								ТОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ - ВЫБОР
		//|							КОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания < СтрокиДокумента.ДатаНачала
		//|									И КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания <> &ПустаяДата
		//|									И НЕ КадровоеПеремещениеОрганизацийРаботникиОрганизации.НапомнитьПоЗавершении
		//|								ТОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК СтрокиДокумента
		//|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
		//|						ПО СтрокиДокумента.Ссылка = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка
		//|							И СтрокиДокумента.НомерСтроки <> КадровоеПеремещениеОрганизацийРаботникиОрганизации.НомерСтроки
		//|							И СтрокиДокумента.ПодразделениеОрганизации = КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации
		//|							И СтрокиДокумента.Должность = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность
		//|				ГДЕ
		//|					СтрокиДокумента.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = РанееЗанятоСтавок.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					ИтогоЗанятоПоДолжности.КоличествоСтавок КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|							СУММА(ВЫБОР
		//|									КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|											И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|										ТОГДА РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения
		//|									ИНАЧЕ РаботникиОрганизаций.ЗанимаемыхСтавок
		//|								КОНЕЦ) КАК КоличествоСтавок,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.Должность
		//|							КОНЕЦ КАК Должность,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		//|							КОНЕЦ КАК ПодразделениеОрганизации
		//|						ИЗ
		//|							(ВЫБРАТЬ
		//|								МАКСИМУМ(Работники.Период) КАК Период,
		//|								Работники.Сотрудник КАК Сотрудник,
		//|								ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала
		//|							ИЗ
		//|								Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		//|									ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		//|										И (Работники.Регистратор.Проведен)
		//|										И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		//|							ГДЕ
		//|								ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|							
		//|							СГРУППИРОВАТЬ ПО
		//|								Работники.Сотрудник,
		//|								ТЧРаботникиОрганизации.ДатаНачала) КАК ПоследниеСтавки
		//|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		//|								ПО ПоследниеСтавки.Период = РаботникиОрганизаций.Период
		//|									И ПоследниеСтавки.Сотрудник = РаботникиОрганизаций.Сотрудник
		//|						
		//|						СГРУППИРОВАТЬ ПО
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.Должность
		//|							КОНЕЦ,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		//|							КОНЕЦ) КАК ИтогоЗанятоПоДолжности
		//|						ПО (ИтогоЗанятоПоДолжности.Должность = Работники.Должность)
		//|							И (ИтогоЗанятоПоДолжности.ПодразделениеОрганизации = Работники.ПодразделениеОрганизации)
		//|				ГДЕ
		//|					Работники.Ссылка = &ДокументСсылка) КАК ОсвобождаетсяСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = ОсвобождаетсяСтавок.НомерСтроки) КАК СвободноСтавокНаДатуПриема
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = СвободноСтавокНаДатуПриема.НомерСтроки
		//|ГДЕ
		//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	""КонфликтныйДокумент"",
		//|	ТЧРаботникиОрганизации.НомерСтроки,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	Работники.Регистратор,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	ТЧРаботникиОрганизации.СдельнаяОплата,
		//|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	NULL,
		//|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		//|ИЗ
		//|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		//|		ПО (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении
		//|					И (Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала И ВЫБОР
		//|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = &ПустаяДата
		//|							ТОГДА &ПустаяДата
		//|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
		//|					КОНЕЦ)
		//|				ИЛИ Работники.Период = ТЧРаботникиОрганизации.ДатаНачала)
		//|			И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		//|ГДЕ
		//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		
		//Аверсон 17.10.2022 КВВ СВФР-009670 (
		|ВЫБРАТЬ
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние,
		|СостояниеРаботниковОрганизаций.Регистратор,
		|СостояниеРаботниковОрганизаций.Период,
		|СостояниеРаботниковОрганизаций.ПериодЗавершения
		|ПОМЕСТИТЬ ВтОтстНаРаботе
		|ИЗ
		|РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации
		|ПО СостояниеРаботниковОрганизаций.Регистратор = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Ссылка
		|И СостояниеРаботниковОрганизаций.Период = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.ДатаНачала
		|И СостояниеРаботниковОрганизаций.Сотрудник = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Сотрудник
		|ГДЕ
		|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
		|И (СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)//СВЭЙ 22.09.2023 КВВ СВФР-011371
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку) //Аверсон 06.07.2023 КВВ СВФР-010927
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
		|)
		|И ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.ОсвобождатьСтавку = ИСТИНА
		|;
		|ВЫБРАТЬ
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние,
		|МИНИМУМ(ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.Период,ДЕНЬ,-1)) КАК Период
		|ПОМЕСТИТЬ ВтВозвратНаРаботу
		|ИЗ
		|РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратНаРаботуОрганизаций.РаботникиОрганизации КАК ВозвратНаРаботуОрганизацийРаботникиОрганизации
		|ПО СостояниеРаботниковОрганизаций.Регистратор = ВозвратНаРаботуОрганизацийРаботникиОрганизации.Ссылка
		|И СостояниеРаботниковОрганизаций.НомерСтроки = ВозвратНаРаботуОрганизацийРаботникиОрганизации.НомерСтроки
		|И СостояниеРаботниковОрганизаций.Сотрудник = ВозвратНаРаботуОрганизацийРаботникиОрганизации.Сотрудник
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтОтстНаРаботе КАК ВтОтстНаРаботе
		|ПО СостояниеРаботниковОрганизаций.Сотрудник = ВтОтстНаРаботе.Сотрудник
		|ГДЕ
		|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
		|И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
		|И СостояниеРаботниковОрганизаций.Сотрудник В (ВЫБРАТЬ ВтОтстНаРаботе.Сотрудник ИЗ ВтОтстНаРаботе)
		|И СостояниеРаботниковОрганизаций.Период >= ВтОтстНаРаботе.Период
		|СГРУППИРОВАТЬ ПО
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние
		|;
		|
		|ВЫБРАТЬ 
		|ВтОтстНаРаботе.Сотрудник,
		|ВтОтстНаРаботе.Состояние,
		|ВтОтстНаРаботе.Период,
		|ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) <= КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ТОГДА ВтВозвратНаРаботу.Период
		|ИНАЧЕ ДАТАВРЕМЯ(1,1,1,0,0,0)
		|КОНЕЦ КАК ПериодЗавершения,
		
		//Аверсон ЕАЕ 01.10.2025 СВФР-016869
		|ВтОтстНаРаботе.Регистратор
		//Аверсон СВФР-016869
		
		|ПОМЕСТИТЬ ВтВозвратНаРаботуСДатой
		|ИЗ ВтОтстНаРаботе КАК ВтОтстНаРаботе
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботу КАК ВтВозвратНаРаботу
		|ПО ВтВозвратНаРаботу.Сотрудник = ВтОтстНаРаботе.Сотрудник
		
		//Аверсон 19.10.2022 КВВ СВФР-009670 (
		|ГДЕ   
		|ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) <= КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ТОГДА 
		|&ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) И КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ИНАЧЕ ИСТИНА
		|КОНЕЦ
		//Аверсон 19.10.2022 КВВ СВФР-009670 )
		
		|;
		|
		//Аверсон 17.10.2022 КВВ СВФР-009670 )
		
		|// 0 ///
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно
		|   %ПолеДатаНачалаРС% 
		//Аверсон СВФР-014218
		
		|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность КАК Должность,
		|	ВЫБОР КОГДА ТЧРаботникиОрганизации.РазрядЕТС = """" ТОГДА ""0"" ИНАЧЕ ТЧРаботникиОрганизации.РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		//|	ТЧРаботникиОрганизации.РазрядЕТС,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.Категория КАК Категория,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		
		//Аверсон 20.09.2022 КВВ СВФР-009575 (
		//|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|ВЫБОР КОГДА 
		|ТЧРаботникиОрганизации.ПроцентПоКонтракту = 0 ИЛИ ТЧРаботникиОрганизации.ПроцентПоКонтракту ЕСТЬ NULL 
		|ТОГДА 0 
		|ИНАЧЕ ТЧРаботникиОрганизации.ПроцентПоКонтракту
		|КОНЕЦ КАК ПроцентПоКонтракту,
		//Аверсон 20.09.2022 КВВ СВФР-009575 )
		
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.Временно КАК Временно,
		|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ВЫБОР
		|		КОГДА НЕ ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.НомерДоговора ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТрудовойДоговорПрисутствует,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638 
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати, //О.Т. Аверсон 13.04.2016 № 1041
		|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004418
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|   ПОМЕСТИТЬ ВтТЧРаботникиОрганизации
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно
		|%СоединениеДатаНачалаРС%
		//|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыНачалаРС
		//|ПО ТЧРаботникиОрганизации.Сотрудник = ВТДатыНачалаРС.Сотрудник
		//Гродно
		//Аверсон СВФР-014218
		
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|ИНДЕКСИРОВАТЬ ПО
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник
		|;
		|
		
		//Аверсон 16.01.2023 КВВ СВФР-010148 (
		
		//|// 1 ///
		//|ВЫБРАТЬ
		//|	СУММА( ЗанимаемыхСтавок ) КАК КоличествоСтавок,
		//|	ПодразделениеОрганизации,
		//|	Должность,
		//|	ВЫБОР КОГДА РазрядЕТС = """" ИЛИ РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		//|	КоэффициентЕТС,
		//|	ПроцентПоКонтракту,
		//|	ИтоговоеПовышениеПоИнструкции,
		//|	ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 20.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////
		//////Аверсон 20.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		//|	УсловияТрудаИзмерение,
		//|	ВидДеятельностиИзмерение, 
		//|	ТарифнаяСтавкаПервогоРазряда
		//|	ПОМЕСТИТЬ ВтШтатныеЕдиницы
		//|ИЗ
		//|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаНачала, 
		//|			( ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,           // строковый тип, не всегда совпадает со значением в документе*
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту,  // не рассчитывается в регистре*
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 14.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////
		//////Аверсон 14.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		//|			УсловияТрудаИзмерение,
		//
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ВидДеятельностиИзмерение, //Аверсон 27.07.2022 КВВ СВФР-009380
		//
		//|			ТарифнаяСтавкаПервогоРазряда ) В
		//|			( ВЫБРАТЬ ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,  // строковый тип, не всегда совпадает со значением в документе*
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре*
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 14.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////
		//////Аверсон 14.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		//|			УсловияТрудаИзмерение,
		//
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ВидДеятельностиИзмерение, //Аверсон 27.07.2022 КВВ СВФР-009380
		//
		//|			ТарифнаяСтавкаПервогоРазряда 
		//|			ИЗ ВтТЧРаботникиОрганизации )
		//|		) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		//|СГРУППИРОВАТЬ ПО
		//|	ПодразделениеОрганизации,
		//|	Должность,
		//|	РазрядЕТС,
		//|	КоэффициентЕТС,
		//|	ПроцентПоКонтракту,
		//|	ИтоговоеПовышениеПоИнструкции,
		//|	ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 20.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////		////Аверсон 20.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		
		//|	УсловияТрудаИзмерение,
		//|	ВидДеятельностиИзмерение,
		//|	ТарифнаяСтавкаПервогоРазряда
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ПодразделениеОрганизации,
		//|	Должность
		//|;
		|// 1 ///
		|ВЫБРАТЬ
		|СУММА( ШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок ) КАК КоличествоСтавок,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.Должность,                                                              
		|ВЫБОР КОГДА ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = """" ИЛИ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.УсловияТрудаИзмерение,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ВидДеятельностиИзмерение, 
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда
		|ПОМЕСТИТЬ ВтШтатныеЕдиницы
		|ИЗ
		|РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаНачала) КАК ШтатноеРасписаниеОрганизацийСрезПоследних                    
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизаций.Период) КАК Период,
		|ПлановоеШтатноеРасписаниеОрганизаций.Должность КАК Должность,
		|ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ИЗ
		|РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
		|ГДЕ
		|ПлановоеШтатноеРасписаниеОрганизаций.Период <= &ДатаНачала
		|
		|СГРУППИРОВАТЬ ПО
		|ПлановоеШтатноеРасписаниеОрганизаций.Должность,
		|ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации) КАК ВложенныйЗапрос
		|ПО ШтатноеРасписаниеОрганизацийСрезПоследних.Период = ВложенныйЗапрос.Период
		|И ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВложенныйЗапрос.Должность
		|И ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВложенныйЗапрос.ПодразделениеОрганизации
		
		|ГДЕ (ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.УсловияТрудаИзмерение, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВидДеятельностиИзмерение, 
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда) 
		|В 
		|(ВЫБРАТЬ 
		|	ВтТЧРаботникиОрганизации.ПодразделениеОрганизации, 
		|	ВтТЧРаботникиОрганизации.Должность, 
		|	ВтТЧРаботникиОрганизации.КоэффициентЕТС, 
		|	ВтТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции, 
		|	ВтТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС, 
		|	ВтТЧРаботникиОрганизации.УсловияТрудаИзмерение, 
		|	ВтТЧРаботникиОрганизации.ВидДеятельностиИзмерение, 
		|	ВтТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда 
		|ИЗ ВтТЧРаботникиОрганизации)
		|
		|СГРУППИРОВАТЬ ПО
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
		
		//Аверсон ЕАЕ 12.09.2024 СВФР-013744
		//|ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС,
		|ВЫБОР КОГДА ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = """" ИЛИ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС КОНЕЦ,		
		//Аверсон СВФР-013744
		
		|ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.УсловияТрудаИзмерение,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ВидДеятельностиИзмерение,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда
		|
		|ИНДЕКСИРОВАТЬ ПО
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.Должность
		|;
		//Аверсон 16.01.2023 КВВ СВФР-010148 )
		
		
		|
		|// 2 ///
		|ВЫБРАТЬ
		|	СУММА( 
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНачала
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ 
		|	) КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность КАК Должность,
		|	ВЫБОР КОГДА РаботникиОрганизации.РазрядЕТС = """" ИЛИ РаботникиОрганизации.РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РаботникиОрганизации.РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		|	РаботникиОрганизации.КоэффициентЕТС,
		|
		//Аверсон 20.09.2022 КВВ СВФР-009575 (
		//|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|ВЫБОР КОГДА 
		|ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту = 0 ИЛИ ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту ЕСТЬ NULL 
		|ТОГДА 0 
		|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|КОНЕЦ КАК ПроцентПоКонтракту,
		//Аверсон 20.09.2022 КВВ СВФР-009575 ) 
		
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		//|	РаботникиОрганизации.ГрафикРаботы, //Аверсон 31.10.2022 КВВ СВФР-009733 (закомментировано)
		|	РаботникиОрганизации.УсловияТрудаИзмерение,
		//|	РаботникиОрганизации.ВидДеятельностиИзмерение, //СВЭЙ 13.02.2024 КВВ СВФР-012389 (закомментировано)
		|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|	ПОМЕСТИТЬ ВтЗанятыеШтатныеЕдиницы
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала, (НЕ Временно)
		|   И Регистратор <> &ДокументСсылка 
		
		//Аверсон 14.12.2022 КВВ СВФР-010028 ( (закомментировано, условия ниже перед СГРУППИРОВАТЬ)
		//|	И		( ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 20.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////
		//////Аверсон 20.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		//|			УсловияТрудаИзмерение,
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда ) В
		//|			( ВЫБРАТЬ ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		//////Аверсон 20.08.2020 КВВ СВФР-006430 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	ТекстЗапроса = ТекстЗапроса + "
		////	|			ГрафикРаботы,";
		////КонецЕсли;
		////
		//////Аверсон 20.08.2020 КВВ СВФР-006430 )
		////Аверсон 03.05.2021 КВВ СВФР-007533 )
		//ТекстЗапроса = ТекстЗапроса + "
		//|			УсловияТрудаИзмерение,
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда 
		//|			ИЗ ВтТЧРаботникиОрганизации )
		
		//Аверсон 14.12.2022 КВВ СВФР-010028 ) (закомментировано, условия ниже перед СГРУППИРОВАТЬ) 
		
		
		|	И (НЕ Сотрудник ЕСТЬ NULL )
		|	И ПодразделениеОрганизации.Владелец = &ГоловнаяОрганизация
		|	И ВЫБОР
		|			КОГДА ПериодЗавершения <= &ДатаНачала
		|					И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ЗанимаемыхСтавокЗавершения
		|			ИНАЧЕ ЗанимаемыхСтавок
		|		КОНЕЦ <> 0
		|	И (НЕ Сотрудник В (ВЫБРАТЬ ВтТЧРаботникиОрганизации.Сотрудник Из ВтТЧРаботникиОрганизации))//Аверсон 04.09.2020 КВВ СВФР-006430
		|	И (НЕ Сотрудник В
		|(ВЫБРАТЬ
		|	СостояниеРаботниковОрганизаций.Сотрудник
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|		ПО
		|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаОрганизацийРаботникиОрганизации.Ссылка
		|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
		|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком.ОсновныеНачисления КАК ОтпускаПоУходуЗаРебенком
		|		ПО
		|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаПоУходуЗаРебенком.Ссылка
		|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаПоУходуЗаРебенком.НомерСтроки
		|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаПоУходуЗаРебенком.Сотрудник
		
		//Аверсон ЕАЕ 01.10.2025 СВФР-016869
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ОтсутствиеНаРаботеОрганизаций
		|		ПО
		|			СостояниеРаботниковОрганизаций.Регистратор = ОтсутствиеНаРаботеОрганизаций.Ссылка
		|			И СостояниеРаботниковОрганизаций.Сотрудник = ОтсутствиеНаРаботеОрганизаций.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботуСДатой
		|		ПО СостояниеРаботниковОрганизаций.СОтрудник = ВтВозвратНаРаботуСДатой.Сотрудник
		|			И СостояниеРаботниковОрганизаций.Состояние = ВтВозвратНаРаботуСДатой.Состояние
		|			И СостояниеРаботниковОрганизаций.Период = ВтВозвратНаРаботуСДатой.Период
		|			И СостояниеРаботниковОрганизаций.Регистратор = ВтВозвратНаРаботуСДатой.Регистратор
		//Аверсон СВФР-016869
		
		|ГДЕ
		|	(СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)//СВЭЙ 22.09.2023 КВВ СВФР-011371
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
		//Аверсон 04.09.2020 КВВ СВФР-006430 (
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы)
		//Аверсон 04.09.2020 КВВ СВФР-006430 )
		
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)//Аверсон 06.07.2023 КВВ СВФР-010927
		
		|	)
		|	И (&ДатаНачала МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения
		
		//Аверсон ЕАЕ 01.10.2025 СВФР-016869
		|   ИЛИ &ДатаНачала МЕЖДУ СостояниеРаботниковОрганизаций.Период И ВтВозвратНаРаботуСДатой.ПериодЗавершения)
		//Аверсон СВФР-016869
		
		|	И ВЫБОР
		|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
		|			ТОГДА ОтпускаОрганизацийРаботникиОрганизации.ОсвобождатьСтавку
		|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
		|			ТОГДА ОтпускаПоУходуЗаРебенком.Ссылка.ОсвобождатьСтавку
		
		//Аверсон ЕАЕ 01.10.2025 СВФР-016869
		|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
		|			ТОГДА ОтсутствиеНаРаботеОрганизаций.ОсвобождатьСтавку
		//Аверсон СВФР-016869			
		
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|)
		|	 )
		|  ) КАК РаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&ДатаНачала,
		//|                           Сотрудник В ( ВЫБРАТЬ Сотрудник ИЗ ВтТЧРаботникиОрганизации )  //СВЭЙ 29.07.2024 КВВ СВФР-013438 (закомментировано)
		|							) КАК ТарифныеСтавкиРаботниковОрганизации
		|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
		
		//Аверсон 17.10.2022 КВВ СВФР-009670 (
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнение
		|ПО РаботникиОрганизации.Сотрудник = РаботникиОрганизацийУвольнение.Сотрудник
		|И РаботникиОрганизацийУвольнение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|И РаботникиОрганизацийУвольнение.Период <= &ДатаНачала
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботуСДатой КАК ВтВозвратНаРаботуСДатой  
		|ПО РаботникиОрганизации.Сотрудник = ВтВозвратНаРаботуСДатой.Сотрудник
		|
		|ГДЕ 
		|РаботникиОрганизацийУвольнение.Сотрудник ЕСТЬ NULL
		
		//Аверсон 19.10.2022 КВВ СВФР-009670 (
		|И
		|(ВтВозвратНаРаботуСДатой.Сотрудник ЕСТЬ NULL
		|ИЛИ
		|(НЕ ВтВозвратНаРаботуСДатой.Сотрудник ЕСТЬ NULL
		|И (ВтВозвратНаРаботуСДатой.ПериодЗавершения <> ДАТАВРЕМЯ(1,1,1,0,0,0)
		|И
		|&ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(ВтВозвратНаРаботуСДатой.Период,ДЕНЬ) И КОНЕЦПЕРИОДА(ВтВозвратНаРаботуСДатой.ПериодЗавершения,ДЕНЬ)
		|))) 
		//Аверсон 19.10.2022 КВВ СВФР-009670 )
		|
		//Аверсон 17.10.2022 КВВ СВФР-009670 )
		
		//Аверсон 14.12.2022 КВВ СВФР-010028 (
		|И       
		|(РаботникиОрганизации.ПодразделениеОрганизации, 
		|РаботникиОрганизации.Должность, 
		|РаботникиОрганизации.КоэффициентЕТС, 
		|РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|РаботникиОрганизации.УсловияТрудаИзмерение,
		|РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда) 
		|В 
		|(ВЫБРАТЬ 
		|ВтТЧРаботникиОрганизации.ПодразделениеОрганизации, 
		|ВтТЧРаботникиОрганизации.Должность,
		|ВтТЧРаботникиОрганизации.КоэффициентЕТС,
		|ВтТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|ВтТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|ВтТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|ВтТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда 
		|ИЗ ВтТЧРаботникиОрганизации)
		//Аверсон 14.12.2022 КВВ СВФР-010028 )
		
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность,
		
		//Аверсон ЕАЕ 12.09.2024 СВФР-013744
		//|	РаботникиОрганизации.РазрядЕТС,
		|	ВЫБОР КОГДА РаботникиОрганизации.РазрядЕТС = """" ИЛИ РаботникиОрганизации.РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РаботникиОрганизации.РазрядЕТС КОНЕЦ,
		//Аверсон СВФР-013744	
		
		|	РаботникиОрганизации.КоэффициентЕТС,
		|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		//|	РаботникиОрганизации.ГрафикРаботы, //Аверсон 31.10.2022 КВВ СВФР-009733 (закомментировано)
		|	РаботникиОрганизации.УсловияТрудаИзмерение,
		//|	РаботникиОрганизации.ВидДеятельностиИзмерение, //СВЭЙ 13.02.2024 КВВ СВФР-012389 (закомментировано)
		|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|ИНДЕКСИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность
		|;
		|
		|// 3 /// ***
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность КАК Должность,
		|	ТЧРаботникиОрганизации.РазрядЕТС КАК РазрядЕТС,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.Категория КАК Категория,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.Временно КАК Временно,
		|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ТЧРаботникиОрганизации.ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ТЧРаботникиОрганизации.ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение
		|	КОНЕЦ КАК ПрежняяОрганизация,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ПрежняяСтавка,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
		|	КОНЕЦ КАК ПрежнийГрафикРаботы,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Период
		|	КОНЕЦ КАК ДатаПоследнегоДвиженияПоРаботнику,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	NULL КАК КонфликтныйДокумент,
		|	ТЧРаботникиОрганизации.ТрудовойДоговорПрисутствует,
		|	( ISNULL( ШтатныеЕдиницы.КоличествоСтавок, 0 ) 
		|		- ISNULL( ЗанятыеШтатныеЕдиницы.ЗанимаемыхСтавок, 0 ) 
		|		- ISNULL( РанееЗанятоСтавокВЭтомДокументе.КоличествоСтавок, 0 ) ) КАК ОстатокСтавок,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ПрежнийТарифнаяСтавкаПервогоРазряда,
		|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК ПрежнийУсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|	ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ПрежнийВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638 
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати, //О.Т. Аверсон 13.04.2016 № 1041
		|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004418
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения КАК ЗанимаемыхСтавокЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения КАК ОбособленноеПодразделениеЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения КАК ПодразделениеОрганизацииЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения КАК ДолжностьЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПериодЗавершения КАК ПериодЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ТарифнаяСтавкаПервогоРазряда,
		|			ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение,
		|			ДанныеПоРаботникуДоНазначения.ТипРаботника КАК ТипРаботника,
		|			ДанныеПоРаботникуДоНазначения.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|			ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ВидДеятельностиИзмерение
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(Работники.Период) КАК Период,
		|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник
		|			ИЗ
		|				ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|					ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		|						И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТЧРаботникиОрганизации.НомерСтроки,
		|				ТЧРаботникиОрганизации.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО  ТЧРаботникиОрганизации.НомерСтроки < ТЧРаботникиОрганизации2.НомерСтроки
		|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ // СвободноСтавокНаДатуПриема
		//|			МаксимальныеПериодыШР.НомерСтроки КАК НомерСтроки,
		//|			ЕСТЬNULL(ШтатноеРасписание.КоличествоСтавок, 0) - ЕСТЬNULL(Вакансии.КоличествоСтавок, 0) - ЕСТЬNULL(РанееЗанятоСтавок.КоличествоСтавок, 0) + ЕСТЬNULL(ОсвобождаетсяСтавок.КоличествоСтавок, 0) КАК ОстатокСтавок
		//|		ИЗ
		//|			(ВЫБРАТЬ // МаксимальныеПериодыШР
		//|				Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|				Работники.Должность КАК Должность,
		//|				Работники.НомерСтроки КАК НомерСтроки,
		//|				МАКСИМУМ(ШтатноеРасписание.Период) КАК МаксПериод
		//|			ИЗ
		//|				ВтТЧРаботникиОрганизации КАК Работники
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ // ШтатноеРасписание
		//|						ЕСТЬNULL(ШтатноеРасписание.Период, &ДатаНачала) КАК Период,
		//|						Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|						Работники.Должность КАК Должность
		//|					ИЗ
		//|						ВтТЧРаботникиОрганизации КАК Работники
		//|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|							ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|								И Работники.Должность = ШтатноеРасписание.Должность
		//|						) КАК ШтатноеРасписание
		//|					ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|						И Работники.Должность = ШтатноеРасписание.Должность
		//|						И Работники.ДатаНачала >= ШтатноеРасписание.Период
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				Работники.ПодразделениеОрганизации,
		//|				Работники.НомерСтроки,
		//|				Работники.Должность) КАК МаксимальныеПериодыШР
		//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|				ПО МаксимальныеПериодыШР.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|					И МаксимальныеПериодыШР.Должность = ШтатноеРасписание.Должность
		//|					И МаксимальныеПериодыШР.МаксПериод = ШтатноеРасписание.Период
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					СУММА(ВЫБОР
		//|							КОГДА Вакансии.ВидДвижения = &Приход
		//|								ТОГДА Вакансии.КоличествоСтавок
		//|							ИНАЧЕ -Вакансии.КоличествоСтавок
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеШтатныеЕдиницыОрганизаций КАК Вакансии
		//|						ПО Работники.ПодразделениеОрганизации = Вакансии.ПодразделениеОрганизации
		//|							И Работники.Должность = Вакансии.Должность
		//|							И Работники.ДатаНачала >= Вакансии.Период
		//|							И (Вакансии.Регистратор <> &ДокументСсылка)
		//|				ГДЕ
		//|					Работники.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					Работники.ПодразделениеОрганизации,
		//|					Работники.Должность,
		//|					Работники.НомерСтроки) КАК Вакансии
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = Вакансии.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		//|					СУММА(ВЫБОР
		//|							КОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала <= СтрокиДокумента.ДатаНачала
		//|								ТОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ - ВЫБОР
		//|							КОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания < СтрокиДокумента.ДатаНачала
		//|									И КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания <> &ПустаяДата
		//|									И НЕ КадровоеПеремещениеОрганизацийРаботникиОрганизации.НапомнитьПоЗавершении
		//|								ТОГДА КадровоеПеремещениеОрганизацийРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК СтрокиДокумента
		//|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
		//|						ПО СтрокиДокумента.Ссылка = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка
		//|							И СтрокиДокумента.НомерСтроки <> КадровоеПеремещениеОрганизацийРаботникиОрганизации.НомерСтроки
		//|							И СтрокиДокумента.ПодразделениеОрганизации = КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации
		//|							И СтрокиДокумента.Должность = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность
		//|				ГДЕ
		//|					СтрокиДокумента.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = РанееЗанятоСтавок.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					ИтогоЗанятоПоДолжности.КоличествоСтавок КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|							СУММА(ВЫБОР
		//|									КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|											И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|										ТОГДА РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения
		//|									ИНАЧЕ РаботникиОрганизаций.ЗанимаемыхСтавок
		//|								КОНЕЦ) КАК КоличествоСтавок,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.Должность
		//|							КОНЕЦ КАК Должность,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		//|							КОНЕЦ КАК ПодразделениеОрганизации
		//|						ИЗ
		//|							(ВЫБРАТЬ
		//|								МАКСИМУМ(Работники.Период) КАК Период,
		//|								Работники.Сотрудник КАК Сотрудник,
		//|								ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала
		//|							ИЗ
		//|								Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		//|									ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		//|										И (Работники.Регистратор.Проведен)
		//|										И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		//|							ГДЕ
		//|								ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|							
		//|							СГРУППИРОВАТЬ ПО
		//|								Работники.Сотрудник,
		//|								ТЧРаботникиОрганизации.ДатаНачала) КАК ПоследниеСтавки
		//|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		//|								ПО ПоследниеСтавки.Период = РаботникиОрганизаций.Период
		//|									И ПоследниеСтавки.Сотрудник = РаботникиОрганизаций.Сотрудник
		//|						
		//|						СГРУППИРОВАТЬ ПО
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.Должность
		//|							КОНЕЦ,
		//|							ВЫБОР
		//|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		//|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		//|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		//|							КОНЕЦ) КАК ИтогоЗанятоПоДолжности
		//|						ПО (ИтогоЗанятоПоДолжности.Должность = Работники.Должность)
		//|							И (ИтогоЗанятоПоДолжности.ПодразделениеОрганизации = Работники.ПодразделениеОрганизации)
		//|				ГДЕ
		//|					Работники.Ссылка = &ДокументСсылка) КАК ОсвобождаетсяСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = ОсвобождаетсяСтавок.НомерСтроки) КАК СвободноСтавокНаДатуПриема
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = СвободноСтавокНаДатуПриема.НомерСтроки
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеЕдиницы КАК ШтатныеЕдиницы
		|		ПО  ТЧРаботникиОрганизации.ПодразделениеОрганизации = ШтатныеЕдиницы.ПодразделениеОрганизации
		|			И ТЧРаботникиОрганизации.Должность = ШтатныеЕдиницы.Должность
		|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ШтатныеЕдиницы.РазрядЕТС )
		|			И ТЧРаботникиОрганизации.КоэффициентЕТС = ШтатныеЕдиницы.КоэффициентЕТС
		|			И ТЧРаботникиОрганизации.ПроцентПоКонтракту = ШтатныеЕдиницы.ПроцентПоКонтракту
		|			И ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции = ШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции
		|			И ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС = ШтатныеЕдиницы.ПовышенныйКоэффициентЕТС";
		
		//Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		////Аверсон 14.08.2020 КВВ СВФР-006430 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|			И ТЧРаботникиОрганизации.ГрафикРаботы = ШтатныеЕдиницы.ГрафикРаботы";
		//КонецЕсли;
		//
		////Аверсон 14.08.2020 КВВ СВФР-006430 )
		//Аверсон 03.05.2021 КВВ СВФР-007533 )
		ТекстЗапроса = ТекстЗапроса + "
		|			И ТЧРаботникиОрганизации.УсловияТрудаИзмерение = ШтатныеЕдиницы.УсловияТрудаИзмерение
		//	|			И ТЧРаботникиОрганизации.ВидДеятельностиИзмерение = ШтатныеЕдиницы.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|			И ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
		|
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтЗанятыеШтатныеЕдиницы КАК ЗанятыеШтатныеЕдиницы
		|		ПО  ТЧРаботникиОрганизации.ПодразделениеОрганизации = ЗанятыеШтатныеЕдиницы.ПодразделениеОрганизации
		|			И ТЧРаботникиОрганизации.Должность = ЗанятыеШтатныеЕдиницы.Должность
		|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ЗанятыеШтатныеЕдиницы.РазрядЕТС )
		|			И ТЧРаботникиОрганизации.КоэффициентЕТС = ЗанятыеШтатныеЕдиницы.КоэффициентЕТС";
		
		// Аверсон 25.12.2021 КВВ СВФР-008540 (
		Если Организация.ИНН = "700067572" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			//|			И ТЧРаботникиОрганизации.ПроцентПоКонтракту = ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту
			//	|			И ЕстьNULL(ТЧРаботникиОрганизации.ПроцентПоКонтракту,0) = ЕстьNULL(ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту,0) //Аверсон 17.12.2021 КВВ СВФР-008410 (пункт 1)
			|			И ВЫБОР 
			|				КОГДА ТЧРаботникиОрганизации.СдельнаяОплата
			|				ТОГДА ТЧРаботникиОрганизации.ПроцентПоКонтракту = ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту
			// Аверсон 28.12.2021 КВВ СВФР-008540 (пункт 2) (
			|				ИНАЧЕ 
			|					ВЫБОР КОГДА ТЧРаботникиОрганизации.ПроцентПоКонтракту = 0
			|					ТОГДА ТЧРаботникиОрганизации.ПроцентПоКонтракту = ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту
			|					ИНАЧЕ 
			// Аверсон 28.12.2021 КВВ СВФР-008540 (пункт 2) )
			|					ЕстьNULL(ТЧРаботникиОрганизации.ПроцентПоКонтракту,0) = ЕстьNULL(ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту,0)   //Аверсон 17.12.2021 КВВ СВФР-008410 (пункт 1)
			|					КОНЕЦ
			|			  КОНЕЦ";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|			И ТЧРаботникиОрганизации.ПроцентПоКонтракту = ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		// Аверсон 25.12.2021 КВВ СВФР-008540 )
		
		|			И ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции = ЗанятыеШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции
		|			И ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС = ЗанятыеШтатныеЕдиницы.ПовышенныйКоэффициентЕТС";
		
		//Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		////Аверсон 20.08.2020 КВВ СВФР-006430 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|			И ТЧРаботникиОрганизации.ГрафикРаботы = ЗанятыеШтатныеЕдиницы.ГрафикРаботы";
		//КонецЕсли;
		//		////Аверсон 20.08.2020 КВВ СВФР-006430 )
		//Аверсон 03.05.2021 КВВ СВФР-007533 )
		ТекстЗапроса = ТекстЗапроса + "
		
		|			И ТЧРаботникиОрганизации.УсловияТрудаИзмерение = ЗанятыеШтатныеЕдиницы.УсловияТрудаИзмерение
		//	|			И ТЧРаботникиОрганизации.ВидДеятельностиИзмерение = ЗанятыеШтатныеЕдиницы.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|			И ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ЗанятыеШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // РанееЗанятоСтавокВЭтомДокументе
		|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|					СУММА(ВЫБОР
		|							КОГДА ПеремещениеРаботникиОрганизации.ДатаНачала < СтрокиДокумента.ДатаНачала
		|                                 ИЛИ ПеремещениеРаботникиОрганизации.ДатаНачала = СтрокиДокумента.ДатаНачала
		|                                     И СтрокиДокумента.НомерСтроки > ПеремещениеРаботникиОрганизации.НомерСтроки
		|								ТОГДА ПеремещениеРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ - ВЫБОР
		|							КОГДА ПеремещениеРаботникиОрганизации.ДатаОкончания < СтрокиДокумента.ДатаНачала
		|									И ПеремещениеРаботникиОрганизации.ДатаОкончания <> &ПустаяДата
		|									И ПеремещениеРаботникиОрганизации.НапомнитьПоЗавершении
		|								ТОГДА ПеремещениеРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ) КАК КоличествоСтавок
		|				ИЗ
		|					ВтТЧРаботникиОрганизации КАК СтрокиДокумента
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ПеремещениеРаботникиОрганизации
		|						ПО  СтрокиДокумента.НомерСтроки <> ПеремещениеРаботникиОрганизации.НомерСтроки
		|							И СтрокиДокумента.ПодразделениеОрганизации = ПеремещениеРаботникиОрганизации.ПодразделениеОрганизации
		|							И СтрокиДокумента.Должность = ПеремещениеРаботникиОрганизации.Должность
		|							И СтрокиДокумента.РазрядЕТС = ПеремещениеРаботникиОрганизации.РазрядЕТС
		|							И СтрокиДокумента.КоэффициентЕТС = ПеремещениеРаботникиОрганизации.КоэффициентЕТС
		|							И СтрокиДокумента.ПроцентПоКонтракту = ПеремещениеРаботникиОрганизации.ПроцентПоКонтракту
		|							И СтрокиДокумента.ИтоговоеПовышениеПоИнструкции = ПеремещениеРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции
		|							И СтрокиДокумента.ПовышенныйКоэффициентЕТС = ПеремещениеРаботникиОрганизации.ПовышенныйКоэффициентЕТС";
		
		//Аверсон 03.05.2021 КВВ СВФР-007533 ( Закомментирована проверка УНП. для всех
		////Аверсон 20.08.2020 КВВ СВФР-006430 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|							И СтрокиДокумента.ГрафикРаботы = ПеремещениеРаботникиОрганизации.ГрафикРаботы";
		//КонецЕсли;
		//
		////Аверсон 20.08.2020 КВВ СВФР-006430 )
		//Аверсон 03.05.2021 КВВ СВФР-007533 )
		ТекстЗапроса = ТекстЗапроса + "
		|							И СтрокиДокумента.УсловияТрудаИзмерение = ПеремещениеРаботникиОрганизации.УсловияТрудаИзмерение
		//	|							И СтрокиДокумента.ВидДеятельностиИзмерение = ПеремещениеРаботникиОрганизации.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|							И СтрокиДокумента.ТарифнаяСтавкаПервогоРазряда = ПеремещениеРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавокВЭтомДокументе
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = РанееЗанятоСтавокВЭтомДокументе.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""КонфликтныйДокумент"",
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		
		//Аверсон 27.07.2022 КВВ СВФР-009380 (
		//|	NULL,
		|	Работники.Регистратор, //КАК КонфликтныйДокумент
		//Аверсон 27.07.2022 КВВ СВФР-009380 )
		
		|	NULL,
		
		//Аверсон 27.07.2022 КВВ СВФР-009380 (
		//|	Работники.Регистратор,
		|	NULL, //КАК ОстатокСтавок 
		//Аверсон 27.07.2022 КВВ СВФР-009380 )
		
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.СдельнаяОплата,
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ПО (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении
		|					И (
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218 
		//Гродно
		//|                       Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала
		|                       %УсловиеДатаНачалаРС1% 
		//Аверсон СВФР-014218
		
		|                       И ВЫБОР
		|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = &ПустаяДата
		|							ТОГДА &ПустаяДата
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
		|					КОНЕЦ)
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно
		|ИЛИ %УсловиеДатаНачалаРС2%)
		//|				ИЛИ Работники.Период = ТЧРаботникиОрганизации.ДатаНачала)
		//Аверсон СВФР-014218
		
		|			И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		|";
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно 
		Если ТЗДатыНачалаРС = Неопределено Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ТЧРаботникиОрганизации.ДатаНачала");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала");
		Иначе  
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "ЕСТЬNULL(ВТДатыНачалаРС.ДатаНачалаРС, ДатаВремя(1,1,1)) КАК ДатаНачалаРС,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыНачалаРС
			|ПО ТЧРаботникиОрганизации.Сотрудник = ВТДатыНачалаРС.Сотрудник");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ТЧРаботникиОрганизации.ДатаНачалаРС");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачалаРС");
		КонецЕсли;
		//Аверсон СВФР-014218
		
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность КАК Должность,
		|	ТЧРаботникиОрганизации.РазрядЕТС КАК РазрядЕТС,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.Категория КАК Категория,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ВЫБОР
		|		КОГДА НЕ ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение
		|	КОНЕЦ КАК ПрежняяОрганизация,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ПрежняяСтавка,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
		|	КОНЕЦ КАК ПрежнийГрафикРаботы,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Период
		|	КОНЕЦ КАК ДатаПоследнегоДвиженияПоРаботнику,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	NULL КАК КонфликтныйДокумент,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.НомерДоговора ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТрудовойДоговорПрисутствует,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК ПрежнийУсловияТрудаИзмерение,
		|	ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ПрежнийВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.Временно КАК Временно,
		|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати,
		|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004418
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения КАК ЗанимаемыхСтавокЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения КАК ОбособленноеПодразделениеЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения КАК ПодразделениеОрганизацииЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения КАК ДолжностьЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПериодЗавершения КАК ПериодЗавершения,
		|			ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение,
		|			ДанныеПоРаботникуДоНазначения.ТипРаботника КАК ТипРаботника,
		|			ДанныеПоРаботникуДоНазначения.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|			ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ВидДеятельностиИзмерение
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(Работники.Период) КАК Период,
		|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|					ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		|						И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|			ГДЕ
		|				ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТЧРаботникиОрганизации.НомерСтроки,
		|				ТЧРаботникиОрганизации.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО (ТЧРаботникиОрганизации2.Ссылка = ТЧРаботникиОрганизации.Ссылка)
		|					И ТЧРаботникиОрганизации.НомерСтроки < ТЧРаботникиОрганизации2.НомерСтроки
		|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|		ГДЕ
		|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""КонфликтныйДокумент"",
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	Работники.Регистратор,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.СдельнаяОплата,
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 05.11.2015 № 679
		|	NULL, //Аверсон 05.01.2022 КВВ СВФР-008574
		|	NULL, //ВременныйПереводКлимовичи //СВЭЙ 05.06.2024 КВВ СВФР-012926 , СВФР-013192
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		|%СоединениеДатаНачалаРС%
		//Аверсон СВФР-014218
		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ПО (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении
		|					И (
		
		//Аверсон ЕАЕ 18.12.2024 СВФР-014218
		//Гродно
		//|                       Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала
		|                         %УсловиеДатаНачалаРС1%
		//Аверсон СВФР-014218
		
		|                       И ВЫБОР
		|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = &ПустаяДата
		|							ТОГДА &ПустаяДата
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
		|					КОНЕЦ)
		
		//Аверсон ЕАЕ 18.12.2024 СВФР-014218
		//|				ИЛИ Работники.Период = ТЧРаботникиОрганизации.ДатаНачала)
		|               ИЛИ %УсловиеДатаНачалаРС2%)
		//Аверсон СВФР-014218
		
		|			И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		//Аверсон ЕАЕ 18.12.2024 СВФР-014218
		//Гродно 
		Если ТЗДатыНачалаРС = Неопределено Тогда 
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ТЧРаботникиОрганизации.ДатаНачала");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала");
		Иначе  
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "ЕСТЬNULL(ВТДатыНачалаРС.ДатаНачалаРС, ДатаВремя(1,1,1)) КАК ДатаНачалаРС,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыНачалаРС
			|ПО ТЧРаботникиОрганизации.Сотрудник = ВТДатыНачалаРС.Сотрудник");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ВТДатыНачалаРС.ДатаНачалаРС");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ВТДатыНачалаРС.ДатаНачалаРС");
		КонецЕсли;
		//Аверсон СВФР-014218
		
	КонецЕсли;
	
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// 05.12.2010 Дмитрук
Функция СформироватьЗапросПоОтпускамДолжностей()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.Текст =
	"  ВЫБРАТЬ
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность,
	|	ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск,
	|	ДолжностиОрганизацийОтпуск.ВидОтпуска,
	|	ДолжностиОрганизацийОтпуск.КоличествоДней,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолжностиОрганизаций.Отпуск КАК ДолжностиОрганизацийОтпуск
	|		ПО КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации = ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск
	|			И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность = ДолжностиОрганизацийОтпуск.Ссылка
	|ГДЕ
	|	ДолжностиОрганизацийОтпуск.КоличествоДней <> 0
	|	И КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность,
	|	ДолжностиОрганизацийОтпуск.ВидОтпуска,
	|	ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск,
	|	ДолжностиОрганизацийОтпуск.КоличествоДней,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтпускамДолжностей()

// Формирует запрос по таблице "ОсновныеНачисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания, ТЗДатыНачалаРС = Неопределено) //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	
	//толик добавил временные перемещения	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧНачисления.Ссылка КАК Ссылка,
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаНачала КАК Период,
	|	ТЧНачисления.Действие КАК Действие,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ВЫБОР
	|					КОГДА ТЧНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
	|					КОГДА ТЧНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|					ИНАЧЕ ТЧНачисления.Действие
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.ПустаяСсылка)
	|	КОНЕЦ КАК ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|			ТОГДА """"
	|		ИНАЧЕ ТЧНачисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчетаИзмерение,
	|	ТЧНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1 КАК Показатель1,
	|	ТЧНачисления.Валюта1 КАК Валюта1,
	|	ТЧНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
	|	ТЧНачисления.Показатель2 КАК Показатель2,
	|	ТЧНачисления.Валюта2 КАК Валюта2,
	|	ТЧНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
	|	ТЧНачисления.Показатель3 КАК Показатель3,
	|	ТЧНачисления.Валюта3 КАК Валюта3,
	|	ТЧНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
	|	ТЧНачисления.Показатель4 КАК Показатель4,
	|	ТЧНачисления.Валюта4 КАК Валюта4,
	|	ТЧНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
	|	ТЧНачисления.Показатель5 КАК Показатель5,
	|	ТЧНачисления.Валюта5 КАК Валюта5,
	|	ТЧНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
	|	ТЧНачисления.Показатель6 КАК Показатель6,
	|	ТЧНачисления.Валюта6 КАК Валюта6,
	|	ТЧНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
	|	ТЧРаботникиОрганизации.Временно,
	|	ТЧРаботникиОрганизации.ДругоеПеремещение,
	|	ТЧНачисления.Показатель1ВВалюте КАК Показатель1ВВалюте
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.ОсновныеНачисления КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ПО ТЧНачисления.Ссылка = ТЧРаботникиОрганизации.Ссылка
	|			И ТЧНачисления.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ТЧНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	//Аверсон 07.07.2021 КВВ СВФР-007578 (
	ТЗВозврата = Запрос.Выполнить().Выгрузить(); 
	Если Организация.ИНН = "700067572" Тогда
		ВРвТЗ = Справочники.ГруппыРасчетов.ПрекращениеНачПриВремПереводах.Основные.Выгрузить();
		Для Каждого СтрТЗВозврата Из ТЗВозврата Цикл
			НайденнаяСтрока = ВРвТЗ.Найти(СтрТЗВозврата.ВидРасчета, "ВидРасчета");
			Если НайденнаяСтрока <> Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(СтрТЗВозврата.ПериодЗавершения) Тогда
					Продолжить;
				КонецЕсли;
				СтарДолж = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрТЗВозврата.Период-1, Новый Структура("Сотрудник",СтрТЗВозврата.Сотрудник)).Должность;
				Если СтрТЗВозврата.Должность = СтарДолж Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ (СтрТЗВозврата.Действие = Перечисления.ВидыДействияСНачислением.Начать ИЛИ СтрТЗВозврата.Действие = Перечисления.ВидыДействияСНачислением.Прекратить) Тогда
					Продолжить;
				КонецЕсли;
				Если СтрТЗВозврата.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
					СтрТЗВозврата.Период = НачалоДня(СтрТЗВозврата.ПериодЗавершения);
					СтрТЗВозврата.ПериодЗавершения = Дата(1,1,1,0,0,0);
				Иначе //Прекратить
					СтрТЗВозврата.Период = НачалоДня(СтрТЗВозврата.Период);
					СтрТЗВозврата.ПериодЗавершения = Дата(1,1,1,0,0,0);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Аверсон ЕАЕ 17.12.2024 СВФР-014218
	//Гродно
	Если ТЗДатыНачалаРС <> Неопределено Тогда
		ТЗВозврата.Колонки.Добавить("ПериодРС", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		Для Каждого Стр Из ТЗВозврата Цикл
			НужнаяСтр = ТЗДатыНачалаРС.Найти(Стр.Сотрудник, "Сотрудник");
			Если НужнаяСтр <> Неопределено Тогда
				Стр.ПериодРС = НужнаяСтр.ДатаНачалаРС;
			Иначе
				Стр.ПериодРС = Стр.Период;
			КонецЕсли;
		КонецЦикла;
		ТЗВозврата.Колонки.Удалить("Период");
		ТЗВозврата.Колонки.ПериодРС.Заголовок = "Период";
		ТЗВозврата.Колонки.ПериодРС.Имя = "Период";
	КонецЕсли;
	//Аверсон СВФР-014218
	
	//Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(Запрос.Выполнить().Выгрузить(), ПроверкаШтатногоРасписания,,Ссылка);
	Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(ТЗВозврата, ПроверкаШтатногоРасписания,,Ссылка);  
	//Аверсон 07.07.2021 КВВ СВФР-007578 )
	
КонецФункции // СформироватьЗапросПоНачисления()

// Формирует запрос по таблице "КоэфПовышенияТО" документа
Функция СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента)
	//толик добавил временно	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Ссылка,
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.НомерСтроки,
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Коэффициент,
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Размер,
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Сотрудник,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала,
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Действие,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Временно,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДругоеПеремещение,
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.КоэфПовышенияТО КАК КадровоеПеремещениеОрганизацийКоэфПовышенияТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
	|		ПО КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Ссылка = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка
	|			И КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Сотрудник = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Ссылка = &ДокументСсылка
	|	И КадровоеПеремещениеОрганизацийКоэфПовышенияТО.Сотрудник <> &ПустойСотрудник";
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента)
	//толик добавил временно	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной( "глУчетнаяПолитикаПоПерсоналуОрганизации" );
	ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(
	УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания" );
	
	Если СокрЛП( Организация.ИНН ) = "806000046" И ПроверкаШтатногоРасписания Тогда
		
		Запрос.УстановитьПараметр("Дата",	ВыборкаПоШапкеДокумента.Дата);
		
		
		УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной( "глУчетнаяПолитикаПоПерсоналуОрганизации" );
		ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(
		УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания" );
		///0//////////////////////////////////////////////////////////////////////////////	
		Запрос.Текст = "ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Сотрудники.ДатаНачала,
		|	Сотрудники.ДатаОкончания,
		|	Сотрудники.Временно,
		|	Сотрудники.ДругоеПеремещение,
		|
		|	Сотрудники.НомерСтроки,
		|	Сотрудники.Сотрудник,
		|
		|	Сотрудники.ПодразделениеОрганизации КАК Подразделение,
		|	Сотрудники.Должность,
		|	Сотрудники.ГрафикРаботы,
		|	Сотрудники.ПроцентПоКонтракту,
		|
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	ВЫРАЗИТЬ( Сотрудники.ТарифнаяСтавка КАК ЧИСЛО(15,3) ) КАК ТарифнаяСтавка, //точность на 1 знак больше, как есть в реквизите, чтобы минимизировать погрешности округления (см.ниже)
		|
		|	Сотрудники.РазрядЕТС,
		|	Сотрудники.КоэффициентЕТС,
		|	Сотрудники.ПовышенныйКоэффициентЕТС,
		|
		|	Сотрудники.УсловияТрудаИзмерение,
		|	Сотрудники.ВидДеятельностиИзмерение
		|
		|ПОМЕСТИТЬ ВтСотрудники
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &ДокументСсылка
		|	И Сотрудники.Сотрудник <> ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|	И Сотрудники.ЗанимаемыхСтавок > 0
		|;
		|
		|///1/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Сотрудники.ДатаНачала,
		|	Сотрудники.ДатаОкончания,
		|	Сотрудники.Временно,
		|	Сотрудники.ДругоеПеремещение,
		|
		|	Сотрудники.НомерСтроки,
		|	Сотрудники.Сотрудник,
		|
		|	Сотрудники.Подразделение,
		|	Сотрудники.Должность,
		|	Сотрудники.ГрафикРаботы,
		|	Сотрудники.ПроцентПоКонтракту,
		|
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	Сотрудники.ТарифнаяСтавка,
		|
		|	Сотрудники.РазрядЕТС,
		|	Сотрудники.КоэффициентЕТС,
		|	Сотрудники.ПовышенныйКоэффициентЕТС,
		|	Сотрудники.УсловияТрудаИзмерение,
		|	Сотрудники.ВидДеятельностиИзмерение,
		|
		|	ПовышенияПоИнструкции.НомерСтроки КАК ПовышенияНомерСтроки,
		|	ПовышенияПоИнструкции.Коэффициент,
		|	ПовышенияПоИнструкции.Размер,
		|	ПовышенияПоИнструкции.Действие
		|
		|ПОМЕСТИТЬ ВтПовышенияПоИнструкции
		|ИЗ
		|	ВтСотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.ПовышенияПоИнструкции КАК ПовышенияПоИнструкции
		|		ПО Сотрудники.Ссылка = ПовышенияПоИнструкции.Ссылка
		|			И Сотрудники.Сотрудник = ПовышенияПоИнструкции.Сотрудник
		|;
		|
		|///2/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штатное.Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.РазмерСтавки1Разряда = 0 ТОГДА 1 ИНАЧЕ Штатное.РазмерСтавки1Разряда КОНЕЦ КАК РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Штатное.ПодразделениеОрганизации КАК Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	ISNULL( ШтатныеПовышенияПоИнструкции.Коэффициент, ЗНАЧЕНИЕ( Справочник.КоэффициентыПовышения.ПустаяСсылка ) ) КАК Коэффициент,
		|	ISNULL( ШтатныеПовышенияПоИнструкции.Размер, 0 ) КАК Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкцииСДублями
		|ИЗ
		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(
		|			&Дата,
		|			( ПодразделениеОрганизации, Должность, ГрафикРаботы, ПроцентПоКонтракту,
		|
		|					РазрядЕТС,
		|					КоэффициентЕТС,
		|					ПовышенныйКоэффициентЕТС,
		|
		|					УсловияТрудаИзмерение,
		|					ВидДеятельностиИзмерение
		|
		|				) В
		|				(ВЫБРАТЬ
		|					Подразделение, Должность, ГрафикРаботы, ПроцентПоКонтракту,
		|
		|					РазрядЕТС,
		|					КоэффициентЕТС,
		|					ПовышенныйКоэффициентЕТС,
		|
		|					УсловияТрудаИзмерение,
		|					ВидДеятельностиИзмерение
		|
		|				ИЗ
		|					ВтСотрудники КАК Сотрудники)
		|		) КАК Штатное
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ШтатныеПовышенияПоИнструкции
		|		ПО Штатное.Регистратор = ШтатныеПовышенияПоИнструкции.Ссылка
		|			И Штатное.КодСтроки = ШтатныеПовышенияПоИнструкции.КодСтроки
		|ГДЕ
		|	Штатное.ЗанимаемыхСтавок > 0
		|;
		|
		|///3/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.ТарифнаяСтавка  * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КОНЕЦ 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления,
		|
		|	МИНИМУМ( Штатное.Размер = ISNULL( Прием.Размер, 0 ) ) КАК ВсеКоэффициентыСовпали 
		|
		|
		|ПОМЕСТИТЬ ВтПолныеСовпаденияКоэффициентов
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Сотрудники.ИтоговоеПовышениеПоИнструкции
		|
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПовышенияПоИнструкции КАК Прием
		|		ПО 
		|		   Сотрудники.НомерСтроки = Прием.НомерСтроки 
		|		   И Штатное.Коэффициент = Прием.Коэффициент 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	Сотрудники.ТарифнаяСтавка,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.ТарифнаяСтавка  * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КОНЕЦ 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						   
		|ИМЕЮЩИЕ
		|	МИНИМУМ( Штатное.Размер = ISNULL( Прием.Размер, 0 ) ) = Истина
		|;
		|
		|///4/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Совпадения.НомерСтроки
		|ПОМЕСТИТЬ ВтСотрудникиПолныеСовпаденияКоэффициентов
		|ИЗ
		|	ВтПолныеСовпаденияКоэффициентов КАК Совпадения
		|;
		|
		|
		|///5/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		КОНЕЦ
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтПериодыИсходные
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Сотрудники.ИтоговоеПовышениеПоИнструкции
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиПолныеСовпаденияКоэффициентов КАК СотрудникиПолныеСовпаденияКоэффициентов
		|		ПО 
		|		   Сотрудники.НомерСтроки = СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолныеСовпаденияКоэффициентов КАК ПолныеСовпаденияКоэффициентов
		|		ПО 
		|			НЕ СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL
		|			И Сотрудники.НомерСтроки = ПолныеСовпаденияКоэффициентов.НомерСтроки 
		|
		|			И Штатное.Подразделение = ПолныеСовпаденияКоэффициентов.Подразделение
		|			И Штатное.Должность = ПолныеСовпаденияКоэффициентов.Должность
		|			И Штатное.ГрафикРаботы = ПолныеСовпаденияКоэффициентов.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту = ПолныеСовпаденияКоэффициентов.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции = ПолныеСовпаденияКоэффициентов.ИтоговоеПовышениеПоИнструкции
		|
		|			И Штатное.ЗанимаемыхСтавок = ПолныеСовпаденияКоэффициентов.ЗанимаемыхСтавок
		|			И Штатное.МесячнаяТарифнаяСтавка = ПолныеСовпаденияКоэффициентов.МесячнаяТарифнаяСтавка
		|			И Штатное.ТарифнаяСтавка = ПолныеСовпаденияКоэффициентов.ТарифнаяСтавка
		|
		|			И Штатное.РазрядЕТС = ПолныеСовпаденияКоэффициентов.РазрядЕТС
		|			И Штатное.КоэффициентЕТС = ПолныеСовпаденияКоэффициентов.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС = ПолныеСовпаденияКоэффициентов.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение = ПолныеСовпаденияКоэффициентов.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение = ПолныеСовпаденияКоэффициентов.ВидДеятельностиИзмерение
		|
		|			И Штатное.Период  = ПолныеСовпаденияКоэффициентов.Период
		|
		|ГДЕ
		|	СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL	
		|	ИЛИ НЕ ПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL	
		|;
		|
		|///6/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МИНИМУМ( ПогрешностьОкругления ) КАК МинимальнаяПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтМинимальныеПогрешностиОкругления
		|ИЗ
		|	ВтПериодыИсходные КАК Штатное
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///7/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Округление.МинимальнаяПогрешностьОкругления, 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МАКСИМУМ( Штатное.Период ) КАК МаксимальныйПериод
		|
		|ПОМЕСТИТЬ  ВтПериоды
		|ИЗ
		|	ВтПериодыИсходные КАК Штатное
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМинимальныеПогрешностиОкругления КАК Округление
		|		ПО Штатное.Подразделение = Округление.Подразделение 
		|		   И Штатное.Должность = Округление.Должность 
		|		   И Штатное.ГрафикРаботы = Округление.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Округление.ПроцентПоКонтракту 
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Округление.ИтоговоеПовышениеПоИнструкции
		|
		|		   И Штатное.НомерСтроки = Округление.НомерСтроки
		|		   И Штатное.ПогрешностьОкругления = Округление.МинимальнаяПогрешностьОкругления 
		|
		|		   И Штатное.РазрядЕТС = Округление.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Округление.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Округление.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Округление.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Округление.ВидДеятельностиИзмерение 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Округление.МинимальнаяПогрешностьОкругления, 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|///8/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Периоды.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Периоды.РазмерСтавки1Разряда КАК РазмерСтавки1РазрядаСотр, 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Коэффициент,
		|	Штатное.Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкции
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПериоды КАК Периоды
		|		ПО
		|			Штатное.Подразделение = Периоды.Подразделение
		|			И Штатное.Должность =     Периоды.Должность
		|			И Штатное.ГрафикРаботы =  Периоды.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту =  		  Периоды.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции = Периоды.ИтоговоеПовышениеПоИнструкции
		|
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			И  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И ВЫРАЗИТЬ( 
		|			  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			  КОНЕЦ = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			  КОНЕЦ 
		|			  КАК ЧИСЛО( 17, 5 )	) = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|			И Штатное.Период	 = Периоды.МаксимальныйПериод
		|
		|			И Штатное.РазрядЕТС =   Периоды.РазрядЕТС
		|			И Штатное.КоэффициентЕТС =   Периоды.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС =   Периоды.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение =   Периоды.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение =   Периоды.ВидДеятельностиИзмерение
		|;
		|
		|
		|///9/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции КАК ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫРАЗИТЬ( 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		КОНЕЦ
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 )  ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтПериодыБезИтоговогоПовышенияИсходные
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции <> Сотрудники.ИтоговоеПовышениеПоИнструкции
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|;
		|
		|
		|///10/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Штатное.ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МИНИМУМ( ПогрешностьОкругления ) КАК МинимальнаяПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтМинимальныеПогрешностиОкругленияБезИтоговогоПовышения
		|ИЗ
		|	ВтПериодыБезИтоговогоПовышенияИсходные КАК Штатное
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Штатное.ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///11/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Округление.ЗанимаемыхСтавокСотр,
		|	Округление.ТарифнаяСтавкаСотр,
		|	Округление.ИтоговоеПовышениеПоИнструкцииСотр,
		|	Округление.МинимальнаяПогрешностьОкругления,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МАКСИМУМ( Штатное.Период ) КАК МаксимальныйПериод
		|
		|ПОМЕСТИТЬ  ВтПериодыБезИтоговогоПовышения
		|ИЗ
		|	ВтПериодыБезИтоговогоПовышенияИсходные КАК Штатное
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМинимальныеПогрешностиОкругленияБезИтоговогоПовышения КАК Округление
		|		ПО Штатное.Подразделение = Округление.Подразделение 
		|		   И Штатное.Должность = Округление.Должность 
		|		   И Штатное.ГрафикРаботы = Округление.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Округление.ПроцентПоКонтракту 
		|
		|		   И Штатное.НомерСтроки = Округление.НомерСтроки
		|		   И Штатное.ПогрешностьОкругления = Округление.МинимальнаяПогрешностьОкругления 
		|
		|		   И Штатное.РазрядЕТС = Округление.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Округление.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Округление.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Округление.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Округление.ВидДеятельностиИзмерение 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Округление.ЗанимаемыхСтавокСотр,
		|	Округление.ТарифнаяСтавкаСотр,
		|	Округление.ИтоговоеПовышениеПоИнструкцииСотр,
		|	Округление.МинимальнаяПогрешностьОкругления,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///12/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Периоды.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Коэффициент,
		|	Штатное.Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкцииБезИтогового
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПериодыБезИтоговогоПовышения КАК Периоды
		|		ПО
		|			Штатное.Подразделение = Периоды.Подразделение
		|			И Штатное.Должность =     Периоды.Должность
		|			И Штатное.ГрафикРаботы =  Периоды.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту =  Периоды.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции <> Периоды.ИтоговоеПовышениеПоИнструкцииСотр
		|
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			И ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И ВЫРАЗИТЬ( 
		|			  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			  КОНЕЦ 			 = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			  КОНЕЦ 
		|			  КАК ЧИСЛО( 17, 5 )	) = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И Штатное.Период	 = Периоды.МаксимальныйПериод
		|
		|			И Штатное.РазрядЕТС =   Периоды.РазрядЕТС
		|			И Штатное.КоэффициентЕТС =   Периоды.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС =   Периоды.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение =   Периоды.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение =   Периоды.ВидДеятельностиИзмерение
		|;
		|
		|///13/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.НомерСтроки КАК НомерСтроки,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	ISNULL( Прием.Коэффициент, 
		|				ISNULL( Штатное.Коэффициент, ISNULL( ШтатноеБезИтогового.Коэффициент, 
		|                    ISNULL( ШтатноеБезПриема.Коэффициент, ISNULL( ШтатноеБезПриемаБезИтогового.Коэффициент,
		|		ЗНАЧЕНИЕ( Справочник.КоэффициентыПовышения.ПустаяСсылка ) ) ) ) ) ) КАК Коэффициент,
		|	ВЫБОР КОГДА НЕ Штатное.Коэффициент IS NULL ТОГДА 1
		|		  КОГДА НЕ ШтатноеБезИтогового.Коэффициент IS NULL ТОГДА 2
		|		  КОГДА НЕ ШтатноеБезПриема.Коэффициент IS NULL ТОГДА 3
		|		  КОГДА НЕ ШтатноеБезПриемаБезИтогового.Коэффициент IS NULL ТОГДА 4
		|          ИНАЧЕ 0
		|	КОНЕЦ КАК НомерСоединения, //для отладки
		|	ISNULL( Прием.Размер, 0 ) КАК Размер,
		|	ISNULL( Прием.ПовышенияНомерСтроки, 0 ) КАК ПовышенияНомерСтроки,
		|	ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) КАК Действие,
		
		|	Сотрудники.ДатаНачала,
		|	Сотрудники.ДатаОкончания,
		|	Сотрудники.Временно,
		|	Сотрудники.ДругоеПеремещение,
		
		|	ISNULL( Прием.Размер, 0 ) 
		|						<> ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|                             ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|									0 ) ) ) )
		|			И ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) 
		|						<> ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Прекратить ) 
		|	КАК ЕстьОшибка,
		|	ВЫБОР
		|		КОГДА ISNULL( Прием.Размер, 0 ) 
		|						<> ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|                             ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|									0 ) ) ) )
		|				И ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) 
		|						<> ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Прекратить ) 
		|			ТОГДА ""Строка: %НомерСтроки; Сотрудник: %Сотрудник - Размер %ПриемРазмер коэффициента повышения по инструкции %Коэффициент 
		|						не равен указанному в штатном расписании %ШтатРазмер. Проведение отменено!""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТекстОшибки,
		|	ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|              ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|					  0 ) ) ) )
		|			КАК ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтЗаписиСДублями
		|ИЗ
		|	ВтСотрудники КАК Сотрудники
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПовышенияПоИнструкции КАК Прием
		|		ПО Сотрудники.НомерСтроки = Прием.НомерСтроки
		|
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкции КАК Штатное     //1 Соединение
		|		ПО 
		|			НЕ Прием.Сотрудник IS NULL
		|
		|			И Прием.Должность = Штатное.Должность
		|			И Прием.Подразделение = Штатное.Подразделение
		|			И Прием.ГрафикРаботы = Штатное.ГрафикРаботы
		|			И Прием.ПроцентПоКонтракту = Штатное.ПроцентПоКонтракту
		|			И Прием.ИтоговоеПовышениеПоИнструкции = Штатное.ИтоговоеПовышениеПоИнструкции
		|
		|			И Прием.НомерСтроки = Штатное.НомерСтроки
		|
		|			И Прием.РазрядЕТС =   Штатное.РазрядЕТС
		|			И Прием.КоэффициентЕТС =   Штатное.КоэффициентЕТС
		|			И Прием.ПовышенныйКоэффициентЕТС =   Штатное.ПовышенныйКоэффициентЕТС
		|			И Прием.УсловияТрудаИзмерение =   Штатное.УсловияТрудаИзмерение
		|			И Прием.ВидДеятельностиИзмерение =   Штатное.ВидДеятельностиИзмерение
		|
		|			И Прием.Коэффициент = Штатное.Коэффициент
		|
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкцииБезИтогового КАК ШтатноеБезИтогового   //2 Соединение
		|		ПО  
		|			НЕ Прием.Сотрудник IS NULL
		|            И Штатное.Должность IS NULL
		|
		|			И Прием.Должность = ШтатноеБезИтогового.Должность
		|			И Прием.Подразделение = ШтатноеБезИтогового.Подразделение
		|			И Прием.ГрафикРаботы = ШтатноеБезИтогового.ГрафикРаботы
		|			И Прием.ПроцентПоКонтракту = ШтатноеБезИтогового.ПроцентПоКонтракту
		|			И Прием.ИтоговоеПовышениеПоИнструкции <> ШтатноеБезИтогового.ИтоговоеПовышениеПоИнструкции
		|
		|			И Прием.НомерСтроки = ШтатноеБезИтогового.НомерСтроки
		|
		|			И Прием.РазрядЕТС =   ШтатноеБезИтогового.РазрядЕТС
		|			И Прием.КоэффициентЕТС =   ШтатноеБезИтогового.КоэффициентЕТС
		|			И Прием.ПовышенныйКоэффициентЕТС =   ШтатноеБезИтогового.ПовышенныйКоэффициентЕТС
		|			И Прием.УсловияТрудаИзмерение =   ШтатноеБезИтогового.УсловияТрудаИзмерение
		|			И Прием.ВидДеятельностиИзмерение =   ШтатноеБезИтогового.ВидДеятельностиИзмерение
		|
		|			И Прием.Коэффициент = ШтатноеБезИтогового.Коэффициент
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкции КАК ШтатноеБезПриема                   //3 Соединение
		|		ПО 
		|			Прием.Сотрудник IS NULL
		|
		|			И Сотрудники.Должность = ШтатноеБезПриема.Должность
		|			И Сотрудники.Подразделение = ШтатноеБезПриема.Подразделение
		|			И Сотрудники.ГрафикРаботы = ШтатноеБезПриема.ГрафикРаботы
		|			И Сотрудники.ПроцентПоКонтракту = ШтатноеБезПриема.ПроцентПоКонтракту
		|			И Сотрудники.ИтоговоеПовышениеПоИнструкции = ШтатноеБезПриема.ИтоговоеПовышениеПоИнструкции
		|            
		|			И Сотрудники.НомерСтроки = ШтатноеБезПриема.НомерСтроки
		|
		|			И Сотрудники.РазрядЕТС =   ШтатноеБезПриема.РазрядЕТС
		|			И Сотрудники.КоэффициентЕТС =   ШтатноеБезПриема.КоэффициентЕТС
		|			И Сотрудники.ПовышенныйКоэффициентЕТС =   ШтатноеБезПриема.ПовышенныйКоэффициентЕТС
		|			И Сотрудники.УсловияТрудаИзмерение =   ШтатноеБезПриема.УсловияТрудаИзмерение
		|			И Сотрудники.ВидДеятельностиИзмерение =   ШтатноеБезПриема.ВидДеятельностиИзмерение
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкцииБезИтогового КАК ШтатноеБезПриемаБезИтогового    //4 Соединение
		|		ПО  
		|			Прием.Сотрудник IS NULL
		|            И ШтатноеБезПриема.Должность IS NULL
		|
		|			И Сотрудники.Должность = ШтатноеБезПриемаБезИтогового.Должность
		|			И Сотрудники.Подразделение = ШтатноеБезПриемаБезИтогового.Подразделение
		|			И Сотрудники.ГрафикРаботы = ШтатноеБезПриемаБезИтогового.ГрафикРаботы
		|			И Сотрудники.ПроцентПоКонтракту = ШтатноеБезПриемаБезИтогового.ПроцентПоКонтракту
		|			И Сотрудники.ИтоговоеПовышениеПоИнструкции <> ШтатноеБезПриемаБезИтогового.ИтоговоеПовышениеПоИнструкции
		|
		|			И Сотрудники.НомерСтроки = ШтатноеБезПриемаБезИтогового.НомерСтроки
		|
		|			И Сотрудники.РазрядЕТС =   ШтатноеБезПриемаБезИтогового.РазрядЕТС
		|			И Сотрудники.КоэффициентЕТС =   ШтатноеБезПриемаБезИтогового.КоэффициентЕТС
		|			И Сотрудники.ПовышенныйКоэффициентЕТС =   ШтатноеБезПриемаБезИтогового.ПовышенныйКоэффициентЕТС
		|			И Сотрудники.УсловияТрудаИзмерение =   ШтатноеБезПриемаБезИтогового.УсловияТрудаИзмерение
		|			И Сотрудники.ВидДеятельностиИзмерение =   ШтатноеБезПриемаБезИтогового.ВидДеятельностиИзмерение
		|;
		|
		|/// 14 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Временно,
		|	ДругоеПеремещение,
		|	МИНИМУМ( ЕстьОшибка ) КАК ЕстьОшибка
		|
		|ПОМЕСТИТЬ ВтОтборЗаписей_ЕстьОшибка
		|ИЗ
		|	ВтЗаписиСДублями КАК ЗаписиСДублями
		|
		|СГРУППИРОВАТЬ ПО
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Временно,
		|	ДругоеПеремещение
		|;
		|
		|/// 15 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиСДублями.НомерСтроки,
		|	ЗаписиСДублями.ПовышенияНомерСтроки,
		|	ЗаписиСДублями.Сотрудник,
		|	ЗаписиСДублями.Коэффициент,
		|	ЗаписиСДублями.Действие,
		
		|	ЗаписиСДублями.ДатаНачала,
		|	ЗаписиСДублями.ДатаОкончания,
		|	ЗаписиСДублями.Временно,
		|	ЗаписиСДублями.ДругоеПеремещение,
		
		|	ЗаписиСДублями.Размер,
		|	ЗаписиСДублями.ЕстьОшибка,
		|	ЗаписиСДублями.ТекстОшибки,
		|	ЗаписиСДублями.ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтЗаписиОтобранныеПоЕстьОшибка
		|ИЗ
		|	ВтЗаписиСДублями КАК ЗаписиСДублями
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборЗаписей_ЕстьОшибка КАК Отбор_ЕстьОшибка 
		|		ПО 
		|			ЗаписиСДублями.НомерСтроки = Отбор_ЕстьОшибка.НомерСтроки
		|			И ЗаписиСДублями.ПовышенияНомерСтроки = Отбор_ЕстьОшибка.ПовышенияНомерСтроки
		|			И ЗаписиСДублями.Сотрудник = Отбор_ЕстьОшибка.Сотрудник
		|			И ЗаписиСДублями.Коэффициент = Отбор_ЕстьОшибка.Коэффициент
		|			И ЗаписиСДублями.Действие = Отбор_ЕстьОшибка.Действие
		|			И ЗаписиСДублями.ДатаНачала = Отбор_ЕстьОшибка.ДатаНачала
		|			И ЗаписиСДублями.ДатаОкончания = Отбор_ЕстьОшибка.ДатаОкончания
		|			И ЗаписиСДублями.Временно      = Отбор_ЕстьОшибка.Временно
		|			И ЗаписиСДублями.ДругоеПеремещение = Отбор_ЕстьОшибка.ДругоеПеремещение
		|			И ЗаписиСДублями.ЕстьОшибка = Отбор_ЕстьОшибка.ЕстьОшибка
		|;
		|
		|/// 16 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Временно,
		|	ДругоеПеремещение,
		|	МАКСИМУМ( ШтатРазмер ) КАК ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтОтборЗаписей_ШтатРазмер
		|ИЗ
		|	ВтЗаписиОтобранныеПоЕстьОшибка КАК ЗаписиОтобранныеПоЕстьОшибка
		|
		|СГРУППИРОВАТЬ ПО
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаНачала,
		|	ДатаОкончания,
		|	Временно,
		|	ДругоеПеремещение
		|;
		|
		|/// 17 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Записи.НомерСтроки,
		|	Записи.ПовышенияНомерСтроки,
		|	Записи.Сотрудник,
		|	Записи.Коэффициент,
		|	Записи.Действие,
		|	Записи.ДатаНачала,
		|	Записи.ДатаОкончания,
		|	Записи.Временно,
		|	Записи.ДругоеПеремещение,
		|	Записи.Размер,
		|
		|	Записи.ЕстьОшибка,
		|	Записи.ТекстОшибки,
		|	Записи.ШтатРазмер
		|
		|ИЗ
		|	ВтЗаписиОтобранныеПоЕстьОшибка КАК Записи
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборЗаписей_ШтатРазмер КАК ОтборЗаписей_ШтатРазмер 
		|		ПО 
		|			Записи.НомерСтроки = ОтборЗаписей_ШтатРазмер.НомерСтроки
		|			И Записи.ПовышенияНомерСтроки = ОтборЗаписей_ШтатРазмер.ПовышенияНомерСтроки
		|			И Записи.Сотрудник = ОтборЗаписей_ШтатРазмер.Сотрудник
		|			И Записи.Коэффициент = ОтборЗаписей_ШтатРазмер.Коэффициент
		|			И Записи.Действие = ОтборЗаписей_ШтатРазмер.Действие
		|			И Записи.ДатаНачала = ОтборЗаписей_ШтатРазмер.ДатаНачала
		|			И Записи.ДатаОкончания = ОтборЗаписей_ШтатРазмер.ДатаОкончания
		|			И Записи.Временно = ОтборЗаписей_ШтатРазмер.Временно
		|			И Записи.ДругоеПеремещение = ОтборЗаписей_ШтатРазмер.ДругоеПеремещение
		|			И Записи.ШтатРазмер = ОтборЗаписей_ШтатРазмер.ШтатРазмер
		|
		|ГДЕ
		|	Записи.ЕстьОшибка  
		|	ИЛИ Записи.Размер > 0	 
		|	 
		|УПОРЯДОЧИТЬ ПО
		|	Записи.НомерСтроки,		 
		|	Записи.ПовышенияНомерСтроки		 
		|";
		
		
	Иначе	
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
		
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Ссылка,
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.НомерСтроки,
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Коэффициент,
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Размер,
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Сотрудник,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаНачала,
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Действие,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Временно,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДатаОкончания,
		|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.ДругоеПеремещение
		|ИЗ
		|	Документ.КадровоеПеремещениеОрганизаций.ПовышенияПоИнструкции КАК КадровоеПеремещениеОрганизацийПовышенияПоИнструкции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
		|		ПО КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Ссылка = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка
		|			И КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Сотрудник = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник
		|ГДЕ
		|	КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Ссылка = &ДокументСсылка
		|	И КадровоеПеремещениеОрганизацийПовышенияПоИнструкции.Сотрудник <> &ПустойСотрудник";
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	КонецЕсли; 
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции



// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники"": ";
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		// Сотрудник
		НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
		Если НетСотрудника Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
		КонецЕсли;
		
		// ДатаНачала
		НетДатыНачала = Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала);
		Если НетДатыНачала Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указазана дата перемещения!", Отказ, Заголовок);
		КонецЕсли;
		
		// Организация сотрудника должна совпадать с организацией в документе
		Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный работник оформлен на другую организацию!", Отказ, Заголовок);
		КонецЕсли;
		
		// Подразделение
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение, куда переводится работник!", Отказ, Заголовок);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
		КонецЕсли;
		
		// Должность
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана должность, на которую переводится работник!", Отказ, Заголовок);
		КонецЕсли;
		
		// Количество ставок
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок!", Отказ, Заголовок);
		ИначеЕсли Не НетДатыНачала И ПроверкаШтатногоРасписания Тогда
			Если ВыборкаПоСтрокамДокумента.ОстатокСтавок < ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок Тогда
				//ПСА 28.01.2021 СВФР-007121 +++
				//если не ((Организация.ИНН = "100074549" или Организация.ИНН = "500021638") и ВыборкаПоСтрокамДокумента.СдельнаяОплата) Тогда //О.Т. Аверсон 15.10.2015 № 638
				если не (ВыборкаПоСтрокамДокумента.СдельнаяОплата) Тогда
					//+++ПСА 28.01.2021 СВФР-007121
					//(начало) закомментировано Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
					//ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "в штатном расписании не предусмотрены ставки для перевода работника!", Отказ, Заголовок);
					//(завершение) закомментировано Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
					//(начало) добавлено Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
					ОбщегоНазначения.СообщитьОбОшибке( СтрокаНачалаСообщенияОбОшибке + "в штатном расписании не предусмотрены ставки для перевода работника ( в наличии ставок = "
					+ ВыборкаПоСтрокамДокумента.ОстатокСтавок 
					+ ", необходимо ставок = " + ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок + " ) !", Отказ, Заголовок );
					//(завершение) добавлено Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НетСотрудника ИЛИ НетДатыНачала Тогда
			Возврат; // Дальше не проверяем
		КонецЕсли;
		
		// ГрафикРаботы
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы)  Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан рабочий график!", Отказ, Заголовок);
		КонецЕсли;
		
		// ДатаОкончания
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) и ВыборкаПоСтрокамДокумента.ДатаНачала > ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала перемещения не может превышать дату окончания!", Отказ, Заголовок);
		КонецЕсли;
		
		//+ СВЭЙ КДЯ 17.02.20 <Новая заявка>
		//Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) и ВыборкаПоСтрокамДокумента.ДатаНачала = ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала перемещения не может быть равной дате окончания, 
		//	| т.к. дате окончания соответствует новое состояние сотрудника!", Отказ, Заголовок);
		//КонецЕсли;
		//- СВЭЙ КДЯ 17.02.20 <Новая заявка>
		
		// Проверка: ранее работник должен быть принят на работу
		Если ВыборкаПоСтрокамДокумента.ПрежняяСтавка = NULL Тогда
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " еще не принят на работу!";
			Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ПрежняяСтавка = 0 Тогда	
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен (с " + Формат(ВыборкаПоСтрокамДокумента.ДатаПоследнегоДвиженияПоРаботнику, "ДЛФ=DD") + ")!";
			Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		КонецЕсли;
		
		// Проверка: противоречие другой строке документа
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			СтрокаСообщениеОбОшибке = "одним документом допускается регистрировать только одно перемещение работника - см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.РазрядЕТС)) И РольДоступна("ОТиЗ") Тогда
			ОбщегоНазначения.СообщитьОбОшибке( "Не введен разряд ЕТС!");			
		КонецЕсли;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "КонфликтныйДокумент" Тогда	
		
		// противоречие другим кадровым приказам
		Если НЕ ЗначениеЗаполнено(ЗаменитьДанныеРегистровПоДокИзменПериодРекв) Тогда //Аверсон 26.01.2020 КВВ СВФР-005034
			СтрокаСообщениеОбОшибке = "период действия приказа противоречит кадровому приказу " + Символы.ПС + Символы.Таб + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОсновныеНачисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Вид расчета
	НетВР = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета);
	Если НетВР И ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ, Заголовок);
	Иначе
		
		// Соответствие размера "основного" начисления штатному расписанию
		Если ПроверкаШтатногоРасписания И НЕ ВыборкаПоСтрокамДокумента.РазмерСоответствуетШТР Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "размер основного начисления не соответствует штатному расписанию!", Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		ИспользуютсяНачисленияВВалюте = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ИспользуютсяНачисленияВВалюте");
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
	КонецЕсли;
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.Период = NULL Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.Период = ВыборкаПоСтрокамДокумента.ДатаДвижения Тогда
		Если НЕ ЗначениеЗаполнено(ЗаменитьДанныеРегистровПоДокИзменПериодРекв) Тогда //Аверсон 26.01.2020 КВВ СВФР-005034 
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "на дату "+ ВыборкаПоСтрокамДокумента.Период + " изменение начисления уже зарегистрировано документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	// Двойные строки
	Если Не НетВР и Не НетСотрудника и ВыборкаПоСтрокамДокумента.ДвойнаяСтрока <> NULL Тогда
		ПрекращатьНачинатьОснНачСообщение = Ложь; //Аверсон 07.07.2021 КВВ СВФР-007578
		Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
			СтрокаСообщениеОбОшибке = "основное начисление работника следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
		Иначе
			//Аверсон 07.07.2021 КВВ СВФР-007578 (
			ПрекращатьНачинатьОснНачСообщение = Ложь;
			Если Организация.ИНН = "700067572" Тогда
				РабОргСтроки = РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник));
				Для Каждого СтрокаТаблицы Из РабОргСтроки Цикл
					Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) 
						И СтрокаТаблицы.Должность <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(СтрокаТаблицы.ДатаНачала-1, Новый Структура("Сотрудник",СтрокаТаблицы.Сотрудник)).Должность Тогда
						ПрекращатьНачинатьОснНачСообщение = Истина;
						Отказ = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//Аверсон 07.07.2021 КВВ СВФР-007578 )
			СтрокаСообщениеОбОшибке = "работнику не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
		КонецЕсли;
		Если НЕ ПрекращатьНачинатьОснНачСообщение Тогда //Аверсон 07.07.2021 КВВ СВФР-007578
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента,    ВыборкаПоСтрокамДокумента, СтруктураПараметров = "", ТЗНовыхМТСБобруйск=Неопределено, ТЗДатыНачалаРС = Неопределено) //Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (ТЗНовыхМТСБобруйск)
	                                                                                                                                                                                                  //Аверсон ЕАЕ 16.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		// отразим новое место работы
		если ПовышениеОкладов и (ВыборкаПоСтрокамДокумента.БезЕТС или (не ВыборкаПоСтрокамДокумента.БезЕТС и Организация.НеУчитыватьЕТКС)) Тогда //Островская Татьяна 04.01.2014 № 17020
		иначе
			
			Движение = Движения.РаботникиОрганизаций.Добавить();
			
			//Аверсон ЕАЕ 16.12.2024 СВФР-014218
			//Гродно
			ДатаПроверки = ВыборкаПоСтрокамДокумента.ДатаНачала;
			
			Если ТЗДатыНачалаРС <> Неопределено Тогда
				НужнаяСтр = ТЗДатыНачалаРС.Найти(ВыборкаПоСтрокамДокумента.Сотрудник, "Сотрудник");
				Если НужнаяСтр <> Неопределено Тогда
					ДатаПроверки = НужнаяСтр.ДатаНачалаРС;	
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-014218
			
			// Свойства
			
			//Аверсон ЕАЕ 16.12.2024 СВФР-014218
			//Гродно
			//Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала;
			Движение.Период						= ДатаПроверки;
			//Аверсон СВФР-014218
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ТипРаботника				= ВыборкаПоСтрокамДокумента.ТипРаботника;
			Движение.СотрудникЗаменяемый		= ВыборкаПоСтрокамДокумента.СотрудникЗаменяемый;
			
			// Ресурсы
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
			Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок;
			Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
			//Если НЕ ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 05.11.2015 № 679
			Движение.РазрядЕТС                  = ВыборкаПоСтрокамДокумента.РазрядЕТС; //РБ
			Движение.КоэффициентЕТС             = ВыборкаПоСтрокамДокумента.КоэффициентЕТС; //РБ
			Движение.ПовышенныйКоэффициентЕТС   = ВыборкаПоСтрокамДокумента.ПовышенныйКоэффициентЕТС; //РБ
			Движение.ИтоговоеПовышениеПоИнструкции = ВыборкаПоСтрокамДокумента.ИтоговоеПовышениеПоИнструкции; //РБ
			Движение.ТарифнаяСтавкаПервогоРазряда  = ВыборкаПоСтрокамДокумента.ТарифнаяСтавкаПервогоРазряда; //РБ
			Движение.БезЕТС				= ВыборкаПоСтрокамДокумента.БезЕТС;//РБ 
			//Иначе
			//	Движение.БезЕТС				= ВыборкаПоСтрокамДокумента.БезЕТС;//РБ 
			//КонецЕсли;
			Движение.Категория                  = ВыборкаПоСтрокамДокумента.Категория; //РБ
			Движение.Временно                   = ВыборкаПоСтрокамДокумента.Временно; //Толик
			Движение.УсловияТрудаИзмерение		= ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение; //РБ
			Движение.ВидДеятельностиИзмерение	= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение; //РБ
			Движение.ИсключитьИзПУ2 			= ВыборкаПоСтрокамДокумента.ИсключитьИзПУ2; //Аверсон 10.06.2019 КВВ СВФР-004418
			// Реквизиты
			Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.Перемещение;
			Движение.ОбособленноеПодразделение	= ВыборкаПоСтрокамДокумента.ОрганизацияПодразделения;
			Движение.ОкладВВалюте				= ВыборкаПоСтрокамДокумента.ОкладВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
			Движение.ДляПечати                  = ВыборкаПоСтрокамДокумента.ДляПечати;
			
			Движение.ауМестоРаботы = ВыборкаПоСтрокамДокумента.ауМестоРаботы; //Аверсон 08.12.2021 КВВ СВФР-008463
			
			//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
			Если Организация.ИНН = "700103211" Тогда 
				Движение.ВременныйПереводКлимовичи = ВыборкаПоСтрокамДокумента.ВременныйПереводКлимовичи;
			КонецЕсли;
			//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			
			Если НЕ ВыборкаПоСтрокамДокумента.НапомнитьПоЗавершении И НЕ ВыборкаПоСтрокамДокумента.ДругоеПеремещение Тогда
				
				// вернем прежние данные по прежнему месту работы
				//Движение = Движения.РаботникиОрганизаций.Добавить();
				
				//толик
				//изменил с добавлением ещё одной записи в регистр с пометкой временно
				
				мНайдено = Ложь;
				
				//Аверсон ЕАЕ 17.12.2024 СВФР-014218 
				//Гродно
				Если ТЗДатыНачалаРС = Неопределено Тогда
					мДата = ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток;
				Иначе
					мДата = ВыборкаПоСтрокамДокумента.ДатаНачала;
				КонецЕсли;
				//мДата = ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток;
				//Аверсон СВФР-014218
				
				Пока НЕ мНайдено Цикл
					мРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(мДата,
					Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
					Если мРаботникиОрганизаций[0].Временно Тогда
						
						//Аверсон ЕАЕ 17.12.2024 СВФР-014218
						//Гродно
						//Если ТЗДатыНачалаРС = Неопределено Тогда
						//	мДата = мРаботникиОрганизаций[0].Период - мДлинаСуток;
						//Иначе
						//	мДата = мРаботникиОрганизаций[0].Период;
						//КонецЕсли;
						мДата = мРаботникиОрганизаций[0].Период - мДлинаСуток;
						//Аверсон СВФР-014218
						
					Иначе
						мНайдено = Истина;
					КонецЕсли
				КонецЦикла;
				если ПовышениеОкладов и (ВыборкаПоСтрокамДокумента.БезЕТС или (не ВыборкаПоСтрокамДокумента.БезЕТС и Организация.НеУчитыватьЕТКС)) Тогда  //Островская Татьяна 04.01.2014 № 17020
				иначе
					Движение = Движения.РаботникиОрганизаций.Добавить();
					
					// Свойства
					Движение.Период						= НачалоДня(ВыборкаПоСтрокамДокумента.ДатаОкончания) + мДлинаСуток;
					
					// Измерения
					Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
					Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
					Движение.ТипРаботника				= ВыборкаПоСтрокамДокумента.ТипРаботника;//О.Т. Аверсон 06.09.2016 № 1432
					
					// Ресурсы
					Движение.ПодразделениеОрганизации	= мРаботникиОрганизаций[0].ПодразделениеОрганизации;
					Движение.Должность					= мРаботникиОрганизаций[0].Должность;
					Движение.ЗанимаемыхСтавок			= мРаботникиОрганизаций[0].ЗанимаемыхСтавок;
					Движение.ГрафикРаботы				= мРаботникиОрганизаций[0].ГрафикРаботы;
					//Если НЕ мРаботникиОрганизаций[0].БезЕТС Тогда //О.Т. Аверсон 05.11.2015 № 679
					Движение.РазрядЕТС                  = мРаботникиОрганизаций[0].РазрядЕТС; //РБ
					Движение.КоэффициентЕТС             = мРаботникиОрганизаций[0].КоэффициентЕТС; //РБ
					Движение.ПовышенныйКоэффициентЕТС   = мРаботникиОрганизаций[0].ПовышенныйКоэффициентЕТС; //РБ
					Движение.ИтоговоеПовышениеПоИнструкции = мРаботникиОрганизаций[0].ИтоговоеПовышениеПоИнструкции; //РБ
					Движение.ТарифнаяСтавкаПервогоРазряда  = мРаботникиОрганизаций[0].ТарифнаяСтавкаПервогоРазряда; //РБ
					Движение.БезЕТС				= мРаботникиОрганизаций[0].БезЕТС;//РБ 
					//Иначе
					//	Движение.БезЕТС				= мРаботникиОрганизаций[0].БезЕТС;//РБ 
					//КонецЕсли;	
					Движение.Категория                  = мРаботникиОрганизаций[0].Категория; //РБ
					Движение.Временно                   = ВыборкаПоСтрокамДокумента.Временно; //Толик
					Движение.УсловияТрудаИзмерение		= мРаботникиОрганизаций[0].УсловияТрудаИзмерение; //РБ
					Движение.ВидДеятельностиИзмерение	= мРаботникиОрганизаций[0].ВидДеятельностиИзмерение; //РБ
					Движение.ИсключитьИзПУ2 			= ВыборкаПоСтрокамДокумента.ИсключитьИзПУ2; //Аверсон 14.08.2019 КВВ СВФР-004639
					// Реквизиты                                   
					Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.Перемещение;
					Движение.ОбособленноеПодразделение	= мРаботникиОрганизаций[0].ОбособленноеПодразделение;
					Движение.ОкладВВалюте				= мРаботникиОрганизаций[0].ОкладВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					Движение.ДляПечати                  = мРаботникиОрганизаций[0].ДляПечати;
					
					Движение.ауМестоРаботы = мРаботникиОрганизаций[0].ауМестоРаботы; //Аверсон 08.12.2021 КВВ СВФР-008463
					
					//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
					Если Организация.ИНН = "700103211" Тогда 
						Движение.ВременныйПереводКлимовичи = мРаботникиОрганизаций[0].ВременныйПереводКлимовичи;
					КонецЕсли;
					//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
					
				КонецЕсли;	
			Иначе
				Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
					
					Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
					
					// Свойства
					Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
					
					// Измерения
					Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
					Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
					Движение.ДатаИзменения				= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
					Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение;
					
					// Реквизиты
					Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение;
					Движение.Должность					= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
					Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ПрежнийГрафикРаботы;
					Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
					Движение.ЗаниматьСтавку				= Истина;
					Движение.НеНапоминатьОСобытии		= ВыборкаПоСтрокамДокумента.НеНапоминатьОСобытии;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//толик
		//добавли напоминания для кадров при временном перемещении
		Если ВыборкаПоСтрокамДокумента.Временно И Не(ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания)) Тогда
			Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала + мДлинаСуток;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ДатаИзменения				= ВыборкаПоСтрокамДокумента.ДатаНачала + мДлинаСуток;
			Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение;
			
			// Реквизиты
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
			Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ПрежнийГрафикРаботы;
			Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
			Движение.ЗаниматьСтавку				= Истина;
			Движение.НеНапоминатьОСобытии		= ВыборкаПоСтрокамДокумента.НеНапоминатьОСобытии;
		КонецЕсли;
		
		//добавил проверку по временным перемещениям
		
		//РБ н
		// Движения по регистру "ТарифныеСтавкиработниковОрганизации"
		Движение = Движения.ТарифныеСтавкиРаботниковОрганизации.Добавить();
		// Свойства
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		//Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.Период = ДатаПроверки;
		//Аверсон СВФР-014218
		
		// Измерения
		Движение.Сотрудник                  = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		Если ВыборкаПоСтрокамДокумента.Временно Тогда
			
			//Аверсон ЕАЕ 17.12.2024 СВФР-014218
			//Гродно 
			Если ТЗДатыНачалаРС = Неопределено Тогда
				НаДату = ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток;
			Иначе
				НаДату = ВыборкаПоСтрокамДокумента.ДатаНачала;
			КонецЕсли;
			
			//мТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток,
			//Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
			мТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(НаДату,
			Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
			//Аверсон СВФР-014218
			
			Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			Движение.ПроцентПоКонтракту         = мТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладВВалюте;
			Движение.Валюта	= мТарифныеСтавкиРаботниковОрганизации.Валюта;
			Движение.СуммаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= мТарифныеСтавкиРаботниковОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
			
			//ИначеЕсли ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 05.11.2015 № 679
			//	Движение.ТарифнаяСтавка 			= ВыборкаПоСтрокамДокумента.ТарифнаяСтавка;
			//	Движение.Ставка 					= ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавка;
		иначе
			Движение.Ставка          			= ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавка;
			Движение.ПроцентПоКонтракту         = ВыборкаПоСтрокамДокумента.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= ВыборкаПоСтрокамДокумента.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = ВыборкаПоСтрокамДокумента.ТарифныйСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= ВыборкаПоСтрокамДокумента.ОкладВВалюте;
			Движение.Валюта	= ВыборкаПоСтрокамДокумента.Валюта;
			Движение.СуммаВВалюте	= ВыборкаПоСтрокамДокумента.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= ВыборкаПоСтрокамДокумента.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= ВыборкаПоСтрокамДокумента.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
		КонецЕсли;
		Если (НЕ ВыборкаПоСтрокамДокумента.Временно) И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			Движение = Движения.ТарифныеСтавкиРаботниковОрганизации.Добавить();
			// Свойства
			Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаОкончания+мДлинаСуток;
			// Измерения
			Движение.Сотрудник                  = ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			//Если НЕ ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 05.11.2015 № 679
			мТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток,
			Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
			Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			Движение.ПроцентПоКонтракту         = мТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладВВалюте;
			Движение.Валюта	= мТарифныеСтавкиРаботниковОрганизации.Валюта;
			Движение.СуммаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= мТарифныеСтавкиРаботниковОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
			//Иначе
			//	Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			//	Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			//КонецЕсли;
			
			//Аверсон 30.03.2022 КВВ СВФР-008797 (пункт 1) (
			Если Организация.ИНН = "700067572"
				И НЕ НеПересчитыватьТЧ
				И НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаНачала) <> НачалоМесяца(КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания)+1) Тогда
				З = Новый Запрос;
				з.Текст = "ВЫБРАТЬ
				|РаботникиОрганизацииСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
				|ТарифныеСтавкиПервогоРазрядаОрганизаций.Размер
				|ИЗ
				|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период,Сотрудник = &Сотрудник)КАК РаботникиОрганизацииСрезПоследних
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(&Период) КАК ТарифныеСтавкиПервогоРазрядаОрганизаций
				|ПО РаботникиОрганизацииСрезПоследних.ТарифнаяСтавкаПервогоРазряда = ТарифныеСтавкиПервогоРазрядаОрганизаций.ТарифнаяСтавка";
				З.УстановитьПараметр("Период",НачалоДня(ВыборкаПоСтрокамДокумента.ДатаНачала));
				З.УстановитьПараметр("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник);
				РезЗ = З.Выполнить().Выгрузить();
				БылаТСПР = РезЗ[0].ТарифнаяСтавкаПервогоРазряда;
				БылРазмерТСПР = РезЗ[0].Размер;
				
				СталаТСПР = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ВыборкаПоСтрокамДокумента.ДатаОкончания,Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник)).ТарифнаяСтавкаПервогоРазряда;
				
				БылРО = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НачалоДня(ВыборкаПоСтрокамДокумента.ДатаНачала),Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
				БылКоэффициентЕТС = БылРО.КоэффициентЕТС;
				БылПовышенныйКоэффициентЕТС = БылРО.ПовышенныйКоэффициентЕТС;
				//	БылПроцентПоКонтракту = БылРО.ПроцентПоКонтракту;
				БылЗанимаемыхСтавок = БылРО.ЗанимаемыхСтавок;
				
				Если СталаТСПР = БылаТСПР Тогда
					СталРазмерТСПР = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания)+1,
					Новый Структура("Организация,ТарифнаяСтавка", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, СталаТСПР)).Размер;
					Если БылРазмерТСПР <> СталРазмерТСПР Тогда
						
						БылПроцентПоКонтракту = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания)+1,
						Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник)).ПроцентПоКонтракту;
						
						Движение.Период = КонецДня(ВыборкаПоСтрокамДокумента.ДатаОкончания) + 1;
						
						Коэффициент_ = БылПовышенныйКоэффициентЕТС * БылКоэффициентЕТС;	
						ТарифБезСтавки_  = Окр( Коэффициент_ * СталРазмерТСПР, 2 );
						
						ТарифПоИнструкции_ = ТарифБезСтавки_ * БылЗанимаемыхСтавок;
						ТарифныйСПовышениемПоИнструкции_ = ОбщегоНазначения.ОкруглитьЗначение2016( ТарифПоИнструкции_, Дата );
						
						МесячнаяТарифнаяСтавка_ = ОбщегоНазначения.ОкруглитьПоВалюте( 
						?( БылПроцентПоКонтракту = 0, ТарифныйСПовышениемПоИнструкции_, 
						ТарифныйСПовышениемПоИнструкции_ + ОбщегоНазначения.ОкруглитьПоВалюте(
						ТарифБезСтавки_ * БылПроцентПоКонтракту / 100, Константы.ВалютаРегламентированногоУчета.Получить() )
						* БылЗанимаемыхСтавок ), Константы.ВалютаРегламентированногоУчета.Получить() );	
						
						Движение.Ставка = МесячнаяТарифнаяСтавка_;
						Движение.ТарифнаяСтавка 			= ТарифныйСПовышениемПоИнструкции_;
						Движение.ТарифнаяСПовышениемПоИнструкции = ТарифныйСПовышениемПоИнструкции_;
						
						Стр_ТЗНовыхМТСБобруйск = ТЗНовыхМТСБобруйск.Добавить();
						Стр_ТЗНовыхМТСБобруйск.Сотрудник = ВыборкаПоСтрокамДокумента.Сотрудник;
						Стр_ТЗНовыхМТСБобруйск.МТС = МесячнаяТарифнаяСтавка_;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			//Аверсон 30.03.2022 КВВ СВФР-008797 (пункт 1) )
			
		КонецЕсли;				
		
		//РБ к
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()


Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса, ТЗНовыхМТСБобруйск=Неопределено)//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (ТЗНовыхМТСБобруйск)
	
	Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период						= ВыборкаСтрокЗапроса.Период;
	
	// Измерения
	Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Если НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение	= ВыборкаСтрокЗапроса.ВидРасчета;
	КонецЕсли;
	
	// Ресурсы	
	Движение.Действие					= ВыборкаСтрокЗапроса.Действие;
	Движение.ВидРасчета					= ВыборкаСтрокЗапроса.ВидРасчета;
	Если ВыборкаСтрокЗапроса.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		Движение.ТарифныйРазряд1		= ВыборкаСтрокЗапроса.ТарифныйРазряд1;
		Движение.Показатель1			= ВыборкаСтрокЗапроса.Показатель1;
		Движение.Показатель1ВВалюте		= ВыборкаСтрокЗапроса.Показатель1ВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
		Движение.Валюта1				= ВыборкаСтрокЗапроса.Валюта1;
		Движение.ТарифныйРазряд2		= ВыборкаСтрокЗапроса.ТарифныйРазряд2;
		Движение.Показатель2			= ВыборкаСтрокЗапроса.Показатель2;
		Движение.Валюта2				= ВыборкаСтрокЗапроса.Валюта2;
		Движение.ТарифныйРазряд3		= ВыборкаСтрокЗапроса.ТарифныйРазряд3;
		Движение.Показатель3			= ВыборкаСтрокЗапроса.Показатель3;
		Движение.Валюта3				= ВыборкаСтрокЗапроса.Валюта3;		
		Движение.ТарифныйРазряд4		= ВыборкаСтрокЗапроса.ТарифныйРазряд4;
		Движение.Показатель4			= ВыборкаСтрокЗапроса.Показатель4;
		Движение.Валюта4				= ВыборкаСтрокЗапроса.Валюта4;		
	КонецЕсли;
	Движение.Временно                   = ВыборкаСтрокЗапроса.Временно; //Толик
	
	// Движения на дату завершения
	Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) И НЕ ВыборкаСтрокЗапроса.ДругоеПеремещение Тогда
		// Ресурсы
		//толик
		//Движение.ПериодЗавершения			= ВыборкаСтрокЗапроса.ДатаОкончания + мДлинаСуток;
		//Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		//	Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Начать
		//ИначеЕсли ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
		//	Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Прекратить
		//Иначе	
		//	Движение.ДействиеЗавершения		= ВыборкаСтрокЗапроса.Действие;
		//КонецЕсли;
		//Движение.ТарифныйРазряд1Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд1;
		//Движение.Показатель1Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер1;
		//Движение.Валюта1Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта1;
		//Движение.ТарифныйРазряд2Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд2;
		//Движение.Показатель2Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер2;
		//Движение.Валюта2Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта2;
		//Движение.ТарифныйРазряд3Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд3;
		//Движение.Показатель3Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер3;
		//Движение.Валюта3Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта3;
		//Движение.ТарифныйРазряд4Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд4;
		//Движение.Показатель4Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер4;
		//Движение.Валюта4Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта4;		
		//
		//
		//Движение.ВидРасчетаЗавершения		= ВыборкаСтрокЗапроса.ПрежнийВидРасчета;
		//му 
		//толик убрал временные перемещения
		мНайдено = Ложь;
		мДата = ВыборкаСтрокЗапроса.Период - мДлинаСуток;
		Пока НЕ мНайдено Цикл
			мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(мДата,
			Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаСтрокЗапроса.Сотрудник, ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено)));
			Если мПлановыеНачисленияРаботниковОрганизаций.Количество() = 0 Тогда
				мПлановыеНачисленияРаботниковОрганизаций.Добавить();
			КонецЕсли;	
			Если мПлановыеНачисленияРаботниковОрганизаций[0].Временно Тогда
				мДата = мПлановыеНачисленияРаботниковОрганизаций[0].Период - мДлинаСуток;
			Иначе
				мНайдено = Истина;
			КонецЕсли
		КонецЦикла;
		//енд 
		Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
		// Свойства
		
		Если НЕ ЗначениеЗаполнено(мПлановыеНачисленияРаботниковОрганизаций[0].ВидРасчета) Тогда
			//контракт если не было ранее прекратить
			Движение.Период			= НачалоДня(ВыборкаСтрокЗапроса.ПериодЗавершения);
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ВидРасчетаИзмерение	= ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено);
			
			// Ресурсы	
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить;
			
			Движение.ВидРасчета		= ВыборкаСтрокЗапроса.ВидРасчета;
		Иначе
			
			Движение.Период			= НачалоДня(ВыборкаСтрокЗапроса.ПериодЗавершения);
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ВидРасчетаИзмерение	= ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено);
			
			// Ресурсы	
			Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
			ИначеЕсли ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
			Иначе	
				Движение.Действие		= ВыборкаСтрокЗапроса.Действие;
			КонецЕсли;
			Движение.ТарифныйРазряд1	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд1;
			Движение.Показатель1		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель1;
			Движение.Показатель1ВВалюте	= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель1ВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			Движение.Валюта1			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта1;
			Движение.ТарифныйРазряд2	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд2;
			Движение.Показатель2		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель2;
			Движение.Валюта2			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта2;
			Движение.ТарифныйРазряд4	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд4;
			Движение.Показатель4		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель4;
			Движение.Валюта4			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта4;		
			
			Движение.ВидРасчета		= мПлановыеНачисленияРаботниковОрганизаций[0].ВидРасчета;
			
			//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (
			Если Организация.ИНН = "700067572"
				И НЕ НеПересчитыватьТЧ
				И НачалоМесяца(ВыборкаСтрокЗапроса.Период) <> НачалоМесяца(Движение.ПериодЗавершения) Тогда
				Если ТЗНовыхМТСБобруйск <> Неопределено Тогда
					ОтборТЗНовыхМТСБобруйск = Новый Структура;
					ОтборТЗНовыхМТСБобруйск.Вставить("Сотрудник", ВыборкаСтрокЗапроса.Сотрудник);
					СтрокиТЗНовыхМТСБобруйск = ТЗНовыхМТСБобруйск.НайтиСтроки(ОтборТЗНовыхМТСБобруйск);
					Для Каждого СтрТЗНовыхМТСБобруйск Из СтрокиТЗНовыхМТСБобруйск Цикл
						Если Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой Тогда
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Движение.ПериодЗавершения,Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка())).Размер;
							Движение.Показатель1 = Окр(СтрТЗНовыхМТСБобруйск.МТС/ЧасовВГоду,2);
						Иначе
							Движение.Показатель1 = СтрТЗНовыхМТСБобруйск.МТС;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
			//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) )
			
		КонецЕсли;
		//енд		
	КонецЕсли;
	
	// Движения по регистру "КоэффициентИндексацииЗаработка" - отразим факт индексации заработка
	Если ВыборкаПоШапкеДокумента.ИндексацияЗаработка И ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		
		// определим форму оплаты
		Если ВыборкаСтрокЗапроса.СпособРасчета = ВыборкаСтрокЗапроса.СпособРасчетаЗавершения Тогда
			ФормаОплатыДо = ВыборкаСтрокЗапроса.СпособРасчета;
			ФормаОплатыПосле = ВыборкаСтрокЗапроса.СпособРасчета;
		Иначе
			Если ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням 
				Или ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
				ФормаОплатыДо = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
			ИначеЕсли ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок 
				Или ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
				ФормаОплатыДо = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
			Иначе
				ФормаОплатыДо = ВыборкаСтрокЗапроса.СпособРасчета;
			КонецЕсли;
			Если ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням 
				Или ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
				ФормаОплатыПосле = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
			ИначеЕсли ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок 
				Или ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
				ФормаОплатыПосле = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
			Иначе
				ФормаОплатыПосле = ВыборкаСтрокЗапроса.СпособРасчетаЗавершения;
			КонецЕсли;
		КонецЕсли;
		
		//Если ФормаОплатыДо <> ФормаОплатыПосле Тогда
		//	ТекстСообщения = "Сотруднику " + Строка(ВыборкаСтрокЗапроса.Сотрудник) + " изменена форма оплаты труда; коэффициент индексации заработка не зарегистрирован! Для регистрации коэффициента индексации можно воспользоваться документом ""Ввод коэффициентов индексации заработка""";
		//	Если ЗначениеЗаполнено(Заголовок) Тогда
		//		ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
		//		Заголовок = "";
		//	КонецЕсли;
		//	ОбщегоНазначения.СообщитьИнформациюПользователю(ТекстСообщения);
		
		Если ВыборкаСтрокЗапроса.Показатель1Завершения > 0 И ВыборкаСтрокЗапроса.Показатель1 > ВыборкаСтрокЗапроса.Показатель1Завершения Тогда
			Движение = Движения.КоэффициентИндексацииЗаработка.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаСтрокЗапроса.Период;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Ресурсы
			Движение.Коэффициент				= ?(ВыборкаСтрокЗапроса.Показатель1Завершения = 0, 0, ВыборкаСтрокЗапроса.Показатель1 / ВыборкаСтрокЗапроса.Показатель1Завершения);
		КонецЕсли;
		// Движения на дату завершения
		Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) Тогда
			
			Если ВыборкаСтрокЗапроса.Показатель1 > 0 И ВыборкаСтрокЗапроса.Показатель1Завершения > ВыборкаСтрокЗапроса.Показатель1 Тогда
				Движение = Движения.КоэффициентИндексацииЗаработка.Добавить();
				
				// Свойства
				Движение.Период						= ВыборкаСтрокЗапроса.ПериодЗавершения;
				
				// Измерения
				Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
				Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
				
				// Ресурсы
				Движение.Коэффициент				= ?(ВыборкаСтрокЗапроса.Показатель1 =0, 0, ВыборкаСтрокЗапроса.Показатель1Завершения / ВыборкаСтрокЗапроса.Показатель1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоНачислениям()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента, СтруктураПараметров = "")
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		ПрежняяСтавка			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
		ПрежнееПодразделение	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение; 
		ПрежняяДолжность		= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
		ПрежнийУсловияТруда     = ВыборкаПоСтрокамДокумента.ПрежнийУсловияТрудаИзмерение;
		ПрежнийВидДеятельностиИзмерение = ВыборкаПоСтрокамДокумента.ПрежнийВидДеятельностиИзмерение;
		
		// по прежнему месту работы освободим занимаемые ранее ставки
		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ПодразделениеОрганизации		= ПрежнееПодразделение;
		Движение.Должность						= ПрежняяДолжность;
		Движение.УсловияТрудаИзмерение		    = ПрежнийУсловияТруда;
		Движение.ВидДеятельностиИзмерение		= ПрежнийВидДеятельностиИзмерение;
		
		// Ресурсы
		Движение.КоличествоСтавок				= ПрежняяСтавка; 
		
		// по новому месту работы займем указанные ставки
		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		Движение.Должность						= ВыборкаПоСтрокамДокумента.Должность;
		Движение.УсловияТрудаИзмерение		    = ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение;
		Движение.ВидДеятельностиИзмерение		= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение;
		
		// Ресурсы
		Движение.КоличествоСтавок				= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок; 
		
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания)
			и НЕ ВыборкаПоСтрокамДокумента.НапомнитьПоЗавершении
			И НЕ ВыборкаПоСтрокамДокумента.ДругоеПеремещение Тогда
			
			// по прежнему месту работы займем временно освобожденные ставки
			Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
			Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ПодразделениеОрганизации	= ПрежнееПодразделение;
			Движение.Должность					= ПрежняяДолжность;
			Движение.УсловияТрудаИзмерение		    = ПрежнийУсловияТруда;
			Движение.ВидДеятельностиИзмерение		= ПрежнийВидДеятельностиИзмерение;
			
			// Ресурсы
			Движение.КоличествоСтавок			= ПрежняяСтавка; 
			
			// по новому месту работы освободим временно занимавшиеся ставки
			Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
			Движение.ВидДвижения				= ВидДвиженияНакопления.Расход;
			
			// Измерения
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
			Движение.УсловияТрудаИзмерение		    = ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение;
			Движение.ВидДеятельностиИзмерение		= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение;
			
			// Ресурсы
			Движение.КоличествоСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

Процедура ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам)
	
	Движение = Движения.КоэфПовышенияТО.Добавить();
	
	Движение.Период = ВыборкаПоКоэфициентам.ДатаНачала;
	Движение.Сотрудник = ВыборкаПоКоэфициентам.Сотрудник;
	Движение.Коэффициент = ВыборкаПоКоэфициентам.Коэффициент; 
	
	Движение.Размер = ВыборкаПоКоэфициентам.Размер;
	Движение.Действие = ВыборкаПоКоэфициентам.Действие;
	//толик
	Движение.Временно = ВыборкаПоКоэфициентам.Временно;
	
	Если ЗначениеЗаполнено(ВыборкаПоКоэфициентам.ДатаОкончания) И НЕ ВыборкаПоКоэфициентам.ДругоеПеремещение Тогда
		мНайдено = Ложь;
		мДата = ВыборкаПоКоэфициентам.ДатаНачала - мДлинаСуток;
		Пока НЕ мНайдено Цикл
			мПлановые = РегистрыСведений.КоэфПовышенияТО.СрезПоследних(мДата,
			Новый Структура("Сотрудник, Коэффициент", ВыборкаПоКоэфициентам.Сотрудник, ВыборкаПоКоэфициентам.Коэффициент));
			Если мПлановые.Количество() = 0 Тогда
				мПлановые.Добавить();
			КонецЕсли;	
			Если мПлановые[0].Временно Тогда
				мДата = мПлановые[0].Период - мДлинаСуток;
			Иначе
				мНайдено = Истина;
			КонецЕсли
		КонецЦикла;
		Движение = Движения.КоэфПовышенияТО.Добавить();
		
		Движение.Период = НачалоДня(ВыборкаПоКоэфициентам.ДатаОкончания) + мДлинаСуток;
		Движение.Сотрудник = ВыборкаПоКоэфициентам.Сотрудник;
		Движение.Коэффициент = ВыборкаПоКоэфициентам.Коэффициент; 
		
		Движение.Размер = мПлановые[0].Размер;
		Если ВыборкаПоКоэфициентам.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
		ИначеЕсли ВыборкаПоКоэфициентам.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
		Иначе	
			Движение.Действие		= ВыборкаПоКоэфициентам.Действие;
		КонецЕсли;
	КонецЕсли;
	//
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоПовышениям(ВыборкаПоПовышениям)
	
	Если НЕ (ВыборкаПоПовышениям.Размер = 0 И НЕ ЗначениеЗаполнено(ВыборкаПоПовышениям.Коэффициент)) Тогда //СВЭЙ 19.02.2024 КВВ СВФР-012329	
		Движение = Движения.ПовышенияПоИнструкции.Добавить();
		
		Движение.Период = ВыборкаПоПовышениям.ДатаНачала;
		Движение.Сотрудник = ВыборкаПоПовышениям.Сотрудник;
		Движение.Коэффициент = ВыборкаПоПовышениям.Коэффициент; 
		
		Движение.Размер = ВыборкаПоПовышениям.Размер;
		Движение.Действие = ВыборкаПоПовышениям.Действие;
		//толик
		Движение.Временно = ВыборкаПоПовышениям.Временно;
		
		Если ЗначениеЗаполнено(ВыборкаПоПовышениям.ДатаОкончания) И НЕ ВыборкаПоПовышениям.ДругоеПеремещение Тогда
			мНайдено = Ложь;
			мДата = ВыборкаПоПовышениям.ДатаНачала - мДлинаСуток;
			Пока НЕ мНайдено Цикл
				мПлановые = РегистрыСведений.ПовышенияПоИнструкции.СрезПоследних(мДата,
				Новый Структура("Сотрудник, Коэффициент", ВыборкаПоПовышениям.Сотрудник, ВыборкаПоПовышениям.Коэффициент));
				Если мПлановые.Количество() = 0 Тогда
					мПлановые.Добавить();
				КонецЕсли;	
				Если мПлановые[0].Временно Тогда
					мДата = мПлановые[0].Период - мДлинаСуток;
				Иначе
					мНайдено = Истина;
				КонецЕсли
			КонецЦикла;
			Движение = Движения.ПовышенияПоИнструкции.Добавить();
			
			Движение.Период = НачалоДня(ВыборкаПоПовышениям.ДатаОкончания) + мДлинаСуток;
			Движение.Сотрудник = ВыборкаПоПовышениям.Сотрудник;
			Движение.Коэффициент = ВыборкаПоПовышениям.Коэффициент; 
			
			Движение.Размер = мПлановые[0].Размер;
			Если ВыборкаПоПовышениям.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
			ИначеЕсли ВыборкаПоПовышениям.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
			Иначе	
				Движение.Действие		= ВыборкаПоПовышениям.Действие;
			КонецЕсли;
		КонецЕсли;
		//
	КонецЕсли;
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
Процедура ПроверитьЗаполнениеСтрокиПовышения( ВыборкаПоПовышениям, Отказ );
	Если СокрЛП( Организация.ИНН ) <> "806000046" Тогда
		Возврат;	
	КонецЕсли; 
	Если ВыборкаПоПовышениям.ЕстьОшибка Тогда
		СообщениеОбОшибке = НСтр( "ru='%ТекстОшибки'" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ТекстОшибки", ВыборкаПоПовышениям.ТекстОшибки );
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%НомерСтроки", ВыборкаПоПовышениям.НомерСтроки );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%Сотрудник", ВыборкаПоПовышениям.Сотрудник );
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ПриемРазмер", "" + ВыборкаПоПовышениям.Размер + "%" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ШтатРазмер", "" + ВыборкаПоПовышениям.ШтатРазмер + "%" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%Коэффициент", """" + СокрЛП( ВыборкаПоПовышениям.Коэффициент ) + """" );
		Сообщить( СообщениеОбОшибке, СтатусСообщения.Важное );
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ПроверитьЗаполнениеСтрокиПовышения
//- СВЭЙ 07.02.19 КДЯ СВФР-003209 



Процедура ОбработкаПроведения(Отказ, Режим)  
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (
	Если Организация.ИНН = "700067572" И НЕ НеПересчитыватьТЧ Тогда
		ТЗНовыхМТСБобруйск = Новый ТаблицаЗначений;
		ТЗНовыхМТСБобруйск.Колонки.Добавить("Сотрудник");
		ТЗНовыхМТСБобруйск.Колонки.Добавить("МТС");
	КонецЕсли;
	//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) )
	
	//Аверсон 26.01.2020 КВВ СВФР-005034 (
	Если ЗначениеЗаполнено(Ссылка.ЗаменитьДанныеРегистровПоДокИзменПериодРекв) Тогда 
		НачатьТранзакцию();
		Для А = 1 По 7 Цикл
			Если 	  А = 1 Тогда Набор = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();
			ИначеЕсли А = 2 Тогда Набор = РегистрыНакопления.ЗанятыеШтатныеЕдиницыОрганизаций.СоздатьНаборЗаписей();
			ИначеЕсли А = 3 Тогда Набор = РегистрыСведений.КоэфПовышенияТО.СоздатьНаборЗаписей(); 
			ИначеЕсли А = 4 Тогда Набор = РегистрыСведений.КоэффициентИндексацииЗаработка.СоздатьНаборЗаписей(); 
			ИначеЕсли А = 5 Тогда Набор = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
			ИначеЕсли А = 6 Тогда Набор = РегистрыСведений.ПовышенияПоИнструкции.СоздатьНаборЗаписей();
			ИначеЕсли А = 7 Тогда Набор = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.СоздатьНаборЗаписей();
			КонецЕсли;
			
			//НаборЗаписей.Отбор.Регистратор.Значение = Ссылка.ЗаменитьДанныеРегистровПоДокИзменПериодРекв;
			Набор.Отбор.Регистратор.Установить(Ссылка.ЗаменитьДанныеРегистровПоДокИзменПериодРекв);
			//Если А = 2 Тогда
			//	НаборЗаписей.Отбор.Должность.Установить(РаботникиОрганизации[0].Должность);
			//	НаборЗаписей.Отбор.ПодразделениеОрганизации.Установить(РаботникиОрганизации[0].ПодразделениеОрганизации);
			//Иначе
			//	НаборЗаписей.Отбор.Сотрудник.Установить(РаботникиОрганизации[0].Сотрудник);
			//КонецЕсли;
			//НаборЗаписей.Записать();  Сообщить("Удалили" + СокрЛП(А));
			
			Набор.Прочитать();
			Для Индекс = 1 - Набор.Количество() По 0 Цикл
				Запись = Набор[- Индекс];
				Если А = 2 Тогда
					Если Запись.Должность = РаботникиОрганизации[0].Должность И Запись.ПодразделениеОрганизации = РаботникиОрганизации[0].ПодразделениеОрганизации Тогда
						Набор.Удалить(- Индекс);
					КонецЕсли;
				Иначе
					Если Запись.Сотрудник = РаботникиОрганизации[0].Сотрудник Тогда
						Набор.Удалить(- Индекс);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			Набор.Записать();
			
			
			//НаборЗаписей.Прочитать();
			//Для каждого Запись Из НаборЗаписей Цикл
			//	Если А = 2 Тогда
			//		Если Запись.Должность = РаботникиОрганизации[0].Должность И Запись.ПодразделениеОрганизации = РаботникиОрганизации[0].ПодразделениеОрганизации Тогда
			//			//НаборЗаписей.Записать();  Сообщить("Удалили" + СокрЛП(А));
			//			//Прервать;
			//		КонецЕсли;
			//	Иначе
			//		Если Запись.Сотрудник = РаботникиОрганизации[0].Сотрудник Тогда
			//		//	НаборЗаписей.Записать();  Сообщить("Удалили" + СокрЛП(А));
			//		//	Прервать;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЦикла;
			//НаборЗаписей.Записать();  Сообщить("Удалили" + СокрЛП(А));
			
		КонецЦикла;	
		Попытка
			ЗафиксироватьТранзакцию();
		Исключение
			Сообщить("Не удалось!");
		КонецПопытки;
	КонецЕсли;
	//Аверсон 26.01.2020 КВВ СВФР-005034 )
	
	// ТОЛИК проверим временные перемещения 
	Для Каждого мСтрока Из РаботникиОрганизации Цикл
		Отказ = ПрочиеПроцедуры.ПроверитьИОтрегулироватьПеремещение(мСтрока.ДатаНачала, мСтрока.Сотрудник, Организация, ЭтотОбъект, мСтрока);
	КонецЦикла;
	Если ЭтотОбъект.Модифицированность() Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	//толик проверка при "не изменять" начисления а в регистре другое значение
	Если РольДоступна("ОТиЗ") Тогда
		ПроверкаНаПравильностьПоказателей();
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда
			
			// Получение учетной политики по персоналу организации
			УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
			ПроверкаШтатногоРасписания				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания");
			
			//Аверсон ЕАЕ 16.12.2024 СВФР-014218
			//Гродно
			ТЗДатыНачалаРС = ПолучитьДатыНачалаРС();
			//Аверсон СВФР-014218
			
			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники	= СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим, ПроверкаШтатногоРасписания, ТЗДатыНачалаРС); //Аверсон ЕАЕ 16.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
			ВыборкаПоСтрокамДокумента	= РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания);
				
				Если НЕ Отказ Тогда
					//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
					Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда   //Аверсон 26.01.2020 КВВ СВФР-005034
						СотрудникОбъект = ВыборкаПоСтрокамДокумента.Сотрудник.ПолучитьОбъект();
						Если ВыборкаПоСтрокамДокумента.ТипРаботника <> СотрудникОбъект.ТипРаботника Тогда
							СотрудникОбъект.ТипРаботника = ВыборкаПоСтрокамДокумента.ТипРаботника;
							Если ВыборкаПоСтрокамДокумента.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
								СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
							Иначе
								СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
							КонецЕсли;	
							СотрудникОбъект.Записать();
						КонецЕсли;
					КонецЕсли;
					//заявка №1734
					
					// Заполним записи в наборах записей регистров
					//Островская Татьяна 04.01.2014 № 17020
					если ПовышениеОкладов и (ВыборкаПоСтрокамДокумента.БезЕТС или (не ВыборкаПоСтрокамДокумента.БезЕТС и Организация.НеУчитыватьЕТКС)) Тогда 
					Иначе 
						//Аверсон 02.07.2021 КВВ СВФР-007578 (
						ВноситьВРегНакопления = Истина;
						Если Организация.ИНН = "700067572" Тогда
							Если ВыборкаПоСтрокамДокумента.СдельнаяОплата Тогда //Ученик	//Аверсон 06.07.2021 КВВ СВФР-007578
								ВноситьВРегНакопления = Ложь;
							КонецЕсли;
						КонецЕсли;
						
						Если ВноситьВРегНакопления = Истина Тогда
							//Аверсон 02.07.2021 КВВ СВФР-007578 )
							ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента);
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 04.01.2014 № 17020
					
					//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (
					Если Организация.ИНН = "700067572" И НЕ НеПересчитыватьТЧ Тогда
						ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,,ТЗНовыхМТСБобруйск); 
					Иначе
						//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) )
						ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,,,ТЗДатыНачалаРС); //Аверсон ЕАЕ 16.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			//Аверсон 25.05.2021 КВВ СВФР-007619 (
			ТЧНачислений = ОсновныеНачисления.Выгрузить();    
			ТЧНачислений.Свернуть("Сотрудник");
			
			ТЧРабОрг = РаботникиОрганизации.Выгрузить();
			ТЧРабОрг.Свернуть("Сотрудник");
			
			Если ТЧНачислений.Количество() <> ТЧРабОрг.Количество() Тогда
				Для Каждого СтрТЧРабОрг ИЗ ТЧРабОрг Цикл
					Отбор = Новый Структура;
					Отбор.Вставить("Сотрудник", СтрТЧРабОрг.Сотрудник);
					СтрокиПоиска = ТЧНачислений.НайтиСтроки(Отбор);
					Если СтрокиПоиска.Количество() = 0 Тогда
						Сообщить("По сотруднику " + СокрЛП(СтрТЧРабОрг.Сотрудник) + " не заполнен вид расчета на закладке ""Начисления"".");
					КонецЕсли;
				КонецЦикла;
				Отказ = Истина;
			КонецЕсли;
			Если НЕ Отказ Тогда
				//Аверсон 25.05.2021 КВВ СВФР-007619 )
				
				// выполним выборку по табличной части основных начислений
				
				//Аверсон ЕАЕ 17.12.2024 СВФР-014218
				//Гродно
				//ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания).Выбрать();
				ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания, ТЗДатыНачалаРС).Выбрать();
				//Аверсон СВФР-014218
				
				// обходим строки документа
				Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
					ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания);
					Если не Отказ Тогда
						//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) (
						Если Организация.ИНН = "700067572" И НЕ НеПересчитыватьТЧ Тогда
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,ТЗНовыхМТСБобруйск); 
						Иначе
							//Аверсон 29.03.2022 КВВ СВФР-008797 (пункт 1) )
							ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				ВыборкаПоКоэфициентам = СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента).Выбрать();
				Пока ВыборкаПоКоэфициентам.Следующий() Цикл
					ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам);
				КонецЦикла;
				
				ВыборкаПоПовышениям  = СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента).Выбрать();
				Пока ВыборкаПоПовышениям.Следующий() Цикл
					//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
					ПроверитьЗаполнениеСтрокиПовышения( ВыборкаПоПовышениям, Отказ );
					Если не Отказ Тогда
						//- СВЭЙ 07.02.19 КДЯ СВФР-003209 
						ДобавитьСтрокуВДвиженияПоПовышениям(ВыборкаПоПовышениям);
						//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
					КонецЕсли;
					//- СВЭЙ 07.02.19 КДЯ СВФР-003209 
				КонецЦикла;
			КонецЕсли; //Аверсон 25.05.2021 КВВ СВФР-007619 
		КонецЕсли;
		
	КонецЕсли;
	
	//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 2) (
	Если СокрЛП(Организация.ИНН) = "700067572" Тогда
		Для Каждого СтрокаТЧ Из РаботникиОрганизации Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Основание) Тогда
				СпрСотр = Справочники.СотрудникиОрганизаций.НайтиПоКоду(СтрокаТЧ.Сотрудник.Код).ПолучитьОбъект();
				СпрСотр.ТрудовойДоговор = СтрокаТЧ.Основание;
				Попытка
					СпрСотр.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 2) )
	
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	// получить новый номер документа по совокупности кадровых документов
	ПроцедурыУправленияПерсоналом.ПриУстановкеНовогоНомераКадровогоДокумента(СтандартнаяОбработка, ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Префикс, Дата);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Организация) И Организация.ИНН = "700103211" Тогда
		КраткийСоставДокДатаС = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаНачала");
		КраткийСоставДокДатаПо = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаОкончания");
		
		//СВЭЙ 12.06.2024 КВВ СВФР-012926 (
		Если НЕ ЗначениеЗаполнено(КраткийСоставДокДатаПо) Тогда
			КраткийСоставДокДатаПо = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаОкончанияДляОтчетаБобруйск"); 
		КонецЕсли;
		//СВЭЙ 12.06.2024 КВВ СВФР-012926 )
		
		КраткийСоставДокДолжность1 = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"Должность");
		КраткийСоставДокПодр1 = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ПодразделениеОрганизации");
		КраткийСоставДокЗамена = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"СотрудникЗаменяемый");
		КраткийСоставДокВремПер = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ВременныйПереводКлимовичи");
		
		Если РаботникиОрганизации.Количество() = 1 Тогда
			ПервыйСотр = РаботникиОрганизации[0].Сотрудник;
			КраткийСоставДокДолжность = СокрЛП(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НачалоДня(РаботникиОрганизации[0].ДатаНачала-1),Новый Структура("Сотрудник",РаботникиОрганизации[0].Сотрудник)).Должность);
			КраткийСоставДокПодр = СокрЛП(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НачалоДня(РаботникиОрганизации[0].ДатаНачала-1),Новый Структура("Сотрудник",РаботникиОрганизации[0].Сотрудник)).ПодразделениеОрганизации);
			
		КонецЕсли;
	КонецЕсли;
	//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.КадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период      = Дата;
		ЗаписьРегистрации.Регистратор = Ссылка;
	КонецЕсли;
	//толик
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если РольДоступна("ОК")	Тогда
			ЭтотОбъект.ПользовательОК = ИмяПользователя();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПользовательООТиЗ) Тогда
			Если РольДоступна("ОТиЗ")	Тогда
				ЭтотОбъект.ПользовательООТиЗ = ИмяПользователя();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если РольДоступна("ОК")	Тогда
			ЭтотОбъект.ПользовательОК = "";
		КонецЕсли;
		Если РольДоступна("ОТиЗ")	Тогда
			ЭтотОбъект.ПользовательООТиЗ = "";
		КонецЕсли;
	КонецЕсли;
	//енд
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверим уникальность номера с точки зрения кадровой нумерации
	ПроцедурыУправленияПерсоналом.ПроверкаУникальностиНомераКадровогоДокумента(ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Дата, Ссылка);
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.Проведен Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Основание",		Основание);
			Запрос.УстановитьПараметр("Организация",	Организация);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровоеПеремещениеРаботники.Сотрудник,
			|	КадровоеПеремещениеРаботники.ФизЛицо,
			|	КадровоеПеремещениеРаботники.ДатаНачала,
			|	КадровоеПеремещениеРаботники.ДатаОкончания,
			|	КадровоеПеремещениеРаботники.НапомнитьПоЗавершении,
			|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации,
			|	КадровоеПеремещениеРаботники.НоваяДолжность КАК Должность,
			|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавок,
			|	КадровоеПеремещениеРаботники.ГрафикРаботы
			|ИЗ
			|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			|		ПО КадровоеПеремещениеРаботники.НовоеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
			|			И (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
			|ГДЕ
			|	КадровоеПеремещениеРаботники.Ссылка = &Основание";
			
			РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Основание.ОбособленноеПодразделение.Пустая() Тогда
			Организация = Основание.ОбособленноеПодразделение;
		Иначе
			Организация = Основание.Организация;
		КонецЕсли;
		
		НоваяСтрока = РаботникиОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Основание);
		НоваяСтрока.Сотрудник = Основание;
		НоваяСтрока.ПроцентПоКонтракту = Основание.ПроцентПовышения;
		НоваяСтрока.МесячнаяТарифнаяСтавка = Основание.РасчетнаяТарифнаяСтавка;
		
		ДобавитьСтрокиНачисленийПоРаботнику(Основание);
		
		Если ЗначениеЗаполнено(Основание.ВидРасчета) тогда
			
			НовоеНачисление =  ОсновныеНачисления.Добавить();
			НовоеНачисление.Сотрудник = Основание;
			НовоеНачисление.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
			НовоеНачисление.ВидРасчета = Основание.ВидРасчета;
			Если Основание.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
				ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
				Если ЗначениеЗаполнено(ДнейВГоду) ИЛИ ДнейВГоду.Размер <> 0 тогда
					НовоеНачисление.Показатель1 = ОбщегоНазначения.ОкруглитьПоВалюте(Основание.РасчетнаяТарифнаяСтавка/?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
				Иначе
					Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
				КонецЕсли;
			ИначеЕсли Основание.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ Основание.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
				если ЗначениеЗаполнено(НоваяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
					Если ЧасовВГоду.Размер = 0 Тогда 
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),НоваяСтрока.ГрафикРаботы));
					КонецЕсли;
				иначе
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),НоваяСтрока.ГрафикРаботы));
					
				КонецЕсли;
				Если ЗначениеЗаполнено(ЧасовВГоду) ИЛИ ЧасовВГоду.Размер <> 0 тогда
					НовоеНачисление.Показатель1 = ОбщегоНазначения.ОкруглитьПоВалюте(Основание.РасчетнаяТарифнаяСтавка/?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
				Иначе
					Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
				КонецЕсли;
			Иначе
				НовоеНачисление.Показатель1	  = Основание.РасчетнаяТарифнаяСтавка;
			КонецЕсли;
		Конецесли;
		
		Если Основание.ПерсональныеНадбавки.Количество() > 0 тогда
			Для каждого СтрокиНадбавка из Основание.ПерсональныеНадбавки цикл
				НовоеНачисление =  ОсновныеНачисления.Добавить();
				НовоеНачисление.Сотрудник = Основание;
				НовоеНачисление.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				НовоеНачисление.ВидРасчета = СтрокиНадбавка.Надбавка;
				НовоеНачисление.Показатель1	  = СтрокиНадбавка.Показатель1;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Строка из Основание.КоэфПовышенияТО Цикл
			НоваяСтрокаКоэф = КоэфПовышенияТО.Добавить();
			НоваяСтрокаКоэф.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
			НоваяСтрокаКоэф.Сотрудник = Основание;
			НоваяСтрокаКоэф.Коэффициент = Строка.Коэффициент;
			НоваяСтрокаКоэф.Размер = Строка.Размер;
		КонецЦикла;
		
		Для Каждого Строка из Основание.ПовышенияПоИнструкции Цикл
			НоваяСтрокаПовышенияПоИнструкции = ПовышенияПоИнструкции.Добавить();
			НоваяСтрокаПовышенияПоИнструкции.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
			НоваяСтрокаПовышенияПоИнструкции.Сотрудник = Основание;
			НоваяСтрокаПовышенияПоИнструкции.Коэффициент = Строка.Коэффициент;
			НоваяСтрокаПовышенияПоИнструкции.Размер = Строка.Размер;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////
//толик добавил процедуры перерасчета для проведения с других модулей

Процедура ПерерасчетДокумента(ПересчитыватьКонтракт = Истина) Экспорт
	Для Каждого мСтрока Из РаботникиОрганизации Цикл
		ПерерасчетТарифнойСтавкиСДругихМодулей(мСтрока, ПересчитыватьКонтракт);
	КонецЦикла;
Конецпроцедуры

Процедура ПерерасчетТарифнойСтавкиСДругихМодулей(ТекущаяСтрока, ИзмененКонтракт = Ложь,СтавкаПередИзменением = 1,НеМенятьПовышениеЕТСИнстр = Ложь) Экспорт //О.Т. 05.03.2015 № 377
	//Аверсон 07.07.2021 КВВ СВФР-007578 (
	НеРассчитыватьПовышПоИнстр = Ложь;  
	ПрекращатьНачинатьОснНач = Ложь;
	Если Организация.ИНН = "700067572" 
		И ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) 
		И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончанияДляОтчетаБобруйск) //Аверсон 26.06.2023 КВВ СВФР-010989
		И ТекущаяСтрока.Должность <> РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяСтрока.ДатаНачала-1, Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник)).Должность Тогда
		ПрекращатьНачинатьОснНач = Истина;
		Если СокрЛП(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда) = "ИТР" Тогда
			НеРассчитыватьПовышПоИнстр = Истина;
		КонецЕсли;
	КонецЕсли;
	//Аверсон 07.07.2021 КВВ СВФР-007578 )
	
	//О.Т. 05.03.2015 № 377
	если СтавкаПередИзменением = 0 Тогда 
		СтавкаПередИзменением = 1;		
	КонецЕсли;
	//О.Т. 05.03.2015 № 377
	//О.Т. 03.02.2015 № 17844
	Округление1 = Константы.ОкруглениеЧасовойТС.Получить();
	если Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
		ЗначениеОкругления = 0;
	ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
		ЗначениеОкругления = 1;
	ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
		ЗначениеОкругления = 2;
	ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
		ЗначениеОкругления = 3;
	ИначеЕсли Округление1 = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
		ЗначениеОкругления = 4;
	иначе
		ЗначениеОкругления = 0;
	КонецЕсли;
	//О.Т. 03.02.2015 № 17844
	
	СтрокаКоэф = КоэфПовышенияТО;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) Тогда
		// №14564 12.01.2012 , Дыма 
		Если ТекущаяСтрока.БезЕТС или (не ТекущаяСтрока.БезЕТС и Организация.НеУчитыватьЕТКС) Тогда
			//О.Т. Аверсон 04.11.2015 № 679
			Если не НеПересчитыватьТЧ Тогда 
				
				//Аверсон ЕАЕ 28.02.2025 СВФР-014856
				УчетнаяПолитикаЗапрос = Новый Запрос; 
				УчетнаяПолитикаЗапрос.Текст = 
				"ВЫБРАТЬ
				|   УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения,
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.ПроверкаШтатногоРасписания
				|ИЗ
				|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				|ГДЕ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				если УчетнаяПолитика.Количество()>0 Тогда 
					ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					ФлПроверкаШтатногоРасписания = УчетнаяПолитика[0].ПроверкаШтатногоРасписания;
				иначе
					ФлОкладПоКаждомуВиду = Ложь;
					ФлПроверкаШтатногоРасписания = Ложь;
				КонецЕсли; 
				//Аверсон СВФР-014856
				
				ТекущаяСтрока.КоэффициентЕТС = 0;
				ТекущаяСтрока.РазрядЕТС = "";
				ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 0;
				ТекущаяСтрока.РазмерСтавки1Разряда = 0;
				ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда = Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка();
				ТаблицаКоэфициентов = КоэфПовышенияТО;
				НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
					ТаблицаКоэфициентов.Удалить(СтрокаКоэффициентов);		
				КонецЦикла;
				//О.Т. Аверсон 04.11.2015 № 679
				
				//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
				
				//Аверсон ЕАЕ 13.02.2025 СВФР-014856
				//Тариф		  = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением * ТекущаяСтрока.ЗанимаемыхСтавок,2);//О.Т. 05.03.2015 № 377, 294
				//Если СтавкаПередИзменением = 1 Тогда
				Если ФлПроверкаШтатногоРасписания Тогда
					Тариф = Окр(ТекущаяСтрока.ТарифЗаОднуСтавку * ТекущаяСтрока.ЗанимаемыхСтавок,2);
				Иначе
					Тариф = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением * ТекущаяСтрока.ЗанимаемыхСтавок,2);//О.Т. 05.03.2015 № 377, 294
				КонецЕсли;
				//Иначе
				//	Тариф = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением * ТекущаяСтрока.ЗанимаемыхСтавок,2);
				//КонецЕсли;
				//Аверсон СВФР-014856
				
				//+ СВЭЙ КДЯ 05.02.20 СВФР-005474
				//ТарифВВалюте  = ТекущаяСтрока.СуммаВВалюте/СтавкаПередИзменением * ТекущаяСтрока.ЗанимаемыхСтавок;//О.Т. Аверсон 13.04.2016 № 1041
				//- СВЭЙ КДЯ 05.02.20 СВФР-005474
				
				//+ СВЭЙ КДЯ 05.02.20 СВФР-005474
				ОкруглениеШтат = Константы.ОкруглениеШтатноеРасписание.Получить();
				ТарифВВалюте  = ОбщегоНазначения.ОкруглитьРезультат( ТекущаяСтрока.ОкладСПовышениемВВалюте, ОкруглениеШтат );
				//- СВЭЙ КДЯ 05.02.20 СВФР-005474
				
				//Аверсон ЕАЕ 13.02.2025 СВФР-014856
				//ТарифБезСтавки		  = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением,2);//О.Т. Аверсон 16.05.2017 № 641
				//Если СтавкаПередИзменением = 1 Тогда
				Если ФлПроверкаШтатногоРасписания Тогда
					ТарифБезСтавки = Окр(ТекущаяСтрока.ТарифЗаОднуСтавку,2);
				Иначе
					ТарифБезСтавки = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением,2);//О.Т. Аверсон 16.05.2017 № 641
				КонецЕсли;
				//Иначе
				//	ТарифБезСтавки = Окр(ТекущаяСтрока.ТарифнаяСтавка/СтавкаПередИзменением,2);	
				//КонецЕсли;
				//Аверсон СВФР-014856
				
				ТекущаяСтрока.ТарифнаяСтавка = Тариф;
				ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				//О.Т. Аверсон 14.04.2016 № 1041
				Если не ЗначениеЗаполнено(ТекущаяСтрока.ОкладСПовышениемВВалюте) Тогда 
					ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
				КонецЕсли;
				//О.Т. Аверсон 14.04.2016 № 1041
				ТаблицаПроцентов = ПовышенияПоИнструкции;
				НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				если не НеМенятьПовышениеЕТСИнстр Тогда
					ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
				КонецЕсли;
				
				//расчет до 01.09.2009
				Если ТекущаяСтрока.ДатаНачала < '20090901000000' Тогда
					если не НеМенятьПовышениеЕТСИнстр Тогда
						мПослеПовышения = 0;
						мДоПовышения = 0;
						ТарифПоИнструкции = 0;
						Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
							Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
								Если СтрокаПроцентов.Коэффициент.Последующий Тогда
									мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
								Иначе
									мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
								КонецЕсли;
								ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					//О.Т. Аверсон 22.09.2016 № 1459
					
					//Аверсон ЕАЕ 28.02.2025 СВФР-014856
					//Перенесено выше
					//УчетнаяПолитикаЗапрос = Новый Запрос; 
					//УчетнаяПолитикаЗапрос.Текст = 
					//"ВЫБРАТЬ
					//|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
					//|ИЗ
					//|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
					//|ГДЕ
					//|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
					//УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
					//УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
					//если УчетнаяПолитика.Количество()>0 Тогда 
					//	ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					//иначе
					//	ФлОкладПоКаждомуВиду = Ложь;
					//КонецЕсли; 
					//Аверсон СВФР-014856
					
					//О.Т. Аверсон 22.09.2016 № 1459
					
					если НеМенятьПовышениеЕТСИнстр Тогда
						ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
					ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
					ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
					КонецЕсли;
					
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата);
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
						//Аверсон 29.03.2021 КВВ СВФР-007391 (
						Если Организация.ИНН = "806000046" Тогда
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, Окр(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,3)), Константы.ВалютаРегламентированногоУчета.Получить());
						Иначе
							//Аверсон 29.03.2021 КВВ СВФР-007391 )
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
					иначе						
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки *ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					если ТекущаяСтрока.ОкладВВалюте Тогда 
						ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					
				Иначе
					если не НеМенятьПовышениеЕТСИнстр Тогда
						мПослеПовышения = 0;
						мДоПовышения = 0;
						ТарифПоИнструкции = 0;
						Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
							Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
								мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
								ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					//О.Т. Аверсон 22.09.2016 № 1459
					УчетнаяПолитикаЗапрос = Новый Запрос; 
					УчетнаяПолитикаЗапрос.Текст = 
					"ВЫБРАТЬ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
					|ИЗ
					|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
					|ГДЕ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
					УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
					УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
					если УчетнаяПолитика.Количество()>0 Тогда 
						ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					иначе
						ФлОкладПоКаждомуВиду = Ложь;
					КонецЕсли; 
					//О.Т. Аверсон 22.09.2016 № 1459
					
					если НеМенятьПовышениеЕТСИнстр Тогда
						ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
					ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
					ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
					КонецЕсли;
					
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифПоИнструкции,Дата);
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());
					иначе
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки *ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					если ТекущаяСтрока.ОкладВВалюте Тогда 
						ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// основное начисление
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидРасчета) Тогда
				ТекущаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
			КонецЕсли;
			
			ВидРасчета = ТекущаяСтрока.ВидРасчета;
			
			РаботникСтрока = ТекущаяСтрока;
			
			мНайдено = Ложь;
			СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
			Пока СписокВидовРасчета.Следующий() Цикл
				СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СписокВидовРасчета.ВидРасчета));
				Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
					мНайдено = Истина;
					Прервать
				КонецЕсли;
			КонецЦикла;
			//ПСА 02.11.2021 СВФР-008299 +++
			
			//Аверсон ЕАЕ 13.02.2025 СВФР-014856
			//Если установлен флаг НеПересчитыватьТЧ, тч Начисления будем заполнять
			//Если мНайдено и НеПересчитыватьТЧ Тогда
			//Если мНайдено Тогда
				
			//Иначе
			//Аверсон СВФР-014856
	
				
				//+++ПСА 02.11.2021 СВФР-008299					
				
				Если Не мНайдено Тогда
					Строка = ОсновныеНачисления.Добавить();
					Строка.Сотрудник = РаботникСтрока.Сотрудник; 
				Иначе
					Строка = СтрокиОсновныхНачислений[0];	
				КонецЕсли;
				Строка.ВидРасчета = РаботникСтрока.ВидРасчета;
				//Определяем нужно ли выделять контракт
				мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
				
				Если РаботникСтрока.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
					ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
					Если ДнейВГоду.Размер <> 0 тогда
						Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
						Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
					КонецЕсли;
				ИначеЕсли РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
					Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547 
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
						Если ЧасовВГоду.Размер = 0 Тогда 
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
						КонецЕсли;
					иначе
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));					
					КонецЕсли;
					
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
					
					Если ЧасовВГоду.Размер <> 0 тогда
						//временное перемещение
						Если РаботникСтрока.Временно Тогда
							мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
							Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
							Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
							//О.Т. 03.02.2015 № 17845
							если РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда 
								Строка.Показатель3 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 10.01.2017 № 129
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041
							иначе
								Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель3 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 10.01.2017 № 129
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 15.03.2016 № 949,129
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата); //О.Т. Аверсон 13.04.2016 № 1041
								КонецЕсли;
							КонецЕсли;
							//О.Т. 03.02.2015 № 17845
						Иначе
							//О.Т. 03.02.2015 № 17845
							если РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда 
								//О.Т. Аверсон 03.01.2018  Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
								Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 10.01.2017 № 129
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 13.04.2016 № 1041
							иначе
								Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель1 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 10.01.2017 № 129
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель1 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 15.03.2016 № 949,129
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 13.04.2016 № 1041
								КонецЕсли;
								
							КонецЕсли;
							//О.Т. 03.02.2015 № 17845							
							Строка.Показатель3 = 0;
						КонецЕсли;
						Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
					Иначе
						Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
					КонецЕсли;
				Иначе
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					Если РаботникСтрока.Временно Тогда
						мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
						Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
						Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
						Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
							Строка.Показатель3 = Окр(Тариф, 1);
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1);//О.Т. Аверсон 13.04.2016 № 1041
						иначе
							Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата); //О.Т. Аверсон 15.03.2016 № 949
							Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата);//О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
					Иначе
						Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
							Строка.Показатель1 = Окр(Тариф, 1);	
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1);//О.Т. Аверсон 13.04.2016 № 1041
						иначе
							Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата); //О.Т. Аверсон 15.03.2016 № 949
							Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата);//О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						
						Строка.Показатель3 = 0;
					КонецЕсли;
					Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
				КонецЕсли;
				Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				
				//контракт толик
				Если мНеобходимоВыделятьКонтракт И (не ЗначениеЗаполнено(РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта)) Тогда
					Сообщить("Невозможно рассчитать контракт. Для способа расчета неопределен вид начисления контракт !");
					Возврат;
				КонецЕсли;
				ВидыКонтрактов = ПрочиеПроцедуры.СформироватьСписокНачисленийКонтракта();
				СписокВидовРасчета = Новый СписокЗначений;
				Пока ВидыКонтрактов.Следующий() Цикл
					СписокВидовРасчета.Добавить(ВидыКонтрактов.ВидРасчета);
					СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
					Для Каждого мСтрока Из СтрокиОсновныхНачислений Цикл
						Если мСтрока.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
							ИзмененКонтракт = Истина;
						КонецЕсли;
						ОсновныеНачисления.Удалить(мСтрока);
					КонецЦикла;
				КонецЦикла;
				Если мНеобходимоВыделятьКонтракт Тогда
					
					//Проверим предыдущий контракт
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
					|ИЗ
					|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
					|ГДЕ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ВидРасчетаИзмерение)
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
					Запрос.УстановитьПараметр("Организация", Организация);                    
					Запрос.УстановитьПараметр("Сотрудник", РаботникСтрока.Сотрудник);
					Запрос.УстановитьПараметр("Период", РаботникСтрока.ДатаНачала - 86400);
					Запрос.УстановитьПараметр("ВидРасчетаИзмерение", СписокВидовРасчета);
					мВыборка = Запрос.Выполнить().Выгрузить();
					Если мВыборка.Количество() <> 0 Тогда
						мПлановыеНачисленияРаботниковОрганизаций = мВыборка[0];
						///////				
						Если РаботникСтрока.Временно Тогда
							Строка = ОсновныеНачисления.Добавить();
							Строка.Сотрудник = РаботникСтрока.Сотрудник; 
							Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
							Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
							Если ИзмененКонтракт Тогда
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
							Иначе
								Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
							КонецЕсли;
						Иначе
							Если мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта Тогда
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Если ИзмененКонтракт Тогда
									Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
								Иначе
									Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
								КонецЕсли;
							Иначе
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
								
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
							КонецЕсли;
						КонецЕсли;
					Иначе
						Строка = ОсновныеНачисления.Добавить();
						Строка.Сотрудник = РаботникСтрока.Сотрудник; 
						Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
						Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
						Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
					КонецЕсли;
				КонецЕсли;
			//КонецЕсли; //Аверсон ЕАЕ 19.02.2025 СВФР-014856
		Иначе
			
			//Аверсон 20.04.2021 КВВ СВФР-007469 ( перенесено в начало ветки
			//О.Т. Аверсон 22.09.2016 № 1459
			УчетнаяПолитикаЗапрос = Новый Запрос; 
			УчетнаяПолитикаЗапрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
			|ИЗ
			|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
			|ГДЕ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
			УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
			УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
			если УчетнаяПолитика.Количество()>0 Тогда 
				ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
			иначе
				ФлОкладПоКаждомуВиду = Ложь;
			КонецЕсли; 
			//О.Т. Аверсон 22.09.2016 № 1459
			//Аверсон 20.04.2021 КВВ СВФР-007469 ) перенесено в начало ветки
			
			
			//Аверсон 20.04.2021 КВВ СВФР-007469 (
			ОкруглениеШтат = Константы.ОкруглениеШтатноеРасписание.Получить();  
			ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить(); 
			//Аверсон 20.04.2021 КВВ СВФР-007469 )
			
			//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда) Тогда
			//	ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда = ТекущаяСтрока.Категория.ТарифнаяСтавкаПервогоРазряда;
			ТекущаяСтрока.РазмерСтавки1Разряда = ПолучитьРазмерТарифнойСтавки(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда, ТекущаяСтрока.ДатаНачала);
			//КонецЕсли;
			
			Если ТекущаяСтрока.РазмерСтавки1Разряда <> 0 Тогда
				
				Если не НеПересчитыватьТЧ Тогда
					
					ТаблицаКоэфициентов = КоэфПовышенияТО;
					НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
					ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 1;
					
					Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
						Если СтрокаКоэффициентов.Действие <>  Перечисления.ВидыДействияСНачислением.Прекратить тогда
							//Если Организация.ИНН = "100074549" Тогда //О.Т. Аверсон 15.01.2016 //О.Т. Аверсон 24.03.2016 № 984 (убрала условие)
							ТекущаяСтрока.ПовышенныйКоэффициентЕТС = ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер;	
							//иначе
							//	Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
							//		ТекущаяСтрока.ПовышенныйКоэффициентЕТС = Окр(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер,2);//О.Т. 07.05.2015 при переносе	
							//	иначе
							//		ТекущаяСтрока.ПовышенныйКоэффициентЕТС = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер,Дата);//О.Т. 07.05.2015 при переносе  949
							//	КонецЕсли;
							//	
							//КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					
					Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РазрядЕТС) Тогда
						Если РольДоступна("ОТиЗ") Тогда
							ОбщегоНазначения.СообщитьОбОшибке("Не введен разряд ЕТС");
						КонецЕсли;
						ТекущаяСтрока.КоэффициентЕТС = 0;
					КонецЕсли;
					
					Если Организация.ИНН = "100074549" Тогда
						Если Дата < Дата( 2016, 07, 1 ) Тогда //О.Т. Аверсон 15.03.2016 № 949
							Коэффициент = Окр( ТекущаяСтрока.ПовышенныйКоэффициентЕТС * ТекущаяСтрока.КоэффициентЕТС, 2 );	
							КоэффициентДляТС = Окр( ТекущаяСтрока.КоэффициентЕТС, 2 ); //О.Т. Аверсон 03.04.2017 № 475           
						иначе
							Коэффициент = ОбщегоНазначения.ОкруглитьЗначение2016( ТекущаяСтрока.ПовышенныйКоэффициентЕТС * ТекущаяСтрока.КоэффициентЕТС, Дата ); //О.Т. Аверсон 15.03.2016 № 949
							КоэффициентДляТС = ОбщегоНазначения.ОкруглитьЗначение2016( ТекущаяСтрока.КоэффициентЕТС, Дата );//О.Т. Аверсон 03.04.2017 № 475 
						КонецЕсли;
						
					иначе
						Коэффициент = ТекущаяСтрока.ПовышенныйКоэффициентЕТС * ТекущаяСтрока.КоэффициентЕТС;
						КоэффициентДляТС = ТекущаяСтрока.КоэффициентЕТС; //О.Т. Аверсон 03.04.2017 № 475 
					КонецЕсли;
					
					СтавкаПервого = ТекущаяСтрока.РазмерСтавки1Разряда;
					//заявка №1787 (база заявок Кристалла) Дмитрук О.Г.
					//Тариф		  = Коэффициент * СтавкаПервого;
					
					//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку 
					Тариф		  = Окр( Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок, 2 ); //О.Т. Аверсон 09.02.2017 № 294	
					ТарифДляТС	  = Окр( КоэффициентДляТС * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок, 2 ); //О.Т. Аверсон 03.04.2017 № 475	
					
					ТарифВВалюте  = ТекущаяСтрока.СуммаВВалюте * ТекущаяСтрока.ЗанимаемыхСтавок; //О.Т. Аверсон 13.04.2016 № 1041
					//заявка №1787 
					
					ТарифБезСтавки  = Окр( Коэффициент * СтавкаПервого, 2 ); //О.Т. Аверсон 16.05.2017 № 641
					
					//Аверсон 20.04.2021 КВВ СВФР-007469 (
					ТарифДробныхСтавок = 0;
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
						ТарифДробныхСтавок  = ОбщегоНазначения.ОкруглитьИнтегрированно(Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок, ОкруглениеШтат, ВалютаРегл, Дата);
					КонецЕсли;
					//Аверсон 20.04.2021 КВВ СВФР-007469 )
					
					ТекущаяСтрока.ТарифнаяСтавка = ТарифДляТС;
					ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					//О.Т. Аверсон 14.04.2016 № 1041
					Если не ЗначениеЗаполнено( ТекущаяСтрока.ОкладСПовышениемВВалюте ) Тогда 
						ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
					КонецЕсли;
					//О.Т. Аверсон 14.04.2016 № 1041
					
					ТаблицаПроцентов = ПовышенияПоИнструкции;
					НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
					если не НеМенятьПовышениеЕТСИнстр Тогда 
						ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
					КонецЕсли;
					
					//расчет до 01.09.2009
					Если ТекущаяСтрока.ДатаНачала < '20090901000000' Тогда
						если не НеМенятьПовышениеЕТСИнстр Тогда 
							мПослеПовышения = 0;
							мДоПовышения = 0;
							ТарифПоИнструкции = 0;
							Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
								Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
									Если СтрокаПроцентов.Коэффициент.Последующий Тогда
										мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
									Иначе
										мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
									КонецЕсли;
									ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
									ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						если НеМенятьПовышениеЕТСИнстр Тогда
							ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
						ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок * мДоПовышения/100;
						ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
						КонецЕсли;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата);//О.Т. Аверсон 22.09.2016 № 1459
						Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());
						иначе
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки *ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
						если ТекущаяСтрока.ОкладВВалюте Тогда 
							ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
					Иначе
						если не НеМенятьПовышениеЕТСИнстр Тогда
							мПослеПовышения = 0;
							мДоПовышения = 0;
							ТарифПоИнструкции = 0;
							Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
								Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
									//Если СтрокаПроцентов.Коэффициент.Последующий Тогда
									//	мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
									//Иначе
									мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
									//КонецЕсли;
									
									//Аверсон 07.07.2021 КВВ СВФР-007578 (
									ПрибавитьРазмер = СтрокаПроцентов.Размер;
									Если НеРассчитыватьПовышПоИнстр Тогда
										ПрибавитьРазмер = 0;
									КонецЕсли;
									//Аверсон 07.07.2021 КВВ СВФР-007578 )
									
									//ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
									ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + ПрибавитьРазмер; //Аверсон 07.07.2021 КВВ СВФР-007578 (ПрибавитьРазмер)
									
									//Аверсон 20.04.2021 КВВ СВФР-007469 (
									Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
										ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * СтрокаПроцентов.Размер/100, ОкруглениеШтат, ВалютаРегл, Дата);
									Иначе
										//Аверсон 20.04.2021 КВВ СВФР-007469 )
										ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(
										//ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок * СтрокаПроцентов.Размер / 100, Дата ); //О.Т. Аверсон 22.09.2016 № 1459
										ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок * ПрибавитьРазмер / 100, Дата ); //О.Т. Аверсон 22.09.2016 № 1459  //Аверсон 07.07.2021 КВВ СВФР-007578 (ПрибавитьРазмер)
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						если НеМенятьПовышениеЕТСИнстр Тогда
							ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
						ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок * мДоПовышения / 100;
						ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							//Аверсон 20.04.2021 КВВ СВФР-007469 (
							Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда
								ТарифПоИнструкции = ТарифДробныхСтавок + ТарифПоИнструкции;
							Иначе    
								//Аверсон 20.04.2021 КВВ СВФР-007469 )
								ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
							КонецЕсли;
						КонецЕсли;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016( ТарифПоИнструкции, Дата );
						//ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
						
						
						если Организация.ИНН = "600124787" Тогда //О.Т. 26.01.2015 № 17818
							Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
								ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата), ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + (ОбщегоНазначения.ОкруглитьЗначение2016(Тариф *ТекущаяСтрока.ПроцентПоКонтракту/100,Дата))), Константы.ВалютаРегламентированногоУчета.Получить());
							иначе   								
								ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата), ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + (ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки*ТекущаяСтрока.ПроцентПоКонтракту/100,Дата)* ТекущаяСтрока.ЗанимаемыхСтавок)), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
						иначе
							Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
								//Аверсон 20.04.2021 КВВ СВФР-007469 (
								Если ФлОкладПоКаждомуВиду Тогда
									ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
									ТекущаяСтрока.МесячнаяТарифнаяСтавка = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции
									+ ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * ТекущаяСтрока.ПроцентПоКонтракту / 100,	ОкруглениеШтат, ВалютаРегл, Дата );
								Иначе
									//Аверсон 20.04.2021 КВВ СВФР-007469 )
									ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте( 	
									?( ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, 
									ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте( 
									Тариф * ТекущаяСтрока.ПроцентПоКонтракту / 100, Константы.ВалютаРегламентированногоУчета.Получить() )
									), Константы.ВалютаРегламентированногоУчета.Получить() );
								КонецЕсли;
							иначе
								ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте( 
								?( ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, 
								ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(
								ТарифБезСтавки * ТекущаяСтрока.ПроцентПоКонтракту / 100, Константы.ВалютаРегламентированногоУчета.Получить() )
								* ТекущаяСтрока.ЗанимаемыхСтавок ), Константы.ВалютаРегламентированногоУчета.Получить() );
							КонецЕсли;
						КонецЕсли;
						если ТекущаяСтрока.ОкладВВалюте Тогда 
							ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(
							?( ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, 
							ТекущаяСтрока.ОкладСПовышениемВВалюте + ( ТарифВВалюте * ТекущаяСтрока.ПроцентПоКонтракту / 100 ) ), 
							Константы.ВалютаРегламентированногоУчета.Получить() );//О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
					КонецЕсли; //  ТекущаяСтрока.ДатаНачала < '20090901000000'
					
				КонецЕсли;  // не НеПересчитыватьТЧ 
				
				// основное начисление
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидРасчета) Тогда
					ТекущаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
				КонецЕсли;
				
				ВидРасчета = ТекущаяСтрока.ВидРасчета;
				
				РаботникСтрока = ТекущаяСтрока;
				
				Если ЗначениеЗаполнено(ТекущаяСтрока.РазрядЕТС) тогда
					мНайдено = Ложь;
					//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано
					////Аверсон 05.11.2021 КВВ СВФР-008331 (
					//ВР_Ученические =ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
					//Если Организация.ИНН = "700067572" И ТекущаяСтрока.СдельнаяОплата Тогда
					//	ВР_Ученические = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("15.Ученические");
					//КонецЕсли;
					////Аверсон 05.11.2021 КВВ СВФР-008331 )
					//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
					
					СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
					Пока СписокВидовРасчета.Следующий() Цикл
						//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано
						////Аверсон 05.11.2021 КВВ СВФР-008331 (
						//Если ЗначениеЗаполнено(ВР_Ученические) Тогда
						//	Если СписокВидовРасчета.ВидРасчета = ВР_Ученические Тогда
						//		Продолжить;
						//		КонецЕсли;
						//	КонецЕсли;
						////Аверсон 05.11.2021 КВВ СВФР-008331 )
						//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
						
						СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СписокВидовРасчета.ВидРасчета));
						Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
							мНайдено = Истина;
							Прервать
						КонецЕсли;
					КонецЦикла;
					//ПСА 02.11.2021 СВФР-008299 +++
					Если мНайдено и НеПересчитыватьТЧ Тогда
						
					Иначе
						//+++ПСА 02.11.2021 СВФР-008299					
						Если Не мНайдено Тогда
							Строка = ОсновныеНачисления.Добавить();
							Строка.Сотрудник = РаботникСтрока.Сотрудник; 
						Иначе
							Строка = СтрокиОсновныхНачислений[0];	
						КонецЕсли;
						Строка.ВидРасчета = РаботникСтрока.ВидРасчета;
						//Определяем нужно ли выделять контракт
						мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
						
						Если РаботникСтрока.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
							ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
							Если мНеобходимоВыделятьКонтракт Тогда
								Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
								ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
							Иначе
								Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
								ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
							КонецЕсли;
							ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
							Если ДнейВГоду.Размер <> 0 тогда
								Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / ЗанимаемыхСтавок / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить()); 
								Строка.Показатель1ВВалюте  = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте / ЗанимаемыхСтавок / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 13.04.2016 № 1041
							Иначе
								Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
							КонецЕсли;
						ИначеЕсли РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
							Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547 
								ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
								Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
								Если ЧасовВГоду.Размер = 0 Тогда 
									ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
									Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
								КонецЕсли;
							иначе
								ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
								Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
								
							КонецЕсли;
							Если мНеобходимоВыделятьКонтракт Тогда
								Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
								ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
							Иначе
								Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
								ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
							КонецЕсли;
							ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
							Если ЧасовВГоду.Размер <> 0 тогда
								//временное перемещение
								Если РаботникСтрока.Временно Тогда
									мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
									Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
									Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
									Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
										Строка.Показатель3 = Окр(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);
										Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);//О.Т. Аверсон 13.04.2016 № 1041
									иначе
										Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер),РаботникСтрока.ДатаНачала); //О.Т. Аверсон 15.03.2016 № 949
										Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер),РаботникСтрока.ДатаНачала);//О.Т. Аверсон 13.04.2016 № 1041
									КонецЕсли;
								Иначе
									Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
										Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);
										Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 2);//О.Т. Аверсон 13.04.2016 № 1041
									иначе
										Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 15.03.2016 № 949
										Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), РаботникСтрока.ДатаНачала);//О.Т. Аверсон 13.04.2016 № 1041
									КонецЕсли;
									
									Строка.Показатель3 = 0;
								КонецЕсли;
								Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
							Иначе
								Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
							КонецЕсли;
						Иначе
							Если мНеобходимоВыделятьКонтракт Тогда
								Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
								ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
							Иначе
								Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
								ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
							КонецЕсли;
							Если РаботникСтрока.Временно Тогда
								мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
								Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
								Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
								Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель3 = Окр(Тариф, 2);
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 2);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата); //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата); //О.Т. Аверсон 13.04.2016 № 1041
								КонецЕсли;
							Иначе
								Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель1 = Окр(Тариф, 2);
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 2);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата); //О.Т. Аверсон 15.03.2016 № 949
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата);//О.Т. Аверсон 13.04.2016 № 1041 
								КонецЕсли;
								Строка.Показатель3 = 0;
							КонецЕсли;
							Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
						КонецЕсли;
						Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
						
						//контракт толик
						Если мНеобходимоВыделятьКонтракт И (не ЗначениеЗаполнено(РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта)) Тогда
							Сообщить("Невозможно рассчитать контракт. Для способа расчета неопределен вид начисления контракт !");
							Возврат;
						КонецЕсли;
						ВидыКонтрактов = ПрочиеПроцедуры.СформироватьСписокНачисленийКонтракта();
						СписокВидовРасчета = Новый СписокЗначений;
						Пока ВидыКонтрактов.Следующий() Цикл
							СписокВидовРасчета.Добавить(ВидыКонтрактов.ВидРасчета);
							СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
							Для Каждого мСтрока Из СтрокиОсновныхНачислений Цикл
								Если мСтрока.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
									ИзмененКонтракт = Истина;
								КонецЕсли;
								ОсновныеНачисления.Удалить(мСтрока);
							КонецЦикла;
						КонецЦикла;
						Если мНеобходимоВыделятьКонтракт Тогда
							
							//Проверим предыдущий контракт
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
							|ИЗ
							|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
							|ГДЕ
							|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ВидРасчетаИзмерение)
							|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
							|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
							|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
							Запрос.УстановитьПараметр("Организация", Организация);                    
							Запрос.УстановитьПараметр("Сотрудник", РаботникСтрока.Сотрудник);
							Запрос.УстановитьПараметр("Период", РаботникСтрока.ДатаНачала - 86400);
							Запрос.УстановитьПараметр("ВидРасчетаИзмерение", СписокВидовРасчета);
							мВыборка = Запрос.Выполнить().Выгрузить();
							Если мВыборка.Количество() <> 0 Тогда
								мПлановыеНачисленияРаботниковОрганизаций = мВыборка[0];
								///////				
								Если РаботникСтрока.Временно Тогда
									Строка = ОсновныеНачисления.Добавить();
									Строка.Сотрудник = РаботникСтрока.Сотрудник; 
									Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
									Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
									Если ИзмененКонтракт Тогда
										Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
									Иначе
										Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
									КонецЕсли;
								Иначе
									Если мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта Тогда
										Строка = ОсновныеНачисления.Добавить();
										Строка.Сотрудник = РаботникСтрока.Сотрудник; 
										Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
										Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
										Если ИзмененКонтракт Тогда
											Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
										Иначе
											Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
										КонецЕсли;
									Иначе
										Строка = ОсновныеНачисления.Добавить();
										Строка.Сотрудник = РаботникСтрока.Сотрудник; 
										Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
										Строка.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
										
										Строка = ОсновныеНачисления.Добавить();
										Строка.Сотрудник = РаботникСтрока.Сотрудник; 
										Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
										Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
										Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
									КонецЕсли;
								КонецЕсли;
							Иначе
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
				
				//Аверсон 07.07.2021 КВВ СВФР-007578 (
				Если ПрекращатьНачинатьОснНач Тогда
					СписокНачисленийПоГруппе = Новый СписокЗначений;
					Для Каждого Стр из Справочники.ГруппыРасчетов.ПрекращениеНачПриВремПереводах.Основные Цикл
						СписокНачисленийПоГруппе.Добавить(Стр.ВидРасчета);
					КонецЦикла;
					Если СписокНачисленийПоГруппе.Количество() <> 0 Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
						|ИЗ
						|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
						|ГДЕ 
						//Аверсон 10.08.2021 КВВ СВФР-007578 (
						//|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ВидРасчетаИзмерение)
						|ВЫБОР КОГДА 
						|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение.Код ЕСТЬ NULL
						|ТОГДА
						|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
						|ИНАЧЕ
						|ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение 
						|КОНЕЦ В(&ВидРасчетаИзмерение)
						//Аверсон 10.08.2021 КВВ СВФР-007578 )
						|
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
						Запрос.УстановитьПараметр("Организация", Организация);                    
						Запрос.УстановитьПараметр("Сотрудник", РаботникСтрока.Сотрудник);
						Запрос.УстановитьПараметр("Период", РаботникСтрока.ДатаНачала - 86400);
						Запрос.УстановитьПараметр("ВидРасчетаИзмерение", СписокНачисленийПоГруппе);
						мВыборка = Запрос.Выполнить().Выгрузить();
						Если мВыборка.Количество() <> 0 Тогда
							Для Каждого СтрмВыборка Из мВыборка Цикл
								
								мНайдено = Ложь;
								СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
								Пока СписокВидовРасчета.Следующий() Цикл
									СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СтрмВыборка.ВидРасчета));
									Для Каждого СтрОснНач Из СтрокиОсновныхНачислений Цикл
										ОсновныеНачисления.Удалить(СтрОснНач);
									КонецЦикла;
								КонецЦикла;
								
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = СтрмВыборка.ВидРасчета;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
								
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = СтрмВыборка.ВидРасчета;
								Строка.Показатель1 = СтрмВыборка.Показатель1;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
				//Аверсон 07.07.2021 КВВ СВФР-007578 )
				
				//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано
				////Аверсон 05.11.2021 КВВ СВФР-008331 (
				//Если Организация.ИНН = "700067572" И ТекущаяСтрока.СдельнаяОплата Тогда
				//	ВР_Ученические = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("15.Ученические");
				//	Если ЗначениеЗаполнено(ВР_Ученические) Тогда
				//		СтруктураДляПоиска = Новый Структура;
				//		СтруктураДляПоиска.Вставить("Сотрудник", ТекущаяСтрока.Сотрудник);
				//		СтруктураДляПоиска.Вставить("ВидРасчета",ВР_Ученические);
				//		
				//		МассивСтрок = ОсновныеНачисления.НайтиСтроки(СтруктураДляПоиска); 
				//		Если МассивСтрок.Количество() > 0 Тогда
				//			Для Каждого СтрМассивСтрок ИЗ МассивСтрок Цикл
				//				Если СтрМассивСтрок.Показатель1 <> ТекущаяСтрока.МесячнаяТарифнаяСтавка Тогда
				//					СтрМассивСтрок.Показатель1 = ТекущаяСтрока.МесячнаяТарифнаяСтавка;
				//				КонецЕсли;
				//			КонецЦикла;
				//		КонецЕсли;
				//	КонецЕсли;
				//КонецЕсли;
				////Аверсон 05.11.2021 КВВ СВФР-008331 )
				//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
				
				//если не НеМенятьПовышениеЕТСИнстр Тогда 
				//	УдалитьПовышенияПоРаботнику(ТекущаяСтрока.Сотрудник);
				//	ДобавитьПовышенияПоСтроке(ТекущаяСтрока);
				//КонецЕсли;
			Иначе	Сообщить("Невозможно рассчитать месячный тариф по ЕТС. Не введен параметр Ставка 1 разряда по Организации");
			КонецЕсли;
		КонецЕсли;
		
	Иначе  Сообщить("Невозможно рассчитать месячный тариф по ЕТС. Не введен параметр дата начала действия кадрового перемещения");	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьПовышенияПоРаботнику(Сотрудник)
	
	СтруктураПоиска = Новый Структура("Сотрудник", Сотрудник);
	
	// удалять начисления будем в том случае, когда в т.ч. Работники эта строка с сотрудником - последняя
	Если РаботникиОрганизации.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Строки = КоэфПовышенияТО.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТабличнойЧасти из Строки Цикл
		КоэфПовышенияТО.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	
	Строки = ПовышенияПоИнструкции.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТабличнойЧасти из Строки Цикл
		ПовышенияПоИнструкции.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры // УдалитьНачисленияПоРаботнику()

Процедура ДобавитьПовышенияПоСтроке(СтрокаТабличнойЧасти)
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаНачала), СтрокаТабличнойЧасти.ДатаНачала, Дата); //Островская Татьяна 26.02.2014 № 17141
	
	ВыбраннаяДолжность 	= СтрокаТабличнойЧасти.Должность.СтрокаЕТС;
	
	СписокКоэффициентов = Новый СписокЗначений;
	ВыбранныйРазряд = СокрЛП(СтрокаТабличнойЧасти.РазрядЕТС);
	//Островская Татьяна 25.02.2014 № 17141
	НовыйКорректирующийКоэфф = Справочники.КорректирующийКоэффициент.ПустаяСсылка();
	Для каждого СтрокаРазряда из ВыбраннаяДолжность.Коэффициенты цикл
		Если СтрокаРазряда.Разряд = ВыбранныйРазряд тогда
			НовыйКорректирующийКоэфф = СтрокаРазряда.КорректКоэффициент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	ДобавитьСтрокиКоэфПовышенияТО(СтрокаТабличнойЧасти.Сотрудник, ДатаАктуальности,НовыйКорректирующийКоэфф);
	//Островская Татьяна 26.02.2014 № 17141
	ДобавитьСтрокиПовышенияПоИнструкции(СтрокаТабличнойЧасти.Сотрудник, ДатаАктуальности);
	
КонецПроцедуры

Процедура ПроверкаНаПравильностьПоказателей()
	Для Каждого СтрокаТабличнойЧасти Из РаботникиОрганизации Цикл
		ДатаАктуальности = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаНачала), СтрокаТабличнойЧасти.ДатаНачала, Дата);
		
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.УстановитьПараметр("Сотрудник", СтрокаТабличнойЧасти.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
		ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
		
		ЗапросНачисления.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
		|	Начисления.Сотрудник,
		|	Начисления.Сотрудник.Физлицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.ВидРасчетаЗавершения
		|		ИНАЧЕ Начисления.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель1Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель1
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель2Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель2
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель3Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель3
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель4Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель4
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд1Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд1
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд2Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд2
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд3Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд3
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд4Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд4
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта1Завершения
		|		ИНАЧЕ Начисления.Валюта1
		|	КОНЕЦ КАК Валюта1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта2Завершения
		|		ИНАЧЕ Начисления.Валюта2
		|	КОНЕЦ КАК Валюта2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта3Завершения
		|		ИНАЧЕ Начисления.Валюта3
		|	КОНЕЦ КАК Валюта3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта4Завершения
		|		ИНАЧЕ Начисления.Валюта4
		|	КОНЕЦ КАК Валюта4
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			Сотрудник В (&Сотрудник)
		|				И ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|				И Регистратор <> &Регистратор) КАК Начисления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Начисления.ПериодЗавершения <= &Период
		|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА Начисления.ДействиеЗавершения
		|			ИНАЧЕ Начисления.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И Начисления.ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО";
		
		Выборка = ЗапросНачисления.Выполнить().Выбрать();
		
		СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета");
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			МассивНачислений = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
			Если МассивНачислений.Количество() <> 0 Тогда
				Если МассивНачислений[0].Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
					Если МассивНачислений[0].Показатель1 <> Выборка.Показатель1 ИЛИ МассивНачислений[0].Показатель2 <> Выборка.Показатель2 ИЛИ МассивНачислений[0].Показатель3 <> Выборка.Показатель3 ИЛИ МассивНачислений[0].Показатель4 <> Выборка.Показатель4 Тогда
						Сообщить("По сотруднику "+Строка(Выборка.Сотрудник)+"не соответствует начисление "+Строка(Выборка.ВидРасчета)+" введено "+ +Строка(МассивНачислений[0].Показатель1)+" "+Строка(МассивНачислений[0].Показатель2)+ " дейструет " +Строка(Выборка.Показатель1)+" "+Строка(Выборка.Показатель2));
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщить("По сотруднику "+Строка(Выборка.Сотрудник)+"не введено но дейструет начисление "+Строка(Выборка.ВидРасчета)+" "+Строка(Выборка.Показатель1)+" "+Строка(Выборка.Показатель2));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРазмерТарифнойСтавки(ТарифнаяСтавка, ДатаНачала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ДатаНачала);
	Запрос.УстановитьПараметр("ТарифнаяСтавка", ТарифнаяСтавка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТарифнаяСтавка = &ТарифнаяСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Размер;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Очистить();
	Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Записать();
	Движения.КоэфПовышенияТО.Очистить();
	Движения.КоэфПовышенияТО.Записать();
	Движения.КоэффициентИндексацииЗаработка.Очистить();
	Движения.КоэффициентИндексацииЗаработка.Записать();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	Движения.ПовышенияПоИнструкции.Очистить();
	Движения.ПовышенияПоИнструкции.Записать();
	Движения.ТарифныеСтавкиРаботниковОрганизации.Очистить();
	Движения.ТарифныеСтавкиРаботниковОрганизации.Записать();
	
	//Определяем Есть ли документ со ссылкой этого дкумента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка КАК Документ
	|ИЗ
	|	Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
	|ГДЕ
	|	КадровоеПеремещениеОрганизацийРаботникиОрганизации.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Документ.Метаданные().Имя = "КадровоеПеремещениеОрганизаций" Тогда
			//Аверсон 30.08.2016
			//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
			//СотрудникОбъект = Выборка.Сотрудник.ПолучитьОбъект();
			//
			//мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(Выборка.ДатаНачала - 86400, Выборка.Сотрудник, 1);
			
			//Если Выборка.ТипРаботника <> мСтрока.ТипРаботника Тогда
			//	СотрудникОбъект.ТипРаботника = мСтрока.ТипРаботника;
			//	Если мСтрока.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
			//		СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
			//	Иначе
			//		СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
			//	КонецЕсли;	
			//	СотрудникОбъект.Записать();
			//КонецЕсли;
			//заявка №1734
			//Аверсон
			
			мДокумент = Выборка.Документ.ПолучитьОбъект();
			НайденнаяСтрока = мДокумент.РаботникиОрганизации.Найти(ЭтотОбъект.Ссылка, "Документ");
			Если НайденнаяСтрока = Неопределено Тогда
				ОбщегоНазначения.СообщитьОбОшибке("не найден!");
			Иначе
				НайденнаяСтрока.ДругоеПеремещение = Ложь;
				НайденнаяСтрока.Документ = Null;
				Если мДокумент.Проведен Тогда
					мДокумент.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					мДокумент.Записать();
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
	КонецЦикла;	
	
	//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
	Для Каждого ТекСтрока из РаботникиОрганизации Цикл
		СотрудникОбъект = ТекСтрока.Сотрудник.ПолучитьОбъект();
		мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(ТекСтрока.ДатаНачала - 86400, ТекСтрока.Сотрудник, 1,Организация);	//О.Т. Аверсон 16.10.2017 № 1120	
		Если ТекСтрока.ТипРаботника <> мСтрока.ТипРаботника Тогда
			СотрудникОбъект.ТипРаботника = мСтрока.ТипРаботника;
			Если мСтрока.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
				СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
			Иначе
				СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
			КонецЕсли;	
			СотрудникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	//заявка №1734
КонецПроцедуры

///енд толик

//Аверсон ЕАЕ 16.12.2024 СВФР-014218
//Гродно
Функция ЕстьЗаписьРСРаботникиОрганизаций(ДатаПроверки, СтруктураИзмерения)
	Есть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Организация,
		|	РаботникиОрганизаций.ТипРаботникаУдалить,
		|	РаботникиОрганизаций.УдалитьСотрудникЗаменяемый
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период = &Период
		|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
		|	И РаботникиОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", СтруктураИзмерения.Организация);
	Запрос.УстановитьПараметр("Период", ДатаПроверки);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураИзмерения.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Есть = Истина;
	КонецЕсли;
	
	Возврат Есть;
КонецФункции

Функция ПолучитьДатыНачалаРС()  
	Если Организация.КадровоеДвижениеВСекундах Тогда
		ТЗ = РаботникиОрганизации.Выгрузить(,"Сотрудник,ДатаНачала");
		ТЗ.Колонки.Добавить("ДатаНачалаРС", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
		Для Каждого Стр Из ТЗ Цикл
			ДатаПроверки = Стр.ДатаНачала;
			
			СтруктураИзмерения = Новый Структура;
			СтруктураИзмерения.Вставить("Сотрудник", Стр.Сотрудник);
			СтруктураИзмерения.Вставить("Организация", Организация);
			
			Пока ЕстьЗаписьРСРаботникиОрганизаций(ДатаПроверки, СтруктураИзмерения) Цикл
				ДатаПроверки = ДатаПроверки + 1;	
			КонецЦикла;
			Стр.ДатаНачалаРС = ДатаПроверки;
		КонецЦикла;
	Иначе
		ТЗ = Неопределено;	
	КонецЕсли;
	
	Возврат ТЗ;
КонецФункции
//Аверсон СВФР-014218

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
