//(начало) добавлено Кухарчуком Д.Я. 17.08.18, Задача СВФР-002063

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект                 - объект редактируемого документа,
//  ТекПользователь                - ссылка на справочник, определяет текущего пользователя  
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//  ТипОперации                    - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                   если не передан, то реквизиты, зависящие от вида операции, не заполняются
//
Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "") Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	Если МетаданныеДокумента.Реквизиты.Найти("Ответственный") <> Неопределено 
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.Ответственный)) Тогда 
		ДокументОбъект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Автор", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Автор)) Тогда
		ДокументОбъект.Автор = ТекПользователь;
	КонецЕсли;
	
	// Флаги принадлежности к учету заполняем, только если оба не заполнены
	Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВУправленческомУчете") <> Неопределено
		И МетаданныеДокумента.Реквизиты.Найти("ОтражатьВБухгалтерскомУчете") <> Неопределено Тогда
		Если Не (ДокументОбъект.ОтражатьВУправленческомУчете 
			или ДокументОбъект.ОтражатьВБухгалтерскомУчете) Тогда
			
			ДокументОбъект.ОтражатьВУправленческомУчете = Ложь;
			ДокументОбъект.ОтражатьВБухгалтерскомУчете  = Истина;
			
			Если МетаданныеДокумента.Реквизиты.Найти("ОтражатьВНалоговомУчете") <> Неопределено Тогда
				ДокументОбъект.ОтражатьВНалоговомУчете = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("Подразделение") <> Неопределено 
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение)) Тогда
		ДокументОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделение");
	КонецЕсли;
	
	ПроверятьСоответствиеПодразделенияОрганизации = Ложь;
	Если МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено Тогда
		ПроверятьСоответствиеПодразделенияОрганизации = Истина;
		Если (НЕ ЗначениеЗаполнено(ДокументОбъект.Организация)) Тогда
			ДокументОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ВидОперации") <> Неопределено
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)) Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("СчетОрганизации") <> Неопределено
		И (НЕ ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации))
		И (ЗначениеЗаполнено(ДокументОбъект.Организация.ЮрФизЛицо)) Тогда
		СчетПоУмолчанию = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
		ДокументОбъект.СчетОрганизации = СчетПоУмолчанию;
		Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено
			И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) Тогда
			ДокументОбъект.ВалютаДокумента =  СчетПоУмолчанию.ВалютаДенежныхСредств;
		КонецЕсли;
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ПодразделениеОрганизации") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПодразделениеОрганизации)) Тогда
	   ПодразделениеПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделениеОрганизации");
	   Если ПроверятьСоответствиеПодразделенияОрганизации Тогда
		   Если ПодразделениеПоУмолчанию.Владелец = ДокументОбъект.Организация Тогда
			   ДокументОбъект.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
		   КонецЕсли;
	   Иначе 	
		   ДокументОбъект.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
	   КонецЕсли;
	КонецЕсли;
		
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента)) Тогда
		ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("КурсДокумента") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента)) Тогда
	    СтруктураКурсаДокумента      = ОбщегоНазначения.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

		Если МетаданныеДокумента.Реквизиты.Найти("КратностьДокумента") <> Неопределено Тогда
			ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;

	Если МетаданныеДокумента.Реквизиты.Найти("ПериодРегистрации") <> Неопределено
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации)) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("ДатаВыплатыДохода") <> Неопределено
	   ТОГДА
		ДокументОбъект.ДатаВыплатыДохода = НачалоДня(Макс(ОбщегоНазначения.ПолучитьРабочуюДату(),ДокументОбъект.Дата));
	КонецЕсли;
	
	Если МетаданныеДокумента.Реквизиты.Найти("СпособВыплаты") <> Неопределено
		И Не ЗначениеЗаполнено(ДокументОбъект.СпособВыплаты) Тогда 
		ДокументОбъект.СпособВыплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСпособВыплаты");
		Если ДокументОбъект.СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Или ДокументОбъект.СпособВыплаты.Пустая() И Не УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойБанк").Пустая() Тогда 
			Если ДокументОбъект.СпособВыплаты.Пустая() Тогда 
				ДокументОбъект.СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк;
			КонецЕсли;
			Если МетаданныеДокумента.Реквизиты.Найти("Банк") <> Неопределено
				И Не ЗначениеЗаполнено(ДокументОбъект.Банк) Тогда 
				ДокументОбъект.Банк = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойБанк");
			КонецЕсли;
			Если МетаданныеДокумента.Реквизиты.Найти("БанкФилиал") <> Неопределено
				И Не ЗначениеЗаполнено(ДокументОбъект.БанкФилиал) Тогда 
				ДокументОбъект.БанкФилиал = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойБанкФилиал");
			КонецЕсли;
			Если МетаданныеДокумента.Реквизиты.Найти("ВидСчета") <> Неопределено
				И Не ЗначениеЗаполнено(ДокументОбъект.ВидСчета) Тогда 
				ДокументОбъект.ВидСчета = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойВидСчета");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//УправлениеДопПравамиПользователей.УстановитьФлагиПоУмолчаниюВДокументе(ДокументОбъект,ТекПользователь);
	
КонецПроцедуры // ЗаполнитьШапкуДокумента()


Функция ОбработатьСостоянияРаботниковОрганизаций(Запрос, ОтборПоТаблицеСотрудников, ИзДокумента = Ложь) Экспорт 

	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускСоциальный);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.Донор);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ВоенноУчебныеСборы);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДопризывнаяПодготовка);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.МедКомиссия);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	СписокСостояний.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
	
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.Карантин);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоследствияТравмыВБыту);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоследствияТравмыНаПроизводстве);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПособиеПриДолечивании);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПособиеПриДолечиванииРеабилитация);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоУходуЗаРебенкомБолезньМатери);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПоУходуЗаРебенкомИнвалидом);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.Протезирование);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПротезированиеТравма);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПрофессиональноеЗаболевание);
	
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ТравмаВБыту);
	Список.Добавить(Перечисления.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве);
	
	СписокКомандировок = Новый СписокЗначений;
	СписокКомандировок.Добавить(Перечисления.СостоянияРаботникаОрганизации.Командировка);
	                           
	
	Запрос.УстановитьПараметр("СписокСостояний",СписокСостояний);
	Запрос.УстановитьПараметр("Список",Список);
	Запрос.УстановитьПараметр("СписокКомандировок",СписокКомандировок);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СостояниеРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	СостояниеРаботниковОрганизаций.Регистратор КАК Регистратор,
	|	СостояниеРаботниковОрганизаций.Период КАК Период,
	|	СостояниеРаботниковОрганизаций.Состояние КАК Состояние,
	|	СостояниеРаботниковОрганизаций.ПериодЗавершения КАК ПериодЗавершения,
	|	СостояниеРаботниковОрганизаций.СостояниеЗавершения
	|ПОМЕСТИТЬ ВТВременныеСостояния
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
	|		ИЗ
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(СостояниеРаботниковОрганизаций.Период) КАК Период,
	|				СостояниеРаботниковОрганизаций.Сотрудник КАК Сотрудник
	|			ИЗ
	|				РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|			ГДЕ
	|				СостояниеРаботниковОрганизаций.Период <= &НачалоМесяца
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СостояниеРаботниковОрганизаций.Сотрудник
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|
	|			
	|			ВЫБРАТЬ
	|				МАКСИМУМ(СостояниеРаботниковОрганизаций.ПериодЗавершения),
	|				СостояниеРаботниковОрганизаций.Сотрудник
	|			ИЗ
	|				РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|			ГДЕ
	|				СостояниеРаботниковОрганизаций.ПериодЗавершения <= &НачалоМесяца
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СостояниеРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|		ПО СостояниеРаботниковОрганизаций.Сотрудник = ВложенныйЗапрос.Сотрудник
	|			И (СостояниеРаботниковОрганизаций.Сотрудник В ("+ОтборПоТаблицеСотрудников+ "))
	|			И (СостояниеРаботниковОрганизаций.Период = ВложенныйЗапрос.Период
	|				ИЛИ СостояниеРаботниковОрганизаций.ПериодЗавершения = ВложенныйЗапрос.Период)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизаций.Сотрудник,
	|	СостояниеРаботниковОрганизаций.Регистратор,
	|	СостояниеРаботниковОрганизаций.Период,
	|	СостояниеРаботниковОрганизаций.Состояние,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ
	|	СостояниеРаботниковОрганизаций.Сотрудник В ("+ОтборПоТаблицеСотрудников+ ")
	|		И СостояниеРаботниковОрганизаций.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&НачалоМесяца,МЕСЯЦ,-1) И &НачалоМесяца
	|			И СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &КонецМесяца
	|			ТОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения
	|		ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Период
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &КонецМесяца
	|			ТОГДА СостояниеРаботниковОрганизацийСрезПоследних.СостояниеЗавершения
	|		ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|	КОНЕЦ,
	|	NULL,
	|	NULL
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&КонецМесяца, ) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник В ("+ОтборПоТаблицеСотрудников+ ")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизаций.Сотрудник,
	|	СостояниеРаботниковОрганизаций.Регистратор,
	|	СостояниеРаботниковОрганизаций.Период,
	|	СостояниеРаботниковОрганизаций.Состояние,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НеявкиИБолезниОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА СостояниеРаботниковОрганизаций.ПериодЗавершения =  ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА &КонецМесяца
	|					ИНАЧЕ СостояниеРаботниковОрганизаций.ПериодЗавершения
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеРаботниковОрганизаций.ПериодЗавершения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НеявкиИБолезниОрганизаций
	|			ТОГДА ВЫБОР
	|					КОГДА СостояниеРаботниковОрганизаций.ПериодЗавершения =  ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА СостояниеРаботниковОрганизаций.Состояние
	|					ИНАЧЕ СостояниеРаботниковОрганизаций.СостояниеЗавершения
	|				КОНЕЦ
	|		ИНАЧЕ СостояниеРаботниковОрганизаций.СостояниеЗавершения
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|ГДЕ
	|	(СостояниеРаботниковОрганизаций.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
	|			ИЛИ СостояниеРаботниковОрганизаций.ПериодЗавершения МЕЖДУ &НачалоМесяца И &КонецМесяца
	|			ИЛИ &НачалоМесяца МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения
	|			ИЛИ &КонецМесяца МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения)
	|	И СостояниеРаботниковОрганизаций.Сотрудник В ("+ОтборПоТаблицеСотрудников+ ")
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период";
	Запрос.Выполнить();
	
	//|	И СостояниеРаботниковОрганизаций.Сотрудник В
	//|			("+ОтборПоТаблицеСотрудников+ ")
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СостояниеРаботниковНеотработанное.Сотрудник КАК Сотрудник,
	|	СостояниеРаботниковНеотработанное.Период КАК Период,
	|	СостояниеРаботниковНеотработанное.Состояние КАК Состояние,
	|	СостояниеРаботниковНеотработанное.СостояниеЗавершения КАК СостояниеЗавершения,
	|	СостояниеРаботниковНеотработанное.ПериодЗавершения КАК ПериодЗавершения,
	|	СостояниеРаботниковНеотработанное.Регистратор
	|ПОМЕСТИТЬ ВТВременныеСостоянияНеобр
	|ИЗ
	|	ВТВременныеСостояния КАК СостояниеРаботниковНеотработанное
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период,
	|	ПериодЗавершения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ), СЕКУНДА, 10) КАК Период,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Состояние,
	|	ВложенныйЗапрос.Регистратор
	|ПОМЕСТИТЬ ВТБольничные
	|ИЗ
	|	(ВЫБРАТЬ
	|		РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Период,
	|		ВТВременныеСостоянияНеобр.Сотрудник КАК Сотрудник,
	|		ВТВременныеСостоянияНеобр.Состояние КАК Состояние,
	|		ВТВременныеСостоянияНеобр.Регистратор КАК Регистратор
	|	ИЗ
	|		ВТВременныеСостоянияНеобр КАК ВТВременныеСостоянияНеобр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|			ПО (КОНЕЦПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, ДЕНЬ) МЕЖДУ НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобр.Период, ДЕНЬ) И НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобр.ПериодЗавершения, ДЕНЬ))
	|	ГДЕ
	|		ВТВременныеСостоянияНеобр.Регистратор ССЫЛКА Документ.НеявкиИБолезниОрганизаций) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВременныеСостоянияНеобр.Сотрудник,
	|	ВТВременныеСостоянияНеобр.Период,
	|	ВТВременныеСостоянияНеобр.Состояние,
	|	ВТВременныеСостоянияНеобр.СостояниеЗавершения КАК СостояниеЗавершения,
	|	ВЫБОР
	|		КОГДА ВТВременныеСостоянияНеобр.СостояниеЗавершения <> ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|			ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобр.ПериодЗавершения, ДЕНЬ), СЕКУНДА, 15)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобр.ПериодЗавершения, ДЕНЬ)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВТВременныеСостоянияНеобр.Регистратор
	|ПОМЕСТИТЬ ВТВременныеСостоянияНеобработанныеНовые
	|ИЗ
	|	ВТВременныеСостоянияНеобр КАК ВТВременныеСостоянияНеобр
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТБольничные.Сотрудник,
	|	ВТБольничные.Период,
	|	ВТБольничные.Состояние,
	|	NULL,
	|	NULL,
	|	ВТБольничные.Регистратор
	|ИЗ
	|	ВТБольничные КАК ВТБольничные";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СостояниеРаботниковНеотработанное.Сотрудник КАК Сотрудник,
	|	СостояниеРаботниковНеотработанное.Период КАК Период,
	|	СостояниеРаботниковНеотработанное.Состояние КАК Состояние,
	|	СостояниеРаботниковНеотработанное.СостояниеЗавершения КАК СостояниеЗавершения,
	|	СостояниеРаботниковНеотработанное.ПериодЗавершения КАК ПериодЗавершения,
	|	СостояниеРаботниковНеотработанное.Регистратор
	|ПОМЕСТИТЬ ВТВременныеСостоянияНеобработанные
	|ИЗ
	|	ВТВременныеСостоянияНеобработанныеНовые КАК СостояниеРаботниковНеотработанное
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период,
	|	ПериодЗавершения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТВременныеСостоянияНеобработанные.Сотрудник,
	|	ВТВременныеСостоянияНеобработанные.Период,
	|	ВТВременныеСостоянияНеобработанные.Состояние,
	|	1 КАК Поле1
	|ПОМЕСТИТЬ ВТСостоянияПоПериодам
	|ИЗ
	|	ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТВременныеСостоянияНеобработанные.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ВТВременныеСостоянияНеобработанные.Период) КАК Период,
	|			НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобработанные.Период, ДЕНЬ) КАК Период1
	|		ИЗ
	|			ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ГДЕ
	|			НЕ ВТВременныеСостоянияНеобработанные.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТВременныеСостоянияНеобработанные.Сотрудник,
	|			НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобработанные.Период, ДЕНЬ)) КАК ВложенныйЗапрос
	|		ПО ВТВременныеСостоянияНеобработанные.Сотрудник = ВложенныйЗапрос.Сотрудник
	|			И ВТВременныеСостоянияНеобработанные.Период = ВложенныйЗапрос.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВременныеСостоянияНеобработанные.Сотрудник,
	|	ВТВременныеСостоянияНеобработанные.ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(ВТВременныеСостоянияНеобработанные.ПериодЗавершения, ДЕНЬ) = КОНЕЦПЕРИОДА(ВложенныйЗапрос.ПериодЗавершения, ДЕНЬ)
	|			ТОГДА ВТВременныеСостоянияНеобработанные.СостояниеЗавершения
	|		КОГДА ВТВременныеСостоянияНеобработанные.ПериодЗавершения МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения
	|			ТОГДА ВложенныйЗапрос.Состояние
	|		ИНАЧЕ ВТВременныеСостоянияНеобработанные.СостояниеЗавершения
	|	КОНЕЦ,
	|	2
	|ИЗ
	|	ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТВременныеСостоянияНеобработанные.Сотрудник КАК Сотрудник,
	|			ВТВременныеСостоянияНеобработанные.Период КАК Период,
	|			ВТВременныеСостоянияНеобработанные.Состояние КАК Состояние,
	|			ВТВременныеСостоянияНеобработанные.СостояниеЗавершения КАК СостояниеЗавершения,
	|			ВТВременныеСостоянияНеобработанные.ПериодЗавершения КАК ПериодЗавершения
	|		ИЗ
	|			ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ГДЕ
	|			ВТВременныеСостоянияНеобработанные.Состояние В(&Список)) КАК ВложенныйЗапрос
	|		ПО ВТВременныеСостоянияНеобработанные.Сотрудник = ВложенныйЗапрос.Сотрудник
	|ГДЕ
	|	ВТВременныеСостоянияНеобработанные.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВТВременныеСостоянияНеобработанные.СостояниеЗавершения = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Состояние В (&Список)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Состояние В (&СписокКомандировок)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВременныеСостоянияНеобработанные.Сотрудник,
	|	ВТВременныеСостоянияНеобработанные.ПериодЗавершения,
	|	ВТВременныеСостоянияНеобработанные.СостояниеЗавершения,
	|	3
	|ИЗ
	|	ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТВременныеСостоянияНеобработанные.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ВТВременныеСостоянияНеобработанные.ПериодЗавершения) КАК ПериодЗавершения,
	|			НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобработанные.ПериодЗавершения, ДЕНЬ) КАК ДЕНЬЗавершения
	|		ИЗ
	|			ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТВременныеСостоянияНеобработанные.Сотрудник,
	|			НАЧАЛОПЕРИОДА(ВТВременныеСостоянияНеобработанные.ПериодЗавершения, ДЕНЬ)) КАК ВложенныйЗапрос
	|		ПО ВТВременныеСостоянияНеобработанные.Сотрудник = ВложенныйЗапрос.Сотрудник
	|			И ВТВременныеСостоянияНеобработанные.ПериодЗавершения = ВложенныйЗапрос.ПериодЗавершения
	|ГДЕ
	|	ВТВременныеСостоянияНеобработанные.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Состояние В (&СписокСостояний)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Состояние В (&СписокКомандировок)
	|	И НЕ ВТВременныеСостоянияНеобработанные.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.ПериодЗавершения,
	|	ВложенныйЗапрос.СостояниеЗавершения,
	|	4
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Состояние КАК Состояние,
	|		ВЫБОР
	|			КОГДА ВТВременныеСостоянияНеобработанные.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения
	|				ТОГДА ВТВременныеСостоянияНеобработанные.Состояние
	|			ИНАЧЕ ВложенныйЗапрос.СостояниеЗавершения
	|		КОНЕЦ КАК СостояниеЗавершения,
	|		ВЫБОР
	|			КОГДА ВТВременныеСостоянияНеобработанные.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения
	|				ТОГДА ВТВременныеСостоянияНеобработанные.Период
	|			ИНАЧЕ ВложенныйЗапрос.ПериодЗавершения
	|		КОНЕЦ КАК ПериодЗавершения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТВременныеСостоянияНеобработанные.Сотрудник КАК Сотрудник,
	|			ВТВременныеСостоянияНеобработанные.Период КАК Период,
	|			ВТВременныеСостоянияНеобработанные.ПериодЗавершения КАК ПериодЗавершения,
	|			ВТВременныеСостоянияНеобработанные.Состояние КАК Состояние,
	|			ВТВременныеСостоянияНеобработанные.СостояниеЗавершения КАК СостояниеЗавершения
	|		ИЗ
	|			ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ГДЕ
	|			ВТВременныеСостоянияНеобработанные.Состояние В(&СписокКомандировок)) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|			ПО ВложенныйЗапрос.Сотрудник = ВТВременныеСостоянияНеобработанные.Сотрудник
	|				И (ВТВременныеСостоянияНеобработанные.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения)
	|				И (ВТВременныеСостоянияНеобработанные.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВложенныйЗапрос.Сотрудник,
	|		ВложенныйЗапрос.Период,
	|		ВложенныйЗапрос.Состояние,
	|		ВЫБОР
	|			КОГДА СостояниеРаботниковОрганизаций.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения
	|				ТОГДА СостояниеРаботниковОрганизаций.Состояние
	|			ИНАЧЕ ВложенныйЗапрос.СостояниеЗавершения
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СостояниеРаботниковОрганизаций.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения
	|				ТОГДА СостояниеРаботниковОрганизаций.Период
	|			ИНАЧЕ ВложенныйЗапрос.ПериодЗавершения
	|		КОНЕЦ
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВТВременныеСостоянияНеобработанные.Сотрудник КАК Сотрудник,
	|			ВТВременныеСостоянияНеобработанные.Период КАК Период,
	|			ВТВременныеСостоянияНеобработанные.ПериодЗавершения КАК ПериодЗавершения,
	|			ВТВременныеСостоянияНеобработанные.Состояние КАК Состояние,
	|			ВТВременныеСостоянияНеобработанные.СостояниеЗавершения КАК СостояниеЗавершения
	|		ИЗ
	|			ВТВременныеСостоянияНеобработанные КАК ВТВременныеСостоянияНеобработанные
	|		ГДЕ
	|			ВТВременныеСостоянияНеобработанные.Состояние В(&СписокКомандировок)) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|			ПО ВложенныйЗапрос.Сотрудник = СостояниеРаботниковОрганизаций.Сотрудник
	|				И (СостояниеРаботниковОрганизаций.Период МЕЖДУ ВложенныйЗапрос.Период И ВложенныйЗапрос.ПериодЗавершения)
	|				И (СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций)) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТСостоянияПоПериодам.Сотрудник КАК Сотрудник,
	|	ВТСостоянияПоПериодам.Период КАК Период,
	|	ВТСостоянияПоПериодам.Состояние
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСостоянияПоПериодам.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(ВТСостоянияПоПериодам.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(ВТСостоянияПоПериодам.Период, ДЕНЬ) КАК ДЕНЬ
	|	ИЗ
	|		ВТСостоянияПоПериодам КАК ВТСостоянияПоПериодам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСостоянияПоПериодам.Сотрудник,
	|		НАЧАЛОПЕРИОДА(ВТСостоянияПоПериодам.Период, ДЕНЬ)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостоянияПоПериодам КАК ВТСостоянияПоПериодам
	|		ПО ВложенныйЗапрос.Сотрудник = ВТСостоянияПоПериодам.Сотрудник
	|			И ВложенныйЗапрос.Период = ВТСостоянияПоПериодам.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Период";

	ТЗВрем = Запрос.Выполнить().Выгрузить();
	
	мСтрок = ТЗВрем.НайтиСтроки(Новый Структура("Состояние", Перечисления.СостоянияРаботникаОрганизации.Работает));
	ТЗРаботают = ТЗВрем.Скопировать(мСтрок);
	Для Каждого СтрокаКУд Из мСтрок Цикл 
		ТЗВрем.Удалить(СтрокаКУд);
	КонецЦикла;
	мСтрок = ТЗВрем.НайтиСтроки(Новый Структура("Состояние", Перечисления.СостоянияРаботникаОрганизации.Заболевание));
	ТЗБолеют = ТЗВрем.Скопировать(мСтрок);
	Для Каждого СтрокаКУд Из мСтрок Цикл 
		ТЗВрем.Удалить(СтрокаКУд);
	КонецЦикла;
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТЗБолеют, ТЗРаботают);
	
	//Склеим последовательные записи отпуска в один период
	Н = ТЗВрем.Количество() - 1;
	Пока Н > 0 Цикл
		
		ТекущаяЗапись = ТЗВрем[Н];
		ПредшествующаяЗапись = ТЗВрем[Н-1];
		
		Если (НачалоДня(ТекущаяЗапись.Период) = КонецДня(ПредшествующаяЗапись.Период)+1
			ИЛИ КонецДня(ТекущаяЗапись.Период) = КонецДня(ПредшествующаяЗапись.Период)) // если записи непрерывны (идут друг за другом по времени)
			// и совпадают параметры Физлица
			И ТекущаяЗапись.Сотрудник = ПредшествующаяЗапись.Сотрудник
			И ТекущаяЗапись.Состояние = ПредшествующаяЗапись.Состояние
			И ТекущаяЗапись.Состояние = Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный 
			Тогда
			// объединим записи в одну
			//ПредшествующаяЗапись.Период = КонецДня(ТекущаяЗапись.Период);
			ТЗВрем.Удалить(ТекущаяЗапись);
		КонецЕсли;
		
		Н = Н - 1;
	КонецЦикла;
	
	//СтрокиОтпКУдалению = Новый Массив;
	//Для Каждого СтрокаРаботающих Из ТЗРаботают Цикл 
	//	мСтрок = ТЗВрем.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРаботающих.Сотрудник));
	//	Если мСтрок.Количество()>0 Тогда 
	//		Для Каждого СтрокаОтпуска Из мСтрок Цикл 
	//			Если СтрокаОтпуска.Период < Запрос.Параметры.НачалоМесяца Тогда 
	//				Продолжить;
	//			КонецЕсли;
	//			// отозвали полностью
	//			Если НачалоДня(СтрокаРаботающих.Период) = НачалоДня(СтрокаОтпуска.Период) Тогда 
	//				СтрокиОтпКУдалению.Добавить(СтрокаОтпуска);
	//			КонецЕсли;
	//			// отозвали с середины и до конца
	//			Если НачалоДня(СтрокаРаботающих.Период) > НачалоДня(СтрокаОтпуска.Период)
	//				Или КонецДня(СтрокаРаботающих.Период) = КонецДня(СтрокаОтпуска.Период) Тогда 
	//				СтрокаОтпуска.Период = СтрокаРаботающих.Период;
	//			КонецЕсли;
	//			// отозвали с начала и до
	//			Если НачалоДня(СтрокаРаботающих.Период) = НачалоДня(СтрокаОтпуска.Период) И КонецДня(СтрокаРаботающих.Период) < КонецДня(СтрокаОтпуска.Период) Тогда 
	//				СтрокаОтпуска.Период = СтрокаРаботающих.Период;
	//			КонецЕсли;
	//			//// если с середины и по переходящий
	//			//Если НачалоДня(СтрокаРаботающих.Период) > НачалоДня(СтрокаОтпуска.Период) И КонецДня(СтрокаРаботающих.ПериодЗавершения) > КонецМесяца(СтрокаОтпуска.Период) Тогда 
	//			//	СтрокаОтпуска.ПериодЗавершения = СтрокаРаботающих.Период;
	//			//КонецЕсли;
	//			// отозвали с середины по - два кусочка
	//			Если НачалоДня(СтрокаРаботающих.Период) > НачалоДня(СтрокаОтпуска.Период) И КонецДня(СтрокаРаботающих.Период) < КонецДня(СтрокаОтпуска.Период)
	//				 Тогда 
	//				// 1-й ограничим 
	//				ПериодПереходящий = СтрокаОтпуска.Период;
	//				СтрокаОтпуска.Период = СтрокаРаботающих.Период;
	//				// 2-й добавим
	//				НовыйПериодОтп = ТЗВрем.Добавить();
	//				ЗаполнитьЗначенияСвойств(НовыйПериодОтп, СтрокаОтпуска);
	//				НовыйПериодОтп.Период = СтрокаРаботающих.Период;
	//				//НовыйПериодОтп.ПериодЗавершения = ПериодПереходящий;
	//				// и заново найдем строки 
	//				мСтрок = ТЗВрем.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРаботающих.Сотрудник));
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Для Каждого СтрокаКУд Из СтрокиОтпКУдалению Цикл 
	//	ТЗВрем.Удалить(СтрокаКУд);
	//КонецЦикла;
	
	 ////теперь заново добавим болезни и работу
	//-ЗУП005. Горетовская, 2018.04.23 // в ТЗРаботают уже есть ТЗБолеют, см выше
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТЗБолеют, ТЗВрем);
	//--
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТЗРаботают, ТЗВрем);
	
	//-ЗУП005. Горетовская, 2018.04.23 // сортировать можно только при проверке для наглядности, т.к. большая затрата времени, и потом эта таблица уйдет в запрос 
	//ТЗВрем.Сортировать("Сотрудник, Период, Состояние");
	// --
	
	Запрос.УстановитьПараметр("ТЗОбработанные", ТЗВрем);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗОбработанные.Сотрудник,
	|	ТЗОбработанные.Состояние,
	|	ТЗОбработанные.Период,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодЗавершения,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПустаяСсылка) КАК СостояниеЗавершения
	|ПОМЕСТИТЬ ВТСостояниеРаботниковПоСтрокам
	|ИЗ
	|	&ТЗОбработанные КАК ТЗОбработанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостояниеРаботниковПоСтрокам.Сотрудник,
	|	ВТСостояниеРаботниковПоСтрокам.Состояние,
	|	ВТСостояниеРаботниковПоСтрокам.Период
	|ПОМЕСТИТЬ ВТСостояниеРаботниковНеотработанное
	|ИЗ
	|	ВТСостояниеРаботниковПоСтрокам КАК ВТСостояниеРаботниковПоСтрокам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &КонецМесяца
	|			ТОГДА СостояниеРаботниковОрганизацийСрезПоследних.СостояниеЗавершения
	|		ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &КонецМесяца
	|			ТОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения
	|		ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Период
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(
	|			&КонецМесяца,
	|			Сотрудник В
	|				(" +ОтборПоТаблицеСотрудников+ ")) КАК СостояниеРаботниковОрганизацийСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСостояниеРаботниковПоСтрокам.Сотрудник,
	|	ВТСостояниеРаботниковПоСтрокам.СостояниеЗавершения,
	|	ВТСостояниеРаботниковПоСтрокам.ПериодЗавершения
	|ИЗ
	|	ВТСостояниеРаботниковПоСтрокам КАК ВТСостояниеРаботниковПоСтрокам";
	Запрос.Выполнить();
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеРаботниковНеотработанное.Сотрудник КАК Сотрудник,
	|	НАЧАЛОПЕРИОДА(СостояниеРаботниковНеотработанное.Период, ДЕНЬ) КАК Период,
	|	МАКСИМУМ(СостояниеРаботниковНеотработанное.Состояние) КАК Состояние
	|ПОМЕСТИТЬ ВТСостояниеРаботников
	|ИЗ
	|	(ВЫБРАТЬ
	|		СостояниеРаботниковНеотработанное.Сотрудник КАК Сотрудник,
	|		НАЧАЛОПЕРИОДА(СостояниеРаботниковНеотработанное.Период, ДЕНЬ) КАК ДЕНЬ,
	|		МАКСИМУМ(СостояниеРаботниковНеотработанное.Период) КАК Период
	|	ИЗ
	|		ВТСостояниеРаботниковНеотработанное КАК СостояниеРаботниковНеотработанное
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СостояниеРаботниковНеотработанное.Сотрудник,
	|		НАЧАЛОПЕРИОДА(СостояниеРаботниковНеотработанное.Период, ДЕНЬ)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостояниеРаботниковНеотработанное КАК СостояниеРаботниковНеотработанное
	|		ПО ВложенныйЗапрос.Сотрудник = СостояниеРаботниковНеотработанное.Сотрудник
	|			И ВложенныйЗапрос.Период = СостояниеРаботниковНеотработанное.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СостояниеРаботниковНеотработанное.Сотрудник,
	|	НАЧАЛОПЕРИОДА(СостояниеРаботниковНеотработанное.Период, ДЕНЬ)
	|{УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Период}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Основной.Сотрудник КАК Сотрудник,
	|	Основной.Состояние,
	|	ВЫБОР
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускСоциальныйПоСреднему)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускСоциальныйПоСреднему)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателя)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателя)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателяБезСохраниенияЗП)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателяБезСохраниенияЗП)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниБезОплаты)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйДеньОтдыхаБезОплаты)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйПоНаправлению)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускУчебныйПоНаправлению)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Простой)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
	|		КОГДА Основной.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаНаПроизводстве), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ТравмаВБыту), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаВзрослым), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенком), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоследствияТравмыВБыту), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоследствияТравмыНаПроизводстве), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенкомБолезньМатери), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенкомВСлучаеСмертиМатери), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Протезирование), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПротезированиеТравма), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Карантин), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечивании), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПособиеПриДолечиванииРеабилитация), ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПрофессиональноеЗаболевание))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПоУходуЗаРебенкомИнвалидом)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПоУходуЗаРебенкомИнвалидом)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускСоциальный)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СоциальныйОтпуск)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СлужбаВРезерве)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СлужбаВРезерве)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствиеПоСправке)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтсутствиеПоСправке)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Донор)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Донор)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДеньМатериСОплатойПоСреднему)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДеньМатериСОплатойПоСреднему)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоИнициативеНанимателяБезСохраниенияЗП)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоИнициативеНанимателяБезСохраниенияЗП)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВоенноУчебныеСборы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВоенноУчебныеСборы)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДопризывнаяПодготовка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДопризывнаяПодготовка)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Медкомиссия)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Медкомиссия)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПодСледствием)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПодСледствием)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СельхозРаботы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СельхозРаботы)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.СтихийныеБедствия)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.СтихийныеБедствия)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтстранениеОтРаботы)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботы)
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ПовышениеКвалификации)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)";
	Если Не ИзДокумента Тогда
		Запрос.Текст = Запрос.Текст + "
		|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|		КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Увольнительная)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Увольнительная)
	|	КОНЕЦ КАК ВидВремени,
	|	Основной.Период КАК ПериодНачало,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL 
	|			ТОГДА &КонецМесяца
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(НАЧАЛОПЕРИОДА(Вспомогательный.Период, ДЕНЬ)), СЕКУНДА, -1)
	|	КОНЕЦ КАК ПериодКонец
	|ПОМЕСТИТЬ ВТСостояниеСотрудников
	|ИЗ
	|	ВТСостояниеРаботников КАК Основной
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеРаботников КАК Вспомогательный
	|		ПО (Вспомогательный.Сотрудник = Основной.Сотрудник)
	|			И (Вспомогательный.Период > Основной.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основной.Сотрудник,
	|	Основной.Состояние,
	|	Основной.Период";
	
	Если ИзДокумента Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Основной.Сотрудник,
		|	Основной.Состояние,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа),
		|	Основной.Период,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL 
		|			ТОГДА &КонецМесяца
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(НАЧАЛОПЕРИОДА(Вспомогательный.Период, ДЕНЬ)), СЕКУНДА, -1)
		|	КОНЕЦ
		|ИЗ
		|	ВТСостояниеРаботников КАК Основной
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеРаботников КАК Вспомогательный
		|		ПО (Вспомогательный.Сотрудник = Основной.Сотрудник)
		|			И (Вспомогательный.Период > Основной.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеЧасы КАК РаботаВПраздникиДоплата
		|		ПО Основной.Сотрудник = РаботаВПраздникиДоплата.Сотрудник
		|			И КонецПериода(Основной.Период,ДЕНЬ) = КонецПериода(РаботаВПраздникиДоплата.Период,ДЕНЬ)
		|ГДЕ
		|	Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
		|
		|СГРУППИРОВАТЬ ПО
		|	Основной.Сотрудник,
		|	Основной.Состояние,
		|	Основной.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Основной.Сотрудник,
		|	Основной.Состояние,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники),
		|	Основной.Период,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL 
		|			ТОГДА &КонецМесяца
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(НАЧАЛОПЕРИОДА(Вспомогательный.Период, ДЕНЬ)), СЕКУНДА, -1)
		|	КОНЕЦ
		|ИЗ
		|	ВТСостояниеРаботников КАК Основной
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеРаботников КАК Вспомогательный
		|		ПО (Вспомогательный.Сотрудник = Основной.Сотрудник)
		|			И (Вспомогательный.Период > Основной.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеЧасы КАК РаботаВПраздникиДоплата
		|		ПО Основной.Сотрудник = РаботаВПраздникиДоплата.Сотрудник
		|			И КонецПериода(Основной.Период,ДЕНЬ) = КонецПериода(РаботаВПраздникиДоплата.Период,ДЕНЬ)
		|ГДЕ
		|	Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.РаботаВПраздничныеИВыходныеДни)
		|	И РаботаВПраздникиДоплата.Доплачивать
		|
		|СГРУППИРОВАТЬ ПО
		|	Основной.Сотрудник,
		|	Основной.Состояние,
		|	Основной.Период";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ПериодНачало";
	
	
	Запрос.Выполнить();
	
КонецФункции


Процедура УстановитьПоследнееЗначениеСчетчика(ДокументОбъект) Экспорт 
	
	СтруктураНумератора = ПроверитьПодключениеНумератора(ДокументОбъект.Метаданные().Имя, ДокументОбъект.Организация);
	Если СтруктураНумератора.ЕстьНумератор Тогда 
		
		КадровыйНомер = СокрЛП(ДокументОбъект.НомерКадровогоПриказа);
		Если КадровыйНомер = "" Тогда 
			Возврат;
		КонецЕсли;
		
		ДатаДокумента = ДокументОбъект.Дата;
		Нумератор = СтруктураНумератора.Нумератор;
		Счетчик = СтруктураНумератора.Счетчик;
		
		Результат = ПроверкаУникальностиНомераПоДокументам(ДокументОбъект, КадровыйНомер, ДатаДокумента, Нумератор, Счетчик);
		Если Не Результат.Пустой() Тогда 
			
			МассивСообщений = Новый Массив;
			МассивДокументов = Новый Массив;
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивДокументов.Добавить(Новый Структура("Представление, Расшифровка", Выборка.Ссылка, Выборка.Ссылка));
			КонецЦикла;
			МассивСообщений.Добавить(РаботаСДиалогамиСвэй.СоздатьСообщениеСтруктуру("Введенный номер кадрового приказа уже присутствует в документах", Перечисления.ВидыСообщений.ВажнаяИнформация, МассивДокументов,Истина));
			РаботаСДиалогамиСвэй.ВывестиСообщенияОбОшибках(МассивСообщений, "Повторяющиеся номера");

		КонецЕсли;
		
		ТаблицаНастроек = Нумератор.РазрядыНомераКадровогоПриказа.Выгрузить();
		
		ПозицияНачалаСчетчика = 1;
		Для Каждого СтрокаТЗ Из ТаблицаНастроек Цикл 
			
			Если СтрокаТЗ.Источник <> Перечисления.ИсточникиЗначенийРазрядов.Счетчик Тогда 
				
				Если СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Дата Тогда 
					Если СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Год Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + 4;
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньГода Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(ДеньГода(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньМесяца Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(День(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньНедели Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(ДеньНедели(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Квартал Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(Окр(Месяц(КонецКвартала(ДатаДокумента)) / 3, 0, 0)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Месяц Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(Месяц(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Дата Тогда 
						ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + СтрокаТЗ.РазмерРазряда;
					КонецЕсли;
				ИначеЕсли СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Значение Тогда 
					ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + СтрокаТЗ.РазмерРазряда;
				ИначеЕсли СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Разделитель Тогда 
					ПозицияНачалаСчетчика = ПозицияНачалаСчетчика + 1;
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
		ТаблицаНастроек.Сортировать("НомерСтроки УБЫВ");
		
		ПозицияОкончанияСчетчика = СтрДлина(КадровыйНомер);
		Для Каждого СтрокаТЗ Из ТаблицаНастроек Цикл 
			
			Если СтрокаТЗ.Источник <> Перечисления.ИсточникиЗначенийРазрядов.Счетчик Тогда 
				
				Если СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Дата Тогда 
					Если СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Год Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - 4;
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньГода Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(ДеньГода(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньМесяца Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(День(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньНедели Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(ДеньНедели(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Квартал Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(Окр(Месяц(КонецКвартала(ДатаДокумента)) / 3, 0, 0)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Месяц Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - ?(СтрокаТЗ.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка,СтрокаТЗ.РазмерРазряда,СокрЛП(Месяц(ДатаДокумента)));
					ИначеЕсли СтрокаТЗ.Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Дата Тогда 
						ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - СтрокаТЗ.РазмерРазряда;
					КонецЕсли;
				ИначеЕсли СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Значение Тогда 
					ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - СтрокаТЗ.РазмерРазряда;
				ИначеЕсли СтрокаТЗ.Источник = Перечисления.ИсточникиЗначенийРазрядов.Разделитель Тогда 
					ПозицияОкончанияСчетчика = ПозицияОкончанияСчетчика - 1;
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
		НовоеЗначение = Число(Сред(КадровыйНомер,ПозицияНачалаСчетчика,ПозицияОкончанияСчетчика));
		
		ПоследнееЗначение = ПолучитьПоследнееЗначениеСчетчика(СтрокаТЗ.Значение, ДокументОбъект.Организация, ДатаДокумента);
		
		Если НовоеЗначение > ПоследнееЗначение Тогда 
			МенеджерЗаписи = РегистрыСведений.СчетчикиДляЗначенийРазрядов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ВидСчетчика = СтрокаТЗ.Значение;
			МенеджерЗаписи.Организация = ?(СтрокаТЗ.Значение.ВПределахОрганизации, ДокументОбъект.Организация, Справочники.Организации.ПустаяСсылка());
			МенеджерЗаписи.ДатаПериода = НачалоПериодаНумерации(?(ЗначениеЗаполнено(СтрокаТЗ.Значение.Периодичность),СтрокаТЗ.Значение.Периодичность,Перечисления.Периодичность.Год),ДатаДокумента);
			
			МенеджерЗаписи.Значение = НовоеЗначение;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//+ СВЭЙ КДЯ 04.09.19 СВФР-004448
Функция ПолучитьДлительностьВМесяцах( ДатаНачала, ДатаОкончания ) Экспорт
	
	Перем ДлительностьВМесяцах;	
	
	Если ДатаНачала >= ДатаОкончания Тогда
	
		ДлительностьВМесяцах = 1;
		
	Иначе
	
		ДлительностьВМесяцах = 
			Год( ДатаОкончания ) * 12 + Месяц( ДатаОкончания )
			-
			Год( ДатаНачала ) * 12 - Месяц( ДатаНачала )
		
		;
		
	КонецЕсли;
	
	Возврат ДлительностьВМесяцах;	

КонецФункции // ПолучитьДлительностьВМесяцах()
//- СВЭЙ КДЯ 04.09.19 СВФР-004448 

//+ СВЭЙ КДЯ 05.09.19 СВФР-004448

//Получает объем выборки ( данных - для расчета среднего заработка ), выраженный в кол-ве месяцев
//Параметры:
//   ДатаПриемаСотрудника - дата приема сотрудника на работу
//   ДатаНачалаВыборки - дата самого раннего данного выборки
//   ДатаСобытия - период расчета отпуска, больничного и т.п. 
//   МаксимальныйОбъемВыборки - максимально возможный объем выборки, выраженный в количестве месяцев
//Значение функции:
//   ОбъемВыборкиВМесяцах - количество месяцев в периоде выборке ( учитываются также пропущенные месяцы в наборе выборки )
Функция ПолучитьОбъемВыборкиВМесяцах( Знач ДатаПриемаСотрудника, Знач ДатаНачалаВыборки, Знач ДатаСобытия, Знач МаксимальныйОбъемВыборки  ) Экспорт
	Перем ОбъемВыборкиВМесяцах, ВерхняяГраницаВыборки, НижняяГраницаВыборки;
	
	    //+ СВЭЙ КДЯ 26.09.19 СВФР-004448
		//ВерхняяГраницаВыборки = НачалоМесяца( ДатаСобытия );
		//Если НЕ ЗначениеЗаполнено( ВерхняяГраницаВыборки ) Тогда
		//	ОбъемВыборкиВМесяцах = МаксимальныйОбъемВыборки;
		//Иначе	
		//	НижняяГраницаВыборки = Макс( НачалоМесяца( ДобавитьМесяц( ДатаПриемаСотрудника, 1 ) ), 
		//							     НачалоМесяца( ДатаНачалаВыборки ),
		//							     НачалоМесяца( ДобавитьМесяц( ВерхняяГраницаВыборки, - МаксимальныйОбъемВыборки ) )
		//							   );
		//	НижняяГраницаВыборки = Мин( НижняяГраницаВыборки, НачалоМесяца( ДобавитьМесяц( ВерхняяГраницаВыборки, -1 ) ) );
		//	ОбъемВыборкиВМесяцах = ПолучитьДлительностьВМесяцах( НижняяГраницаВыборки, ВерхняяГраницаВыборки );
		//КонецЕсли; 
	    //- СВЭЙ КДЯ 26.09.19 СВФР-004448
		
	    //+ СВЭЙ КДЯ 26.09.19 СВФР-004448
		Если ЗначениеЗаполнено( ДатаСобытия ) Тогда
			
			Если НЕ ЗначениеЗаполнено( ДатаПриемаСотрудника ) Тогда
				ДатаПриемаСотрудника = НачалоМесяца( ДобавитьМесяц( ДатаСобытия, - МаксимальныйОбъемВыборки ) );	
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено( ДатаНачалаВыборки ) Тогда
				ДатаНачалаВыборки = НачалоМесяца( ДобавитьМесяц( ДатаСобытия, - МаксимальныйОбъемВыборки ) );	
			КонецЕсли;
		
			ВерхняяГраницаВыборки = НачалоМесяца( ДатаСобытия );
			НижняяГраницаВыборки = Макс( НачалоМесяца( ДатаПриемаСотрудника ), 
									     НачалоМесяца( ДатаНачалаВыборки ),
									     НачалоМесяца( ДобавитьМесяц( ВерхняяГраницаВыборки, - МаксимальныйОбъемВыборки ) )
									   );
			НижняяГраницаВыборки = Мин( НижняяГраницаВыборки, НачалоМесяца( ДобавитьМесяц( ВерхняяГраницаВыборки, -1 ) ) );
			ОбъемВыборкиВМесяцах = ПолучитьДлительностьВМесяцах( НижняяГраницаВыборки, ВерхняяГраницаВыборки );
		Иначе	
			ОбъемВыборкиВМесяцах = МаксимальныйОбъемВыборки;
		КонецЕсли; 
	    //- СВЭЙ КДЯ 26.09.19 СВФР-004448 
		
	Возврат ОбъемВыборкиВМесяцах;
КонецФункции // ПолучитьОбъемВыборкиВМесяцах()

Функция ПолучитьДатуПриемаСотрудника( Сотрудник ) Экспорт
	Перем ДатаПриемаСотрудника, Запрос, Выборка, ВидДоговора;
	
	ДатаПриемаСотрудника = Дата( 1, 1, 1 );
	ВидДоговора = Сотрудник.ВидДоговора;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "Сотрудник", Сотрудник );
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.Подряда Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РаботникиОрганизаций.Период КАК ДатаПриемаСотрудника
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник = &Сотрудник
		|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию		
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаПриемаСотрудника = Выборка.ДатаПриемаСотрудника;	
		КонецЕсли;
	
	КонецЕсли; // ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.Подряда
	
	Если НЕ ЗначениеЗаполнено( ДатаПриемаСотрудника ) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК ДатаПриемаСотрудника
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|ГДЕ
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник = &Сотрудник
		|   И ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка.Проведен
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПриема УБЫВ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаПриемаСотрудника = Выборка.ДатаПриемаСотрудника;	
		КонецЕсли;
	
	КонецЕсли; // НЕ ЗначениеЗаполнено( ДатаПриемаСотрудника )	
	
	
	Возврат ДатаПриемаСотрудника;
КонецФункции // ПолучитьДатуПриемаСотрудника()
//- СВЭЙ КДЯ 05.09.19 СВФР-004448 


//+ СВЭЙ КДЯ 03.01.20 СВФР-005236
Функция ПолучитьПересечениеДиапазонов( Знач Начало1, Знач Окончание1 = Неопределено, 
									   Знач Начало2, Знач Окончание2 = Неопределено,
									   ТочноеПересечение = Ложь
									 ) Экспорт
	Перем Диапазон;
	
	Если НЕ ТочноеПересечение Тогда
		
		Начало1 = НачалоМесяца( Начало1 );
		Если Окончание1 = Неопределено Тогда
			Окончание1 = Начало1;	
		КонецЕсли; 
		Окончание1 = КонецМесяца( Окончание1 );
		
		Начало2 = НачалоМесяца( Начало2 ); 
		Если Окончание2 = Неопределено Тогда
			Окончание2 = Начало2;	
		КонецЕсли; 
		Окончание2 = КонецМесяца( Окончание2 ); 
		
	КонецЕсли;  
	
	Если Начало1 <= Окончание1 И Начало2 <= Окончание2 Тогда
	
		Если Начало1 <= Начало2 И Начало2 <= Окончание1
			 ИЛИ
			 Начало1 <= Окончание2 И Окончание2 <= Окончание1	
			 ИЛИ
			 Начало1 <= Начало2 И Окончание2 <= Окончание1	
			 ИЛИ
			 Начало2 <= Начало1 И Окончание1 <= Окончание2 Тогда	
			
			Диапазон = Новый Структура( "Начало, Окончание" );
			Диапазон.Начало = НачалоМесяца( Макс( Начало1, Начало2 ) );	
			Диапазон.Окончание = НачалоМесяца( Мин( Окончание1, Окончание2 ) );	
		
		КонецЕсли; 	
	
	КонецЕсли;
	
	Возврат Диапазон;
КонецФункции
//- СВЭЙ КДЯ 03.01.20 СВФР-005236



// Вычисляет начало периода нумерации
Функция НачалоПериодаНумерации(Периодичность, Дата) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		ПериодНумерации = НачалоДня(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		ПериодНумерации = НачалоМесяца(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		ПериодНумерации = НачалоКвартала(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		ПериодНумерации = НачалоГода(Дата);
		
	КонецЕсли;
	
	Возврат ПериодНумерации;
	
КонецФункции	


// Вычисляет начало периода нумерации
Функция КонецПериодаНумерации(Периодичность, Дата) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		ПериодНумерации = КонецДня(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		ПериодНумерации = КонецМесяца(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		ПериодНумерации = КонецКвартала(Дата);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		ПериодНумерации = КонецГода(Дата);
		
	КонецЕсли;
	
	Возврат ПериодНумерации;
	
КонецФункции	


Функция ПроверитьПодключениеНумератора(ТипДокумента, Организация) Экспорт 
	
	СтруктураВозврата = Новый Структура;
	
	// Если нет реквизита "НомерКадровогоПриказа" то не используем нумерацию
	МетаданныеДокумента = Метаданные.Документы[ТипДокумента];
	
	Если МетаданныеДокумента.Реквизиты.Найти("НомерКадровогоПриказа") <> Неопределено Тогда 
		
		// Получение учетной политики по персоналу организации
		УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
		//ИспользоватьНомераКадровыхПриказов		= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ИспользоватьНомераКадровыхПриказов");
		ИспользоватьНомераКадровыхПриказов		= Ложь;
		
		Если ИспользоватьНомераКадровыхПриказов Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкаНомеровКадровыхПриказов.ВидНумератора,
			|	ПорядокПрисвоенияНомераКадровыхПриказовРазрядыНомераКадровогоПриказа.Значение КАК Счетчик
			|ИЗ
			|	РегистрСведений.НастройкаНомеровКадровыхПриказов КАК НастройкаНомеровКадровыхПриказов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПорядокПрисвоенияНомераКадровыхПриказов.РазрядыНомераКадровогоПриказа КАК ПорядокПрисвоенияНомераКадровыхПриказовРазрядыНомераКадровогоПриказа
			|		ПО НастройкаНомеровКадровыхПриказов.ВидНумератора = ПорядокПрисвоенияНомераКадровыхПриказовРазрядыНомераКадровогоПриказа.Ссылка
			|ГДЕ
			|	НастройкаНомеровКадровыхПриказов.Организация = &Организация
			|	И НастройкаНомеровКадровыхПриказов.ТипОбъекта = &ТипОбъекта
			|	И ПорядокПрисвоенияНомераКадровыхПриказовРазрядыНомераКадровогоПриказа.Источник = ЗНАЧЕНИЕ(Перечисление.ИсточникиЗначенийРазрядов.Счетчик)";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ТипОбъекта", ТипДокумента);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда 
				СтруктураВозврата.Вставить("ЕстьНумератор", Истина);
				СтруктураВозврата.Вставить("Нумератор", Выборка.ВидНумератора);
				СтруктураВозврата.Вставить("Счетчик", Выборка.Счетчик);
			Иначе 
				СтруктураВозврата.Вставить("ЕстьНумератор", Ложь);
			КонецЕсли;
			
		Иначе 
			СтруктураВозврата.Вставить("ЕстьНумератор", Ложь);
		КонецЕсли;
		
	Иначе 
		СтруктураВозврата.Вставить("ЕстьНумератор", Ложь);
	КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьТипыДокументовПоНумератору(Организация, Нумератор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаНомеровКадровыхПриказов.ТипОбъекта
	|ИЗ
	|	РегистрСведений.НастройкаНомеровКадровыхПриказов КАК НастройкаНомеровКадровыхПриказов
	|ГДЕ
	|	НастройкаНомеровКадровыхПриказов.Организация = &Организация
	|	И НастройкаНомеровКадровыхПриказов.ВидНумератора = &Нумератор
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкаНомеровКадровыхПриказов.ТипОбъекта";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Нумератор", Нумератор);
	
	Возврат Запрос.Выполнить();
	
КонецФункции


// Функция определяет последнее значение для вида счетчика.
//
Функция ПолучитьПоследнееЗначениеСчетчика(ВидСчетчика, Организация, ДатаПериода)
	
	Если НЕ ЗначениеЗаполнено(ВидСчетчика) Тогда
		Возврат 0;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СчетчикиДляЗначенийРазрядов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидСчетчика = ВидСчетчика;
	МенеджерЗаписи.Организация = ?(ВидСчетчика.ВПределахОрганизации, Организация, Справочники.Организации.ПустаяСсылка());
	МенеджерЗаписи.ДатаПериода = НачалоПериодаНумерации(?(ЗначениеЗаполнено(ВидСчетчика.Периодичность),ВидСчетчика.Периодичность,Перечисления.Периодичность.Год), ДатаПериода);
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		ПоследнееЗначение = МенеджерЗаписи.Значение;
	Иначе
		ПоследнееЗначение = ВидСчетчика.НачальноеЗначение - 1;
	КонецЕсли;
	
	Возврат ПоследнееЗначение;
	
КонецФункции // ПолучитьПоследнееЗначениеСчетчика()


Функция ПроверкаУникальностиНомераПоДокументам(ДокументОбъект, КадровыйНомер, ДатаДокумента, Нумератор, Счетчик)
	
	РезультатЗапроса = ПолучитьТипыДокументовПоНумератору(ДокументОбъект.Организация, Нумератор);
	
	ТекстЗапроса = "";
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ТекстЗапроса = ?(ТекстЗапроса = "","ВЫБРАТЬ",ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + "ВЫБРАТЬ");
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Ссылка,";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Номер,";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Дата,";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.НомерКадровогоПриказа";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "ИЗ" + Символы.ПС + "	Документ." + Выборка.ТипОбъекта + " КАК Документы";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "ГДЕ" + Символы.ПС + "	Документы.НомерКадровогоПриказа = &НомерКадровогоПриказа";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	И Документы.Ссылка <> &Ссылка";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	И Документы.Организация = &Организация";
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	И Документы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "УПОРЯДОЧИТЬ ПО" + Символы.ПС + "	Дата УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаНумерации(?(ЗначениеЗаполнено(Счетчик.Периодичность),Счетчик.Периодичность,Перечисления.Периодичность.Год),ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериодаНумерации(?(ЗначениеЗаполнено(Счетчик.Периодичность),Счетчик.Периодичность,Перечисления.Периодичность.Год),ДатаДокумента));
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("Нумератор", Нумератор);
	Запрос.УстановитьПараметр("НомерКадровогоПриказа", КадровыйНомер);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции


Процедура УстановитьПоследнегоОтветственногоПоОбъекту(ДокументОбъект) Экспорт 
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ЕстьРеквизитАвтор = ОбщегоНазначения.ЕстьРеквизитДокумента("Автор", МетаданныеДокумента);
	ЕстьРеквизитОтветственный = ОбщегоНазначения.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента);
	
	Если ДокументОбъект.ЭтоНовый() И ЕстьРеквизитАвтор
		И Не ЗначениеЗаполнено(ДокументОбъект.Автор) Тогда
		ДокументОбъект.Автор = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	// Ответственного будем менять, если есть автор
	Если ЕстьРеквизитОтветственный И ЕстьРеквизитАвтор Тогда 
		ДокументОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
КонецПроцедуры


// Определяет заполнено ли переданное значение
//
// ПАРАМЕТРЫ:
//  <Значение> (Обязательный)
//	Тип: Произвольный, значение, заполенение которого надо проверить
//
// ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ:
//  Истина - значение не заполнено,
//	ложь - иначе.
//
Функция обПустоеЗначение(Значение) Экспорт

	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Значение = NULL Тогда
		Возврат Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат ПустаяСтрока(Значение);
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат ?(Значение = 0,Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат ?(Значение = Дата('00010101'),Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Ложь; // Булево будем считать не пустым всегда
	ИначеЕсли ТипЗначения = Тип("Граница") Тогда
		Возврат обПустоеЗначение(Значение.Значение);
	ИначеЕсли ТипЗначения = Тип("Массив")
				ИЛИ ТипЗначения = Тип("СписокЗначений")
				ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
				ИЛИ ТипЗначения = Тип("Структура") Тогда
		Возврат ?(Значение.Количество() = 0,Истина, Ложь);
	ИначеЕсли ТипЗначения = Тип("ЭлементСпискаЗначений") Тогда
		Возврат Ложь;
	Иначе
		Возврат ?(Значение = Новый(ТипЗначения),Истина,Ложь);
	КонецЕсли; 

	Возврат Ложь;
	
КонецФункции // обПустоеЗначение()


//Устанавливает режим формы "ТолькоПросмотр" = Истина для проведенных документ
//
// ПАРАМЕТРЫ: 
//
//	<Документ> (Обязательный)
//	Тип: Документ, ссылка либо объект, которому принадлежит форма
//
//	<Форма> (Обязательный)
//	Тип: Форма - форма документа, для которого осуществляется проверка
//
Процедура обПросмотрПроведеного(Документ,Форма,ВыводитьПредупреждение = Истина) Экспорт
	Если Документ.Проведен Тогда
		#Если Клиент Тогда
		Если ВыводитьПредупреждение Тогда
			Предупреждение("Данный документ проведен, поэтому возможен только просмотр документа!"+Символы.ПС+
			"Для того, чтобы изменить документ, сделайте документ не проведенным.");
		КонецЕсли;
		#КонецЕсли 		 
		Форма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
КонецПроцедуры


Процедура ПолучитьСписокДокументовПоНумератору(ДокументОбъект, ПроверкаНаУникальность = Ложь, НомерКадровый = "") Экспорт 
	
	Если Не ПроверкаНаУникальность Тогда 
		ФормаПросмотра = ПолучитьОбщуюФорму("ФормаПросмотраЗарегистрированныхОбъектов");
	КонецЕсли;
	
	СтруктураНумератора = ПроверитьПодключениеНумератора(ДокументОбъект.Метаданные().Имя, ДокументОбъект.Организация);
	Если СтруктураНумератора.ЕстьНумератор Тогда // автонумерация
		
		Нумератор = СтруктураНумератора.Нумератор;
		Счетчик = СтруктураНумератора.Счетчик;
		
		РезультатЗапроса = ПолучитьТипыДокументовПоНумератору(ДокументОбъект.Организация, Нумератор);
		
		ТекстЗапроса = "";
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ТекстЗапроса = ?(ТекстЗапроса = "","ВЫБРАТЬ",ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + "ВЫБРАТЬ");
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Ссылка,";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Номер,";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.Дата,";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	Документы.НомерКадровогоПриказа";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "ИЗ" + Символы.ПС + "	Документ." + Выборка.ТипОбъекта + " КАК Документы";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "ГДЕ" + Символы.ПС + "	Документы.НомерКадровогоПриказа <> """"";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	И Документы.Организация = &Организация";
			ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "	И Документы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
			
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "" + Символы.ПС + "УПОРЯДОЧИТЬ ПО" + Символы.ПС + "	Дата УБЫВ," + Символы.ПС + "	НомерКадровогоПриказа УБЫВ";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаНачала", НачалоПериодаНумерации(?(ЗначениеЗаполнено(Счетчик.Периодичность),Счетчик.Периодичность,Перечисления.Периодичность.Год),ДокументОбъект.Дата));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецПериодаНумерации(?(ЗначениеЗаполнено(Счетчик.Периодичность),Счетчик.Периодичность,Перечисления.Периодичность.Год),ДокументОбъект.Дата));
		Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
		Запрос.УстановитьПараметр("Нумератор", Нумератор);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Если Не ПроверкаНаУникальность Тогда 
			Пока Выборка.Следующий() Цикл 
				НоваяСтрокаСписка = ФормаПросмотра.СписокДокументов.Добавить();
				НоваяСтрокаСписка.Документ = Выборка.Ссылка;
				НоваяСтрокаСписка.Номер = Выборка.Номер;
				НоваяСтрокаСписка.Дата = Выборка.Дата;
				НоваяСтрокаСписка.КадровыйНомер = Выборка.НомерКадровогоПриказа;
			КонецЦикла;
		Иначе 
			Выборка.Следующий();
			НомерКадровый = Выборка.НомерКадровогоПриказа;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПроверкаНаУникальность Тогда 
		Если Не ФормаПросмотра.Открыта() Тогда 
			ФормаПросмотра.Открыть();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


Процедура УстановитьНомерКадровогоПриказа(ДокументОбъект) Экспорт
	
	НомерКадровогоПриказа = "";
	
	// Если нет реквизита "НомерКадровогоПриказа" то не используем нумерацию
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если МетаданныеДокумента.Реквизиты.Найти("НомерКадровогоПриказа") <> Неопределено Тогда 
		
		// Получение учетной политики по персоналу организации
		УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
		//ИспользоватьНомераКадровыхПриказов		= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, ДокументОбъект.Организация, "ИспользоватьНомераКадровыхПриказов");
		ИспользоватьНомераКадровыхПриказов		= Ложь;
		
		Если ИспользоватьНомераКадровыхПриказов Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НастройкаНомеровКадровыхПриказов.ВидНумератора
			|ИЗ
			|	РегистрСведений.НастройкаНомеровКадровыхПриказов КАК НастройкаНомеровКадровыхПриказов
			|ГДЕ
			|	НастройкаНомеровКадровыхПриказов.Организация = &Организация
			|	И НастройкаНомеровКадровыхПриказов.ТипОбъекта = &ВидДокумента";
			Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
			Запрос.УстановитьПараметр("ВидДокумента", МетаданныеДокумента.Имя);
			
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ДатаВремя", ДокументОбъект.Дата);
				СтруктураПараметров.Вставить("Организация", ДокументОбъект.Организация);
				
				ПорядокПрисвоения = Выборка.ВидНумератора;
				
				НачальныеЗначенияПрисвоения = ПорядокПрисвоения.РазрядыНомераКадровогоПриказа.Выгрузить();
				НачальныеЗначенияПрисвоения.Колонки.Добавить("НачальноеЗначениеРазряда");
				НачальныеЗначенияПрисвоения.Очистить();
				
				Для Каждого Строка Из ПорядокПрисвоения.РазрядыНомераКадровогоПриказа Цикл
					
					Если Строка.РазмерРазряда = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = НачальныеЗначенияПрисвоения.Добавить();
					НоваяСтрока.РазмерРазряда 	= Строка.РазмерРазряда;
					НоваяСтрока.ТипРазряда 		= Строка.ТипРазряда;
					НоваяСтрока.Источник 		= Строка.Источник;
					НоваяСтрока.Значение 		= Строка.Значение;
					
					НовоеЗначение = ПолучитьЗначениеРазрядаКадровогоПриказа(Строка.Источник, Строка.Значение, Строка.РазмерРазряда, Строка.ТипРазряда, СтруктураПараметров);
					
					НоваяСтрока.НачальноеЗначениеРазряда = НовоеЗначение;
					
				КонецЦикла;
				
				Для Каждого Строка Из НачальныеЗначенияПрисвоения Цикл
					
					Если Строка.Источник = Перечисления.ИсточникиЗначенийРазрядов.Счетчик Тогда
						ЗначениеСчетчика = ПолучитьПоследнееЗначениеСчетчика(Строка.Значение, ДокументОбъект.Организация, ДокументОбъект.Дата) + 1;
						Если Строка.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка Тогда
							ЗначениеРазряда = Формат(ЗначениеСчетчика, "ЧГ=0; ЧЦ="+Строка.РазмерРазряда+"; ЧВН=");
						Иначе
							ЗначениеРазряда = ЗначениеСчетчика;
						КонецЕсли;
						ЗначениеСчетчика = ЗначениеСчетчика + 1;
					Иначе
						ЗначениеРазряда = Строка.НачальноеЗначениеРазряда;
						Если Строка.ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка Тогда
							ЗначениеРазряда = Формат(ЗначениеРазряда, "ЧГ=0; ЧЦ="+Строка.РазмерРазряда+"; ЧВН=");
							ЗначениеРазряда = Строка(ЗначениеРазряда);
						КонецЕсли;
					КонецЕсли;
					
					ЗначениеРазряда = Лев(Строка(ЗначениеРазряда), Строка.РазмерРазряда);
					НомерКадровогоПриказа = НомерКадровогоПриказа + ЗначениеРазряда;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументОбъект.НомерКадровогоПриказа = НомерКадровогоПриказа;
	
КонецПроцедуры


// Функция возвращает значение для разряда номера Кадрового Приказа по указанному источнику.
//
Функция ПолучитьЗначениеРазрядаКадровогоПриказа(Источник, Значение, РазмерРазряда, ТипРазряда, СтруктураПараметров) Экспорт
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ДатаВремя = СтруктураПараметров.ДатаВремя;
	
	Если Источник = Перечисления.ИсточникиЗначенийРазрядов.Значение Тогда
		НовоеЗначение = Значение;
			
	ИначеЕсли Источник = Перечисления.ИсточникиЗначенийРазрядов.Дата Тогда
		Если Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Год Тогда
			НовоеЗначение = Год(ДатаВремя);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Дата Тогда
			НовоеЗначение = "" + День(ДатаВремя) + Месяц(ДатаВремя) + Год(ДатаВремя);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньГода Тогда
			НовоеЗначение = ДеньГода(ДатаВремя);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньМесяца Тогда
			НовоеЗначение = День(ДатаВремя);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.ДеньНедели Тогда
			НовоеЗначение = ДеньНедели(ДатаВремя);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Квартал Тогда
			НовоеЗначение = Окр(Месяц(КонецКвартала(ДатаВремя)) / 3, 0, 0);
		ИначеЕсли Значение = Перечисления.ФорматыДатаВремениЗначенияРазряда.Месяц Тогда
			НовоеЗначение = Месяц(ДатаВремя);
		КонецЕсли;
			
	ИначеЕсли Источник = Перечисления.ИсточникиЗначенийРазрядов.Разделитель Тогда
		НовоеЗначение = Сред(Строка(Значение), 2, 1);
			
	ИначеЕсли Источник = Перечисления.ИсточникиЗначенийРазрядов.Счетчик Тогда
 		НовоеЗначение = ПолучитьПоследнееЗначениеСчетчика(Значение, СтруктураПараметров.Организация, ДатаВремя);
			
	Иначе
		НовоеЗначение = "";
					
	КонецЕсли;
		
	НовоеЗначение = ПолучитьФорматированноеЗначениеРазряда(НовоеЗначение, РазмерРазряда, ТипРазряда);
	
	Возврат НовоеЗначение;
	
КонецФункции // ПолучитьЗначениеРазрядаСерийногоНомера()


// Функция возвращает форматированное значение разряда серийного номера.
//
// Параметры:
//	ИсходноеЗначение - Строка, Число - Исходное значение разряда
//	РазмерРазряда - Число - Количество знаков разряда серийного номера
//
// Возвращаемое значение:
//	Строка - Форматированное значение разряда
//	
Функция ПолучитьФорматированноеЗначениеРазряда(ИсходноеЗначение, РазмерРазряда, ТипРазряда)
	
	// Уберем разделители.
	Если ТипЗнч(ИсходноеЗначение) = Тип("Число") Тогда
		НовоеЗначение = Формат(ИсходноеЗначение, "ЧГ=0");
	Иначе
		НовоеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	
	// Выберем количество символов, соответствующее размеру разряда серийного номера.
	НовоеЗначение = Прав(НовоеЗначение, РазмерРазряда);
	
	КолвоСимволов = СтрДлина(НовоеЗначение);
	
	// Добавим лидирующие нули перед значением разряда.
	Если КолвоСимволов < РазмерРазряда И ТипРазряда = Перечисления.ТипыЗначенийРазрядов.Строка Тогда
		НовоеЗначение = "" + Формат(0, "ЧН=; ЧГ=0; ЧЦ="+(РазмерРазряда - КолвоСимволов)+"; ЧВН=") + НовоеЗначение;
	КонецЕсли;
	
	// Проведем окончательное форматирование значения.
	НовоеЗначение = Формат(НовоеЗначение, "ЧГ=0; ЧЦ="+РазмерРазряда+"; ЧВН=");
	
	Возврат НовоеЗначение;
	
КонецФункции // СформатироватьЗначениеРазряда()


// Функция возвращает значени периодической константы на дату
//
// Параметры:
//	Дата - дата, на которую получается значение константы (тип "Дата");
//	
//	ИмяКонстанты - имя константы, значение которой получается (тип "Перечиления.Константы");
//
// Возвращает:
//	Значение константы (тип значения может быть любой);
//
//Функция обПолучитьЗначениеКонстантыОбщие(ИмяКонстанты, Дата = Неопределено) Экспорт
//	ОтборЗначения = Новый Структура;
//	ОтборЗначения.Вставить("ИмяКонстанты", ИмяКонстанты);
//	СтруктураЗначениеКонстанты = 
//						РегистрыСведений.ПРОФИТ_Константы.ПолучитьПоследнее(Дата, ОтборЗначения);
//	Возврат СтруктураЗначениеКонстанты.Значение;
//КонецФункции


// функция выполняет печать из внешней обработке
// Параметры: 
// - лкОбъект - объект из которого беруться значения реквизитов
// - ВыводимыйМакет  - передается "по ссылке" строка (имя макета в обработке), тип либо Макет, либо Неопределенно
// - возвращаемое значение Булево, Истина если печать выполнена, Ложь - возвращаем макет и печатаем на нем
//Функция обВнешняяПечатьДокумента(знач лкОбъект, лкВыводимыйМакет) Экспорт
//	
//	лкФлагУспешногоВыполнения = Ложь;
//	
//	Если обПустоеЗначение(лкОбъект) Тогда 
//		лкВыводимыйМакет = Неопределено;
//		Возврат лкФлагУспешногоВыполнения;
//	КонецЕсли;
//	
//	лкПутьКПапкеВнешнихДанныхБД = СокрЛП(Константы.ПутьКПапкеВнешнихДанныхБД.Получить());
//	лкПапкаВнешних = "Docprn";
//	
//	Если НЕ обПустоеЗначение(лкПутьКПапкеВнешнихДанныхБД) Тогда
//		
//		// Сперва ищем обработку, там можно сделать много макетов и по-другому описать заполнение
//		
//		лкФайлОбработки = Новый Файл(лкПутьКПапкеВнешнихДанныхБД + "\"+лкПапкаВнешних+"\ПечатнаяФорма"+лкОбъект.Метаданные().Имя+".epf");
//		Если лкФайлОбработки.Существует() Тогда
//			лкВнешняяОбработка = ВнешниеОбработки.Создать(лкФайлОбработки.ПолноеИмя);
//			Попытка    
//				лкВнешняяОбработка.ЗаполнитьПараметры(лкОбъект);
//				лкВнешняяОбработка.Печать(лкВыводимыйМакет);
//				лкФлагУспешногоВыполнения = Истина;
//			Исключение 
//				Попытка
//					
//					// потом ищем макет в этой обработке
//					
//					лкВыводимыйМакет = лкВнешняяОбработка.ПолучитьМакет(лкВыводимыйМакет);
//				Исключение
//					
//					// и последнеее - ищем там же просто макет
//					
//					лкПутьКВнешнемуМакету = лкПутьКПапкеВнешнихДанныхБД + "\"+лкПапкаВнешних+"\"+лкВыводимыйМакет+".mxl";
//					
//					лкФайлОбработки = Новый Файл(лкПутьКВнешнемуМакету);
//					Если лкФайлОбработки.Существует() Тогда
//						лкВыводимыйМакет = Новый ТабличныйДокумент;
//						лкВыводимыйМакет.Прочитать(лкПутьКВнешнемуМакету);
//					КонецЕсли;
//					
//				КонецПопытки;
//			КонецПопытки;
//		Иначе
//			
//			// ищем там же макет
//			
//			лкПутьКВнешнемуМакету = лкПутьКПапкеВнешнихДанныхБД + "\"+лкПапкаВнешних+"\"+лкВыводимыйМакет+".mxl";
//			
//			лкФайлОбработки = Новый Файл(лкПутьКВнешнемуМакету);
//			Если лкФайлОбработки.Существует() Тогда
//				лкВыводимыйМакет = Новый ТабличныйДокумент;
//				лкВыводимыйМакет.Прочитать(лкПутьКВнешнемуМакету);
//			КонецЕсли;
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//	Если (НЕ лкФлагУспешногоВыполнения) И ТипЗнч(лкВыводимыйМакет)<>Тип("ТабличныйДокумент") Тогда
//		Если лкОбъект.Метаданные().Макеты.Найти(лкВыводимыйМакет) <> Неопределено Тогда
//			лкВыводимыйМакет = лкОбъект.ПолучитьМакет(лкВыводимыйМакет);
//		Иначе     
//			лкВыводимыйМакет = Неопределено;
//		КонецЕсли;
//	КонецЕсли;     
//	
//	Возврат лкФлагУспешногоВыполнения;     
//	
//КонецФункции	 

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЗАПОЛНЕНИЯ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ

// Функция инициализирует глобальную переменную глКоллекцияЗначенийЗаголовков
//
Функция ЗаполнитьКоллекциюЗначенийЗаголовков() Экспорт
	
	КоллекцияЗначенийЗаголовков = Новый Соответствие;
	//КоллекцияЗначенийЗаголовков.Вставить("", "");
	
	// в каждой конфигурации свой список переводимых названий
	
	Возврат КоллекцияЗначенийЗаголовков;
	
КонецФункции // ЗаполнитьКоллекциюЗначенийЗаголовков()


// Заменяет одни термины, которые используются в коде, другими - уместными в интерфейсе.
// Позволяет иметь один тот же код при разных названиях объектов.
//
// Параметры
//  СтрокаИзИнтерфейса - строка - заголовок колонки, надпись и т.п.
//
// Возвращаемое значение:
//  Строка - новый заголовок колонки, надпись и т.п. 
//
Функция ПреобразоватьСтрокуИнтерфейса(СтрокаИзИнтерфейса) Экспорт 

	КоллекцияЗначенийЗаголовков = глЗначениеПеременной("глКоллекцияЗначенийЗаголовков");
	
	НоваяСтрока = КоллекцияЗначенийЗаголовков[СтрокаИзИнтерфейса];
	
	Возврат ?(НоваяСтрока = Неопределено, СтрокаИзИнтерфейса, НоваяСтрока)

КонецФункции // ПреобразоватьСтрокуИнтерфейса()


// Функция формирует фамилию и инициалы работника в заданном падеже 
// по переданным данным о работнике.
//  либо по переданным строкам.
//
// Параметры
//  Работник	- строка (Фамилия + Имя + Отчество, разделенными пробелами) 
//                или ссылка на элемент справочника ФизическиеЛица или Сотрудники.
//  Падеж (необязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей
//   В остальных случаях рекомендуется опускать этот параметр.
// Возвращаемое значение 
//  Фамилия и Инициалы одной строкой.
//
Функция ПредставлениеРаботника(Работник, Знач Падеж = 1, Знач Пол = Неопределено) Экспорт

	ТипДанных = ТипЗнч(Работник);
	Если ТипДанных = Тип("Строка") Тогда
		РаботникФИО = Работник;
		РаботникПол = Пол;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Работник", Работник);
		Если ТипДанных = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Наименование,
			|	СотрудникиОрганизаций.Физлицо.Пол КАК Пол
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Работник";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФизическиеЛица.Наименование,
			|	ФизическиеЛица.Пол
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Работник";
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РаботникФИО = Выборка.Наименование;
			РаботникПол = Выборка.Пол;
		Иначе
			Возврат ""
		КонецЕсли;
	КонецЕсли;
	
	ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(РаботникФИО);
	
	ПозицияПервогоПробела = Найти(ФИО + " "," ");
	Фамилия  = Лев(ФИО,ПозицияПервогоПробела-1);
	Инициалы = Сред(ФИО,ПозицияПервогоПробела+1);
	
	РезультатСклонения = "";
	Если УниверсальныеМеханизмы.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Фамилия, Падеж, РаботникПол, РезультатСклонения) Тогда
		ФИО = РезультатСклонения + " " + Инициалы;	
	КонецЕсли;
	
	Возврат ФИО
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫБОРКИ РАБОТНИКОВ ОРГАНИЗАЦИЙ

Функция ПолучитьСостояниеСотрудникаНаДату(Организация,Сотрудник,ДатаСостояния)  Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.УстановитьПараметр("Организация",Организация);
	 Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	 Запрос.УстановитьПараметр("ДатаСостояния", ДатаСостояния);
	 Запрос.УстановитьПараметр("ДатаСостоянияПред", ДатаСостояния-86400*10);
	 
	 Запрос.Текст =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	СостояниеРаботниковОрганизаций.Сотрудник,
	                  |	ВЫБОР
	                  |		КОГДА СостояниеРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	                  |				И СостояниеРаботниковОрганизаций.ПериодЗавершения <= &ДатаСостояния
	                  |			ТОГДА СостояниеРаботниковОрганизаций.СостояниеЗавершения
	                  |		ИНАЧЕ СостояниеРаботниковОрганизаций.Состояние
	                  |	КОНЕЦ КАК Состояние,
	                  |	СостояниеРаботниковОрганизаций.Период,
	                  |	СостояниеРаботниковОрганизаций.ПериодЗавершения КАК ПериодЗавершения,
	                  |	СостояниеРаботниковОрганизаций.СостояниеЗавершения
	                  |ИЗ
	                  |	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	                  |ГДЕ
	                  |	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
	                  |	И СостояниеРаботниковОрганизаций.Период МЕЖДУ &ДатаСостоянияПред И &ДатаСостояния
	                  |	И СостояниеРаботниковОрганизаций.ПериодЗавершения МЕЖДУ &ДатаСостоянияПред И &ДатаСостояния
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	ПериодЗавершения УБЫВ";
					  
	 ВыборкаПоПериодуЗавершения = Запрос.Выполнить().Выбрать(); 					  
	 
	 
	 Запрос.Текст =   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                  |	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
	                  |	ВЫБОР
	                  |		КОГДА СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	                  |				И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаСостояния
	                  |			ТОГДА СостояниеРаботниковОрганизацийСрезПоследних.СостояниеЗавершения
	                  |		ИНАЧЕ СостояниеРаботниковОрганизацийСрезПоследних.Состояние
	                  |	КОНЕЦ КАК Состояние,
	                  |	СостояниеРаботниковОрганизацийСрезПоследних.Период,
	                  |	СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения
	                  |ИЗ
	                  |	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаСостояния, Организация = &Организация) КАК СостояниеРаботниковОрганизацийСрезПоследних
	                  |ГДЕ
	                  |	СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Если Выборка.Следующий() Тогда
		 Если ВыборкаПоПериодуЗавершения.Следующий() Тогда
			 Если ДатаСостояния >= КонецДня(ВыборкаПоПериодуЗавершения.Период) и КонецДня(ВыборкаПоПериодуЗавершения.ПериодЗавершения) >= КонецДня(Выборка.ПериодЗавершения)  Тогда				 
				 Возврат ВыборкаПоПериодуЗавершения.Состояние;			 
			 КонецЕсли;
		 КонецЕсли;
			 
		 Если ДатаСостояния <= КонецДня(Выборка.ПериодЗавершения) И ДатаСостояния >= КонецДня(Выборка.Период) Тогда
			 Возврат Выборка.Состояние;
		 Иначе
			 Возврат (Перечисления.СостоянияРаботникаОрганизации.Работает);
		 КонецЕсли;
	 Иначе
		 Возврат (Перечисления.СостоянияРаботникаОрганизации.Работает);
	 КонецЕсли;
	
	  
 КонецФункции

//(конец ) добавлено Кухарчуком Д.Я. 17.08.18, Задача СВФР-002063