////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Заполняет документ по перерассчитываемому документу
// ИсходныйДокумент - тип ДокументОбъект.НачислениеОтпускаРаботникамОрганизаций
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Физлица = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
	"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПерерассчитываемыйДокумент", ПерерассчитываемыйДокумент);
	Запрос.УстановитьПараметр("Физлица", Физлица);
	Запрос.УстановитьПараметр("ПоВсемСотрудникам", Физлица = Неопределено);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо,
	|	-НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Результат КАК Результат,
	|	ИСТИНА КАК Сторно,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно)
	|	И НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка.Проведен
	|	И (&ПоВсемСотрудникам
	|			ИЛИ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо В (&Физлица))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо,
	|	0,
	|	ЛОЖЬ,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо В (&Физлица))
	|	И НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сторно УБЫВ,
	|	НомерСтроки";
	
	Начисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ФизЛицо,
	|	-НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Результат КАК Результат,
	|	ИСТИНА КАК Сторно,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидРасчета,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаНачала,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки КАК НомерСтроки,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сотрудник,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаНачалаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаОкончания,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ПодразделениеОрганизации
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И НЕ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно
	|	И НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка.Проведен
	|	И (&ПоВсемСотрудникам
	|			ИЛИ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ФизЛицо В (&Физлица))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ФизЛицо,
	|	0,
	|	ЛОЖЬ,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидРасчета,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаНачала,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сотрудник,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаНачалаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаОкончания,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд2,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд3,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд4,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Показатель6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Валюта6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд5,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ТарифныйРазряд6,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ПодразделениеОрганизации
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И НЕ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно
	|	И (&ПоВсемСотрудникам
	|			ИЛИ НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ФизЛицо В (&Физлица))
	|	И НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сторно УБЫВ,
	|	НомерСтроки";
	ОсновныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	
КонецПроцедуры // ЗаполнитьПоПерерассчитываемомуДокументу()

Процедура Рассчитать(Начисление = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачисления", Дата);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки КАК НомерСтроки,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо КАК Физлицо,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Сотрудник КАК Сотрудник,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ВидПособия КАК ВидПособия,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ДатаСобытия КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка.Организация.РайонныйКоэффициентРФ, 0) < 1
	|			ТОГДА 1
	|		ИНАЧЕ НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка.Организация.РайонныйКоэффициентРФ
	|	КОНЕЦ КАК РайонныйКоэффициентРФ,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Сторно,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Результат
	|ПОМЕСТИТЬ ВТСписокФизлиц
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка = &ДокументСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоследниеДаты.НомерСтроки,
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		&ГоловнаяОрганизация КАК Организация,
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки КАК НомерСтроки,
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо КАК Физлицо,   
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
	|	ИЗ
	|		ВТСписокФизлиц КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
	|				И (РаботникиОрганизаций.Организация = &ГоловнаяОрганизация)
	|				И (РаботникиОрганизаций.Период <= &ДатаНачисления)
	|				И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
	|				И НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо 
	|				И НачислениеЕдиновременныхПособийЗаСчетФСС.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	ГДЕ
	|		(НЕ НачислениеЕдиновременныхПособийЗаСчетФСС.Сторно)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо,
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.Сотрудник,
	|		НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки) КАК ПоследниеДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ПоследниеДаты.Период = РаботникиОрганизаций.Период
	|			И ПоследниеДаты.Организация = РаботникиОрганизаций.Организация
	|			И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
	|			И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
	|			И ПоследниеДаты.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки КАК НомерСтроки,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Сотрудник,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ВидПособия,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ДатаСобытия,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Сторно
	|			ТОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Результат
	|		ИНАЧЕ ГосударственныеПособия.Размер * ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.КодПоОКАТО <> """"
	|					ТОГДА ВЫБОР
	|							КОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
	|								ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.РайонныйКоэффициентРФ
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				ИНАЧЕ НачислениеЕдиновременныхПособийЗаСчетФСС.РайонныйКоэффициентРФ
	|			КОНЕЦ
	|	КОНЕЦ КАК Результат,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Сторно
	|ИЗ
	|	ВТСписокФизлиц КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Сотрудники.НомерСтроки КАК НомерСтроки,
	|			ВЫБОР
	|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаНачисления
	|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|			КОНЕЦ КАК ПодразделениеОрганизации
	|		ИЗ
	|			ВТСписокСотрудников КАК Сотрудники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|						&ДатаНачисления,
	|						Организация = &ГоловнаяОрганизация
	|							И Сотрудник В
	|								(ВЫБРАТЬ
	|									Сотрудники.Сотрудник
	|								ИЗ
	|									ВТСписокСотрудников КАК Сотрудники)) КАК РаботникиОрганизацийСрезПоследних
	|				ПО Сотрудники.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки = РаботникиОрганизацииСрезПоследних.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ГосударственныеПособия.Период) КАК Период,
	|			НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки КАК НомерСтроки,
	|			НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия КАК ВидПособия
	|		ИЗ
	|			ВТСписокФизлиц КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия КАК ГосударственныеПособия
	|				ПО НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия = ГосударственныеПособия.ВидПособия
	|					И НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаСобытия >= ГосударственныеПособия.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки,
	|			НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия) КАК ДатыПособий
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия КАК ГосударственныеПособия
	|			ПО ДатыПособий.Период = ГосударственныеПособия.Период
	|				И ДатыПособий.ВидПособия = ГосударственныеПособия.ВидПособия
	|		ПО НачислениеЕдиновременныхПособийЗаСчетФСС.НомерСтроки = ДатыПособий.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Начисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры//27.11.2024 добавление сотрудника в запрос, очишалось в ТЧ док един пособия

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Дата,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Организация
	|		ИНАЧЕ НачислениеЕдиновременныхПособийЗаСчетФСС.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Организация КАК ОбособленноеПодразделение,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Дата < НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации
	|			ТОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Дата > КОНЕЦПЕРИОДА(НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НачислениеЕдиновременныхПособийЗаСчетФСС.Дата
	|	КОНЕЦ КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Дата < НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации
	|			ТОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФСС.Дата > КОНЕЦПЕРИОДА(НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(НачислениеЕдиновременныхПособийЗаСчетФСС.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НачислениеЕдиновременныхПособийЗаСчетФСС.Дата
	|	КОНЕЦ КАК ДатаРегистрации
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачисления", ВыборкаПоШапкеДокумента.Дата);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ВыборкаПоШапкеДокумента.Организация);
	
	// Описание текста запроса:
	// 1. Выборка "НачислениеЕдиновременныхПособийЗаСчетФССНачисления": 
	//		Выбираются строки документа.  
	// 2. Выборка "РаботникиОрганизаций": 
	//		Из регистра сведений о работниках выбираем информацию о подразделении работника организации
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.НомерСтроки КАК НомерСтроки,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо КАК ФизЛицо,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо1 КАК Физлицо1,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо.Наименование КАК ФизЛицоНаименование,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо1.Наименование КАК ФизЛицо1Наименование,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Результат,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ВидПособия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.ДатаСобытия КАК ДатаНачалаСобытия,
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сторно
	|			ТОГДА НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка.ПерерассчитываемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	
	//СВЭЙ 26.12.2023 КВВ СВФР-012031 (
	//|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|ВЫБОР КОГДА
	|НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сотрудник = ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|ТОГДА
	|РаботникиОрганизаций.Сотрудник
	|ИНАЧЕ
	|НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Сотрудник
	|КОНЕЦ КАК Сотрудник,
	//СВЭЙ 26.12.2023 КВВ СВФР-012031 )
	
	|	РаботникиОрганизаций1.Сотрудник КАК Сотрудник1,
	|	ВЫБОР
	|		КОГДА НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо1 = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизаций.Сотрудник ЕСТЬ НЕ NULL 
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РаботникиОрганизаций1.Сотрудник ЕСТЬ НЕ NULL 
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &ДатаНачисления
	|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций1.ПериодЗавершения <= &ДатаНачисления
	|				И РаботникиОрганизаций1.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизаций1.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизаций1.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации1
	|ИЗ                                                   
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФССНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаНачисления,
	|				Организация = &ГоловнаяОрганизация
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И Сотрудник.ФизЛицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо
	|						ИЗ
	|							Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|						ГДЕ
	|							НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка = &ДокументСсылка)) КАК РаботникиОрганизаций
	|		ПО НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаНачисления,
	|				Организация = &ГоловнаяОрганизация
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И Сотрудник.ФизЛицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							НачислениеЕдиновременныхПособийЗаСчетФСС.Физлицо1
	|						ИЗ
	|							Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК НачислениеЕдиновременныхПособийЗаСчетФСС
	|						ГДЕ
	|							НачислениеЕдиновременныхПособийЗаСчетФСС.Ссылка = &ДокументСсылка)) КАК РаботникиОрганизаций1
	|		ПО НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Физлицо1 = РаботникиОрганизаций1.Сотрудник.Физлицо
	|ГДЕ
	|	НачислениеЕдиновременныхПособийЗаСчетФССНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	РаботникиОрганизаций.Период УБЫВ,
	|	РаботникиОрганизаций.Сотрудник.ДатаНачала УБЫВ";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода исправляемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией исправляемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определенной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// ФизЛицо
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный работник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидПособия
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидПособия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид пособия!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаСобытия
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаСобытия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата события!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры: 
//  ВыборкаПоСтрокамДокумента				- спозиционированная на определенной строке выборка 
//				  							  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуДополнительныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Движение = Движения.ДополнительныеНачисленияРаботниковОрганизаций.Добавить();
	
	СтрокаСвойствИзДокумента = "Организация,ОбособленноеПодразделение";
	СтрокаСвойствИзСтрокиДокумента = "ФизЛицо,Результат,ДатаНачалаСобытия,Сотрудник,ПодразделениеОрганизации,Сторно,СторнируемыйДокумент"; 
	
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
	
	// Свойства
	
	// вид расчета однозначно соответствует виду пособия
	Если ВыборкаПоСтрокамДокумента.ВидПособия = Перечисления.ВидыГосударственныхПособий.ВСвязиСоСмертью Тогда
		ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ВСвязиСоСмертью;
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности Тогда
		ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка Тогда
		ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей Тогда
		ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей
	Иначе
		ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка
	КонецЕсли;
	//ПСА 18.02.2021 СВФР-007178+++
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо1) Тогда
		Движение.ФизЛицо = ВыборкаПоСтрокамДокумента.ФизЛицо1;
		Движение.Сотрудник = ВыборкаПоСтрокамДокумента.Сотрудник1;
		Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации1;
	КонецЕсли;	
	//+++ПСА 18.02.2021 СВФР-007178
	Движение.ВидРасчета			= ВидРасчета;
	Движение.ПериодРегистрации  = ВыборкаПоШапкеДокумента.ПериодРегистрации;
	//Островская Татьяна 22.05.2014 № 17379
	Движение.БазовыйПериодНачало = НачалоДня(Дата);
	Движение.БазовыйПериодКонец = КонецДня(Дата);
	//Островская Татьяна 22.05.2014 № 17379
	
КонецПроцедуры // ДобавитьСтрокуДополнительныхНачислений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период                 = КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
	// Измерения
	Движение.Организация			= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ФизЛицо                = ВыборкаПоТЧ.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов   = НачалоМесяца(ВыборкаПоШапкеДокумента.Дата);
	КонецЕсли;
	
	// Ресурсы
	Движение.СуммаВзаиморасчетов	= ВыборкаПоТЧ.Результат; 
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамНакопления;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.СледующийПоЗначениюПоля("НомерСтроки") Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					ДобавитьСтрокуДополнительныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
					
				КонецЕсли;
				
			КонецЦикла;
			
			СформироватьНДФЛСведенияОДоходах(ВыборкаПоШапкеДокумента, Движения.НДФЛСведенияОДоходах,1); //СВЭЙ 29.11.2023 КВВ СВФР-011907
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НачислениеЕжемесячныхПособийЗаПрошлыйПериод или Организация.НачислениеЕжемесячныхПособийОтдельнымДок Тогда 
		
		
		// Получим реквизиты шапки из запроса
		ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
		ВыборкаПоНачислениям = СформироватьЗапросПоНачисления1(ВыборкаПоШапкеДокумента).Выбрать();
		
		Если ВыборкаПоШапкеДокумента.Следующий() Тогда
			Пока ВыборкаПоНачислениям.СледующийПоЗначениюПоля("НомерСтроки") Цикл
				
				//Надо позвать проверку заполнения реквизитов шапки
				ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
				
				// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					НаборОсновныеНачисления = Движения.ОсновныеНачисленияРаботниковОрганизаций;
					
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, НаборОсновныеНачисления);
					
				КонецЕсли;
			КонецЦикла;
			
			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			// сформируем начисления к выплате по начислениям документа
			СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, Движения.ВзаиморасчетыСРаботникамиОрганизаций, УчетЗадолженностиПоМесяцам);
			
			СформироватьНДФЛСведенияОДоходах(ВыборкаПоШапкеДокумента, Движения.НДФЛСведенияОДоходах,2); //СВЭЙ 29.11.2023 КВВ СВФР-011907
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Начисления,, "Физлицо");
	
КонецПроцедуры

Функция ВыполнитьАвтозаполнение(НачалоПериодаЗаполнения, ОкончаниеПериодаЗаполнения, Запрос = Неопределено, МассивСотрудники = Неопределено,СписокФизЛиц=Неопределено) Экспорт //О.Т. Аверсон 29.05.2018 № 2013
	
	РасчетЗарплатыОрганизацииПоОтветственным = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "РасчетЗарплатыОрганизацииПоОтветственным");
	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	Если Запрос = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// подготовим временную таблицу с подразделениями
		ПоВсемПодразделениямОрганизации = Истина;
		ТекстЗапросаПоПодразделениям = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияОтбора";
		
		Если МассивСотрудники = Неопределено Тогда
			
			Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
				ПоВсемПодразделениямОрганизации = Ложь;
				Запрос.УстановитьПараметр("парамПодразделение", ПодразделениеОрганизации);
				ТекстЗапросаПоПодразделениям = 
				"ВЫБРАТЬ
				|	ПодразделенияОрганизаций.Ссылка КАК Подразделение
				|ПОМЕСТИТЬ ВТПодразделенияОтбора
				|ИЗ
				|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
				|ГДЕ
				|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&парамПодразделение)
				//толик			
				//|	ПодразделенияОрганизаций.Ссылка = &парамПодразделение
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Подразделение";
			ИначеЕсли ЗначениеЗаполнено(Ответственный) И РасчетЗарплатыОрганизацииПоОтветственным Тогда
				ПоВсемПодразделениямОрганизации = Ложь;
				Запрос.УстановитьПараметр("парамПользователь", Ответственный);
				Запрос.УстановитьПараметр("парамНачало", НачалоПериодаЗаполнения);
				ТекстЗапросаПоПодразделениям = 
				"ВЫБРАТЬ
				|	ПодразделенияОрганизаций.Ссылка КАК Подразделение
				|ПОМЕСТИТЬ ВТПодразделенияОтбора
				|ИЗ
				|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
				|ГДЕ
				|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				Расчетчики.ПодразделениеОрганизации
				|			ИЗ
				|				РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало) КАК Расчетчики
				|			ГДЕ
				|				Расчетчики.Пользователь = &парамПользователь)
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Подразделение";
			КонецЕсли;
			
			Если РасчетЗарплатыОрганизацииПоОтветственным И ЗначениеЗаполнено(Ответственный) Тогда
				// Проверим ответственного - является ли он расчетчиком вообще и для заданного 
				// подразделения (если оно задано)
				Запрос.УстановитьПараметр("парамПользователь" , Ответственный);
				Запрос.УстановитьПараметр("парамНачало" , НачалоПериодаЗаполнения);
				Если ПодразделениеОрганизации.Пустая() Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Расчетчики.ПодразделениеОрганизации
					|ИЗ
					|	РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало, ) КАК Расчетчики
					|ГДЕ
					|	Расчетчики.Пользователь = &парамПользователь";
					Если Запрос.Выполнить().Пустой() Тогда
						ОбщегоНазначения.ОшибкаРасчета("Ответственный за этот документ не является расчетчиком ни одного из подразделений организации");
						Возврат  Ложь;
					КонецЕсли;
				Иначе
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	Подразделения.Ссылка
					|ИЗ
					|	Справочник.ПодразделенияОрганизаций КАК Подразделения
					|ГДЕ
					|	Подразделения.Ссылка В ИЕРАРХИИ(&парамПодразделение)
					|	И Подразделения.Ссылка В ИЕРАРХИИ
					|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
					|				Расчетчики.ПодразделениеОрганизации
					|			ИЗ
					|				РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало) КАК Расчетчики
					|			ГДЕ
					|				Расчетчики.Пользователь = &парамПользователь)";
					Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
					Если Запрос.Выполнить().Пустой() Тогда
						ОбщегоНазначения.ОшибкаРасчета("Ответственный за этот документ не является расчетчиком для выбранного подразделения");
						Возврат  Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ФизЛица",				СписокФизЛиц);
			Запрос.УстановитьПараметр("ПоВсемФизЛицам",			СписокФизЛиц = Неопределено);
			Запрос.УстановитьПараметр("парамОрганизация",		Организация);
			Запрос.УстановитьПараметр("парамГоловнаяОрганизация",ГоловнаяОрганизация);
			Запрос.УстановитьПараметр("парамНачало",			НачалоПериодаЗаполнения);
			Запрос.УстановитьПараметр("парамКонец",				КонецДня(ОкончаниеПериодаЗаполнения));
			Запрос.УстановитьПараметр("парамКонец1",				КонецДня(ОкончаниеПериодаЗаполнения+86400)); // О.Т.
			если  Организация.ИНН = "100765738" Тогда 
				
				ЗапросМассивФизЛиц = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо
				|ПОМЕСТИТЬ ВТСписокФизЛиц
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			Организация = &парамГоловнаяОрганизация
				|				И (&ПоВсемФизЛицам
				|					ИЛИ Сотрудник.ФизЛицо В (&ФизЛица))) КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|	И ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
				|		КОНЕЦ = &парамОрганизация
				|	И ВЫБОР
				|			КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|				ТОГДА ВЫБОР
				|						КОГДА &ПоВсемПодразделениям
				|							ТОГДА ИСТИНА
				|						КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|								И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|							ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
				|									(ВЫБРАТЬ
				|										Подразделения.Подразделение
				|									ИЗ
				|										ВТПодразделенияОтбора КАК Подразделения)
				|						ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
				|								(ВЫБРАТЬ
				|									Подразделения.Подразделение
				|								ИЗ
				|									ВТПодразделенияОтбора КАК Подразделения)
				|					КОНЕЦ
				|			ИНАЧЕ ЛОЖЬ
				|		КОНЕЦ
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	РаботникиОрганизации.Период > &парамНачало
				|	И РаботникиОрганизации.Период <= &парамКонец
				|	И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ РаботникиОрганизации.Сотрудник.Физлицо В (&ФизЛица))
				|	И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА РаботникиОрганизации.ПодразделениеОрганизации В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ)
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК Работники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
				|		ПО Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
				|			И (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
				|			И (ПериодыПерекрытия.Период > Работники.Период)
				|			И (ПериодыПерекрытия.Организация = &парамГоловнаяОрганизация)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО Работники.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|	И Работники.ПериодЗавершения > &парамНачало
				|	И Работники.ПериодЗавершения <= &парамКонец
				|	И Работники.Организация = &парамГоловнаяОрганизация
				|	И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ Работники.Сотрудник.Физлицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА Работники.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА Работники.ПодразделениеОрганизацииЗавершения В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ)
				|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонец
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачало
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ)
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1"; 
				
				
				
				
				
				
				
				ТекстЗапросаПоСпискуРаботников = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
				|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо
				|ПОМЕСТИТЬ ВТСписокРаботников
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			Организация = &парамГоловнаяОрганизация
				|				И (&ПоВсемФизЛицам
				|					ИЛИ Сотрудник.ФизЛицо В (&ФизЛица))) КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|	И ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
				|		КОНЕЦ = &парамОрганизация
				|	И ВЫБОР
				|			КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|				ТОГДА ВЫБОР
				|						КОГДА &ПоВсемПодразделениям
				|							ТОГДА ИСТИНА
				|						КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|								И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|							ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
				|									(ВЫБРАТЬ
				|										Подразделения.Подразделение
				|									ИЗ
				|										ВТПодразделенияОтбора КАК Подразделения)
				|						ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
				|								(ВЫБРАТЬ
				|									Подразделения.Подразделение
				|								ИЗ
				|									ВТПодразделенияОтбора КАК Подразделения)
				|					КОНЕЦ
				|			КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
				|				ТОГДА ВЫБОР
				|						КОГДА РаботникиОрганизации.Сотрудник.Физлицо В
				|								(ВЫБРАТЬ
				|									ФизЛицаМассив.ФизЛицо
				|								ИЗ
				|									ВТСписокФизЛиц КАК ФизЛицаМассив)
				|							ТОГДА ИСТИНА
				|						ИНАЧЕ ЛОЖЬ
				|					КОНЕЦ
				|			ИНАЧЕ ВЫБОР
				|					КОГДА &ПоВсемПодразделениям
				|						ТОГДА ИСТИНА
				|					КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|							И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
				|								(ВЫБРАТЬ
				|									Подразделения.Подразделение
				|								ИЗ
				|									ВТПодразделенияОтбора КАК Подразделения)
				|					ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				КОНЕЦ
				|		КОНЕЦ
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник,
				|	РаботникиОрганизации.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	РаботникиОрганизации.Период > &парамНачало
				|	И РаботникиОрганизации.Период <= &парамКонец
				|	И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ РаботникиОрганизации.Сотрудник.Физлицо В (&ФизЛица))
				|	И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА РаботникиОрганизации.ПодразделениеОрганизации В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
				|					ТОГДА ВЫБОР
				|							КОГДА РаботникиОрганизации.Сотрудник.Физлицо В
				|									(ВЫБРАТЬ
				|										ФизЛицаМассив.ФизЛицо
				|									ИЗ
				|										ВТСписокФизЛиц КАК ФизЛицаМассив)
				|								ТОГДА ИСТИНА
				|							ИНАЧЕ ЛОЖЬ
				|						КОНЕЦ
				|				ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
				|						(ВЫБРАТЬ
				|							Подразделения.Подразделение
				|						ИЗ
				|							ВТПодразделенияОтбора КАК Подразделения)
				|			КОНЕЦ)
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Сотрудник,
				|	Работники.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК Работники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
				|		ПО Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
				|			И (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
				|			И (ПериодыПерекрытия.Период > Работники.Период)
				|			И (ПериодыПерекрытия.Организация = &парамГоловнаяОрганизация)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО Работники.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|	И Работники.ПериодЗавершения > &парамНачало
				|	И Работники.ПериодЗавершения <= &парамКонец
				|	И Работники.Организация = &парамГоловнаяОрганизация
				|	И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ Работники.Сотрудник.Физлицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА Работники.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА Работники.ПодразделениеОрганизацииЗавершения В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				КОГДА Работники.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.внутреннееСовместительство)
				|					ТОГДА ВЫБОР
				|							КОГДА Работники.Сотрудник.Физлицо В
				|									(ВЫБРАТЬ
				|										ФизЛицаМассив.ФизЛицо
				|									ИЗ
				|										ВТСписокФизЛиц КАК ФизЛицаМассив)
				|								ТОГДА ИСТИНА
				|							ИНАЧЕ ЛОЖЬ
				|						КОНЕЦ
				|				ИНАЧЕ Работники.ПодразделениеОрганизацииЗавершения В
				|						(ВЫБРАТЬ
				|							Подразделения.Подразделение
				|						ИЗ
				|							ВТПодразделенияОтбора КАК Подразделения)
				|			КОНЕЦ)
				|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонец
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачало
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ВЫБОР
				|				КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|					ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В
				|							(ВЫБРАТЬ
				|								Подразделения.Подразделение
				|							ИЗ
				|								ВТПодразделенияОтбора КАК Подразделения)
				|				КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.внутреннеесовместительство)
				|					ТОГДА ВЫБОР
				|							КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо В
				|									(ВЫБРАТЬ
				|										ФизЛицаМассив.ФизЛицо
				|									ИЗ
				|										ВТСписокФизЛиц КАК ФизЛицаМассив)
				|								ТОГДА ИСТИНА
				|							ИНАЧЕ ЛОЖЬ
				|						КОНЕЦ
				|				ИНАЧЕ ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В
				|						(ВЫБРАТЬ
				|							Подразделения.Подразделение
				|						ИЗ
				|							ВТПодразделенияОтбора КАК Подразделения)
				|			КОНЕЦ)
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Сотрудник"; //О.Т. 18.09.2014 № 229		
			иначе
				
				
				ТекстЗапросаПоСпискуРаботников = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
				|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо
				|ПОМЕСТИТЬ ВТСписокРаботников
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|			&парамНачало,
				|			Организация = &парамГоловнаяОрганизация
				|				И (&ПоВсемФизЛицам
				|					ИЛИ Сотрудник.ФизЛицо В (&ФизЛица))) КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
				|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|	И ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
				|		КОНЕЦ = &парамОрганизация
				|	И ВЫБОР
				|			КОГДА &ПоВсемПодразделениям
				|				ТОГДА ИСТИНА
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
				|						(ВЫБРАТЬ
				|							Подразделения.Подразделение
				|						ИЗ
				|							ВТПодразделенияОтбора КАК Подразделения)
				|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
				|					(ВЫБРАТЬ
				|						Подразделения.Подразделение
				|					ИЗ
				|						ВТПодразделенияОтбора КАК Подразделения)
				|		КОНЕЦ
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник,
				|	РаботникиОрганизации.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	РаботникиОрганизации.Период > &парамНачало
				|	И РаботникиОрганизации.Период <= &парамКонец
				|	И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ РаботникиОрганизации.Сотрудник.Физлицо В (&ФизЛица))
				|	И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
				|	И (&ПоВсемПодразделениям
				|			ИЛИ РаботникиОрганизации.ПодразделениеОрганизации В
				|				(ВЫБРАТЬ
				|					Подразделения.Подразделение
				|				ИЗ
				|					ВТПодразделенияОтбора КАК Подразделения))
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Сотрудник,
				|	Работники.Сотрудник.Физлицо
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК Работники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
				|		ПО Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
				|			И (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
				|			И (ПериодыПерекрытия.Период > Работники.Период)
				|			И (ПериодыПерекрытия.Организация = &парамГоловнаяОрганизация)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО Работники.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|	И Работники.ПериодЗавершения > &парамНачало
				|	И Работники.ПериодЗавершения <= &парамКонец
				|	И Работники.Организация = &парамГоловнаяОрганизация
				|	И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ Работники.Сотрудник.Физлицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ Работники.ПодразделениеОрганизацииЗавершения В
				|				(ВЫБРАТЬ
				|					Подразделения.Подразделение
				|				ИЗ
				|					ВТПодразделенияОтбора КАК Подразделения))
				|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамКонец1, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = Увольнение.Сотрудник
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонец
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачало
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация
				|	И (&ПоВсемФизЛицам
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (&ФизЛица))
				|	И (&ПоВсемПодразделениям
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В
				|				(ВЫБРАТЬ
				|					Подразделения.Подразделение
				|				ИЗ
				|					ВТПодразделенияОтбора КАК Подразделения))
				|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Сотрудник"; //О.Т. 18.09.2014 № 229		
			КонецЕсли;
			
		Иначе
			
			Запрос.УстановитьПараметр("Сотрудники", МассивСотрудники);
			ТекстЗапросаПоСпискуРаботников = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|	СотрудникиОрганизаций.Физлицо
			|ПОМЕСТИТЬ ВТСписокРаботников
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка В(&Сотрудники)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник";
			
		КонецЕсли;
		
		// создаем временную таблицу с подразделениями
		Запрос.Текст = ТекстЗапросаПоПодразделениям;
		Запрос.УстановитьПараметр("ПоВсемПодразделениям", ПоВсемПодразделениямОрганизации);
		Запрос.Выполнить();
		
		// создаем временную таблицу ВТСписокРаботников с сотрудниками, отобранными по подразделению или из переданного списка 
		// 
		// Поля:
		//   Сотрудник
		//   Физлицо
		//
		
		если Организация.ИНН = "100765738" и МассивСотрудники = Неопределено Тогда 
			Запрос.Текст = ЗапросМассивФизЛиц;			
			Запрос.Выполнить();
		КонецЕсли;
		
		
		Запрос.Текст = ТекстЗапросаПоСпискуРаботников;
		
		
		запр = Запрос.Выполнить();
		
		
	иначе
		
		если Организация.ИНН = "100765738" Тогда  
			ЗапросДляПродолжения = Запрос.Текст; 
			ЗапросМассивФизЛиц = Запрос.Текст;
			ЗапросМассивФизЛиц = СтрЗаменить(ЗапросМассивФизЛиц,"ПОМЕСТИТЬ ВТСписокРаботников","");
			ЗапросМассивФизЛиц = СтрЗаменить(ЗапросМассивФизЛиц,"ИНДЕКСИРОВАТЬ ПО","");
			ЗапросМассивФизЛиц = СтрЗаменить(ЗапросМассивФизЛиц,"	Сотрудник","");
			
			Запрос.Текст = ЗапросМассивФизЛиц;
			РезФизЛица = Запрос.Выполнить().Выбрать();
			СписокФизЛицМассив = Новый СписокЗначений;
			Пока РезФизЛица.Следующий() Цикл 
				если РезФизЛица.Сотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы Тогда 
					СписокФизЛицМассив.Добавить(РезФизЛица.ФизЛицо);
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос.Текст = ЗапросДляПродолжения;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"	И ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|		КОНЕЦ В ИЕРАРХИИ (&Параметр5)","И ВЫБОР
			|КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
			|ТОГДА ВЫБОР
			|	КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|	ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|КОНЕЦ В ИЕРАРХИИ (&Параметр5) 
			|	КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство) тогда 
			|	выбор когда РаботникиОрганизации.Сотрудник.Физлицо В (&СписокФизЛицМассив) ТОГДА истина иначе ложь конец 
			|	
			
			|	иначе ВЫБОР
			|	КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|			И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|	ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|КОНЕЦ В ИЕРАРХИИ (&Параметр5) конец");
			Запрос.УстановитьПараметр("СписокФизЛицМассив",СписокФизЛицМассив);
		КонецЕсли;
		//О.Т.
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Выполнить();		
		
		ТекстЗапросаПоСпискуРаботников = Запрос.Текст;//Островская Татьяна 03.04.2014 № 17
		// объявим временную таблицу - она должна присутствовать, но использоваться не будет
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияОтбора";
		Запрос.Выполнить();
		Запрос.УстановитьПараметр("ПоВсемПодразделениям", Истина);
		
		
	КонецЕсли;
	
	
	
	если МассивСотрудники = Неопределено или ТипЗнч(МассивСотрудники) = Тип("Массив") тогда
		// Установим параметры запроса
		Запрос.УстановитьПараметр("парамПериодРегистрации" , ПериодРегистрации);
		Запрос.УстановитьПараметр("парамНачало" , НачалоПериодаЗаполнения);
		Запрос.УстановитьПараметр("парамКонец" , КонецДня(ОкончаниеПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамОрганизация" , Организация);
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("парамРегистратор" , Ссылка);
		Запрос.УстановитьПараметр("парамНачалоМесяца" , НачалоМесяца(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , НачалоМесяца(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамВалютаРегламентУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты" , ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
		Запрос.УстановитьПараметр("Год",Год(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("ЭтоПерерасчет", Ложь);
		ВидыРасчетаПособия = Новый СписокЗначений;
		Для Каждого стр из Справочники.ГруппыРасчетов.ДетскиеПособия.Основные Цикл 
			ВидыРасчетаПособия.Добавить(стр.ВидРасчета);
		КонецЦикла;  		
		Запрос.УстановитьПараметр("ВидРасчетаПособия", ВидыРасчетаПособия);
		
		
		//ТаблицаДвиженийРаботниковТекст
		//Описание:
		//	Выбирает список работников, отвечающих условиям отбора, числящихся на начало месяца и их движения за месяц.
		//Островская Татьяна 22.01.2014 № 17057
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&парамНачало КАК Период,
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	ИСТИНА КАК Подходит,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|	КОНЕЦ КАК ПодразделениеОрганизации,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|	КОНЕЦ КАК ГрафикРаботы,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность
			|	КОНЕЦ КАК Должность,
			|	РаботникиОрганизации.Сотрудник.Код КАК ТабНомер
			|ПОМЕСТИТЬ ВТДвиженияРаботников
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|			&парамНачало,
			|			Сотрудник В
			|				(ВЫБРАТЬ
			|					ВТСписокРаботников.Сотрудник
			|				ИЗ
			|					ВТСписокРаботников КАК ВТСписокРаботников)) КАК РаботникиОрганизации
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
			|		КОНЕЦ = &парамОрганизация
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизации.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
			|				ТОГДА ВЫБОР
			|						КОГДА &ПоВсемПодразделениям
			|							ТОГДА ИСТИНА
			|						КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|								И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
			|									(ВЫБРАТЬ
			|										Подразделения.Подразделение
			|									ИЗ
			|										ВТПодразделенияОтбора КАК Подразделения)
			|						ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
			|								(ВЫБРАТЬ
			|									Подразделения.Подразделение
			|								ИЗ
			|									ВТПодразделенияОтбора КАК Подразделения)
			|					КОНЕЦ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РаботникиОрганизации.Период,
			|	РаботникиОрганизации.Сотрудник,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
			|				И (&ПоВсемПодразделениям
			|					ИЛИ РаботникиОрганизации.ПодразделениеОрганизации В
			|						(ВЫБРАТЬ
			|							Подразделения.Подразделение
			|						ИЗ
			|							ВТПодразделенияОтбора КАК Подразделения))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	РаботникиОрганизации.ПодразделениеОрганизации,
			|	РаботникиОрганизации.ГрафикРаботы,
			|	РаботникиОрганизации.Должность,
			|	РаботникиОрганизации.Сотрудник.Код
			|ИЗ
			|	ВТСписокРаботников КАК СписокРаботников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|		ПО СписокРаботников.Сотрудник = РаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизации.Период > &парамНачало
			|	И РаботникиОрганизации.Период <= &парамКонец
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Работники.ПериодЗавершения,
			|	Работники.Сотрудник,
			|	ВЫБОР
			|		КОГДА Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
			|				И (&ПоВсемПодразделениям
			|					ИЛИ Работники.ПодразделениеОрганизацииЗавершения В
			|						(ВЫБРАТЬ
			|							Подразделения.Подразделение
			|						ИЗ
			|							ВТПодразделенияОтбора КАК Подразделения))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	Работники.ПодразделениеОрганизацииЗавершения,
			|	Работники.ГрафикРаботыЗавершения,
			|	Работники.ДолжностьЗавершения,
			|	Работники.Сотрудник.Код
			|ИЗ
			|	ВТСписокРаботников КАК СписокРаботников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
			|			ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
			|				И (ПериодыПерекрытия.Период > Работники.Период)
			|				И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
			|		ПО СписокРаботников.Сотрудник = Работники.Сотрудник
			|ГДЕ
			|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И Работники.ПериодЗавершения > &парамНачало
			|	И Работники.ПериодЗавершения <= &парамКонец
			|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник";
			
		Иначе 
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&парамНачало КАК Период,
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	ИСТИНА КАК Подходит,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|	КОНЕЦ КАК ПодразделениеОрганизации,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|	КОНЕЦ КАК ГрафикРаботы,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность
			|	КОНЕЦ КАК Должность,
			|	РаботникиОрганизации.Сотрудник.Код КАК ТабНомер
			|ПОМЕСТИТЬ ВТДвиженияРаботников
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|			&парамНачало,
			|			Сотрудник В
			|				(ВЫБРАТЬ
			|					ВТСписокРаботников.Сотрудник
			|				ИЗ
			|					ВТСписокРаботников КАК ВТСписокРаботников)) КАК РаботникиОрганизации
			|ГДЕ
			|	ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
			|		КОНЕЦ = &парамОрганизация
			|	И ВЫБОР
			|			КОГДА &ПоВсемПодразделениям
			|				ТОГДА ИСТИНА
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
			|						(ВЫБРАТЬ
			|							Подразделения.Подразделение
			|						ИЗ
			|							ВТПодразделенияОтбора КАК Подразделения)
			|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
			|					(ВЫБРАТЬ
			|						Подразделения.Подразделение
			|					ИЗ
			|						ВТПодразделенияОтбора КАК Подразделения)
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РаботникиОрганизации.Период,
			|	РаботникиОрганизации.Сотрудник,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
			|				И (&ПоВсемПодразделениям
			|					ИЛИ РаботникиОрганизации.ПодразделениеОрганизации В
			|						(ВЫБРАТЬ
			|							Подразделения.Подразделение
			|						ИЗ
			|							ВТПодразделенияОтбора КАК Подразделения))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	РаботникиОрганизации.ПодразделениеОрганизации,
			|	РаботникиОрганизации.ГрафикРаботы,
			|	РаботникиОрганизации.Должность,
			|	РаботникиОрганизации.Сотрудник.Код
			|ИЗ
			|	ВТСписокРаботников КАК СписокРаботников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
			|		ПО СписокРаботников.Сотрудник = РаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизации.Период > &парамНачало
			|	И РаботникиОрганизации.Период <= &парамКонец
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Работники.ПериодЗавершения,
			|	Работники.Сотрудник,
			|	ВЫБОР
			|		КОГДА Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|				И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
			|				И (&ПоВсемПодразделениям
			|					ИЛИ Работники.ПодразделениеОрганизацииЗавершения В
			|						(ВЫБРАТЬ
			|							Подразделения.Подразделение
			|						ИЗ
			|							ВТПодразделенияОтбора КАК Подразделения))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	Работники.ПодразделениеОрганизацииЗавершения,
			|	Работники.ГрафикРаботыЗавершения,
			|	Работники.ДолжностьЗавершения,
			|	Работники.Сотрудник.Код
			|ИЗ
			|	ВТСписокРаботников КАК СписокРаботников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
			|			ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
			|				И (ПериодыПерекрытия.Период > Работники.Период)
			|				И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
			|		ПО СписокРаботников.Сотрудник = Работники.Сотрудник
			|ГДЕ
			|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|	И Работники.ПериодЗавершения > &парамНачало
			|	И Работники.ПериодЗавершения <= &парамКонец
			|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Сотрудник";
		КонецЕсли;
		Запрос.Выполнить();
		//Островская Татьяна 22.01.2014 № 17057
		// таблица ВТЗначенияПоказателей
		// 
		// Поля:
		//   Сотрудник
		//   Показатель - введенный пользователем показатель
		//   Значение - значение показателя
		//   Валюта
		//
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
		|	ЗначенияПоказателейСхемМотивации.Валюта,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|				И (НЕ ЗначенияПоказателейСхемМотивации.Валюта В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателейСхемМотивации.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателейСхемМотивации.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ
		|	ВТДвиженияРаботников КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Ежемесячно.Подразделение КАК Подразделение,
		|			Ежемесячно.Показатель КАК Показатель,
		|			Ежемесячно.Валюта КАК Валюта,
		|			Ежемесячно.Значение КАК Значение,
		|			Ежемесячно.Сотрудник КАК Сотрудник
		|		ИЗ
		|			РегистрСведений.ЗначенияПоказателейСхемМотивации КАК Ежемесячно
		|		ГДЕ
		|			Ежемесячно.Значение ЕСТЬ НЕ NULL 
		|			И Ежемесячно.Организация = &парамОрганизация
		|			И Ежемесячно.ПериодДействия >= &парамНачало
		|			И Ежемесячно.ПериодДействия <= &парамКонец
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Подразделение,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Валюта,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Значение,
		|			NULL
		|		ИЗ
		|			РегистрСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СрезПоследних(&парамКонец, Организация = &парамОрганизация) КАК ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних) КАК ЗначенияПоказателейСхемМотивации
		|		ПО (ВЫБОР
		|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|						ИЛИ ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя ЕСТЬ NULL 
		|					ТОГДА Работники.Сотрудник = ЗначенияПоказателейСхемМотивации.Сотрудник
		|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|					ТОГДА Работники.ПодразделениеОрганизации = ЗначенияПоказателейСхемМотивации.Подразделение
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
		|		ПО (Валюты.Период = &парамДатаВалютногоУчета)
		|			И (ЗначенияПоказателейСхемМотивации.Валюта = Валюты.Валюта)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		
		Запрос.Выполнить();
		
		
		// создание временных таблиц для последующего использования:
		//	ЗначенияПоказателей
		//	НеЗапрашиваемыеПриКадровыхПеремещениях
		//	ВводимыеВПлановыхНачисленияхПоказатели
		//	РаботникиИНачисления
		
		//Если ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.ПолныйРасчет 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНачислений 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетУдержаний 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНДФЛ
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетПенсионногоФонда Тогда
		
		// таблица НеЗапрашиваемыеПриКадровыхПеремещениях
		// 	выбираем показатели, которые не спрашиваем у пользователя в кадровых документах, а также все "тарифные ставки" и их в.р.;
		//  значения этих показателей будем искать в данных о плановых начислениях, но, возможно, при других видах расчета
		// 
		//	Поля:
		//		Ссылка - вид расчета
		//		Показатель
		//		НомерСтроки - номер строки показателя
		//		ЭтоТарифнаяСтавка - признак того. что Показатель является тарифной ставкой
		// 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель КАК Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТарифнаяСтавка
		|ПОМЕСТИТЬ ВТНеЗапрашиваемыеПриКадровыхПеремещениях
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	((НЕ ОсновныеНачисленияОрганизацийПоказатели.ЗапрашиватьПриКадровыхПеремещениях)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка)
		|	И ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель";
		Запрос.Выполнить();
		
		// таблица ВводимыеВПлановыхНачисленияхПоказатели
		//  виды расчета и показатели, значения которых находятся при этих в.р. в данных о плановых начислениях
		// 
		//	Поля:
		//		Ссылка - вид расчета
		//		Показатель
		//		НомерСтроки - номер строки показателя
		// 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизаций.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|		КОГДА ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|	КОНЕЦ КАК Показатель,
		|	1 КАК НомерСтроки,
		|	ИСТИНА КАК ЭтоТарифнаяСтавка
		|ПОМЕСТИТЬ ВТВводимыеВПлановыхНачисленияхПоказатели
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	(ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке))
		|	 ИЛИ ОсновныеНачисленияОрганизаций.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)) //О.Т. Аверсон 11.04.2017 № 513
		|	И ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки,
		|	ИСТИНА
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка.ЗачетОтработанногоВремени
		|	И ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка
		|	И (НЕ ОсновныеНачисленияОрганизацийПоказатели.Показатель.Предопределенный)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки,
		|	ЛОЖЬ
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель В
		|			(ВЫБРАТЬ
		|				ВТНеЗапрашиваемыеПриКадровыхПеремещениях.Показатель
		|			ИЗ
		|				ВТНеЗапрашиваемыеПриКадровыхПеремещениях)
		|	И (НЕ ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
		
		Запрос.Выполнить();
		
		// РаботникиИНачисления
		//		Таблица движений работников с добавленными сведениями об их плановых начислениях
		// 
		//	Поля:
		//		Сотрудник 
		//		ВидРасчета - плановое начисление 
		//		Показатель1,...,6 - размеры показателей 
		//		СпособРасчета - способ расчета начисления 
		//		ГрафикРаботы - график сотрудника  
		//		ВидГрафика, СуммированныйУчетРабочегоВремени, ДлительностьРабочейНедели - реквизиты графика сотрудника 
		// 
		// Описание:
		//
		//	1. 
		//  2. 
		//
		//Островская Татьяна 22.01.2014 № 17057
		ПособиеСписок = Новый СписокЗначений; //О.Т. Аверсон 23.06.2016 № 1267
		//+ СВЭЙ КДЯ 15.08.19 СВФР-004652
		ПособиеСписок.ЗагрузитьЗначения( ВидыРасчетаПособия.ВыгрузитьЗначения() );
		//- СВЭЙ КДЯ 15.08.19 СВФР-004652
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаВторогоИПоследующихДо3Лет);
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаРебенкаСтарше3Лет);
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаДетейОт3До18); //О.Т. Аверсон 27.03.2018 № 1771
		
		
		//О.Т. Аверсон 14.06.2018 № 
		СпособыРасчетаСписок = Новый СписокЗначений;			
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида);
		
		//О.Т. Аверсон 14.06.2018 № 
		
		Запрос.УстановитьПараметр("ВидРасчетаПособие", ПособиеСписок);
		Запрос.УстановитьПараметр("СпособыРасчетаПособие", СпособыРасчетаСписок);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Работники.Сотрудник.Физлицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА Работники.Период >= НачисленияРаботниковОрганизации.Период
		|				ИЛИ НачисленияРаботниковОрганизации.Период ЕСТЬ NULL 
		|			ТОГДА Работники.Период
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Период
		|	КОНЕЦ КАК Период,
		|	Работники.Подходит,
		|	Работники.Период КАК ПериодРаботники,
		|	НачисленияРаботниковОрганизации.Период КАК ПериодНачисления,
		|	НачисленияРаботниковОрганизации.ОсновноеНачисление,
		|	НачисленияРаботниковОрганизации.ВидРасчета,
		|	НачисленияРаботниковОрганизации.ВидРасчета.Наименование,
		|	НачисленияРаботниковОрганизации.ВидРасчета.ВидСтажа,
		|	НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда,
		|	НачисленияРаботниковОрганизации.ВидРасчета.КоэффициентСтажа,
		|	НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|			ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ВидВремени,
		|	НачисленияРаботниковОрганизации.Действие КАК Действие,
		|	ЕСТЬNULL(НачисленияРаботниковОрганизации.ВидРасчета.КодДоходаНДФЛ.КодВычета, ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.ПустаяСсылка)) КАК КодВычета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|				ИЛИ НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|					И (НачисленияРаботниковОрганизации.ТарифныйРазряд1 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|						И НачисленияРаботниковОрганизации.ТарифныйРазряд1 ЕСТЬ НЕ NULL )
		|			ТОГДА ТарифныеСтавки1.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд2 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд2 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки2.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд3 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд3 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки3.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд4 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд4 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки4.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд5 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд5 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки5.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд6 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд6 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки6.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|	КОНЕЦ КАК Показатель6,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки1.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта1
		|	КОНЕЦ КАК Валюта1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки2.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта2
		|	КОНЕЦ КАК Валюта2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки3.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта3
		|	КОНЕЦ КАК Валюта3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки4.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта4
		|	КОНЕЦ КАК Валюта4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки5.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта5
		|	КОНЕЦ КАК Валюта5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки6.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта6
		|	КОНЕЦ КАК Валюта6,
		|	НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы КАК ГрафикРаботы,
		|	ЕСТЬNULL(Работники.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА Работники.ГрафикРаботы.СокращенноеРабочееВремя
		|					И Работники.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА Работники.ГрафикРаботы.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели
		|			ИНАЧЕ Работники.ГрафикРаботы.ДлительностьРабочейНедели
		|		КОНЕЦ, 0) КАК ДлительностьРабочейНедели,
		|	Работники.ГрафикРаботы.ВидГрафика КАК ВидГрафика,
		|	Работники.Должность КАК Должность,
		|	НачисленияРаботниковОрганизации.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	Работники.ТабНомер,
		|	НачисленияРаботниковОрганизации.ПериодЗавершения,
		|	НачисленияРаботниковОрганизации.Показатель1ВВалюте,
		|	ДОБАВИТЬКДАТЕ(НачисленияРаботниковОрганизации.НовПериод,СЕКУНДА,НачисленияРаботниковОрганизации.НовНомерСтроки) КАК ПериодНомерСтроки //Аверсон 16.06.2022 КВВ СВФР-009202
		|ПОМЕСТИТЬ ВТРаботникиИНачисления
		|ИЗ
		|	ВТДвиженияРаботников КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НачисленияРаботниковОрганизации.Период КАК НовПериод, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			НачисленияРаботниковОрганизации.НомерСтроки КАК НовНомерСтроки, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			&парамНачало КАК Период,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ КАК ОсновноеНачисление,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ВЫБОР
		|							КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|								ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|							ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|						КОНЕЦ
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|			КОНЕЦ КАК ВидРасчета,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|			КОНЕЦ КАК Действие,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|			КОНЕЦ КАК Показатель1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|			КОНЕЦ КАК Показатель2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|			КОНЕЦ КАК Показатель3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|			КОНЕЦ КАК Показатель4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|			КОНЕЦ КАК Показатель5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|			КОНЕЦ КАК Показатель6,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта1
		|			КОНЕЦ КАК Валюта1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта2
		|			КОНЕЦ КАК Валюта2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта3
		|			КОНЕЦ КАК Валюта3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта4
		|			КОНЕЦ КАК Валюта4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта5
		|			КОНЕЦ КАК Валюта5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта6
		|			КОНЕЦ КАК Валюта6,
		|			НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд1
		|			КОНЕЦ КАК ТарифныйРазряд1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд2
		|			КОНЕЦ КАК ТарифныйРазряд2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд3
		|			КОНЕЦ КАК ТарифныйРазряд3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд4
		|			КОНЕЦ КАК ТарифныйРазряд4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд5
		|			КОНЕЦ КАК ТарифныйРазряд5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд6
		|			КОНЕЦ КАК ТарифныйРазряд6,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодЗавершения,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель1ВВалютеЗавершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1ВВалюте
		|			КОНЕЦ КАК Показатель1ВВалюте
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|					&парамНачало,
		|					ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|						И Сотрудник В
		|							(ВЫБРАТЬ
		|								Работники.Сотрудник
		|							ИЗ
		|								ВТСписокРаботников КАК Работники)) КАК НачисленияРаботниковОрганизации
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|							И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|					ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|			И НЕ ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|								И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|										ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|									ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|								КОНЕЦ
		|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|					КОНЕЦ В (&ВидРасчетаПособие)
		//О.Т. Аверсон 14.06.2018 № 
		|			И НЕ ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|								И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|										ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета
		|									ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения.СпособРасчета
		|								КОНЕЦ
		|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета
		|					КОНЕЦ В (&СпособыРасчетаПособие)
		//О.Т. Аверсон 14.06.2018 № 
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НачисленияРаботниковОрганизации.Период КАК НовПериод, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			НачисленияРаботниковОрганизации.НомерСтроки КАК НовНомерСтроки, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			НачисленияРаботниковОрганизации.Период,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			НачисленияРаботниковОрганизации.ВидРасчета,
		|			НачисленияРаботниковОрганизации.Действие,
		|			НачисленияРаботниковОрганизации.Показатель1,
		|			НачисленияРаботниковОрганизации.Показатель2,
		|			НачисленияРаботниковОрганизации.Показатель3,
		|			НачисленияРаботниковОрганизации.Показатель4,
		|			НачисленияРаботниковОрганизации.Показатель5,
		|			НачисленияРаботниковОрганизации.Показатель6,
		|			НачисленияРаботниковОрганизации.Валюта1,
		|			НачисленияРаботниковОрганизации.Валюта2,
		|			НачисленияРаботниковОрганизации.Валюта3,
		|			НачисленияРаботниковОрганизации.Валюта4,
		|			НачисленияРаботниковОрганизации.Валюта5,
		|			НачисленияРаботниковОрганизации.Валюта6,
		|			НачисленияРаботниковОрганизации.Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд1,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд2,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд3,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд4,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд5,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд6,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде,
		//Аверсон ЕАЕ 27.11.2020
		//|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|           ДОБАВИТЬКДАТЕ(НачисленияРаботниковОрганизации.ПериодЗавершения, ДЕНЬ, -1),
		//Аверсон
		|			НачисленияРаботниковОрганизации.Показатель1ВВалюте
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ТаблицаДвиженийРаботников
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|		ГДЕ
		|			НачисленияРаботниковОрганизации.Период > &парамНачало
		|			И НачисленияРаботниковОрганизации.Период <= &парамКонец
		|			И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|			И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НачисленияРаботниковОрганизации.Период КАК НовПериод, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			НачисленияРаботниковОрганизации.НомерСтроки КАК НовНомерСтроки, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			НачисленияРаботниковОрганизации.ПериодЗавершения,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|					ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|			КОНЕЦ,
		|			НачисленияРаботниковОрганизации.ДействиеЗавершения,
		|			НачисленияРаботниковОрганизации.Показатель1Завершения,
		|			НачисленияРаботниковОрганизации.Показатель2Завершения,
		|			НачисленияРаботниковОрганизации.Показатель3Завершения,
		|			НачисленияРаботниковОрганизации.Показатель4Завершения,
		|			НачисленияРаботниковОрганизации.Показатель5Завершения,
		|			НачисленияРаботниковОрганизации.Показатель6Завершения,
		|			НачисленияРаботниковОрганизации.Валюта1Завершения,
		|			НачисленияРаботниковОрганизации.Валюта2Завершения,
		|			НачисленияРаботниковОрганизации.Валюта3Завершения,
		|			НачисленияРаботниковОрганизации.Валюта4Завершения,
		|			НачисленияРаботниковОрганизации.Валюта5Завершения,
		|			НачисленияРаботниковОрганизации.Валюта6Завершения,
		|			НачисленияРаботниковОрганизации.Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд1Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд2Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд3Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд4Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд5Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд6Завершения,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде,
		|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|			НачисленияРаботниковОрганизации.Показатель1ВВалютеЗавершения
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ТаблицаДвиженийРаботников
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковПроверка
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = НачисленияРаботниковПроверка.Сотрудник
		|					И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение = НачисленияРаботниковПроверка.ВидРасчетаИзмерение
		|					И НачисленияРаботниковОрганизации.ДокументОснование = НачисленияРаботниковПроверка.ДокументОснование
		|					И (НачисленияРаботниковПроверка.Период > НачисленияРаботниковОрганизации.Период)
		|					И (НачисленияРаботниковПроверка.Период <= НачисленияРаботниковОрганизации.ПериодЗавершения)
		|		ГДЕ
		|			НачисленияРаботниковОрганизации.ПериодЗавершения >= &парамНачало
		|			И НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамКонец
		|			И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|			И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|			И НачисленияРаботниковПроверка.Сотрудник ЕСТЬ NULL 
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизаций.Период КАК НовПериод, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			ПлановыеНачисленияРаботниковОрганизаций.НомерСтроки КАК НовНомерСтроки, //Аверсон 16.06.2022 КВВ СВФР-009202
		|			&парамНачало,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ВЫБОР
		|							КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|								ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|							ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
		|						КОНЕЦ
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель6
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта6
		|			КОНЕЦ,
		|			ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
		|			ПлановыеНачисленияРаботниковОрганизаций.ДатаНачалаСобытия,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6
		|			КОНЕЦ,
		|			ПлановыеНачисленияРаботниковОрганизаций.ИспользуетсяВНаряде,
		|			ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения, МЕСЯЦ) = &парамНачало
		|					ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
		|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель1ВВалютеЗавершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель1ВВалюте
		|			КОНЕЦ
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|			И (ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
		|							КОНЕЦ
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|				КОНЕЦ В (&ВидРасчетаПособие)
		//О.Т. Аверсон 14.06.2018 № 
		|			Или ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета
		|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения.СпособРасчета
		|							КОНЕЦ
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета
		|				КОНЕЦ В (&СпособыРасчетаПособие))
		//О.Т. Аверсон 14.06.2018 № 
		
		|			И ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В
		|					(ВЫБРАТЬ
		|						Работники.Сотрудник
		|					ИЗ
		|						ВТСписокРаботников КАК Работники)
		|			И НЕ ПлановыеНачисленияРаботниковОрганизаций.Период > &парамНачало) КАК НачисленияРаботниковОрганизации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки1
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд1 = ТарифныеСтавки1.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки2
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд2 = ТарифныеСтавки2.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки3
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд3 = ТарифныеСтавки3.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки4
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд4 = ТарифныеСтавки4.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки5
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд5 = ТарифныеСтавки5.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки6
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд6 = ТарифныеСтавки6.ТарифныйРазряд
		|		ПО (Работники.Подходит)
		|			И Работники.Сотрудник = НачисленияРаботниковОрганизации.Сотрудник
		|ГДЕ
		|	НачисленияРаботниковОрганизации.ВидРасчета В(&ВидРасчетаПособия)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";	
		
		
		Запрос.Выполнить();
		
		//получим все невводимые показатели
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|	СписокНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ВводимыеПоказатели.Показатель КАК Показатель,
		|	ВЫБОР
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 1
		|			ТОГДА СписокНачислений.Показатель1
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 2
		|			ТОГДА СписокНачислений.Показатель2
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 3
		|			ТОГДА СписокНачислений.Показатель3
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 4
		|			ТОГДА СписокНачислений.Показатель4
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 5
		|			ТОГДА СписокНачислений.Показатель5
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 6
		|			ТОГДА СписокНачислений.Показатель6
		|	КОНЕЦ КАК ЗначениеПоказателя
		|ПОМЕСТИТЬ ВТЗначенияВводимыхКадровыхПоказателей
		|ИЗ
		|	ВТРаботникиИНачисления КАК СписокНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВводимыеВПлановыхНачисленияхПоказатели КАК ВводимыеПоказатели
		|		ПО СписокНачислений.ВидРасчета = ВводимыеПоказатели.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Выполнить();
		
		//КонецЕсли;
		
		// таблица Показатели
		//   видам начислений приписываются введенные пользователями для каждого сотрудника значения показателей 
		// 
		// Поля:
		//   ВидРасчета
		//   Сотрудник
		//   Показатель1,2,...,6 - значения соответствующих показателей
		//   Валюта
		//
		
		
		//Если ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНачислений Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей1.Сотрудник
		|		КОГДА ЗначенияПоказателей2.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей2.Сотрудник
		|		КОГДА ЗначенияПоказателей3.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей3.Сотрудник
		|		КОГДА ЗначенияПоказателей4.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей4.Сотрудник		
		|		КОГДА ЗначенияПоказателей5.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей5.Сотрудник		
		|		КОГДА ЗначенияПоказателей6.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей6.Сотрудник
		|	КОНЕЦ КАК Сотрудник,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей1.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей2.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей2.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей3.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей3.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей4.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей4.ПодразделениеОрганизации		
		|		КОГДА ЗначенияПоказателей5.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей5.ПодразделениеОрганизации		
		|		КОГДА ЗначенияПоказателей6.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей6.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПодразделениеОрганизации,			
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей1.Валюта
		|		КОГДА ЗначенияПоказателей2.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей2.Валюта
		|		КОГДА ЗначенияПоказателей3.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей3.Валюта
		|		КОГДА ЗначенияПоказателей4.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей4.Валюта		
		|		КОГДА ЗначенияПоказателей5.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей5.Валюта		
		|		КОГДА ЗначенияПоказателей6.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей6.Валюта
		|	КОНЕЦ КАК Валюта		
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ
		|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели1
		|			ПО Показатели.Ссылка = Показатели1.Ссылка
		|				И (Показатели1.НомерСтроки = 1)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели2
		|			ПО Показатели.Ссылка = Показатели2.Ссылка
		|				И (Показатели2.НомерСтроки = 2)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели3
		|			ПО Показатели.Ссылка = Показатели3.Ссылка
		|				И (Показатели3.НомерСтроки = 3)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели4
		|			ПО Показатели.Ссылка = Показатели4.Ссылка
		|				И (Показатели4.НомерСтроки = 4)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели5
		|			ПО Показатели.Ссылка = Показатели5.Ссылка
		|				И (Показатели5.НомерСтроки = 5)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели6
		|			ПО Показатели.Ссылка = Показатели6.Ссылка
		|				И (Показатели6.НомерСтроки = 6)
		|	) КАК ПоказателиВидовРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|		ПО ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|		ПО ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|		ПО ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|		ПО ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|		ПО ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|		ПО ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета";
		Запрос.Выполнить();
		//КонецЕсли;
		
		// АВТОЗАПОЛНЕНИЕ ТЧ "Начисления", "ДополнительныеНачисления" и "ДоговорыНаВыполнениеРабот"
		//Если ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.ПолныйРасчет 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНачислений 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНДФЛ 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетПенсионногоФонда Тогда
		
		// таблица ОсновныеНачисления  
		//	    выборка сведений об уже выполненных начислениях за отработанное время - для выбрасывания 
		// 		ранее "обслуженных" работников
		//	Поля:
		//		Сотрудник,
		//		ПодразделениеОрганизации
		//
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ТаблицаДвиженийРаботников
		|		ПО ОсновныеНачисления.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|ГДЕ
		|	ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ПериодДействияКонец <= &парамКонец
		|	И ОсновныеНачисления.ПериодДействияНачало >= &парамНачало
		|	И ОсновныеНачисления.Организация = &парамГоловнаяОрганизация
		|	И (ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		|				И ОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
		|			ИЛИ ОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
		|	И (НЕ ОсновныеНачисления.Сторно)
		|	И ОсновныеНачисления.Регистратор <> &парамРегистратор
		|	И ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";		
		Запрос.Выполнить();
		
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И (СводныеИндивидуальныеГрафики.Месяц = &парамПериодРегистрации)
		|ГДЕ
		|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
		|ПОМЕСТИТЬ ВТНормаВремениПоСводнымИндивидуальнымГрафикам
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И (СводныеИндивидуальныеГрафики.Месяц = &парамПериодРегистрации)
		|ГДЕ
		|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// НормаВремениПоЕжедневнымИндивидуальнымГрафикам
		//		Таблица сотрудников и нормы времени в часах, введенной индивидуальными графиками
		// 
		//	Поля:
		//		Сотрудник,
		//		ЧасовЗаМесяц - суммируем все часы рабочего времени
		// 
		// Описание:
		//
		//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени,	
		//	введенные доками ВводИндивидуальныхГрафиков, т.е. по строкам с выставленным флажком План
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ПОМЕСТИТЬ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// НормаВремениПоОбщимГрафикам
		//		Таблица сотрудников и нормы времени в часах по общим графикам
		// 
		//	Поля:
		//		Сотрудник,
		//		ЧасовЗаМесяц - суммируем все часы рабочего времени
		// 
		// Описание:
		//
		//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени для общих графиков
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СписокРаботников.Сотрудник КАК Сотрудник,
		|		ВЫБОР
		|			КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
		|					И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
		|			ИНАЧЕ СписокРаботников.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы
		|	ИЗ
		|		ВТДвиженияРаботников КАК СписокРаботников) КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник,
		|	СписокРаботников.ГрафикРаботы";
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц,
		|	СписокРаботников.ПодразделениеОрганизации
		|ПОМЕСТИТЬ ВТНормаВремениПоОбщимГрафикам
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СписокРаботников.Сотрудник КАК Сотрудник,
		|		ВЫБОР
		|			КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
		|					И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
		|			ИНАЧЕ СписокРаботников.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|		СписокРаботников.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|	ИЗ
		|		ВТДвиженияРаботников КАК СписокРаботников) КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СписокРаботников.ПодразделениеОрганизации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСтажа.Сотрудник КАК Сотрудник,
		|	ДатыСтажа.Физлицо,
		|	ДатыСтажа.ПериодРаботники,
		|	ДатыСтажа.ПериодСеверногоСтажа КАК ДатаРегистрацииСеверногоСтажа,
		|	СведенияОСтажеРаботыНаСевере.ПорядокНачисленияСеверныхНадбавок,
		|	СведенияОСтажеРаботыНаСевере.НачальныйПроцентСевернойНадбавки,
		|	СведенияОСтажеРаботыНаСевере.СеверныйСтажМесяцев,
		|	СведенияОСтажеРаботыНаСевере.СеверныйСтажДней
		|ПОМЕСТИТЬ ВТДанныеОСеверномСтаже
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокНачислений.Сотрудник КАК Сотрудник,
		|		СписокНачислений.Физлицо КАК Физлицо,
		|		СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|		МАКСИМУМ(СведенияОСтажеРаботыНаСевере.Период) КАК ПериодСеверногоСтажа
		|	ИЗ
		|		ВТРаботникиИНачисления КАК СписокНачислений
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтажеРаботыНаСевере КАК СведенияОСтажеРаботыНаСевере
		|			ПО СписокНачислений.Физлицо = СведенияОСтажеРаботыНаСевере.ФизЛицо
		|				И СписокНачислений.ПериодРаботники >= СведенияОСтажеРаботыНаСевере.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписокНачислений.Сотрудник,
		|		СписокНачислений.Физлицо,
		|		СписокНачислений.ПериодРаботники) КАК ДатыСтажа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтажеРаботыНаСевере КАК СведенияОСтажеРаботыНаСевере
		|		ПО ДатыСтажа.Физлицо = СведенияОСтажеРаботыНаСевере.ФизЛицо
		|			И ДатыСтажа.ПериодСеверногоСтажа = СведенияОСтажеРаботыНаСевере.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		
		//Островская Татьяна 22.01.2014 № 17057
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.СотрудникНаименование,
		|	СписокНачислений.Физлицо,
		|	СписокНачислений.ПодразделениеОрганизации,
		|	СписокНачислений.Подходит,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники,
		|	СписокНачислений.ПериодНачисления,
		|	СписокНачислений.ОсновноеНачисление,
		|	СписокНачислений.ВидРасчета,
		|	СписокНачислений.ВидРасчетаНаименование,
		|	СписокНачислений.ВидРасчетаКоэффициентСтажа,
		|	СписокНачислений.ВидРасчетаВидСтажа,
		|	СписокНачислений.ВидРасчетаТребуетВводаТарифногоРазряда,
		|	СписокНачислений.СпособРасчета,
		|	СписокНачислений.ВидВремени,
		|	СписокНачислений.Действие,
		|	СписокНачислений.КодВычета,
		|	СписокНачислений.ДатаНачалаСобытия,
		|	СписокНачислений.ГрафикРаботы,
		|	СписокНачислений.СуммированныйУчетРабочегоВремени,
		|	СписокНачислений.ДлительностьРабочейНедели,
		|	СписокНачислений.ВидГрафика,
		|	СписокНачислений.Валюта1 КАК Валюта,
		|	СписокНачислений.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА 1
		|		ИНАЧЕ Валюты1.Курс
		|	КОНЕЦ КАК КурсВалюты,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель1
		|		КОГДА (СписокНачислений.Показатель1 = 0
		|				ИЛИ СписокНачислений.Показатель1 ЕСТЬ NULL )
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель1
		|		КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель1
		|		ИНАЧЕ СписокНачислений.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 2)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель2
		|		КОГДА (СписокНачислений.Показатель2 = 0
		|				ИЛИ СписокНачислений.Показатель2 ЕСТЬ NULL )
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель2
		|		КОГДА СписокНачислений.Валюта2 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель2
		|		ИНАЧЕ СписокНачислений.Показатель2 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 3)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель3
		|		КОГДА СписокНачислений.Показатель3 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель3
		|		КОГДА СписокНачислений.Валюта3 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель3
		|		ИНАЧЕ СписокНачислений.Показатель3 * ЕСТЬNULL(Валюты3.Курс / Валюты3.Кратность, 0)
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 4)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель4
		|		КОГДА СписокНачислений.Показатель4 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель4
		|		КОГДА СписокНачислений.Валюта4 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель4
		|		ИНАЧЕ СписокНачислений.Показатель4 * ЕСТЬNULL(Валюты4.Курс / Валюты4.Кратность, 0)
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 5)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель5
		|		КОГДА СписокНачислений.Показатель5 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель5
		|		КОГДА СписокНачислений.Валюта5 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель5
		|		ИНАЧЕ СписокНачислений.Показатель5 * ЕСТЬNULL(Валюты5.Курс / Валюты5.Кратность, 0)
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 6)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель6
		|		КОГДА СписокНачислений.Показатель6 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель6
		|		КОГДА СписокНачислений.Валюта6 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель6
		|		ИНАЧЕ СписокНачислений.Показатель6 * ЕСТЬNULL(Валюты6.Курс / Валюты6.Кратность, 0)
		|	КОНЕЦ КАК Показатель6,
		|	ПоказательТарифнойСтавки.Показатель КАК ВидТарифнойСтавки,
		|	ВЫБОР
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 1
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель1
		|					КОГДА СписокНачислений.Показатель1 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель1
		|					КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель1
		|					ИНАЧЕ СписокНачислений.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 2
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель2
		|					КОГДА СписокНачислений.Показатель2 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель2
		|					КОГДА СписокНачислений.Валюта2 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель2
		|					ИНАЧЕ СписокНачислений.Показатель2 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 3
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель3
		|					КОГДА СписокНачислений.Показатель3 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель3
		|					КОГДА СписокНачислений.Валюта3 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель3
		|					ИНАЧЕ СписокНачислений.Показатель3 * ЕСТЬNULL(Валюты3.Курс / Валюты3.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 4
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель4
		|					КОГДА СписокНачислений.Показатель4 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель4
		|					КОГДА СписокНачислений.Валюта4 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель4
		|					ИНАЧЕ СписокНачислений.Показатель4 * ЕСТЬNULL(Валюты4.Курс / Валюты4.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 5
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель5
		|					КОГДА СписокНачислений.Показатель5 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель5
		|					КОГДА СписокНачислений.Валюта5 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель5
		|					ИНАЧЕ СписокНачислений.Показатель5 * ЕСТЬNULL(Валюты5.Курс / Валюты5.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 6
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель6
		|					КОГДА СписокНачислений.Показатель6 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель6
		|					КОГДА СписокНачислений.Валюта6 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель6
		|					ИНАЧЕ СписокНачислений.Показатель6 * ЕСТЬNULL(Валюты6.Курс / Валюты6.Кратность, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОкладТариф,
		|	СписокНачислений.ТабНомер,
		|	СписокНачислений.ПериодЗавершения,
		|	СписокНачислений.Показатель1ВВалюте,
		|	СписокНачислений.ПериодНомерСтроки //Аверсон 16.06.2022 КВВ СВФР-009202
		|ПОМЕСТИТЬ ВТРаботникиИНачисленияПоСхемамМотивации
		|ИЗ
		|	ВТРаботникиИНачисления КАК СписокНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиВведенныеПриРасчете
		|		ПО СписокНачислений.ВидРасчета = ПоказателиВведенныеПриРасчете.ВидРасчета
		|			И (СписокНачислений.Сотрудник = ПоказателиВведенныеПриРасчете.Сотрудник
		|				ИЛИ СписокНачислений.ПодразделениеОрганизации = ПоказателиВведенныеПриРасчете.ПодразделениеОрганизации)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			НеВводимыеПоказатели.Ссылка КАК Ссылка,
		|			НеВводимыеПоказатели.НомерСтроки КАК НомерСтроки,
		|			НеВводимыеПоказатели.Показатель КАК Показатель,
		|			НеВводимыеПоказатели.ПоказательВозможностьИзменения КАК ПоказательВозможностьИзменения,
		|			НеВводимыеПоказатели.ЭтоТарифнаяСтавка КАК ЭтоТарифнаяСтавка,
		|			СУММА(ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя) КАК ЗначениеПоказателя,
		|			ЗначенияВводимыхКадровыхПоказателей.Сотрудник КАК Сотрудник,
		|			ЗначенияВводимыхКадровыхПоказателей.Период КАК Период,
		|			ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники КАК ПериодРаботники
		|		ИЗ
		|			ВТНеЗапрашиваемыеПриКадровыхПеремещениях КАК НеВводимыеПоказатели
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияВводимыхКадровыхПоказателей КАК ЗначенияВводимыхКадровыхПоказателей
		|				ПО НеВводимыеПоказатели.Показатель = ЗначенияВводимыхКадровыхПоказателей.Показатель
		|		ГДЕ
		|			ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя <> 0
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НеВводимыеПоказатели.Ссылка,
		|			НеВводимыеПоказатели.НомерСтроки,
		|			НеВводимыеПоказатели.Показатель,
		|			НеВводимыеПоказатели.ПоказательВозможностьИзменения,
		|			НеВводимыеПоказатели.ЭтоТарифнаяСтавка,
		|			ЗначенияВводимыхКадровыхПоказателей.Сотрудник,
		|			ЗначенияВводимыхКадровыхПоказателей.Период,
		|			ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники) КАК ЗначенияВводимыхКадровыхПоказателей
		|		ПО СписокНачислений.Сотрудник = ЗначенияВводимыхКадровыхПоказателей.Сотрудник
		|			И (КОНЕЦПЕРИОДА(СписокНачислений.Период, МЕСЯЦ) = КОНЕЦПЕРИОДА(ЗначенияВводимыхКадровыхПоказателей.Период, МЕСЯЦ))
		|			И СписокНачислений.ПериодРаботники = ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники
		|			И СписокНачислений.ВидРасчета = ЗначенияВводимыхКадровыхПоказателей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты1
		|		ПО (Валюты1.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта1 = Валюты1.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты2
		|		ПО (Валюты2.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта2 = Валюты2.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты3
		|		ПО (Валюты3.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта3 = Валюты3.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты4
		|		ПО (Валюты4.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта4 = Валюты4.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты5
		|		ПО (Валюты5.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта5 = Валюты5.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты6
		|		ПО (Валюты6.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта6 = Валюты6.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВводимыеВПлановыхНачисленияхПоказатели КАК ПоказательТарифнойСтавки
		|		ПО СписокНачислений.ВидРасчета = ПоказательТарифнойСтавки.Ссылка
		|			И (ПоказательТарифнойСтавки.Показатель В (ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)))
		|ГДЕ
		|	ВЫБОР
		|			КОГДА СписокНачислений.Подходит
		|				ТОГДА НЕ СписокНачислений.ВидРасчета ЕСТЬ NULL 
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		//Островская Татьяна 22.01.2014 № 17057
		//Основной текст запроса
		//Островская Татьяна 24.07.2013 № 16643(*12)
		//Островская Татьяна 22.01.2014 № 17057
		ОсновнойТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.СотрудникНаименование КАК СотрудникНаименование,
		|	СписокНачислений.Физлицо КАК Физлицо,
		|	СписокНачислений.ПодразделениеОрганизации,
		|	СписокНачислений.Подходит,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|	СписокНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокНачислений.ОсновноеНачисление КАК ОсновноеНачисление,
		|	СписокНачислений.ВидРасчета КАК ВидРасчета,
		|	СписокНачислений.ВидРасчетаНаименование,
		|	ЕСТЬNULL(СписокНачислений.ВидРасчетаТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
		|	СписокНачислений.СпособРасчета,
		|	СписокНачислений.ВидВремени,
		|	СписокНачислений.Действие,
		|	СписокНачислений.КодВычета,
		|	СписокНачислений.ДатаНачалаСобытия,
		|	СписокНачислений.ГрафикРаботы,
		|	СписокНачислений.СуммированныйУчетРабочегоВремени,
		|	СписокНачислений.Валюта,
		|	СписокНачислений.КурсВалюты,
		|	СписокНачислений.ВидТарифнойСтавки,
		|	СписокНачислений.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	ВЫБОР
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ТОГДА СписокНачислений.ОкладТариф
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЕСТЬNULL(ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую, ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)) = ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) = 0
		|										ТОГДА 0
		|									КОГДА СписокНачислений.ДлительностьРабочейНедели = 0
		|										ТОГДА 0
		|									ИНАЧЕ СписокНачислений.ОкладТариф / (СписокНачислений.ДлительностьРабочейНедели / 5 * (ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) + ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) - ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) * 12
		|								КОНЕЦ
		|						КОГДА ВЫБОР
		|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
		|							КОНЕЦ = 0
		|							ТОГДА 0
		|						ИНАЧЕ СписокНачислений.ОкладТариф / ВЫБОР
		|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
		|							КОНЕЦ
		|					КОНЕЦ КАК ЧИСЛО(15, 3))
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА СписокНачислений.ДлительностьРабочейНедели = 0
		|							ТОГДА 0
		|						ИНАЧЕ СписокНачислений.ОкладТариф / СписокНачислений.ДлительностьРабочейНедели * ВЫБОР
		|								КОГДА СписокНачислений.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
		|									ТОГДА 6
		|								ИНАЧЕ 5
		|							КОНЕЦ
		|					КОНЕЦ КАК ЧИСЛО(15, 3))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧасоваяТарифнаяСтавка,
		|	СписокНачислений.Показатель1,
		|	СписокНачислений.Показатель2,
		|	СписокНачислений.Показатель3,
		|	СписокНачислений.Показатель4,
		|	СписокНачислений.Показатель5,
		|	СписокНачислений.Показатель6,
		|	ВЫБОР
		|		КОГДА &ЭтоПерерасчет
		|			ТОГДА ЛОЖЬ
		|		КОГДА ОсновныеНачисления.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УжеПроведен,
		|	НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник КАК Сотрудник1,
		|	НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц,
		|	НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник КАК Сотрудник2,
		|	НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц КАК ЧасовЗаМесяц1,
		|	НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц КАК ЧасовЗаМесяц2,
		|	СписокНачислений.ТабНомер КАК ТабНомер,
		|	СписокНачислений.ПериодЗавершения,
		|	СписокНачислений.Показатель1ВВалюте КАК ПоказательВВалюте,
		|	СписокНачислений.ПериодНомерСтроки КАК ПериодНомерСтроки //Аверсон 16.06.2022 КВВ СВФР-009202
		|ИЗ
		|	ВТРаботникиИНачисленияПоСхемамМотивации КАК СписокНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВЫБОР
		|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЧислоРабочихДней,
		|			СУММА(ВЫБОР
		|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЧислоПредпраздничныхДней
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.Год = &Год) КАК ДанныеПроизводственногоКалендаря
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоСводнымИндивидуальнымГрафикам КАК НормаВремениПоСводнымИндивидуальнымГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам КАК НормаВремениПоЕжедневнымИндивидуальнымГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоОбщимГрафикам КАК НормаВремениПоОбщимГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоОбщимГрафикам.Сотрудник
		|		И СписокНачислений.ПодразделениеОрганизации = НормаВремениПоОбщимГрафикам.ПодразделениеОрганизации //О.Т. Аверсон 14.06.2018 №
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеНачисления КАК ОсновныеНачисления
		|		ПО СписокНачислений.Сотрудник = ОсновныеНачисления.Сотрудник
		|			И СписокНачислений.ПодразделениеОрганизации = ОсновныеНачисления.ПодразделениеОрганизации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТабНомер,
		|	СотрудникНаименование,
		|	Сотрудник,
		|	ПериодРаботники,
		|	ПериодНачисления,
		|	ОсновноеНачисление УБЫВ,
		|	ВидРасчета";
		//Островская Татьяна 22.01.2014 № 17057
		Запрос.УстановитьПараметр("Месяцы",?(Организация.ИНН = "100765738",12,1));
		//Островская Татьяна 24.07.2013 № 16(*12)
		Запрос.Текст = ОсновнойТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить(); 
		НачисленияВыборка = РезультатЗапроса.Выбрать();
		
		//Аверсон 16.06.2022 КВВ СВФР-009202 (
		ЕстьКолонкаПериодНомерСтроки = Ложь;
		ТЗПроверки = Запрос.Выполнить().Выгрузить();
		КолонкаТЗНачисления = ТЗПроверки.Колонки.Найти("ПериодНомерСтроки");
		Если КолонкаТЗНачисления <> Неопределено Тогда
			ЕстьКолонкаПериодНомерСтроки = Истина;			
		КонецЕсли;
		//Аверсон 16.06.2022 КВВ СВФР-009202 )
		
		//Если не ТЧДоговора Тогда 			
		ТЗНачисления = СформироватьТаблицуНачислений(НачисленияВыборка, ОкончаниеПериодаЗаполнения, РезультатЗапроса.Выгрузить(),,,ЕстьКолонкаПериодНомерСтроки); //Аверсон 16.06.2022 КВВ СВФР-009202 (ЕстьКолонкаПериодНомерСтроки)
		//иначе
		//	ТЗНачисления = Новый ТаблицаЗначений;//О.Т. Аверсон 16.03.2018 № 1731
		//КонецЕсли;
		
		
		//Аверсон 31.03.2022 КВВ СВФР-008870 (
		//Для Каждого стр из ТЗНачисления Цикл 
		//	СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,стр);
		//КонецЦикла;  
		
		//ТЗНачисления.Свернуть("ВидВремени,СпособРасчета,СуммированныйУчетРабочегоВремени,ГрафикРаботы,ПодразделениеОрганизации,ДатаОкончания,ДатаНачалаСобытия,ДатаНачала,Размер,Показатель6,Показатель5,Показатель4,Показатель3,Показатель2,Показатель1,Основное,КодВычета,ВидРасчета,Физлицо,ТабНомер,Сотрудник","ОплаченоДней,ОплаченоДнейЧасов,ОтработаноДней,ОтработаноЧасов");
		ТЗНачисления.Свернуть("ПериодНомерСтроки,ВидВремени,СпособРасчета,СуммированныйУчетРабочегоВремени,ГрафикРаботы,ПодразделениеОрганизации,ДатаОкончания,ДатаНачалаСобытия,ДатаНачала,Размер,Показатель6,Показатель5,Показатель4,Показатель3,Показатель2,Показатель1,Основное,КодВычета,ВидРасчета,Физлицо,ТабНомер,Сотрудник","ОплаченоДней,ОплаченоДнейЧасов,ОтработаноДней,ОтработаноЧасов"); //Аверсон 16.06.2022 КВВ СВФР-009202
		
		ТЗНачисления.Сортировать("Сотрудник,ВидРасчета,ДатаНачала");
		
		ТЗНачисленияКопия = ТЗНачисления.Скопировать();
		
		//Аверсон 17.06.2022 КВВ СВФР-009202 (
		//Для Каждого СтрТЗНачисленияКопия ИЗ ТЗНачисленияКопия Цикл
		//	
		//	УжеЕстьВТЧ = Ложь;
		//	ТЧДока = ОсновныеНачисления.Выгрузить();    
		//	ОтборТЧДока = Новый Структура;
		//	ОтборТЧДока.Вставить("Сотрудник", СтрТЗНачисленияКопия.Сотрудник);
		//	ОтборТЧДока.Вставить("ВидРасчета", СтрТЗНачисленияКопия.ВидРасчета);
		//	СтрокиОтборТЧДока = ТЧДока.НайтиСтроки(ОтборТЧДока);
		//	Если СтрокиОтборТЧДока.Количество() > 0 Тогда
		//		Для Каждого СтрСтрокиОтборТЧДока ИЗ СтрокиОтборТЧДока Цикл
		//			Если (НачалоДня(СтрСтрокиОтборТЧДока.ДатаНачала) = НачалоДня(СтрТЗНачисленияКопия.ДатаНачала)
		//				ИЛИ НачалоДня(СтрСтрокиОтборТЧДока.ДатаОкончания) = НачалоДня(СтрТЗНачисленияКопия.ДатаОкончания)) 
		//				И СтрТЗНачисленияКопия.ПериодНомерСтроки = СтрСтрокиОтборТЧДока.ПериодНомерСтроки Тогда  //Аверсон 16.06.2022 КВВ СВФР-009202
		//				УжеЕстьВТЧ = Истина;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;
		//	КонецЕсли;
		//	
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("Сотрудник", СтрТЗНачисленияКопия.Сотрудник);
		//	Отбор.Вставить("ВидРасчета", СтрТЗНачисленияКопия.ВидРасчета);
		//	
		//	СтрокиОтбор = ТЗНачисления.НайтиСтроки(Отбор);
		//	Если СтрокиОтбор.Количество() = 1 Тогда
		//		СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		//		ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,СтрТЗНачисленияКопия);
		//	ИначеЕсли СтрокиОтбор.Количество() = 2 Тогда
		//		//Если (СтрокиОтбор[0].ДатаОкончания + 1 = СтрокиОтбор[1].ДатаНачала) И НЕ УжеЕстьВТЧ Тогда
		//		Если (СтрокиОтбор[0].ДатаОкончания + 1 = СтрокиОтбор[1].ДатаНачала) ИЛИ НЕ УжеЕстьВТЧ Тогда //Аверсон 16.06.2022 КВВ СВФР-009202
		//			СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		//			ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,СтрТЗНачисленияКопия);
		//			СтрОсновныеНачисления.ДатаОкончания = СтрокиОтбор[1].ДатаОкончания;
		//		КонецЕсли;
		//	Иначе
		//		СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		//		ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,СтрТЗНачисленияКопия);
		//	КонецЕсли;
		//КонецЦикла;
		//Аверсон 31.03.2022 КВВ СВФР-008870 )
		
		ТЗНачисленияКопия2 = ТЗНачисления.Скопировать();
		ТЗНачисленияКопия2.Свернуть("ПериодНомерСтроки,ВидРасчета,Сотрудник");
		
		Для Каждого Стр2 ИЗ ТЗНачисленияКопия2 Цикл
			Отбор1 = Новый Структура;
			Отбор1.Вставить("Сотрудник", Стр2.Сотрудник);
			Отбор1.Вставить("ВидРасчета", Стр2.ВидРасчета);
			Отбор1.Вставить("ПериодНомерСтроки", Стр2.ПериодНомерСтроки);
			СтрокиОтбор1 = ТЗНачисления.НайтиСтроки(Отбор1);
			Если СтрокиОтбор1.Количество() > 0 Тогда
				ДатаН = СтрокиОтбор1[0].ДатаНачала;
				ДатаК = СтрокиОтбор1[0].ДатаОкончания;
				Для Каждого Стр1 ИЗ СтрокиОтбор1 Цикл
					ДатаН = Мин(ДатаН,Стр1.ДатаНачала);
					ДатаК = Макс(ДатаК,Стр1.ДатаОкончания);
					
				КонецЦикла;
				
				СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,СтрокиОтбор1[0]);
				СтрОсновныеНачисления.ДатаНачала = ДатаН;
				СтрОсновныеНачисления.ДатаОкончания = ДатаК;
				
			КонецЕсли;
		КонецЦикла;
		//Аверсон 17.06.2022 КВВ СВФР-009202 )
		
		
		// Очистим необходимость перезаполнения по заполненным работникам
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокРаботников.Сотрудник
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников";
		ПроведениеРасчетов.УдалитьСведенияОПерезаполненииДокумента(Ссылка,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник"));
		
		//КонецЕсли;
		
	иначе    
		
		// Установим параметры запроса
		Запрос.УстановитьПараметр("парамПериодРегистрации" , ПериодРегистрации);
		Запрос.УстановитьПараметр("парамНачало" , НачалоПериодаЗаполнения);
		Запрос.УстановитьПараметр("парамКонец" , КонецДня(ОкончаниеПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамОрганизация" , Организация);
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
		Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("парамРегистратор" , Ссылка);
		Запрос.УстановитьПараметр("парамНачалоМесяца" , НачалоМесяца(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамДатаВалютногоУчета" , НачалоМесяца(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("парамВалютаРегламентУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("парамМассивСпособовРасчетовБезВалюты" , ПроведениеРасчетов.ПолучитьСписокСпособовРасчетаНеТребующихУказанияВалюты());
		Запрос.УстановитьПараметр("Год",Год(НачалоПериодаЗаполнения));
		Запрос.УстановитьПараметр("ЭтоПерерасчет", Ложь);
		ВидыРасчетаПособия = Новый СписокЗначений;
		Для Каждого стр из Справочники.ГруппыРасчетов.ДетскиеПособия.Основные Цикл 
			ВидыРасчетаПособия.Добавить(стр.ВидРасчета);
		КонецЦикла;  		
		Запрос.УстановитьПараметр("ВидРасчетаПособия", ВидыРасчетаПособия);
		
		
		
		//ТаблицаДвиженийРаботниковТекст
		//Описание:
		//	Выбирает список работников, отвечающих условиям отбора, числящихся на начало месяца и их движения за месяц.
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&парамНачало КАК Период,
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ИСТИНА КАК Подходит,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПодразделениеОрганизации,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
		|	КОНЕЦ КАК ГрафикРаботы,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
		|		ИНАЧЕ РаботникиОрганизации.Должность
		|	КОНЕЦ КАК Должность,
		|	РаботникиОрганизации.Сотрудник.Код КАК ТабНомер
		|ПОМЕСТИТЬ ВТДвиженияРаботников
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&парамНачало,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					ВТСписокРаботников.Сотрудник
		|				ИЗ
		|					ВТСписокРаботников КАК ВТСписокРаботников)) КАК РаботникиОрганизации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
		|		КОНЕЦ = &парамОрганизация
		|	И ВЫБОР
		|			КОГДА &ПоВсемПодразделениям
		|				ТОГДА ИСТИНА
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамНачало
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения В
		|						(ВЫБРАТЬ
		|							Подразделения.Подразделение
		|						ИЗ
		|							ВТПодразделенияОтбора КАК Подразделения)
		|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации В
		|					(ВЫБРАТЬ
		|						Подразделения.Подразделение
		|					ИЗ
		|						ВТПодразделенияОтбора КАК Подразделения)
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизации.Период,
		|	РаботникиОрганизации.Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
		|				И (&ПоВсемПодразделениям
		|					ИЛИ РаботникиОрганизации.ПодразделениеОрганизации В
		|						(ВЫБРАТЬ
		|							Подразделения.Подразделение
		|						ИЗ
		|							ВТПодразделенияОтбора КАК Подразделения))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.ГрафикРаботы,
		|	РаботникиОрганизации.Должность,
		|	РаботникиОрганизации.Сотрудник.Код
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|		ПО СписокРаботников.Сотрудник = РаботникиОрганизации.Сотрудник
		|ГДЕ
		|	РаботникиОрганизации.Период > &парамНачало
		|	И РаботникиОрганизации.Период <= &парамКонец
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Работники.ПериодЗавершения,
		|	Работники.Сотрудник,
		|	ВЫБОР
		|		КОГДА Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|				И Работники.ОбособленноеПодразделениеЗавершения = &парамОрганизация
		|				И (&ПоВсемПодразделениям
		|					ИЛИ Работники.ПодразделениеОрганизацииЗавершения В
		|						(ВЫБРАТЬ
		|							Подразделения.Подразделение
		|						ИЗ
		|							ВТПодразделенияОтбора КАК Подразделения))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	Работники.ПодразделениеОрганизацииЗавершения,
		|	Работники.ГрафикРаботыЗавершения,
		|	Работники.ДолжностьЗавершения,
		|	Работники.Сотрудник.Код
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
		|			ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
		|				И (ПериодыПерекрытия.Период > Работники.Период)
		|				И (ПериодыПерекрытия.Сотрудник = Работники.Сотрудник)
		|		ПО СписокРаботников.Сотрудник = Работники.Сотрудник
		|ГДЕ
		|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И Работники.ПериодЗавершения > &парамНачало
		|	И Работники.ПериодЗавершения <= &парамКонец
		|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// таблица ВТЗначенияПоказателей
		// 
		// Поля:
		//   Сотрудник
		//   Показатель - введенный пользователем показатель
		//   Значение - значение показателя
		//   Валюта
		//
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
		|	ЗначенияПоказателейСхемМотивации.Валюта,
		|	ВЫБОР
		|		КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|				И (НЕ ЗначенияПоказателейСхемМотивации.Валюта В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))
		|			ТОГДА ЗначенияПоказателейСхемМотивации.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
		|		ИНАЧЕ ЗначенияПоказателейСхемМотивации.Значение
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ
		|	ВТДвиженияРаботников КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Ежемесячно.Подразделение КАК Подразделение,
		|			Ежемесячно.Показатель КАК Показатель,
		|			Ежемесячно.Валюта КАК Валюта,
		|			Ежемесячно.Значение КАК Значение,
		|			Ежемесячно.Сотрудник КАК Сотрудник
		|		ИЗ
		|			РегистрСведений.ЗначенияПоказателейСхемМотивации КАК Ежемесячно
		|		ГДЕ
		|			Ежемесячно.Значение ЕСТЬ НЕ NULL 
		|			И Ежемесячно.Организация = &парамОрганизация
		|			И Ежемесячно.ПериодДействия >= &парамНачало
		|			И Ежемесячно.ПериодДействия <= &парамКонец
		|		
		|		ОБЪЕДИНИТЬ
		|		
		|		ВЫБРАТЬ
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Подразделение,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Валюта,
		|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Значение,
		|			NULL
		|		ИЗ
		|			РегистрСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СрезПоследних(&парамКонец, Организация = &парамОрганизация) КАК ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних) КАК ЗначенияПоказателейСхемМотивации
		|		ПО (ВЫБОР
		|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|						ИЛИ ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя ЕСТЬ NULL 
		|					ТОГДА Работники.Сотрудник = ЗначенияПоказателейСхемМотивации.Сотрудник
		|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|					ТОГДА Работники.ПодразделениеОрганизации = ЗначенияПоказателейСхемМотивации.Подразделение
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
		|		ПО (Валюты.Период = &парамДатаВалютногоУчета)
		|			И (ЗначенияПоказателейСхемМотивации.Валюта = Валюты.Валюта)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		
		Запрос.Выполнить();
		
		
		// создание временных таблиц для последующего использования:
		//	ЗначенияПоказателей
		//	НеЗапрашиваемыеПриКадровыхПеремещениях
		//	ВводимыеВПлановыхНачисленияхПоказатели
		//	РаботникиИНачисления
		
		//Если ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.ПолныйРасчет 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНачислений 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетУдержаний 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНДФЛ
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетПенсионногоФонда Тогда
		
		// таблица НеЗапрашиваемыеПриКадровыхПеремещениях
		// 	выбираем показатели, которые не спрашиваем у пользователя в кадровых документах, а также все "тарифные ставки" и их в.р.;
		//  значения этих показателей будем искать в данных о плановых начислениях, но, возможно, при других видах расчета
		// 
		//	Поля:
		//		Ссылка - вид расчета
		//		Показатель
		//		НомерСтроки - номер строки показателя
		//		ЭтоТарифнаяСтавка - признак того. что Показатель является тарифной ставкой
		// 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель КАК Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ТОГДА ИСТИНА
		|		КОГДА ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТарифнаяСтавка
		|ПОМЕСТИТЬ ВТНеЗапрашиваемыеПриКадровыхПеремещениях
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	((НЕ ОсновныеНачисленияОрганизацийПоказатели.ЗапрашиватьПриКадровыхПеремещениях)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка)
		|	И ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель";
		Запрос.Выполнить();
		
		// таблица ВводимыеВПлановыхНачисленияхПоказатели
		//  виды расчета и показатели, значения которых находятся при этих в.р. в данных о плановых начислениях
		// 
		//	Поля:
		//		Ссылка - вид расчета
		//		Показатель
		//		НомерСтроки - номер строки показателя
		// 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизаций.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|		КОГДА ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|	КОНЕЦ КАК Показатель,
		|	1 КАК НомерСтроки,
		|	ИСТИНА КАК ЭтоТарифнаяСтавка
		|ПОМЕСТИТЬ ВТВводимыеВПлановыхНачисленияхПоказатели
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	(ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке))
		|	 ИЛИ ОсновныеНачисленияОрганизаций.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)) //О.Т. Аверсон 11.04.2017 № 513
		|	И ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки,
		|	ИСТИНА
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка.ЗачетОтработанногоВремени
		|	И ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка
		|	И (НЕ ОсновныеНачисленияОрганизацийПоказатели.Показатель.Предопределенный)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка,
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
		|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки,
		|	ЛОЖЬ
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
		|ГДЕ
		|	ОсновныеНачисленияОрганизацийПоказатели.Показатель В
		|			(ВЫБРАТЬ
		|				ВТНеЗапрашиваемыеПриКадровыхПеремещениях.Показатель
		|			ИЗ
		|				ВТНеЗапрашиваемыеПриКадровыхПеремещениях)
		|	И (НЕ ОсновныеНачисленияОрганизацийПоказатели.Показатель.ТарифнаяСтавка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
		
		Запрос.Выполнить();
		
		// РаботникиИНачисления
		//		Таблица движений работников с добавленными сведениями об их плановых начислениях
		// 
		//	Поля:
		//		Сотрудник 
		//		ВидРасчета - плановое начисление 
		//		Показатель1,...,6 - размеры показателей 
		//		СпособРасчета - способ расчета начисления 
		//		ГрафикРаботы - график сотрудника  
		//		ВидГрафика, СуммированныйУчетРабочегоВремени, ДлительностьРабочейНедели - реквизиты графика сотрудника 
		// 
		// Описание:
		//
		//	1. 
		//  2. 
		//
		ПособиеСписок = Новый СписокЗначений; //О.Т. Аверсон 23.06.2016 № 1267
		//+ СВЭЙ КДЯ 15.08.19 СВФР-004652
		ПособиеСписок.ЗагрузитьЗначения( ВидыРасчетаПособия.ВыгрузитьЗначения() );
		//- СВЭЙ КДЯ 15.08.19 СВФР-004652
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаВторогоИПоследующихДо3Лет);
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаРебенкаСтарше3Лет);
		ПособиеСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаДетейОт3До18);//О.Т. Аверсон 27.03.2018 № 1771
		
		//О.Т. Аверсон 14.06.2018 № 
		СпособыРасчетаСписок = Новый СписокЗначений;			
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		СпособыРасчетаСписок.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида);
		//О.Т. Аверсон 14.06.2018 № 
		
		Запрос.УстановитьПараметр("ВидРасчетаПособие", ПособиеСписок);
		Запрос.УстановитьПараметр("СпособыРасчетаПособие", СпособыРасчетаСписок);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Работники.Сотрудник.Физлицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА Работники.Период >= НачисленияРаботниковОрганизации.Период
		|				ИЛИ НачисленияРаботниковОрганизации.Период ЕСТЬ NULL 
		|			ТОГДА Работники.Период
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Период
		|	КОНЕЦ КАК Период,
		|	Работники.Подходит,
		|	Работники.Период КАК ПериодРаботники,
		|	НачисленияРаботниковОрганизации.Период КАК ПериодНачисления,
		|	НачисленияРаботниковОрганизации.ОсновноеНачисление,
		|	НачисленияРаботниковОрганизации.ВидРасчета,
		|	НачисленияРаботниковОрганизации.ВидРасчета.Наименование,
		|	НачисленияРаботниковОрганизации.ВидРасчета.ВидСтажа,
		|	НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда,
		|	НачисленияРаботниковОрганизации.ВидРасчета.КоэффициентСтажа,
		|	НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|			ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.ВидВремени
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ВидВремени,
		|	НачисленияРаботниковОрганизации.Действие КАК Действие,
		|	ЕСТЬNULL(НачисленияРаботниковОрганизации.ВидРасчета.КодДоходаНДФЛ.КодВычета, ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.ПустаяСсылка)) КАК КодВычета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|				ИЛИ НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|					И (НачисленияРаботниковОрганизации.ТарифныйРазряд1 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|						И НачисленияРаботниковОрганизации.ТарифныйРазряд1 ЕСТЬ НЕ NULL )
		|			ТОГДА ТарифныеСтавки1.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд2 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд2 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки2.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд3 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд3 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки3.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд4 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд4 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки4.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд5 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд5 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки5.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ПроизвольнаяФормулаРасчета
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд6 <> ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка)
		|				И НачисленияРаботниковОрганизации.ТарифныйРазряд6 ЕСТЬ НЕ NULL 
		|			ТОГДА ТарифныеСтавки6.Размер
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|	КОНЕЦ КАК Показатель6,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки1.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта1
		|	КОНЕЦ КАК Валюта1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки2.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта2
		|	КОНЕЦ КАК Валюта2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки3.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта3
		|	КОНЕЦ КАК Валюта3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки4.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта4
		|	КОНЕЦ КАК Валюта4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки5.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта5
		|	КОНЕЦ КАК Валюта5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчета.ТребуетВводаТарифногоРазряда
		|			ТОГДА ТарифныеСтавки6.Валюта
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Валюта6
		|	КОНЕЦ КАК Валюта6,
		|	НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Работники.ГрафикРаботы КАК ГрафикРаботы,
		|	ЕСТЬNULL(Работники.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА Работники.ГрафикРаботы.СокращенноеРабочееВремя
		|					И Работники.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА Работники.ГрафикРаботы.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели
		|			ИНАЧЕ Работники.ГрафикРаботы.ДлительностьРабочейНедели
		|		КОНЕЦ, 0) КАК ДлительностьРабочейНедели,
		|	Работники.ГрафикРаботы.ВидГрафика КАК ВидГрафика,
		|	Работники.Должность КАК Должность,
		|	НачисленияРаботниковОрганизации.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	Работники.ТабНомер,
		|	НачисленияРаботниковОрганизации.ПериодЗавершения КАК ПериодЗавершения,
		|	НачисленияРаботниковОрганизации.ПоказательВВалюте
		|ПОМЕСТИТЬ ВТРаботникиИНачисления
		|ИЗ
		|	ВТДвиженияРаботников КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			&парамНачало КАК Период,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ КАК ОсновноеНачисление,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ВЫБОР
		|							КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|								ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|							ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|						КОНЕЦ
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|			КОНЕЦ КАК ВидРасчета,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|			КОНЕЦ КАК Действие,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|			КОНЕЦ КАК Показатель1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|			КОНЕЦ КАК Показатель2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|			КОНЕЦ КАК Показатель3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|			КОНЕЦ КАК Показатель4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|			КОНЕЦ КАК Показатель5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|			КОНЕЦ КАК Показатель6,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта1
		|			КОНЕЦ КАК Валюта1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта2
		|			КОНЕЦ КАК Валюта2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта3
		|			КОНЕЦ КАК Валюта3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта4
		|			КОНЕЦ КАК Валюта4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта5
		|			КОНЕЦ КАК Валюта5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Валюта6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Валюта6
		|			КОНЕЦ КАК Валюта6,
		|			НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд1Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд1
		|			КОНЕЦ КАК ТарифныйРазряд1,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд2Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд2
		|			КОНЕЦ КАК ТарифныйРазряд2,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд3Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд3
		|			КОНЕЦ КАК ТарифныйРазряд3,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд4Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд4
		|			КОНЕЦ КАК ТарифныйРазряд4,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд5Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд5
		|			КОНЕЦ КАК ТарифныйРазряд5,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.ТарифныйРазряд6Завершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ТарифныйРазряд6
		|			КОНЕЦ КАК ТарифныйРазряд6,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодЗавершения,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|						И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА НачисленияРаботниковОрганизации.Показатель1ВВалютеЗавершения
		|				ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1ВВалюте
		|			КОНЕЦ КАК ПоказательВВалюте
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|					&парамНачало,
		|					ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|						И Сотрудник В
		|							(ВЫБРАТЬ
		|								Работники.Сотрудник
		|							ИЗ
		|								ВТСписокРаботников КАК Работники)) КАК НачисленияРаботниковОрганизации
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|							И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|					ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|			И НЕ ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|								И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|										ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|									ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|								КОНЕЦ
		|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|					КОНЕЦ В (&ВидРасчетаПособие)
		//О.Т. Аверсон 14.06.2018 № 
		|			И Не (ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|							И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета
		|								ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения.СпособРасчета
		|							КОНЕЦ
		|					ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета
		|				КОНЕЦ) В (&СпособыРасчетаПособие)
		//О.Т. Аверсон 14.06.2018 № 
		|			И НЕ(НачисленияРаботниковОрганизации.Период > &парамНачало
		|						И НачисленияРаботниковОрганизации.Период <= &парамКонец)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НачисленияРаботниковОрганизации.Период,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			НачисленияРаботниковОрганизации.ВидРасчета,
		|			НачисленияРаботниковОрганизации.Действие,
		|			НачисленияРаботниковОрганизации.Показатель1,
		|			НачисленияРаботниковОрганизации.Показатель2,
		|			НачисленияРаботниковОрганизации.Показатель3,
		|			НачисленияРаботниковОрганизации.Показатель4,
		|			НачисленияРаботниковОрганизации.Показатель5,
		|			НачисленияРаботниковОрганизации.Показатель6,
		|			НачисленияРаботниковОрганизации.Валюта1,
		|			НачисленияРаботниковОрганизации.Валюта2,
		|			НачисленияРаботниковОрганизации.Валюта3,
		|			НачисленияРаботниковОрганизации.Валюта4,
		|			НачисленияРаботниковОрганизации.Валюта5,
		|			НачисленияРаботниковОрганизации.Валюта6,
		|			НачисленияРаботниковОрганизации.Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд1,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд2,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд3,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд4,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд5,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд6,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде,
		//Аверсон ЕАЕ 26.11.2020
		//|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|           ДОБАВИТЬКДАТЕ(НачисленияРаботниковОрганизации.ПериодЗавершения, ДЕНЬ, -1),
		//Аверсон
		|			НачисленияРаботниковОрганизации.Показатель1ВВалюте
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ТаблицаДвиженийРаботников
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|		ГДЕ
		|			НачисленияРаботниковОрганизации.Период > &парамНачало
		|			И НачисленияРаботниковОрганизации.Период <= &парамКонец
		|			И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|			И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НачисленияРаботниковОрганизации.ПериодЗавершения,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|					ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|				ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|			КОНЕЦ,
		|			НачисленияРаботниковОрганизации.ДействиеЗавершения,
		|			НачисленияРаботниковОрганизации.Показатель1Завершения,
		|			НачисленияРаботниковОрганизации.Показатель2Завершения,
		|			НачисленияРаботниковОрганизации.Показатель3Завершения,
		|			НачисленияРаботниковОрганизации.Показатель4Завершения,
		|			НачисленияРаботниковОрганизации.Показатель5Завершения,
		|			НачисленияРаботниковОрганизации.Показатель6Завершения,
		|			НачисленияРаботниковОрганизации.Валюта1Завершения,
		|			НачисленияРаботниковОрганизации.Валюта2Завершения,
		|			НачисленияРаботниковОрганизации.Валюта3Завершения,
		|			НачисленияРаботниковОрганизации.Валюта4Завершения,
		|			НачисленияРаботниковОрганизации.Валюта5Завершения,
		|			НачисленияРаботниковОрганизации.Валюта6Завершения,
		|			НачисленияРаботниковОрганизации.Сотрудник,
		|			НачисленияРаботниковОрганизации.ДатаНачалаСобытия,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд1Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд2Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд3Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд4Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд5Завершения,
		|			НачисленияРаботниковОрганизации.ТарифныйРазряд6Завершения,
		|			НачисленияРаботниковОрганизации.ИспользуетсяВНаряде,
		|			ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
		|			НачисленияРаботниковОрганизации.Показатель1ВВалютеЗавершения
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ТаблицаДвиженийРаботников
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковПроверка
		|				ПО НачисленияРаботниковОрганизации.Сотрудник = НачисленияРаботниковПроверка.Сотрудник
		|					И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение = НачисленияРаботниковПроверка.ВидРасчетаИзмерение
		|					И НачисленияРаботниковОрганизации.ДокументОснование = НачисленияРаботниковПроверка.ДокументОснование
		|					И (НачисленияРаботниковПроверка.Период > НачисленияРаботниковОрганизации.Период)
		|					И (НачисленияРаботниковПроверка.Период <= НачисленияРаботниковОрганизации.ПериодЗавершения)
		|		ГДЕ
		|			НачисленияРаботниковОрганизации.ПериодЗавершения >= &парамНачало
		|			И НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамКонец
		|			И НачисленияРаботниковОрганизации.Организация = &парамГоловнаяОрганизация
		|			И НачисленияРаботниковОрганизации.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И НачисленияРаботниковОрганизации.ИспользуетсяВНаряде = ЛОЖЬ
		|			И НачисленияРаботниковПроверка.Сотрудник ЕСТЬ NULL 
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			&парамНачало,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ВЫБОР
		|							КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|								ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|							ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
		|						КОНЕЦ
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель6
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта6
		|			КОНЕЦ,
		|			ПлановыеНачисленияРаботниковОрганизаций.Сотрудник,
		|			ПлановыеНачисленияРаботниковОрганизаций.ДатаНачалаСобытия,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6Завершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6
		|			КОНЕЦ,
		|			ПлановыеНачисленияРаботниковОрганизаций.ИспользуетсяВНаряде,
		|			ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения, МЕСЯЦ) = &парамНачало
		|					ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
		|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель1ВВалютеЗавершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель1ВВалюте
		|			КОНЕЦ
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
		|		ГДЕ
		|			ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
		|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|			И (ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
		|							КОНЕЦ
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
		|				КОНЕЦ В (&ВидРасчетаПособие) или ВЫБОР
		|					КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &парамНачало
		|							И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|									ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета
		|								ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения.СпособРасчета
		|							КОНЕЦ
		|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета
		|				КОНЕЦ В (&СпособыРасчетаПособие) )
		|			И ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|			И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В
		|					(ВЫБРАТЬ
		|						Работники.Сотрудник
		|					ИЗ
		|						ВТСписокРаботников КАК Работники)
		|			И НЕ(ПлановыеНачисленияРаботниковОрганизаций.Период > &парамНачало
		|						И ПлановыеНачисленияРаботниковОрганизаций.Период <= &парамКонец)) КАК НачисленияРаботниковОрганизации
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки1
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд1 = ТарифныеСтавки1.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки2
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд2 = ТарифныеСтавки2.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки3
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд3 = ТарифныеСтавки3.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки4
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд4 = ТарифныеСтавки4.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки5
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд5 = ТарифныеСтавки5.ТарифныйРазряд
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&парамКонец, ) КАК ТарифныеСтавки6
		|			ПО НачисленияРаботниковОрганизации.ТарифныйРазряд6 = ТарифныеСтавки6.ТарифныйРазряд
		|		ПО (Работники.Подходит)
		|			И Работники.Сотрудник = НачисленияРаботниковОрганизации.Сотрудник
		|ГДЕ
		|	НачисленияРаботниковОрганизации.ВидРасчета В(&ВидРасчетаПособия)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";	
		
		Запрос.Выполнить();
		
		//получим все невводимые показатели
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|	СписокНачислений.ПериодНачисления КАК ПериодНачисления,
		|	ВводимыеПоказатели.Показатель КАК Показатель,
		|	ВЫБОР
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 1
		|			ТОГДА СписокНачислений.Показатель1
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 2
		|			ТОГДА СписокНачислений.Показатель2
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 3
		|			ТОГДА СписокНачислений.Показатель3
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 4
		|			ТОГДА СписокНачислений.Показатель4
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 5
		|			ТОГДА СписокНачислений.Показатель5
		|		КОГДА ВводимыеПоказатели.НомерСтроки = 6
		|			ТОГДА СписокНачислений.Показатель6
		|	КОНЕЦ КАК ЗначениеПоказателя
		|ПОМЕСТИТЬ ВТЗначенияВводимыхКадровыхПоказателей
		|ИЗ
		|	ВТРаботникиИНачисления КАК СписокНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВводимыеВПлановыхНачисленияхПоказатели КАК ВводимыеПоказатели
		|		ПО СписокНачислений.ВидРасчета = ВводимыеПоказатели.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|";
		Запрос.Выполнить();
		
		//КонецЕсли;
		
		// таблица Показатели
		//   видам начислений приписываются введенные пользователями для каждого сотрудника значения показателей 
		// 
		// Поля:
		//   ВидРасчета
		//   Сотрудник
		//   Показатель1,2,...,6 - значения соответствующих показателей
		//   Валюта
		//
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоказателиВидовРасчета.Ссылка КАК ВидРасчета,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей1.Сотрудник
		|		КОГДА ЗначенияПоказателей2.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей2.Сотрудник
		|		КОГДА ЗначенияПоказателей3.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей3.Сотрудник
		|		КОГДА ЗначенияПоказателей4.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей4.Сотрудник		
		|		КОГДА ЗначенияПоказателей5.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей5.Сотрудник		
		|		КОГДА ЗначенияПоказателей6.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
		|			ТОГДА ЗначенияПоказателей6.Сотрудник
		|	КОНЕЦ КАК Сотрудник,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей1.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей2.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей2.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей3.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей3.ПодразделениеОрганизации
		|		КОГДА ЗначенияПоказателей4.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей4.ПодразделениеОрганизации		
		|		КОГДА ЗначенияПоказателей5.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей5.ПодразделениеОрганизации		
		|		КОГДА ЗначенияПоказателей6.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
		|			ТОГДА ЗначенияПоказателей6.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПодразделениеОрганизации,			
		|	ПоказателиВидовРасчета.Показатель1.ТипПоказателя КАК ТипПоказателя1,
		|	ПоказателиВидовРасчета.Показатель2.ТипПоказателя КАК ТипПоказателя2,
		|	ПоказателиВидовРасчета.Показатель3.ТипПоказателя КАК ТипПоказателя3,
		|	ПоказателиВидовРасчета.Показатель4.ТипПоказателя КАК ТипПоказателя4,
		|	ПоказателиВидовРасчета.Показатель5.ТипПоказателя КАК ТипПоказателя5,
		|	ПоказателиВидовРасчета.Показатель6.ТипПоказателя КАК ТипПоказателя6,
		|	ПоказателиВидовРасчета.Показатель1.ВозможностьИзменения КАК ВозможностьИзменения1,
		|	ПоказателиВидовРасчета.Показатель2.ВозможностьИзменения КАК ВозможностьИзменения2,
		|	ПоказателиВидовРасчета.Показатель3.ВозможностьИзменения КАК ВозможностьИзменения3,
		|	ПоказателиВидовРасчета.Показатель4.ВозможностьИзменения КАК ВозможностьИзменения4,
		|	ПоказателиВидовРасчета.Показатель5.ВозможностьИзменения КАК ВозможностьИзменения5,
		|	ПоказателиВидовРасчета.Показатель6.ВозможностьИзменения КАК ВозможностьИзменения6,
		
		|	ЗначенияПоказателей1.Значение КАК Показатель1,
		|	ЗначенияПоказателей2.Значение КАК Показатель2,
		|	ЗначенияПоказателей3.Значение КАК Показатель3,
		|	ЗначенияПоказателей4.Значение КАК Показатель4,
		|	ЗначенияПоказателей5.Значение КАК Показатель5,
		|	ЗначенияПоказателей6.Значение КАК Показатель6,
		|	ВЫБОР 
		|		КОГДА ЗначенияПоказателей1.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей1.Валюта
		|		КОГДА ЗначенияПоказателей2.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей2.Валюта
		|		КОГДА ЗначенияПоказателей3.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей3.Валюта
		|		КОГДА ЗначенияПоказателей4.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей4.Валюта		
		|		КОГДА ЗначенияПоказателей5.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей5.Валюта		
		|		КОГДА ЗначенияПоказателей6.Показатель.ТипПоказателя = Значение(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
		|			ТОГДА ЗначенияПоказателей6.Валюта
		|	КОНЕЦ КАК Валюта		
		|ПОМЕСТИТЬ ВТПоказатели
		|ИЗ
		|	(ВЫБРАТЬ
		|		Показатели.Ссылка КАК Ссылка,
		|		Показатели1.Показатель КАК Показатель1,
		|		Показатели2.Показатель КАК Показатель2,
		|		Показатели3.Показатель КАК Показатель3,
		|		Показатели4.Показатель КАК Показатель4,
		|		Показатели5.Показатель КАК Показатель5,
		|		Показатели6.Показатель КАК Показатель6
		|	ИЗ
		|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели1
		|			ПО Показатели.Ссылка = Показатели1.Ссылка
		|				И (Показатели1.НомерСтроки = 1)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели2
		|			ПО Показатели.Ссылка = Показатели2.Ссылка
		|				И (Показатели2.НомерСтроки = 2)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели3
		|			ПО Показатели.Ссылка = Показатели3.Ссылка
		|				И (Показатели3.НомерСтроки = 3)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели4
		|			ПО Показатели.Ссылка = Показатели4.Ссылка
		|				И (Показатели4.НомерСтроки = 4)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели5
		|			ПО Показатели.Ссылка = Показатели5.Ссылка
		|				И (Показатели5.НомерСтроки = 5)
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели6
		|			ПО Показатели.Ссылка = Показатели6.Ссылка
		|				И (Показатели6.НомерСтроки = 6)
		|	) КАК ПоказателиВидовРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей1
		|		ПО ПоказателиВидовРасчета.Показатель1 = ЗначенияПоказателей1.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей2
		|		ПО ПоказателиВидовРасчета.Показатель2 = ЗначенияПоказателей2.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей3
		|		ПО ПоказателиВидовРасчета.Показатель3 = ЗначенияПоказателей3.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей4
		|		ПО ПоказателиВидовРасчета.Показатель4 = ЗначенияПоказателей4.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей5
		|		ПО ПоказателиВидовРасчета.Показатель5 = ЗначенияПоказателей5.Показатель
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияПоказателей КАК ЗначенияПоказателей6
		|		ПО ПоказателиВидовРасчета.Показатель6 = ЗначенияПоказателей6.Показатель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидРасчета";
		Запрос.Выполнить();
		
		// АВТОЗАПОЛНЕНИЕ ТЧ "Начисления", "ДополнительныеНачисления" и "ДоговорыНаВыполнениеРабот"
		//Если ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.ПолныйРасчет 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНачислений 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетНДФЛ 
		//	ИЛИ ВидОперации = Перечисления.ВидыОперацийНачислениеЗарплатыРаботникамОрганизаций.РасчетПенсионногоФонда Тогда
		
		// таблица ОсновныеНачисления  
		//	    выборка сведений об уже выполненных начислениях за отработанное время - для выбрасывания 
		// 		ранее "обслуженных" работников
		//	Поля:
		//		Сотрудник,
		//		ПодразделениеОрганизации
		//
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДвиженияРаботников КАК ТаблицаДвиженийРаботников
		|		ПО ОсновныеНачисления.Сотрудник = ТаблицаДвиженийРаботников.Сотрудник
		|ГДЕ
		|	ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации
		|	И ОсновныеНачисления.ПериодДействияКонец <= &парамКонец
		|	И ОсновныеНачисления.ПериодДействияНачало >= &парамНачало
		|	И ОсновныеНачисления.Организация = &парамГоловнаяОрганизация
		|	И (ОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени
		|				И ОсновныеНачисления.ВидРасчета.ЗачетНормыВремени
		|			ИЛИ ОсновныеНачисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
		|	И (НЕ ОсновныеНачисления.Сторно)
		|	И ОсновныеНачисления.Регистратор <> &парамРегистратор
		|	И ОсновныеНачисления.ОбособленноеПодразделение = &парамОрганизация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";		
		Запрос.Выполнить();
		
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И (СводныеИндивидуальныеГрафики.Месяц = &парамПериодРегистрации)
		|ГДЕ
		|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СводныеИндивидуальныеГрафики.Часов КАК ЧасовЗаМесяц
		|ПОМЕСТИТЬ ВТНормаВремениПоСводнымИндивидуальнымГрафикам
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И (СводныеИндивидуальныеГрафики.Месяц = &парамПериодРегистрации)
		|ГДЕ
		|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// НормаВремениПоЕжедневнымИндивидуальнымГрафикам
		//		Таблица сотрудников и нормы времени в часах, введенной индивидуальными графиками
		// 
		//	Поля:
		//		Сотрудник,
		//		ЧасовЗаМесяц - суммируем все часы рабочего времени
		// 
		// Описание:
		//
		//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени,	
		//	введенные доками ВводИндивидуальныхГрафиков, т.е. по строкам с выставленным флажком План
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник";
		
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ПОМЕСТИТЬ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// НормаВремениПоОбщимГрафикам
		//		Таблица сотрудников и нормы времени в часах по общим графикам
		// 
		//	Поля:
		//		Сотрудник,
		//		ЧасовЗаМесяц - суммируем все часы рабочего времени
		// 
		// Описание:
		//
		//	выбираем данные из рег-ра ГрафикиРаботыПоВидамВремени для общих графиков
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СписокРаботников.Сотрудник КАК Сотрудник,
		|		ВЫБОР
		|			КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
		|					И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
		|			ИНАЧЕ СписокРаботников.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы
		|	ИЗ
		|		ВТДвиженияРаботников КАК СписокРаботников) КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник,
		|	СписокРаботников.ГрафикРаботы";
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц,
		|	СписокРаботников.ПодразделениеОрганизации
		|ПОМЕСТИТЬ ВТНормаВремениПоОбщимГрафикам
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СписокРаботников.Сотрудник КАК Сотрудник,
		|		ВЫБОР
		|			КОГДА СписокРаботников.ГрафикРаботы.СокращенноеРабочееВремя
		|					И СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
		|				ТОГДА СписокРаботников.ГрафикРаботы.ГрафикПолногоРабочегоВремени
		|			ИНАЧЕ СписокРаботников.ГрафикРаботы
		|		КОНЕЦ КАК ГрафикРаботы,
		|		СписокРаботников.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|	ИЗ
		|		ВТДвиженияРаботников КАК СписокРаботников) КАК СписокРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
		|			И (ГрафикиРаботыПоВидамВремени.Месяц = &парамПериодРегистрации)
		|			И (ГрафикиРаботыПоВидамВремени.План)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокРаботников.Сотрудник,
		|	СписокРаботников.ГрафикРаботы,
		|	СписокРаботников.ПодразделениеОрганизации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыСтажа.Сотрудник КАК Сотрудник,
		|	ДатыСтажа.Физлицо,
		|	ДатыСтажа.ПериодРаботники,
		|	ДатыСтажа.ПериодСеверногоСтажа КАК ДатаРегистрацииСеверногоСтажа,
		|	СведенияОСтажеРаботыНаСевере.ПорядокНачисленияСеверныхНадбавок,
		|	СведенияОСтажеРаботыНаСевере.НачальныйПроцентСевернойНадбавки,
		|	СведенияОСтажеРаботыНаСевере.СеверныйСтажМесяцев,
		|	СведенияОСтажеРаботыНаСевере.СеверныйСтажДней
		|ПОМЕСТИТЬ ВТДанныеОСеверномСтаже
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокНачислений.Сотрудник КАК Сотрудник,
		|		СписокНачислений.Физлицо КАК Физлицо,
		|		СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|		МАКСИМУМ(СведенияОСтажеРаботыНаСевере.Период) КАК ПериодСеверногоСтажа
		|	ИЗ
		|		ВТРаботникиИНачисления КАК СписокНачислений
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтажеРаботыНаСевере КАК СведенияОСтажеРаботыНаСевере
		|			ПО СписокНачислений.Физлицо = СведенияОСтажеРаботыНаСевере.ФизЛицо
		|				И СписокНачислений.ПериодРаботники >= СведенияОСтажеРаботыНаСевере.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписокНачислений.Сотрудник,
		|		СписокНачислений.Физлицо,
		|		СписокНачислений.ПериодРаботники) КАК ДатыСтажа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтажеРаботыНаСевере КАК СведенияОСтажеРаботыНаСевере
		|		ПО ДатыСтажа.Физлицо = СведенияОСтажеРаботыНаСевере.ФизЛицо
		|			И ДатыСтажа.ПериодСеверногоСтажа = СведенияОСтажеРаботыНаСевере.Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		// РаботникиИНачисленияПоСхемамМотивации
		//		Таблица движений работников и сведениями об их плановых начислениях
		//      с добавленными значениями показателей, как введенными пользователями для расчета, так и 
		//      выбранными из строк плановых начислений, содержащих тарифные ставки по "основным" начислениям работника
		// 
		//	Поля:
		//		Сотрудник 
		//		ВидРасчета - плановое начисление 
		//		Показатель1,...,6 - размеры показателей 
		//		СпособРасчета - способ расчета начисления 
		//		ОкладТариф - размер трифной ставки, если начисление ее содержит  
		//		ГрафикРаботы - график сотрудника  
		//		ВидГрафика, СуммированныйУчетРабочегоВремени, ДлительностьРабочейНедели - реквизиты графика сотрудника 
		// 
		// Описание:
		//
		//	1. 
		//  2. 
		//
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.СотрудникНаименование,
		|	СписокНачислений.Физлицо,
		|	СписокНачислений.ПодразделениеОрганизации,
		|	СписокНачислений.Подходит,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники,
		|	СписокНачислений.ПериодНачисления,
		|	СписокНачислений.ОсновноеНачисление,
		|	СписокНачислений.ВидРасчета,
		|	СписокНачислений.ВидРасчетаНаименование,
		|	СписокНачислений.ВидРасчетаКоэффициентСтажа,
		|	СписокНачислений.ВидРасчетаВидСтажа,
		|	СписокНачислений.ВидРасчетаТребуетВводаТарифногоРазряда,
		|	СписокНачислений.СпособРасчета,
		|	СписокНачислений.ВидВремени,
		|	СписокНачислений.Действие,
		|	СписокНачислений.КодВычета,
		|	СписокНачислений.ДатаНачалаСобытия,
		|	СписокНачислений.ГрафикРаботы,
		|	СписокНачислений.СуммированныйУчетРабочегоВремени,
		|	СписокНачислений.ДлительностьРабочейНедели,
		|	СписокНачислений.ВидГрафика,
		|	СписокНачислений.Валюта1 КАК Валюта,
		|	СписокНачислений.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА 1
		|		ИНАЧЕ Валюты1.Курс
		|	КОНЕЦ КАК КурсВалюты,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель1
		|		КОГДА (СписокНачислений.Показатель1 = 0
		|				ИЛИ СписокНачислений.Показатель1 ЕСТЬ NULL )
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель1
		|		КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель1
		|		ИНАЧЕ СписокНачислений.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 2)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель2
		|		КОГДА (СписокНачислений.Показатель2 = 0
		|				ИЛИ СписокНачислений.Показатель2 ЕСТЬ NULL )
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель2
		|		КОГДА СписокНачислений.Валюта2 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель2
		|		ИНАЧЕ СписокНачислений.Показатель2 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 3)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель3
		|		КОГДА СписокНачислений.Показатель3 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель3
		|		КОГДА СписокНачислений.Валюта3 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель3
		|		ИНАЧЕ СписокНачислений.Показатель3 * ЕСТЬNULL(Валюты3.Курс / Валюты3.Кратность, 0)
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 4)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель4
		|		КОГДА СписокНачислений.Показатель4 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель4
		|		КОГДА СписокНачислений.Валюта4 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель4
		|		ИНАЧЕ СписокНачислений.Показатель4 * ЕСТЬNULL(Валюты4.Курс / Валюты4.Кратность, 0)
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 5)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель5
		|		КОГДА СписокНачислений.Показатель5 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель5
		|		КОГДА СписокНачислений.Валюта5 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель5
		|		ИНАЧЕ СписокНачислений.Показатель5 * ЕСТЬNULL(Валюты5.Курс / Валюты5.Кратность, 0)
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|				И ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ NULL 
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.НомерСтроки <> 6)
		|			ТОГДА 0
		|		КОГДА ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|				ИЛИ (ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете)
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ПоказательВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.Периодически))
		|					И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|			ТОГДА ПоказателиВведенныеПриРасчете.Показатель6
		|		КОГДА СписокНачислений.Показатель6 = 0
		|				И ЗначенияВводимыхКадровыхПоказателей.Показатель ЕСТЬ НЕ NULL 
		|				И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|					ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка
		|						И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6)
		|			ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|		КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|			ТОГДА 0
		|		КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|			ТОГДА СписокНачислений.Показатель6
		|		КОГДА СписокНачислений.Валюта6 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|			ТОГДА СписокНачислений.Показатель6
		|		ИНАЧЕ СписокНачислений.Показатель6 * ЕСТЬNULL(Валюты6.Курс / Валюты6.Кратность, 0)
		|	КОНЕЦ КАК Показатель6,
		|	ПоказательТарифнойСтавки.Показатель КАК ВидТарифнойСтавки,
		|	ВЫБОР
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 1
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель1 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель1
		|					КОГДА СписокНачислений.Показатель1 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 1
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель1 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель1
		|					КОГДА СписокНачислений.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель1
		|					ИНАЧЕ СписокНачислений.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 2
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель2 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель2
		|					КОГДА СписокНачислений.Показатель2 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 2
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель2 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель2
		|					КОГДА СписокНачислений.Валюта2 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель2
		|					ИНАЧЕ СписокНачислений.Показатель2 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 3
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель3 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель3
		|					КОГДА СписокНачислений.Показатель3 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 3
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель3 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель3
		|					КОГДА СписокНачислений.Валюта3 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель3
		|					ИНАЧЕ СписокНачислений.Показатель3 * ЕСТЬNULL(Валюты3.Курс / Валюты3.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 4
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель4 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель4
		|					КОГДА СписокНачислений.Показатель4 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 4
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель4 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель4
		|					КОГДА СписокНачислений.Валюта4 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель4
		|					ИНАЧЕ СписокНачислений.Показатель4 * ЕСТЬNULL(Валюты4.Курс / Валюты4.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 5
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель5 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель5
		|					КОГДА СписокНачислений.Показатель5 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 5
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель5 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель5
		|					КОГДА СписокНачислений.Валюта5 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель5
		|					ИНАЧЕ СписокНачислений.Показатель5 * ЕСТЬNULL(Валюты5.Курс / Валюты5.Кратность, 0)
		|				КОНЕЦ
		|		КОГДА ПоказательТарифнойСтавки.НомерСтроки = 6
		|			ТОГДА ВЫБОР
		|					КОГДА ПоказателиВведенныеПриРасчете.Показатель6 ЕСТЬ НЕ NULL 
		|						ТОГДА ПоказателиВведенныеПриРасчете.Показатель6
		|					КОГДА СписокНачислений.Показатель6 = 0
		|							И (ЗначенияВводимыхКадровыхПоказателей.Показатель <> ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ПустаяСсылка)
		|									И ЗначенияВводимыхКадровыхПоказателей.НомерСтроки = 6
		|								ИЛИ ЗначенияВводимыхКадровыхПоказателей.ЭтоТарифнаяСтавка)
		|						ТОГДА ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя
		|					КОГДА СписокНачислений.Показатель6 ЕСТЬ NULL 
		|						ТОГДА 0
		|					КОГДА СписокНачислений.СпособРасчета В (&парамМассивСпособовРасчетовБезВалюты)
		|						ТОГДА СписокНачислений.Показатель6
		|					КОГДА СписокНачислений.Валюта6 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|						ТОГДА СписокНачислений.Показатель6
		|					ИНАЧЕ СписокНачислений.Показатель6 * ЕСТЬNULL(Валюты6.Курс / Валюты6.Кратность, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОкладТариф,
		|	СписокНачислений.ТабНомер,
		|	СписокНачислений.ПериодЗавершения,
		|	СписокНачислений.ПоказательВВалюте
		|ПОМЕСТИТЬ ВТРаботникиИНачисленияПоСхемамМотивации
		|ИЗ
		|	ВТРаботникиИНачисления КАК СписокНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК ПоказателиВведенныеПриРасчете
		|		ПО СписокНачислений.ВидРасчета = ПоказателиВведенныеПриРасчете.ВидРасчета
		|			И (СписокНачислений.Сотрудник = ПоказателиВведенныеПриРасчете.Сотрудник
		|				ИЛИ СписокНачислений.ПодразделениеОрганизации = ПоказателиВведенныеПриРасчете.ПодразделениеОрганизации)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			НеВводимыеПоказатели.Ссылка КАК Ссылка,
		|			НеВводимыеПоказатели.НомерСтроки КАК НомерСтроки,
		|			НеВводимыеПоказатели.Показатель КАК Показатель,
		|			НеВводимыеПоказатели.ПоказательВозможностьИзменения КАК ПоказательВозможностьИзменения,
		|			НеВводимыеПоказатели.ЭтоТарифнаяСтавка КАК ЭтоТарифнаяСтавка,
		|			СУММА(ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя) КАК ЗначениеПоказателя,
		|			ЗначенияВводимыхКадровыхПоказателей.Сотрудник КАК Сотрудник,
		|			ЗначенияВводимыхКадровыхПоказателей.Период КАК Период,
		|			ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники КАК ПериодРаботники
		|		ИЗ
		|			ВТНеЗапрашиваемыеПриКадровыхПеремещениях КАК НеВводимыеПоказатели
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияВводимыхКадровыхПоказателей КАК ЗначенияВводимыхКадровыхПоказателей
		|				ПО НеВводимыеПоказатели.Показатель = ЗначенияВводимыхКадровыхПоказателей.Показатель
		|		ГДЕ
		|			ЗначенияВводимыхКадровыхПоказателей.ЗначениеПоказателя <> 0
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НеВводимыеПоказатели.Ссылка,
		|			НеВводимыеПоказатели.НомерСтроки,
		|			НеВводимыеПоказатели.Показатель,
		|			НеВводимыеПоказатели.ПоказательВозможностьИзменения,
		|			НеВводимыеПоказатели.ЭтоТарифнаяСтавка,
		|			ЗначенияВводимыхКадровыхПоказателей.Сотрудник,
		|			ЗначенияВводимыхКадровыхПоказателей.Период,
		|			ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники) КАК ЗначенияВводимыхКадровыхПоказателей
		|		ПО СписокНачислений.Сотрудник = ЗначенияВводимыхКадровыхПоказателей.Сотрудник
		|			И (КОНЕЦПЕРИОДА(СписокНачислений.Период, МЕСЯЦ) = КОНЕЦПЕРИОДА(ЗначенияВводимыхКадровыхПоказателей.Период, МЕСЯЦ))
		|			И СписокНачислений.ПериодРаботники = ЗначенияВводимыхКадровыхПоказателей.ПериодРаботники
		|			И СписокНачислений.ВидРасчета = ЗначенияВводимыхКадровыхПоказателей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты1
		|		ПО (Валюты1.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта1 = Валюты1.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты2
		|		ПО (Валюты2.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта2 = Валюты2.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты3
		|		ПО (Валюты3.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта3 = Валюты3.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты4
		|		ПО (Валюты4.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта4 = Валюты4.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты5
		|		ПО (Валюты5.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта5 = Валюты5.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты6
		|		ПО (Валюты6.Период = &парамДатаВалютногоУчета)
		|			И СписокНачислений.Валюта6 = Валюты6.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВводимыеВПлановыхНачисленияхПоказатели КАК ПоказательТарифнойСтавки
		|		ПО СписокНачислений.ВидРасчета = ПоказательТарифнойСтавки.Ссылка
		|			И (ПоказательТарифнойСтавки.Показатель В (ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)))
		|ГДЕ
		|	ВЫБОР
		|			КОГДА СписокНачислений.Подходит
		|				ТОГДА НЕ СписокНачислений.ВидРасчета ЕСТЬ NULL 
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.Выполнить();
		
		//Основной текст запроса
		//Островская Татьяна 24.07.2013 № 16643(стаж*12)
		ОсновнойТекстЗапроса = 
		"ВЫБРАТЬ
		|	СписокНачислений.Сотрудник КАК Сотрудник,
		|	СписокНачислений.СотрудникНаименование КАК СотрудникНаименование,
		|	СписокНачислений.Физлицо КАК Физлицо,
		|	СписокНачислений.ПодразделениеОрганизации,
		|	СписокНачислений.Подходит,
		|	СписокНачислений.Период,
		|	СписокНачислений.ПериодРаботники КАК ПериодРаботники,
		|	СписокНачислений.ПериодНачисления КАК ПериодНачисления,
		|	СписокНачислений.ОсновноеНачисление КАК ОсновноеНачисление,
		|	СписокНачислений.ВидРасчета КАК ВидРасчета,
		|	СписокНачислений.ВидРасчетаНаименование,
		|	ЕСТЬNULL(СписокНачислений.ВидРасчетаТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
		|	СписокНачислений.СпособРасчета,
		|	СписокНачислений.ВидВремени,
		|	СписокНачислений.Действие,
		|	СписокНачислений.КодВычета,
		|	СписокНачислений.ДатаНачалаСобытия,
		|	СписокНачислений.ГрафикРаботы,
		|	СписокНачислений.СуммированныйУчетРабочегоВремени,
		|	СписокНачислений.Валюта,
		|	СписокНачислений.КурсВалюты,
		|	СписокНачислений.ВидТарифнойСтавки,
		|	СписокНачислений.ИспользуетсяВНаряде КАК ИспользуетсяВНаряде,
		|	ВЫБОР
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
		|			ТОГДА СписокНачислений.ОкладТариф
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА ЕСТЬNULL(ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую, ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)) = ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)
		|							ТОГДА ВЫБОР
		|									КОГДА ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) = 0
		|										ТОГДА 0
		|									КОГДА СписокНачислений.ДлительностьРабочейНедели = 0
		|										ТОГДА 0
		|									ИНАЧЕ СписокНачислений.ОкладТариф / (СписокНачислений.ДлительностьРабочейНедели / 5 * (ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) + ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) - ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) * 12
		|								КОНЕЦ
		|						КОГДА ВЫБОР
		|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
		|							КОНЕЦ = 0
		|							ТОГДА 0
		|						ИНАЧЕ СписокНачислений.ОкладТариф / ВЫБОР
		|								КОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник ЕСТЬ НЕ NULL 
		|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
		|								ИНАЧЕ ЕСТЬNULL(НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц, 0)
		|							КОНЕЦ
		|					КОНЕЦ КАК ЧИСЛО(15, 3))
		|		КОГДА СписокНачислений.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
		|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА СписокНачислений.ДлительностьРабочейНедели = 0
		|							ТОГДА 0
		|						ИНАЧЕ СписокНачислений.ОкладТариф / СписокНачислений.ДлительностьРабочейНедели * ВЫБОР
		|								КОГДА СписокНачислений.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
		|									ТОГДА 6
		|								ИНАЧЕ 5
		|							КОНЕЦ
		|					КОНЕЦ КАК ЧИСЛО(15, 3))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧасоваяТарифнаяСтавка,
		|	СписокНачислений.Показатель1,
		|	СписокНачислений.Показатель2,
		|	СписокНачислений.Показатель3,
		|	СписокНачислений.Показатель4,
		|	СписокНачислений.Показатель5,
		|	СписокНачислений.Показатель6,
		|	ВЫБОР
		|		КОГДА &ЭтоПерерасчет
		|			ТОГДА ЛОЖЬ
		|		КОГДА ОсновныеНачисления.Сотрудник ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УжеПроведен,
		|	НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник КАК Сотрудник1,
		|	НормаВремениПоСводнымИндивидуальнымГрафикам.ЧасовЗаМесяц,
		|	НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник КАК Сотрудник2,
		|	НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц КАК ЧасовЗаМесяц1,
		|	НормаВремениПоОбщимГрафикам.ЧасовЗаМесяц КАК ЧасовЗаМесяц2,
		|	СписокНачислений.ТабНомер,
		|	СписокНачислений.ПериодЗавершения,
		|	СписокНачислений.ПоказательВВалюте
		|ИЗ
		|	ВТРаботникиИНачисленияПоСхемамМотивации КАК СписокНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВЫБОР
		|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЧислоРабочихДней,
		|			СУММА(ВЫБОР
		|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
		|						ТОГДА 1
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЧислоПредпраздничныхДней
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.Год = &Год) КАК ДанныеПроизводственногоКалендаря
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоСводнымИндивидуальнымГрафикам КАК НормаВремениПоСводнымИндивидуальнымГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоСводнымИндивидуальнымГрафикам.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоЕжедневнымИндивидуальнымГрафикам КАК НормаВремениПоЕжедневнымИндивидуальнымГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоЕжедневнымИндивидуальнымГрафикам.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремениПоОбщимГрафикам КАК НормаВремениПоОбщимГрафикам
		|		ПО СписокНачислений.Сотрудник = НормаВремениПоОбщимГрафикам.Сотрудник
		|		И СписокНачислений.ПодразделениеОрганизации = НормаВремениПоОбщимГрафикам.ПодразделениеОрганизации //О.Т. Аверсон 14.06.2018 №
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеНачисления КАК ОсновныеНачисления
		|		ПО СписокНачислений.Сотрудник = ОсновныеНачисления.Сотрудник
		|			И СписокНачислений.ПодразделениеОрганизации = ОсновныеНачисления.ПодразделениеОрганизации
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникНаименование,
		|	Сотрудник,
		|	ПериодРаботники,
		|	ПериодНачисления,
		|	ОсновноеНачисление УБЫВ,
		|	ВидРасчета";
		Запрос.УстановитьПараметр("Месяцы",?(Организация.ИНН = "100765738",12,1));
		
		
		Запрос.Текст = ОсновнойТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		
		НачисленияВыборка = РезультатЗапроса.Выбрать();
		
		ТЗНачисления = СформироватьТаблицуНачислений(НачисленияВыборка, ОкончаниеПериодаЗаполнения, РезультатЗапроса.Выгрузить(),,);
		Для Каждого стр из ТЗНачисления Цикл 
			СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,стр);
		КонецЦикла;
		
		
		//КонецЕсли;
		
		
		
		
	КонецЕсли;
	
	
	
	
	
КонецФункции


Функция СформироватьТаблицуНачислений(Начисления, ОкончаниеПериодаЗаполнения, ВремТЗНачисления,ДопНачисления=Ложь,ТЧРаботавшиеВПраздники = Неопределено, ЕстьКолонкаПериодНомерСтроки = Ложь )//О.Т. Аверсон 29.05.2018 № 2013 //Аверсон 16.06.2022 КВВ СВФР-009202 (ЕстьКолонкаПериодНомерСтроки)
	
	ТЗНачисления = Новый ТаблицаЗначений();
	ТЗНачисления.Колонки.Добавить("Сотрудник");
	ТЗНачисления.Колонки.Добавить("ТабНомер");//Островская Татьяна 22.01.2014 № 17057
	ТЗНачисления.Колонки.Добавить("Физлицо");
	ТЗНачисления.Колонки.Добавить("ВидРасчета");
	ТЗНачисления.Колонки.Добавить("КодВычета");
	ТЗНачисления.Колонки.Добавить("Основное");// Признак основного начисления
	ТЗНачисления.Колонки.Добавить("Показатель1");
	ТЗНачисления.Колонки.Добавить("Показатель2");
	ТЗНачисления.Колонки.Добавить("Показатель3");
	ТЗНачисления.Колонки.Добавить("Показатель4");	
	ТЗНачисления.Колонки.Добавить("Показатель5");
	ТЗНачисления.Колонки.Добавить("Показатель6");		
	ТЗНачисления.Колонки.Добавить("Размер");
	ТЗНачисления.Колонки.Добавить("ДатаНачала", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТЗНачисления.Колонки.Добавить("ДатаНачалаСобытия", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТЗНачисления.Колонки.Добавить("ДатаОкончания", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТЗНачисления.Колонки.Добавить("ПодразделениеОрганизации");
	
	// для заполнения графика и вида учета времени
	ТЗНачисления.Колонки.Добавить("ГрафикРаботы");
	ТЗНачисления.Колонки.Добавить("СуммированныйУчетРабочегоВремени");
	ТЗНачисления.Колонки.Добавить("СпособРасчета");
	ТЗНачисления.Колонки.Добавить("ВидВремени");
	ТЗНачисления.Колонки.Добавить("ОтработаноЧасов");// О.Т. 02.12.2014
	ТЗНачисления.Колонки.Добавить("ОтработаноДней");//О.Т. 22.04.2015 № 422
	ТЗНачисления.Колонки.Добавить("ОплаченоДнейЧасов");// О.Т. 02.12.2014
	ТЗНачисления.Колонки.Добавить("ОплаченоДней");
	
	ТЗНачисления.Колонки.Добавить("ПериодНомерСтроки"); //Аверсон 16.06.2022 КВВ СВФР-009202
	
	// Массив незакрытых строк таблицы значений, т.е. тех, которым не проставлена дата окончания
	НезакрытыеСтроки = Новый Массив;
	// Текущие значения полей выборки для отслеживания изменения работника и даты назначения 
	ТекущийСотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	ТекущаяДатаНазначения = '00010101';
	ТекущаяЧасоваяСтавкаОсновногоНачисления = 0;
	СтрокиНачисленийТекущегоНазначения = Новый Массив;
	
	ТЗСотрудники = Новый СписокЗначений;
	СотрудникПрошл = "";
	Пока Начисления.Следующий() Цикл
		Если ТЗСотрудники.НайтиПоЗначению(Начисления.Сотрудник) = Неопределено Тогда 
			ТЗСотрудники.Добавить(Начисления.Сотрудник);
		КонецЕсли;
		
		
		Если Начисления.Сотрудник <> ТекущийСотрудник Тогда
			
			//О.Т. Аверсон 03.04.2018  
			НезакрытыеСтроки1 = Новый Массив;
			Для Каждого стр из НезакрытыеСтроки Цикл 
				Попытка
					
					Проверка = стр.ФизЛицо;
					НезакрытыеСтроки1.Добавить(стр);
				Исключение
					
				КонецПопытки;
			КонецЦикла;
			
			НезакрытыеСтроки = НезакрытыеСтроки1;
			//О.Т. Аверсон 03.04.2018 Проверка, если строка удалена, чтоб не добавлять в массив
			// закрываем незакрытые строки начислений предыдущего работника концом месяца
			ЗакрытьСтроки(ТЗНачисления, НезакрытыеСтроки, ОкончаниеПериодаЗаполнения);
			
			// меняется текущий работник и дата его движения
			ТекущийСотрудник = Начисления.Сотрудник;
			Попытка
				ТекущаяДатаНазначения = Начисления.ПериодРаботники;
			Исключение
			КонецПопытки;
			ТекущаяЧасоваяСтавкаОсновногоНачисления = 0;
			СтрокиНачисленийТекущегоНазначения.Очистить();
			
		ИначеЕсли Начисления.ПериодРаботники <> ТекущаяДатаНазначения Тогда
			
			Для каждого СтрокаТекущегоНазначения Из СтрокиНачисленийТекущегоНазначения Цикл
				
				ИндексСтроки = 0;
				Для каждого СтрокаМассива Из НезакрытыеСтроки Цикл
					Если СтрокаМассива = СтрокаТекущегоНазначения Тогда    												
						НезакрытыеСтроки.Удалить(ИндексСтроки);
						Прервать;
					Иначе
						ИндексСтроки = ИндексСтроки + 1;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			//О.Т. Аверсон 03.04.2018  
			НезакрытыеСтроки1 = Новый Массив;
			Для Каждого стр из НезакрытыеСтроки Цикл 
				Попытка
					
					Проверка = стр.ФизЛицо;
					НезакрытыеСтроки1.Добавить(стр);
				Исключение
					
				КонецПопытки;
			КонецЦикла;
			
			НезакрытыеСтроки = НезакрытыеСтроки1;
			//О.Т. Аверсон 03.04.2018 Проверка, если строка удалена, чтоб не добавлять в массив
			// закрываем все строки предыдущего назначения датой предшествующей новому назначению
			ЗакрытьСтроки(ТЗНачисления, СтрокиНачисленийТекущегоНазначения, Начисления.ПериодРаботники - 1);
			
			// меняется текущая дата движения работника
			ТекущаяДатаНазначения = Начисления.ПериодРаботники;
			
		КонецЕсли;
		
		Если НЕ Начисления.Подходит ИЛИ Начисления.УжеПроведен Тогда
			// пропускаем такие записи: они уже введена другими документами или соответствуют окончанию назначения работника
			//толик 			Продолжить;
		КонецЕсли;
		//толик
		Если НЕ ЗначениеЗаполнено(Начисления.ВидРасчета) Или 
			Начисления.ВидРасчета.СпособИспользования = Перечисления.СпособИспользованияВидаРасчета.ИспользуетсяВСдельныхНарядах Тогда
			// пропускаем такие записи: с пустым видом расчете и сделкой
			Продолжить;
		КонецЕсли;
		//
		
		Если ЗначениеЗаполнено(Начисления.ИспользуетсяВНаряде) и Начисления.ИспользуетсяВНаряде = Истина Тогда
			// пропускаем такие записи: если расчитываются в сдельном табеле
			Продолжить;
		КонецЕсли;
		
		Если Начисления.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить И НЕ Начисления.ТребуетВводаТарифногоРазряда И (Начисления.КурсВалюты = NULL ИЛИ Начисления.КурсВалюты = 0) Тогда
			ОбщегоНазначения.ОшибкаРасчета("Для расчетного периода не задан курс валюты " + Начисления.Валюта + "!");
			ТЗНачисления.Очистить();
			Возврат ТЗНачисления;
		КонецЕсли;
		
		Показатель1 = Начисления.Показатель1;
		Показатель2 = Начисления.Показатель2; 
		Показатель3 = Начисления.Показатель3; 
		Показатель4 = Начисления.Показатель4; 			
		Показатель5 = Начисления.Показатель5; 
		Показатель6 = Начисления.Показатель6; 		
		
		
		// Сохраним размер основного начисления для расчета размера оплаты ночных и вечерних часов
		// (основное начисление в выборке должно идти раньше других видов расчета)
		Если Начисления.ОсновноеНачисление и Начисления.ВидРасчета <> Неопределено Тогда
			ТекущаяЧасоваяСтавкаОсновногоНачисления = Начисления.ЧасоваяТарифнаяСтавка;
		КонецЕсли;
		
		// Найдем такой же вид расчета среди незакрытых строк с целью завершения его действия
		Строки = Новый Массив;
		//О.Т. Аверсон 03.04.2018  
		НезакрытыеСтроки1 = Новый Массив;
		Для Каждого стр из НезакрытыеСтроки Цикл 
			Попытка
				
				Проверка = стр.ФизЛицо;
				НезакрытыеСтроки1.Добавить(стр);
			Исключение
				
			КонецПопытки;
		КонецЦикла;
		
		НезакрытыеСтроки = НезакрытыеСтроки1;
		//О.Т. Аверсон 03.04.2018 Проверка, если строка удалена, чтоб не добавлять в массив
		
		НайтиСредиНезакрытых(НезакрытыеСтроки, Начисления.ОсновноеНачисление, Начисления.ВидРасчета, Строки);
		ПрерватьОбход = Ложь;
		
		НачислениеИзДетскогоПособия = Ложь;
		для Каждого стрПособия из Справочники.ГруппыРасчетов.ДетскиеПособия.Основные Цикл 
			Если Начисления.ВидРасчета = стрПособия.ВидРасчета Тогда 
				НачислениеИзДетскогоПособия = Истина;
				//+ СВЭЙ КДЯ 15.08.19 СВФР-004652
				Прервать;
				//- СВЭЙ КДЯ 15.08.19 СВФР-004652
			КонецЕсли;
		КонецЦикла;
		
		
		Если Строки.Количество() > 0 и Начисления.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаВторогоИПоследующихДо3Лет 
			и Начисления.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаРебенкаСтарше3Лет 
			и Начисления.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПособиеНаДетейОт3До18
			и Начисления.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей
			и Начисления.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид //О.Т. Аверсон 14.06.2018 № 
			и Начисления.ВидРасчета.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида //О.Т. Аверсон 19.07.2018 № 2252
			и НачислениеИзДетскогоПособия = Ложь Тогда //О.Т. Аверсон 23.06.2016 № 1267, 1771
			// нашли
			Для каждого Строка Из Строки Цикл
				Если Строка.ДатаНачала = Начисления.Период Тогда
					Если Начисления.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
						ИндексСтроки = НезакрытыеСтроки.Найти(Строка);
						НезакрытыеСтроки.Удалить(ИндексСтроки);
						ИндексСтроки = 0;
						Для каждого СтрокаМассива Из СтрокиНачисленийТекущегоНазначения Цикл
							Если СтрокаМассива = Строка Тогда
								СтрокиНачисленийТекущегоНазначения.Удалить(ИндексСтроки);
								Прервать;
							Иначе
								ИндексСтроки = ИндексСтроки + 1;
							КонецЕсли;
						КонецЦикла;
						ТЗНачисления.Удалить(Строка);
					Иначе
						// если дата та же - новую строку в формируемую таблицу значений не вводим, а меняем данные 
						// и оставляем строку "незакрытой"
						Строка.ВидРасчета = Начисления.ВидРасчета;// вид расчета необходимо переопределять для основного начисления
						Строка.ПодразделениеОрганизации = Начисления.ПодразделениеОрганизации;
						Строка.СпособРасчета = Начисления.СпособРасчета;
						Строка.ГрафикРаботы = Начисления.ГрафикРаботы;
						
						//Аверсон 16.06.2022 КВВ СВФР-009202 (
						Если ЕстьКолонкаПериодНомерСтроки Тогда
							Строка.ПериодНомерСтроки = Начисления.ПериодНомерСтроки; 
						КонецЕсли;
						//Аверсон 16.06.2022 КВВ СВФР-009202 )
						
						Строка.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
						Строка.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
						//толик стаж не затирать процент 
						Если Начисления.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентомОтТС и Начисления.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПоМесячнойТарифнойСтавкеПоДням и Начисления.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом Тогда
							Строка.Показатель1 = Показатель1;
						КонецЕсли;
						Строка.Показатель2 = Показатель2;
						Строка.Показатель3 = Показатель3;
						Строка.Показатель4 = Показатель4;						
						Строка.Показатель5 = Показатель5;
						Строка.Показатель6 = Показатель6;						
					КонецЕсли;
					ПрерватьОбход = Истина;
				ИначеЕсли Начисления.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой Тогда
					// "закрываем" строку и удаляем из массива незакрытых - кроме 
					// начислений фиксированной суммой (они принудительно не разбиваются на части)
					
					Если Не ЗначениеЗаполнено(Строка.ДатаОкончания) Или Строка.ДатаОкончания > Начисления.Период-1 Тогда
						Строка.ДатаОкончания = Начисления.Период-1;
						//Строка.ДатаОкончания = КонецМесяца(Начисления.Период);
					КонецЕсли;
					ИндексСтроки = НезакрытыеСтроки.Найти(Строка);
					НезакрытыеСтроки.Удалить(ИндексСтроки);
				ИначеЕсли Начисления.ПериодНачисления = Начисления.Период  Тогда 
					// для начислений фиксированной суммой рассматриваем строки, образовавшиеся из-за изменения данных о начислении, 
					// данные о перемещениях работника пропускаем
					
					// "закрываем" строку 
					Строка.ДатаОкончания = Начисления.Период-1;
					// и удаляем из массива незакрытых - если пользователем был изменен размер начисления
					Если Начисления.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
						ИндексСтроки = НезакрытыеСтроки.Найти(Строка);
						НезакрытыеСтроки.Удалить(ИндексСтроки);
					КонецЕсли;
				Иначе
					ПрерватьОбход = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ПрерватьОбход Или Начисления.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавим новую строку начислений
		Если ?(ЗначениеЗаполнено(Начисления.ПериодЗавершения),не Начисления.ПериодЗавершения<Начисления.Период,истина) Тогда
			НоваяСтрока = ТЗНачисления.Добавить();
			НоваяСтрока.Сотрудник = Начисления.Сотрудник;
			НоваяСтрока.ТабНомер = Начисления.ТабНомер; //Островская Татьяна 22.01.2014 № 17057
			НоваяСтрока.Физлицо = Начисления.Физлицо;
			НоваяСтрока.ВидРасчета = Начисления.ВидРасчета;
			если не Строка(ТипЗнч(Начисления.ВидРасчета) )="Дополнительные начисления организаций" Тогда
				НоваяСтрока.КодВычета = Начисления.КодВычета;
			Иначе 
				НоваяСтрока.КодВычета = Начисления.ВидРасчета.КодДоходаНДФЛ.КодВычета;
			КонецЕсли;
			
			
			НоваяСтрока.Показатель1 = Показатель1;
			НоваяСтрока.Показатель2 = Показатель2;
			НоваяСтрока.Показатель3 = Показатель3;
			НоваяСтрока.Показатель4 = Показатель4;								
			НоваяСтрока.Показатель5 = Показатель5;
			НоваяСтрока.Показатель6 = Показатель6;
			
			
			НоваяСтрока.Основное = Начисления.ОсновноеНачисление;
			НоваяСтрока.ДатаНачала = Начисления.Период;
			НоваяСтрока.ДатаНачалаСобытия = Начисления.ДатаНачалаСобытия;
			НоваяСтрока.ПодразделениеОрганизации = Начисления.ПодразделениеОрганизации;
			НоваяСтрока.СпособРасчета = Начисления.СпособРасчета;
			НоваяСтрока.ВидВремени = Начисления.ВидВремени;
			НоваяСтрока.ГрафикРаботы = Начисления.ГрафикРаботы;
			
			//Аверсон 16.06.2022 КВВ СВФР-009202 (
			Если ЕстьКолонкаПериодНомерСтроки Тогда
				НоваяСтрока.ПериодНомерСтроки = Начисления.ПериодНомерСтроки; 
			КонецЕсли;
			//Аверсон 16.06.2022 КВВ СВФР-009202 )
			
			НоваяСтрока.СуммированныйУчетРабочегоВремени = Начисления.СуммированныйУчетРабочегоВремени;
			//О.Т. Аверсон 13.07.2016
			Если ЗначениеЗаполнено(Начисления.ПериодЗавершения) Тогда 
				НоваяСтрока.ДатаОкончания = Начисления.ПериодЗавершения;
			КонецЕсли;
			//О.Т. Аверсон 13.07.2016
			
			НезакрытыеСтроки.Добавить(НоваяСтрока);
			Если Начисления.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ФиксированнойСуммой Тогда
				СтрокиНачисленийТекущегоНазначения.Добавить(НоваяСтрока);
			КонецЕсли;
		КонецЕсли;
		
		
		
		СотрудникПрошл = Начисления.Сотрудник;//О.Т. Аверсон 18.05.2017 № 952
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	//О.Т. Аверсон 03.04.2018  
	НезакрытыеСтроки1 = Новый Массив;
	Для Каждого стр из НезакрытыеСтроки Цикл 
		Попытка
			
			Проверка = стр.ФизЛицо;
			НезакрытыеСтроки1.Добавить(стр);
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	
	НезакрытыеСтроки = НезакрытыеСтроки1;
	//О.Т. Аверсон 03.04.2018 Проверка, если строка удалена, чтоб не добавлять в массив
	
	// закрываем незакрытые строки по последнему работнику концом месяца
	ЗакрытьСтроки(ТЗНачисления, НезакрытыеСтроки, ОкончаниеПериодаЗаполнения);
	
	
	ТЗНачисления.Сортировать("ТабНомер Возр, Сотрудник Возр, ДатаНачала Возр"); //Островская Татьяна 22.01.2014 № 17057
	//енд толик
	
	Возврат ТЗНачисления;
	
КонецФункции

Процедура ЗакрытьСтроки(ТЗ, НезакрытыеСтроки, ДатаОкончания) //О.Т. Аверсон 29.05.2018 № 2013
	
	Для Каждого Строка Из НезакрытыеСтроки Цикл
		Если Строка.ВидРасчета = Неопределено ИЛИ Строка.ДатаНачала > ДатаОкончания Тогда
			ТЗ.Удалить(Строка);
		ИначеЕсли Строка.ДатаОкончания = '00010101' или Строка.ДатаОкончания > ДатаОкончания Тогда
			Строка.ДатаОкончания = ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	НезакрытыеСтроки.Очистить();
	
КонецПроцедуры // ЗакрытьСтроки()

// Найти строку в массиве строк по переданному виду расчета или по признаку "Основное"
// Найденная строка и ее индекс возвращаются через переданные параметры Строка и ИндексСтроки
// Параметры:
//  НезакрытыеСтроки - массив строк таблицы значений
//	ПоискОсновного - признак поиска основного начисления
//  ВидРасчета - вид расчета ссылка
//  Строка - в этот параметр будет возвращена строка, начальное значение - Неопределено
//  ИндексСтроки - в этот параметр будет возвращен индекс строки, начальное значение - Неопределено
//
// Возвращаемое зеначение:
//  нет
//
Процедура НайтиСредиНезакрытых(НезакрытыеСтроки, ПоискОсновного, ВидРасчета, Строки)//О.Т. Аверсон 29.05.2018 № 2013
	Количество = НезакрытыеСтроки.Количество();
	Для Сч = 1 По Количество Цикл
		Индекс = Количество - Сч;
		Если (ПоискОсновного И НезакрытыеСтроки[Индекс].Основное) 
			ИЛИ (НЕ ПоискОсновного И НезакрытыеСтроки[Индекс].ВидРасчета = ВидРасчета) Тогда
			Строки.Добавить(НезакрытыеСтроки[Индекс]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // НайтиСредиНезакрытых()

Функция СформироватьЗапросПоНачисления1(ВыборкаПоШапкеДокумента, Физлицо = Неопределено)//О.Т. Аверсон 29.05.2018 № 2013
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	
	Запрос.УстановитьПараметр("парамФизлицо", Физлицо);
	Запрос.УстановитьПараметр("парамНеОтбиратьФизлицо", Физлицо = Неопределено);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиДокумента.Ссылка,
	|	СтрокиДокумента.НомерСтроки,
	|	СтрокиДокумента.Сотрудник КАК Сотрудник,
	|	СтрокиДокумента.Физлицо,
	|	СтрокиДокумента.ВидРасчета,
	|	НАЧАЛОПЕРИОДА(СтрокиДокумента.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
	|	СтрокиДокумента.ДатаНачала,
	|	СтрокиДокумента.ДатаОкончания,
	|	СтрокиДокумента.Показатель1,
	|	СтрокиДокумента.Показатель2,
	|	СтрокиДокумента.Показатель3,
	|	СтрокиДокумента.Показатель4,
	|	СтрокиДокумента.Показатель5,
	|	СтрокиДокумента.Показатель6,
	|	СтрокиДокумента.Результат,
	|	СтрокиДокумента.ПодразделениеОрганизации,
	|	истина как Авторасчет,
	|	СтрокиДокумента.Сторно,
	|	Ложь как СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТСтрокиНачислений
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК СтрокиДокумента
	|ГДЕ
	|	СтрокиДокумента.Ссылка = &ДокументСсылка
	|	И (&парамНеОтбиратьФизлицо
	|			ИЛИ СтрокиДокумента.Сотрудник.Физлицо = &парамФизлицо)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	// ВТГрафикиСотрудников
	//		таблица содержит номера строк документа с данными о графике указанного
	//		в этой строке сотрудника из рег-ра сведений РаботникиОрганизации
	// 
	//	Поля:
	//		НомерСтроки
	//      ГрафикРаботы
	//      ГрафикПолногоРабочегоВремени
	//      СуммированныйУчетРабочегоВремени
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоследниеДаты.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|	КОНЕЦ КАК ГрафикПолногоРабочегоВремени,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|	КОНЕЦ КАК СуммированныйУчетРабочегоВремени
	|ПОМЕСТИТЬ ВТГрафикиСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
	|		СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|		СтрокиНачисления.Сотрудник КАК Сотрудник,
	|		СтрокиНачисления.ДатаНачала КАК ДатаНачалаСобытия
	|	ИЗ
	|		ВТСтрокиНачислений КАК СтрокиНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|			ПО СтрокиНачисления.ДатаНачала >= РаботникиОрганизации.Период
	|				И СтрокиНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиНачисления.НомерСтроки,
	|		СтрокиНачисления.Сотрудник,
	|		СтрокиНачисления.ДатаНачала) КАК ПоследниеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО ПоследниеДаты.МаксПериод = РаботникиОрганизации.Период
	|			И ПоследниеДаты.Сотрудник = РаботникиОрганизации.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// ВТДанныеИндивидуальныхГрафиковИТабелей
	//		таблица содержит номера строк документа с сотрудниками, для которых введены 
	//		подробные документы использования времени: инд.графики и/или табели
	// 
	//	Поля:
	//		НомерСтроки
	//      План
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|	ГрафикиРаботыПоВидамВремени.План КАК План
	|ПОМЕСТИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	|ИЗ
	|	ВТСтрокиНачислений КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СтрокиНачисления.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СтрокиНачисления.ПериодДействия = ГрафикиРаботыПоВидамВремени.Месяц
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	План";
	Запрос.Выполнить();
	
	// СводныеИндивидуальныеГрафикиРаботы
	//		таблица содержит номера строк документа с сотрудниками, для которых введены сводные 
	//		данные об их графике
	// 
	//	Поля:
	//		НомерСтроки
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокРаботников.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТСводныеИндивидуальныеГрафикиРаботы
	|ИЗ
	|	ВТСтрокиНачислений КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	|			И СписокРаботников.ПериодДействия = СводныеИндивидуальныеГрафики.Месяц
	|ГДЕ
	|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиНачисления.Сотрудник КАК Сотрудник,
	|	СтрокиНачисления.Сотрудник.Физлицо КАК Физлицо,
	|	СтрокиНачисления.ВидРасчета КАК ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	СтрокиНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
	|	СтрокиНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	СтрокиНачисления.ВидРасчета.ВидВремени КАК ВидВремени,
	|	СтрокиНачисления.ДатаНачала КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета.ПериодДействияБазовый
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОГДА СтрокиНачисления.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СтрокиНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
	|	КОНЕЦ КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета.ПериодДействияБазовый
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОГДА СтрокиНачисления.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(СтрокиНачисления.ДатаОкончания, МЕСЯЦ, -1), МЕСЯЦ)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|	СтрокиНачисления.Показатель1 КАК Показатель1,
	|	СтрокиНачисления.Показатель2 КАК Показатель2,
	|	СтрокиНачисления.Показатель3 КАК Показатель3,
	|	СтрокиНачисления.Показатель4 КАК Показатель4,
	|	СтрокиНачисления.Показатель5 КАК Показатель5,
	|	СтрокиНачисления.Показатель6 КАК Показатель6,
	|	СтрокиНачисления.Результат КАК Результат,
	|	СтрокиНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	СтрокиНачисления.Сторно КАК Сторно,
	|	0 КАК ОтработаноДней,
	|	0 КАК ОтработаноЧасов,
	|	0 КАК ОтработаноДнейПоПятидневке,
	|	0 КАК ОтработаноЧасовПоПятидневке,
	|	0 КАК НормаДней,
	|	0 КАК НормаЧасов,
	|	0 КАК НормаДнейПоПятидневке,
	|	0 КАК НормаЧасовПоПятидневке,
	//толик
	|	0 КАК ЧасыИзДокумента,
	|	0 КАК ОплаченоДней,
	//
	
	|	СтрокиНачисления.ДатаНачала КАК ДатаНачалаСобытия,
	|	истина КАК Авторасчет,
	|	0 КАК ОплаченоДнейЧасов,
	|	ВЫБОР
	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА РаботникиОрганизации.ГрафикРаботы
	|		ИНАЧЕ СтрокиНачисления.Сотрудник
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	// если введен табель, но нет индивидуального графика, то норму времени надо считать по данным ""общего графика""
	|		КОГДА ТабелиУчетаВремениПоСотруднику.НомерСтроки ЕСТЬ НЕ NULL 
	|				И ИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ NULL 
	|				И СводныеИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА РаботникиОрганизации.ГрафикРаботы
	// если у работника сокращенное рабочее время, а норма времени определяется по полному графику
	// и введен индивидуальный график, то норму времени надо считать по-прежнему по данным ""общего графика""
	|		КОГДА РаботникиОрганизации.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|				И (ИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL 
	|					ИЛИ СводныеИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL )
	|			ТОГДА РаботникиОрганизации.ГрафикПолногоРабочегоВремени
	|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы //О.Т. Аверсон 01.11.2017 № 1189
	|	КОНЕЦ КАК ГрафикРаботыНорма,
	|	ЕСТЬNULL(РаботникиОрганизации.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	0 как ОплачиватьЧасов,
	|	СтрокиНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	НЕОПРЕДЕЛЕНО КАК СторнируемыйДокумент
	|ИЗ
	|	ВТСтрокиНачислений КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСотрудников КАК РаботникиОрганизации
	|		ПО СтрокиНачисления.НомерСтроки = РаботникиОрганизации.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК СтрокиНачисления) КАК ГрафикРаботыПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК СтрокиНачисления
	|		ГДЕ
	|			(НЕ СтрокиНачисления.План)) КАК ТабелиУчетаВремениПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ТабелиУчетаВремениПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК СтрокиНачисления
	|		ГДЕ
	|			СтрокиНачисления.План) КАК ИндивидуальныеГрафикиРаботы
	|		ПО СтрокиНачисления.НомерСтроки = ИндивидуальныеГрафикиРаботы.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСводныеИндивидуальныеГрафикиРаботы КАК СводныеИндивидуальныеГрафикиРаботы
	|		ПО СтрокиНачисления.НомерСтроки = СводныеИндивидуальныеГрафикиРаботы.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	//Аверсон-софт, Островская Татьяна 20.04.2012
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей) //О.Т. Аверсон 29.05.2018 № 2013
	
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Движение.ПериодРегистрации				= ПериодРегистрации;
	Движение.ПериодДействияНачало			= ВыборкаПоСтрокамДокумента.ПериодДействияНачало;
	Движение.ПериодДействияКонец			= ВыборкаПоСтрокамДокумента.ПериодДействияКонец;
	Движение.БазовыйПериодНачало			= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
	Движение.БазовыйПериодКонец				= ВыборкаПоСтрокамДокумента.БазовыйПериодКонец;
	Движение.ВидРасчета						= ВыборкаПоСтрокамДокумента.ВидРасчета;
	Движение.Сторно							= ВыборкаПоСтрокамДокумента.Сторно;
	
	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ФизЛицо						= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Организация					= ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	// Ресурсы
	Движение.Результат						= ВыборкаПоСтрокамДокумента.Результат;
	
	
	
	// Реквизиты
	Движение.ГрафикРаботы					= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
	Движение.ГрафикРаботыНорма				= ВыборкаПоСтрокамДокумента.ГрафикРаботыНорма;
	Для Сч = 1 По 6 Цикл
		Движение["Показатель"+Сч]			= ВыборкаПоСтрокамДокумента["Показатель"+Сч];
	КонецЦикла;
	
	//О.Т. Аверсон 19.12.2017 № 1369
	Запрос1 = Новый Запрос;
	Запрос1.Текст =
	
	"ВЫБРАТЬ
	|	СтрокиДокумента.Ссылка,
	|	СтрокиДокумента.НомерСтроки,
	|	СтрокиДокумента.Сотрудник КАК Сотрудник,
	|	СтрокиДокумента.Физлицо,
	|	СтрокиДокумента.ВидРасчета,
	|	НАЧАЛОПЕРИОДА(СтрокиДокумента.ДатаНачала, МЕСЯЦ) КАК ПериодДействия
	|ИЗ
	|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК СтрокиДокумента
	|ГДЕ
	|	СтрокиДокумента.ВидРасчета = &ВидРасчета
	|	И СтрокиДокумента.Ссылка = &ДокументСсылка
	|	И СтрокиДокумента.Сотрудник = &парамФизлицо
	|	И &ДатаНачала МЕЖДУ СтрокиДокумента.ДатаНачала И СтрокиДокумента.ДатаОкончания";
	Запрос1.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос1.УстановитьПараметр("ДатаНачала", ВыборкаПоСтрокамДокумента.ПериодДействияНачало);
	
	Запрос1.УстановитьПараметр("парамФизлицо", ВыборкаПоСтрокамДокумента.Сотрудник);
	Запрос1.УстановитьПараметр("ВидРасчета",  ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	Выборка = Запрос1.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		ВидРасчета1 = Выборка.ВидРасчета;
	КонецЦикла;
	//О.Т. Аверсон 19.12.2017 № 1369
	
	
	Движение.ВидУчетаВремени				= ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоСтрокамДокумента.СпособРасчета, ВыборкаПоСтрокамДокумента.ВидВремени, ВыборкаПоСтрокамДокумента.СуммированныйУчетРабочегоВремени, ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени,ВидРасчета1);
	Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
	Движение.ОбособленноеПодразделение		= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ДатаНачалаСобытия				= ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия;
	Движение.Авторасчет						= Истина;
	Движение.ВариантОбработкиЗаписиПриОтраженииВРеглУчете = ВыборкаПоСтрокамДокумента.ВариантОбработкиЗаписиПриОтраженииВРеглУчете;	
	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "") //О.Т. Аверсон 29.05.2018 № 2013
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// ФизЛицо
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный работник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидПособия
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид пособия!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаСобытия
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата события!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

Процедура РассчитатьПособия(Начисление = Неопределено) Экспорт //О.Т. Аверсон 29.05.2018 № 2013
	Перем ВалютаУпрУчета;
	Перем КурсВалютыУпрУчета;
	
	Отказ = Ложь;
	// Создадим рабочие наборы записей
	НаборОсновныеНачисления = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	ЗаписиДоходовНДФЛ = Неопределено;//РегистрыНакопления.НДФЛСведенияОДоходах.СоздатьНаборЗаписей();
	//ЗаписиДоходовНДФЛ.Отбор.Регистратор.Значение = Ссылка;
	НаборРасчетСреднего = Неопределено;//РегистрыРасчета.РасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	//НаборРасчетСреднего.Отбор.Регистратор.Значение = Ссылка;
	
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ВыборкаПоНачислениям = СформироватьЗапросПоНачисления1(ВыборкаПоШапкеДокумента).Выбрать();
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоНачислениям, Отказ);
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, НаборОсновныеНачисления);
			
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		
		// Удаляем движения
		Для Каждого Набор Из Движения Цикл
			Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") Тогда
				
				// Удаляем движения
				Набор.Очистить();
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
		Отказ = Ложь;
	КонецЕсли;
	
	СведенияОДоначислениях = Новый Соответствие;
	// категория начисления в которой встречены виды расчета со способом ДоначислениеПоУправленческомуУчету 
	КатегорияДоначисления = Неопределено;
	ПроведениеРасчетов.ПолучитьКурсВалютыУпрУчета(ПериодРегистрации, ВалютаУпрУчета, КурсВалютыУпрУчета, Константы.ВалютаРегламентированногоУчета.Получить());
	МассивИндексыСтрокНачисления = Неопределено;
	
	
	
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", НаборОсновныеНачисления, ЗаписиДоходовНДФЛ, НаборРасчетСреднего, ОбщегоНазначения.ГоловнаяОрганизация(Организация), ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОсновныеНачисления, Ложь, Ложь, КатегорияДоначисления, СведенияОДоначислениях, КурсВалютыУпрУчета, МассивИндексыСтрокНачисления, Неопределено, Ложь);
	
	
	// Удаляем движения
	Для Каждого Набор Из Движения Цикл
		Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") Тогда
			
			// Удаляем движения
			Набор.Очистить();
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;    
	
КонецПроцедуры

Процедура СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, НаборЗаписей, УчетЗадолженностиПоМесяцам, Перерасчет = Ложь, Физлица = Неопределено)
	
	ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;
	НачисленияРаботниковТекст =
	"ВЫБРАТЬ
	|	Доходы.Физлицо КАК Физлицо,
	|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основные.Сотрудник.Физлицо КАК Физлицо,
	|		Основные.Результат КАК СуммаДохода
	|	ИЗ
	|		Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК Основные
	|	ГДЕ
	|		Основные.Ссылка = &парамСсылка
	|		И Основные.Результат <> 0
	|		И (НЕ Основные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)) КАК Доходы
	|	
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Физлицо";
	
	Запрос = Новый Запрос(НачисленияРаботниковТекст);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",	КонецМесяца(ПериодРегистрации));
	
	Доходы = Запрос.Выполнить().Выбрать();
	// сформируем движения по суммам к выплате
	//Аверсон-софт, Островская Татьяна 17.05.2012 Перенос
	Пока Доходы.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		
		// свойства
		Движение.Период					= КонецМесяца(ПериодРегистрации);
		Движение.ВидДвижения		= ВидДвиженияНакопления.Приход;
		
		// измерения
		Движение.Физлицо				= Доходы.Физлицо;
		Движение.Организация			= Организация;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
		КонецЕсли;
		
		// ресурсы
		Движение.СуммаВзаиморасчетов	= Доходы.СуммаДохода;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьНДФЛСведенияОДоходах(ВыборкаПоШапкеДокумента, НаборЗаписей, КакаяТЧ) 
	
	//СВЭЙ 29.11.2023 КВВ СВФР-011907 (
	Запрос = Новый Запрос;
	
	Если КакаяТЧ = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|ВЫБОР КОГДА Основные.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ВСвязиСоСмертью)
		|ТОГДА &КодВР1
		|ИНАЧЕ
		|ВЫБОР КОГДА Основные.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности)
		|ТОГДА &КодВР2
		|ИНАЧЕ
		|ВЫБОР КОГДА Основные.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПриРожденииРебенка)
		|ТОГДА &КодВР3
		|ИНАЧЕ
		|ВЫБОР КОГДА Основные.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей)
		|ТОГДА &КодВР4
		|ИНАЧЕ &КодВР5
		|КОНЕЦ
		|КОНЕЦ
		|КОНЕЦ
		|КОНЕЦ КАК КодДоходаНДФЛ,
		|Основные.Физлицо КАК Физлицо,
		|Основные.Результат,
		|НАЧАЛОПЕРИОДА(Основные.ДатаСобытия,МЕСЯЦ) КАК ПериодДока
		|ПОМЕСТИТЬ ВтТЧ1
		|ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК Основные
		|ГДЕ
		|Основные.Ссылка = &парамСсылка
		|И Основные.Результат <> 0
		|;
		|ВЫБРАТЬ *,
		|&Подр КАК ПодразделениеОрганизации
		|ИЗ ВтТЧ1
		|ГДЕ
		|ВтТЧ1.КодДоходаНДФЛ <> &ПустойКодДоходаНДФЛ";
						
		Запрос.УстановитьПараметр("КодВР1", ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ВСвязиСоСмертью.КодДоходаНДФЛ);
		Запрос.УстановитьПараметр("КодВР2", ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности.КодДоходаНДФЛ);
		Запрос.УстановитьПараметр("КодВР3", ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка.КодДоходаНДФЛ);
		Запрос.УстановитьПараметр("КодВР4", ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей.КодДоходаНДФЛ);
		Запрос.УстановитьПараметр("КодВР5", ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка.КодДоходаНДФЛ);
		Запрос.УстановитьПараметр("Подр", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|Основные.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
		|Основные.Сотрудник.Физлицо КАК Физлицо,
		|Основные.ПодразделениеОрганизации,
		|Основные.Результат,
		|НАЧАЛОПЕРИОДА(Основные.ДатаНачала,МЕСЯЦ) КАК ПериодДока
		|ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК Основные
		|ГДЕ
		|Основные.Ссылка = &парамСсылка
		|И Основные.ВидРасчета.КодДоходаНДФЛ <> &ПустойКодДоходаНДФЛ
		|И Основные.Результат <> 0";
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ПустойКодДоходаНДФЛ", Справочники.ДоходыНДФЛ.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	
	Доходы = Запрос.Выполнить().Выбрать();
	Пока Доходы.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.ПериодРегистрации	=  НачалоМесяца(ПериодРегистрации);
		Движение.Организация = Организация;
		Движение.ФизЛицо = Доходы.Физлицо;
		Движение.КодДохода = Доходы.КодДоходаНДФЛ;
		Движение.Период = НачалоМесяца(Доходы.ПериодДока);
		Движение.СуммаДохода = Доходы.Результат; 
		Если  ЗначениеЗаполнено(Доходы.КодДоходаНДФЛ) Тогда
			Попытка 
				Если (Число(СокрЛП(Доходы.КодДоходаНДФЛ))>501 и Число(СокрЛП(Доходы.КодДоходаНДФЛ))< 900) Тогда  
					Движение.КодВычета 	            = Справочники.ВычетыНДФЛ.НайтиПоКоду(Доходы.КодДоходаНДФЛ);
					Движение.СуммаВычета			= Доходы.Результат;   
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		Движение.ОбособленноеПодразделение = Организация;
		Движение.ИсчисленоИзЗарплаты = Истина;
		Движение.ПодразделениеОрганизации = Доходы.ПодразделениеОрганизации; 
	КонецЦикла;
	//СВЭЙ 29.11.2023 КВВ СВФР-011907 )
	
КонецПроцедуры
