////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток, мНаборЗаписей;
Перем СоответствиеВалютныеСпособыРасчета;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда
	// СВЭЙ СВФР-015593 СОА 24.04.2025 (  
	
	// Функция формирует табличный документ с печатной формой "ПриказОПриемеНаРаботу",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьПриказОПриемеНаРаботу(ВидПечатнойФормы)
		Если ВидПечатнойФормы = "ОдинСотрудник" Тогда
			Форма = ПолучитьФорму("ФормаДокумента");
			Форма.Активизировать();
			ФизЛицо = Форма.ЭлементыФормы.РаботникиОрганизации.ТекущаяСтрока.ФизЛицо;
		Иначе
			Физлицо = Неопределено;
		КонецЕсли;	
		
		мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаРаботуВОрганизацию_ПриказОПриемеНаРаботу";
		
		// получаем данные для печати 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
		|	ОрганизацииОтветственныеЛица.Сотрудник КАК Сотрудник,
		|	Организации.Наименование,
		|	ОрганизацииОтветственныеЛица.Дата КАК Дата,
		|	ОрганизацииОтветственныеЛица.Должность
		|ИЗ
		|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ОрганизацииОтветственныеЛица.Ссылка = Организации.Ссылка
		|ГДЕ
		|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
		|	И Организации.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		Запрос.УстановитьПараметр("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Запрос.УстановитьПараметр("Наименование", Организация.Наименование);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Руководитель = Результат.Сотрудник; 
			ДолжностьРуководителя = Результат.Должность;
		КонецЦикла;
		Если не Руководитель = Неопределено Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФИОФизЛиц.Фамилия,
			|	ФИОФизЛиц.Имя,
			|	ФИОФизЛиц.Отчество,
			|	ФИОФизЛиц.ФизЛицо
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
			|ГДЕ
			|	ФИОФизЛиц.ФизЛицо = &ФизЛицо";
			
			Запрос.УстановитьПараметр("ФизЛицо",Результат.Сотрудник.ФизЛицо);
			
			Результат1 = Запрос.Выполнить().Выбрать();
			Пока Результат1.Следующий() цикл
				Фамилия = Результат1.Фамилия;
				Имя = Лев(Результат1.Имя,1);
				Отчество = Лев(Результат1.Отчество,1);
				ФИО = Имя+"."+Отчество+"."+ " "+Фамилия;
			КонецЦикла;
		КонецЕсли; 
			
	
	ЗапросСклонения = Новый Запрос;
	ЗапросСклонения.Текст = 
		"ВЫБРАТЬ
		|	Склонение.Значение
		|ИЗ
		|	РегистрСведений.Склонение КАК Склонение
		|ГДЕ
		|	Склонение.Объект = &Объект
		|	И Склонение.Падеж = &Падеж";
	
		ЗапросСклонения.УстановитьПараметр("Падеж", Перечисления.Падеж.Родительный);
		
	

		
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// запоминаем области макета
		Макет = ПолучитьМакет("ПриказОПриемеНаРаботу");
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
		ОбластьМакетаРуководитель = Макет.ПолучитьОбласть("Руководитель"); 	
		ОбластьМакетаФизлицо = Макет.ПолучитьОбласть("Физлицо"); 	
		ОбластьМакетаДата = Макет.ПолучитьОбласть("Дата"); 	
		
		// выводим данные о руководителях организации
		Если ВыборкаДляШапки.Следующий() Тогда
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			//ВидЗанятости = ВыборкаДляШапки.ВидЗанятости;
			//Заполнить(ВыборкаДляШапки); 
			
		КонецЕсли;
		
		//Если ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Работник"); 
		//ИначеЕсли ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("Совместитель"); 
		//КонецЕсли;	
		
		//СведенияОбОрганизации = ДоступКОбъектам.СведенияОЮрФизЛице(Организация, Дата);
		Если ВидПечатнойФормы = "ОдинСотрудник" Тогда
			ДатаП = Форма.ЭлементыФормы.РаботникиОрганизации.ТекущаяСтрока.ДатаПриказа;
			ДатаНаПечать = Формат(?(ЗначениеЗаполнено(ДатаП),ДатаП,?(ЗначениеЗаполнено(ДатаПриказа),ДатаПриказа,Дата)),"ДФ='дд ММММ гггг'");
		Иначе
			ДатаНаПечать = Формат(?(ЗначениеЗаполнено(ДатаПриказа),ДатаПриказа,Дата),"ДФ='дд ММММ гггг'");
		КонецЕсли;
		Если ВидПечатнойФормы = "ОдинСотрудник" Тогда
			НомерП = Форма.ЭлементыФормы.РаботникиОрганизации.ТекущаяСтрока.НомерПриказа;
			НомерДокДляПечати = ?(ЗначениеЗаполнено(НомерП),НомерП,?(ЗначениеЗаполнено(ВыборкаДляШапки.НомерД),ВыборкаДляШапки.НомерД,ВыборкаДляШапки.НомерДок));
		Иначе
			НомерДокДляПечати = ?(ЗначениеЗаполнено(ВыборкаДляШапки.НомерД),ВыборкаДляШапки.НомерД,ВыборкаДляШапки.НомерДок);
		КонецЕсли;
		ОбластьМакетаШапка.Параметры.ДатаДок = ДатаНаПечать; 
		ОбластьМакетаШапка.Параметры.НомерДок = НомерДокДляПечати; 
		//ОбластьМакетаШапка.Параметры.НаселенныйПункт = ?(ЗначениеЗаполнено(ГородПриказа), ГородПриказа,"г.Минск"); 
		ОбластьМакетаШапка.Параметры.НаселенныйПункт = "г.Минск";
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьМакетаДата.Параметры.ДатаДок = ДатаНаПечать; 
		
		МассивФизлиц = Новый Массив();
		
		КоличествоСтрок = ВыборкаРаботники.Количество();
		
		// Начинаем формировать выходной документ
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ВложеннаяВыборка = ВыборкаРаботники.Выбрать(); 
			ВложеннаяВыборка.Следующий();
			
			Если Не Физлицо = Неопределено Тогда
				ОбластьМакета.Параметры.НомерСтроки = 1; 
			Иначе	
				ОбластьМакета.Параметры.НомерСтроки = ВложеннаяВыборка.НомерСтроки;
			КонецЕсли;	
			
			// Данные по работнику.
			
			печФизЛицо = ВложеннаяВыборка.Физлицо;
			ПолСотрудника = печФизЛицо.Пол;
			
			ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ВложеннаяВыборка.Работник,4,ПолСотрудника,,ложь);
			ФразаСклоненнаяДолжность = ""; 
			ЗапросСклонения.УстановитьПараметр("Объект", ВложеннаяВыборка.ДолжностьСсылка);
			РезультатЗапросаСклонения = ЗапросСклонения.Выполнить();
			Если РезультатЗапросаСклонения.Пустой() Тогда
				УправлениеОтчетами.Просклонять(глСклонение,ВложеннаяВыборка.Должность,2,ФразаСклоненнаяДолжность,,ложь);
			Иначе	
				ВыборкаСклонения = РезультатЗапросаСклонения.Выбрать();
				ВыборкаСклонения.Следующий();
				ФразаСклоненнаяДолжность = ВыборкаСклонения.Значение;
			КонецЕсли;			 
			
			ОбластьМакета.Параметры.Работник         = ФИОСклон;
			ОбластьМакета.Параметры.Подразделение    = НРег(ВложеннаяВыборка.Подразделение); 
			ОбластьМакета.Параметры.Должность        = ФразаСклоненнаяДолжность; 
			ОбластьМакета.Параметры.ДатаПриема       = Формат(ВложеннаяВыборка.ДатаПриема, "ДФ= 'дд.ММ.гггг'"); 
			Если НЕ ВложеннаяВыборка.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
				печВидРасчета       = "окладом";	
			Иначе	
				печВидРасчета       = НРег(ВложеннаяВыборка.СпособРасчета);			
			КонецЕсли;
			ОбластьМакета.Параметры.ВидРасчета       = печВидРасчета;
			ОбластьМакета.Параметры.Размер           = ВложеннаяВыборка.ОкладТарифнаяСтавка; 
			ОбластьМакета.Параметры.РазмерПрописью   = ЧислоПрописью(ВложеннаяВыборка.ОкладТарифнаяСтавка, ," ,  ,  , м, , , , м, 0");
			
			ОбластьМакета.Параметры.ФизлицоСокращено = УправлениеОтчетами.CклонятьФИО(глСклонение,ВложеннаяВыборка.Работник,2,ПолСотрудника,,ложь); 
														
			
			Если КоличествоСтрок = 1 Тогда
				
				ОбластьМакетаФизлицо.Параметры.ФизлицоСокращено = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ВложеннаяВыборка.Работник); 				
				ТабДокумент.Вывести(ОбластьМакета); 
				ОбластьМакетаРуководитель.Параметры.ДолжностьРуководителя = ДолжностьРуководителя;
				ОбластьМакетаРуководитель.Параметры.ФИОРуководителя =  ФИО;
				ТабДокумент.Вывести(ОбластьМакетаРуководитель);
				ТабДокумент.Вывести(ОбластьМакетаФизлицо);
				ТабДокумент.Вывести(ОбластьМакетаДата);
				
			Иначе
				ТабДокумент.Вывести(ОбластьМакета); 
				МассивФизлиц.Добавить(ВложеннаяВыборка.Работник);
				//МассивФизлиц.Добавить(ДанныеФизлица.Представление);
			КонецЕсли;
			
		КонецЦикла;
		Если КоличествоСтрок > 1 Тогда
			ТабДокумент.Вывести(ОбластьМакетаРуководитель);
			
			Для Каждого Элемент Из МассивФизлиц Цикл
				ОбластьМакетаФизлицо.Параметры.ФизлицоСокращено = Элемент; 
				ТабДокумент.Вывести(ОбластьМакетаФизлицо);
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьМакетаДата);
		КонецЕсли;
		
		ТабДокумент.Защита              = Ложь;
		ТабДокумент.ТолькоПросмотр      = Ложь;
		
		ТабДокумент.ПолеСверху      = 20;
		ТабДокумент.ПолеСлева       = 30;
		ТабДокумент.ПолеСправа      = 8;
		ТабДокумент.ПолеСнизу       = 20;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьПриказОПриемеНаРаботу()
	// СВЭЙ СВФР-015593 СОА 24.04.2025 )
	
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Т1_от_5_1_2004_1" Тогда
			ТабДокумент = ПечатьТ1(ИмяМакета);
			
		ИначеЕсли ИмяМакета = "Т1а_от_5_1_2004" тогда
			ТабДокумент = ПечатьТ1а(ИмяМакета); 
			// СВЭЙ СВФР-015593 СОА 24.04.2025(	
		ИначеЕсли ИмяМакета = "ПриказОприемеНаРаботу" Тогда
			ТабДокумент = ПечатьПриказОПриемеНаРаботу("ВсеСотрудники");
			// СВЭЙ СВФР-015593 СОА 24.04.2025)	
		КонецЕсли;
		
		Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Прием на работу в организацию "));
		
	КонецФункции // Печать()
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Т1а_от_5_1_2004",	"Форма Т-1а");
	СтруктураПечатныхФорм.Вставить("Т1_от_5_1_2004_1",	"Форма Т-1");
	// СВЭЙ СВФР-015593 СОА 24.04.2025(
	СтруктураПечатныхФорм.Вставить("ПриказОприемеНаРаботу",	"Приказ о приеме на работу");
	// СВЭЙ СВФР-015593 СОА 24.04.2025)
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Заполняет табличную часть документа "Работники" списком по оформленным трудовым договорам
//
Процедура ЗаполнитьТабличнуюЧастьРаботникиСотрудниками(ДатаНачалаПериода, ДатаОкончанияПериода) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода",		ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода",	ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.УстановитьПараметр("РайонныйКоэффициент",	РайонныйКоэффициент);
	
	УсловиеНаДатыРаботы = "";
	Если ЗначениеЗаполнено(ДатаНачалаПериода) Тогда
		УсловиеНаДатыРаботы = УсловиеНаДатыРаботы + Символы.ПС + Символы.Таб + "И <имя поля>.ДатаНачала >= &ДатаНачалаПериода";
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
		УсловиеНаДатыРаботы = УсловиеНаДатыРаботы + Символы.ПС + Символы.Таб + "И <имя поля>.ДатаНачала <= &ДатаОкончанияПериода";
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	|	СотрудникиОрганизаций.Физлицо КАК Физлицо,
	|	СотрудникиОрганизаций.Должность,
	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
	|	СотрудникиОрганизаций.ДатаНачала КАК ДатаПриема,
	|	СотрудникиОрганизаций.ДатаОкончания КАК ДатаУвольнения,
	|	СотрудникиОрганизаций.ИспытательныйСрок,
	|	СотрудникиОрганизаций.ГрафикРаботы,
	|	СотрудникиОрганизаций.Физлицо.Наименование КАК ФизлицоНаименование,
	|	СотрудникиОрганизаций.ВидРасчета КАК ВидРасчета,
	|	СотрудникиОрганизаций.РасчетнаяТарифнаяСтавка КАК Показатель1,
	|	NULL КАК Показатель2,
	|	NULL КАК Показатель3,
	|	NULL КАК Показатель4,
	|	СотрудникиОрганизаций.ВалютаТарифнойСтавки КАК Валюта1,
	|	NULL КАК Валюта2,
	|	NULL КАК Валюта3,
	|	NULL КАК Валюта4,
	|	СотрудникиОрганизаций.ТарифныйРазряд КАК ТарифныйРазряд1,
	|	NULL КАК ТарифныйРазряд2,
	|	NULL КАК ТарифныйРазряд3,
	|	NULL КАК ТарифныйРазряд4,
	|	СотрудникиОрганизаций.РасчетнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
	|	СотрудникиОрганизаций.РазрядЕТС,
	|	СотрудникиОрганизаций.КоэффициентЕТС,
	|	СотрудникиОрганизаций.ПроцентПовышения КАК ПроцентПоКонтракту,
	|	СотрудникиОрганизаций.Должность.Категория КАК Категория,
	|	СотрудникиОрганизаций.ТарифныйСПовышениемПоИнструкции,
	|	СотрудникиОрганизаций.ИтоговоеПовышениеПоИнструкции,
	|	СотрудникиОрганизаций.ТарифнаяСтавка,
	|	СотрудникиОрганизаций.РазмерСтавки1Разряда,
	|	СотрудникиОрганизаций.ПовышенныйКоэффициентЕТС,
	|	ВЫБОР
	|		КОГДА СотрудникиОрганизаций.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НапомнитьПоЗавершении,
	|	СотрудникиОрганизаций.ТарифнаяСтавкаПервогоРазряда,
	|	СотрудникиОрганизаций.УсловияТрудаИзмерение,
	|	СотрудникиОрганизаций.ВидДеятельностиИзмерение
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизаций.Организация
	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
	|			ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.Физлицо,
	|	СотрудникиОрганизаций.Должность,
	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
	|	СотрудникиОрганизаций.ДатаНачала,
	|	СотрудникиОрганизаций.ДатаОкончания,
	|	СотрудникиОрганизаций.ИспытательныйСрок,
	|	СотрудникиОрганизаций.ГрафикРаботы,
	|	СотрудникиОрганизаций.Физлицо.Наименование,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент),
	|	ВЫБОР
	|		КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
	|				И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
	|			ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
	|		ИНАЧЕ &РайонныйКоэффициент
	|	КОНЕЦ * 100 - 100,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизаций.Организация
	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
	|	И ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
	|					И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
	|				ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
	|			ИНАЧЕ &РайонныйКоэффициент
	|		КОНЕЦ > 1
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Должность,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ПодразделениеОрганизации,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ЗанимаемыхСтавок,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаНачала,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаОкончания,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ИспытательныйСрок,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ГрафикРаботы,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо.Наименование,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта4,
	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд1,
	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд2,
	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд3,
	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд4,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизацийПерсональныеНадбавки.Ссылка = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Организация
	|			ИНАЧЕ СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизацийПерсональныеНадбавки.Надбавка <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|	И СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Актуальность
	|	И СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизацийПерсональныеНадбавки.Ссылка") + " 
	|
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.Физлицо,
	|	СотрудникиОрганизаций.Должность,
	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
	|	СотрудникиОрганизаций.ДатаНачала,
	|	СотрудникиОрганизаций.ДатаОкончания,
	|	СотрудникиОрганизаций.ИспытательныйСрок,
	|	СотрудникиОрганизаций.ГрафикРаботы,
	|	СотрудникиОрганизаций.Физлицо.Наименование,
	|	СхемыМотивацииРаботников.ВидРасчета,
	|	СхемыМотивацииРаботников.Показатель1,
	|	СхемыМотивацииРаботников.Показатель2,
	|	СхемыМотивацииРаботников.Показатель3,
	|	СхемыМотивацииРаботников.Показатель4,
	|	СхемыМотивацииРаботников.Валюта1,
	|	СхемыМотивацииРаботников.Валюта2,
	|	СхемыМотивацииРаботников.Валюта3,
	|	СхемыМотивацииРаботников.Валюта4,
	|	СхемыМотивацииРаботников.ТарифныйРазряд1,
	|	СхемыМотивацииРаботников.ТарифныйРазряд2,
	|	СхемыМотивацииРаботников.ТарифныйРазряд3,
	|	СхемыМотивацииРаботников.ТарифныйРазряд4,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
	|		ПО (СхемыМотивацииРаботников.Организация = ВЫБОР
	|				КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА СотрудникиОрганизаций.Организация
	|				ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА СхемыМотивацииРаботников.Должность <> ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
	|						И СхемыМотивацииРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|					ТОГДА СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
	|							И СхемыМотивацииРаботников.Подразделение = СотрудникиОрганизаций.ПодразделениеОрганизации
	|				ИНАЧЕ СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизаций.Организация
	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|	И СхемыМотивацииРаботников.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизлицоНаименование,
	|	Сотрудник,
	|	ВидРасчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКоэфПовышения = Новый запрос;
	ЗапросКоэфПовышения.УстановитьПараметр("ДатаНачалаПериода",		ДатаНачалаПериода);
	ЗапросКоэфПовышения.УстановитьПараметр("ДатаОкончанияПериода",	ДатаОкончанияПериода);
	ЗапросКоэфПовышения.УстановитьПараметр("Организация",			Организация);
	ЗапросКоэфПовышения.УстановитьПараметр("Ссылка",					Ссылка);
	
	ЗапросКоэфПовышения.Текст =
	"ВЫБРАТЬ
	|	СотрудникиОрганизацийКоэфПовышенияТО.Ссылка КАК Сотрудник,
	|	СотрудникиОрганизацийКоэфПовышенияТО.Коэффициент,
	|	СотрудникиОрганизацийКоэфПовышенияТО.Размер
	|ИЗ
	|	Справочник.СотрудникиОрганизаций.КоэфПовышенияТО КАК СотрудникиОрганизацийКоэфПовышенияТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизацийКоэфПовышенияТО.Ссылка = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизацийКоэфПовышенияТО.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизацийКоэфПовышенияТО.Ссылка.Организация
	|			ИНАЧЕ СотрудникиОрганизацийКоэфПовышенияТО.Ссылка.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизацийКоэфПовышенияТО.Ссылка.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
	|			ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизацийКоэфПовышенияТО.Ссылка") + "";
	
	ВыборкаКоэф = ЗапросКоэфПовышения.Выполнить().Выбрать();
	
	ЗапросПовышения = Новый запрос;
	ЗапросПовышения.УстановитьПараметр("ДатаНачалаПериода",		ДатаНачалаПериода);
	ЗапросПовышения.УстановитьПараметр("ДатаОкончанияПериода",	ДатаОкончанияПериода);
	ЗапросПовышения.УстановитьПараметр("Организация",			Организация);
	ЗапросПовышения.УстановитьПараметр("Ссылка",					Ссылка);
	
	ЗапросПовышения.Текст =
	"ВЫБРАТЬ
	|	СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка КАК Сотрудник,
	|	СотрудникиОрганизацийПовышенияПоИнструкции.Коэффициент,
	|	СотрудникиОрганизацийПовышенияПоИнструкции.Размер
	|ИЗ
	|	Справочник.СотрудникиОрганизаций.ПовышенияПоИнструкции КАК СотрудникиОрганизацийПовышенияПоИнструкции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка.Организация
	|			ИНАЧЕ СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|	И СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
	|			ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка") + "";
	
	ВыборкаПовышения = ЗапросПовышения.Выполнить().Выбрать();
	
	
	РаботникиОрганизации.Очистить();
	ОсновныеНачисления.Очистить();
	КоэфПовышенияТО.Очистить();
	ПовышенияПоИнструкции.Очистить();
	
	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
		
		ЗаполнитьЗначенияСвойств(РаботникиОрганизации.Добавить(), Выборка);
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОсновныеНачисления.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЦикла;
	Пока ВыборкаКоэф.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(КоэфПовышенияТО.Добавить(),ВыборкаКоэф);
	КонецЦикла;	
	Пока ВыборкаПовышения.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПовышенияПоИнструкции.Добавить(),ВыборкаПовышения);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьТабличнуюЧастьРаботникиПоТрудовымДоговорам()

// Заполняет табличную часть документа "Работники" списком работников компании
//
Процедура ЗаполнитьТабличнуюЧастьРаботникиПринятымиВКомпанию(ДатаНачалаПериода, ДатаОкончанияПериода) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода",		ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода",	ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Дата",					Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Сотрудник.Физлицо КАК Физлицо,
	|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации,
	|	ПриемыВКомпанию.Должность КАК Должность,
	|	ВложенныйЗапрос.ЗанимаемыхСтавок,
	|	ВложенныйЗапрос.ДатаПриема,
	|	ВЫБОР
	|		КОГДА ПриемыВКомпанию.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПриемыВКомпанию.НапомнитьПоЗавершении
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НапомнитьПоЗавершении,
	|	ВложенныйЗапрос.ИспытательныйСрок,
	|	ПриемыВКомпанию.ДатаУвольнения,
	|	ПриемыВКомпанию.ГрафикРаботы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|		ВложенныйЗапрос.ДатаПриема КАК ДатаПриема,
	|		0 КАК ИспытательныйСрок,
	|		1 КАК ЗанимаемыхСтавок
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПриемыВКомпанию.Сотрудник КАК Сотрудник,
	|			МИНИМУМ(ПриемыВКомпанию.ДатаПриема) КАК ДатаПриема
	|		ИЗ
	|			Документ.ПриемНаРаботу.Работники КАК ПриемыВКомпанию
	|		ГДЕ
	|			ПриемыВКомпанию.Ссылка.Проведен
	|			И ПриемыВКомпанию.ДатаПриема МЕЖДУ &ДатаНачалаПериода И &ДатаОкончанияПериода
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриемыВКомпанию.Сотрудник) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Работники КАК ПриемыВКомпанию
	|			ПО ВложенныйЗапрос.ДатаПриема = ПриемыВКомпанию.ДатаПриема
	|				И ВложенныйЗапрос.Сотрудник = ПриемыВКомпанию.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ДатаПриема,
	|		ВложенныйЗапрос.Сотрудник) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботу.Работники КАК ПриемыВКомпанию
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	|			ПО ПриемыВКомпанию.Подразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
	|				И (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
	|		ПО ВложенныйЗапрос.ДатаПриема = ПриемыВКомпанию.ДатаПриема
	|			И ВложенныйЗапрос.Сотрудник = ПриемыВКомпанию.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Сотрудник.Наименование";
	
	ОсновныеНачисления.Очистить();
	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьРаботникиПринятымиВКомпанию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	Дата);
	Запрос.УстановитьПараметр("РеглВалюта",		Константы.ВалютаРегламентированногоУчета.Получить());
	
	Если Режим = "ПоРеквизитамДокумента" Тогда
		//тлик номерд и разрядЕТС
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	ПриемНаРаботуВОрганизацию.Номер КАК НомерДок,
		|	ПриемНаРаботуВОрганизацию.Дата КАК ДатаДок,
		|	ВЫРАЗИТЬ(ПриемНаРаботуВОрганизацию.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
		|	ПриемНаРаботуВОрганизацию.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
		|	ПриемНаРаботуВОрганизацию.Организация.Префикс,
		|	ПриемНаРаботуВОрганизацию.НомерД
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель)
		|			И ПриемНаРаботуВОрганизацию.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ПриемНаРаботуВОрганизацию.Ссылка = &ДокументСсылка";
		
	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
		
		Запрос.УстановитьПараметр("ОсновноеМестоРаботы", Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.Показатель1 КАК РазмерНадбавки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.Валюта1, &РеглВалюта) = &РеглВалюта
		|			ТОГДА ""руб.""
		|		ИНАЧЕ НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.Валюта1.Наименование
		|	КОНЕЦ КАК ВалютаНадбавки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.Валюта1, &РеглВалюта) = &РеглВалюта
		|			ТОГДА ""коп.""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КопейкиНадбавки,
		|	НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.ВидНадбавки.СпособРасчета КАК СпособРасчета,
		|	СтрокиДокумента.ДатаПриема,
		|	СтрокиДокумента.ДатаУвольнения,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, СтрокиДокумента.Сотрудник.Наименование) КАК Работник,
		|	СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|	СтрокиДокумента.ИспытательныйСрок,
		|	СтрокиДокумента.УсловияПриемаНаРаботу,
		|	СтрокиДокумента.Сотрудник.НомерДоговора КАК ТрудовойДоговорНомер,
		|	СтрокиДокумента.Сотрудник.ДатаДоговора КАК ТрудовойДоговорДата,
		|	СтрокиДокумента.ПодразделениеОрганизации.Наименование КАК Подразделение,
		|	СтрокиДокумента.Должность.Наименование КАК Должность,
		|	СтрокиДокумента.ВалютаТарифнойСтавки,
		|	СтрокиДокумента.КопейкиТарифнойСтавки,
		|	ЕСТЬNULL(СтрокиДокумента.ОкладТарифнаяСтавка, 0) КАК ОкладТарифнаяСтавка,
		|	ЕСТЬNULL(СтрокиДокумента.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
		|	ЕСТЬNULL(СтрокиДокумента.РазмерТарифныйРазряд, 0) КАК РазмерТарифныйРазряд,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтрокиДокумента.ВалютаТарифныйРазряд, &РеглВалюта) = &РеглВалюта
		|			ТОГДА ""коп.""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КопейкиТарифныйРазряд,
		|	ЕСТЬNULL(СтрокиДокумента.ВалютаТарифныйРазряд.Наименование, ""руб."") КАК ВалютаТарифныйРазряд,
		|	СтрокиДокумента.Сотрудник.Код КАК ТабельныйНомер,
		|	СтрокиДокумента.РазрядЕТС,
		|	СтрокиДокумента.ВидТД,
		|	СтрокиДокумента.Сотрудник.Физлицо КАК Физлицо,
		|	СтрокиДокумента.Должность КАК ДолжностьСсылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриемНаРаботуВОрганизациюРаботники.НомерСтроки КАК НомерСтроки,
		|		ПриемНаРаботуВОрганизациюРаботники.Сотрудник КАК Сотрудник,
		|		ПриемНаРаботуВОрганизациюРаботники.ДатаПриема КАК ДатаПриема,
		|		ПриемНаРаботуВОрганизациюРаботники.ДатаУвольнения КАК ДатаУвольнения,
		|		ПриемНаРаботуВОрганизациюРаботники.ИспытательныйСрок КАК ИспытательныйСрок,
		|		ПриемНаРаботуВОрганизациюРаботники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ПриемНаРаботуВОрганизациюРаботники.Должность КАК Должность,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд,
		|		ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1 КАК ОкладТарифнаяСтавка,
		|		РазмерТарифныхСтавокСрезПоследних.Размер КАК РазмерТарифныйРазряд,
		|		РазмерТарифныхСтавокСрезПоследних.Валюта КАК ВалютаТарифныйРазряд,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта1, &РеглВалюта) = &РеглВалюта
		|				ТОГДА ""руб.""
		|			ИНАЧЕ ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта1.Наименование
		|		КОНЕЦ КАК ВалютаТарифнойСтавки,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта1, &РеглВалюта) = &РеглВалюта
		|				ТОГДА ""коп.""
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК КопейкиТарифнойСтавки,
		|		ВЫБОР
		|			КОГДА ПриемНаРаботуВОрганизациюРаботники.Сотрудник.ВидЗанятости = &ОсновноеМестоРаботы
		|				ТОГДА """"
		|			ИНАЧЕ ""По совместительству ""
		|		КОНЕЦ + ПриемНаРаботуВОрганизациюРаботники.УсловияПриемаНаРаботу КАК УсловияПриемаНаРаботу,
		|		ПриемНаРаботуВОрганизациюРаботники.РазрядЕТС КАК РазрядЕТС,
		|		ПриемНаРаботуВОрганизациюРаботники.Основание.ВидТД КАК ВидТД
		|	ИЗ
		|		Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.ОсновныеНачисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(
		|						&ДатаДокумента,
		|						ТарифныйРазряд В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд1
		|							ИЗ
		|								Документ.ПриемНаРаботуВОрганизацию.ОсновныеНачисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
		|							ГДЕ
		|								ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка = &ДокументСсылка
		|								И ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени)) КАК РазмерТарифныхСтавокСрезПоследних
		|				ПО ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд1 = РазмерТарифныхСтавокСрезПоследних.ТарифныйРазряд
		|			ПО ПриемНаРаботуВОрганизациюРаботники.Ссылка = ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка
		|				И (ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени)
		|				И ПриемНаРаботуВОрганизациюРаботники.Сотрудник = ПриемНаРаботуВОрганизациюОсновныеНачисления.Сотрудник
		|	ГДЕ
		|		ПриемНаРаботуВОрганизациюРаботники.Ссылка = &ДокументСсылка) КАК СтрокиДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НадбавкиПоШтатномуРасписаниюОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних
		|		ПО СтрокиДокумента.ПодразделениеОрганизации = НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.ПодразделениеОрганизации
		|			И СтрокиДокумента.Должность = НадбавкиПоШтатномуРасписаниюОрганизацииСрезПоследних.Должность
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|				&ДатаДокумента,
		|				ФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник.Физлицо
		|					ИЗ
		|						Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|					ГДЕ
		|						ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
		|		ПО СтрокиДокумента.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	НомерСтроки";
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()

#Если Клиент Тогда
	
	// Функция формирует табличный документ с печатной формой "Т-1а",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьТ1а(ИмяМакета)
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаРаботуВОрганизацию_Т1а";
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// получаем данные для печати
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = РаботникиОрганизации.Количество();
		
		// запоминаем области макета
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
		ПовторятьПриПечатиСтроки = Макет.ПолучитьОбласть("ПовторятьПриПечати"); // повторяющаяся шапка страницы
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРаботник"); // строка работника
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакета);
		
		// выводим данные о руководителях организации
		Если ВыборкаДляШапки.Следующий() Тогда
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
			ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки); // Для подвала.
		КонецЕсли;
		
		// Начинаем формировать выходной документ
		ТабДокумент.Вывести(ОбластьМакетаШапка); // Шапка документа.
		
		ВыведеноСтрок = 0;
		// выводим строки по работникам
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ВложеннаяВыборка = ВыборкаРаботники.Выбрать(); 
			ВложеннаяВыборка.Следующий();
			
			// Данные по работнику.
			ОбластьМакета.Параметры.Заполнить(ВложеннаяВыборка);
			// Уточним валюту тарифной ставки
			ОкладВПечатнойФорме = ?(ВложеннаяВыборка.ТребуетВводаТарифногоРазряда, ВложеннаяВыборка.РазмерТарифныйРазряд, ВложеннаяВыборка.ОкладТарифнаяСтавка);
			Если ЗначениеЗаполнено(ВложеннаяВыборка.ВалютаТарифнойСтавки) Тогда
				ОбластьМакета.Параметры.ОкладТарифнаяСтавка = "" + Формат(ОкладВПечатнойФорме,"ЧЦ=15; ЧДЦ=2") + Символы.ПС + "(" + ВложеннаяВыборка.ВалютаТарифнойСтавки+")";
			Иначе
				ОбластьМакета.Параметры.ОкладТарифнаяСтавка = ОкладВПечатнойФорме;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВложеннаяВыборка.РазмерНадбавки) Тогда
				
				ТекстЯчейки = ОбластьМакета.Параметры.ОкладТарифнаяСтавка;
				ТекстЯчейки = "" + ТекстЯчейки + "," + Символы.ПС + ВложеннаяВыборка.РазмерНадбавки;
				//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
				Если ВложеннаяВыборка.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом
					или ВложеннаяВыборка.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы
					или ВложеннаяВыборка.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП Тогда //О.Т. Аверсон 04.11.2016 № 1501
					ТекстЯчейки = ТекстЯчейки + "(%)"
				Иначе	
					ТекстЯчейки = ТекстЯчейки + ?(ЗначениеЗаполнено(ВложеннаяВыборка.ВалютаНадбавки)," (" + ВложеннаяВыборка.ВалютаНадбавки+")","");
				КонецЕсли;
				
				ОбластьМакета.Параметры.ОкладТарифнаяСтавка = ТекстЯчейки;
			КонецЕсли;	
			
			//уберем из табельного номера префикс
			ОбластьМакета.Параметры.ТабельныйНомер = ВложеннаяВыборка.ТабельныйНомер;
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ПовторятьПриПечатиСтроки);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		// если не было ни одного работника - выводим пустой бланк
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакета);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакета.Параметры.Количество() Цикл
			ОбластьМакета.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакета.Параметры.Работник = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		// выводим предварительно подготовленный Подвал документа.
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ1а()
	
	// Функция формирует табличный документ с печатной формой "Т-1",
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьТ1(ИмяМакета)
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаРаботуВОрганизацию_Т1";
		
		// получаем данные для печати
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// запоминаем области макета
		Макет = ПолучитьМакет(ИмяМакета);
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал"); // Подвал документа
		ОбластьМакета = Макет.ПолучитьОбласть("Работник"); // строка работника
		
		// выводим данные о руководителях организации
		Если ВыборкаДляШапки.Следующий() Тогда
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапка.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапка.Параметры.НазваниеОрганизации);
			ОбластьМакетаПодвал.Параметры.Заполнить(ВыборкаДляШапки); // Для подвала.
			НомерДокДляПечати	= ВыборкаДляШапки.НомерДок;
		КонецЕсли;
		
		// Начинаем формировать выходной документ
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ВложеннаяВыборка = ВыборкаРаботники.Выбрать(); 
			ВложеннаяВыборка.Следующий();
			
			// Каждый приказ на отдельной странице.
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			// Шапка документа.
			Если РаботникиОрганизации.Количество() > 1 Тогда
				ОбластьМакетаШапка.Параметры.НомерДок = НомерДокДляПечати + "/" + ВложеннаяВыборка.НомерСтроки
			КонецЕсли; 
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			
			// Данные по работнику.
			ОбластьМакета.Параметры.Заполнить(ВложеннаяВыборка);
			Если ВложеннаяВыборка.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт Тогда 
				ОбластьМакета.Параметры.ТрудовойДоговор = "Контракт";
			ИначеЕсли ВложеннаяВыборка.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда 
				ОбластьМакета.Параметры.ТрудовойДоговор = "Трудовой договор";
			КонецЕсли;
			
			// Уточним размер и валюту тарифной ставки
			ОкладВПечатнойФорме = ?(ВложеннаяВыборка.ТребуетВводаТарифногоРазряда, ВложеннаяВыборка.РазмерТарифныйРазряд, ВложеннаяВыборка.ОкладТарифнаяСтавка);
			ВалютаТарифнойСтавки = ?(ВложеннаяВыборка.ТребуетВводаТарифногоРазряда, ВложеннаяВыборка.ВалютаТарифныйРазряд, ВложеннаяВыборка.ВалютаТарифнойСтавки);
			
			ОбластьМакета.Параметры.ОкладТарифнаяСтавкаЦелаяЧасть = Формат(ОкладВПечатнойФорме,"ЧЦ=15; ЧДЦ=2");
			
			Если ВложеннаяВыборка.ИспытательныйСрок = 0 Тогда
				ОбластьМакета.Параметры.ИспытательныйСрок = "Без испытательного срока";
				ОбластьМакета.Параметры.ИспытательныйСрок = ВложеннаяВыборка.ИспытательныйСрок;		
			КонецЕсли;
			
			//уберем из табельного номера префикс
			//толик		ОбластьМакета.Параметры.ТабельныйНомер = ВложеннаяВыборка.ТабельныйНомер;
			Попытка
				ОбластьМакета.Параметры.Разряд = ВложеннаяВыборка.РазрядЕТС;
			Исключение
				
			КонецПопытки;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Подвал документа.
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
			
		КонецЦикла;
		
		// если не было ни одного работника - выводим пустой бланк
		Если ТабДокумент.ВысотаТаблицы = 0 Тогда
			ТабДокумент.Вывести(ОбластьМакетаШапка);
			ОбластьМакета.Параметры.ТрудовойДоговорДата = '00010101';
			ТабДокумент.Вывести(ОбластьМакета);
			ТабДокумент.Вывести(ОбластьМакетаПодвал);
		КонецЕсли;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ1()
	
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриемНаРаботуВОрганизацию.Дата,
	|	ПриемНаРаботуВОрганизацию.Организация,
	|	ВЫБОР
	|		КОГДА ПриемНаРаботуВОрганизацию.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ПриемНаРаботуВОрганизацию.Организация
	|		ИНАЧЕ ПриемНаРаботуВОрганизацию.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ПриемНаРаботуВОрганизацию.РайонныйКоэффициент,
	|	ПриемНаРаботуВОрганизацию.Ссылка,
	|	ПриемНаРаботуВОрганизацию.Организация.Наименование
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
	|ГДЕ
	|	ПриемНаРаботуВОрганизацию.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ПроверкаШтатногоРасписания)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//Определим список организаций - структурных подразделений
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата('00010101'));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ГоловнаяОрганизация);
	
	// Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвижений": 
	// 1. Выборка "ТЧРаботникиОрганизации": 
	//		Выбираются строки документа.  
	// 2. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки с одинаковым значением реквизита "ФизЛицо"
	//
	// Вторая часть запроса - вид строки запроса "КонфликтныйДокумент" - поиск конфликтных документов: 
	//		На каждую дату приема и увольнения ищем движения в регистре "РаботникиОрганизации" и "СостояниеРаботниковОрганизации"
	
	Если ПроверкаШтатногоРасписания Тогда
		
		// определим самую раннюю и позднюю дату перемещения, чтобы с нее начать расчет остатков штатных единиц
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема) КАК ДатаНачала
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|ГДЕ
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка = &ДокументСсылка
		|	И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема <> &ПустаяДата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаНачала = ?(ЗначениеЗаполнено(Выборка.ДатаНачала),Выборка.ДатаНачала,Дата);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала",	ДатаНачала);
		Запрос.УстановитьПараметр("Приход",		ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("НеУчитыватьЕТКС", Организация.НеУчитыватьЕТКС); //Аверсон 08.12.2022 КВВ СВФР-009994
		
		//  Дополнительно используем выборки: 
		//  СвободноСтавокНаДатуПриема
		//		Для каждой строки ТЧРаботникиОрганизации на дату ДатаПриема
		//		подсчитываем количество остающихся ставок (с учетом "предшествующих" данных текущего документа)
		//
		
		Запрос.Текст = "
		
		//+ СВЭЙ КДЯ 15.01.20 СВФР-004950
		//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	""ДанныеДляДвижений"" КАК ВидСтрокиЗапроса,
		//|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		//|	ТЧРаботникиОрганизации.Сотрудник,
		//|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
		//|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		//|	ТЧРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
		//|	ТЧРаботникиОрганизации.ДатаУвольнения,
		//|	ТЧРаботникиОрганизации.ИспытательныйСрокДо,
		//|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
		//|	ТЧРаботникиОрганизации.Должность,
		//|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
		//|	ТЧРаботникиОрганизации.ИспытательныйСрок,
		//|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		//|	ТЧРаботникиОрганизации.ГрафикРаботы,
		//|	ТЧРаботникиОрганизации.ТипРаботника,
		//|	ТЧРаботникиОрганизации.СотрудникЗаменяемый,
		//|	ВЫБОР
		//|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		//|	ВЫБОР
		//|		КОГДА ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец <> &Организация
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		//|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		//|	СвободноСтавокНаДатуПриема.ОстатокСтавок КАК ОстатокСтавок,
		//|	ВЫБОР
		//|		КОГДА ТЧРаботникиОрганизации.Сотрудник.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.ТрудовойДоговор)
		//|				И ТЧРаботникиОрганизации.Сотрудник.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.Контракт)
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК НеВерныйДоговор,
		//|	ВЫБОР
		//|		КОГДА РаботникиОрганизаций.НомерСтроки ЕСТЬ NULL 
		//|			ТОГДА ЛОЖЬ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК ОшибкаСотрудникРаботалВОрганизации,
		//|	ТЧРаботникиОрганизации.КоэффициентЕТС,
		//|	ТЧРаботникиОрганизации.РазрядЕТС,
		//|	ТЧРаботникиОрганизации.Категория,
		//|	ТЧРаботникиОрганизации.ПроцентПоКонтракту,
		//|	ТЧРаботникиОрганизации.ВидРасчета,
		//|	ТЧРаботникиОрганизации.Аванс,
		//|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию,
		//|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		//|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		//|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		//|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		//|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		//|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		//|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		//|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка,
		//|	ТЧРаботникиОрганизации.СдельнаяОплата,
		//|	ТЧРаботникиОрганизации.БезЕТС,
		//|	ТЧРаботникиОрганизации.ОкладВВалюте,
		//|	ТЧРаботникиОрганизации.Валюта,
		//|	ТЧРаботникиОрганизации.СуммаВВалюте,
		//|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		//|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		//|	ТЧРаботникиОрганизации.ДляПечати,
		//|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		//|ИЗ
		//|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		//|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		//|		ИЗ
		//|			Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		//|				ПО (ТЧРаботникиОрганизации2.Ссылка = &ДокументСсылка)
		//|					И ТЧРаботникиОрганизации.НомерСтроки > ТЧРаботникиОрганизации2.НомерСтроки
		//|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		//|		ГДЕ
		//|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // СвободноСтавокНаДатуПриема
		//|			МаксимальныеПериодыШР.НомерСтроки КАК НомерСтроки,
		//|			ЕСТЬNULL(ШтатноеРасписание.КоличествоСтавок, 0) - ЕСТЬNULL(Вакансии.КоличествоСтавок, 0) - ЕСТЬNULL(РанееЗанятоСтавок.КоличествоСтавок, 0) КАК ОстатокСтавок
		//|		ИЗ
		//|			(ВЫБРАТЬ   // МаксимальныеПериодыШР
		//|				Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|				Работники.Должность КАК Должность,
		//|				Работники.НомерСтроки КАК НомерСтроки,
		//|				МАКСИМУМ(ШтатноеРасписание.Период) КАК МаксПериод,
		//|				Работники.КоэффициентЕТС КАК КоэффициентЕТС,
		//|				Работники.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		//|				Работники.ТарифныйСПовышениемПоИнструкции КАК ТарифныйСПовышениемПоИнструкции,
		//|				Работники.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение
		//|			ИЗ
		//|				Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Работники
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|						ЕСТЬNULL(ШтатноеРасписание.Период, &ДатаНачала) КАК Период,
		//|						Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|						Работники.Должность КАК Должность,
		//|						Работники.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|					ИЗ
		//|						Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Работники
		//|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|							ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|								И Работники.Должность = ШтатноеРасписание.Должность
		//|								И Работники.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|					ГДЕ
		//|						Работники.Ссылка = &ДокументСсылка) КАК ШтатноеРасписание
		//|					ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|						И Работники.Должность = ШтатноеРасписание.Должность
		//|						И Работники.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|						И Работники.ДатаПриема >= ШтатноеРасписание.Период
		//|			ГДЕ
		//|				Работники.Ссылка = &ДокументСсылка
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				Работники.ПодразделениеОрганизации,
		//|				Работники.НомерСтроки,
		//|				Работники.Должность,
		//|				Работники.КоэффициентЕТС,
		//|				Работники.ПроцентПоКонтракту,
		//|				Работники.ТарифныйСПовышениемПоИнструкции,
		//|				Работники.УсловияТрудаИзмерение) КАК МаксимальныеПериодыШР
		//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|				ПО МаксимальныеПериодыШР.МаксПериод = ШтатноеРасписание.Период
		//|					И МаксимальныеПериодыШР.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|					И МаксимальныеПериодыШР.Должность = ШтатноеРасписание.Должность
		//|					И МаксимальныеПериодыШР.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //О.Т. Аверсон 03.10.2016 № 1463
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // Вакансии
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					СУММА(ВЫБОР
		//|							КОГДА Вакансии.ВидДвижения = &Приход
		//|								ТОГДА Вакансии.КоличествоСтавок
		//|							ИНАЧЕ -Вакансии.КоличествоСтавок
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеШтатныеЕдиницыОрганизаций КАК Вакансии
		//|						ПО Работники.ПодразделениеОрганизации = Вакансии.ПодразделениеОрганизации
		//|							И Работники.Должность = Вакансии.Должность
		//|							И Работники.ДатаПриема >= Вакансии.Период
		//|							И (Вакансии.Регистратор <> &ДокументСсылка)
		//|							И Работники.УсловияТрудаИзмерение = Вакансии.УсловияТрудаИзмерение //О.Т. Аверсон 20.12.2017 № 1376
		//|				ГДЕ
		//|					Работники.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					Работники.ПодразделениеОрганизации,
		//|					Работники.Должность,
		//|					Работники.НомерСтроки) КАК Вакансии
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = Вакансии.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // РанееЗанятоСтавок
		//|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		//|					СУММА(ВЫБОР
		//|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема <= СтрокиДокумента.ДатаПриема
		//|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ - ВЫБОР
		//|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения < СтрокиДокумента.ДатаПриема
		//|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения <> &ПустаяДата
		//|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.НапомнитьПоЗавершении
		//|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК СтрокиДокумента
		//|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		//|						ПО СтрокиДокумента.Ссылка = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
		//|							И СтрокиДокумента.НомерСтроки <> ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
		//|							И СтрокиДокумента.ПодразделениеОрганизации = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации
		//|							И СтрокиДокумента.Должность = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность
		//|				ГДЕ
		//|					СтрокиДокумента.Ссылка = &ДокументСсылка
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = РанееЗанятоСтавок.НомерСтроки) КАК СвободноСтавокНаДатуПриема
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = СвободноСтавокНаДатуПриема.НомерСтроки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		//|		ПО ТЧРаботникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
		//|			И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачала, ) КАК ГражданствоФизЛицСрезПоследних
		//|		ПО ТЧРаботникиОрганизации.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
		//|ГДЕ
		//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	НомерСтроки,
		//|	ВидСтрокиЗапроса";
		//- СВЭЙ КДЯ 15.01.20 СВФР-004950
		
		
		//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) (
		|ВЫБРАТЬ
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние,
		|СостояниеРаботниковОрганизаций.Регистратор,
		|СостояниеРаботниковОрганизаций.Период,
		|СостояниеРаботниковОрганизаций.ПериодЗавершения
		|ПОМЕСТИТЬ ВтОтстНаРаботе
		|ИЗ
		|РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации
		|ПО СостояниеРаботниковОрганизаций.Регистратор = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Ссылка
		
		//Аверсон 17.10.2022 КВВ СВФР-009670 (
		//|И СостояниеРаботниковОрганизаций.НомерСтроки = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.НомерСтроки
		|И СостояниеРаботниковОрганизаций.Период = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.ДатаНачала
		//Аверсон 17.10.2022 КВВ СВФР-009670 )
		
		|И СостояниеРаботниковОрганизаций.Сотрудник = ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.Сотрудник
		|
		|ГДЕ
		|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
		|И (СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)//СВЭЙ 22.09.2023 КВВ СВФР-011371
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку) //Аверсон 06.07.2023 КВВ СВФР-010927
		|ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
		|)
		|И ОтсутствиеНаРаботеОрганизацийРаботникиОрганизации.ОсвобождатьСтавку = ИСТИНА
		|;
		|ВЫБРАТЬ
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние,
		|МИНИМУМ(ДОБАВИТЬКДАТЕ(СостояниеРаботниковОрганизаций.Период,ДЕНЬ,-1)) КАК Период
		|ПОМЕСТИТЬ ВтВозвратНаРаботу
		|ИЗ
		|РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратНаРаботуОрганизаций.РаботникиОрганизации КАК ВозвратНаРаботуОрганизацийРаботникиОрганизации
		|ПО СостояниеРаботниковОрганизаций.Регистратор = ВозвратНаРаботуОрганизацийРаботникиОрганизации.Ссылка
		|И СостояниеРаботниковОрганизаций.НомерСтроки = ВозвратНаРаботуОрганизацийРаботникиОрганизации.НомерСтроки
		|И СостояниеРаботниковОрганизаций.Сотрудник = ВозвратНаРаботуОрганизацийРаботникиОрганизации.Сотрудник
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтОтстНаРаботе КАК ВтОтстНаРаботе
		|ПО СостояниеРаботниковОрганизаций.Сотрудник = ВтОтстНаРаботе.Сотрудник
		|ГДЕ
		|СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ВозвратНаРаботуОрганизаций
		|И СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)
		|И СостояниеРаботниковОрганизаций.Сотрудник В (ВЫБРАТЬ ВтОтстНаРаботе.Сотрудник ИЗ ВтОтстНаРаботе)
		|И СостояниеРаботниковОрганизаций.Период >= ВтОтстНаРаботе.Период
		|СГРУППИРОВАТЬ ПО
		|СостояниеРаботниковОрганизаций.Сотрудник,
		|СостояниеРаботниковОрганизаций.Состояние
		|;
		|
		|ВЫБРАТЬ 
		|ВтОтстНаРаботе.Сотрудник,
		|ВтОтстНаРаботе.Состояние,
		|ВтОтстНаРаботе.Период,
		
		//Аверсон 17.10.2022 КВВ СВФР-009670 (
		//|ВтВозвратНаРаботу.Период КАК ПериодЗавершения
		|ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) <= КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ТОГДА ВтВозвратНаРаботу.Период
		|ИНАЧЕ ДАТАВРЕМЯ(1,1,1,0,0,0)
		|КОНЕЦ КАК ПериодЗавершения
		//Аверсон 17.10.2022 КВВ СВФР-009670 )
		
		|ПОМЕСТИТЬ ВтВозвратНаРаботуСДатой
		|ИЗ ВтОтстНаРаботе КАК ВтОтстНаРаботе
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботу КАК ВтВозвратНаРаботу
		|ПО ВтВозвратНаРаботу.Сотрудник = ВтОтстНаРаботе.Сотрудник
		
		//Аверсон 19.10.2022 КВВ СВФР-009670 (
		|ГДЕ   
		|ВЫБОР КОГДА КОНЕЦПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) <= КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ТОГДА 
		|&ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(ВтОтстНаРаботе.Период,ДЕНЬ) И КОНЕЦПЕРИОДА(ВтВозвратНаРаботу.Период,ДЕНЬ)
		|ИНАЧЕ ИСТИНА
		|КОНЕЦ
		//Аверсон 19.10.2022 КВВ СВФР-009670 )
		
		|;
		//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) )
		
		//+ СВЭЙ КДЯ 15.01.20 СВФР-004950
		|// 0 ///
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
		|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	ТЧРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
		|	ТЧРаботникиОрганизации.ДатаУвольнения,
		|	ТЧРаботникиОрганизации.ИспытательныйСрокДо,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ИспытательныйСрок,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый,
		|	ТЧРаботникиОрганизации.Сотрудник.Организация КАК ОрганизацияСотрудника,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ТЧРаботникиОрганизации.Сотрудник.ВидДоговора КАК ВидДоговора,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС,
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|	ВЫБОР КОГДА ТЧРаботникиОрганизации.РазрядЕТС = """" ТОГДА ""0"" ИНАЧЕ ТЧРаботникиОрганизации.РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		//|ВЫБОР КОГДА &НеУчитыватьЕТКС = ЛОЖЬ 
		|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА //Аверсон 04.01.2023 КВВ СВФР-010111
		|ТОГДА """"
		|ИНАЧЕ
		|	ВЫБОР КОГДА ТЧРаботникиОрганизации.РазрядЕТС = """" ТОГДА ""0"" ИНАЧЕ ТЧРаботникиОрганизации.РазрядЕТС КОНЕЦ КОНЕЦ КАК РазрядЕТС,
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		|	ТЧРаботникиОрганизации.Категория,
		
		//Аверсон 20.09.2022 КВВ СВФР-009575 (
		//|	ТЧРаботникиОрганизации.ПроцентПоКонтракту,
		|ВЫБОР КОГДА 
		|ТЧРаботникиОрганизации.ПроцентПоКонтракту = 0 ИЛИ ТЧРаботникиОрганизации.ПроцентПоКонтракту ЕСТЬ NULL 
		|ТОГДА 0 
		|ИНАЧЕ ТЧРаботникиОрганизации.ПроцентПоКонтракту
		|КОНЕЦ КАК ПроцентПоКонтракту,
		//Аверсон 20.09.2022 КВВ СВФР-009575 ) 
		
		|	ТЧРаботникиОрганизации.ВидРасчета,
		|	ТЧРаботникиОрганизации.Аванс,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.СдельнаяОплата,
		|	ТЧРаботникиОрганизации.БезЕТС,
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ДляПечати,";
		
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|	ТЧРаботникиОрганизации.РазмерСтавки1Разряда,";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		Запрос.Текст = Запрос.Текст + "
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|   ПОМЕСТИТЬ ВтТЧРаботникиОрганизации
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|ИНДЕКСИРОВАТЬ ПО
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник
		|;";
		
		//Аверсон 24.02.2022 КВВ СВФР-008769 (		
		Если Организация.ИНН = "700067572" 
			ИЛИ Организация.ИНН = "193357089" Тогда //Аверсон 08.12.2022 КВВ СВФР-009994
			Запрос.Текст = Запрос.Текст + "
			|ВЫБРАТЬ 
			|ВтТЧРаботникиОрганизации.Сотрудник,
			|ВтТЧРаботникиОрганизации.ГрафикРаботы
			|ПОМЕСТИТЬ ВТТЧРаботникиГрафикРаботы 
			|ИЗ ВтТЧРаботникиОрганизации КАК ВтТЧРаботникиОрганизации
			|;";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 24.02.2022 КВВ СВФР-008769 )
		
		
		
		//Аверсон 27.02.2023 КВВ СВФР-010111 ( (закомментировано, текст ниже)
		//|
		//|// 1 ///
		//|ВЫБРАТЬ
		//|	СУММА( ЗанимаемыхСтавок ) КАК КоличествоСтавок,
		//|	ПодразделениеОрганизации,
		//|	Должность,
		////+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		////|	РазрядЕТС,
		////- СВЭЙ КДЯ 18.02.20 СВФР-005534
		////+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		//
		////Аверсон 08.12.2022 КВВ СВФР-009994 (
		////|	ВЫБОР КОГДА РазрядЕТС = """" ИЛИ РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		//|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		//|ТОГДА """"
		//|ИНАЧЕ
		//|	ВЫБОР КОГДА РазрядЕТС = """" ИЛИ РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РазрядЕТС КОНЕЦ конец КАК РазрядЕТС,
		////Аверсон 08.12.2022 КВВ СВФР-009994 )
		//
		////- СВЭЙ КДЯ 18.02.20 СВФР-005534
		//|	КоэффициентЕТС,
		//|	ПроцентПоКонтракту,
		//|	ИтоговоеПовышениеПоИнструкции,
		//|	ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//	|	РазмерСтавки1Разряда,";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|	УсловияТрудаИзмерение,
		//|	ВидДеятельностиИзмерение,
		//|	ТарифнаяСтавкаПервогоРазряда
		//|	ПОМЕСТИТЬ ВтШтатныеЕдиницы
		//|ИЗ
		//|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаНачала, 
		//|			( ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,    // строковый тип, не всегда совпадает со значением в документе*
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре*
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//	|	РазмерСтавки1Разряда,";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|			УсловияТрудаИзмерение,
		////	|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда
		//
		////Аверсон ЕАЕ 04.10.2021 СВФР-008216
		////|			ГрафикРаботы
		////Аверсон СВФР-008216
		//
		//|) В
		//|			( ВЫБРАТЬ ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,     // строковый тип, не всегда совпадает со значением в документе*
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре*
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//	|	РазмерСтавки1Разряда,";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|			УсловияТрудаИзмерение,
		////	|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда
		//
		////Аверсон ЕАЕ 04.10.2021 СВФР-008216
		////|			ГрафикРаботы
		////Аверсон СВФР-008216
		//
		//|			ИЗ ВтТЧРаботникиОрганизации )
		//|		) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		//|СГРУППИРОВАТЬ ПО
		//|	ПодразделениеОрганизации,
		//|	Должность,
		//
		////Аверсон 08.12.2022 КВВ СВФР-009994 (
		////|	РазрядЕТС,
		//|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		//|ТОГДА """"
		//|ИНАЧЕ
		//|	ВЫБОР КОГДА РазрядЕТС = """" ИЛИ РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РазрядЕТС КОНЕЦ КОНЕЦ,
		////Аверсон 08.12.2022 КВВ СВФР-009994 )
		//
		//|	КоэффициентЕТС,
		//|	ПроцентПоКонтракту,
		//|	ИтоговоеПовышениеПоИнструкции,
		//|	ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//	|	РазмерСтавки1Разряда,";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|	УсловияТрудаИзмерение,
		//|	ВидДеятельностиИзмерение,
		//|	ТарифнаяСтавкаПервогоРазряда
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ПодразделениеОрганизации,
		//|	Должность
		//|;
		
		|
		|
		|// 1 ///
		|ВЫБРАТЬ
		|ШтатноеРасписаниеОрганизацийСрезПоследних.Период,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК КоличествоСтавок,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
		|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		|ТОГДА """"
		|ИНАЧЕ
		|ВЫБОР 
		|КОГДА ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = """" ИЛИ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС = "" "" 
		|ТОГДА ""0"" 
		|ИНАЧЕ ШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС 
		|КОНЕЦ КОНЕЦ КАК РазрядЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|ШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ШтатноеРасписаниеОрганизацийСрезПоследних.УсловияТрудаИзмерение,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ВидДеятельностиИзмерение,
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда
		|	ПОМЕСТИТЬ ВтШтатныеЕдиницы1
		|ИЗ РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&ДатаНачала) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ВтТЧРаботникиОрганизации
		|ПО ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВтТЧРаботникиОрганизации.ПодразделениеОрганизации
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВтТЧРаботникиОрганизации.Должность
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС = ВтТЧРаботникиОрганизации.КоэффициентЕТС
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции = ВтТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС = ВтТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда = ВтТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|И  ШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда = ВтТЧРаботникиОрганизации.РазмерСтавки1Разряда";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВтТЧРаботникиОрганизации.ПодразделениеОрганизации
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВтТЧРаботникиОрганизации.Должность
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС = ВтТЧРаботникиОрганизации.КоэффициентЕТС
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции = ВтТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС = ВтТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС
		|И  ШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда = ВтТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|И  ШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда = ВтТЧРаботникиОрганизации.РазмерСтавки1Разряда";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|ВЫБРАТЬ
		|МАКСИМУМ(ВтШтатныеЕдиницы1.Период) КАК Период
		|ПОМЕСТИТЬ ВтШтатныеЕдиницы2
		|ИЗ ВтШтатныеЕдиницы1 
		|;
		|
		|ВЫБРАТЬ
		|ВтШтатныеЕдиницы2.Период,
		|ВтШтатныеЕдиницы1.КоличествоСтавок,
		|ВтШтатныеЕдиницы1.ПодразделениеОрганизации,
		|ВтШтатныеЕдиницы1.Должность,
		|ВтШтатныеЕдиницы1.РазрядЕТС,
		|ВтШтатныеЕдиницы1.КоэффициентЕТС,
		|ВтШтатныеЕдиницы1.ПроцентПоКонтракту,
		|ВтШтатныеЕдиницы1.ИтоговоеПовышениеПоИнструкции,
		|ВтШтатныеЕдиницы1.ПовышенныйКоэффициентЕТС,
		|ВтШтатныеЕдиницы1.УсловияТрудаИзмерение,
		|ВтШтатныеЕдиницы1.ВидДеятельностиИзмерение,";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|ВтШтатныеЕдиницы1.РазмерСтавки1Разряда,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ВтШтатныеЕдиницы1.ТарифнаяСтавкаПервогоРазряда
		|ПОМЕСТИТЬ ВтШтатныеЕдиницы3
		|ИЗ ВтШтатныеЕдиницы2 КАК ВтШтатныеЕдиницы2
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтШтатныеЕдиницы1 КАК ВтШтатныеЕдиницы1
		|ПО ВтШтатныеЕдиницы2.Период = ВтШтатныеЕдиницы1.Период
		|;
		
		|ВЫБРАТЬ
		|СУММА(ВтШтатныеЕдиницы3.КоличествоСтавок) КАК КоличествоСтавок,
		|ВтШтатныеЕдиницы3.ПодразделениеОрганизации,
		|ВтШтатныеЕдиницы3.Должность,
		|ВтШтатныеЕдиницы3.РазрядЕТС,
		|ВтШтатныеЕдиницы3.КоэффициентЕТС,
		|ВтШтатныеЕдиницы3.ПроцентПоКонтракту,
		|ВтШтатныеЕдиницы3.ИтоговоеПовышениеПоИнструкции,
		|ВтШтатныеЕдиницы3.ПовышенныйКоэффициентЕТС,
		|ВтШтатныеЕдиницы3.УсловияТрудаИзмерение,
		|ВтШтатныеЕдиницы3.ВидДеятельностиИзмерение,";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|ВтШтатныеЕдиницы3.РазмерСтавки1Разряда,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ВтШтатныеЕдиницы3.ТарифнаяСтавкаПервогоРазряда
		|ПОМЕСТИТЬ ВтШтатныеЕдиницы
		|ИЗ ВтШтатныеЕдиницы3 КАК ВтШтатныеЕдиницы3
		|СГРУППИРОВАТЬ ПО
		|ВтШтатныеЕдиницы3.ПодразделениеОрганизации,
		|ВтШтатныеЕдиницы3.Должность,
		|ВтШтатныеЕдиницы3.РазрядЕТС,
		|ВтШтатныеЕдиницы3.КоэффициентЕТС,
		|ВтШтатныеЕдиницы3.ПроцентПоКонтракту,
		|ВтШтатныеЕдиницы3.ИтоговоеПовышениеПоИнструкции,
		|ВтШтатныеЕдиницы3.ПовышенныйКоэффициентЕТС,
		|ВтШтатныеЕдиницы3.УсловияТрудаИзмерение,
		|ВтШтатныеЕдиницы3.ВидДеятельностиИзмерение,";
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|ВтШтатныеЕдиницы3.РазмерСтавки1Разряда,";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ВтШтатныеЕдиницы3.ТарифнаяСтавкаПервогоРазряда
		|ИНДЕКСИРОВАТЬ ПО
		|ВтШтатныеЕдиницы3.ПодразделениеОрганизации,
		|ВтШтатныеЕдиницы3.Должность
		|;
		|
		//Аверсон 27.02.2023 КВВ СВФР-010111 )
		
		
		
		|
		|// 2 ///
		|ВЫБРАТЬ
		|	СУММА( 
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНачала
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ 
		|	) КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность КАК Должность,
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		//|	РаботникиОрганизации.РазрядЕТС,
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|	ВЫБОР КОГДА РаботникиОрганизации.РазрядЕТС = """" ИЛИ РаботникиОрганизации.РазрядЕТС = "" "" ТОГДА ""0"" ИНАЧЕ РаботникиОрганизации.РазрядЕТС КОНЕЦ КАК РазрядЕТС,
		|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		|ТОГДА """"
		|ИНАЧЕ
		|	ВЫБОР КОГДА РаботникиОрганизации.РазрядЕТС = """" ИЛИ РаботникиОрганизации.РазрядЕТС = "" "" 
		|	ТОГДА ""0"" ИНАЧЕ РаботникиОрганизации.РазрядЕТС КОНЕЦ КОНЕЦ КАК РазрядЕТС,
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		|	РаботникиОрганизации.КоэффициентЕТС,
		
		//Аверсон 20.09.2022 КВВ СВФР-009575 (
		//|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|ВЫБОР КОГДА 
		|ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту = 0 ИЛИ ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту ЕСТЬ NULL 
		|ТОГДА 0 
		|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|КОНЕЦ КАК ПроцентПоКонтракту,
		//Аверсон 20.09.2022 КВВ СВФР-009575 ) 
		
		
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,";
		//Аверсон 24.02.2022 КВВ СВФР-008769 (
		Если Организация.ИНН = "700067572" 
			ИЛИ Организация.ИНН = "193357089" Тогда //Аверсон 08.12.2022 КВВ СВФР-009994
			Запрос.Текст = Запрос.Текст + "
			|	ВТТЧРаботникиГрафикРаботы.ГрафикРаботы,";
		Иначе
			//Аверсон 04.01.2023 КВВ СВФР-010109 (пункт 1) (закомментировано) (
			//Запрос.Текст = Запрос.Текст + "
			//|	РаботникиОрганизации.ГрафикРаботы,";
			//Аверсон 04.01.2023 КВВ СВФР-010109 (пункт 1) (закомментировано) )
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 24.02.2022 КВВ СВФР-008769 )
		|	РаботникиОрганизации.УсловияТрудаИзмерение,
		|	РаботникиОрганизации.ВидДеятельностиИзмерение,";
		
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Размер КАК РазмерСтавки1Разряда,";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		Запрос.Текст = Запрос.Текст + "
		|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|	ПОМЕСТИТЬ ВтЗанятыеШтатныеЕдиницы
		|ИЗ";
		
		//Аверсон 22.09.2022 КВВ СВФР-009575 (
		//!! порядок следования кода изменен, закомментирован старый вариант, поле него идет новый вариант с ссылками на прежние заявки !!
		//старый вариант кода до СВФР-009575 (
		
		//Запрос.Текст = Запрос.Текст + "
		//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала, (НЕ Временно)
		//|   И Регистратор <> &ДокументСсылка";
		//
		//Если НЕ Организация.ИНН = "700067572" Тогда  //Аверсон 27.10.2021 КВВ СВФР-008316
		//Запрос.Текст = Запрос.Текст + "	
		//|	И		( ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|			УсловияТрудаИзмерение,
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда
		//
		////Аверсон ЕАЕ 04.10.2021 СВФР-008216
		////|			ГрафикРаботы
		////Аверсон СВФР-008216
		//
		//|) В
		//|			( ВЫБРАТЬ ПодразделениеОрганизации,
		//|			Должность,
		//|			//РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
		//|			КоэффициентЕТС,
		//|			//ПроцентПоКонтракту, // не рассчитывается в регистре
		//|			ИтоговоеПовышениеПоИнструкции,
		//|			ПовышенныйКоэффициентЕТС,";
		//
		////Аверсон ЕАЕ 21.01.2021 СВФР-007102
		////Аверсон 10.09.2020 КВВ СВФР-006550 (
		////Если НЕ Организация.ИНН = "100010315" Тогда
		////	Запрос.Текст = Запрос.Текст + "
		////	|	ГрафикРаботы,";
		////КонецЕсли;
		////Аверсон
		//
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 10.09.2020 КВВ СВФР-006550 )
		//
		//|			УсловияТрудаИзмерение,
		////|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		//|			ТарифнаяСтавкаПервогоРазряда
		//
		////Аверсон ЕАЕ 04.10.2021 СВФР-008216
		////|			ГрафикРаботы
		////Аверсон СВФР-008216
		//
		//|			ИЗ ВтТЧРаботникиОрганизации )";
		//
		//КонецЕсли;
		//Запрос.Текст = Запрос.Текст + "
		//|	И (НЕ Сотрудник ЕСТЬ NULL )
		//|	И ПодразделениеОрганизации.Владелец = &Организация
		//|	И ВЫБОР
		//|			КОГДА ПериодЗавершения <= &ДатаНачала
		//|					И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|				ТОГДА ЗанимаемыхСтавокЗавершения
		//|			ИНАЧЕ ЗанимаемыхСтавок
		//|		КОНЕЦ <> 0
		//|	И (НЕ Сотрудник В
		//|(ВЫБРАТЬ
		//|	СостояниеРаботниковОрганизаций.Сотрудник
		//|ИЗ
		//|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		//|		ПО
		//|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаОрганизацийРаботникиОрганизации.Ссылка
		//|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
		//|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком.ОсновныеНачисления КАК ОтпускаПоУходуЗаРебенком
		//|		ПО
		//|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаПоУходуЗаРебенком.Ссылка
		//|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаПоУходуЗаРебенком.НомерСтроки
		//|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаПоУходуЗаРебенком.Сотрудник
		//|ГДЕ
		//|	(СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		//|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		//|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание))
		//|	И &ДатаНачала МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения
		//|	И ВЫБОР
		//|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
		//|			ТОГДА ОтпускаОрганизацийРаботникиОрганизации.ОсвобождатьСтавку
		//|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
		//|			ТОГДА ОтпускаПоУходуЗаРебенком.Ссылка.ОсвобождатьСтавку
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ
		//|)
		//|	 )
		//|  ) КАК РаботникиОрганизации
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&ДатаНачала";
		//
		////Аверсон 20.09.2022 КВВ СВФР-009575 (закомментировано) (
		//////Аверсон 25.09.2021 КВВ СВФР-008175 (
		////Если НЕ Организация.ИНН = "700067572" Тогда
		////	Запрос.Текст = Запрос.Текст + "	
		////|,
		////|                           Сотрудник В ( ВЫБРАТЬ Сотрудник ИЗ ВтТЧРаботникиОрганизации )";
		////КонецЕсли;
		//////Аверсон 25.09.2021 КВВ СВФР-008175 )
		////Аверсон 20.09.2022 КВВ СВФР-009575 (закомментировано) )
		//
		//Запрос.Текст = Запрос.Текст + "
		//|							) КАК ТарифныеСтавкиРаботниковОрганизации
		//|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник";
		//
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(&ДатаНачала) КАК ТарифныеСтавкиПервогоРазрядаОрганизаций
		//	|ПО РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ТарифныеСтавкиПервогоРазрядаОрганизаций.ТарифнаяСтавка";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//
		////Аверсон ЕАЕ 05.10.2021 СВФР-008224
		////Исключим уволенных
		//Запрос.Текст = Запрос.Текст + "
		//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнение
		//|ПО РаботникиОрганизации.Сотрудник = РаботникиОрганизацийУвольнение.Сотрудник
		//|И РаботникиОрганизацийУвольнение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		//|И РаботникиОрганизацийУвольнение.Период <= &ДатаНачала";
		//
		////Аверсон 24.02.2022 КВВ СВФР-008769 (
		//Если Организация.ИНН = "700067572" Тогда  
		//	Запрос.Текст = Запрос.Текст + "
		//	|ЛЕВОЕ СОЕДИНЕНИЕ ВТТЧРаботникиГрафикРаботы КАК ВТТЧРаботникиГрафикРаботы
		//	|ПО РаботникиОрганизации.Сотрудник = ВТТЧРаботникиГрафикРаботы.Сотрудник
		//	
		//	//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) (
		//	|ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботуСДатой КАК ВтВозвратНаРаботуСДатой
		//	|ПО РаботникиОрганизации.Сотрудник = ВтВозвратНаРаботуСДатой.Сотрудник
		//	//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) )
		//	
		//	|";
		//КонецЕсли;
		//Запрос.Текст = Запрос.Текст + "
		////Аверсон 24.02.2022 КВВ СВФР-008769 )
		//
		//|ГДЕ РаботникиОрганизацийУвольнение.Сотрудник ЕСТЬ NULL";
		////Аверсон СВФР-008224
		//   
		
		//!! по СВФР-009575: порядок следования кода изменен, закомментирован старый вариант, поле него идет новый вариант с ссылками на прежние заявки !!
		//старый вариант кода до СВФР-009575 )
		//новый вариант кода по СВФР-009575 ( 
		
		Запрос.Текст = Запрос.Текст + "
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала) КАК РаботникиОрганизации
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&ДатаНачала";
		
		//Аверсон 20.09.2022 КВВ СВФР-009575 (закомментировано) (
		////Аверсон 25.09.2021 КВВ СВФР-008175 (
		//Если НЕ Организация.ИНН = "700067572" Тогда
		//	Запрос.Текст = Запрос.Текст + "	
		//|,
		//|                           Сотрудник В ( ВЫБРАТЬ Сотрудник ИЗ ВтТЧРаботникиОрганизации )";
		//КонецЕсли;
		////Аверсон 25.09.2021 КВВ СВФР-008175 )
		//Аверсон 20.09.2022 КВВ СВФР-009575 (закомментировано) )
		
		Запрос.Текст = Запрос.Текст + "
		|	) КАК ТарифныеСтавкиРаботниковОрганизации
		|	ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник";
		
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(&ДатаНачала) КАК ТарифныеСтавкиПервогоРазрядаОрганизаций
			|ПО РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ТарифныеСтавкиПервогоРазрядаОрганизаций.ТарифнаяСтавка";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		//Аверсон ЕАЕ 05.10.2021 СВФР-008224
		//Исключим уволенных
		Запрос.Текст = Запрос.Текст + "
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнение
		|ПО РаботникиОрганизации.Сотрудник = РаботникиОрганизацийУвольнение.Сотрудник
		|И РаботникиОрганизацийУвольнение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|И РаботникиОрганизацийУвольнение.Период <= &ДатаНачала";
		
		//Аверсон 24.02.2022 КВВ СВФР-008769 (
		Если Организация.ИНН = "700067572" 
			ИЛИ Организация.ИНН = "193357089" Тогда //Аверсон 08.12.2022 КВВ СВФР-009994
			Запрос.Текст = Запрос.Текст + "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТТЧРаботникиГрафикРаботы КАК ВТТЧРаботникиГрафикРаботы
			|ПО РаботникиОрганизации.Сотрудник = ВТТЧРаботникиГрафикРаботы.Сотрудник
			|";
		КонецЕсли;	
		
		//Аверсон 17.10.2022 КВВ СВФР-009670 (блок вынесен из-под унп) ( 
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) (
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратНаРаботуСДатой КАК ВтВозвратНаРаботуСДатой
		|ПО РаботникиОрганизации.Сотрудник = ВтВозвратНаРаботуСДатой.Сотрудник
		//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) )			
		|";
		//Аверсон 17.10.2022 КВВ СВФР-009670 (блок вынесен из-под унп) )
		
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 24.02.2022 КВВ СВФР-008769 )
		//Аверсон СВФР-008224 
		
		|ГДЕ РаботникиОрганизацийУвольнение.Сотрудник ЕСТЬ NULL //Аверсон ЕАЕ 05.10.2021 СВФР-008224
		|И НЕ РаботникиОрганизации.Временно
		|И РаботникиОрганизации.Регистратор <> &ДокументСсылка";
		
		Если НЕ Организация.ИНН = "700067572" Тогда  //Аверсон 27.10.2021 КВВ СВФР-008316
			Запрос.Текст = Запрос.Текст + "	
			|	И		( РаботникиОрганизации.ПодразделениеОрганизации,
			|			РаботникиОрганизации.Должность,
			|			//РаботникиОрганизации.РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
			|			РаботникиОрганизации.КоэффициентЕТС,
			|			//РаботникиОрганизации.ПроцентПоКонтракту, // не рассчитывается в регистре
			|			РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
			|			РаботникиОрганизации.ПовышенныйКоэффициентЕТС,";
			
			//Аверсон ЕАЕ 21.01.2021 СВФР-007102
			//Аверсон 10.09.2020 КВВ СВФР-006550 (
			//Если НЕ Организация.ИНН = "100010315" Тогда
			//	Запрос.Текст = Запрос.Текст + "
			//	|	РаботникиОрганизации.ГрафикРаботы,";
			//КонецЕсли;
			//Аверсон
			
			Запрос.Текст = Запрос.Текст + "
			//Аверсон 10.09.2020 КВВ СВФР-006550 )
			
			|			РаботникиОрганизации.УсловияТрудаИзмерение,
			//|			РаботникиОрганизации.ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
			|			РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
			
			//Аверсон ЕАЕ 04.10.2021 СВФР-008216
			//|			ГрафикРаботы
			//Аверсон СВФР-008216
			
			|) В
			|			( ВЫБРАТЬ ПодразделениеОрганизации,
			|			Должность,
			|			//РазрядЕТС,          // строковый тип, не всегда совпадает со значением в документе
			|			КоэффициентЕТС,
			|			//ПроцентПоКонтракту, // не рассчитывается в регистре
			|			ИтоговоеПовышениеПоИнструкции,
			|			ПовышенныйКоэффициентЕТС,";
			
			//Аверсон ЕАЕ 21.01.2021 СВФР-007102
			//Аверсон 10.09.2020 КВВ СВФР-006550 (
			//Если НЕ Организация.ИНН = "100010315" Тогда
			//	Запрос.Текст = Запрос.Текст + "
			//	|	ГрафикРаботы,";
			//КонецЕсли;
			//Аверсон
			
			Запрос.Текст = Запрос.Текст + "
			//Аверсон 10.09.2020 КВВ СВФР-006550 )
			
			|			УсловияТрудаИзмерение,
			//|			ВидДеятельностиИзмерение, //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
			|			ТарифнаяСтавкаПервогоРазряда
			
			//Аверсон ЕАЕ 04.10.2021 СВФР-008216
			//|			ГрафикРаботы
			//Аверсон СВФР-008216
			
			|			ИЗ ВтТЧРаботникиОрганизации )";
			
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	И (НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL )
		|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНачала
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ <> 0
		|	И (НЕ РаботникиОрганизации.Сотрудник В
		|(ВЫБРАТЬ
		|	СостояниеРаботниковОрганизаций.Сотрудник
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|		ПО
		|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаОрганизацийРаботникиОрганизации.Ссылка
		|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
		|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком.ОсновныеНачисления КАК ОтпускаПоУходуЗаРебенком
		|		ПО
		|			СостояниеРаботниковОрганизаций.Регистратор = ОтпускаПоУходуЗаРебенком.Ссылка
		|				И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаПоУходуЗаРебенком.НомерСтроки
		|				И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаПоУходуЗаРебенком.Сотрудник
		|ГДЕ
		|	(СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)//СВЭЙ 22.09.2023 КВВ СВФР-011371
		
		//Аверсон 15.03.2023 КВВ СВФР-010535 (
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины)
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы)
		//Аверсон 15.03.2023 КВВ СВФР-010535 )
		
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)//Аверсон 06.07.2023 КВВ СВФР-010927
		
		|		ИЛИ СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание))
		|	И &ДатаНачала МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения
		|	И ВЫБОР
		|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций
		|			ТОГДА ОтпускаОрганизацийРаботникиОрганизации.ОсвобождатьСтавку
		|		КОГДА СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
		|			ТОГДА ОтпускаПоУходуЗаРебенком.Ссылка.ОсвобождатьСтавку
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|)
		|	 )";
		
		//новый вариант кода по СВФР-009575 )
		//Аверсон 22.09.2022 КВВ СВФР-009575 )
		
		
		//Аверсон 27.10.2021 КВВ СВФР-008316 (
		Если Организация.ИНН = "700067572" Тогда  
			Запрос.Текст = Запрос.Текст + "
			|И РаботникиОрганизации.Должность В (Выбрать ВтТЧРаботникиОрганизации.Должность Из ВтТЧРаботникиОрганизации)
			|И РаботникиОрганизации.ПодразделениеОрганизации В (Выбрать ВтТЧРаботникиОрганизации.ПодразделениеОрганизации Из ВтТЧРаботникиОрганизации)
			|И РаботникиОрганизации.КоэффициентЕТС В (Выбрать ВтТЧРаботникиОрганизации.КоэффициентЕТС Из ВтТЧРаботникиОрганизации)
			|И РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции В (Выбрать ВтТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции Из ВтТЧРаботникиОрганизации)
			|И РаботникиОрганизации.ПовышенныйКоэффициентЕТС В (Выбрать ВтТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС Из ВтТЧРаботникиОрганизации)
			|И РаботникиОрганизации.УсловияТрудаИзмерение В (Выбрать ВтТЧРаботникиОрганизации.УсловияТрудаИзмерение Из ВтТЧРаботникиОрганизации)
			//	|И РаботникиОрганизации.ВидДеятельностиИзмерение В (Выбрать ВтТЧРаботникиОрганизации.ВидДеятельностиИзмерение Из ВтТЧРаботникиОрганизации) //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
			|И РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда В (Выбрать ВтТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда Из ВтТЧРаботникиОрганизации)
			//	|И РаботникиОрганизации.ГрафикРаботы В (Выбрать ВтТЧРаботникиОрганизации.ГрафикРаботы Из ВтТЧРаботникиОрганизации) //Аверсон 24.02.2022 КВВ СВФР-008769 (закомментировано)
			|";
		КонецЕсли;	
		
		//Аверсон 19.10.2022 КВВ СВФР-009670 (
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) (
		//|И НЕ 
		//|(
		//|НЕ ВтВозвратНаРаботуСДатой.Сотрудник ЕСТЬ NULL
		//|И
		//|&ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(ВтВозвратНаРаботуСДатой.Период,ДЕНЬ) И КОНЕЦПЕРИОДА(ВтВозвратНаРаботуСДатой.ПериодЗавершения,ДЕНЬ)
		//|)
		////Аверсон 17.05.2022 КВВ СВФР-008892 (пункт 1) )			
		//|";
		|И
		|(ВтВозвратНаРаботуСДатой.Сотрудник ЕСТЬ NULL
		|ИЛИ
		|(НЕ ВтВозвратНаРаботуСДатой.Сотрудник ЕСТЬ NULL
		|И (ВтВозвратНаРаботуСДатой.ПериодЗавершения <> ДАТАВРЕМЯ(1,1,1,0,0,0)
		|И
		|&ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(ВтВозвратНаРаботуСДатой.Период,ДЕНЬ) И КОНЕЦПЕРИОДА(ВтВозвратНаРаботуСДатой.ПериодЗавершения,ДЕНЬ)
		|)))  
		|";
		//Аверсон 19.10.2022 КВВ СВФР-009670 )
		
		//Аверсон 27.10.2021 КВВ СВФР-008316 ) 
		
		Запрос.Текст = Запрос.Текст + "
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность,
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|	РаботникиОрганизации.РазрядЕТС,
		|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		|ТОГДА """"
		|ИНАЧЕ
		|	ВЫБОР КОГДА РаботникиОрганизации.РазрядЕТС = """" ИЛИ РаботникиОрганизации.РазрядЕТС = "" "" 
		|	ТОГДА ""0"" ИНАЧЕ РаботникиОрганизации.РазрядЕТС КОНЕЦ КОНЕЦ,
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		|	РаботникиОрганизации.КоэффициентЕТС,
		|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
		|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,";
		//Аверсон 24.02.2022 КВВ СВФР-008769 (
		Если Организация.ИНН = "700067572" 
			ИЛИ Организация.ИНН = "193357089" Тогда //Аверсон 08.12.2022 КВВ СВФР-009994
			Запрос.Текст = Запрос.Текст + "
			|	ВТТЧРаботникиГрафикРаботы.ГрафикРаботы,";
		Иначе
			//Аверсон 04.01.2023 КВВ СВФР-010109 (пункт 1) (закомментировано) (
			//Запрос.Текст = Запрос.Текст + "
			//|	РаботникиОрганизации.ГрафикРаботы,";
			//Аверсон 04.01.2023 КВВ СВФР-010109 (пункт 1) (закомментировано) )
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 24.02.2022 КВВ СВФР-008769 )
		|	РаботникиОрганизации.УсловияТрудаИзмерение,
		|	РаботникиОрганизации.ВидДеятельностиИзмерение,";
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|	ТарифныеСтавкиПервогоРазрядаОрганизаций.Размер,";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		Запрос.Текст = Запрос.Текст + "
		
		|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|ИНДЕКСИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность
		|;
		|
		|// 3 ///
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвижений"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
		|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	ТЧРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
		|	ТЧРаботникиОрганизации.ДатаУвольнения,
		|	ТЧРаботникиОрганизации.ИспытательныйСрокДо,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ИспытательныйСрок,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.ОрганизацияСотрудника = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.ОрганизацияПодразделения <> &Организация
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	( ISNULL( ШтатныеЕдиницы.КоличествоСтавок, 0 ) 
		|		- ISNULL( ЗанятыеШтатныеЕдиницы.ЗанимаемыхСтавок, 0 ) 
		|		- ISNULL( РанееЗанятоСтавокВЭтомДокументе.КоличествоСтавок, 0 ) ) КАК ОстатокСтавок,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.ТрудовойДоговор)
		|				И ТЧРаботникиОрганизации.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.Контракт)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеВерныйДоговор,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизаций.НомерСтроки ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаСотрудникРаботалВОрганизации,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС,
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|	ТЧРаботникиОрганизации.РазрядЕТС,
		|ВЫБОР КОГДА &НеУчитыватьЕТКС = ИСТИНА 
		|ТОГДА """"
		|ИНАЧЕ
		|	ТЧРаботникиОрганизации.РазрядЕТС
		|КОНЕЦ КАК РазрядЕТС,
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		|	ТЧРаботникиОрганизации.Категория,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.ВидРасчета,
		|	ТЧРаботникиОрганизации.Аванс,
		|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию,
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.СдельнаяОплата,
		|	ТЧРаботникиОрганизации.БезЕТС,
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО  ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|					И ТЧРаботникиОрганизации.НомерСтроки > ТЧРаботникиОрганизации2.НомерСтроки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // СвободноСтавокНаДатуПриема
		//|			МаксимальныеПериодыШР.НомерСтроки КАК НомерСтроки,
		//|			ЕСТЬNULL(ШтатноеРасписание.КоличествоСтавок, 0) - ЕСТЬNULL(Вакансии.КоличествоСтавок, 0) - ЕСТЬNULL(РанееЗанятоСтавок.КоличествоСтавок, 0) КАК ОстатокСтавок
		//|		ИЗ
		//|			(ВЫБРАТЬ   // МаксимальныеПериодыШР
		//|				Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|				Работники.Должность КАК Должность,
		//|				Работники.НомерСтроки КАК НомерСтроки,
		//|				МАКСИМУМ(ШтатноеРасписание.Период) КАК МаксПериод,
		//|				Работники.КоэффициентЕТС КАК КоэффициентЕТС,
		//|				Работники.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		//|				Работники.ТарифныйСПовышениемПоИнструкции КАК ТарифныйСПовышениемПоИнструкции,
		//|				Работники.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение
		//|			ИЗ
		//|				ВтТЧРаботникиОрганизации КАК Работники
		//|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|						ЕСТЬNULL(ШтатноеРасписание.Период, &ДатаНачала) КАК Период,
		//|						Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|						Работники.Должность КАК Должность,
		//|						Работники.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|					ИЗ
		//|						ВтТЧРаботникиОрганизации КАК Работники
		//|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|							ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|								И Работники.Должность = ШтатноеРасписание.Должность
		//|								И Работники.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|						) КАК ШтатноеРасписание
		//|					ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|						И Работники.Должность = ШтатноеРасписание.Должность
		//|						И Работники.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //К.Д. Аверсон 22.01.2019 № 3081
		//|						И Работники.ДатаПриема >= ШтатноеРасписание.Период
		//|			
		//|			СГРУППИРОВАТЬ ПО
		//|				Работники.ПодразделениеОрганизации,
		//|				Работники.НомерСтроки,
		//|				Работники.Должность,
		//|				Работники.КоэффициентЕТС,
		//|				Работники.ПроцентПоКонтракту,
		//|				Работники.ТарифныйСПовышениемПоИнструкции,
		//|				Работники.УсловияТрудаИзмерение) КАК МаксимальныеПериодыШР
		//|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		//|				ПО МаксимальныеПериодыШР.МаксПериод = ШтатноеРасписание.Период
		//|					И МаксимальныеПериодыШР.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		//|					И МаксимальныеПериодыШР.Должность = ШтатноеРасписание.Должность
		//|					И МаксимальныеПериодыШР.УсловияТрудаИзмерение = ШтатноеРасписание.УсловияТрудаИзмерение //О.Т. Аверсон 03.10.2016 № 1463
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // Вакансии
		//|					Работники.НомерСтроки КАК НомерСтроки,
		//|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		//|					Работники.Должность КАК Должность,
		//|					СУММА(ВЫБОР
		//|							КОГДА Вакансии.ВидДвижения = &Приход
		//|								ТОГДА Вакансии.КоличествоСтавок
		//|							ИНАЧЕ -Вакансии.КоличествоСтавок
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					ВтТЧРаботникиОрганизации КАК Работники
		//|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеШтатныеЕдиницыОрганизаций КАК Вакансии
		//|						ПО Работники.ПодразделениеОрганизации = Вакансии.ПодразделениеОрганизации
		//|							И Работники.Должность = Вакансии.Должность
		//|							И Работники.ДатаПриема >= Вакансии.Период
		//|							И (Вакансии.Регистратор <> &ДокументСсылка)
		//|							И Работники.УсловияТрудаИзмерение = Вакансии.УсловияТрудаИзмерение //О.Т. Аверсон 20.12.2017 № 1376
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					Работники.ПодразделениеОрганизации,
		//|					Работники.Должность,
		//|					Работники.НомерСтроки) КАК Вакансии
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = Вакансии.НомерСтроки
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // РанееЗанятоСтавок
		//|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		//|					СУММА(ВЫБОР
		//|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема < СтрокиДокумента.ДатаПриема
		//|                                 ИЛИ ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема = СтрокиДокумента.ДатаПриема
		//|                                     И СтрокиДокумента.НомерСтроки > ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
		//|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ - ВЫБОР
		//|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения < СтрокиДокумента.ДатаПриема
		//|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения <> &ПустаяДата
		//|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.НапомнитьПоЗавершении
		//|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		//|							ИНАЧЕ 0
		//|						КОНЕЦ) КАК КоличествоСтавок
		//|				ИЗ
		//|					ВтТЧРаботникиОрганизации КАК СтрокиДокумента
		//|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		//|						ПО  СтрокиДокумента.НомерСтроки <> ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
		//|							И СтрокиДокумента.ПодразделениеОрганизации = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации
		//|							И СтрокиДокумента.Должность = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность
		//|				
		//|				СГРУППИРОВАТЬ ПО
		//|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавок
		//|				ПО МаксимальныеПериодыШР.НомерСтроки = РанееЗанятоСтавок.НомерСтроки) КАК СвободноСтавокНаДатуПриема
		//|		ПО ТЧРаботникиОрганизации.НомерСтроки = СвободноСтавокНаДатуПриема.НомерСтроки
		//|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеЕдиницы КАК ШтатныеЕдиницы
		|		ПО  ТЧРаботникиОрганизации.ПодразделениеОрганизации = ШтатныеЕдиницы.ПодразделениеОрганизации
		|			И ТЧРаботникиОрганизации.Должность = ШтатныеЕдиницы.Должность";
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		//|			И ТЧРаботникиОрганизации.РазрядЕТС = ШтатныеЕдиницы.РазрядЕТС
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ШтатныеЕдиницы.РазрядЕТС )
		Если НЕ Организация.НеУчитыватьЕТКС Тогда
			Запрос.Текст = Запрос.Текст + "
			|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ШтатныеЕдиницы.РазрядЕТС )";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + " 
		//Аверсон 08.12.2022 КВВ СВФР-009994)
		
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		|			И ТЧРаботникиОрганизации.КоэффициентЕТС = ШтатныеЕдиницы.КоэффициентЕТС
		|			И ТЧРаботникиОрганизации.ПроцентПоКонтракту = ШтатныеЕдиницы.ПроцентПоКонтракту
		|			И ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции = ШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции";
		
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|			И ТЧРаботникиОрганизации.РазмерСтавки1Разряда = ШтатныеЕдиницы.РазмерСтавки1Разряда";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		Запрос.Текст = Запрос.Текст + "
		|			И ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС = ШтатныеЕдиницы.ПовышенныйКоэффициентЕТС";
		
		//Аверсон ЕАЕ 21.01.2021 СВФР-007102
		//Аверсон 10.09.2020 КВВ СВФР-006550 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	Запрос.Текст = Запрос.Текст + "
		//	|	И ТЧРаботникиОрганизации.ГрафикРаботы = ШтатныеЕдиницы.ГрафикРаботы";
		//КонецЕсли;
		//Аверсон
		
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 10.09.2020 КВВ СВФР-006550 )
		
		|			
		|			И ТЧРаботникиОрганизации.УсловияТрудаИзмерение = ШтатныеЕдиницы.УсловияТрудаИзмерение
		//|			И ТЧРаботникиОрганизации.ВидДеятельностиИзмерение = ШтатныеЕдиницы.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|			И ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
		|
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВтЗанятыеШтатныеЕдиницы КАК ЗанятыеШтатныеЕдиницы
		|		ПО  ТЧРаботникиОрганизации.ПодразделениеОрганизации = ЗанятыеШтатныеЕдиницы.ПодразделениеОрганизации
		|			И ТЧРаботникиОрганизации.Должность = ЗанятыеШтатныеЕдиницы.Должность";
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		//|			И ТЧРаботникиОрганизации.РазрядЕТС = ЗанятыеШтатныеЕдиницы.РазрядЕТС
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		//+ СВЭЙ КДЯ 18.02.20 СВФР-005534
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ЗанятыеШтатныеЕдиницы.РазрядЕТС )
		Если НЕ Организация.НеУчитыватьЕТКС Тогда
			Запрос.Текст = Запрос.Текст + "
			|			И ( ТЧРаботникиОрганизации.БезЕТС ИЛИ ТЧРаботникиОрганизации.РазрядЕТС = ЗанятыеШтатныеЕдиницы.РазрядЕТС )";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		//- СВЭЙ КДЯ 18.02.20 СВФР-005534
		|			И ТЧРаботникиОрганизации.КоэффициентЕТС = ЗанятыеШтатныеЕдиницы.КоэффициентЕТС
		|			И ТЧРаботникиОрганизации.ПроцентПоКонтракту = ЗанятыеШтатныеЕдиницы.ПроцентПоКонтракту
		|			И ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции = ЗанятыеШтатныеЕдиницы.ИтоговоеПовышениеПоИнструкции";
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|			И ТЧРаботникиОрганизации.РазмерСтавки1Разряда = ЗанятыеШтатныеЕдиницы.РазмерСтавки1Разряда";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		Запрос.Текст = Запрос.Текст + "
		
		|			И ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС = ЗанятыеШтатныеЕдиницы.ПовышенныйКоэффициентЕТС";
		
		//Аверсон ЕАЕ 21.01.2021 СВФР-007102
		//Аверсон 10.09.2020 КВВ СВФР-006550 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	Запрос.Текст = Запрос.Текст + "
		//	|			И ТЧРаботникиОрганизации.ГрафикРаботы = ЗанятыеШтатныеЕдиницы.ГрафикРаботы";
		//КонецЕсли;
		//Аверсон
		
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 10.09.2020 КВВ СВФР-006550 )		
		
		|			И ТЧРаботникиОрганизации.УсловияТрудаИзмерение = ЗанятыеШтатныеЕдиницы.УсловияТрудаИзмерение
		//|			И ТЧРаботникиОрганизации.ВидДеятельностиИзмерение = ЗанятыеШтатныеЕдиницы.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|			И ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда = ЗанятыеШтатныеЕдиницы.ТарифнаяСтавкаПервогоРазряда
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ  // РанееЗанятоСтавокВЭтомДокументе
		|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|					СУММА(ВЫБОР
		|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема < СтрокиДокумента.ДатаПриема
		|                                 ИЛИ ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема = СтрокиДокумента.ДатаПриема
		|                                     И СтрокиДокумента.НомерСтроки > ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
		|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ - ВЫБОР
		|							КОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения < СтрокиДокумента.ДатаПриема
		|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаУвольнения <> &ПустаяДата
		|									И ПриемНаРаботуВОрганизациюРаботникиОрганизации.НапомнитьПоЗавершении
		|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ) КАК КоличествоСтавок
		|				ИЗ
		|					ВтТЧРаботникиОрганизации КАК СтрокиДокумента
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтТЧРаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|						ПО  СтрокиДокумента.НомерСтроки <> ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
		|							И СтрокиДокумента.ПодразделениеОрганизации = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации
		|							И СтрокиДокумента.Должность = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность";
		
		//Аверсон 08.12.2022 КВВ СВФР-009994 (
		//|							И СтрокиДокумента.РазрядЕТС = ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазрядЕТС
		Если НЕ Организация.НеУчитыватьЕТКС Тогда
			Запрос.Текст = Запрос.Текст + "
			|							И СтрокиДокумента.РазрядЕТС = ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазрядЕТС";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 08.12.2022 КВВ СВФР-009994 )
		
		|							И СтрокиДокумента.КоэффициентЕТС = ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС
		|							И СтрокиДокумента.ПроцентПоКонтракту = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту
		|							И СтрокиДокумента.ИтоговоеПовышениеПоИнструкции = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции
		|							И СтрокиДокумента.ПовышенныйКоэффициентЕТС = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС";
		
		//Аверсон ЕАЕ 21.01.2021 СВФР-007102
		//Аверсон 10.09.2020 КВВ СВФР-006550 (
		//Если НЕ Организация.ИНН = "100010315" Тогда
		//	Запрос.Текст = Запрос.Текст + "
		//	|							И СтрокиДокумента.ГрафикРаботы = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ГрафикРаботы";
		//КонецЕсли;
		//Аверсон
		
		Запрос.Текст = Запрос.Текст + "
		//Аверсон 10.09.2020 КВВ СВФР-006550 )
		
		|							И СтрокиДокумента.УсловияТрудаИзмерение = ПриемНаРаботуВОрганизациюРаботникиОрганизации.УсловияТрудаИзмерение
		//|							И СтрокиДокумента.ВидДеятельностиИзмерение = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ВидДеятельностиИзмерение //Аверсон 20.01.2022 КВВ СВФР-008450 (закомментировано)
		|";
		//Аверсон 25.09.2021 КВВ СВФР-008175 (
		Если Организация.ИНН = "700067572" Тогда
			Запрос.Текст = Запрос.Текст + "	
			|							И СтрокиДокумента.РазмерСтавки1Разряда = ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда";
		КонецЕсли;
		//Аверсон 25.09.2021 КВВ СВФР-008175 )
		
		Запрос.Текст = Запрос.Текст + "
		
		|							И СтрокиДокумента.ТарифнаяСтавкаПервогоРазряда = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавокВЭтомДокументе
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = РанееЗанятоСтавокВЭтомДокументе.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|		ПО ТЧРаботникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
		|			И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачала, ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ ВтТЧРаботникиОрганизации) ) КАК ГражданствоФизЛицСрезПоследних
		|		ПО ТЧРаботникиОрганизации.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ВидСтрокиЗапроса";
		//- СВЭЙ КДЯ 15.01.20 СВФР-004950
		
	Иначе
		
		Запрос.УстановитьПараметр("ДатаНачала",	Дата);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвижений"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
		|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
		|	ТЧРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
		|	ТЧРаботникиОрганизации.ДатаУвольнения,
		|	ТЧРаботникиОрганизации.ИспытательныйСрокДо,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ИспытательныйСрок,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец <> &Организация
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.ТрудовойДоговор)
		|				И ТЧРаботникиОрганизации.Сотрудник.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизлицами.Контракт)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеВерныйДоговор,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизаций.НомерСтроки ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаСотрудникРаботалВОрганизации,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.РазрядЕТС,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.Категория,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.Аванс,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ГражданствоФизЛицСрезПоследних.НеИмеетПравоНаПенсию,
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.СдельнаяОплата,
		|	ТЧРаботникиОрганизации.БезЕТС,
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО (ТЧРаботникиОрганизации2.Ссылка = &ДокументСсылка)
		|					И ТЧРаботникиОрганизации.НомерСтроки > ТЧРаботникиОрганизации2.НомерСтроки
		|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|		ГДЕ
		|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|		ПО ТЧРаботникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
		|			И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаНачала, ) КАК ГражданствоФизЛицСрезПоследних
		|		ПО ТЧРаботникиОрганизации.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ВидСтрокиЗапроса";
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Формирование запроса по отпускам из спр. должностей

// 05.12.2010 Дмитрук
Функция СформироватьЗапросПоОтпускамДолжностей()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.Текст =
	"  ВЫБРАТЬ
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность,
	|	ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск,
	|	ДолжностиОрганизацийОтпуск.ВидОтпуска,
	|	ДолжностиОрганизацийОтпуск.КоличествоДней,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолжностиОрганизаций.Отпуск КАК ДолжностиОрганизацийОтпуск
	|		ПО ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации = ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск
	|			И ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность = ДолжностиОрганизацийОтпуск.Ссылка
	|ГДЕ
	|	ДолжностиОрганизацийОтпуск.КоличествоДней <> 0
	|	И ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность,
	|	ДолжностиОрганизацийОтпуск.ВидОтпуска,
	|	ДолжностиОрганизацийОтпуск.ПодразделениеОтпуск,
	|	ДолжностиОрганизацийОтпуск.КоличествоДней,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтпускамДолжностей()

// Формирует запрос по таблице "КоэфПовышенияТО" документа
Функция СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Ссылка,
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.НомерСтроки,
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Коэффициент,
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Сотрудник,
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Размер,
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Действие,
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.КоэфПовышенияТО КАК ПриемНаРаботуВОрганизациюКоэфПовышенияТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ПО ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Ссылка = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
	|			И ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Ссылка = &ДокументСсылка
	|	И ПриемНаРаботуВОрганизациюКоэфПовышенияТО.Сотрудник <> &ПустойСотрудник";
	
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции

// Формирует запрос по таблице "ПовышенияПоИнструкции" документа
Функция СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной( "глУчетнаяПолитикаПоПерсоналуОрганизации" );
	ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(
	УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания" );
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
	
	//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
	Если СокрЛП( Организация.ИНН ) = "806000046" И ПроверкаШтатногоРасписания Тогда
		
		Запрос.УстановитьПараметр("Дата",	ВыборкаПоШапкеДокумента.Дата);
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка,
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Коэффициент,
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Размер,
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник,
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Действие,
		//|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема,
		////+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
		//|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации,
		//|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность
		//|ПОМЕСТИТЬ ВтПрием
		////- СВЭЙ 07.02.19 КДЯ СВФР-003209 
		//|ИЗ
		//|	Документ.ПриемНаРаботуВОрганизацию.ПовышенияПоИнструкции КАК ПриемНаРаботуВОрганизациюПовышенияПоИнструкции
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		//|		ПО ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
		//|			И ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
		//|ГДЕ
		//|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка = &ДокументСсылка
		//|	И ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник <> &ПустойСотрудник
		////+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	Прием.Ссылка,
		//|	Прием.Коэффициент,
		//|	Прием.Размер,
		//|	Прием.Сотрудник,
		//|	Прием.Действие,
		//|	Прием.ДатаПриема,
		//|	НЕ Штатное.Размер ЕСТЬ NULL 
		//|		И Прием.Размер <> Штатное.Размер КАК ЕстьОшибка,
		//|	ВЫБОР
		//|		КОГДА НЕ Штатное.Размер ЕСТЬ NULL 
		//|				И Прием.Размер <> Штатное.Размер
		//|			ТОГДА ""Размер %ПриемРазмер коэффициента повышения по инструкции %Коэффициент не равен указанному в штатном расписании %ШтатРазмер. Проведение отменено!""
		//|		ИНАЧЕ """"
		//|	КОНЕЦ КАК ТекстОшибки,
		//|	Штатное.Размер КАК ШтатРазмер
		//|ИЗ
		//|	ВтПрием КАК Прием
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПовышенияПоИнструкцииПоШтатному.СрезПоследних(
		//|				&Дата,
		//|				(Должность, ПодразделениеОрганизации, Коэффициент) В
		//|					(ВЫБРАТЬ
		//|						Прием.Должность,
		//|						Прием.ПодразделениеОрганизации,
		//|						Прием.Коэффициент
		//|					ИЗ
		//|						ВтПрием КАК Прием)) КАК Штатное
		//|		ПО Прием.Должность = Штатное.Должность
		//|			И Прием.ПодразделениеОрганизации = Штатное.ПодразделениеОрганизации
		//|			И Прием.Коэффициент = Штатное.Коэффициент
		//|			И Прием.Действие В ( ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ), ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Изменить ) )
		//|";
		////- СВЭЙ 07.02.19 КДЯ СВФР-003209
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
		
		
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
		
		УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной( "глУчетнаяПолитикаПоПерсоналуОрганизации" );
		ПроверкаШтатногоРасписания = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(
		УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания" );
		///0//////////////////////////////////////////////////////////////////////////////	
		Запрос.Текст = "ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209
		|
		|	Сотрудники.ДатаПриема,
		|	Сотрудники.НомерСтроки,
		|	Сотрудники.Сотрудник,
		|
		|	Сотрудники.ПодразделениеОрганизации КАК Подразделение,
		|	Сотрудники.Должность,
		|	Сотрудники.ГрафикРаботы,
		|	Сотрудники.ПроцентПоКонтракту,
		|
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	ВЫРАЗИТЬ( Сотрудники.ТарифнаяСтавка КАК ЧИСЛО(15,3) ) КАК ТарифнаяСтавка, //точность на 1 знак больше, как есть в реквизите, чтобы минимизировать погрешности округления (см.ниже)
		|
		|	Сотрудники.РазрядЕТС,
		|	Сотрудники.КоэффициентЕТС,
		|	Сотрудники.ПовышенныйКоэффициентЕТС,
		|
		|	Сотрудники.УсловияТрудаИзмерение,
		|	Сотрудники.ВидДеятельностиИзмерение
		|
		|ПОМЕСТИТЬ ВтСотрудники
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &ДокументСсылка
		|	И Сотрудники.Сотрудник <> ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
		|	И Сотрудники.ЗанимаемыхСтавок > 0
		|;
		|
		|///1/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Сотрудники.ДатаПриема,
		|	Сотрудники.НомерСтроки,
		|	Сотрудники.Сотрудник,
		|
		|	Сотрудники.Подразделение,
		|	Сотрудники.Должность,
		|	Сотрудники.ГрафикРаботы,
		|	Сотрудники.ПроцентПоКонтракту,
		|
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	Сотрудники.ТарифнаяСтавка,
		|
		|	Сотрудники.РазрядЕТС,
		|	Сотрудники.КоэффициентЕТС,
		|	Сотрудники.ПовышенныйКоэффициентЕТС,
		|	Сотрудники.УсловияТрудаИзмерение,
		|	Сотрудники.ВидДеятельностиИзмерение,
		|
		|	ПовышенияПоИнструкции.НомерСтроки КАК ПовышенияНомерСтроки,
		|	ПовышенияПоИнструкции.Коэффициент,
		|	ПовышенияПоИнструкции.Размер,
		|	ПовышенияПоИнструкции.Действие
		|
		|ПОМЕСТИТЬ ВтПовышенияПоИнструкции
		|ИЗ
		|	ВтСотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.ПовышенияПоИнструкции КАК ПовышенияПоИнструкции
		|		ПО Сотрудники.Ссылка = ПовышенияПоИнструкции.Ссылка
		|			И Сотрудники.Сотрудник = ПовышенияПоИнструкции.Сотрудник
		|;
		|
		|///2/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штатное.Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.РазмерСтавки1Разряда = 0 ТОГДА 1 ИНАЧЕ Штатное.РазмерСтавки1Разряда КОНЕЦ КАК РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Штатное.ПодразделениеОрганизации КАК Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	ISNULL( ШтатныеПовышенияПоИнструкции.Коэффициент, ЗНАЧЕНИЕ( Справочник.КоэффициентыПовышения.ПустаяСсылка ) ) КАК Коэффициент,
		|	ISNULL( ШтатныеПовышенияПоИнструкции.Размер, 0 ) КАК Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкцииСДублями
		|ИЗ
		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(
		|			&Дата,
		|			( ПодразделениеОрганизации, Должность, ГрафикРаботы, ПроцентПоКонтракту,
		|
		|					РазрядЕТС,
		|					КоэффициентЕТС,
		|					ПовышенныйКоэффициентЕТС,
		|
		|					УсловияТрудаИзмерение,
		|					ВидДеятельностиИзмерение
		|
		|				) В
		|				(ВЫБРАТЬ
		|					Подразделение, Должность, ГрафикРаботы, ПроцентПоКонтракту,
		|
		|					РазрядЕТС,
		|					КоэффициентЕТС,
		|					ПовышенныйКоэффициентЕТС,
		|
		|					УсловияТрудаИзмерение,
		|					ВидДеятельностиИзмерение
		|
		|				ИЗ
		|					ВтСотрудники КАК Сотрудники)
		|		) КАК Штатное
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ШтатныеПовышенияПоИнструкции
		|		ПО Штатное.Регистратор = ШтатныеПовышенияПоИнструкции.Ссылка
		|			И Штатное.КодСтроки = ШтатныеПовышенияПоИнструкции.КодСтроки
		|ГДЕ
		|	Штатное.ЗанимаемыхСтавок > 0
		|;
		|
		|///3/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.ТарифнаяСтавка  * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КОНЕЦ 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления,
		|
		|	МИНИМУМ( Штатное.Размер = ISNULL( Прием.Размер, 0 ) ) КАК ВсеКоэффициентыСовпали 
		|
		|
		|ПОМЕСТИТЬ ВтПолныеСовпаденияКоэффициентов
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Сотрудники.ИтоговоеПовышениеПоИнструкции
		|
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПовышенияПоИнструкции КАК Прием
		|		ПО 
		|		   Сотрудники.НомерСтроки = Прием.НомерСтроки 
		|		   И Штатное.Коэффициент = Прием.Коэффициент 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		|	Сотрудники.ЗанимаемыхСтавок,
		|	Сотрудники.МесячнаяТарифнаяСтавка,
		|	Сотрудники.ТарифнаяСтавка,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫБОР КОГДА Штатное.ТарифнаяСтавка  * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|			ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|				* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КОНЕЦ 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						   
		|ИМЕЮЩИЕ
		|	МИНИМУМ( Штатное.Размер = ISNULL( Прием.Размер, 0 ) ) = Истина
		|;
		|
		|///4/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Совпадения.НомерСтроки
		|ПОМЕСТИТЬ ВтСотрудникиПолныеСовпаденияКоэффициентов
		|ИЗ
		|	ВтПолныеСовпаденияКоэффициентов КАК Совпадения
		|;
		|
		|///5/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209
		|	ВЫРАЗИТЬ(
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		КОНЕЦ
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 ) ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтПериодыИсходные
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Сотрудники.ИтоговоеПовышениеПоИнструкции
		|
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСотрудникиПолныеСовпаденияКоэффициентов КАК СотрудникиПолныеСовпаденияКоэффициентов
		|		ПО 
		|		   Сотрудники.НомерСтроки = СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки 
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПолныеСовпаденияКоэффициентов КАК ПолныеСовпаденияКоэффициентов
		|		ПО 
		|			НЕ СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL
		|			И Сотрудники.НомерСтроки = ПолныеСовпаденияКоэффициентов.НомерСтроки 
		|
		|			И Штатное.Подразделение = ПолныеСовпаденияКоэффициентов.Подразделение
		|			И Штатное.Должность = ПолныеСовпаденияКоэффициентов.Должность
		|			И Штатное.ГрафикРаботы = ПолныеСовпаденияКоэффициентов.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту = ПолныеСовпаденияКоэффициентов.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции = ПолныеСовпаденияКоэффициентов.ИтоговоеПовышениеПоИнструкции
		|
		|			И Штатное.ЗанимаемыхСтавок = ПолныеСовпаденияКоэффициентов.ЗанимаемыхСтавок
		|			И Штатное.МесячнаяТарифнаяСтавка = ПолныеСовпаденияКоэффициентов.МесячнаяТарифнаяСтавка
		|			И Штатное.ТарифнаяСтавка = ПолныеСовпаденияКоэффициентов.ТарифнаяСтавка
		|
		|			И Штатное.РазрядЕТС = ПолныеСовпаденияКоэффициентов.РазрядЕТС
		|			И Штатное.КоэффициентЕТС = ПолныеСовпаденияКоэффициентов.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС = ПолныеСовпаденияКоэффициентов.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение = ПолныеСовпаденияКоэффициентов.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение = ПолныеСовпаденияКоэффициентов.ВидДеятельностиИзмерение
		|
		|			И Штатное.Период  = ПолныеСовпаденияКоэффициентов.Период
		|
		|ГДЕ
		|	СотрудникиПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL	
		|	ИЛИ НЕ ПолныеСовпаденияКоэффициентов.НомерСтроки IS NULL	
		|;
		|
		|
		|///6/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МИНИМУМ( ПогрешностьОкругления ) КАК МинимальнаяПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтМинимальныеПогрешностиОкругления
		|ИЗ
		|	ВтПериодыИсходные КАК Штатное
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///7/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Округление.МинимальнаяПогрешностьОкругления, 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МАКСИМУМ( Штатное.Период ) КАК МаксимальныйПериод
		|
		|ПОМЕСТИТЬ  ВтПериоды
		|ИЗ
		|	ВтПериодыИсходные КАК Штатное
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМинимальныеПогрешностиОкругления КАК Округление
		|		ПО Штатное.Подразделение = Округление.Подразделение 
		|		   И Штатное.Должность = Округление.Должность 
		|		   И Штатное.ГрафикРаботы = Округление.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Округление.ПроцентПоКонтракту 
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции = Округление.ИтоговоеПовышениеПоИнструкции
		|
		|		   И Штатное.НомерСтроки = Округление.НомерСтроки
		|		   И Штатное.ПогрешностьОкругления = Округление.МинимальнаяПогрешностьОкругления 
		|
		|		   И Штатное.РазрядЕТС = Округление.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Округление.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Округление.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Округление.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Округление.ВидДеятельностиИзмерение 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Округление.МинимальнаяПогрешностьОкругления, 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|///8/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Периоды.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Периоды.РазмерСтавки1Разряда КАК РазмерСтавки1РазрядаСотр, 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Коэффициент,
		|	Штатное.Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкции
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПериоды КАК Периоды
		|		ПО
		|			Штатное.Подразделение = Периоды.Подразделение
		|			И Штатное.Должность =     Периоды.Должность
		|			И Штатное.ГрафикРаботы =  Периоды.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту =  		  Периоды.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции = Периоды.ИтоговоеПовышениеПоИнструкции
		|
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			И  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И ВЫРАЗИТЬ( 
		|			  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			  КОНЕЦ = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			  КОНЕЦ 
		|			  КАК ЧИСЛО( 17, 5 )	) = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|
		|			И Штатное.Период	 = Периоды.МаксимальныйПериод
		|
		|			И Штатное.РазрядЕТС =   Периоды.РазрядЕТС
		|			И Штатное.КоэффициентЕТС =   Периоды.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС =   Периоды.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение =   Периоды.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение =   Периоды.ВидДеятельностиИзмерение
		|;
		|
		|
		|///9/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Штатное.ЗанимаемыхСтавок,
		|	Штатное.МесячнаяТарифнаяСтавка,
		|	Штатное.ТарифнаяСтавка,
		|    Сотрудники.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Сотрудники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокСотр,
		|	Сотрудники.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавкаСотр,
		|	Сотрудники.ТарифнаяСтавка КАК ТарифнаяСтавкаСотр,
		|	Сотрудники.ИтоговоеПовышениеПоИнструкции КАК ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Период КАК Период,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	ВЫРАЗИТЬ( 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|		КОНЕЦ
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ЧИСЛО( 17, 5 )  ) 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	КАК ПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтПериодыБезИтоговогоПовышенияИсходные
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСотрудники КАК Сотрудники
		|		ПО Штатное.Подразделение = Сотрудники.Подразделение 
		|		   И Штатное.Должность = Сотрудники.Должность 
		|		   И Штатное.ГрафикРаботы = Сотрудники.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Сотрудники.ПроцентПоКонтракту
		|
		|		   И Штатное.ИтоговоеПовышениеПоИнструкции <> Сотрудники.ИтоговоеПовышениеПоИнструкции
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) >= -0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Штатное.ТарифнаяСтавка * Сотрудники.ЗанимаемыхСтавок 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Сотрудники.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Сотрудники.ТарифнаяСтавка * Штатное.ЗанимаемыхСтавок ) <= 0.005 * ( Сотрудники.ЗанимаемыхСтавок + Штатное.ЗанимаемыхСтавок )
		|		   И ( Сотрудники.ЗанимаемыхСтавок <= Штатное.ЗанимаемыхСтавок )
		|
		|		   И Штатное.РазрядЕТС = Сотрудники.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Сотрудники.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Сотрудники.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Сотрудники.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Сотрудники.ВидДеятельностиИзмерение 
		|;
		|
		|
		|///10/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Штатное.ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МИНИМУМ( ПогрешностьОкругления ) КАК МинимальнаяПогрешностьОкругления
		|
		|ПОМЕСТИТЬ ВтМинимальныеПогрешностиОкругленияБезИтоговогоПовышения
		|ИЗ
		|	ВтПериодыБезИтоговогоПовышенияИсходные КАК Штатное
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		|	Штатное.ЗанимаемыхСтавокСотр,
		|	Штатное.ТарифнаяСтавкаСотр,
		|	Штатное.ИтоговоеПовышениеПоИнструкцииСотр,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///11/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Округление.ЗанимаемыхСтавокСотр,
		|	Округление.ТарифнаяСтавкаСотр,
		|	Округление.ИтоговоеПовышениеПоИнструкцииСотр,
		|	Округление.МинимальнаяПогрешностьОкругления,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	МАКСИМУМ( Штатное.Период ) КАК МаксимальныйПериод
		|
		|ПОМЕСТИТЬ  ВтПериодыБезИтоговогоПовышения
		|ИЗ
		|	ВтПериодыБезИтоговогоПовышенияИсходные КАК Штатное
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтМинимальныеПогрешностиОкругленияБезИтоговогоПовышения КАК Округление
		|		ПО Штатное.Подразделение = Округление.Подразделение 
		|		   И Штатное.Должность = Округление.Должность 
		|		   И Штатное.ГрафикРаботы = Округление.ГрафикРаботы 
		|		   И Штатное.ПроцентПоКонтракту = Округление.ПроцентПоКонтракту 
		|
		|		   И Штатное.НомерСтроки = Округление.НомерСтроки
		|		   И Штатное.ПогрешностьОкругления = Округление.МинимальнаяПогрешностьОкругления 
		|
		|		   И Штатное.РазрядЕТС = Округление.РазрядЕТС 
		|		   И Штатное.КоэффициентЕТС = Округление.КоэффициентЕТС 
		|		   И Штатное.ПовышенныйКоэффициентЕТС = Округление.ПовышенныйКоэффициентЕТС 
		|		   И Штатное.УсловияТрудаИзмерение = Округление.УсловияТрудаИзмерение 
		|		   И Штатное.ВидДеятельностиИзмерение = Округление.ВидДеятельностиИзмерение 
		|
		|СГРУППИРОВАТЬ ПО
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|
		|    Штатное.НомерСтроки,
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Штатное.РазмерСтавки1Разряда,
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|	Округление.ЗанимаемыхСтавокСотр,
		|	Округление.ТарифнаяСтавкаСотр,
		|	Округление.ИтоговоеПовышениеПоИнструкцииСотр,
		|	Округление.МинимальнаяПогрешностьОкругления,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение
		|;
		|
		|
		|///12/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штатное.Подразделение,
		|	Штатное.Должность,
		|	Штатное.ГрафикРаботы,
		|	Штатное.ПроцентПоКонтракту,
		|	Штатное.ИтоговоеПовышениеПоИнструкции,
		|
		|	Периоды.НомерСтроки,
		|
		|	Штатное.РазрядЕТС,
		|	Штатное.КоэффициентЕТС,
		|	Штатное.ПовышенныйКоэффициентЕТС,
		|	Штатное.УсловияТрудаИзмерение,
		|	Штатное.ВидДеятельностиИзмерение,
		|
		|	Штатное.Коэффициент,
		|	Штатное.Размер
		|
		|ПОМЕСТИТЬ ВтШтатныеПовышенияПоИнструкцииБезИтогового
		|ИЗ
		|	ВтШтатныеПовышенияПоИнструкцииСДублями КАК Штатное
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтПериодыБезИтоговогоПовышения КАК Периоды
		|		ПО
		|			Штатное.Подразделение = Периоды.Подразделение
		|			И Штатное.Должность =     Периоды.Должность
		|			И Штатное.ГрафикРаботы =  Периоды.ГрафикРаботы
		|			И Штатное.ПроцентПоКонтракту =  Периоды.ПроцентПоКонтракту
		|			И Штатное.ИтоговоеПовышениеПоИнструкции <> Периоды.ИтоговоеПовышениеПоИнструкцииСотр
		|
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			И ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И ВЫРАЗИТЬ( 
		|			  ВЫБОР КОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						> Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ТОГДА Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|					- Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|				ИНАЧЕ Периоды.ТарифнаяСтавкаСотр * Штатное.ЗанимаемыхСтавок 
		|					- Штатное.ТарифнаяСтавка * Периоды.ЗанимаемыхСтавокСотр
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|						* Периоды.РазмерСтавки1Разряда / Штатное.РазмерСтавки1Разряда
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//|			  КОНЕЦ 			 = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		//+ СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			  КОНЕЦ 
		|			  КАК ЧИСЛО( 17, 5 )	) = Периоды.МинимальнаяПогрешностьОкругления
		//- СВЭЙ 12.06.19 КДЯ СВФР-003209 
		|			И Штатное.Период	 = Периоды.МаксимальныйПериод
		|
		|			И Штатное.РазрядЕТС =   Периоды.РазрядЕТС
		|			И Штатное.КоэффициентЕТС =   Периоды.КоэффициентЕТС
		|			И Штатное.ПовышенныйКоэффициентЕТС =   Периоды.ПовышенныйКоэффициентЕТС
		|			И Штатное.УсловияТрудаИзмерение =   Периоды.УсловияТрудаИзмерение
		|			И Штатное.ВидДеятельностиИзмерение =   Периоды.ВидДеятельностиИзмерение
		|;
		|
		|///13/////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.НомерСтроки КАК НомерСтроки,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	ISNULL( Прием.Коэффициент, 
		|				ISNULL( Штатное.Коэффициент, ISNULL( ШтатноеБезИтогового.Коэффициент, 
		|                    ISNULL( ШтатноеБезПриема.Коэффициент, ISNULL( ШтатноеБезПриемаБезИтогового.Коэффициент,
		|		ЗНАЧЕНИЕ( Справочник.КоэффициентыПовышения.ПустаяСсылка ) ) ) ) ) ) КАК Коэффициент,
		|	ВЫБОР КОГДА НЕ Штатное.Коэффициент IS NULL ТОГДА 1
		|		  КОГДА НЕ ШтатноеБезИтогового.Коэффициент IS NULL ТОГДА 2
		|		  КОГДА НЕ ШтатноеБезПриема.Коэффициент IS NULL ТОГДА 3
		|		  КОГДА НЕ ШтатноеБезПриемаБезИтогового.Коэффициент IS NULL ТОГДА 4
		|          ИНАЧЕ 0
		|	КОНЕЦ КАК НомерСоединения, //для отладки
		|	ISNULL( Прием.Размер, 0 ) КАК Размер,
		|	ISNULL( Прием.ПовышенияНомерСтроки, 0 ) КАК ПовышенияНомерСтроки,
		|	ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) КАК Действие,
		
		|	Сотрудники.ДатаПриема КАК ДатаПриема,
		
		|	ISNULL( Прием.Размер, 0 ) 
		|						<> ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|                             ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|									0 ) ) ) )
		|			И ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) 
		|						<> ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Прекратить ) 
		|	КАК ЕстьОшибка,
		|	ВЫБОР
		|		КОГДА ISNULL( Прием.Размер, 0 ) 
		|						<> ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|                             ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|									0 ) ) ) )
		|				И ISNULL( Прием.Действие, ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Начать ) ) 
		|						<> ЗНАЧЕНИЕ( Перечисление.ВидыДействияСНачислением.Прекратить ) 
		|			ТОГДА ""Строка: %НомерСтроки; Сотрудник: %Сотрудник - Размер %ПриемРазмер коэффициента повышения по инструкции %Коэффициент 
		|						не равен указанному в штатном расписании %ШтатРазмер. Проведение отменено!""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТекстОшибки,
		|	ISNULL( Штатное.Размер, ISNULL( ШтатноеБезИтогового.Размер,
		|              ISNULL( ШтатноеБезПриема.Размер, ISNULL( ШтатноеБезПриемаБезИтогового.Размер,
		|					  0 ) ) ) )
		|			КАК ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтЗаписиСДублями
		|ИЗ
		|	ВтСотрудники КАК Сотрудники
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПовышенияПоИнструкции КАК Прием
		|		ПО Сотрудники.НомерСтроки = Прием.НомерСтроки
		|
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкции КАК Штатное     //1 Соединение
		|		ПО 
		|			НЕ Прием.Сотрудник IS NULL
		|
		|			И Прием.Должность = Штатное.Должность
		|			И Прием.Подразделение = Штатное.Подразделение
		|			И Прием.ГрафикРаботы = Штатное.ГрафикРаботы
		|			И Прием.ПроцентПоКонтракту = Штатное.ПроцентПоКонтракту
		|			И Прием.ИтоговоеПовышениеПоИнструкции = Штатное.ИтоговоеПовышениеПоИнструкции
		|
		|			И Прием.НомерСтроки = Штатное.НомерСтроки
		|
		|			И Прием.РазрядЕТС =   Штатное.РазрядЕТС
		|			И Прием.КоэффициентЕТС =   Штатное.КоэффициентЕТС
		|			И Прием.ПовышенныйКоэффициентЕТС =   Штатное.ПовышенныйКоэффициентЕТС
		|			И Прием.УсловияТрудаИзмерение =   Штатное.УсловияТрудаИзмерение
		|			И Прием.ВидДеятельностиИзмерение =   Штатное.ВидДеятельностиИзмерение
		|
		|			И Прием.Коэффициент = Штатное.Коэффициент
		|
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкцииБезИтогового КАК ШтатноеБезИтогового   //2 Соединение
		|		ПО  
		|			НЕ Прием.Сотрудник IS NULL
		|            И Штатное.Должность IS NULL
		|
		|			И Прием.Должность = ШтатноеБезИтогового.Должность
		|			И Прием.Подразделение = ШтатноеБезИтогового.Подразделение
		|			И Прием.ГрафикРаботы = ШтатноеБезИтогового.ГрафикРаботы
		|			И Прием.ПроцентПоКонтракту = ШтатноеБезИтогового.ПроцентПоКонтракту
		|			И Прием.ИтоговоеПовышениеПоИнструкции <> ШтатноеБезИтогового.ИтоговоеПовышениеПоИнструкции
		|
		|			И Прием.НомерСтроки = ШтатноеБезИтогового.НомерСтроки
		|
		|			И Прием.РазрядЕТС =   ШтатноеБезИтогового.РазрядЕТС
		|			И Прием.КоэффициентЕТС =   ШтатноеБезИтогового.КоэффициентЕТС
		|			И Прием.ПовышенныйКоэффициентЕТС =   ШтатноеБезИтогового.ПовышенныйКоэффициентЕТС
		|			И Прием.УсловияТрудаИзмерение =   ШтатноеБезИтогового.УсловияТрудаИзмерение
		|			И Прием.ВидДеятельностиИзмерение =   ШтатноеБезИтогового.ВидДеятельностиИзмерение
		|
		|			И Прием.Коэффициент = ШтатноеБезИтогового.Коэффициент
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкции КАК ШтатноеБезПриема                   //3 Соединение
		|		ПО 
		|			Прием.Сотрудник IS NULL
		|
		|			И Сотрудники.Должность = ШтатноеБезПриема.Должность
		|			И Сотрудники.Подразделение = ШтатноеБезПриема.Подразделение
		|			И Сотрудники.ГрафикРаботы = ШтатноеБезПриема.ГрафикРаботы
		|			И Сотрудники.ПроцентПоКонтракту = ШтатноеБезПриема.ПроцентПоКонтракту
		|			И Сотрудники.ИтоговоеПовышениеПоИнструкции = ШтатноеБезПриема.ИтоговоеПовышениеПоИнструкции
		|
		|			И Сотрудники.НомерСтроки = ШтатноеБезПриема.НомерСтроки
		|
		|			И Сотрудники.РазрядЕТС =   ШтатноеБезПриема.РазрядЕТС
		|			И Сотрудники.КоэффициентЕТС =   ШтатноеБезПриема.КоэффициентЕТС
		|			И Сотрудники.ПовышенныйКоэффициентЕТС =   ШтатноеБезПриема.ПовышенныйКоэффициентЕТС
		|			И Сотрудники.УсловияТрудаИзмерение =   ШтатноеБезПриема.УсловияТрудаИзмерение
		|			И Сотрудники.ВидДеятельностиИзмерение =   ШтатноеБезПриема.ВидДеятельностиИзмерение
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтШтатныеПовышенияПоИнструкцииБезИтогового КАК ШтатноеБезПриемаБезИтогового    //4 Соединение
		|		ПО  
		|			Прием.Сотрудник IS NULL
		|            И ШтатноеБезПриема.Должность IS NULL
		|
		|			И Сотрудники.Должность = ШтатноеБезПриемаБезИтогового.Должность
		|			И Сотрудники.Подразделение = ШтатноеБезПриемаБезИтогового.Подразделение
		|			И Сотрудники.ГрафикРаботы = ШтатноеБезПриемаБезИтогового.ГрафикРаботы
		|			И Сотрудники.ПроцентПоКонтракту = ШтатноеБезПриемаБезИтогового.ПроцентПоКонтракту
		|			И Сотрудники.ИтоговоеПовышениеПоИнструкции <> ШтатноеБезПриемаБезИтогового.ИтоговоеПовышениеПоИнструкции
		|
		|			И Сотрудники.НомерСтроки = ШтатноеБезПриемаБезИтогового.НомерСтроки
		|
		|			И Сотрудники.РазрядЕТС =   ШтатноеБезПриемаБезИтогового.РазрядЕТС
		|			И Сотрудники.КоэффициентЕТС =   ШтатноеБезПриемаБезИтогового.КоэффициентЕТС
		|			И Сотрудники.ПовышенныйКоэффициентЕТС =   ШтатноеБезПриемаБезИтогового.ПовышенныйКоэффициентЕТС
		|			И Сотрудники.УсловияТрудаИзмерение =   ШтатноеБезПриемаБезИтогового.УсловияТрудаИзмерение
		|			И Сотрудники.ВидДеятельностиИзмерение =   ШтатноеБезПриемаБезИтогового.ВидДеятельностиИзмерение
		|;
		|
		|/// 14 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаПриема,
		|	МИНИМУМ( ЕстьОшибка ) КАК ЕстьОшибка
		|
		|ПОМЕСТИТЬ ВтОтборЗаписей_ЕстьОшибка
		|ИЗ
		|	ВтЗаписиСДублями КАК ЗаписиСДублями
		|
		|СГРУППИРОВАТЬ ПО
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаПриема
		|;
		|
		|/// 15 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиСДублями.НомерСтроки,
		|	ЗаписиСДублями.ПовышенияНомерСтроки,
		|	ЗаписиСДублями.Сотрудник,
		|	ЗаписиСДублями.Коэффициент,
		|	ЗаписиСДублями.Действие,
		|	ЗаписиСДублями.ДатаПриема,
		|	ЗаписиСДублями.Размер,
		|	ЗаписиСДублями.ЕстьОшибка,
		|	ЗаписиСДублями.ТекстОшибки,
		|	ЗаписиСДублями.ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтЗаписиОтобранныеПоЕстьОшибка
		|ИЗ
		|	ВтЗаписиСДублями КАК ЗаписиСДублями
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборЗаписей_ЕстьОшибка КАК Отбор_ЕстьОшибка 
		|		ПО 
		|			ЗаписиСДублями.НомерСтроки = Отбор_ЕстьОшибка.НомерСтроки
		|			И ЗаписиСДублями.ПовышенияНомерСтроки = Отбор_ЕстьОшибка.ПовышенияНомерСтроки
		|			И ЗаписиСДублями.Сотрудник = Отбор_ЕстьОшибка.Сотрудник
		|			И ЗаписиСДублями.Коэффициент = Отбор_ЕстьОшибка.Коэффициент
		|			И ЗаписиСДублями.Действие = Отбор_ЕстьОшибка.Действие
		|			И ЗаписиСДублями.ДатаПриема = Отбор_ЕстьОшибка.ДатаПриема
		|			И ЗаписиСДублями.ЕстьОшибка = Отбор_ЕстьОшибка.ЕстьОшибка
		|;
		|
		|/// 16 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаПриема,
		|	МАКСИМУМ( ШтатРазмер ) КАК ШтатРазмер
		|
		|ПОМЕСТИТЬ ВтОтборЗаписей_ШтатРазмер
		|ИЗ
		|	ВтЗаписиОтобранныеПоЕстьОшибка КАК ЗаписиОтобранныеПоЕстьОшибка
		|
		|СГРУППИРОВАТЬ ПО
		|	НомерСтроки,
		|	ПовышенияНомерСтроки,
		|	Сотрудник,
		|	Коэффициент,
		|	Действие,
		|	ДатаПриема
		|;
		|
		|/// 17 /////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Записи.НомерСтроки,
		|	Записи.ПовышенияНомерСтроки,
		|	Записи.Сотрудник,
		|	Записи.Коэффициент,
		|	Записи.Действие,
		|	Записи.ДатаПриема,
		|	Записи.Размер,
		|
		|	Записи.ЕстьОшибка,
		|	Записи.ТекстОшибки,
		|	Записи.ШтатРазмер
		|
		|ИЗ
		|	ВтЗаписиОтобранныеПоЕстьОшибка КАК Записи
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтборЗаписей_ШтатРазмер КАК ОтборЗаписей_ШтатРазмер 
		|		ПО 
		|			Записи.НомерСтроки = ОтборЗаписей_ШтатРазмер.НомерСтроки
		|			И Записи.ПовышенияНомерСтроки = ОтборЗаписей_ШтатРазмер.ПовышенияНомерСтроки
		|			И Записи.Сотрудник = ОтборЗаписей_ШтатРазмер.Сотрудник
		|			И Записи.Коэффициент = ОтборЗаписей_ШтатРазмер.Коэффициент
		|			И Записи.Действие = ОтборЗаписей_ШтатРазмер.Действие
		|			И Записи.ДатаПриема = ОтборЗаписей_ШтатРазмер.ДатаПриема
		|			И Записи.ШтатРазмер = ОтборЗаписей_ШтатРазмер.ШтатРазмер
		|
		|ГДЕ
		|	Записи.ЕстьОшибка  
		|	ИЛИ Записи.Размер > 0	 
		|	 
		|УПОРЯДОЧИТЬ ПО
		|	Записи.НомерСтроки,		 
		|	Записи.ПовышенияНомерСтроки		 
		|";
		
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
		
	Иначе	
		//- СВЭЙ 07.02.19 КДЯ СВФР-003209 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка,
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Коэффициент,
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Размер,
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник,
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Действие,
		|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема
		|ИЗ
		|	Документ.ПриемНаРаботуВОрганизацию.ПовышенияПоИнструкции КАК ПриемНаРаботуВОрганизациюПовышенияПоИнструкции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|		ПО ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
		|			И ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
		|ГДЕ
		|	ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Ссылка = &ДокументСсылка
		|	И ПриемНаРаботуВОрганизациюПовышенияПоИнструкции.Сотрудник <> &ПустойСотрудник
		|";
		
		//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
	КонецЕсли; 
	//- СВЭЙ 07.02.19 КДЯ СВФР-003209
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

// Формирует запрос по таблице "ОсновныеНачисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.НомерСтроки,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Валюта6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд1,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд2,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд3,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд4,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд5,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ТарифныйРазряд6,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.СпособРасчета,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета,
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Показатель1ВВалюте
	|ПОМЕСТИТЬ ВТДанныеНачислений
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.ОсновныеНачисления КАК ПриемНаРаботуВОрганизациюОсновныеНачисления
	|ГДЕ
	|	ПриемНаРаботуВОрганизациюОсновныеНачисления.Ссылка = &ДокументСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаПриема,
	|	ТЧРаботникиОрганизации.ДатаУвольнения,
	|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧНачисления.Ссылка КАК Ссылка,
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаПриема КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать) КАК Действие,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаУвольнения, ДЕНЬ, 1)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.ПустаяСсылка)
	|	КОНЕЦ КАК ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчетаЗачетОтработанногоВремени
	|			ТОГДА """"
	|		ИНАЧЕ ТЧНачисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчетаИзмерение,
	|	ТЧНачисления.ВидРасчетаСпособРасчета КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчетаЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ВидРасчетаТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ВидРасчетаПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1 КАК Показатель1,
	|	ТЧНачисления.Валюта1 КАК Валюта1,
	|	ТЧНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
	|	ТЧНачисления.Показатель2 КАК Показатель2,
	|	ТЧНачисления.Валюта2 КАК Валюта2,
	|	ТЧНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
	|	ТЧНачисления.Показатель3 КАК Показатель3,
	|	ТЧНачисления.Валюта3 КАК Валюта3,
	|	ТЧНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
	|	ТЧНачисления.Показатель4 КАК Показатель4,
	|	ТЧНачисления.Валюта4 КАК Валюта4,
	|	ТЧНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
	|	ТЧНачисления.Показатель5 КАК Показатель5,
	|	ТЧНачисления.Валюта5 КАК Валюта5,
	|	ТЧНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
	|	ТЧНачисления.Показатель6 КАК Показатель6,
	|	ТЧНачисления.Валюта6 КАК Валюта6,
	|	ТЧНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
	|	ТЧНачисления.Показатель1ВВалюте КАК Показатель1ВВалюте
	|ИЗ
	|	ВТДанныеНачислений КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДокумента КАК ТЧРаботникиОрганизации
	|		ПО ТЧНачисления.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(Запрос.Выполнить().Выгрузить(), ПроверкаШтатногоРасписания,,Ссылка);
	
	
КонецФункции // СформироватьЗапросПоНачисления()

Функция СформироватьЗапросПоПрежнимМестам(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
	|	ВложенныйЗапрос.КонфликтныйДокумент КАК КонфликтныйДокумент,
	|	ВложенныйЗапрос.ВидЗанятостиПоДругомуМестуРаботы КАК ВидЗанятостиПоДругомуМестуРаботы
	|ИЗ
	|	Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ДанныеПоРаботникуДоНазначения.Сотрудник.Физлицо КАК Физлицо,
	|			ДанныеПоРаботникуДоНазначения.Регистратор КАК КонфликтныйДокумент,
	|			ДанныеПоРаботникуДоНазначения.Сотрудник.ВидЗанятости КАК ВидЗанятостиПоДругомуМестуРаботы,
	|			0 КАК НомерСтроки
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Док.Сотрудник.Физлицо КАК Физлицо,
	|					СостояниеВнутри.Сотрудник КАК Сотрудник,
	|					МАКСИМУМ(СостояниеВнутри.Период) КАК ДатаПоследнегоИзменения
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций КАК СостояниеВнутри
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК Док
	|						ПО (Док.Ссылка = &ДокументСсылка)
	|							И СостояниеВнутри.Сотрудник.Физлицо = Док.Сотрудник.Физлицо
	|							И (СостояниеВнутри.Организация = &ГоловнаяОрганизация)
	|							И СостояниеВнутри.Период <= Док.ДатаПриема
	|				
	|				СГРУППИРОВАТЬ ПО
	|					Док.Сотрудник.Физлицо,
	|					СостояниеВнутри.Сотрудник) КАК СписокДат
	|				ПО ДанныеПоРаботникуДоНазначения.Сотрудник = СписокДат.Сотрудник
	|					И ДанныеПоРаботникуДоНазначения.Период = СписокДат.ДатаПоследнегоИзменения
	|					И (ДанныеПоРаботникуДоНазначения.Организация = &ГоловнаяОрганизация)
	|					И (ДанныеПоРаботникуДоНазначения.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник.Физлицо,
	|			ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка,
	|			ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник.ВидЗанятости,
	|			ПриемНаРаботуВОрганизациюРаботникиОрганизации.НомерСтроки
	|		ИЗ
	|			Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ГДЕ
	|			ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка = &ДокументСсылка) КАК ВложенныйЗапрос
	|		ПО ТЧРаботникиОрганизации.ФизЛицо = ВложенныйЗапрос.Физлицо
	|			И ТЧРаботникиОрганизации.НомерСтроки <> ВложенныйЗапрос.НомерСтроки
	|			И ТЧРаботникиОрганизации.Сотрудник.ВидЗанятости <> ВложенныйЗапрос.ВидЗанятостиПоДругомуМестуРаботы
	|ГДЕ
	|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|ИТОГИ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоПрежнимМестам()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, в которую принимается работник!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники"": ";
	
	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Принимаем только по трудовому договору
	Если ВыборкаПоСтрокамДокумента.НеВерныйДоговор Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "у работника указан вид договора отличный от 'Трудового договора'!", Отказ, Заголовок);
		Возврат;
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный работник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение, в которое принимается работник!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
	КонецЕсли;
	
	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана должность работника!", Отказ, Заголовок);
	КонецЕсли;
	//О.Т. Аверсон 04.11.2015 № 679
	Если  НЕ ВыборкаПоСтрокамДокумента.БезЕТС и не Организация.НеУчитыватьЕТКС Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ТарифнаяСтавкаПервогоРазряда) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана тарифная ставка первого разряда!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	//О.Т. Аверсон 04.11.2015 № 679
	// ДатаПриема
	ЕстьДатаПриема = ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаПриема);
	Если НЕ ЕстьДатаПриема Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата приема на работу!", Отказ, Заголовок);
	Иначе
		#Если Клиент Тогда
			Если ВыборкаПоСтрокамДокумента.ДатаПриема > РабочаяДата Тогда
				Сообщить(СтрокаНачалаСообщенияОбОшибке + "дата приема на работу превышает рабочую дату!", СтатусСообщения.Важное);
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	// Количество ставок
	Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок!", Отказ, Заголовок);
		
	ИначеЕсли ЕстьДатаПриема И ПроверкаШтатногоРасписания Тогда
		Если ВыборкаПоСтрокамДокумента.ОстатокСтавок < ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок Тогда
			//ПСА 28.01.2021 СВФР-007121 +++
			//если не ((Организация.ИНН = "100074549" или Организация.ИНН = "500021638") и ВыборкаПоСтрокамДокумента.СдельнаяОплата) Тогда //О.Т. Аверсон 15.10.2015 № 638
			если не (ВыборкаПоСтрокамДокумента.СдельнаяОплата) Тогда
				//+++ПСА 28.01.2021 СВФР-007121 
				
				//(начало) закомментировано Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
				//ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "в штатном расписании не предусмотрены ставки для приема работника!", Отказ, Заголовок);
				//(завершение) закомментировано Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
				//(начало) добавлено Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
				ОбщегоНазначения.СообщитьОбОшибке( СтрокаНачалаСообщенияОбОшибке + "в штатном расписании не предусмотрены ставки для приема работника ( в наличии ставок = "
				+ ВыборкаПоСтрокамДокумента.ОстатокСтавок 
				+ ", необходимо ставок = " + ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок + " ) !", Отказ, Заголовок );
				//(завершение) добавлено Кухарчуком Д.Я.  26.06.19, Задача СВФР-003209, Аверсон-Софт 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// ГрафикРаботы
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы)  Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан рабочий график!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НетСотрудника ИЛИ (НЕ ЕстьДатаПриема) Тогда
		Возврат;
	КонецЕсли;
	
	
	// ДатаУвольнения
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаУвольнения) и ВыборкаПоСтрокамДокумента.ДатаПриема > ВыборкаПоСтрокамДокумента.ДатаУвольнения Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата приема не может превышать дату окончания работы!", Отказ, Заголовок);
	КонецЕсли;
	
	
	// Сотрудник указан дважды
	Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
		СтрокаСообщениеОбОшибке = "работник не может быть указан в документе дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник раньше работал в организации
	Если ВыборкаПоСтрокамДокумента.ОшибкаСотрудникРаботалВОрганизации Тогда
		СтрокаСообщениеОбОшибке = "Работник уже работал в организации, для повторного приема на работу необходимо создать нового сотрудника!"; 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОсновныеНачисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ, Заголовок);
	Иначе
		
		// Соответствие размера "основного" начисления штатному расписанию
		Если ПроверкаШтатногоРасписания и Не ВыборкаПоСтрокамДокумента.РазмерСоответствуетШТР И
			НЕ ВыборкаПоСтрокамДокумента.ТребуетВводаТарифногоРазряда Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "размер основного начисления не соответствует штатному расписанию!", Отказ, Заголовок);
		КонецЕсли;
		
		// Двойные строки
		Если ВыборкаПоСтрокамДокумента.ДвойнаяСтрока <> NULL Тогда
			Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
				СтрокаСообщениеОбОшибке = "работнику не может быть назначено основное начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
			Иначе
				СтрокаСообщениеОбОшибке = "работнику не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользуютсяНачисленияВВалюте = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ИспользуютсяНачисленияВВалюте");
	
	ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.Период = NULL Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ, Заголовок);
	КонецЕсли;
	
	
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет возможность оформления работника на работу согласно указанному в шапке документа реквизиту "ВидЗанятости"
//
Процедура ПроверитьВидыЗанятостиРаботникаВОрганизации(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса, Отказ, Заголовок)
	
	// обходим строки запроса
	Пока ВыборкаСтрокЗапроса.Следующий() Цикл
		
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаСтрокЗапроса.НомерСтроки) +
		""" табл. части ""Работники организации"": ";
		
		// Проверка сочетаний видов занятости работника в одной организации
		Если ВыборкаСтрокЗапроса.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы  Тогда
			
			// Для основного места работы недопустимо наличие внешнего совместительства
			Если ВыборкаСтрокЗапроса.ВидЗанятостиПоДругомуМестуРаботы = Перечисления.ВидыЗанятостиВОрганизации.Совместительство  Тогда
				СтрокаСообщениеОбОшибке = "нельзя принять работника на основное место работы до тех пор,
				|	пока он оформлен внешним совместителем!
				|	(См. приказ: " + ВыборкаСтрокЗапроса.КонфликтныйДокумент + ")"; 
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
			КонецЕсли;
			
		ИначеЕсли ВыборкаСтрокЗапроса.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство  Тогда
			
			// Для внешнего совместительства недопустимо основное место работы
			Если ВыборкаСтрокЗапроса.ВидЗанятостиПоДругомуМестуРаботы = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы  Тогда
				СтрокаСообщениеОбОшибке = "нельзя оформить работника на внешнее совместительство, 
				|	так как он уже оформлен в организации по основному месту работы! 
				|	(См. приказ: " + ВыборкаСтрокЗапроса.КонфликтныйДокумент + ")"; 
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
			КонецЕсли;
			
		ИначеЕсли ВыборкаСтрокЗапроса.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство  Тогда
			
			// При оформлении на внутреннее совместительство должно быть основное место работы или внешнее совместительство
			Если ВыборкаСтрокЗапроса.ВидЗанятостиПоДругомуМестуРаботы <> Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы И ВыборкаСтрокЗапроса.ВидЗанятостиПоДругомуМестуРаботы <> Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда
				СтрокаСообщениеОбОшибке = "нельзя оформить работника на внутреннее совместительство, 
				|	так как он не оформлен в организации или по основному месту работы или по внешнему совместительству!"; 
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьВидыЗанятостиРаботникаВОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, СтруктураПараметров = "")
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		ВедетсяНаборПерсонала	= СтруктураПараметров.ВедетсяНаборПерсонала И ВыборкаПоРаботникиОрганизации.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
	Иначе
		ВедетсяНаборПерсонала	= Ложь;
	КонецЕсли;
	
	Если ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "ДанныеДляДвижений" Тогда
		
		// Движения на дату приёма
		
		//Аверсон ЕАЕ 02.03.2022 СВФР-008809
		//проверяем существование записи с такими измерениями
		ДвиженияРаботникиОрганизаций = Движения.РаботникиОрганизаций;
		ТЗ = ДвиженияРаботникиОрганизаций.Выгрузить();
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник", ВыборкаПоРаботникиОрганизации.Сотрудник);
		СтруктураОтбора.Вставить("Организация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
		СтруктураОтбора.Вставить("Период", ВыборкаПоРаботникиОрганизации.ДатаПриема);
		Если ТЗ.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
			//Аверсон СВФР-008809
			
			// Движения по регистру "РаботникиОрганизации"
			Движение = Движения.РаботникиОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаПриема;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ТипРаботника				= ВыборкаПоРаботникиОрганизации.ТипРаботника;
			Если не Организация.ИНН = "806000046" Тогда 
				Движение.СотрудникЗаменяемый		= ВыборкаПоРаботникиОрганизации.СотрудникЗаменяемый;
			КонецЕсли;
			
			// Ресурсы
			Движение.ЗанимаемыхСтавок			= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок;
			Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
			Движение.ГрафикРаботы				= ВыборкаПоРаботникиОрганизации.ГрафикРаботы;
			
			//РБ
			Движение.Категория					= ВыборкаПоРаботникиОрганизации.Категория; 
			//Если НЕ ВыборкаПоРаботникиОрганизации.БезЕТС Тогда //О.Т. Аверсон 04.11.2015 № 679
			Движение.КоэффициентЕТС				= ВыборкаПоРаботникиОрганизации.КоэффициентЕТС; 
			Движение.РазрядЕТС					= ВыборкаПоРаботникиОрганизации.РазрядЕТС; 
			Движение.ИтоговоеПовышениеПоИнструкции		= ВыборкаПоРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции;
			Движение.ПовышенныйКоэффициентЕТС   = ВыборкаПоРаботникиОрганизации.ПовышенныйКоэффициентЕТС;
			Движение.ТарифнаяСтавкаПервогоРазряда = ВыборкаПоРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда;
			Движение.БезЕТС				= ВыборкаПоРаботникиОрганизации.БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
			//Иначе
			//	Движение.БезЕТС				= ВыборкаПоРаботникиОрганизации.БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
			//КонецЕсли;
			
			
			Движение.УсловияТрудаИзмерение		    = ВыборкаПоРаботникиОрганизации.УсловияТрудаИзмерение;
			Движение.ВидДеятельностиИзмерение		= ВыборкаПоРаботникиОрганизации.ВидДеятельностиИзмерение;
			////////////////////////////////////////////////////////////////////////////////////
			// Реквизиты
			Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу;
			Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.Организация;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= ВыборкаПоРаботникиОрганизации.ОкладВВалюте;
			Движение.ДляПечати      = ВыборкаПоРаботникиОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
			Движение.ауМестоРаботы = ВыборкаПоРаботникиОрганизации.ауМестоРаботы; //Аверсон 08.12.2021 КВВ СВФР-008463
			
			//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
			Если Организация.ИНН = "700103211" Тогда 
				Движение.ВременныйПереводКлимовичи = ВыборкаПоРаботникиОрганизации.ВременныйПереводКлимовичи;
			КонецЕсли;
			//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаУвольнения) Тогда
			Если ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении И (НЕ ВедетсяНаборПерсонала ИЛИ ВыборкаПоРаботникиОрганизации.ИспытательныйСрок = 0) Тогда
				Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
				// Свойства
				Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
				// Измерения
				Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
				Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
				Движение.ДатаИзменения				= ВыборкаПоРаботникиОрганизации.ДатаУвольнения;
				Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.Увольнение;
				// Ресурсы
				Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
				Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
				Движение.ЗанимаемыхСтавок			= 0;
				Движение.НеНапоминатьОСобытии		= ВыборкаПоРаботникиОрганизации.НеНапоминатьОСобытии;
			КонецЕсли;
			
			Если НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
				// Свойства
				Движение.ПериодЗавершения						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
				// Ресурсы
				Движение.ПодразделениеОрганизацииЗавершения		= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
				Движение.ДолжностьЗавершения					= ВыборкаПоРаботникиОрганизации.Должность;
				// Реквизиты
				Движение.ПричинаИзмененияСостоянияЗавершения	= Перечисления.ПричиныИзмененияСостояния.Увольнение;
				Движение.ОбособленноеПодразделениеЗавершения	= ВыборкаПоШапкеДокумента.Организация;
			КонецЕсли;
		КонецЕсли;
		
		//Если ВедетсяНаборПерсонала И ВыборкаПоРаботникиОрганизации.ИспытательныйСрок > 0 Тогда
		Если ВыборкаПоРаботникиОрганизации.ИспытательныйСрок > 0 Тогда
			Движение = Движения.СостояниеРаботниковНаИспытательномСроке.Добавить();
			// Свойства
			Движение.Период		= ВыборкаПоРаботникиОрганизации.ДатаПриема;
			// Измерения
			Движение.ФизЛицо	= ВыборкаПоРаботникиОрганизации.ФизЛицо;
			// Ресурсы
			Движение.Состояние	= Перечисления.СостоянияРаботникаНаИспытательномСроке.ПринятНаИспытательныйСрок;
			
			Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаУвольнения) Тогда
				Если ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
					Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
					// Свойства
					Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
					// Измерения
					Движение.Сотрудник					= ВыборкаПоРаботникиОрганизации.Сотрудник;
					Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
					Движение.ДатаИзменения				= ВыборкаПоРаботникиОрганизации.ИспытательныйСрокДо;
					Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока;
					// Реквизиты
					Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
					Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
					Движение.ЗанимаемыхСтавок			= 0;
					Движение.НеНапоминатьОСобытии		= ВыборкаПоРаботникиОрганизации.НеНапоминатьОСобытии;
					
				Иначе
					Движение = Движения.СостояниеРаботниковНаИспытательномСроке.Добавить();
					// Свойства
					Движение.Период		= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
					// Измерения
					Движение.ФизЛицо	= ВыборкаПоРаботникиОрганизации.ФизЛицо;
					// Ресурсы
					Движение.Состояние	= Перечисления.СостоянияРаботникаНаИспытательномСроке.НеПрошелИспытательныйСрок;
					
				КонецЕсли;
				
			Иначе
				Движение = Движения.СостояниеРаботниковНаИспытательномСроке.Добавить();
				// Свойства
				Движение.Период		= ДобавитьМесяц(ВыборкаПоРаботникиОрганизации.ДатаПриема, ВыборкаПоРаботникиОрганизации.ИспытательныйСрок) + мДлинаСуток;
				// Измерения
				Движение.ФизЛицо	= ВыборкаПоРаботникиОрганизации.ФизЛицо;
				// Ресурсы
				Движение.Состояние	= Перечисления.СостоянияРаботникаНаИспытательномСроке.ПринятНаРаботу;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВыборкаПоРаботникиОрганизации.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы Тогда
			
			//Аверсон ЕАЕ 02.03.2022 СВФР-008809
			//проверяем существование записи с такими измерениями
			ДвиженияПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы = Движения.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы;
			ТЗ = ДвиженияПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы.Выгрузить();
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ФизЛицо", ВыборкаПоРаботникиОрганизации.Физлицо);
			СтруктураОтбора.Вставить("Организация", Организация);
			СтруктураОтбора.Вставить("ДатаНачала", ВыборкаПоРаботникиОрганизации.ДатаПриема);
			Если ТЗ.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				//Аверсон СВФР-008809
				
				Движение = Движения.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы.Добавить();
				// Измерения
				Движение.Организация        = Организация;
				Движение.Физлицо			= ВыборкаПоРаботникиОрганизации.Физлицо;
				Движение.ДатаНачала			= ВыборкаПоРаботникиОрганизации.ДатаПриема;
				Если ВыборкаПоРаботникиОрганизации.ДатаУвольнения <> '0001-01-01' и НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
					Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ВыборкаПоРаботникиОрганизации.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство Тогда
			Движение = Движения.ПериодыРаботыРаботниковОрганизацийПоСовместительству.Добавить();
			// Измерения
			Движение.Физлицо			= ВыборкаПоРаботникиОрганизации.Физлицо;
			Движение.Организация		= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ДатаНачала			= ВыборкаПоРаботникиОрганизации.ДатаПриема;
			Если ВыборкаПоРаботникиОрганизации.ДатаУвольнения <> '0001-01-01' и НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
				Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
			КонецЕсли;
			
		КонецЕсли;
		
		//РБ
		
		//Аверсон ЕАЕ 02.03.2022 СВФР-008809
		//проверяем существование записи с такими измерениями
		ДвиженияТарифныеСтавкиРаботниковОрганизации = Движения.ТарифныеСтавкиРаботниковОрганизации;
		ТЗ = ДвиженияТарифныеСтавкиРаботниковОрганизации.Выгрузить();
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник", ВыборкаПоРаботникиОрганизации.Сотрудник);
		СтруктураОтбора.Вставить("Организация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
		СтруктураОтбора.Вставить("Период", ВыборкаПоРаботникиОрганизации.ДатаПриема);
		Если ТЗ.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
			//Аверсон СВФР-008809
			
			// Движения по регистру "ТарифныеСтавкиработниковОрганизации"
			Движение = Движения.ТарифныеСтавкиработниковОрганизации.Добавить();
			// Свойства
			Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаПриема;
			// Измерения
			Движение.Сотрудник                    = ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			
			// Ресурсы
			//Если НЕ ВыборкаПоРаботникиОрганизации.БезЕТС Тогда
			Движение.Ставка           				 = ВыборкаПоРаботникиОрганизации.МесячнаяТарифнаяСтавка;
			Движение.ПроцентПоКонтракту         	 = ВыборкаПоРаботникиОрганизации.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка  				 = ВыборкаПоРаботникиОрганизации.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = ВыборкаПоРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции;
			//Иначе
			//	Движение.ТарифнаяСтавка  				 = ВыборкаПоРаботникиОрганизации.ТарифнаяСтавка;
			//	Движение.Ставка         				 = ВыборкаПоРаботникиОрганизации.МесячнаяТарифнаяСтавка;
			//КонецЕсли;
			
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= ВыборкаПоРаботникиОрганизации.ОкладВВалюте;
			Движение.Валюта	= ВыборкаПоРаботникиОрганизации.Валюта;
			Движение.СуммаВВалюте	= ВыборкаПоРаботникиОрганизации.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= ВыборкаПоРаботникиОрганизации.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= ВыборкаПоРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= ВыборкаПоРаботникиОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
		КонецЕсли;
		
		//РБ
		// Движения по регистру "АвансыРаботниковОрганизаций"
		Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.Аванс)  тогда
			Движение = Движения.АвансыРаботникамОрганизаций.Добавить();
			// Свойства
			Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаПриема;
			// Измерения
			Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизации.ФизЛицо;
			Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Ресурсы
			Движение.СуммаАванса           = ВыборкаПоРаботникиОрганизации.Аванс;
		КонецЕсли;
		
		//РБ
		// Движения по регистру "ПлановыеУдержанияРаботниковОрганизаций"
		//  Если НЕ ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.НеИмеетПравоНаПенсию) ИЛИ НЕ ВыборкаПоРаботникиОрганизации.НеИмеетПравоНаПенсию тогда 
		//  	Если ВыборкаПоРаботникиОрганизации.ВидЗанятости <> Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство тогда	
		//  		Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
		//  		// Свойства
		//  		Движение.Период                     = ВыборкаПоРаботникиОрганизации.ДатаПриема;
		//  	
		//  		// Измерения
		//  		Движение.ФизЛицо                    = ВыборкаПоРаботникиОрганизации.ФизЛицо;
		//  		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		//  		Движение.ВидРасчета                 = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
		//  		Движение.Размер						= 1;
		//  				
		//  		// ресурсы
		//  		Движение.Действие				= Перечисления.ВидыДействияСНачислением.Начать; 
		//  				
		//  		// Движения на дату увольнения
		//  		Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаУвольнения) И НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
		//  			// Ресурсы завершения
		//  			Движение.ПериодЗавершения		= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
		//  			Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Прекратить;
		//  			//Движение.ВидРасчетаЗавершения	= ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
		//  		КонецЕсли;
		//  	КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса)
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	Движение.Организация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Если НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение = ВыборкаСтрокЗапроса.ВидРасчета;
	КонецЕсли;
	
	СтрокаПолей = "Период,Сотрудник,Действие,ВидРасчета,ПериодЗавершения,ДействиеЗавершения,ВидРасчетаЗавершения,Показатель1ВВалюте";
	
	Если ВыборкаСтрокЗапроса.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		
		Для Сч = 1 По 6 Цикл
			Если ВыборкаСтрокЗапроса.ПроизвольнаяФормулаРасчета Тогда
				Если Сч <= ВыборкаСтрокЗапроса.КоличествоПоказателей Тогда
					Если ВыборкаСтрокЗапроса["Показатель" + Сч + "ЗапрашиватьПриКадровыхПеремещениях"]
						Или ВыборкаСтрокЗапроса.ОсновноеНачисление И ВыборкаСтрокЗапроса["Показатель" + Сч + "ТарифнаяСтавка"] Тогда
						СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + ",Валюта"+ Сч + ",ТарифныйРазряд"+ Сч;
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + ",Валюта"+ Сч;
				Если ВыборкаСтрокЗапроса.ТребуетВводаТарифногоРазряда Тогда
					СтрокаПолей = СтрокаПолей + ",ТарифныйРазряд"+ Сч;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Движения на дату завершения
	Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) И ВыборкаСтрокЗапроса.ДействиеЗавершения <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		
		Для Сч = 1 По 6 Цикл
			Если ВыборкаСтрокЗапроса.ПроизвольнаяФормулаРасчета Тогда
				Если Сч <= ВыборкаСтрокЗапроса.КоличествоПоказателей Тогда
					Если ВыборкаСтрокЗапроса["Показатель" + Сч + "ЗапрашиватьПриКадровыхПеремещениях"]
						Или ВыборкаСтрокЗапроса.ОсновноеНачисление И ВыборкаСтрокЗапроса["Показатель" + Сч + "ТарифнаяСтавка"] Тогда
						СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + "Завершения,Валюта"+ Сч + "Завершения,ТарифныйРазряд"+ Сч + "Завершения";
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + "Завершения,Валюта"+ Сч + "Завершения,ТарифныйРазряд"+ Сч + "Завершения";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаСтрокЗапроса, СтрокаПолей);
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоНачислениям()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)
	
	Если ВыборкаПоРаботникиОрганизации.ВидСтрокиЗапроса = "ДанныеДляДвижений" Тогда
		
		// Движения на дату приема
		
		// ЗанятыеШтатныеЕдиницыОрганизаций";
		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоРаботникиОрганизации.ДатаПриема;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.ПодразделениеОрганизации		= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
		Движение.Должность						= ВыборкаПоРаботникиОрганизации.Должность;
		Движение.УсловияТрудаИзмерение		    = ВыборкаПоРаботникиОрганизации.УсловияТрудаИзмерение;
		Движение.ВидДеятельностиИзмерение		= ВыборкаПоРаботникиОрганизации.ВидДеятельностиИзмерение;
		
		// Ресурсы
		Движение.КоличествоСтавок				= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок; 
		
		// Движения на дату увольнения
		Если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ДатаУвольнения) И НЕ ВыборкаПоРаботникиОрганизации.НапомнитьПоЗавершении Тогда
			// ЗанятыеШтатныеЕдиницыОрганизаций";
			Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаУвольнения + мДлинаСуток;
			Движение.ВидДвижения				= ВидДвиженияНакопления.Расход;
			
			// Измерения
			Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
			Движение.УсловияТрудаИзмерение		= ВыборкаПоРаботникиОрганизации.УсловияТрудаИзмерение;
			Движение.ВидДеятельностиИзмерение	= ВыборкаПоРаботникиОрганизации.ВидДеятельностиИзмерение;
			
			// Ресурсы
			Движение.КоличествоСтавок			= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

Процедура ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам)
	
	Движение = Движения.КоэфПовышенияТО.Добавить();
	
	Движение.Период = ВыборкаПоКоэфициентам.ДатаПриема;
	Движение.Сотрудник = ВыборкаПоКоэфициентам.Сотрудник;
	Движение.Коэффициент = ВыборкаПоКоэфициентам.Коэффициент; 
	
	Движение.Размер = ВыборкаПоКоэфициентам.Размер;
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	//Движение.Действие = Перечисления.ВидыДействияСНачислением.Начать;
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	Движение.Действие = ВыборкаПоКоэфициентам.Действие;
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоПовышенияПоИнструкции(ВыборкаПоПовышениям)
	
	Движение = Движения.ПовышенияПоИнструкции.Добавить();
	
	Движение.Период = ВыборкаПоПовышениям.ДатаПриема;
	Движение.Сотрудник = ВыборкаПоПовышениям.Сотрудник;
	Движение.Коэффициент = ВыборкаПоПовышениям.Коэффициент; 
	
	Движение.Размер = ВыборкаПоПовышениям.Размер;
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	//Движение.Действие = Перечисления.ВидыДействияСНачислением.Начать;
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
	//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
	Движение.Действие = ВыборкаПоПовышениям.Действие;
	//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
Процедура ПроверитьЗаполнениеСтрокиПовышения( ВыборкаПоПовышениям, Отказ );
	Если СокрЛП( Организация.ИНН ) <> "806000046" Тогда
		Возврат;	
	КонецЕсли; 
	Если ВыборкаПоПовышениям.ЕстьОшибка Тогда
		СообщениеОбОшибке = НСтр( "ru='%ТекстОшибки'" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ТекстОшибки", ВыборкаПоПовышениям.ТекстОшибки );
		//+ СВЭЙ 22.03.19 КДЯ СВФР-003209 
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%НомерСтроки", ВыборкаПоПовышениям.НомерСтроки );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%Сотрудник", ВыборкаПоПовышениям.Сотрудник );
		//- СВЭЙ 22.03.19 КДЯ СВФР-003209 
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ПриемРазмер", "" + ВыборкаПоПовышениям.Размер + "%" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%ШтатРазмер", "" + ВыборкаПоПовышениям.ШтатРазмер + "%" );
		СообщениеОбОшибке = СтрЗаменить( СообщениеОбОшибке, "%Коэффициент", """" + СокрЛП( ВыборкаПоПовышениям.Коэффициент ) + """" );
		Сообщить( СообщениеОбОшибке, СтатусСообщения.Важное );
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры // ПроверитьЗаполнениеСтрокиПовышения
//- СВЭЙ 07.02.19 КДЯ СВФР-003209 

Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке(Режим).Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		// данные учетной политики
		УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
		ПроверкаШтатногоРасписания				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания");
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// получим соответствие для проверок
			СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
			
			// выполним выборку по табличной части документа
			ВыборкаСтрокЗапроса = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, ПроверкаШтатногоРасписания).Выбрать();
			
			ВедетсяНаборПерсонала = Константы.РежимНабораПерсонала.Получить() = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
			
			// для проверки числа ставок
			// обходим строки запроса, проверяем данные и формируем движения
			Пока ВыборкаСтрокЗапроса.Следующий() Цикл								
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса , Отказ, Заголовок,  ПроверкаШтатногоРасписания);
				Если НЕ Отказ Тогда 
					//Островская Татьяна 13.05.2014 № 17358; 223
					если ВыборкаСтрокЗапроса.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы Тогда 
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо
						|ИЗ
						|	РегистрСведений.НДФЛСтандартныеВычетыФизлиц.СрезПоследних(&Дата, Физлицо = &ФизЛицо) КАК НДФЛСтандартныеВычетыФизлицСрезПоследних";
						
						Запрос.УстановитьПараметр("ФизЛицо", ВыборкаСтрокЗапроса.ФизЛицо);
						Запрос.УстановитьПараметр("Дата", ВыборкаСтрокЗапроса.ДатаПриема);
						Результат = Запрос.Выполнить().Выгрузить();
						Если Результат.Количество() = 0 Тогда
							ДокументСтандартныеВычеты = Документы.НДФЛСтандартныеВычетыФизлиц.СоздатьДокумент();
							ДокументСтандартныеВычеты.Физлицо = ВыборкаСтрокЗапроса.ФизЛицо;
							ДокументСтандартныеВычеты.ПрименятьЛичныйВычет = Истина;
							ДокументСтандартныеВычеты.Дата = ВыборкаСтрокЗапроса.ДатаПриема;
							
							ДокументСтандартныеВычеты.Записать(РежимЗаписиДокумента.Запись);
							ДокументСтандартныеВычеты.ПерерасчетДокумента();
						КонецЕсли;
						
						если Организация.ИНН = "100765738" Тогда 
							// запись категории объектов
							мНаборКатегория = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
							ЗаписьНабора13 = мНаборКатегория.Добавить();
							ЗаписьНабора13.Объект	= ВыборкаСтрокЗапроса.Сотрудник;
							ЗаписьНабора13.Категория	= Справочники.КатегорииОбъектов.НайтиПоНаименованию("Табель");
							
							Если мНаборКатегория.Количество() > 0  Тогда
								мНаборКатегория[0].Объект = ВыборкаСтрокЗапроса.Сотрудник;
								мНаборКатегория.Отбор.Объект.Использование	= Истина;
								мНаборКатегория.Отбор.Объект.Значение			= мНаборКатегория[0].Объект;
								мНаборКатегория.Записать(Истина);
							КонецЕсли;
						КонецЕсли;
						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	НДФЛПрименениеВычетовСрезПоследних.Организация, //Аверсон 19.04.2023 КВВ СВФР-010722
						|	НДФЛПрименениеВычетовСрезПоследних.Физлицо
						|ИЗ
						|	РегистрСведений.НДФЛПрименениеВычетов.СрезПоследних(&Дата, Физлицо = &Физлицо) КАК НДФЛПрименениеВычетовСрезПоследних";
						
						Запрос.УстановитьПараметр("Дата", ВыборкаСтрокЗапроса.ДатаПриема);
						Запрос.УстановитьПараметр("Физлицо", ВыборкаСтрокЗапроса.Физлицо);
						
						Результат = Запрос.Выполнить().Выгрузить();
						Если Результат.Количество() = 0 
							ИЛИ (Результат.Количество() > 0 И НЕ ЗначениеЗаполнено(Результат[0].Организация)) Тогда //Аверсон 19.04.2023 КВВ СВФР-010722
							мНаборЗаписейНДФЛ = РегистрыСведений.НДФЛПрименениеВычетов.СоздатьНаборЗаписей();
							ЗаписьНабора = мНаборЗаписейНДФЛ.Добавить();
							ЗаписьНабора.Период		= ВыборкаСтрокЗапроса.ДатаПриема;
							ЗаписьНабора.Физлицо	= ВыборкаСтрокЗапроса.Физлицо;
							ЗаписьНабора.Организация= Организация;
							
							
							Если мНаборЗаписейНДФЛ.Количество() > 0 И ЗначениеЗаполнено(мНаборЗаписейНДФЛ[0].Период) Тогда
								мНаборЗаписейНДФЛ[0].Физлицо = ВыборкаСтрокЗапроса.Физлицо;
								мНаборЗаписейНДФЛ.Отбор.Физлицо.Использование	= Истина;
								мНаборЗаписейНДФЛ.Отбор.Физлицо.Значение			= мНаборЗаписейНДФЛ[0].Физлицо;
								мНаборЗаписейНДФЛ.Отбор.Период.Использование		= Истина;
								мНаборЗаписейНДФЛ.Отбор.Период.Значение			= мНаборЗаписейНДФЛ[0].Период;
								мНаборЗаписейНДФЛ.Записать(Истина);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 13.05.2014 № 17358; 223
					
					//Аверсон 02.07.2021 КВВ СВФР-007578 (
					ВноситьВРегНакопления = Истина;
					Если Организация.ИНН = "700067572" Тогда
						Если ВыборкаСтрокЗапроса.СдельнаяОплата Тогда //Ученик	//Аверсон 06.07.2021 КВВ СВФР-007578
							ВноситьВРегНакопления = Ложь;
						КонецЕсли;
					КонецЕсли;
					
					Если ВноситьВРегНакопления = Истина Тогда
						//Аверсон 02.07.2021 КВВ СВФР-007578 )
						ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);
					КонецЕсли;
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса, Новый Структура("ВедетсяНаборПерсонала", ВедетсяНаборПерсонала));
				КонецЕсли;
				
			КонецЦикла;
			
			//
			// проверим виды занятости работника в организации
			ВыборкаПоСтрокамДокумента = СформироватьЗапросПоПрежнимМестам(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				ПроверитьВидыЗанятостиРаботникаВОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента.Выбрать(), Отказ, Заголовок);
			КонецЦикла;
			
			// выполним выборку по табличной части основных начислений
			ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания).Выбрать();
			
			// обходим строки документа
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания);
				Если не Отказ Тогда
					ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				КонецЕсли;
				
			КонецЦикла;
			
			ВыборкаПоКоэфициентам = СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента).Выбрать();
			Пока ВыборкаПоКоэфициентам.Следующий() Цикл
				ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам);
			КонецЦикла;
			
			ВыборкаПоПовышениям =  СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента).Выбрать();
			Пока ВыборкаПоПовышениям.Следующий() Цикл
				//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
				ПроверитьЗаполнениеСтрокиПовышения( ВыборкаПоПовышениям, Отказ );
				Если не Отказ Тогда
					//- СВЭЙ 07.02.19 КДЯ СВФР-003209 
					ДобавитьСтрокуВДвиженияПоПовышенияПоИнструкции(ВыборкаПоПовышениям);
					//+ СВЭЙ 07.02.19 КДЯ СВФР-003209 
				КонецЕсли;
				//- СВЭЙ 07.02.19 КДЯ СВФР-003209 
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Аверсон 17.05.2019 КВВ СВФР-004351 (
	Если НЕ Отказ Тогда            
		ТЧНачислений = ОсновныеНачисления;
		Для Каждого СтрокаТЧ Из РаботникиОрганизации Цикл
			НайденыеСтроки = ТЧНачислений.НайтиСтроки(Новый Структура("Сотрудник,ВидРасчета", СтрокаТЧ.Сотрудник,СтрокаТЧ.ВидРасчета));
			Если НайденыеСтроки.Количество() = 0 Тогда 
				СообщениеОбОшибке = НСтр("ru='Для сотрудника %Сотрудник% на закладке ""Начисления"" нет строки с указанием вида расчета ""%ВидРасчета%""!'");
				СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%Сотрудник%", ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(СтрокаТЧ.Сотрудник.Физлицо));
				СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%ВидРасчета%",СтрокаТЧ.ВидРасчета);
				Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
				Отказ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон 17.05.2019 КВВ СВФР-004351 )
	
	//Аверсон 28.02.2019 КВВ СВФР-004035 (
	Если Организация.ИНН = "806000046" Тогда
		СтрахАгенты = Справочники.КатегорииРаботников.НайтиПоНаименованию("Страховые агенты");
		
		//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) (
		мСкрытыеГруппыЗадач = Неопределено;
		#Если Клиент Тогда
			мСкрытыеГруппыЗадач = ВосстановитьЗначение("мСкрытыеГруппыЗадач");
		#КонецЕсли
		Если мСкрытыеГруппыЗадач = Неопределено Тогда
			мСкрытыеГруппыЗадач = Новый Соответствие;
			ГруппаЗадач = Перечисления.ГруппыЗадачПользователя[Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПУ2Прием)];				
			мСкрытыеГруппыЗадач.Вставить(ГруппаЗадач, Истина);
		КонецЕсли;
		ВыводитьСообщениеПоПУ2 = мСкрытыеГруппыЗадач.Получить(Перечисления.ГруппыЗадачПользователя[Перечисления.ГруппыЗадачПользователя.Индекс(Перечисления.ГруппыЗадачПользователя.ПУ2Прием)]) <> Истина;
		//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) )
		
		Для Каждого СтрокаТЧ Из РаботникиОрганизации Цикл
			
			//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) (
			Если ВыводитьСообщениеПоПУ2 Тогда
				Сообщить("Необходимо подать Сведения о движении работников ПУ-2 до " + Формат(КонецДня(СтрокаТЧ.ДатаПриема) + 4*86400,"ДФ='дд.ММ.гггг'") + " включительно по сотруднику " + СокрЛП(СтрокаТЧ.Сотрудник.Наименование));
			КонецЕсли;
			//Аверсон 19.07.2022 КВВ СВФР-009298 (пункт 4) )
			
			Если СтрокаТЧ.Должность.Категория <> СтрахАгенты Тогда
				Продолжить;
			КонецЕсли;
			СпрСотр = Справочники.СотрудникиОрганизаций.НайтиПоКоду(СтрокаТЧ.Сотрудник.Код).ПолучитьОбъект();
			СпрСотр.СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду("70.02");
			Попытка
				СпрСотр.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки
		КонецЦикла;
	КонецЕсли;
	//Аверсон 28.02.2019 КВВ СВФР-004035 )
	
	//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 2) (
	ЕстьПостСовм = Ложь;    //Аверсон 17.06.2022 КВВ СВФР-009132
	Если СокрЛП(Организация.ИНН) = "700067572" Тогда
		Для Каждого СтрокаТЧ Из РаботникиОрганизации Цикл
			
			//Аверсон 17.06.2022 КВВ СВФР-009132 (
			Если ((СтрокаТЧ.ТипРаботника = Перечисления.ТипыРаботников.Постоянный) ИЛИ (СтрокаТЧ.ТипРаботника = Перечисления.ТипыРаботников.Совместитель))
				И НачалоДня(СтрокаТЧ.ДатаПриема) >= Дата(2022,06,20,00,00,00) Тогда
				ЕстьПостСовм = Истина;
			КонецЕсли;
			//Аверсон 17.06.2022 КВВ СВФР-009132 )
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Основание) Тогда
				СпрСотр = Справочники.СотрудникиОрганизаций.НайтиПоКоду(СтрокаТЧ.Сотрудник.Код).ПолучитьОбъект();
				СпрСотр.ТрудовойДоговор = СтрокаТЧ.Основание;
				Попытка
					СпрСотр.Записать();
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон 28.02.2022 КВВ СВФР-008797 (пункт 2) )
	
	//Аверсон 17.06.2022 КВВ СВФР-009132 (
	Если ЕстьПостСовм Тогда
		ЗапросОсн = Новый Запрос;
		ЗапросОсн.Текст = "
		|ВЫБРАТЬ
		|Док.ДокументОснование,
		|Док.Ссылка КАК ДокСсылка
		|ИЗ Документ.ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций КАК Док
		|ГДЕ Док.ДокументОснование = &ТекДок";
		ЗапросОсн.УстановитьПараметр("ТекДок",Ссылка);
		РезЗ = ЗапросОсн.Выполнить().Выгрузить();
		Если РезЗ.Количество() > 0 Тогда
			НовДокументУдСсылка = РезЗ[0].ДокСсылка;				
			НовДокументУд = НовДокументУдСсылка.ПолучитьОбъект();
			Попытка
				НовДокументУд.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки
		Иначе
			НовДокументУд = Документы.ВводСведенийОПлановыхУдержанияхРаботниковОрганизаций.СоздатьДокумент();
		КонецЕсли;
		НовДокументУд.Дата = Дата;
		НовДокументУд.Ответственный = Ответственный;
		НовДокументУд.Заполнить(Ссылка); 
		Попытка
			НовДокументУд.Записать(РежимЗаписиДокумента.Проведение);   
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки
	КонецЕсли;
	//Аверсон 17.06.2022 КВВ СВФР-009132 )
	Для Каждого СтрокаТЧ Из РаботникиОрганизации Цикл
		Если СтрокаТЧ.НапомнитьПоЗавершении и ЗначениеЗаполнено(Ответственный) Тогда
			Текст = "Окончание испытательного срока " + СтрокаТЧ.Сотрудник;
			МенеджерЗаписи = РегистрыСведений.ТекущиеЗадачиПользователей.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Пользователь = Ответственный;
			МенеджерЗаписи.Задача = Текст;
			МенеджерЗаписи.Период = СтрокаТЧ.ИспытательныйСрокДо;
			
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.Проведен Тогда
			
			ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
			УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
			
			Если Организация.Пустая() Тогда
				Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация")
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Организация",			Организация);
			Запрос.УстановитьПараметр("Регистратор",			Основание);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриемНаРаботуРаботники.Сотрудник,
			|	ПриемНаРаботуРаботники.Сотрудник.Физлицо КАК ФизЛицо,
			|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации,
			|	ПриемНаРаботуРаботники.Должность КАК Должность,
			|	ПриемНаРаботуРаботники.ЗанимаемыхСтавок,
			|	ПриемНаРаботуРаботники.ДатаПриема,
			|	ВЫБОР
			|		КОГДА ПриемНаРаботуРаботники.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПриемНаРаботуРаботники.НапомнитьПоЗавершении
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК НапомнитьПоЗавершении,
			|	ВЫБОР
			|		КОГДА ПриемНаРаботуРаботники.ИспытательныйСрок = ЗНАЧЕНИЕ(Перечисление.ИспытательныйСрок.СИспытательнымСроком)
			|			ТОГДА РАЗНОСТЬДАТ(ПриемНаРаботуРаботники.ДатаПриема, ПриемНаРаботуРаботники.ДатаУвольнения, МЕСЯЦ)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИспытательныйСрок,
			|	ПриемНаРаботуРаботники.ДатаУвольнения,
			|	ПриемНаРаботуРаботники.ГрафикРаботы
			|ИЗ
			|	Документ.ПриемНаРаботу.Работники КАК ПриемНаРаботуРаботники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			|		ПО (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
			|			И ПриемНаРаботуРаботники.Подразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
			|ГДЕ
			|	ПриемНаРаботуРаботники.Ссылка = &Регистратор";
			
			РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("Структура") Тогда
		//Была ошибка на Документ
		
		//Организация = Основание.Организация;
		//
		//// Заполним реквизиты из стандартного набора.
		//ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание.Документ);
		//
		//РаботникиОрганизации.Загрузить(Основание.РаботникиОрганизации.Выгрузить());
		
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",	Основание);
		
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизаций.Организация
		|		ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|	КОНЕЦ КАК Организация,
		|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
		|	СотрудникиОрганизаций.Физлицо КАК Физлицо,
		|	СотрудникиОрганизаций.Должность,
		|	СотрудникиОрганизаций.ПодразделениеОрганизации,
		|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|	СотрудникиОрганизаций.ДатаНачала КАК ДатаПриема,
		|	СотрудникиОрганизаций.ДатаОкончания КАК ДатаУвольнения,
		|	СотрудникиОрганизаций.ИспытательныйСрок,
		|	СотрудникиОрганизаций.ГрафикРаботы,
		|	СотрудникиОрганизаций.ВидРасчета КАК ВидРасчета,
		|	СотрудникиОрганизаций.ТарифнаяСтавка КАК Показатель1,
		|	NULL КАК Показатель2,
		|	NULL КАК Показатель3,
		|	NULL КАК Показатель4,
		|	СотрудникиОрганизаций.ВалютаТарифнойСтавки КАК Валюта1,
		|	NULL КАК Валюта2,
		|	NULL КАК Валюта3,
		|	NULL КАК Валюта4,
		|	СотрудникиОрганизаций.ТарифныйРазряд КАК ТарифныйРазряд1,
		|	NULL КАК ТарифныйРазряд2,
		|	NULL КАК ТарифныйРазряд3,
		|	NULL КАК ТарифныйРазряд4,
		|	СотрудникиОрганизаций.РасчетнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|	СотрудникиОрганизаций.РазрядЕТС,
		|	СотрудникиОрганизаций.КоэффициентЕТС,
		|	СотрудникиОрганизаций.ПроцентПовышения КАК ПроцентПоКонтракту,
		|	СотрудникиОрганизаций.Должность.Категория КАК Категория,
		|	СотрудникиОрганизаций.ТарифныйСПовышениемПоИнструкции,
		|	СотрудникиОрганизаций.ИтоговоеПовышениеПоИнструкции,
		|	СотрудникиОрганизаций.ТарифнаяСтавка,
		|	СотрудникиОрганизаций.РазмерСтавки1Разряда,
		|	СотрудникиОрганизаций.ПовышенныйКоэффициентЕТС,
		|	СотрудникиОрганизаций.РазмерСтавки1Разряда КАК РазмерСтавки1Разряда1,
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НапомнитьПоЗавершении,
		|	СотрудникиОрганизаций.ТарифнаяСтавкаПервогоРазряда,
		|	СотрудникиОрганизаций.УсловияТрудаИзмерение,
		|	СотрудникиОрганизаций.ВидДеятельностиИзмерение,
		|	СотрудникиОрганизаций.БезЕТС //О.Т. Аверсон 04.11.2015 № 679
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Организация
		|		ИНАЧЕ СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение
		|	КОНЕЦ,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Должность,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ПодразделениеОрганизации,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ЗанимаемыхСтавок,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаНачала,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаОкончания,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ИспытательныйСрок,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ГрафикРаботы,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта4,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд1,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд2,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд3,
		|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд4,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
		|ГДЕ
		|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка = &Ссылка
		|	И СотрудникиОрганизацийПерсональныеНадбавки.Надбавка <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА СотрудникиОрганизаций.Организация
		|		ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|	КОНЕЦ,
		|	СотрудникиОрганизаций.Ссылка,
		|	СотрудникиОрганизаций.Физлицо,
		|	СотрудникиОрганизаций.Должность,
		|	СотрудникиОрганизаций.ПодразделениеОрганизации,
		|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
		|	СотрудникиОрганизаций.ДатаНачала,
		|	СотрудникиОрганизаций.ДатаОкончания,
		|	СотрудникиОрганизаций.ИспытательныйСрок,
		|	СотрудникиОрганизаций.ГрафикРаботы,
		|	СхемыМотивацииРаботников.ВидРасчета,
		|	СхемыМотивацииРаботников.Показатель1,
		|	СхемыМотивацииРаботников.Показатель2,
		|	СхемыМотивацииРаботников.Показатель3,
		|	СхемыМотивацииРаботников.Показатель4,
		|	СхемыМотивацииРаботников.Валюта1,
		|	СхемыМотивацииРаботников.Валюта2,
		|	СхемыМотивацииРаботников.Валюта3,
		|	СхемыМотивацииРаботников.Валюта4,
		|	СхемыМотивацииРаботников.ТарифныйРазряд1,
		|	СхемыМотивацииРаботников.ТарифныйРазряд2,
		|	СхемыМотивацииРаботников.ТарифныйРазряд3,
		|	СхемыМотивацииРаботников.ТарифныйРазряд4,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
		|		ПО (СхемыМотивацииРаботников.Организация = ВЫБОР
		|				КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА СотрудникиОрганизаций.Организация
		|				ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА СхемыМотивацииРаботников.Должность <> ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
		|						И СхемыМотивацииРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|					ТОГДА СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
		|							И СхемыМотивацииРаботников.Подразделение = СотрудникиОрганизаций.ПодразделениеОрганизации
		|				ИНАЧЕ СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
		|			КОНЕЦ)
		|ГДЕ
		|	СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|	И СхемыМотивацииРаботников.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
		|	И СотрудникиОрганизаций.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЗапросКоэфПовышения = Новый Запрос;
		ЗапросКоэфПовышения.УстановитьПараметр("Ссылка", Основание);
		
		ЗапросКоэфПовышения.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизацийКоэфПовышенияТО.Ссылка КАК Сотрудник,
		|	СотрудникиОрганизацийКоэфПовышенияТО.Коэффициент,
		|	СотрудникиОрганизацийКоэфПовышенияТО.Размер
		|ИЗ
		|	Справочник.СотрудникиОрганизаций.КоэфПовышенияТО КАК СотрудникиОрганизацийКоэфПовышенияТО
		|ГДЕ
		|	 СотрудникиОрганизацийКоэфПовышенияТО.Ссылка = &Ссылка";
		
		ЗапросПовышения = Новый Запрос;
		ЗапросПовышения.УстановитьПараметр("Ссылка", Основание);
		
		ЗапросПовышения.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка КАК Сотрудник,
		|	СотрудникиОрганизацийПовышенияПоИнструкции.Коэффициент,
		|	СотрудникиОрганизацийПовышенияПоИнструкции.Размер
		|ИЗ
		|	Справочник.СотрудникиОрганизаций.ПовышенияПоИнструкции КАК СотрудникиОрганизацийПовышенияПоИнструкции
		|ГДЕ
		|	СотрудникиОрганизацийПовышенияПоИнструкции.Ссылка = &Ссылка";;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ВыборкаКоэф = ЗапросКоэфПовышения.Выполнить().Выбрать();
		ВыборкаПовышения = ЗапросПовышения.Выполнить().Выбрать();
		
		Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Организация");
			ЗаполнитьЗначенияСвойств(РаботникиОрганизации.Добавить(), Выборка);
			
			Пока Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВидРасчета) Цикл
				ЗаполнитьЗначенияСвойств(ОсновныеНачисления.Добавить(), Выборка);
			КонецЦикла;
			
		КонецЦикла;
		
		Пока ВыборкаКоэф.Следующий() цикл
			ЗаполнитьЗначенияСвойств(КоэфПовышенияТО.Добавить(), ВыборкаКоэф);
		КонецЦикла;	
		
		Пока ВыборкаПовышения.Следующий() цикл
			ЗаполнитьЗначенияСвойств(ПовышенияПоИнструкции.Добавить(),ВыборкаПовышения);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	// получить новый номер документа по совокупности кадровых документов
	ПроцедурыУправленияПерсоналом.ПриУстановкеНовогоНомераКадровогоДокумента(СтандартнаяОбработка, ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Префикс, Дата);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Организация) И Организация.ИНН = "700103211" Тогда
		КраткийСоставДокДатаПр = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаПриема");
		КраткийСоставДокДолжность = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"Должность");
		КраткийСоставДокЗамещСотр = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"СотрудникЗаменяемый");
	КонецЕсли;
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 )
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.КадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период		= Дата;
		ЗаписьРегистрации.Регистратор	= Ссылка;
	КонецЕсли;
	
	Движения.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы.РежимЗаписиРегистратора = РежимЗаписи;
	Движения.ПериодыРаботыРаботниковОрганизацийПоСовместительству.РежимЗаписиРегистратора = РежимЗаписи;
	
	//толик
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если РольДоступна("ОК")	Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.ПользовательООТиЗ) Тогда
				Если не Организация.ИНН = "806000046" Тогда
					Сообщить("Проведение невозможно! Документ проверен пользователем "+Строка(ЭтотОбъект.ПользовательООТиЗ));				
					Отказ = Истина;
				КонецЕсли;
			Иначе
				ЭтотОбъект.ПользовательОК = ИмяПользователя();
			КонецЕсли;
		КонецЕсли;
		Если РольДоступна("ОТиЗ")	Тогда
			ЭтотОбъект.ПользовательООТиЗ = ИмяПользователя();
		КонецЕсли;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если РольДоступна("ОК")	Тогда
			ЭтотОбъект.ПользовательОК = "";
		КонецЕсли;
		Если РольДоступна("ОТиЗ")	Тогда
			ЭтотОбъект.ПользовательООТиЗ = "";
		КонецЕсли;
	КонецЕсли;
	//енд
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверим уникальность номера с точки зрения кадровой нумерации
	ПроцедурыУправленияПерсоналом.ПроверкаУникальностиНомераКадровогоДокумента(ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Дата, Ссылка);
	
КонецПроцедуры // ПриЗаписи()

///////////////////////////////////////////////////
//толик добавил процедуры перерасчета для проведения с других модулей

Процедура ПерерасчетДокумента() Экспорт
	Для Каждого мСтрока Из РаботникиОрганизации Цикл
		ПерерасчетТарифнойСтавкиСДругихМодулей(мСтрока);
	КонецЦикла;
Конецпроцедуры

Процедура ПерерасчетТарифнойСтавкиСДругихМодулей(ТекущаяСтрока,ЗанимСтавок="",НеМенятьПовышениеЕТСИнстр = Ложь) Экспорт
	
	Если не НеПересчитыватьТЧ Тогда 
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаПриема) Тогда
			// №14564 11.01.2012 , Дыма 
			Если ТекущаяСтрока.БезЕТС или (не ТекущаяСтрока.БезЕТС и Организация.НеУчитыватьЕТКС) Тогда //О.Т. Аверсон 04.11.2015 № 679
				
				//Аверсон ЕАЕ 28.02.2025 СВФР-014856
				УчетнаяПолитикаЗапрос = Новый Запрос; 
				УчетнаяПолитикаЗапрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения,
				|   УчетнаяПолитикаПоПерсоналуОрганизаций.ПроверкаШтатногоРасписания
				|ИЗ
				|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				|ГДЕ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				если УчетнаяПолитика.Количество()>0 Тогда 
					ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					ФлПроверкаШтатногоРасписания = УчетнаяПолитика[0].ПроверкаШтатногоРасписания;
				иначе
					ФлОкладПоКаждомуВиду = Ложь;
					ФлПроверкаШтатногоРасписания = Ложь;
				КонецЕсли; 
				//Аверсон СВФР-014856
				
				//О.Т. Аверсон 04.11.2015 № 679
				ТекущаяСтрока.КоэффициентЕТС = 0;
				ТекущаяСтрока.РазрядЕТС = "";
				ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 0;
				ТекущаяСтрока.РазмерСтавки1Разряда = 0;
				ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда = Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка();
				ТаблицаКоэфициентов = КоэфПовышенияТО;
				НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
					ТаблицаКоэфициентов.Удалить(СтрокаКоэффициентов);		
				КонецЦикла;
				//О.Т. Аверсон 04.11.2015 № 679
				
				// №14787 25.01.2012 , Дыма 
				Если ЗанимСтавок = "" Тогда
					//Аверсон-софт, Островская Татьяна 23.10.2012 № 15945,17312
					//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
					
					//Аверсон ЕАЕ 13.02.2025 СВФР-014856
					//Тариф		  = ОбщегоНазначения.ОкруглитьРезультат( Окр(ТекущаяСтрока.ТарифнаяСтавка * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					Если ФлПроверкаШтатногоРасписания Тогда
						Тариф		  = ОбщегоНазначения.ОкруглитьРезультат( Окр(ТекущаяСтрока.ТарифЗаОднуСтавку * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); 
					Иначе
						Тариф		  = ОбщегоНазначения.ОкруглитьРезультат( Окр(ТекущаяСтрока.ТарифнаяСтавка * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					КонецЕсли;
					//Аверсон СВФР-014856
					
					ТарифВВалюте  = ОбщегоНазначения.ОкруглитьРезультат( 
					//+ СВЭЙ КДЯ 22.01.20 СВФР-005393
					//ТекущаяСтрока.СуммаВВалюте * ТекущаяСтрока.ЗанимаемыхСтавок
					//- СВЭЙ КДЯ 22.01.20 СВФР-005393
					//+ СВЭЙ КДЯ 22.01.20 СВФР-005393
					ТекущаяСтрока.ОкладСПовышениемВВалюте 
					//- СВЭЙ КДЯ 22.01.20 СВФР-005393
					, Константы.ОкруглениеШтатноеРасписание.Получить() ); //О.Т. Аверсон 12.04.2016 № 1041
					
					//Аверсон ЕАЕ 13.02.2025 СВФР-014856
					//ТарифБезСтавки  = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка,2), Константы.ОкруглениеШтатноеРасписание.Получить());
					Если ФлПроверкаШтатногоРасписания Тогда
						ТарифБезСтавки  = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифЗаОднуСтавку,2), Константы.ОкруглениеШтатноеРасписание.Получить());
					Иначе
						ТарифБезСтавки  = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка,2), Константы.ОкруглениеШтатноеРасписание.Получить());
					КонецЕсли;
					//Аверсон СВФР-014856
					
					ЗанимаемаяСтавка = ТекущаяСтрока.ЗанимаемыхСтавок;
				Иначе
					//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
					
					//Аверсон ЕАЕ 13.02.2025 СВФР-014856
					//Тариф = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка * ЗанимСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					//Тариф = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифЗаОднуСтавку * ЗанимСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					Если ФлПроверкаШтатногоРасписания Тогда
						Тариф = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифЗаОднуСтавку * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					Иначе
						Тариф = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка * ЗанимСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Округление в 2 знака жестко
					КонецЕсли;
					//Аверсон СВФР-014856
					
					ТарифВВалюте = ОбщегоНазначения.ОкруглитьРезультат(
					//+ СВЭЙ КДЯ 22.01.20 СВФР-005393
					//ТекущаяСтрока.СуммаВВалюте 
					//- СВЭЙ КДЯ 22.01.20 СВФР-005393
					//+ СВЭЙ КДЯ 22.01.20 СВФР-005393
					ТекущаяСтрока.ОкладСПовышениемВВалюте 
					//- СВЭЙ КДЯ 22.01.20 СВФР-005393
					* ЗанимСтавок, Константы.ОкруглениеШтатноеРасписание.Получить() ); //О.Т. Аверсон 12.04.2016 № 1041
					//Аверсон-софт, Островская Татьяна 23.10.2012 № 15945,17312
					
					//Аверсон ЕАЕ 13.02.2025 СВФР-014856
					//ТарифБезСтавки = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка,2), Константы.ОкруглениеШтатноеРасписание.Получить()); 
					Если ФлПроверкаШтатногоРасписания Тогда
						ТарифБезСтавки = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифЗаОднуСтавку,2), Константы.ОкруглениеШтатноеРасписание.Получить());
						ЗанимаемаяСтавка = ТекущаяСтрока.ЗанимаемыхСтавок;
					Иначе
						ТарифБезСтавки = ОбщегоНазначения.ОкруглитьРезультат(Окр(ТекущаяСтрока.ТарифнаяСтавка,2), Константы.ОкруглениеШтатноеРасписание.Получить());
						ЗанимаемаяСтавка = ЗанимСтавок;
					КонецЕсли;
					
					//Аверсон СВФР-014856
					
					//Аверсон ЕАЕ 13.02.2025 СВФР-014856
					//ЗанимаемаяСтавка = ЗанимСтавок;
					//ЗанимаемаяСтавка = ТекущаяСтрока.ЗанимаемыхСтавок;
					//Аверсон СВФР-014856
				КонецЕсли;
				// №14787 25.01.12 , Дыма кон 
				ТекущаяСтрока.ТарифнаяСтавка = Тариф;
				ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
				//О.Т. Аверсон 14.04.2016 № 1041
				Если не ЗначениеЗаполнено(ТекущаяСтрока.ОкладСПовышениемВВалюте) Тогда 
					ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
				КонецЕсли;
				//О.Т. Аверсон 14.04.2016 № 1041
				
				ТаблицаПроцентов = ПовышенияПоИнструкции;
				НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				ТарифПоИнструкции = 0;
				если не НеМенятьПовышениеЕТСИнстр Тогда
					ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
					
					мДоПовышения = 0;
					Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
						мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
						ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
						ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ЗанимаемаяСтавка *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
					КонецЦикла;
				КонецЕсли;
				
				//О.Т. Аверсон 22.09.2016 № 1459
				
				//Аверсон ЕАЕ 28.02.2025 СВФР-014856
				//Перенесено выше
				//УчетнаяПолитикаЗапрос = Новый Запрос; 
				//УчетнаяПолитикаЗапрос.Текст = 
				//"ВЫБРАТЬ
				//|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
				//|ИЗ
				//|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				//|ГДЕ
				//|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				//УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				//УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				//если УчетнаяПолитика.Количество()>0 Тогда 
				//	ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
				//иначе
				//	ФлОкладПоКаждомуВиду = Ложь;
				//КонецЕсли; 
				//Аверсон СВФР-014856
				
				//О.Т. Аверсон 22.09.2016 № 1459
				
				если НеМенятьПовышениеЕТСИнстр Тогда
					ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
				ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
					ТарифПоИнструкции = ТарифБезСтавки * ЗанимаемаяСтавка + ТарифБезСтавки* ЗанимаемаяСтавка *мДоПовышения/100;
				ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
					ТарифПоИнструкции = ТарифБезСтавки * ЗанимаемаяСтавка + ТарифПоИнструкции;
				КонецЕсли;
				ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифПоИнструкции,Дата);
				Если ЗанимаемаяСтавка < 1 Тогда 
					ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 06.06.2017 № 695
				иначе
					ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())*ЗанимаемаяСтавка), Константы.ВалютаРегламентированногоУчета.Получить());
				КонецЕсли;
				//О.Т. Аверсон 12.04.2016 № 1041
				Если ТекущаяСтрока.ОкладВВалюте Тогда 
					ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
				КонецЕсли;
				//О.Т. Аверсон 12.04.2016 № 1041
			Иначе
				//Аверсон 20.04.2021 КВВ СВФР-007469 ( перенесено в начало ветки
				//О.Т. Аверсон 22.09.2016 № 1459
				УчетнаяПолитикаЗапрос = Новый Запрос; 
				УчетнаяПолитикаЗапрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
				|ИЗ
				|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				|ГДЕ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				если УчетнаяПолитика.Количество()>0 Тогда 
					ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
				иначе
					ФлОкладПоКаждомуВиду = Ложь;
				КонецЕсли; 
				//О.Т. Аверсон 22.09.2016 № 1459
				//Аверсон 20.04.2021 КВВ СВФР-007469 ) перенесено в начало ветки
				
				
				//Аверсон 20.04.2021 КВВ СВФР-007469 (
				ОкруглениеШтат = Константы.ОкруглениеШтатноеРасписание.Получить();  
				ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить(); 
				//Аверсон 20.04.2021 КВВ СВФР-007469 )
				
				ТекущаяСтрока.РазмерСтавки1Разряда = ПолучитьРазмерТарифнойСтавки(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда, ТекущаяСтрока.ДатаПриема);
				
				Если ТекущаяСтрока.РазмерСтавки1Разряда <> 0 тогда
					
					ТаблицаКоэфициентов = КоэфПовышенияТО;
					НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник", ТекущаяСтрока.Сотрудник));
					ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 1;
					
					Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
						//Если Организация.ИНН = "100074549" //Тогда О.Т. Аверсон 15.01.2016  //О.Т. Аверсон 24.03.2016 № 984 (убрала условие)
						ТекущаяСтрока.ПовышенныйКоэффициентЕТС = ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер;	
						//иначе
						//	ТекущаяСтрока.ПовышенныйКоэффициентЕТС = Окр(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер,2);//О.Т. 07.05.2015 при переносе
						//КонецЕсли;
					КонецЦикла;
					Если Организация.ИНН = "100074549" Тогда 
						Коэффициент = Окр(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*ТекущаяСтрока.КоэффициентЕТС,2);
						КоэффициентДляТС = Окр(ТекущаяСтрока.КоэффициентЕТС,2);
					иначе
						Коэффициент = ТекущаяСтрока.ПовышенныйКоэффициентЕТС*ТекущаяСтрока.КоэффициентЕТС;
						КоэффициентДляТС = ТекущаяСтрока.КоэффициентЕТС;
					КонецЕсли;
					
					СтавкаПервого = ТекущаяСтрока.РазмерСтавки1Разряда;
					//заявка №1787 (база заявок Кристалла) Дмитрук О.Г.
					//Тариф		  = Коэффициент * СтавкаПервого;
					//Аверсон-софт, Островская Татьяна 23.10.2012 № 15945
					
					//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку 
					Тариф		  = ОбщегоНазначения.ОкруглитьРезультат(Окр(Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить()); //Островская Татьяна 25.04.2014 № 17312 //Округление в 2 знака жестко
					ТарифДляТС	  = ОбщегоНазначения.ОкруглитьРезультат(Окр(КоэффициентДляТС * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок,2), Константы.ОкруглениеШтатноеРасписание.Получить());
					//Аверсон-софт, Островская Татьяна 23.10.2012 № 15945
					//заявка №1787 
					ТарифВВалюте  = ОбщегоНазначения.ОкруглитьРезультат(ТекущаяСтрока.СуммаВВалюте* ТекущаяСтрока.ЗанимаемыхСтавок, Константы.ОкруглениеШтатноеРасписание.Получить()); //О.Т. Аверсон 12.04.2016 № 1041
					
					ТарифБезСтавки= ОбщегоНазначения.ОкруглитьРезультат(Окр(Коэффициент * СтавкаПервого,2), Константы.ОкруглениеШтатноеРасписание.Получить());
					
					//Аверсон 20.04.2021 КВВ СВФР-007469 (
					ТарифДробныхСтавок = 0;
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
						ТарифДробныхСтавок  = ОбщегоНазначения.ОкруглитьИнтегрированно(Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок, ОкруглениеШтат, ВалютаРегл, Дата);
					КонецЕсли;
					//Аверсон 20.04.2021 КВВ СВФР-007469 )
					
					ТекущаяСтрока.ТарифнаяСтавка = ТарифДляТС;
					ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
					//О.Т. Аверсон 14.04.2016 № 1041
					Если не ЗначениеЗаполнено(ТекущаяСтрока.ОкладСПовышениемВВалюте) Тогда 
						ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
					КонецЕсли;
					//О.Т. Аверсон 14.04.2016 № 1041
					
					ТаблицаПроцентов = ПовышенияПоИнструкции;
					НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
					если не НеМенятьПовышениеЕТСИнстр Тогда
						ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
						//расчет до 01.09.2009
						//Если ТекущаяСтрока.ДатаПриема < '20090901000000' Тогда
						//	мПослеПовышения = 0;
						//	мДоПовышения = 0;
						//	Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
						//		Если СтрокаПроцентов.Коэффициент.Последующий Тогда
						//			мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
						//		Иначе
						//			мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
						//		КонецЕсли;
						//		ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
						//	КонецЦикла;
						//			
						//	ТарифПоИнструкции = Тариф + Тариф*мДоПовышения/100;
						//	ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
						//	ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
						//	ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + (ТарифПоИнструкции*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
						//Иначе
						//мПослеПовышения = 0;
						мДоПовышения = 0;
						ТарифПоИнструкции = 0;
						Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
							//Если СтрокаПроцентов.Коэффициент.Последующий Тогда
							//	мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
							//Иначе
							мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
							//КонецЕсли;
							ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
							//Аверсон 20.04.2021 КВВ СВФР-007469 (
							Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * СтрокаПроцентов.Размер/100, ОкруглениеШтат, ВалютаРегл, Дата);
							Иначе
								//Аверсон 20.04.2021 КВВ СВФР-007469 )
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					если НеМенятьПовышениеЕТСИнстр Тогда
						ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
					ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
					ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						//Аверсон 20.04.2021 КВВ СВФР-007469 (
						Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда
							ТарифПоИнструкции = ТарифДробныхСтавок + ТарифПоИнструкции;
						Иначе    
							//Аверсон 20.04.2021 КВВ СВФР-007469 )
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
						КонецЕсли;
					КонецЕсли;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифПоИнструкции,Дата);
					//ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
						//Аверсон 20.04.2021 КВВ СВФР-007469 (
						Если ФлОкладПоКаждомуВиду Тогда
							ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции
							+ ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * ТекущаяСтрока.ПроцентПоКонтракту / 100,	ОкруглениеШтат, ВалютаРегл, Дата );
						Иначе
							//Аверсон 20.04.2021 КВВ СВФР-007469 )
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
					иначе 
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					//КонецЕсли;
					//О.Т. Аверсон 12.04.2016 № 1041
					Если ТекущаяСтрока.ОкладВВалюте Тогда 
						ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					//О.Т. Аверсон 12.04.2016 № 1041
					
					//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано
					////Аверсон 05.11.2021 КВВ СВФР-008331 (
					//Если Организация.ИНН = "700067572" И ТекущаяСтрока.СдельнаяОплата Тогда
					//	
					//	ВР_Ученические = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("15.Ученические");
					//	Если ЗначениеЗаполнено(ВР_Ученические) Тогда
					//		СтруктураДляПоиска = Новый Структура;
					//		СтруктураДляПоиска.Вставить("Сотрудник", ТекущаяСтрока.Сотрудник);
					//		СтруктураДляПоиска.Вставить("ВидРасчета",ВР_Ученические);
					//		
					//		МассивСтрок = ОсновныеНачисления.НайтиСтроки(СтруктураДляПоиска); 
					//		Если МассивСтрок.Количество() > 0 Тогда
					//			Для Каждого СтрМассивСтрок ИЗ МассивСтрок Цикл
					//				Если СтрМассивСтрок.Показатель1 <> ТекущаяСтрока.МесячнаяТарифнаяСтавка Тогда
					//					СтрМассивСтрок.Показатель1 = ТекущаяСтрока.МесячнаяТарифнаяСтавка;
					//				КонецЕсли;
					//			КонецЦикла;
					//		КонецЕсли;
					//	КонецЕсли;
					//КонецЕсли;
					////Аверсон 05.11.2021 КВВ СВФР-008331 )
					//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
				Иначе
					Сообщить("Невозможно рассчитать месячный тариф по ЕТС. Не введен параметр Ставка 1 разряда по Организации");
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Сообщить("Невозможно рассчитать месячный тариф по ЕТС. Не введен параметр Ставка 1 разряда по Организации");
		КонецЕсли;
		
		//Аверсон 22.09.2021 КВВ СВФР-008170 (   //перенесено под условие НЕ НеПересчитыватьТЧ
		
		//Аверсон ЕАЕ 13.02.2025 СВФР-014856
		//При установленном флаге НеПересчитыватьТЧ будем заполнять ТЧ Начисления
		//Если НЕ ТекущаяСтрока.ВидРасчета.Пустая() Тогда
		//	ДобавитьНачисленияПоСтрокеМодуль(ТекущаяСтрока);
		//КонецЕсли;
		//Аверсон СВФР-014856
		
		//Аверсон 22.09.2021 КВВ СВФР-008170 )
	КонецЕсли;	
	
	//Аверсон ЕАЕ 13.02.2025 СВФР-014856
	//При установленном флаге НеПересчитыватьТЧ будем заполнять ТЧ Начисления
	Если НЕ ТекущаяСтрока.ВидРасчета.Пустая() Тогда
		ДобавитьНачисленияПоСтрокеМодуль(ТекущаяСтрока);
	КонецЕсли;
	//Аверсон СВФР-014856
	
КонецПроцедуры

Процедура ДобавитьНачисленияПоСтрокеМодуль(РаботникСтрока) Экспорт
	
	Если ЗначениеЗаполнено(РаботникСтрока.ВидРасчета) И (ЗначениеЗаполнено(РаботникСтрока.МесячнаяТарифнаяСтавка) или ЗначениеЗаполнено(РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте)) тогда
		//толик
		//Определяем нужно ли выделять контракт
		мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
		
		мНайдено = Ложь;
		
		//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано 
		////Аверсон 05.11.2021 КВВ СВФР-008331 (
		//ВР_Ученические =ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
		//Если Организация.ИНН = "700067572" И РаботникСтрока.СдельнаяОплата Тогда
		//	ВР_Ученические = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("15.Ученические");
		//КонецЕсли;
		////Аверсон 05.11.2021 КВВ СВФР-008331 )
		//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
		
		СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
		Пока СписокВидовРасчета.Следующий() Цикл
			//Аверсон 11.11.2021 КВВ СВФР-008331 ( закомментировано
			////Аверсон 05.11.2021 КВВ СВФР-008331 (
			//Если ЗначениеЗаполнено(ВР_Ученические) Тогда
			//	Если СписокВидовРасчета.ВидРасчета = ВР_Ученические Тогда
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			////Аверсон 05.11.2021 КВВ СВФР-008331 )
			//Аверсон 11.11.2021 КВВ СВФР-008331 ) закомментировано
			
			СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СписокВидовРасчета.ВидРасчета));
			Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
				мНайдено = Истина;
				Прервать
			КонецЕсли;
		КонецЦикла;
		
		Если Не мНайдено Тогда
			Строка = ОсновныеНачисления.Добавить();
			Строка.Сотрудник = РаботникСтрока.Сотрудник; 
		Иначе
			Строка = СтрокиОсновныхНачислений[0];	
		КонецЕсли;
		//енд
		Строка.ВидРасчета = РаботникСтрока.ВидРасчета;
		//Островская Татьяна 15.11.2012 № 15990
		//ЧасыПоГрафику = 0;
		//ЗапросЧасыПоГрафику = Новый Запрос;
		//ЗапросЧасыПоГрафику.Текст = 
		//"ВЫБРАТЬ
		//|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма,
		//|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма) КАК ДополнительноеЗначениеНорма
		//|ИЗ
		//|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		//|ГДЕ
		//|	ГрафикиРаботыПоВидамВремени.План
		//|	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
		//|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
		//|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)";
		//ЗапросЧасыПоГрафику.УстановитьПараметр("ГрафикРаботы",РаботникСтрока.ГрафикРаботы);
		//ЗапросЧасыПоГрафику.УстановитьПараметр("Месяц",НачалоМесяца(РаботникСтрока.ДатаПриема));
		//РезЧасыПоГафику = ЗапросЧасыПоГрафику.Выполнить().Выбрать();
		//Пока РезЧасыПоГафику.Следующий() Цикл 
		//	ДниПоГрафику =  РезЧасыПоГафику.ОсновноеЗначениеНорма;
		//	ЧасыПоГрафику = РезЧасыПоГафику.ДополнительноеЗначениеНорма;
		//КонецЦикла;
		////Островская Татьяна 15.11.2012 № 15990
		Если РаботникСтрока.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
			ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
			Если мНеобходимоВыделятьКонтракт Тогда
				Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
				ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 12.04.2016 № 1041
			Иначе
				Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
				ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;
			КонецЕсли;
			ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;//О.Т. Аверсон 12.04.2016 № 1041
			//Островская Татьяна 15.11.2012 № 15990
			//если ДниПоГрафику > 0 Тогда
			//	Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / ЗанимаемыхСтавок /?(ДниПоГрафику=0,1,ДниПоГрафику), Константы.ВалютаРегламентированногоУчета.Получить()); 
			//Иначе
			Если ДнейВГоду.Размер <> 0 тогда
				Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф /?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 10.01.2017 № 129 
				Строка.Показатель1ВВалюте	  = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте /?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 12.04.2016 № 1041 
			Иначе
				Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
			КонецЕсли;
			//КонецЕсли;
			//Островская Татьяна 15.11.2012 № 15990
		ИначеЕсли РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
			//ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ЭлементыФормы.Дата.Значение,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов));
			//Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
			//Если ЧасовВГоду.Размер <> 0 тогда
			//	Строка.Показатель1 = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф/?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
			//Иначе
			//	Сообщить("Невозможно рассчиать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
			//КонецЕсли;
			//Толик
			Если ЗначениеЗаполнено(РаботникСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),РаботникСтрока.ГрафикРаботы));
				Если ЧасовВГоду.Размер = 0 Тогда 
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
					Новый Структура("Организация,ВидПараметра,Категория",Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
				КонецЕсли;
			иначе
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория",Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
			КонецЕсли;
			Если мНеобходимоВыделятьКонтракт Тогда
				Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
				ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			Иначе
				Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
				ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			КонецЕсли;
			ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
			//Островская Татьяна 15.11.2012 № 15990
			//если ЧасыПоГрафику > 0 Тогда
			//	Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасыПоГрафику=0,1,ЧасыПоГрафику), 1);
			//	Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
			//иначе
			//О.Т. 03.02.2015 № 17844
			Округление = Константы.ОкруглениеЧасовойТС.Получить();
			если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
				ЗначениеОкругления = 0;
			ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
				ЗначениеОкругления = 1;
			ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
				ЗначениеОкругления = 2;
			ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
				ЗначениеОкругления = 3;
			ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
				ЗначениеОкругления = 4;
			иначе
				ЗначениеОкругления = 0;
			КонецЕсли;
			//О.Т. 03.02.2015 № 17844
			Если ЧасовВГоду.Размер <> 0 тогда
				//О.Т. 03.02.2015 № 17844
				если РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда 
					//О.Т. Аверсон 03.01.2018  Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
					Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 10.01.2017 № 129
					Строка.Показатель1ВВалюте	  = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 12.04.2016 № 1041
				иначе
					Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
						Строка.Показатель1 = Окр(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 10.01.2017 № 129
						Строка.Показатель1ВВалюте = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);
					иначе
						Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 17.03.2016 № 949 ,129
						Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 12.04.2016 № 1041
					КонецЕсли;
				КонецЕсли;
				//О.Т. 03.02.2015 № 17844
				Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
			Иначе
				Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
			КонецЕсли;
			//КонецЕсли;
			//Островская Татьяна 15.11.2012 № 15990
		Иначе
			Если мНеобходимоВыделятьКонтракт Тогда
				Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
				ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			Иначе
				Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
				ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			КонецЕсли;
			Если Дата < Дата(2016,07,1) Тогда //О.Т. Аверсон 16.03.2016 № 949
				Строка.Показатель1 = Окр(Тариф, 1);
				Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1);
			иначе
				Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф,Дата);//О.Т. Аверсон 17.03.2016 № 949
				Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте,Дата);//О.Т. Аверсон 12.04.2016 № 1041
			КонецЕсли;
			Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
		КонецЕсли;
		//енд			
		
		//контракт толик		
		Если мНеобходимоВыделятьКонтракт И (не ЗначениеЗаполнено(РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта)) Тогда
			Сообщить("Невозможно рассчитать контракт. Для способа расчета неопределен вид начисления контракт !");
			Возврат;
		КонецЕсли;
		ВидыКонтрактов = ПрочиеПроцедуры.СформироватьСписокНачисленийКонтракта();
		Пока ВидыКонтрактов.Следующий() Цикл
			СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
			Для Каждого мСтрока Из СтрокиОсновныхНачислений Цикл
				ОсновныеНачисления.Удалить(мСтрока);
			КонецЦикла;
		КонецЦикла;
		Если мНеобходимоВыделятьКонтракт Тогда
			ВидыКонтрактов.Сбросить();
			мНайдено = Ложь;
			Пока ВидыКонтрактов.Следующий() Цикл
				СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
				Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
					мНайдено = Истина;
				КонецЕсли;
			КонецЦикла;
			Если Не мНайдено Тогда
				Строка = ОсновныеНачисления.Добавить();
				Строка.Сотрудник = РаботникСтрока.Сотрудник; 
			Иначе
				Строка = СтрокиОсновныхНачислений[0];	
			КонецЕсли;
			Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
			Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьРазмерТарифнойСтавки(ТарифнаяСтавка, мДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", мДата);
	Запрос.УстановитьПараметр("ТарифнаяСтавка", ТарифнаяСтавка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТарифнаяСтавка = &ТарифнаяСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Размер;
	КонецЕсли;
	
КонецФункции
//енд толик


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;

