
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.НазначениеСотрудниковПоБригадам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	
	Для Каждого СтрокаТЧ из РаботникиОрганизации Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = СтрокаТЧ.ДатаС;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Сотрудник = СтрокаТЧ.Сотрудник;
		НоваяЗапись.Бригада = СтрокаТЧ.Бригада;
		//ПСА 10.02.2021 СВФР-007177+++
		//Если Перевод Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаПо) Тогда
		//+++ПСА 10.02.2021 СВФР-007177	
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = КонецДня(СтрокаТЧ.ДатаПо)+1;
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.Сотрудник = СтрокаТЧ.Сотрудник;
			НоваяЗапись.Бригада = СтрокаТЧ.СтараяБригада;
		КонецЕсли;	
	КонецЦикла;
	
	НаборЗаписей.Записать();   
КонецПроцедуры
