// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
		
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		Для Каждого стр из РаботникиОрганизации Цикл 
		ФизЛицоСтр = стр.ФизЛицо.ПолучитьОбъект();
		Если МатериальнаяПомощь = 1 Тогда 
			МассивФизЛ = ФизЛицоСтр.Поощрения.НайтиСтроки(Новый Структура("ДатаПоощрения,НомерПриказаПоощрения",ДатаПриказа,НомерПриказа));
			Если МассивФизЛ.Количество()=0 Тогда 
				НоваяСтрТабл  = ФизЛицоСтр.Поощрения.Добавить();
			иначе
				НоваяСтрТабл = МассивФизЛ[0];
			КонецЕсли;
			НоваяСтрТабл.ДатаПоощрения = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаПоощрения = НомерПриказа;
			НоваяСтрТабл.ТекстПоощрения = стр.Текст;
			НоваяСтрТабл.ТипПоощрения = стр.ТипПоощрения;
			
			//Аверсон ЕАЕ 25.02.2025 СВФР-014999
			Если Организация.ИНН = "700103211" Тогда
				НоваяСтрТабл.ПримечаниеПоощрения = стр.Примечание;	
			КонецЕсли;
			//Аверсон СВФР-014999
			
			ФизЛицоСтр.Записать();
		ИначеЕсли МатериальнаяПомощь = 2 Тогда //взыскания
			МассивФизЛ = ФизЛицоСтр.Взыскания.НайтиСтроки(Новый Структура("ДатаВзыскания,НомерПриказаВзыскания",ДатаПриказа,НомерПриказа));
			Если МассивФизЛ.Количество()=0 Тогда 
				НоваяСтрТабл  = ФизЛицоСтр.Взыскания.Добавить();
			иначе
				НоваяСтрТабл = МассивФизЛ[0];
			КонецЕсли;
			НоваяСтрТабл.ДатаВзыскания = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаВзыскания = НомерПриказа;
			НоваяСтрТабл.ТекстВзыскания = стр.Текст;
			НоваяСтрТабл.ТипВзыскания = стр.ТипВзыскания;
			
			//Аверсон ЕАЕ 25.02.2025 СВФР-014999
			Если Организация.ИНН = "700103211" Тогда
				НоваяСтрТабл.ПримечаниеВзыскания = стр.Примечание;	
				
				НоваяСтрТабл.ДатаВзыскания1 = ДатаПриказа;
				НоваяСтрТабл.СрокИстечения = Дата(Год(ДатаПриказа) + 1, Месяц(ДатаПриказа), День(ДатаПриказа), Час(ДатаПриказа), Минута(ДатаПриказа), Секунда(ДатаПриказа));
			КонецЕсли;
			//Аверсон СВФР-014999
			
			ФизЛицоСтр.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//Аверсон 26.06.2019 КВВ СВФР-004477 (
	Для Каждого стр из РаботникиОрганизации Цикл 
		ФизЛицоСтр = стр.ФизЛицо.ПолучитьОбъект();
		Если МатериальнаяПомощь = 1 Тогда 
			МассивФизЛ = ФизЛицоСтр.Поощрения.НайтиСтроки(Новый Структура("ДатаПоощрения,НомерПриказаПоощрения",ДатаПриказа,НомерПриказа)); 
			Для Каждого Стр2 Из МассивФизЛ Цикл 
				ФизЛицоСтр.Поощрения.Удалить(Стр2); 
			КонецЦикла; 
			ФизЛицоСтр.Записать(); 
			Сообщить("Удалена строка в спр.""Физические лица"" из таблицы ""Поощрения"" по сотруднику " + СокрЛП(стр.ФизЛицо));
		ИначеЕсли МатериальнаяПомощь = 2 Тогда //взыскания
			МассивФизЛ = ФизЛицоСтр.Взыскания.НайтиСтроки(Новый Структура("ДатаВзыскания,НомерПриказаВзыскания",ДатаПриказа,НомерПриказа)); 
			Для Каждого Стр2 Из МассивФизЛ Цикл 
				ФизЛицоСтр.Взыскания.Удалить(Стр2); 
			КонецЦикла; 
			ФизЛицоСтр.Записать(); 
			Сообщить("Удалена строка в спр.""Физические лица"" из таблицы ""Взыскания"" по сотруднику " + СокрЛП(стр.ФизЛицо));
		КонецЕсли;
	КонецЦикла;	
	//Аверсон 26.06.2019 КВВ СВФР-004477 )
КонецПроцедуры

//Аверсон ЕАЕ 26.08.2025 СВФР-016444
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,, "Физлицо");
КонецПроцедуры
//Аверсон СВФР-016444



