////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Процедура осуществляет заполнение на основании документов 
//	ПремииРаботниковОрганизаций
//	РегистрацияРазовыхНачисленийРаботниковОрганизаций
//	НДФЛВозвратНалога
//	НачислениеДивидендовОрганизаций
//	НачислениеЕдиновременныхПособийЗаСчетФСС
//
// Параметры:
//  Основание - документ основание, из которого брать данные.
//
Процедура ЗаполнитьДокумент(Основание)
	//О.Т. 20.01.2015 № 17804
	СтавкаНДФЛ = РегистрыСведений.ШкалаПодоходногоНалога.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).Налог;
	СтавкаПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("ВидОтчисления",Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)).Размер;
	СтавкаОбщ = СтавкаНДФЛ+СтавкаПенс;
	//О.Т. 20.01.2015 № 17804
	Если ТипЗнч(Основание) = Тип("Структура")  Тогда
		Попытка
			
			ДокОснование = Основание.Ссылка;
			
		Исключение
			ДокОснование = Неопределено;
		КонецПопытки;
		Если не ДокОснование = Неопределено Тогда 
			
			
			ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
			ДокументОснование	= ДокОснование;
			
			КоэфПлановыхУдержаний = "ЕСТЬNULL(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано, 0)";
			ТаблицаПлановыхУдержаний = "ВЫБРАТЬ
			|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
			|			СУММА(ВЫБОР
			|					КОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
			|							И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения
			|					ИНАЧЕ ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Размер
			|				КОНЕЦ) КАК ВсегоУдержано
			|		ИЗ
			|			РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
			|					&парамМесяц,
			|					Организация = &ГоловнаяОрганизация
			|						И ВидРасчета.СпособРасчета В (&УдержанияПроцентом)
			|						И Физлицо В
			|							(ВЫБРАТЬ
			|								ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
			|							ИЗ
			|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|							ГДЕ
			|								ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо";
			
			КоэфНДФЛ = "ВЫБОР
			|	КОГДА ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			|		ТОГДА 30
			|	ИНАЧЕ &СтавкаОбщ
			|КОНЕЦ";
			
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПремииРаботниковОрганизаций") Тогда
				ПериодРегистрации	= ДокОснование.ПериодРегистрации;
				ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.Премии;
				
				ЗапросДляЗаполнения	=	Новый	Запрос;
				ЗапросДляЗаполнения.УстановитьПараметр("СтавкаОбщ",		СтавкаОбщ); //О.Т. 20.01.2015 № 17804
				ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
				ЗапросДляЗаполнения.УстановитьПараметр("парамМесяц",			ПериодРегистрации);
				ЗапросДляЗаполнения.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(ДокОснование.Организация));
				МассивСпособовРасчета = Новый Массив;
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);//О.Т. Аверсон 24.05.2017 № 665
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела);//О.Т. Аверсон 24.05.2017 № 665
				
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП); //О.Т. Аверсон 04.11.2016 № 1501
				//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор);
				ЗапросДляЗаполнения.УстановитьПараметр("УдержанияПроцентом",	МассивСпособовРасчета);
				
				Если Основание.СпособРасчета = "ЗаВычетомНалога" Тогда
					ЗапросДляЗаполнения.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Премии.Сотрудник.Физлицо КАК Физлицо,
					|	ВЫБОР
					|		КОГДА СУММА(Премии.Результат) > 0
					|			ТОГДА ВЫБОР
					|					КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
					|						ТОГДА 0
					|					ИНАЧЕ ВЫРАЗИТЬ(СУММА(Премии.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
					|					- ВЫРАЗИТЬ(СУММА(Премии.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
					|				КОНЕЦ
					|		ИНАЧЕ 0
					|	КОНЕЦ КАК Сумма,
					|	ИСТИНА КАК Авторасчет,
					|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
					|	Премии.Сотрудник.Код как ТабНомер
					|ИЗ
					|	Документ.ПремииРаботниковОрганизаций.Начисления КАК Премии
					|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
					|			СУММА(ВЫБОР
					|					КОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
					|							И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|						ТОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения
					|					ИНАЧЕ ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Размер
					|				КОНЕЦ) КАК ВсегоУдержано
					|		ИЗ
					|			РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
					|					&парамМесяц,
					|					Организация = &ГоловнаяОрганизация
					|						И ВидРасчета.СпособРасчета В (&УдержанияПроцентом)
					|						И Физлицо В
					|							(ВЫБРАТЬ
					|								Премии.Сотрудник.Физлицо
					|							ИЗ
					|								Документ.ПремииРаботниковОрганизаций.Начисления КАК Премии
					|							ГДЕ
					|								Премии.Ссылка = &ДокументСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
					|		
					|		СГРУППИРОВАТЬ ПО
					|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо, Премии.Сотрудник.Физлицо) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
					|		ПО Премии.Сотрудник.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
					|				&парамМесяц,
					|				Физлицо В
					|					(ВЫБРАТЬ
					|						Премии.Сотрудник.Физлицо
					|					ИЗ
					|						Документ.ПремииРаботниковОрганизаций.Начисления КАК Премии
					|					ГДЕ
					|						Премии.Ссылка = &ДокументСсылка)) КАК ГражданствоФизЛицСрезПоследних
					|		ПО Премии.Сотрудник.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо,
					|ГДЕ
					|	Премии.Ссылка = &ДокументСсылка
					|
					|СГРУППИРОВАТЬ ПО
					|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
					|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано
					|	
					|
					|УПОРЯДОЧИТЬ ПО";
					//Островская Татьяна 24.12.2013 № 16992
					если Организация.ИНН = "100765738" Тогда 
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
					иначе
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " Премии.Сотрудник.Физлицо.Наименование";
					КонецЕсли;
					//Островская Татьяна 24.12.2013 № 16992
					
					
				Иначе
					
					ЗапросДляЗаполнения.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Премии.Сотрудник.Физлицо КАК Физлицо,
					|	СУММА(Премии.Результат) КАК Сумма,
					|	ИСТИНА КАК Авторасчет,
					|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
					|	Премии.Сотрудник.Код как ТабНомер
					|ИЗ
					|	Документ.ПремииРаботниковОрганизаций.Начисления КАК Премии
					|ГДЕ
					|	Премии.Ссылка = &ДокументСсылка
					|
					|СГРУППИРОВАТЬ ПО
					|	Премии.Сотрудник.Физлицо,
					|   Премии.Сотрудник.Код
					|УПОРЯДОЧИТЬ ПО";
					//Островская Татьяна 24.12.2013 № 16992
					если Организация.ИНН = "100765738" Тогда 
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
					иначе
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " Премии.Сотрудник.Физлицо.Наименование";
					КонецЕсли;
					//Островская Татьяна 24.12.2013 № 16992
					
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.РегистрацияРазовыхНачисленийРаботниковОрганизаций") Тогда
				ПериодРегистрации	= ДокОснование.ПериодРегистрации;
				ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления;
				
				ЗапросДляЗаполнения	=	Новый	Запрос;
				ЗапросДляЗаполнения.УстановитьПараметр("СтавкаОбщ",		СтавкаОбщ);//О.Т. 20.01.2015 № 17804
				ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
				ЗапросДляЗаполнения.УстановитьПараметр("парамМесяц",			ПериодРегистрации);
				ЗапросДляЗаполнения.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(ДокОснование.Организация));
				МассивСпособовРасчета = Новый Массив;
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);//О.Т. Аверсон 24.05.2017 № 665
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела);//О.Т. Аверсон 24.05.2017 № 665
				
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП); //О.Т. Аверсон 04.11.2016 № 1501
				//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы);
				МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор);
				ЗапросДляЗаполнения.УстановитьПараметр("УдержанияПроцентом",	МассивСпособовРасчета);
				
				Если Основание.СпособРасчета = "ЗаВычетомНалога" Тогда
					ЗапросДляЗаполнения.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ИСТИНА КАК Авторасчет,
					|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
					|	ВЫБОР
					|		КОГДА СУММА(Прочие.Результат) > 0
					|			ТОГДА ВЫБОР
					|					КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
					|						ТОГДА 0
					|					ИНАЧЕ ВЫРАЗИТЬ(СУММА(Прочие.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
					|					- ВЫРАЗИТЬ(СУММА(Прочие.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
					|				КОНЕЦ
					|		ИНАЧЕ 0
					|	КОНЕЦ КАК Сумма,
					|	Прочие.Физлицо,
					|	Прочие.Сотрудник.Код как ТабНомер
					|ИЗ
					|	(ВЫБРАТЬ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Результат КАК Результат,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо КАК Физлицо,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.НомерСтроки КАК НомерСтроки,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Код КАК ТабНомер //Островская Татьяна 24.12.2013 № 16992
					|	ИЗ
					|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
					|	ГДЕ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &ДокументСсылка
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Результат,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.НомерСтроки,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Код //Островская Татьяна 24.12.2013 № 16992
					|	ИЗ
					|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
					|	ГДЕ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &ДокументСсылка) КАК Прочие
					|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
					|			СУММА(ВЫБОР
					|					КОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
					|							И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|						ТОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения
					|					ИНАЧЕ ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Размер
					|				КОНЕЦ) КАК ВсегоУдержано
					|		ИЗ
					|			РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
					|					&парамМесяц,
					|					ФизЛицо В
					|						(ВЫБРАТЬ
					|							РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо КАК Физлицо
					|						ИЗ
					|							Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
					|						ГДЕ
					|							РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &ДокументСсылка
					|					
					|						ОБЪЕДИНИТЬ
					|					
					|						ВЫБРАТЬ
					|							РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо
					|						ИЗ
					|							Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
					|						ГДЕ
					|							РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &ДокументСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
					|		
					|		СГРУППИРОВАТЬ ПО
					|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо, Прочие.Сотрудник.Код) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
					|		ПО Прочие.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
					|				&парамМесяц,
					|				ФизЛицо В
					|					(ВЫБРАТЬ
					|						РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо КАК Физлицо
					|					ИЗ
					|						Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
					|					ГДЕ
					|						РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &ДокументСсылка
					|				
					|					ОБЪЕДИНИТЬ
					|				
					|					ВЫБРАТЬ
					|						РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо
					|					ИЗ
					|						Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
					|					ГДЕ
					|						РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &ДокументСсылка)) КАК ГражданствоФизЛицСрезПоследних
					|		ПО Прочие.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
					|
					|СГРУППИРОВАТЬ ПО
					|	Прочие.Физлицо,
					|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
					|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
					|
					|УПОРЯДОЧИТЬ ПО";
					//Островская Татьяна 24.12.2013 № 16992
					если Организация.ИНН = "100765738" Тогда 
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
					иначе
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " Прочие.Физлицо.Наименование";
					КонецЕсли;
					//Островская Татьяна 24.12.2013 № 16992
					
				Иначе
					
					ЗапросДляЗаполнения.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ИСТИНА КАК Авторасчет,
					|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
					|	СУММА(Прочие.Результат) КАК Сумма,
					|	Прочие.Физлицо КАК Физлицо,
					|	Прочие.Сотрудник.Код как ТабНомер
					|ИЗ                                                                                                                                                8199
					|	(ВЫБРАТЬ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Результат КАК Результат,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо КАК Физлицо,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.НомерСтроки КАК НомерСтроки,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Код КАК ТабНомер //Островская Татьяна 24.12.2013 № 16992
					|	ИЗ
					|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
					|	ГДЕ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &ДокументСсылка
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Результат,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.НомерСтроки,
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Код //Островская Татьяна 24.12.2013 № 16992
					|	ИЗ
					|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
					|	ГДЕ
					|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &ДокументСсылка) КАК Прочие
					|
					|СГРУППИРОВАТЬ ПО
					|	Прочие.Физлицо,
					|   Прочие.Сотрудник.Код
					|УПОРЯДОЧИТЬ ПО";
					//Островская Татьяна 24.12.2013 № 16992
					если Организация.ИНН = "100765738" Тогда 
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
					иначе
						ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " Прочие.Физлицо.Наименование";
					КонецЕсли;
					//Островская Татьяна 24.12.2013 № 16992
					
				КонецЕсли;
				
			КонецЕсли;
			
			Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций") Тогда
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ПериодРегистрации	= ДокОснование.ПериодРегистрации;
		ХарактерВыплаты 	= ?(ДокОснование.ПериодНачисления = Перечисления.ПериодНачисленияЗарплаты.ПерваяПоловинаТекущегоМесяца,Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца,Перечисления.ХарактерВыплатыЗарплаты.Зарплата);
		
		ЗапросДляЗаполнения	=	Новый	Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("парамОрганизация", Организация);
		Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца Тогда
			ЗапросДляЗаполнения.УстановитьПараметр("парамНачалоПериодаРегистрации", ПериодРегистрации);
			ЗапросДляЗаполнения.УстановитьПараметр("парамКонецПериодаРегистрации", КонецМесяца(ПериодРегистрации));
			//О.Т. Аверсон 08.11.2017 № 1209
			МассивФизЛиц = ДокОснование.Начисления.ВыгрузитьКолонку("ФизЛицо");
			Для Каждого стр из ДокОснование.ДополнительныеНачисления Цикл 
				МассивФизЛиц.Добавить(стр.ФизЛицо);
			КонецЦикла;
			Для Каждого стр из ДокОснование.ДоговорыНаВыполнениеРабот Цикл 
				МассивФизЛиц.Добавить(стр.ФизЛицо);
			КонецЦикла;
			ЗапросДляЗаполнения.УстановитьПараметр("МассивФизЛиц", МассивФизЛиц);
			//О.Т. Аверсон 08.11.2017 № 1209
			
			ЗапросДляЗаполнения.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасчетПервойПоловиныМесяцаОбороты.Физлицо,
			|	ИСТИНА КАК Авторасчет,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	РасчетПервойПоловиныМесяцаОбороты.СуммаВзаиморасчетовОборот КАК Сумма,
			|	РаботникиОрганизаций.Сотрудник.Код КАК ТабНомер //Островская Татьяна 24.12.2013 № 16992
			|ИЗ
			|	РегистрНакопления.РасчетПервойПоловиныМесяца.Обороты(&парамНачалоПериодаРегистрации, &парамКонецПериодаРегистрации, Месяц, Организация = &парамОрганизация) КАК РасчетПервойПоловиныМесяцаОбороты
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|	ПО РасчетПервойПоловиныМесяцаОбороты.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
			|ГДЕ
			|	РасчетПервойПоловиныМесяцаОбороты.СуммаВзаиморасчетовОборот > 0 
			|   И РасчетПервойПоловиныМесяцаОбороты.ФизЛицо в (&МассивФизЛиц)
			|			|УПОРЯДОЧИТЬ ПО";
			//Островская Татьяна 24.12.2013 № 16992
			если Организация.ИНН = "100765738" Тогда 
				ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
			иначе
				ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " РасчетПервойПоловиныМесяцаОбороты.Физлицо.Наименование";
			КонецЕсли;
			//Островская Татьяна 24.12.2013 № 16992
		Иначе
			ЗапросДляЗаполнения.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
			ЗапросДляЗаполнения.УстановитьПараметр("парамКонецПериодаРегистрации", КонецМесяца(ПериодРегистрации) + 1);
			//О.Т. Аверсон 08.11.2017 № 1209
			МассивФизЛиц = ДокОснование.Начисления.ВыгрузитьКолонку("ФизЛицо");
			Для Каждого стр из ДокОснование.ДополнительныеНачисления Цикл 
				МассивФизЛиц.Добавить(стр.ФизЛицо);
			КонецЦикла;
			Для Каждого стр из ДокОснование.ДоговорыНаВыполнениеРабот Цикл 
				МассивФизЛиц.Добавить(стр.ФизЛицо);
			КонецЦикла;
			ЗапросДляЗаполнения.УстановитьПараметр("МассивФизЛиц", МассивФизЛиц);
			//О.Т. Аверсон 08.11.2017 № 1209
			
			//Островская Татьяна 24.12.2013 № 16992
			ЗапросДляЗаполнения.Текст =    // различные берем, двоит данные 015376 01.04.25
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВзаиморасчетыСРаботникамиОрганизацийОстатки.Физлицо,
			|	ИСТИНА КАК Авторасчет,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ВзаиморасчетыСРаботникамиОрганизацийОстатки.СуммаВзаиморасчетовОстаток КАК Сумма,
			|	РаботникиОрганизаций.Сотрудник.Код КАК ТабНомер //Островская Татьяна 24.12.2013 № 16992
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
			|		&парамКонецПериодаРегистрации,
			|		Организация = &парамОрганизация
			//|			И ПериодВзаиморасчетов = &парамПериодРегистрации  //О.Т. Аверсон 09.11.2017 № 1209
			|			) КАК ВзаиморасчетыСРаботникамиОрганизацийОстатки  
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|	ПО ВзаиморасчетыСРаботникамиОрганизацийОстатки.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
			|ГДЕ
			|	ВзаиморасчетыСРаботникамиОрганизацийОстатки.СуммаВзаиморасчетовОстаток > 0
			|   И ВзаиморасчетыСРаботникамиОрганизацийОстатки.ФизЛицо в (&МассивФизЛиц)			|УПОРЯДОЧИТЬ ПО";
			//Островская Татьяна 24.12.2013 № 16992
			если Организация.ИНН = "100765738" Тогда 
				ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
			иначе
				ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ВзаиморасчетыСРаботникамиОрганизацийОстатки.Физлицо.Наименование";
			КонецЕсли;
			//Островская Татьяна 24.12.2013 № 16992
		КонецЕсли;
		
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НДФЛВозвратНалога") Тогда
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ДокументОснование	= ДокОснование;
		ПериодРегистрации	= ДокОснование.Дата;
		ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.ВозвратНДФЛ;
		
		ЗапросДляЗаполнения	= Новый Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка", ДокОснование);
		
		ЗапросДляЗаполнения.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НДФЛВозвратНалога.ФизЛицо,
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	СУММА(НДФЛВозвратНалога.СуммаВозвратаПоСтавке13 + НДФЛВозвратНалога.СуммаВозвратаПоСтавке09 + НДФЛВозвратНалога.СуммаВозвратаПоСтавке35) КАК Сумма,
		|	НДФЛВозвратНалога.Сотрудник.Код как ТабНомер  //Островская Татьяна 24.12.2013 № 16992
		|ИЗ
		|	Документ.НДФЛВозвратНалога.РаботникиОрганизации КАК НДФЛВозвратНалога
		|ГДЕ
		|	НДФЛВозвратНалога.Ссылка = &ДокументСсылка
		|		|СГРУППИРОВАТЬ ПО
		|	НДФЛВозвратНалога.ФизЛицо,
		|   НДФЛВозвратНалога.Сотрудник.Код
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
		иначе
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " НДФЛВозвратНалога.ФизЛицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НачислениеЕдиновременныхПособийЗаСчетФСС") Тогда
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ДокументОснование	= ДокОснование;
		ПериодРегистрации	= ДокОснование.Дата;
		ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.ПособияФСС;
		
		ЗапросДляЗаполнения	=	Новый	Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
		ЗапросДляЗаполнения.УстановитьПараметр("Дата",		ПериодРегистрации);
		
		ЗапросДляЗаполнения.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПособияФСС.Физлицо,
		|	ПособияФСС.Физлицо.Наименование как Наименование,
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	СУММА(ПособияФСС.Результат) КАК Сумма,
		|	РаботникиОрганизаций.Сотрудник.Код как ТабНомер  //Островская Татьяна 24.12.2013 № 16992
		|ИЗ
		|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления КАК ПособияФСС
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, ) КАК РаботникиОрганизаций
		|	ПО ПособияФСС.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
		
		|ГДЕ
		|	ПособияФСС.Ссылка = &ДокументСсылка
		|	СГРУППИРОВАТЬ ПО
		|	ПособияФСС.Физлицо,
		|   РаботникиОрганизаций.Сотрудник.Код 
		
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|ВЫБРАТЬ
		|	ПособияФСС.Физлицо,
		|	ПособияФСС.Физлицо.Наименование,
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
		|	СУММА(ПособияФСС.Результат),
		|	РаботникиОрганизаций.Сотрудник.Код
		|	ИЗ
		|	Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления КАК ПособияФСС
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, ) КАК РаботникиОрганизаций
		|	ПО ПособияФСС.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|	ГДЕ
		|	ПособияФСС.Ссылка = &ДокументСсылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|	ПособияФСС.Физлицо,
		|	РаботникиОрганизаций.Сотрудник.Код
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
		иначе
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ПособияФСС.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НачислениеДивидендовОрганизаций") Тогда
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ДокументОснование	= ДокОснование;
		ПериодРегистрации	= ДокОснование.Дата;
		ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.Дивиденды;
		
		ЗапросДляЗаполнения	=	Новый	Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
		ЗапросДляЗаполнения.УстановитьПараметр("Период",		ПериодРегистрации); //О.Т. Аверсон 04.04.2018 № 1817
		
		
		ЗапросДляЗаполнения.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Дивиденды.Физлицо,
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	СУММА(Дивиденды.Результат - Дивиденды.НДФЛ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РаботникиОрганизаций.Сотрудник.Код, 0) = 0
		|			ТОГДА Дивиденды.Физлицо.Код
		|		ИНАЧЕ РаботникиОрганизаций.Сотрудник.Код
		|	КОНЕЦ КАК ТабНомер
		|ИЗ
		|	Документ.НачислениеДивидендовОрганизаций.Начисления КАК Дивиденды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизаций
		|		ПО Дивиденды.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
		|			СУММА(1) КАК КолСотр
		|		ИЗ
		|			РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо) КАК КоличествоСотр
		|		ПО Дивиденды.Физлицо = КоличествоСотр.ФизЛицо
		|ГДЕ
		|	Дивиденды.Ссылка = &ДокументСсылка
		|	И ВЫБОР
		|			КОГДА КоличествоСотр.КолСотр > 1
		|				ТОГДА НЕ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций //О.Т. Аверсон 18.05.2018 № 1988
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Дивиденды.Физлицо,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РаботникиОрганизаций.Сотрудник.Код, 0) = 0
		|			ТОГДА Дивиденды.Физлицо.Код
		|		ИНАЧЕ РаботникиОрганизаций.Сотрудник.Код
		|	КОНЕЦ
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
		иначе
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " Дивиденды.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РегистрацияРазовыхНачисленийРаботниковОрганизаций") Тогда
		// это был вызов автозаполнения не из самого документа, его вызвавшего, а либо из формы списка, либо из общего журнала
		// в этом случае автозаполняем документ зарплаты к выплате без подсчета конкретных сумм
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ДокументОснование	= ДокОснование;
		ПериодРегистрации	= ДокОснование.ПериодРегистрации;
		ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления;
		
		ЗапросДляЗаполнения	=	Новый	Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
		
		ЗапросДляЗаполнения.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо КАК Физлицо,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник.Код КАК ТабНомер
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
		|ГДЕ
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Физлицо.Наименование,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник.Код
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
		|ГДЕ
		|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ТабНомер";
		иначе
			ЗапросДляЗаполнения.Текст = ЗапросДляЗаполнения.Текст + " ФизлицоНаименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПремииРаботниковОрганизаций") Тогда
		// это был вызов автозаполнения не из самого документа, его вызвавшего, а либо из формы списка, либо из общего журнала
		// в этом случае автозаполняем документ зарплаты к выплате без подсчета конкретных сумм
		ДокОснование = Основание.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		ДокументОснование	= ДокОснование;
		ПериодРегистрации	= ДокОснование.ПериодРегистрации;
		ХарактерВыплаты 	= Перечисления.ХарактерВыплатыЗарплаты.Премии;
		
		ЗапросДляЗаполнения	=	Новый	Запрос;
		ЗапросДляЗаполнения.УстановитьПараметр("ДокументСсылка",		ДокОснование);
		
		ЗапросДляЗаполнения.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Премии.Сотрудник.Физлицо КАК Физлицо,
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Премии.Сотрудник.Код как ТабНомер
		|ИЗ
		|	Документ.ПремииРаботниковОрганизаций.Начисления КАК Премии
		|ГДЕ
		|	Премии.Ссылка = &ДокументСсылка";
		
		Зарплата.Загрузить(ЗапросДляЗаполнения.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДокумент()

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечатиРКО()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента",	Дата);
	Запрос.УстановитьПараметр("Выплачено", Перечисления.ВыплаченностьЗарплаты.Выплачено);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|			ИНАЧЕ """"
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|			ИНАЧЕ """"
	|		КОНЕЦ, ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование) КАК ФИОПолучателя,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
	|			ТОГДА "" сумма задепонирована""
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты <> &Выплачено
	|			ТОГДА "" сумма не помечена к выплате""
	|		КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА "" сумма выплачена документом ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СостояниеСтроки,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
	|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеДокумента,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
	|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыводитьРКО,
	|	ВЫБОР
	|		КОГДА ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетДанныхДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид.Наименование,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан1.Наименование КАК ДокументКемВыдан  //Островская Татьяна 26.03.2014 № 17191
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		&ДатаДокумента,
	|		Физлицо В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
	|		    ИЗ
	|		        Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		    ГДЕ
	|		        ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|		&ДатаДокумента,
	|		Физлицо В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
	|		    ИЗ
	|		        Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		    ГДЕ
	|		        ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка)) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
	|	И ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечатиРКО()

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим, ПодразделениеОрганизации = Неопределено)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",   Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента",	  Дата);
	Запрос.УстановитьПараметр("ДатаСреза",	  Дата);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации",	  ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("Выплачено", Перечисления.ВыплаченностьЗарплаты.Выплачено);
	
	//толик 
	Запрос.УстановитьПараметр("СимполПереноса", Символы.ПС);
	
	Если ПодразделениеОрганизации = Неопределено Тогда
		Если Режим = "ПоРеквизитамДокумента" Тогда
			
			Запрос.УстановитьПараметр("Руководитель",	  Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Запрос.УстановитьПараметр("ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			Запрос.УстановитьПараметр("Кассир", Перечисления.ОтветственныеЛицаОрганизаций.Кассир);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерДок,
			|	ЗарплатаКВыплатеОрганизаций.Дата КАК ДатаДок,
			|	ЗарплатаКВыплатеОрганизаций.Организация КАК Организация,
			|	ВЫРАЗИТЬ(ЗарплатаКВыплатеОрганизаций.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
			|	ЗарплатаКВыплатеОрганизаций.Организация.КодПоОКПО КАК КодПоОКПО,
			|	ЗарплатаКВыплатеОрганизаций.ПодразделениеОрганизации.Наименование КАК Подразделение,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихРуководитель.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
			|	ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.Должность.Наименование КАК ДолжностьРуководителя,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихГлБух.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо.Наименование) КАК ФИОГлБуха,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихКассир.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихКассир.ФизическоеЛицо.Наименование) КАК ФИОКассира,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма, 0) КАК Сумма,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ВсегоВыплачено, 0) КАК ВсегоВыплачено,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ВсегоДепонировано, 0) КАК ВсегоДепонировано,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма, 0) = ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ОплаченныеСуммы, 0)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ОплаченоПолностью,
			|	ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.Должность.Наименование,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КоличествоРКО,
			|	ЗарплатаКВыплатеОрганизаций.ХарактерВыплаты
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихРуководитель
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо = ФИОФизЛицСрезПоследнихРуководитель.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛицаОрганизацийСрезПоследнихГлБух
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихГлБух
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо = ФИОФизЛицСрезПоследнихГлБух.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Кассир) КАК ОтветственныеЛицаОрганизацийСрезПоследнихКассир
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихКассир
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихКассир.ФизическоеЛицо = ФИОФизЛицСрезПоследнихКассир.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихКассир.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка КАК Ссылка,
			|			СУММА(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты) КАК Сумма,
			|			СУММА(ВЫБОР
			|					КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ВсегоДепонировано,
			|			СУММА(ВЫБОР
			|					КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ВсегоВыплачено,
			|			СУММА(ВЫБОР
			|					КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ОплаченныеСуммы,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫРАЗИТЬ(СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор КАК Документ.РасходныйКассовыйОрдер)) КАК КоличествоРКО
			|		ИЗ
			|			Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
			|				ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
			|					И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
			|		ГДЕ
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка) КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ПО ЗарплатаКВыплатеОрганизаций.Ссылка = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Ссылка = &ДокументСсылка";
			
		ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
			
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			//толик изменил Ф И.О. 	на полное Ф И О
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 40) + "" ""
			|			ИНАЧЕ """"
			|		КОНЕЦ + &СимполПереноса + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 40) + "" ""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование) КАК ФизЛицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
			|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|			ТОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ПредставлениеДокумента,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
			|			ТОГДА ""Задепонировано""
			|		КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|			ТОГДА ""Выплачено""
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ЗаписьОДепонировании,
			|	АктуальныеПриказы.ТабельныйНомер,
			|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицоСсылка,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование КАК ФизлицоНаименование
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
			|				&ДатаДокумента,
			|				Физлицо В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо КАК Физлицо
			|					ИЗ
			|						Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
			|					ГДЕ
			|						ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
			|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПоследниеДаты.Физлицо КАК Физлицо,
			|			РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер
			|		ИЗ
			|			(ВЫБРАТЬ
			|				МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
			|				РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ГДЕ
			|				РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
			|				И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|				И РаботникиОрганизаций.Период <= &ДатаДокумента
			|				И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|				И РаботникиОрганизаций.Сотрудник.Физлицо В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
			|						ИЗ
			|							Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|						ГДЕ
			|							ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РаботникиОрганизаций.Сотрудник.Физлицо) КАК ПоследниеДаты
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|				ПО ПоследниеДаты.Период = РаботникиОрганизаций.Период
			|					И (РаботникиОрганизаций.Организация = &ГоловнаяОрганизация)
			|					И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|					И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|					И ПоследниеДаты.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо) КАК АктуальныеПриказы
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АктуальныеПриказы.Физлицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
			|	И ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизлицоНаименование";
			
		Иначе
			Возврат Неопределено
		КонецЕсли;
		
	Иначе
		Если Режим = "ПоРеквизитамДокумента" Тогда
			
			Запрос.УстановитьПараметр("Руководитель",	  Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
			Запрос.УстановитьПараметр("ГлавныйБухгалтер", Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			Запрос.УстановитьПараметр("Кассир", Перечисления.ОтветственныеЛицаОрганизаций.Кассир);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗарплатаКВыплатеОрганизаций.Номер КАК НомерДок,
			|	ЗарплатаКВыплатеОрганизаций.Дата КАК ДатаДок,
			|	ЗарплатаКВыплатеОрганизаций.Организация КАК Организация,
			|	ВЫРАЗИТЬ(ЗарплатаКВыплатеОрганизаций.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
			|	ЗарплатаКВыплатеОрганизаций.Организация.КодПоОКПО КАК КодПоОКПО,
			|	ЗарплатаКВыплатеОрганизаций.ПодразделениеОрганизации.Наименование КАК Подразделение,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихРуководитель.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихРуководитель.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
			|	ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.Должность.Наименование КАК ДолжностьРуководителя,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихГлБух.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихГлБух.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо.Наименование) КАК ФИОГлБуха,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследнихКассир.Фамилия + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Имя, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Имя, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ + ВЫБОР
			|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Отчество, 1, 1) <> """"
			|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследнихКассир.Отчество, 1, 1) + "".""
			|			ИНАЧЕ """"
			|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследнихКассир.ФизическоеЛицо.Наименование) КАК ФИОКассира,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма, 0) КАК Сумма,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ВсегоВыплачено, 0) КАК ВсегоВыплачено,
			|	ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ВсегоДепонировано, 0) КАК ВсегоДепонировано,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма, 0) = ЕСТЬNULL(ЗарплатаКВыплатеОрганизацийЗарплата.ОплаченныеСуммы, 0)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ОплаченоПолностью,
			|	ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.Должность.Наименование,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КоличествоРКО,
			|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Руководитель) КАК ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихРуководитель
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.ФизическоеЛицо = ФИОФизЛицСрезПоследнихРуководитель.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихРуководитель.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &ГлавныйБухгалтер) КАК ОтветственныеЛицаОрганизацийСрезПоследнихГлБух
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихГлБух
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.ФизическоеЛицо = ФИОФизЛицСрезПоследнихГлБух.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихГлБух.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ОтветственноеЛицо = &Кассир) КАК ОтветственныеЛицаОрганизацийСрезПоследнихКассир
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследнихКассир
			|			ПО ОтветственныеЛицаОрганизацийСрезПоследнихКассир.ФизическоеЛицо = ФИОФизЛицСрезПоследнихКассир.ФизЛицо
			|		ПО ЗарплатаКВыплатеОрганизаций.Организация = ОтветственныеЛицаОрганизацийСрезПоследнихКассир.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка КАК Ссылка,
			|			СУММА(ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты) КАК Сумма,
			|			СУММА(ВЫБОР
			|					КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ВсегоДепонировано,
			|			СУММА(ВЫБОР
			|					КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ВсегоВыплачено,
			|			СУММА(ВЫБОР
			|					КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|						ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК ОплаченныеСуммы,
			|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫРАЗИТЬ(СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор КАК Документ.РасходныйКассовыйОрдер)) КАК КоличествоРКО
			|		ИЗ
			|			Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
			|				ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
			|					И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
			|		ГДЕ
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка) КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ПО ЗарплатаКВыплатеОрганизаций.Ссылка = ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизаций.Ссылка = &ДокументСсылка";
			
		ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
			
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			//|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
			//|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
			//|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
			//|			ИНАЧЕ """"
			//|		КОНЕЦ + ВЫБОР
			//|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
			//|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
			//|			ИНАЧЕ """"
			//|		КОНЕЦ, ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование) КАК ФизЛицо,
			//|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + &СимполПереноса + "" "" + ФИОФизЛицСрезПоследних.Отчество, ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование) КАК ФизЛицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
			|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|			ТОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ПредставлениеДокумента,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
			|			ТОГДА ""Задепонировано""
			|		КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
			|			ТОГДА ""Выплачено""
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ЗаписьОДепонировании,
			|	АктуальныеПриказы.ТабельныйНомер
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
			|				&ДатаДокумента,
			|				Физлицо В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо КАК Физлицо
			|					ИЗ
			|						Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
			|					ГДЕ
			|						ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
			|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПоследниеДаты.Физлицо КАК Физлицо,
			|			РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер
			|		ИЗ
			|			(ВЫБРАТЬ
			|				МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
			|				РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|			ГДЕ
			|				РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
			|				И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
			|				И РаботникиОрганизаций.Период <= &ДатаДокумента
			|				И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|				И РаботникиОрганизаций.Сотрудник.Физлицо В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
			|						ИЗ
			|							Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|						ГДЕ
			|							ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РаботникиОрганизаций.Сотрудник.Физлицо) КАК ПоследниеДаты
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|				ПО ПоследниеДаты.Период = РаботникиОрганизаций.Период
			|					И (РаботникиОрганизаций.Организация = &ГоловнаяОрганизация)
			|					И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|					И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|					И ПоследниеДаты.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо) КАК АктуальныеПриказы
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АктуальныеПриказы.Физлицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, (НЕ Временно)) КАК РаботникиОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация = РаботникиОрганизацийСрезПоследних.Организация
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
			|	И ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты > 0
			|	И РаботникиОрганизацийСрезПоследних.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		Иначе
			Возврат Неопределено
		КонецЕсли;
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечатиРеестраДепонентов()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",   Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента",	  Дата);
	
	Запрос.УстановитьПараметр("Обособленное",  Организация);
	Запрос.УстановитьПараметр("Организация",  ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
	|ПОМЕСТИТЬ ВТСписокФизлиц
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
	|	И ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
	|	И ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо";
	
	Запрос.Выполнить().Выгрузить();
	СписокФизЛицТекст = "ВТСписокФизлиц";	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|			ИНАЧЕ """"
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|			ИНАЧЕ """"
	|		КОНЕЦ, ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование) КАК ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
	|	ЕСТЬNULL(РаботникиОрганизаций.ПодразделениеОрганизации.Наименование, ДоговорникиОрганизаций.ПодразделениеОрганизации.Наименование) КАК Подразделение
	|ИЗ
	|	" + СписокФизЛицТекст + " КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, Физлицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + " КАК СписокФизЛиц)) КАК ФИОФизЛицСрезПоследних
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо,
	|			ВЫБОР
	|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаДокумента
	|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|			КОНЕЦ КАК ПодразделениеОрганизации
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаДокумента,
	|				Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И Организация = &Организация
	|					И Сотрудник.Физлицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + " КАК СписокФизЛиц)) КАК РаботникиОрганизацийСрезПоследних
	|		ГДЕ
	|			ВЫБОР
	|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаДокумента
	|							И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|					ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			И ВЫБОР
	|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаДокумента
	|							И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделениеЗавершения
	|					ИНАЧЕ РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделение
	|				КОНЕЦ = &Обособленное) КАК РаботникиОрганизаций
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = РаботникиОрганизаций.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатыПоследнихДоговоров.Физлицо КАК Физлицо,
	|			МАКСИМУМ(ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации) КАК ПодразделениеОрганизации
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо КАК Физлицо,
	|				ДоговорНаВыполнениеРаботСФизЛицом.Организация КАК Организация,
	|				МАКСИМУМ(ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала) КАК ДатаНачала
	|			ИЗ
	|				Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|			ГДЕ
	|				ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаДокумента
	|				И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаДокумента
	|				И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|				И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Обособленное
	|				И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + " КАК СписокФизЛиц)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
	|				ДоговорНаВыполнениеРаботСФизЛицом.Организация) КАК ДатыПоследнихДоговоров
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|				ПО ДатыПоследнихДоговоров.Физлицо = ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|					И ДатыПоследнихДоговоров.Организация = ДоговорНаВыполнениеРаботСФизЛицом.Организация
	|					И ДатыПоследнихДоговоров.ДатаНачала = ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала
	|					И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДатыПоследнихДоговоров.Физлицо) КАК ДоговорникиОрганизаций
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДоговорникиОрганизаций.Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечатиРеестраДепонентов()

// Формирует запрос по документу
//
// Параметры: 
//  ФИОСокращенно - булево, используется для идентификации печати ФИО с инициалами
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечатиПеречняПеречислений()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",				Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента",				Дата);
	Запрос.УстановитьПараметр("Обособленное",				Организация);
	
	Если  Ссылка.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Банк КАК Банк,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Получатель,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСчета,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Получатель КАК Получатель1
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка";
		Запрос.Выполнить().Выгрузить();
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Банк КАК Банк,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Организация
		|ПОМЕСТИТЬ ВТСписокФизлиц
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка
		|	И ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Физлицо";
		
		Запрос.Выполнить().Выгрузить();
		СписокФизЛицТекст = "ВТСписокФизлиц";	
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК ФизЛицо,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование КАК ФизЛицоНаименование,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма + ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
		|	ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета
		|ИЗ
		|	" + СписокФизЛицТекст + " КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
		|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
		|			И ЗарплатаКВыплатеОрганизацийЗарплата.Банк = ЛицевыеСчетаРаботниковОрганизации.Банк
		|			И ЗарплатаКВыплатеОрганизацийЗарплата.Организация = ЛицевыеСчетаРаботниковОрганизации.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечатиПеречняПеречислений()

// Функция формирует основной запрос по сбору данных для расчетной ведомости.
//
// Параметры
//
// Возвращаемое значение:
//   РезультатЗапроса   – результат запроса.
//
Функция СформироватьЗапросТ49()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",				НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецМесяцаПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Запрос.УстановитьПараметр("ВидСтроки",			Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
	Запрос.УстановитьПараметр("Приход",				ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход",				ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Выплачено",			Перечисления.ВыплаченностьЗарплаты.Выплачено);
	Запрос.УстановитьПараметр("НеДействует",		Перечисления.ВидыДействияСНачислением.Прекратить);
	Авансы = Новый Массив;
	Авансы.Добавить(Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца);
	Авансы.Добавить(Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс);
	Запрос.УстановитьПараметр("Аванс",				Авансы);
	
	ПовременныеНачисления = Новый Массив;
	ПовременныеНачисления.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
	ПовременныеНачисления.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
	ПовременныеНачисления.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
	ПовременныеНачисления.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
	Запрос.УстановитьПараметр("ПовременныеНачисления",ПовременныеНачисления);
	Запрос.УстановитьПараметр("Сдельно",Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	Запрос.УстановитьПараметр("ОплатаПраздничныхИВыходных",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПраздничныхИВыходных);
	Запрос.УстановитьПараметр("ПраздничныйДень",Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
	
	
	ИсполнительныеЛисты = Новый Массив;
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентом);
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомБезБЛ);
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомДоПредела);
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛПроцентомДоПределаБезБЛ);
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммой);
	ИсполнительныеЛисты.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ИЛФиксированнойСуммойДоПредела);
	Запрос.УстановитьПараметр("ИсполнительныеЛисты",ИсполнительныеЛисты);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма КАК КВыплате,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование КАК ФизЛицоНаименование,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Имя = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|	КОНЕЦ КАК ФИО,
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы КАК ПриоритетГруппы,
	|	СУММА(Данные.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(Данные.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	СУММА(Данные.Результат) КАК Результат,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
	|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеДокумента,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
	|			ТОГДА ""Задепонировано""
	|		КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА ""Выплачено""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗаписьОДепонировании,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1Завершения.Наименование
	|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1.Наименование
	|	КОНЕЦ КАК ВалютаНаименованиеТарифнойСтавки,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА ТарифныеСтавки.Валюта
	|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|					ТОГДА ТарифныеСтавки.Валюта
	|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютаТарифнойСтавки,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА ТарифныеСтавки.Размер
	|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА ТарифныеСтавки.Размер
	|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифнаяСтавка,
	|	СУММА(Данные.ДнейПраздников) КАК ДнейПраздников,
	|	СУММА(Данные.ЧасовПраздников) КАК ЧасовПраздников,
	|	СУММА(Данные.ДнейВыходных) КАК ДнейВыходных,
	|	СУММА(Данные.ЧасовВыходных) КАК ЧасовВыходных,
	|	РаботникиОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	РаботникиОрганизацииСрезПоследних.ТабельныйНомер
	|ИЗ
	|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			АктуальныеПриказы.Физлицо КАК Физлицо,
	|			АктуальныеПриказы.Организация КАК Организация,
	|			АктуальныеПриказы.Сотрудник.Код КАК ТабельныйНомер,
	|			ВЫБОР
	|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
	|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
	|			КОНЕЦ КАК Должность
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ПоследниеДаты.Физлицо КАК Физлицо,
	|				ПоследниеДаты.Организация КАК Организация,
	|				РаботникиОрганизаций.Сотрудник КАК Сотрудник
	|			ИЗ
	|				(ВЫБРАТЬ
	|					МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
	|					РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	|					РаботникиОрганизаций.Организация КАК Организация
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|				ГДЕ
	|					РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|					И РаботникиОрганизаций.Организация = &ГоловнаяОрганизация
	|					И РаботникиОрганизаций.Период <= &КонецМесяцаПериода
	|					И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И РаботникиОрганизаций.Сотрудник.Физлицо В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
	|							ИЗ
	|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|							ГДЕ
	|								ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка)
	|				
	|				СГРУППИРОВАТЬ ПО
	|					РаботникиОрганизаций.Сотрудник.Физлицо,
	|					РаботникиОрганизаций.Организация) КАК ПоследниеДаты
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|					ПО ПоследниеДаты.Период = РаботникиОрганизаций.Период
	|						И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
	|						И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
	|						И ПоследниеДаты.Организация = РаботникиОрганизаций.Организация
	|						И ПоследниеДаты.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо) КАК АктуальныеПриказы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|						&КонецМесяцаПериода,
	|						Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|							И Организация = &ГоловнаяОрганизация
	|							И Сотрудник.Физлицо В
	|								(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|									ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо
	|								ИЗ
	|									Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|								ГДЕ
	|									ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка)) КАК РаботникиОрганизацийСрезПоследних
	|				ПО АктуальныеПриказы.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = РаботникиОрганизацииСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|				&КонецМесяцаПериода,
	|				Организация = &ГоловнаяОрганизация
	|					И ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|					И Сотрудник.Физлицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо
	|						ИЗ
	|							Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
	|						ГДЕ
	|							ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &Ссылка)) КАК ПлановыеНачисленияРаботниковОрганизацииСрезПоследних
	|		ПО (ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Действие <> &НеДействует)
	|			И ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&КонецМесяцаПериода, ) КАК ТарифныеСтавки
	|		ПО (ВЫБОР
	|				КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|						И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ТарифныйРазряд1Завершения
	|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ТарифныйРазряд1
	|			КОНЕЦ = ТарифныеСтавки.ТарифныйРазряд)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&КонецМесяцаПериода,
	|				Физлицо В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо
	|					ИЗ
	|						Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
	|					ГДЕ
	|						ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &Ссылка)) КАК ФИОФизЛицСрезПоследних
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОсновныеНачисленияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета В (&ПовременныеНачисления)
	|					ТОГДА ""Повременно""
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = &Сдельно
	|					ТОГДА ""Сдельно""
	|				ИНАЧЕ ""Другие начисления""
	|			КОНЕЦ КАК Группа,
	|			1 КАК ПриоритетГруппы,
	|			ОсновныеНачисленияРаботниковОрганизации.Результат КАК Результат,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|					ТОГДА 0
	|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
	|			КОНЕЦ КАК ОтработаноДней,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|					ТОГДА 0
	|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
	|			КОНЕЦ КАК ОтработаноЧасов,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|						И ПраздничныеДниКалендаря.ДатаКалендаря ЕСТЬ НЕ NULL 
	|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ДнейПраздников,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|						И ПраздничныеДниКалендаря.ДатаКалендаря ЕСТЬ НЕ NULL 
	|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧасовПраздников,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|						И ПраздничныеДниКалендаря.ДатаКалендаря ЕСТЬ NULL 
	|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ДнейВыходных,
	|			ВЫБОР
	|				КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета = &ОплатаПраздничныхИВыходных
	|						И ПраздничныеДниКалендаря.ДатаКалендаря ЕСТЬ NULL 
	|					ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧасовВыходных
	|		ИЗ
	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизации
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|				ИЗ
	|					РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|				ГДЕ
	|					РегламентированныйПроизводственныйКалендарь.ВидДня = &ПраздничныйДень) КАК ПраздничныеДниКалендаря
	|				ПО ОсновныеНачисленияРаботниковОрганизации.ПериодДействияНачало = ПраздничныеДниКалендаря.ДатаКалендаря
	|		ГДЕ
	|			ОсновныеНачисленияРаботниковОрганизации.ПериодРегистрации = &Период
	|			И (ОсновныеНачисленияРаботниковОрганизации.Результат <> 0
	|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней <> 0
	|					ИЛИ ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов <> 0)
	|			И ОсновныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ДополнительныеНачисленияРаботниковОрганизации.ФизЛицо,
	|			""Другие начисления"",
	|			2,
	|			ДополнительныеНачисленияРаботниковОрганизации.Результат,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизации
	|		ГДЕ
	|			ДополнительныеНачисленияРаботниковОрганизации.ПериодРегистрации МЕЖДУ &Период И &КонецМесяцаПериода
	|			И ДополнительныеНачисленияРаботниковОрганизации.Результат <> 0
	|			И ДополнительныеНачисленияРаботниковОрганизации.ОбособленноеПодразделение = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УдержанияРаботниковОрганизации.ФизЛицо,
	|			ВЫБОР
	|				КОГДА УдержанияРаботниковОрганизации.ВидРасчета В (&ИсполнительныеЛисты)
	|					ТОГДА ""ИЛ""
	|				ИНАЧЕ ""Другие удержания""
	|			КОНЕЦ,
	|			3,
	|			УдержанияРаботниковОрганизации.Результат,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизации
	|		ГДЕ
	|			УдержанияРаботниковОрганизации.ПериодРегистрации = &Период
	|			И УдержанияРаботниковОрганизации.Результат <> 0
	|			И УдержанияРаботниковОрганизации.ОбособленноеПодразделение = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НДФЛРасчетыСБюджетом.ФизЛицо,
	|			""НДФЛ"",
	|			3,
	|			НДФЛРасчетыСБюджетом.Налог,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|		ГДЕ
	|			НДФЛРасчетыСБюджетом.Период МЕЖДУ &Период И &КонецМесяцаПериода
	|			И НДФЛРасчетыСБюджетом.ВидДвижения = &Приход
	|			И НДФЛРасчетыСБюджетом.ВидСтроки = &ВидСтроки
	|			И НДФЛРасчетыСБюджетом.ОбособленноеПодразделение = &Организация
	|			И НДФЛРасчетыСБюджетом.ИсчисленоИзЗарплаты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ПогашениеЗаймовРаботникамиОрганизаций.ФизЛицо,
	|			""Другие удержания"",
	|			3,
	|			ПогашениеЗаймовРаботникамиОрганизаций.ОсновнойДолг + ПогашениеЗаймовРаботникамиОрганизаций.Проценты,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.ПогашениеЗаймовРаботникамиОрганизаций КАК ПогашениеЗаймовРаботникамиОрганизаций
	|		ГДЕ
	|			ПогашениеЗаймовРаботникамиОрганизаций.Период МЕЖДУ &Период И &КонецМесяцаПериода
	|			И ПогашениеЗаймовРаботникамиОрганизаций.ВидДвижения = &Расход
	|			И ПогашениеЗаймовРаботникамиОрганизаций.Организация = &Организация
	|			И ПогашениеЗаймовРаботникамиОрганизаций.УдержаноИзЗарплаты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Взаиморасчеты.Физлицо,
	|			ВЫБОР
	|				КОГДА Взаиморасчеты.ХарактерВыплаты В (&Аванс)
	|					ТОГДА ""Аванс""
	|				ИНАЧЕ ""Другие выплаты""
	|			КОНЕЦ,
	|			3,
	|			Взаиморасчеты.СуммаВзаиморасчетов,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК Взаиморасчеты
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
	|				ПО Взаиморасчеты.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
	|					И Взаиморасчеты.Регистратор = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор
	|					И (&Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость)
	|		ГДЕ
	|			Взаиморасчеты.ВидДвижения = &Расход
	|			И Взаиморасчеты.Организация = &Организация
	|			И Взаиморасчеты.СуммаВзаиморасчетов <> 0
	|			И Взаиморасчеты.Период МЕЖДУ &Период И &КонецМесяцаПериода
	|			И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо ЕСТЬ NULL 
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			РегистрНДФЛКЗачету.ФизЛицо,
	|			""Я"",
	|			5,
	|			РегистрНДФЛКЗачету.СуммаНДФЛКЗачетуОстаток,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.НДФЛКЗачету.Остатки(
	|					&Период,
	|					Организация = &Организация
	|						И Физлицо В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо
	|							ИЗ
	|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
	|							ГДЕ
	|								ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &Ссылка)) КАК РегистрНДФЛКЗачету
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СальдоНачальное.Физлицо,
	|			""Я"",
	|			5,
	|			СальдоНачальное.СуммаВзаиморасчетовОстаток,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0,
	|			0
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
	|					&Период,
	|					Организация = &Организация
	|						И Физлицо В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								ЗарплатаКВыплатеОрганизацииЗарплата.Физлицо
	|							ИЗ
	|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацииЗарплата
	|							ГДЕ
	|								ЗарплатаКВыплатеОрганизацииЗарплата.Ссылка = &Ссылка)) КАК СальдоНачальное) КАК Данные
	|		ПО Данные.ФизЛицо = ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
	|	Данные.Группа,
	|	Данные.ПриоритетГруппы,
	|	РаботникиОрганизацииСрезПоследних.Должность.Наименование,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Имя = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = &Выплачено
	|				И СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
	|			ТОГДА ""Задепонировано""
	|		КОГДА СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор ЕСТЬ НЕ NULL 
	|			ТОГДА ""Выплачено""
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1Завершения.Наименование
	|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА ТарифныеСтавки.Валюта
	|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|					ТОГДА ТарифныеСтавки.Валюта
	|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Валюта1
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <= &КонецМесяцаПериода
	|				И ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА ТарифныеСтавки.Размер
	|					ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА ТарифныеСтавки.Размер
	|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацииСрезПоследних.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо.Наименование,
	|	РаботникиОрганизацииСрезПоследних.ТабельныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ПриоритетГруппы";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#Если Клиент Тогда
	
	// Функция формирует табличный документ с печатной формой "Т-53".
	//
	// Возвращаемое значение:
	//   Табличный документ - печатная форма
	//
	Функция ПечатьТ53()
		ТабДокумент = Новый ТабличныйДокумент;
		
		КолСтрок = 0;
		ПроверкаСтрок(ТабДокумент);		
		КоличесвтоСтрок = ТабДокумент.КоличествоСтраниц();
		ТабДокумент.Очистить();
		
		
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_Т53";
		
		Макет 		= ПолучитьМакет("Т53");
		
		// получаем данные для печати
		ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		//ОбластьМакетаПодвал.Параметры.РКО = "Расходный кассовый ордер № _______ от  ""___"" ___________ 20 ___ г.";
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		ВывестиДанныеРКО = Ложь;
		//ПСА 23-12-2020 СВФР-006986+++
		//Должность = Новый СписокЗначений;
		//Должность.Добавить(Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Главный бухгалтер").Наименование);
		//Должность.Добавить(Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Директор").Наименование);
		ОтветственныеЛицаОрганизаций = Новый Массив;
		ОтветственныеЛицаОрганизаций.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		ОтветственныеЛицаОрганизаций.Добавить(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		//+++ПСА 23-12-2020 СВФР-006986
		
		// выводим данные о руководителях организации
		Пока ВыборкаДляШапки.Следующий() Цикл
			Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			
			ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапкаДокумента.Параметры.НомерДок		= СокрЛП(Номер);
			ОбластьМакетаШапкаДокумента.Параметры.Перечисление = Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации);
			//ПСА 23-12-2020 СВФР-006986+++
			Если ЗначениеЗаполнено(СокрЛП(ВыборкаДляШапки.Подразделение)) Тогда
				ОбластьМакетаШапкаДокумента.Параметры.ПодразделениеОрганизации = СокрЛП(ВыборкаДляШапки.Подразделение);
			КонецЕсли;
			//+++ПСА 23-12-2020 СВФР-006986
			//ПСА 23-12-2020 СВФР-006986+++
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//|	ОрганизацииОтветственныеЛица.Ссылка,
			//|	ОрганизацииОтветственныеЛица.Сотрудник,
			//|	ОрганизацииОтветственныеЛица.Должность.Наименование,
			//|	ОрганизацииОтветственныеЛица.Должность
			//|ИЗ
			//|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			//|ГДЕ
			//|	ОрганизацииОтветственныеЛица.Ссылка = &Ссылка
			//|	И ОрганизацииОтветственныеЛица.Должность.Наименование В(&Должность)";
			//Запрос.УстановитьПараметр("Ссылка", Организация);
			//Запрос.УстановитьПараметр("Должность", Должность);
			//
			//Выборка = Запрос.Выполнить().Выбрать();
			//пока Выборка.Следующий() цикл
			//	если  Выборка.Должность = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Главный бухгалтер") тогда
			//		ГлавныйБух = Выборка.Сотрудник;
			//	КонецЕсли;
			//	если  Выборка.Должность = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Директор") тогда
			//		Директор = Выборка.Сотрудник;
			//	КонецЕсли;
			//КонецЦикла;
			
			ГлавныйБух = "";
			Директор = "";
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОрганизацииОтветственныеЛица.Сотрудник,
			|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо
			|ИЗ
			|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			|ГДЕ
			|	ОрганизацииОтветственныеЛица.Ссылка = &Ссылка
			|	И ОрганизацииОтветственныеЛица.ОтветственноеЛицо В(&ОтветственныеЛицаОрганизаций)";
			Запрос.УстановитьПараметр("Ссылка", Организация);
			Запрос.УстановитьПараметр("ОтветственныеЛицаОрганизаций", ОтветственныеЛицаОрганизаций);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда
					Директор = Выборка.Сотрудник;
				ИначеЕсли Выборка.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда	
					ГлавныйБух = Выборка.Сотрудник;
				КонецЕсли;
			КонецЦикла;	
			//+++ПСА 23-12-2020 СВФР-006986
			ОбластьМакетаШапкаДокумента.Параметры.ГлБух	= ГлавныйБух;
			ОбластьМакетаШапкаДокумента.Параметры.Директор	= Директор;
			//ПСА 23-12-2020 СВФР-006986+++
			ОбластьМакетаШапкаДокумента.Параметры.ДатаДок	= Формат(Дата, "ДФ='дд MMMM yyyy'");
			//+++ПСА 23-12-2020 СВФР-006986
			ОбластьМакетаШапкаДокумента.Параметры.СуммаПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.Сумма, Валюта);
			ОбластьМакетаШапкаДокумента.Параметры.ДатаНач = Формат(ДатаНачОплаты, "ДФ='дд MMMM yyyy'");
			ОбластьМакетаШапкаДокумента.Параметры.ДатаКон = Формат(ДатаКонОплаты, "ДФ='дд MMMM yyyy'");
			
			ЗапросДокОсн = Новый Запрос;
			ЗапросДокОсн.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Регистратор.Представление КАК Представление,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Дата,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.Номер
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям КАК СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Физлицо
			|			И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = СведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Ведомость
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ведомость";
			ЗапросДокОсн.УстановитьПараметр("Ведомость",Ссылка);
			ДокОснование = ЗапросДокОсн.Выполнить().Выбрать();
			Пока ДокОснование.Следующий() цикл
				НомерДокОсн =ДокОснование.Номер;
				ДатаДокОсн =Формат(ДокОснование.Дата, "ДФ='MMMM yyyy'");
				
			КонецЦикла;
			ОбластьМакетаШапкаДокумента.Параметры.НомерОрдер	= НомерДокОсн;
			ОбластьМакетаШапкаДокумента.Параметры.ДатаОрдер	= ДатаДокОсн;
			
			
			Если ВыборкаДляШапки.ОплаченоПолностью Тогда
				Если ВыборкаДляШапки.ВсегоВыплачено > 0 Тогда
					//ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоВыплачено, Валюта);
					ОбластьМакетаПодвал.Параметры.ИтогоПоВедомости = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаДляШапки.ВсегоВыплачено,Дата);//О.Т. Аверсон 08.07.2016 № 949
				Иначе 
					ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = "---";
				КонецЕсли;
				ВывестиДанныеРКО = ВыборкаДляШапки.КоличествоРКО = 1;
			КонецЕсли;
			
		КонецЦикла;
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0;
		
		//Пока ВыборкаРаботники.Следующий() Цикл
		//	
		//	ВыведеноСтрок = ВыведеноСтрок + 1;
		//	
		//	// Проверим, уместится ли строка на странице или надо открывать новую страницу
		//	ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		//	Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
		//		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		//		ВывестиПодвалЛиста = Истина;
		//		//Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		//	КонецЕсли;
		//	Если ВывестиПодвалЛиста Тогда
		//		
		//		ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		//		
		//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//		ВыведеноСтраниц = ВыведеноСтраниц + 1;
		//		ИтогоНаСтранице = 0;
		//		
		//	КонецЕсли;
		
		//	
		//КонецЦикла;
		ОбластьМакетаШапкаДокумента.Параметры.КоличествоЛистов	=КоличесвтоСтрок  ;
		ТабДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0;
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);   
			//Если ВывестиДанныеРКО И Не ПустаяСтрока(ВыборкаРаботники.ПредставлениеДокумента) Тогда
			//	ОбластьМакетаПодвал.Параметры.РКО = ВыборкаРаботники.ПредставлениеДокумента;
			//	ВывестиДанныеРКО = Ложь;
			//КонецЕсли;
			//ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании = ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании + " " + Символы.ПС + " ";
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				если КоличесвтоСтрок > 1 тогда
					ОбластьМакетаИтогПоСтранице.Параметры.ИтогоПоЛисту = "Итого по листу:";
					ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
					
					ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				КонецЕсли;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;
			ОбластьМакетаСтрока.Параметры.НомерСтроки = ВыведеноСтрок;
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
			
			
		КонецЦикла;
		
		
		
		//толик	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		
		
		если  КоличесвтоСтрок >1 тогда
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоПоЛисту = "Итого по листу:";
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		КонецЕсли;
		//ОбластьМакетаПодвал.Параметры.КоличествоЛистов = ?(ВыведеноСтрок = 0,"",ВыведеноСтраниц);
		
		ВыводимыеОбласти = Новый Массив();
		//ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		//Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
		//	ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		//КонецЦикла;
		//ОбластьМакетаСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		//Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
		//	ТабДокумент.Вывести(ОбластьМакетаСтрока);
		//КонецЦикла;
		ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		ОбластьМакетаПодвал.Параметры.ИтогоПоВедомости = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаДляШапки.Сумма,Дата);//О.Т. Аверсон 08.07.2016 № 949
		ОбластьМакетаПодвал.Параметры.СуммаКВыдаче = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.Сумма, Валюта);
		
		
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		
		
		
		
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ53()
	
	Процедура  ПроверкаСтрок(ТабДокумент)
		
		КоличесвтоСтрок = 1;
		
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_Т53";
		
		Макет 		= ПолучитьМакет("Т53");
		
		// получаем данные для печати
		ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал"); 
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		ВывестиДанныеРКО = Ложь;
		Должность = Новый СписокЗначений;
		Должность.Добавить(Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Главный бухгалтер"));
		Должность.Добавить(Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Директор"));
		
		
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выбрать();
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0;
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);   
			ВыведеноСтрок = ВыведеноСтрок + 1;
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
			
		КонецЦикла;
		
		ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
	КонецПроцедуры
	// Функция формирует табличный документ с печатной формой "Т-53".
	//
	// Возвращаемое значение:
	//   Табличный документ - печатная форма
	//
	Функция ПечатьТ53Подр()
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_Т53";
		
		Макет 		= ПолучитьМакет("Т53Подр");
		//толик
		ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента").Выгрузить();
		
		ВыборкаРаботники.Колонки.Добавить("Подразделение");
		
		
		Для Каждого мСтрока Из ВыборкаРаботники Цикл
			мЗапрос = Новый Запрос;
			мЗапрос.Текст =
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизацийСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФизическиеЛица.Ссылка
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации";
			мЗапрос.УстановитьПараметр("Период", Дата);
			мЗапрос.УстановитьПараметр("Ссылка", мСтрока.ФизЛицоСсылка.Ссылка);
			мВыборка = мЗапрос.Выполнить().Выбрать();
			Пока мВыборка.Следующий() Цикл
				мСтрока.Подразделение = мВыборка.ПодразделениеОрганизации;
			КонецЦикла;
			
		КонецЦикла;
		
		мПодр = ВыборкаРаботники.Скопировать();
		мПодр.Свернуть("Подразделение");
		
		Для Каждого мСтрока Из мПодр Цикл
			ВыборкаДляШапки.Сбросить();
			Выборка = ВыборкаРаботники.НайтиСтроки(Новый Структура("Подразделение", мСтрока.Подразделение)); 
			ПечатьТ53Подр1(ВыборкаДляШапки, Выборка, ТабДокумент, Макет, мСтрока.Подразделение);
		КонецЦикла;
		
		
		//Пока Выборка.Следующий() Цикл
		//	мСумма = 0;
		//	// получаем данные для печати
		//	ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента", Выборка.ПодразделениеОрганизации).Выбрать();
		//	ВыборкаРаботники = СформироватьЗапросДляПечати("ПоТабличнойЧастиДокумента", Выборка.ПодразделениеОрганизации).Выбрать();
		//	
		//	// подсчитываем количество страниц документа - для корректного разбиения на страницы
		//	ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		//	ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		//	ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		//	ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		//	ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		//	ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		//	ОбластьМакетаПодвал.Параметры.РКО = "Расходный кассовый ордер № _______ от  ""___"" ___________ 20 ___ г.";
		//	
		//	// массив с двумя строками - для разбиения на страницы
		//	ВыводимыеОбласти = Новый Массив();
		//	ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		//	ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		//	
		//	ВывестиДанныеРКО = Ложь;
		//	
		//	// выводим данные о руководителях организации
		//	Пока ВыборкаДляШапки.Следующий() Цикл
		//		
		//		ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
		//	  //ОбластьМакетаШапкаДокумента.Параметры.ОтчетныйПериодС		= ПериодРегистрации;
		//	  //ОбластьМакетаШапкаДокумента.Параметры.ОтчетныйПериодПо		= ?(НЕ ЗначениеЗаполнено(ПериодРегистрации),ПериодРегистрации,КонецМесяца(ПериодРегистрации));
		// 		ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации);
		//		
		//		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		//		//Если ВыборкаДляШапки.Сумма <> 0 Тогда
		//		//	ОбластьМакетаШапкаДокумента.Параметры.СуммаДок = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.Сумма, Валюта);
		//		//	ОбластьМакетаШапкаДокумента.Параметры.СуммаДокРублей = Цел(ВыборкаДляШапки.Сумма);
		//		//	//ОбластьМакетаШапкаДокумента.Параметры.СуммаДокКопеек = (ВыборкаДляШапки.Сумма - Цел(ВыборкаДляШапки.Сумма)) * 100
		//		//КонецЕсли;
		//		Если ВыборкаДляШапки.ОплаченоПолностью Тогда
		//			Если ВыборкаДляШапки.ВсегоДепонировано > 0 Тогда
		//				ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоДепонировано, Валюта);
		//			Иначе 
		//				ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = "---";
		//			КонецЕсли;
		//			Если ВыборкаДляШапки.ВсегоВыплачено > 0 Тогда
		//				ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоВыплачено, Валюта);
		//			Иначе 
		//				ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = "---";
		//			КонецЕсли;
		//			ВывестиДанныеРКО = ВыборкаДляШапки.КоличествоРКО = 1;
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
		//	ТабДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		////толик	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//	ТабДокумент.Вывести(ОбластьМакетаШапка);
		//	
		//	ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0;
		//	// выводим данные по строкам документа.
		//	Пока ВыборкаРаботники.Следующий() Цикл
		//	
		//		ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);
		//		Если ВывестиДанныеРКО И Не ПустаяСтрока(ВыборкаРаботники.ПредставлениеДокумента) Тогда
		//			ОбластьМакетаПодвал.Параметры.РКО = ВыборкаРаботники.ПредставлениеДокумента;
		//			ВывестиДанныеРКО = Ложь;
		//		КонецЕсли;
		//		ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании = ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании + " " + Символы.ПС + " ";
		//		
		//		// разбиение на страницы
		//		ВыведеноСтрок = ВыведеноСтрок + 1;
		//		мСумма = мСумма + ВыборкаРаботники.Сумма;
		//		
		//		// Проверим, уместится ли строка на странице или надо открывать новую страницу
		//		ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		//		Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
		//			ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		//			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
		//		КонецЕсли;
		//		Если ВывестиПодвалЛиста Тогда
		//			
		//			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		//			ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		//			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//			ТабДокумент.Вывести(ОбластьМакетаШапка);
		//			ВыведеноСтраниц = ВыведеноСтраниц + 1;
		//			ИтогоНаСтранице = 0;
		//			
		//		КонецЕсли;
		//		
		//		ОбластьМакетаСтрока.Параметры.НомерСтроки = ВыведеноСтрок;
		//		ТабДокумент.Вывести(ОбластьМакетаСтрока);
		//		ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
		
		//	КонецЦикла;
		//	
		//	ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		//	ОбластьМакетаПодвал.Параметры.КоличествоЛистов = ?(ВыведеноСтрок = 0,"",ВыведеноСтраниц);
		//	Если мСумма <> 0 Тогда
		//		ОбластьМакетаПодвал.Параметры.СуммаДок = РаботаСДиалогами.СформироватьСуммуПрописью(мСумма, Валюта);
		//		ОбластьМакетаПодвал.Параметры.СуммаДокРублей = Цел(мСумма);
		//		ОбластьМакетаПодвал.Параметры.ИтогоПоВедомости = Цел(мСумма);
		//	КонецЕсли;
		//	
		//	ВыводимыеОбласти = Новый Массив();
		//	ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		//	ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		//	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		//	Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
		//		ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		//	КонецЦикла;
		//	ОбластьМакетаСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		//	Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
		//		ТабДокумент.Вывести(ОбластьМакетаСтрока);
		//	КонецЦикла;
		//	ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		//	ТабДокумент.Вывести(ОбластьМакетаПодвал);
		////толик	
		//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЦикла;	
		
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ53подр()
	
	// Функция формирует табличный документ с печатной формой "Т-49".
	//
	// Возвращаемое значение:
	//   Табличный документ - печатная форма
	//
	Функция ПечатьТ49()
		
		ТабДокумент                     = Новый ТабличныйДокумент;
		ТабДокумент.АвтоМасштаб         = Истина;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизации_Т49";
		ТабДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
		Макет		= ПолучитьМакет("Т49");
		
		// Сумма по документу.
		ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		// получаем данные по работникам для печати
		ВыборкаПоФЛ = СформироватьЗапросТ49().Выбрать();
		
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ИтоговаяКомпенсация = Зарплата.Итог("КомпенсацияЗаЗадержкуЗарплаты");
		ВыводитьКомпенсацию = ИтоговаяКомпенсация > 0; 
		
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьМакетаПодвал			= Макет.ПолучитьОбласть("Подвал");
		ОбластьСтрока				= Макет.ПолучитьОбласть("Строка");
		//ОбластьПодвалСтр			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		
		//О.Т. Аверсон 08.07.2016 № 949
		Если ПериодРегистрации >= Дата(2016,07,1) Тогда 
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,
			Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;
			
			ОбластьСтрока.Область("R1C5").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C9").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			
			ОбластьСтрока.Область("R1C10").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C11").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C15").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C16").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C17").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C18").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C19").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			
			ОбластьСтрока.Область("R1C20").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C21").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C22").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьСтрока.Область("R1C23").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			
			//Подвал
			ОбластьМакетаПодвал.Область("R1C9").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			
			ОбластьМакетаПодвал.Область("R1C10").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C11").Формат = "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C15").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C16").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C17").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C18").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C19").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			
			ОбластьМакетаПодвал.Область("R1C20").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C21").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C22").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C23").Формат = "ЧДЦ="+Строка(ЗначениеОкругления);
			
		КонецЕсли;
		//О.Т. Аверсон 08.07.2016 № 949
		
		
		Если Не ВыводитьКомпенсацию Тогда
			//удаляем колонку компенсации
			ОбластьМакетаШапка.УдалитьОбласть(ОбластьМакетаШапка.Область(1,23,ОбластьМакетаШапка.ВысотаТаблицы,23),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьМакетаШапкаТаблицы.УдалитьОбласть(ОбластьМакетаШапкаТаблицы.Область(1,23,ОбластьМакетаШапкаТаблицы.ВысотаТаблицы,23),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьМакетаПодвал.УдалитьОбласть(ОбластьМакетаПодвал.Область(1,23,ОбластьМакетаПодвал.ВысотаТаблицы,23),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьСтрока.УдалитьОбласть(ОбластьСтрока.Область(1,23,ОбластьСтрока.ВысотаТаблицы,23),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			//ОбластьПодвалСтр.УдалитьОбласть(ОбластьПодвалСтр.Область(1,23,ОбластьПодвалСтр.ВысотаТаблицы,23),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьСтрока);
		//ВыводимыеОбласти.Добавить(ОбластьПодвалСтр);
		
		ОбластьМакетаПодвал.Параметры.РКО = "Расходный кассовый ордер № _______ от  ""___"" ___________ 20 ___ г.";
		ОбластьМакетаПодвал.Параметры.ИтогоПовременно		= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоСдельно			= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоДругое			= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено	= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоАванс			= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоНДФЛ				= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоИЛ				= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоДругоеУдержано	= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаОрганизацией = 0;
		ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаРаботником	= 0;
		ОбластьМакетаПодвал.Параметры.ИтогоКВыплате			= 0;
		// Начинаем новый отсчет итогов по странице
		//ОбластьПодвалСтр.Параметры.Повременно			= 0;
		//ОбластьПодвалСтр.Параметры.Сдельно				= 0;
		//ОбластьПодвалСтр.Параметры.Другое				= 0;
		//ОбластьПодвалСтр.Параметры.ВсегоНачислено		= 0;
		//ОбластьПодвалСтр.Параметры.Аванс				= 0;
		//ОбластьПодвалСтр.Параметры.НДФЛ					= 0;
		//ОбластьПодвалСтр.Параметры.ИЛ					= 0;
		//ОбластьПодвалСтр.Параметры.ДругоеУдержано		= 0;
		//ОбластьПодвалСтр.Параметры.ДолгЗаОрганизацией	= 0;
		//ОбластьПодвалСтр.Параметры.ДолгЗаРаботником		= 0;
		//ОбластьПодвалСтр.Параметры.КВыплате				= 0;
		
		Если ВыводитьКомпенсацию Тогда
			ОбластьМакетаПодвал.Параметры.ИтогоКомпенсацияЗаЗадержкуЗарплаты	= 0;
			//ОбластьПодвалСтр.Параметры.КомпенсацияЗаЗадержкуЗарплаты			= 0;
		КонецЕсли;
		// заполнение и вывод шапки отчета
		ОбластьМакетаШапка.Параметры.ОтчетныйПериодС  = ПериодРегистрации;
		ОбластьМакетаШапка.Параметры.ОтчетныйПериодПо = ?(НЕ ЗначениеЗаполнено(ПериодРегистрации),ПериодРегистрации,КонецМесяца(ПериодРегистрации));
		ОбластьМакетаШапка.Параметры.НомерДок		  = Номер;
		ОбластьМакетаШапка.Параметры.ДатаДок		  = Дата;
		
		ВывестиДанныеРКО = Ложь;
		Если ВыборкаДляШапки.Следующий() Тогда
			
			ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаДляШапки);
			
			Если ВыборкаДляШапки.Сумма <> 0 Тогда
				ОбластьМакетаШапка.Параметры.СуммаВсегоПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.Сумма, ВалютаРегламентированногоУчета);
				ОбластьМакетаШапка.Параметры.СуммаДокРублей		= ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаДляШапки.Сумма,Дата);//О.Т. Аверсон 08.07.2016 № 949
				//ОбластьМакетаШапка.Параметры.СуммаДокКопеек		= (ВыборкаДляШапки.Сумма - Цел(ВыборкаДляШапки.Сумма)) * 100;
				ОбластьМакетаПодвал.Параметры.ИтогоКВыплате		= Зарплата.Итог("Сумма");
				Если ВыводитьКомпенсацию Тогда
					ОбластьМакетаПодвал.Параметры.ИтогоКомпенсацияЗаЗадержкуЗарплаты = ИтоговаяКомпенсация;
				КонецЕсли;
			КонецЕсли; 
			
			Если ВыборкаДляШапки.ОплаченоПолностью Тогда
				Если ВыборкаДляШапки.ВсегоДепонировано > 0 Тогда
					ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоДепонировано, ВалютаРегламентированногоУчета);
				Иначе 
					ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = "---";
				КонецЕсли;
				Если ВыборкаДляШапки.ВсегоВыплачено > 0 Тогда
					ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоВыплачено, ВалютаРегламентированногоУчета);
				Иначе 
					ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = "---";
				КонецЕсли;
				ВывестиДанныеРКО = ВыборкаДляШапки.КоличествоРКО = 1;
			КонецЕсли;
			
		КонецЕсли; 
		
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		НомерПП = 1;
		ВсегоСтрокДокумента = Зарплата.Количество();
		
		Пока ВыборкаПоФЛ.СледующийПоЗначениюПоля("ФизЛицо") Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПоФЛ);
			
			Если ВывестиДанныеРКО И Не ПустаяСтрока(ВыборкаПоФЛ.ПредставлениеДокумента) Тогда
				ОбластьМакетаПодвал.Параметры.РКО = ВыборкаПоФЛ.ПредставлениеДокумента;
				ВывестиДанныеРКО = Ложь;
			КонецЕсли;
			
			// поправим ФИО
			Если ВыборкаПоФЛ.ФИО = Null Тогда
				ОбластьСтрока.Параметры.ФИО	= ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаПоФЛ.ФизЛицоНаименование);
			КонецЕсли;
			
			// тарифная ставка
			Если ЗначениеЗаполнено(ВыборкаПоФЛ.ТарифнаяСтавка) И ВыборкаПоФЛ.ВалютаТарифнойСтавки <> ВалютаРегламентированногоУчета Тогда
				ОбластьСтрока.Параметры.ТарифнаяСтавка = "" + ВыборкаПоФЛ.ТарифнаяСтавка + "(" + ВыборкаПоФЛ.ВалютаНаименованиеТарифнойСтавки + ")"
			КонецЕсли; 
			
			ОбластьСтрока.Параметры.Повременно			= 0;
			ОбластьСтрока.Параметры.Сдельно				= 0;
			ОбластьСтрока.Параметры.Другое				= 0;
			ОбластьСтрока.Параметры.НДФЛ				= 0;
			ОбластьСтрока.Параметры.ИЛ					= 0;
			ОбластьСтрока.Параметры.ВсегоНачислено		= 0;
			ОбластьСтрока.Параметры.ДругоеУдержано		= 0;
			ОбластьСтрока.Параметры.ДолгЗаОрганизацией	= 0;
			ОбластьСтрока.Параметры.ДолгЗаРаботником	= 0;
			ВсегоУдержано								= 0;
			НачальноеСальдо								= 0;
			КонечноеСальдо								= 0;
			ОтработаноДней								= 0;
			ОтработаноЧасов								= 0;
			ДнейПраздников								= 0;
			ЧасовПраздников								= 0;
			ДнейВыходных								= 0;
			ЧасовВыходных								= 0;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и НомерПП = ВсегоСтрокДокумента Тогда
				//все строки отчета перебрали, они все еще умещаются на странице
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				//ТабДокумент.Вывести(ОбластьПодвалСтр);
				//
				//// обнулим итоги по странице
				//ОбластьПодвалСтр.Параметры.Повременно			= 0;
				//ОбластьПодвалСтр.Параметры.Сдельно				= 0;
				//ОбластьПодвалСтр.Параметры.Другое				= 0;
				//ОбластьПодвалСтр.Параметры.ВсегоНачислено		= 0;
				//ОбластьПодвалСтр.Параметры.Аванс				= 0;
				//ОбластьПодвалСтр.Параметры.НДФЛ					= 0;
				//ОбластьПодвалСтр.Параметры.ИЛ					= 0;
				//ОбластьПодвалСтр.Параметры.ДругоеУдержано		= 0;
				//ОбластьПодвалСтр.Параметры.ДолгЗаОрганизацией	= 0;
				//ОбластьПодвалСтр.Параметры.ДолгЗаРаботником		= 0;
				//ОбластьПодвалСтр.Параметры.КВыплате				= 0;
				//Если ВыводитьКомпенсацию Тогда
				//	ОбластьПодвалСтр.Параметры.КомпенсацияЗаЗадержкуЗарплаты = 0;
				//КонецЕсли;
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
			КонецЕсли;
			
			Пока ВыборкаПоФЛ.Следующий() Цикл
				
				// обработка расчетов
				Если ВыборкаПоФЛ.Группа = "Повременно" Тогда
					
					ОбластьСтрока.Параметры.Повременно				= ВыборкаПоФЛ.Результат;
					// подсчет итогов по странице и ведомости
					ОбластьМакетаПодвал.Параметры.ИтогоПовременно	= ОбластьМакетаПодвал.Параметры.ИтогоПовременно	+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.Повременно			= ОбластьПодвалСтр.Параметры.Повременно			+ ВыборкаПоФЛ.Результат;
					
					ОбластьСтрока.Параметры.ВсегоНачислено			= ОбластьСтрока.Параметры.ВсегоНачислено		+ ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено = ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено + ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ВсегоНачислено		= ОбластьПодвалСтр.Параметры.ВсегоНачислено		+ ВыборкаПоФЛ.Результат;
					
					ОтработаноДней = ОтработаноДней + ВыборкаПоФЛ.ОтработаноДней;
					ОтработаноЧасов = ОтработаноЧасов + ВыборкаПоФЛ.ОтработаноЧасов;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Сдельно" Тогда
					
					ОбластьСтрока.Параметры.Сдельно 				= ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоСдельно		= ОбластьМакетаПодвал.Параметры.ИтогоСдельно	+ ВыборкаПоФЛ.Результат; 
					//ОбластьПодвалСтр.Параметры.Сдельно				= ОбластьПодвалСтр.Параметры.Сдельно			+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ВсегоНачислено		= ОбластьПодвалСтр.Параметры.ВсегоНачислено		+ ВыборкаПоФЛ.Результат;
					
					ОбластьСтрока.Параметры.ВсегоНачислено = ОбластьСтрока.Параметры.ВсегоНачислено + ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено =  ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено + ВыборкаПоФЛ.Результат;
					
					ОтработаноДней = ОтработаноДней + ВыборкаПоФЛ.ОтработаноДней;
					ОтработаноЧасов = ОтработаноЧасов + ВыборкаПоФЛ.ОтработаноЧасов;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Другие начисления" Тогда
					
					ОбластьСтрока.Параметры.Другое					= ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоДругое		= ОбластьМакетаПодвал.Параметры.ИтогоДругое		+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.Другое				= ОбластьПодвалСтр.Параметры.Другое				+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ВсегоНачислено		= ОбластьПодвалСтр.Параметры.ВсегоНачислено		+ ВыборкаПоФЛ.Результат;
					
					
					ОбластьСтрока.Параметры.ВсегоНачислено = ОбластьСтрока.Параметры.ВсегоНачислено + ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено = ОбластьМакетаПодвал.Параметры.ИтогоВсегоНачислено + ВыборкаПоФЛ.Результат;
					
					ОтработаноДней = ОтработаноДней + ВыборкаПоФЛ.ОтработаноДней;
					ОтработаноЧасов = ОтработаноЧасов + ВыборкаПоФЛ.ОтработаноЧасов;
					
					ДнейПраздников = ДнейПраздников + ВыборкаПоФЛ.ДнейПраздников;
					ЧасовПраздников = ЧасовПраздников + ВыборкаПоФЛ.ЧасовПраздников;
					ДнейВыходных = ДнейВыходных + ВыборкаПоФЛ.ДнейВыходных;
					ЧасовВыходных = ЧасовВыходных + ВыборкаПоФЛ.ЧасовВыходных;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Аванс" Тогда
					
					ОбластьСтрока.Параметры.Аванс					= ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоАванс		= ОбластьМакетаПодвал.Параметры.ИтогоАванс		+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.Аванс				= ОбластьПодвалСтр.Параметры.Аванс				+ ВыборкаПоФЛ.Результат;
					
					ВсегоУдержано = ВсегоУдержано + ВыборкаПоФЛ.Результат;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Другие выплаты" Тогда
					
					ОбластьСтрока.Параметры.ДругоеУдержано			= ОбластьСтрока.Параметры.ДругоеУдержано		+ ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоДругоеУдержано	= ОбластьМакетаПодвал.Параметры.ИтогоДругоеУдержано	+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ДругоеУдержано		= ОбластьПодвалСтр.Параметры.ДругоеУдержано		+ ВыборкаПоФЛ.Результат;
					ВсегоУдержано = ВсегоУдержано + ВыборкаПоФЛ.Результат;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "НДФЛ" Тогда
					
					ОбластьСтрока.Параметры.НДФЛ					= ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоНДФЛ			= ОбластьМакетаПодвал.Параметры.ИтогоНДФЛ		+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.НДФЛ					= ОбластьПодвалСтр.Параметры.НДФЛ				+ ВыборкаПоФЛ.Результат;
					
					ВсегоУдержано = ВсегоУдержано + ВыборкаПоФЛ.Результат;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "ИЛ" Тогда
					
					ОбластьСтрока.Параметры.ИЛ						= ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоИЛ			= ОбластьМакетаПодвал.Параметры.ИтогоИЛ			+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ИЛ					= ОбластьПодвалСтр.Параметры.ИЛ					+ ВыборкаПоФЛ.Результат;
					
					ВсегоУдержано = ВсегоУдержано + ВыборкаПоФЛ.Результат;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Другие удержания" Тогда
					
					ОбластьСтрока.Параметры.ДругоеУдержано			= ОбластьСтрока.Параметры.ДругоеУдержано		+ ВыборкаПоФЛ.Результат;
					ОбластьМакетаПодвал.Параметры.ИтогоДругоеУдержано	= ОбластьМакетаПодвал.Параметры.ИтогоДругоеУдержано	+ ВыборкаПоФЛ.Результат;
					//ОбластьПодвалСтр.Параметры.ДругоеУдержано		= ОбластьПодвалСтр.Параметры.ДругоеУдержано		+ ВыборкаПоФЛ.Результат;
					
					ВсегоУдержано = ВсегоУдержано + ВыборкаПоФЛ.Результат;
					
				ИначеЕсли ВыборкаПоФЛ.Группа = "Я" Тогда // Конечное сальдо
					НачальноеСальдо = НачальноеСальдо + ВыборкаПоФЛ.Результат;
				КонецЕсли;
				
			КонецЦикла;
			
			// дней(часов) отработано
			ОбластьСтрока.Параметры.ОтработаноДнейЧасов = ОтработаноДней;
			Если ЗначениеЗаполнено(ОтработаноЧасов) Тогда
				ОбластьСтрока.Параметры.ОтработаноДнейЧасов = "" + ОбластьСтрока.Параметры.ОтработаноДнейЧасов + " (" + ОтработаноЧасов + ")"
			КонецЕсли; 
			ОбластьСтрока.Параметры.ДнейЧасовВыходных = ДнейВыходных;
			Если ЗначениеЗаполнено(ЧасовВыходных) Тогда
				ОбластьСтрока.Параметры.ДнейЧасовВыходных = "" + ОбластьСтрока.Параметры.ДнейЧасовВыходных + " (" + ЧасовВыходных + ")"
			КонецЕсли; 
			ОбластьСтрока.Параметры.ДнейЧасовПраздников = ДнейПраздников;
			Если ЗначениеЗаполнено(ЧасовПраздников) Тогда
				ОбластьСтрока.Параметры.ДнейЧасовПраздников = "" + ОбластьСтрока.Параметры.ДнейЧасовПраздников + " (" + ЧасовПраздников + ")"
			КонецЕсли;
			
			// итого к выплате по странице
			//ОбластьПодвалСтр.Параметры.КВыплате						= ОбластьПодвалСтр.Параметры.КВыплате				+ ОбластьСтрока.Параметры.КВыплате;
			
			КонечноеСальдо = НачальноеСальдо + ОбластьСтрока.Параметры.ВсегоНачислено - ВсегоУдержано - ОбластьСтрока.Параметры.КВыплате;
			Если КонечноеСальдо > 0 Тогда
				
				ОбластьСтрока.Параметры.ДолгЗаОрганизацией			= КонечноеСальдо;
				ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаОрганизацией	= ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаОрганизацией	+ КонечноеСальдо;
				//ОбластьПодвалСтр.Параметры.ДолгЗаОрганизацией		= ОбластьПодвалСтр.Параметры.ДолгЗаОрганизацией		+ КонечноеСальдо;
				
			Иначе
				
				ОбластьСтрока.Параметры.ДолгЗаРаботником			= 0 - КонечноеСальдо;
				ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаРаботником		= ОбластьМакетаПодвал.Параметры.ИтогоДолгЗаРаботником	- КонечноеСальдо;
				//ОбластьПодвалСтр.Параметры.ДолгЗаРаботником			= ОбластьПодвалСтр.Параметры.ДолгЗаРаботником		- КонечноеСальдо;
				
			КонецЕсли; 
			
			ОбластьСтрока.Параметры.НомерПП  = НомерПП;
			
			ТабДокумент.Вывести(ОбластьСтрока);
			НомерПП = НомерПП + 1;
			
		КонецЦикла;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьСтрока);
		//ВыводимыеОбласти.Добавить(ОбластьПодвалСтр);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьСтрока.Параметры.Количество() Цикл
			ОбластьСтрока.Параметры.Установить(Сч - 1,"");
		КонецЦикла;
		ОбластьСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		//ТабДокумент.Вывести(ОбластьПодвалСтр);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ49()
	
	// Функция формирует табличный документ с печатной формой "КО-02".
	//
	// Возвращаемое значение:
	//   Табличный документ - печатная форма
	Функция ПечатьРКО()
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_РКО";
		
		Макет         = ПолучитьОбщийМакет("КО2_РБ");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		// счета учета
		ОбластьМакета.Параметры.ДебетСубСчет  = "70";
		//ОбластьМакета.Параметры.КредитСубСчет = "50.01";
		
		// данные об организации
		СведенияОбОрганизации     = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ЮридическийАдрес,Телефоны,");
		//ОбластьМакета.Параметры.ОрганизацияПоОКПО = СведенияОбОрганизации.КодПоОКПО;
		
		// выводим подписи ответственных лиц
		Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, Дата);
		
		ОбластьМакета.Параметры.ФИОРуководителя       = Руководители.Руководитель;
		//ОбластьМакета.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
		
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Руководители.ГлавныйБухгалтер;
		ОбластьМакета.Параметры.ФИОКассира            = Руководители.Кассир;
		
		// прочие поля
		ПредставлениеДокумента = "Платежная ведомость № " + Номер + " от " + Формат(Дата,"ДЛФ=DD");
		ОбластьМакета.Параметры.Основание             = ПредставлениеДокумента;
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
		// получаем данные для печати
		ВыборкаРаботники = СформироватьЗапросДляПечатиРКО().Выбрать();
		
		Пока ВыборкаРаботники.Следующий() Цикл
			
			Если ВыборкаРаботники.ВыводитьРКО Тогда
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаРаботники);
				ОбластьМакета.Параметры.СуммаПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаРаботники.Сумма, Валюта);
				ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = ?(ВыборкаРаботники.НетДанныхДокумента,"",
				ВыборкаРаботники.ДокументВидНаименование + " серия " +
				ВыборкаРаботники.ДокументСерия       + ", номер " +
				ВыборкаРаботники.ДокументНомер       + ", выдан " +
				Формат(ВыборкаРаботники.ДокументДатаВыдачи, "ДФ=dd.MM.yyyy")  + " " +
				СокрЛП(ВыборкаРаботники.ДокументКемВыдан));
				
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			Иначе
				
				Если Не ПустаяСтрока(ПредставлениеДокумента) Тогда
					Сообщить("Печать документа " + ПредставлениеДокумента + ":");
					ПредставлениеДокумента = "";
				КонецЕсли;
				
				Сообщить(Символы.Таб + "по строке № " + ВыборкаРаботники.НомерСтроки +  
				ВыборкаРаботники.СостояниеСтроки + ВыборкаРаботники.ПредставлениеДокумента);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТабДокумент.ВысотаТаблицы = 0 Тогда
			Если Не ПустаяСтрока(ПредставлениеДокумента) Тогда
				Сообщить("Печать документа " + ПредставлениеДокумента + ":");
			КонецЕсли;
			Сообщить(Символы.Таб + "не обнаружено невыданных сумм, помеченных к выплате!");
		КонецЕсли;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьРКО()
	
	// Функция формирует табличный документ с печатной формой Реестр депонированных сумм.
	//
	// Возвращаемое значение:
	//   Табличный документ - печатная форма
	//
	Функция ПечатьРеестр()
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_Реестр";
		
		Макет 		= ПолучитьМакет("Реестр");
		
		// получаем данные для печати
		ВыборкаДляШапки   = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечатиРеестраДепонентов().Выбрать();
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		// выводим данные о руководителях организации
		Пока ВыборкаДляШапки.Следующий() Цикл
			ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации = СокрЛП(ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации);
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаДляШапки);
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				
				ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
				ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаШапка);
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
			Итого = Итого + ВыборкаРаботники.Сумма;
			
		КонецЦикла;
		
		Если ВыведеноСтрок > 0 Тогда 
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		КонецЕсли;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		ОбластьМакетаПодвал.Параметры.Итого = Итого;
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьРеестр()
	
	// Функция формирует табличный документ с печатной формой "Список плательщиков в банк".
	//
	// Параметры
	//  ФИОСокращенно - булево, используется для идентификации печати ФИО с инициалами
	// Возвращаемое значение:
	//  Табличный документ - печатная форма
	//
	Функция ПечатьСписокПеречислений(ФИОСокращенно = Истина)
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		ТабДокумент.ПолеСлева = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплатеОрганизаций_СписокПеречислений";
		
		Макет 		= ПолучитьМакет("СписокПеречислений");
		
		// получаем данные для печати
		ВыборкаДляШапки = СформироватьЗапросДляПечати("ПоРеквизитамДокумента").Выбрать();
		ВыборкаРаботники = СформироватьЗапросДляПечатиПеречняПеречислений().Выбрать();
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники.Количество();
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		
		//Аверсон ЕАЕ 23.07.2025 СВФР-016316
		//Климовичи
		//ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		//ОбластьМакетаИтогПоСтранице2= Макет.ПолучитьОбласть("ИтогПоЛисту2");//Островская Татьяна 18.04.2013 № 16392
		Если Организация.ИНН = "700103211" Тогда
			ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("ПодвалДолжностьРуководителя");
			ОбластьМакетаИтогПоСтранице2= Макет.ПолучитьОбласть("ИтогПоЛисту2ДолжностьРуководителя");
		Иначе
			ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
			ОбластьМакетаИтогПоСтранице2= Макет.ПолучитьОбласть("ИтогПоЛисту2");
		КонецЕсли;
		//Аверсон СВФР-016316
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице2); //ПСА 15.06.2021 СВФР-007705
		// выводим данные о руководителях организации
		Пока ВыборкаДляШапки.Следующий() Цикл
			ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации = СокрЛП(ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации);
			//толик
			ОбластьМакетаШапкаДокумента.Параметры.Список = "Список №"+СокрЛП(Строка(Число(ВыборкаДляШапки.НомерДок)))+ " от " + Формат(ВыборкаДляШапки.ДатаДок, "ДФ=dd.MM.yyyy");
			Если ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "зарплаты за _I__ половину "+Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "зарплаты за _II__ половину "+Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "отпускных " + ?(ДатаНачала <> Дата(1,1,1), " за " + Формат(ДатаНачала, "ДФ='MMMM yyyy'"), "");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Премии Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "премии за " + Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "Перечисление алиментов " + Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");				
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "расчета при увольнении за " + Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПособияФСС Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "пособий за " + Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Командировочные Тогда
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = "командировочных за " + Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
			Иначе
				ОбластьМакетаШапкаДокумента.Параметры.Перечисление = Строка(ВыборкаДляШапки.ХарактерВыплаты)+" "+Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
				//Аверсон 06.08.2020 КВВ СВФР-006301 (
				Если ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления И ЗначениеЗаполнено(ДокументОснование) Тогда
					З = Новый Запрос;
					З.Текст = "ВЫБРАТЬ ДопНач.ВидРасчета
					|ИЗ Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК ДопНач
					|ГДЕ ДопНач.Ссылка = &Док
					|СГРУППИРОВАТЬ ПО ДопНач.ВидРасчета
					|
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ ОснНач.ВидРасчета
					|ИЗ Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК ОснНач
					|ГДЕ ОснНач.Ссылка = &Док
					|СГРУППИРОВАТЬ ПО ОснНач.ВидРасчета";
					З.УстановитьПараметр("Док",ДокументОснование);
					РезЗ = З.Выполнить().Выгрузить();
					Если РезЗ.Количество() = 1 Тогда
						ОбластьМакетаШапкаДокумента.Параметры.Перечисление = СокрЛП(РезЗ[0].ВидРасчета) + " "+Формат(ЭтотОбъект.ПериодРегистрации, "ДФ='MMMM yyyy'");
					КонецЕсли;
				КонецЕсли;
				//Аверсон 06.08.2020 КВВ СВФР-006301 )
			КонецЕсли;
			ОбластьМакетаШапкаДокумента.Параметры.Банк = ЭтотОбъект.Банк.НаименованиеПолное;
			ОбластьМакетаШапкаДокумента.Параметры.Подр = ЭтотОбъект.ПодразделениеОрганизации.Наименование;

			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаДляШапки);
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		КолСтрок = ВыборкаРаботники.Количество();
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			Если ВыборкаДляШапки.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДетскиеПособия Тогда
				Если значениеЗаполнено(ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий) Тогда
					Физлицо	= ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий.ФИО ;
					НомерЛицевогоСчета = ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий.НомерСчета;
					Сумма = ВыборкаРаботники.Сумма;
					ОбластьМакетаСтрока.Параметры.Физлицо =Физлицо;
					ОбластьМакетаСтрока.Параметры.НомерЛицевогоСчета =НомерЛицевогоСчета;
					ОбластьМакетаСтрока.Параметры.Сумма =Сумма;
					ОбластьМакетаСтрока.Параметры.НомерСтроки =ВыборкаРаботники.НомерСтроки;
					
				Иначе
					ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);
				КонецЕсли;
			ИначеЕсли ВыборкаДляШапки.ХарактерВыплаты  = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
				НомерЛицевогоСчета = ВыборкаРаботники.НомерСчета;
				Сумма = ВыборкаРаботники.Сумма;
				ОбластьМакетаСтрока.Параметры.Физлицо =ВыборкаРаботники.Получатель;
				ОбластьМакетаСтрока.Параметры.НомерЛицевогоСчета =НомерЛицевогоСчета;
				ОбластьМакетаСтрока.Параметры.Сумма =Сумма;
				ОбластьМакетаСтрока.Параметры.НомерСтроки =ВыборкаРаботники.НомерСтроки; 
			Иначе
				ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);
			КонецЕсли;
			
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				
				ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
				//Островская Татьяна 10.04.2013 № 16392
				
				
				СтруктураОтветственный = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизации(ВыборкаДляШапки.Организация);
				для Каждого стрОтветств из СтруктураОтветственный Цикл 
					если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
						ОбластьМакетаИтогПоСтранице2.Параметры.ФИОГлБуха = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
						
						//Аверсон ЕАЕ 23.07.2025 СВФР-016871
						//Климовичи
						Если Организация.ИНН = "700103211" Тогда
							ОбластьМакетаИтогПоСтранице2.Параметры.ДолжнБух = СокрЛП(стрОтветств.Должность);	
						КонецЕсли;
						//Аверсон СВФР-016316
						
					КонецЕсли;
					если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
						ОбластьМакетаИтогПоСтранице2.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
						
						//Аверсон ЕАЕ 23.07.2025 СВФР-016316
						//Климовичи
						Если Организация.ИНН = "700103211" Тогда
							ОбластьМакетаИтогПоСтранице2.Параметры.ДолжнРук = СокрЛП(стрОтветств.Должность);	
						КонецЕсли;
						//Аверсон СВФР-016316
						
					КонецЕсли;
				КонецЦикла;
				//Островская Татьяна 10.04.2013 № 16392
				ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице2);//Островская Татьяна 18.04.2013 № 16392
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаШапка);
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;                                                    
			
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
			Итого = Итого + ВыборкаРаботники.Сумма;
			
		КонецЦикла;
		
		Если ВыведеноСтрок > 0 Тогда 
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
			//Островская Татьяна 10.04.2013 № 16392
			
			//	
			//СтруктураОтветственный = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизации(ВыборкаДляШапки.Организация);
			//для Каждого стрОтветств из СтруктураОтветственный Цикл 
			//	если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
			//		ОбластьМакетаИтогПоСтранице.Параметры.ФИОГлБуха = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
			//	КонецЕсли;
			//	если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
			//		ОбластьМакетаИтогПоСтранице.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
			//	КонецЕсли;
			//КонецЦикла;
			//Островская Татьяна 10.04.2013 № 16392
		КонецЕсли;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		ОбластьМакетаПодвал.Параметры.Итого = Итого;
		//Островская Татьяна 10.04.2013 № 16392
		СтруктураОтветственный = ФормированиеПечатныхФорм.ОтветственныеЛицаОрганизации(ВыборкаДляШапки.Организация);
		для Каждого стрОтветств из СтруктураОтветственный Цикл 
			если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
				ОбластьМакетаПодвал.Параметры.ФИОГлБуха = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
				
				//Аверсон ЕАЕ 23.07.2025 СВФР-016871
				//Климовичи
				Если Организация.ИНН = "700103211" Тогда
					ОбластьМакетаПодвал.Параметры.ДолжнБух = СокрЛП(стрОтветств.Должность);	
				КонецЕсли;
				//Аверсон СВФР-016316
				
			КонецЕсли;
			если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
				ОбластьМакетаПодвал.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(стрОтветств.Сотрудник).ФИО;
				
				//Аверсон ЕАЕ 23.07.2025 СВФР-016316
				//Климовичи
				Если Организация.ИНН = "700103211" Тогда
					ОбластьМакетаПодвал.Параметры.ДолжнРук = СокрЛП(стрОтветств.Должность);	
				КонецЕсли;
				//Аверсон СВФР-016316
				
			КонецЕсли;
		КонецЦикла;
		//Островская Татьяна 10.04.2013 № 16392
		//толик
		ОбластьМакетаПодвал.Параметры.Банк = ЭтотОбъект.Банк.НаименованиеПолное;
		ОбластьМакетаПодвал.Параметры.Перечислено = "Перечислено ("+РаботаСДиалогами.СформироватьСуммуПрописью(Итого, Константы.ВалютаРегламентированногоУчета.Получить())+")";
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьСписокПеречислений()
	
	
	// Функция формирует текстовый файл в банк
	//
	////
	Функция ФормированиеФайлаВбанк()
		
		ТекстДокумент = Новый ТекстовыйДокумент;
		
		ЗапросПоПлатежнымДокументам = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.ПеречислениеЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость = &Ведомость
		|	И ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка.Проведен";
		
		ЗапросПоПлатежнымДокументам.Текст = ТекстЗапроса;
		ЗапросПоПлатежнымДокументам.УстановитьПараметр("Ведомость", Ссылка);
		РезультатЗапроса = ЗапросПоПлатежнымДокументам.Выполнить().Выгрузить();
		
		НомерПП = ""; ДатаПП = "";
		Если РезультатЗапроса.Количество() > 0 Тогда
			НомерПП = СокрЛП(РезультатЗапроса[0].Ссылка.Номер);
			ДатаПП = Формат(РезультатЗапроса[0].Ссылка.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ТекстДокумент.ВставитьСтроку(1, "A=" + НомерПП);
		ТекстДокумент.ВставитьСтроку(2, "B=" + Формат(Дата, "ДФ=dd.MM.yyyy"));	
		ТекстДокумент.ВставитьСтроку(3, "C=Приложение к платежному поручению N " + НомерПП + " от " + ДатаПП);	
		ТекстДокумент.ВставитьСтроку(4, "C=Список N 1 от " + Формат(Дата, "ДФ=dd.MM.yyyy") + " сотрудников получающих " + Строка(ХарактерВыплаты) + ?(ДатаНачала <> Дата(1,1,1), " за " + Формат(ДатаНачала, "ДФ='MMMM yyyy'"), ""));	
		ТекстДокумент.ВставитьСтроку(5, "C=по пластиковым карточкам");	
		
		ВыборкаРаботники = СформироватьЗапросДляПечатиПеречняПеречислений().Выбрать();
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		КолСтрок = ВыборкаРаботники.Количество();
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			
			Итого = Итого + ВыборкаРаботники.Сумма;
			
			//добавляем строкут в файл
			Запрос = Новый Запрос;
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Код
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО СотрудникиОрганизаций.Физлицо = ФизическиеЛица.Ссылка
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаРаботники.ФизЛицо);
			Запрос.Текст = ТекстЗапроса;
			ТН = Запрос.Выполнить().Выгрузить();
			
			ТекстДокумент.ВставитьСтроку(ВыборкаРаботники.НомерСтроки + 5, "D=" + Формат(ТН[0].Код,"ЧГ=0") + "@" + ВыборкаРаботники.НомерЛицевогоСчета + "@" + ВРег(ВыборкаРаботники.ФизЛицо.Наименование) + "@" + Формат(ВыборкаРаботники.Сумма, "ЧГ=0"));
			//
		КонецЦикла;
		
		//добавляем строку с итогом в файл
		ТекстДокумент.ВставитьСтроку(КолСтрок + 6, "E=" + Формат(Итого, "ЧГ=0"));	
		//записываем файл
		ЗапросПутьКФайлу = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ПутьКФайламБанк
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		
		ЗапросПутьКФайлу.УстановитьПараметр("Организация", Организация);
		
		ЗапросПутьКФайлу.Текст = ТекстЗапроса; 
		
		ПутьКФайламБанка = ЗапросПутьКФайлу.Выполнить().Выгрузить();
		
		Если Не ЗначениеЗаполнено(ПутьКФайламБанка[0].ПутьКФайламБанк) Тогда
			Сообщить("Не указан путь к файлам банка в учетной политике по персоналу организаций");
		Иначе
			ТекстДокумент.Записать(СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ "ZARPL.txt", КодировкаТекста.OEM);
			Сообщить("Файл сохранен: " + СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ "ZARPL.txt");
		КонецЕсли;
		
	КонецФункции // ФормированиеФайлаВбанк()
	
	// Функция формирует текстовый файл для ЗП Белагропромбанк
	// №14657 18.01.2012 , Дыма 
	////
	Функция ФормированиеФайлаЗПБелагропромбанк()
		
		ТекстДокумент = Новый ТекстовыйДокумент;
		
		ЗапросПоПлатежнымДокументам = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.ПеречислениеЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ведомость = &Ведомость
		|	И ПлатежноеПоручениеИсходящееПеречислениеЗаработнойПлаты.Ссылка.Проведен";
		
		ЗапросПоПлатежнымДокументам.Текст = ТекстЗапроса;
		ЗапросПоПлатежнымДокументам.УстановитьПараметр("Ведомость", Ссылка);
		РезультатЗапроса = ЗапросПоПлатежнымДокументам.Выполнить().Выгрузить();
		
		ВыборкаРаботники = СформироватьЗапросДляПечатиПеречняПеречислений().Выбрать();
		
		// выводим данные по строкам документа.
		Пока ВыборкаРаботники.Следующий() Цикл
			
			//добавляем строку в файл
			Запрос = Новый Запрос;
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Код
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
			|		ПО СотрудникиОрганизаций.Физлицо = ФизическиеЛица.Ссылка
			|ГДЕ
			|	ФизическиеЛица.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ВыборкаРаботники.ФизЛицо);                                                                                                                                                                                                                                                                  
			Запрос.Текст = ТекстЗапроса;
			ТН = Запрос.Выполнить().Выгрузить();
			Если ЗначениеЗаполнено(ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий) и Ссылка.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДетскиеПособия Тогда 
				Физик = СокрЛП(ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий.ФИО); 
				НомерСчета = СокрЛП(ВыборкаРаботники.ФизЛицо.ПолучательДетскихПособий.НомерСчета);
			ИначеЕсли Ссылка.ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
				Физик = СокрЛП(ВыборкаРаботники.Получатель1); 
				НомерСчета = СокрЛП(ВыборкаРаботники.НомерСчета);   				
			Иначе
				Физик = СокрЛП(ВыборкаРаботники.ФизЛицо.Наименование); 
				НомерСчета = СокрЛП(ВыборкаРаботники.НомерЛицевогоСчета);
			КонецЕсли;
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
			ТекстДокумент.ВставитьСтроку(ВыборкаРаботники.НомерСтроки,Сред(НомерСчета,20,3)+","+НомерСчета + "," + Физик + "," + Формат(ВыборкаРаботники.Сумма, "ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления)+"; ЧГ=0; ЧРД=."));
		КонецЦикла;
		
		
		//записываем файл
		ЗапросПутьКФайлу = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ПутьКФайламБанк
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		
		ЗапросПутьКФайлу.УстановитьПараметр("Организация", Организация);
		
		ЗапросПутьКФайлу.Текст = ТекстЗапроса; 
		
		ПутьКФайламБанка = ЗапросПутьКФайлу.Выполнить().Выгрузить();
		
		Если Не ЗначениеЗаполнено(ПутьКФайламБанка[0].ПутьКФайламБанк) Тогда
			Сообщить("Не указан путь к файлам банка в учетной политике по персоналу организаций");
		Иначе
			ТекстДокумент.Записать(СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ "SPISOK BelA.txt", КодировкаТекста.OEM);
			Сообщить("Файл сохранен: " + СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ "SPISOK BelA.txt");
		КонецЕсли;
		
	КонецФункции // ФормированиеФайлаВбанк()
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		// Получить экземпляр документа на печать
		Если ИмяМакета = "Т53" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				Предупреждение("Платежная ведомость Т-53 формируется только при выплате через кассу!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьТ53();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Платежная ведомость Т-53 "));
			//толик		
		ИначеЕсли ИмяМакета = "Т53Подр" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				Предупреждение("Платежная ведомость Т-53 формируется только при выплате через кассу!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьТ53Подр();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Платежная ведомость Т-53 "));
		ИначеЕсли ИмяМакета = "Т49" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				Предупреждение("Расчетно-платежная ведомость Т-49 формируется только при выплате через кассу!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьТ49();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Платежная ведомость Т-49 "));
			
		ИначеЕсли ИмяМакета = "КО2" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				Предупреждение("РКО формируются только при выплате через кассу!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьРКО();
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Расходные кассовые ордера "));
			КонецЕсли;
			
			
		ИначеЕсли ИмяМакета = "Реестр" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				Предупреждение("Реестр депонированных сумм формируется только при выплате через кассу!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьРеестр();
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Реестр депонированных сумм "));
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "ПереченьСокр" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
				Предупреждение("Список плательщиков в банк формируется только при выплате через банк!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьСписокПеречислений(Истина); // в параметре передается вариант вывода ФИО
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Список плательщиков в банк "));
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "ПереченьПолностью" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
				Предупреждение("Список плательщиков в банк формируется только при выплате через банк!");
				Возврат Неопределено;
			КонецЕсли;
			
			ТабДокумент = ПечатьСписокПеречислений(Ложь); // в параметре передается вариант вывода ФИО
			Если ТабДокумент.ВысотаТаблицы > 0 Тогда
				Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,"Список плательщиков в банк "));
			КонецЕсли;
		ИначеЕсли ИмяМакета = "ФормированиеФайлаВБанк" тогда
			
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
				Предупреждение("Файл в банк формируется только при выплате через банк!");
				Возврат Неопределено;
			КонецЕсли;
			
			ФормированиеФайлаВбанк(); 
		ИначеЕсли ИмяМакета = "ФормированиеФайлаЗПБелагропромбанк" Тогда  // №14657 18.01.2012 , Дыма 
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
				Предупреждение("Файл в банк формируется только при выплате через банк!");
				Возврат Неопределено;
			КонецЕсли;
			
			ФормированиеФайлаЗПБелагропромбанк(); 
		ИначеЕсли ИмяМакета = "РПВ" Тогда 
			ФормаОтчета = Справочники.ВнешниеОбработки.НайтиПоНаименованию("РПВ");
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = ФормаОтчета.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			ФормаО = ВнешниеОтчеты.ПолучитьФорму(ИмяФайла);
			ФормаО.Открыть();
			ФормаО.ОтборСотрудника = Истина;
			ФормаО.ВидСравненияСотрудника = ВидСравнения.ВСписке;
			Сотрудники = Новый СписокЗначений;
			ФормаО.Сотрудник = Новый СписокЗначений; 
			Для каждого стрСотр Из Зарплата Цикл
				ЗапросСотр = Новый Запрос;
				ЗапросСотр.Текст = 
				"ВЫБРАТЬ
				|	СотрудникиОрганизаций.Ссылка
				|ИЗ
				|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				|ГДЕ
				|	СотрудникиОрганизаций.Физлицо = &Физлицо";
				
				ЗапросСотр.УстановитьПараметр("Физлицо", стрСотр.Физлицо);
				РезультатСотр = ЗапросСотр.Выполнить().Выбрать();	
				Пока РезультатСотр.Следующий() Цикл
					ФормаО.Сотрудник.Добавить(РезультатСотр.Ссылка);
				КонецЦикла;
				
			КонецЦикла;
		ИначеЕсли ИмяМакета = "МакетРублиЧ" тогда
			
			ТабДокумент = ПечатьРублиЧ();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,""));
			
		КонецЕсли;
		
	КонецФункции // Печать
	
#КонецЕсли

// Функция возвращает общую часть запроса, присоединяемую при условии ограничения по банку 
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ТекстСоединенияБанк(Ограничиваемое = "ВзаиморасчетыСРаботникамиОрганизацииОстатки", ПроверкаБанка = Ложь) //СВЭЙ 27.05.2024 КВВ СВФР-013110 (ПроверкаБанка)
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда // задан банк
		ТТТ = "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
		|		ПО ЛицевыеСчетаРаботниковОрганизации.Физлицо  = " + Ограничиваемое + ".ФизЛицо 
		|		И ЛицевыеСчетаРаботниковОрганизации.Организация = &парамОрганизация ";
		
		//СВЭЙ 27.05.2024 КВВ СВФР-013110 (
		Если ПроверкаБанка Тогда
			ТТТ = ТТТ + "
			|		И ЛицевыеСчетаРаботниковОрганизации.Банк = &БанкДока";
			
			//Аверсон ЕАЕ 08.01.2026
			Если ПоОсновномуРС Тогда
				ТТТ = ТТТ + "
					|       И (ЛицевыеСчетаРаботниковОрганизации.ОсновнойРС = Истина
					|       ИЛИ ЛицевыеСчетаРаботниковОрганизации.Физлицо В (&СписокСОднимРС))
					|";
			КонецЕсли;
			//Аверсон 08.01.2026
			
		КонецЕсли;
		//СВЭЙ 27.05.2024 КВВ СВФР-013110 )
		
		Возврат ТТТ;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции // 

// Функция возвращает общую часть запроса, присоединяемую при условии ограничения по банку 
//
// Возвращаемое значение:
//   Текст запроса
//
Функция ТекстОграниченияБанк(ПризнакМножестваОграничений = "И", ПолеУсловия = "РаботникиОрганизаций.Физлицо") 
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда // задан банк	
		Возврат " " + ПризнакМножестваОграничений + " ЛицевыеСчетаРаботниковОрганизации.Банк = &Банк "
		+ ?(ПоОсновномуРС,"И (ЛицевыеСчетаРаботниковОрганизации.ОсновнойРС = ИСТИНА ИЛИ ЛицевыеСчетаРаботниковОрганизации.ФизЛицо В (&СписокСОднимРС))",""); //Аверсон 12.04.2021 КВВ СВФР-007440
	Иначе
		//Толик
		//		Возврат "";
		Возврат " " + ПризнакМножестваОграничений + " " + ПолеУсловия + " НЕ В(
		|ВЫБРАТЬ
		|	ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
		|ИЗ
		|	РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации)";
	КонецЕсли;
КонецФункции // Печать

Процедура Автозаполнение() Экспорт
	
	НельзяАвтозаполнять = Ложь; // для возврата из процедуры, если проверка покажет, что обязательные реквизиты не заполнены
	ДатаОкончания = КонецДня(ДатаОкончания);
	
	Если Организация.Пустая() Тогда 
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!");
		НельзяАвтозаполнять = Истина;
	КонецЕсли;
	
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк И НЕ ЗначениеЗаполнено(Банк) Тогда // должен был быть задан банк
		ОбщегоНазначения.СообщитьОбОшибке("Не указан банк!");
		НельзяАвтозаполнять = Истина;
	КонецЕсли;
	
	Если НельзяАвтозаполнять Тогда
		Возврат;
	КонецЕсли;
	
	Зарплата.Очистить();
	ВыплатаАвансаПроцентом = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ВыплатаАвансаПроцентом");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамОрганизация", Организация);
	Запрос.УстановитьПараметр("парамДата",		  Макс(Дата,КонецМесяца(ПериодРегистрации) + 1));
	Запрос.УстановитьПараметр("парамМесяц",		  ПериодРегистрации);
	Запрос.УстановитьПараметр("Банк",			  Банк);
	Запрос.УстановитьПараметр("парамВыплатаАвансаПроцентом",			  ВыплатаАвансаПроцентом);
	
	Если Не ПодразделениеОрганизации.Пустая() Или ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс Тогда
		Запрос.УстановитьПараметр("парамПодразделениеОрганизации",ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	КонецЕсли;
	
	СписокСОднимРС = Новый СписокЗначений; //Аверсон 27.11.2022 КВВ СВФР-009907 (вынесено из условия)
	//Аверсон 12.04.2021 КВВ СВФР-007440 (    
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк И ПоОсновномуРС Тогда    
		З = Новый Запрос;
		З.Текст = "
		|ВЫБРАТЬ 
		|ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
		|СУММА(1) КАК КолвоРС
		|ПОМЕСТИТЬ ВтКолвоРС
		|ИЗ РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
		|СГРУППИРОВАТЬ ПО
		|ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
		|;
		|ВЫБРАТЬ
		|ВтКолвоРС.ФизЛицо КАК ФизЛицо
		|ИЗ ВтКолвоРС КАК ВтКолвоРС
		|ГДЕ 
		|ВтКолвоРС.КолвоРС = 1";
		РезЗ = З.Выполнить().Выгрузить();
		
		СписокСОднимРС.ЗагрузитьЗначения(РезЗ.ВыгрузитьКолонку("ФизЛицо"));
		Запрос.УстановитьПараметр("СписокСОднимРС",	СписокСОднимРС);
	КонецЕсли;
	//Аверсон 12.04.2021 КВВ СВФР-007440 )
	
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс Тогда
		//Островская Татьяна 24.12.2013 № 16992
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиОрганизаций.Физлицо,
		|	ВЫБОР 
		|		КОГДА &парамВыплатаАвансаПроцентом 
		|		  ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка*АвансыРаботникамОрганизаций.СуммаАванса/100 КАК ЧИСЛО(15,0))
		|		ИНАЧЕ  АвансыРаботникамОрганизаций.СуммаАванса КОНЕЦ КАК Сумма, 
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ИСТИНА КАК Авторасчет,
		|	РаботникиОрганизаций.ТабНомер
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо,
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабНомер,
		|	    РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&парамМесяц,
		|			Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|			    И Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|        ВЫБОР
		|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
		|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделениеЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ОбособленноеПодразделение
		|		КОНЕЦ = &парамОрганизация
		|		И 
		|		ВЫБОР 
		|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
		|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
		|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния 
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизаций.Сотрудник.Физлицо,
		|		РаботникиОрганизаций.Сотрудник.Код,
		|		РаботникиОрганизаций.Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.ОбособленноеПодразделение = &парамОрганизация
		|		И РаботникиОрганизаций.Организация = &парамГоловнаяОрганизация
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
		|		И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|		И РаботникиОрганизаций.Период МЕЖДУ &парамМесяц И &парамДата) КАК РаботникиОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамМесяц) КАК АвансыРаботникамОрганизаций
		|		ПО РаботникиОрганизаций.Физлицо = АвансыРаботникамОрганизаций.Физлицо" + ТекстСоединенияБанк("РаботникиОрганизаций") +"
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&парамМесяц) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
		|		ПО РаботникиОрганизаций.Физлицо = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
		|			И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
		//Островская Татьяна 17.02.2014 № 17118
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
		//Островская Татьяна 17.02.2014 № 17118
		|ПО РаботникиОрганизаций.Сотрудник = Увольнение.Сотрудник";
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			Сотрудники.Физлицо КАК Физлицо,
			|           ВЫБОР
			|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|						ИНАЧЕ 	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
			|			КОНЕЦ КАК ПодразделениеОрганизации	
			|		ИЗ
			|			(ВЫБРАТЬ
			|				РаботникиОрганизаций.Сотрудник КАК Сотрудник,
			|				ДатыДвижений.Физлицо КАК Физлицо
			|			ИЗ
			|				(ВЫБРАТЬ
			|					МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период,
			|					РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо,
			|					РаботникиОрганизаций.Организация КАК Организация
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|				ГДЕ
			|					РаботникиОрганизаций.Организация = &парамГоловнаяОрганизация
			|                   И РаботникиОрганизаций.Период <= &парамДата
			|					И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|					И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
			|				
			|				СГРУППИРОВАТЬ ПО
			|					РаботникиОрганизаций.Сотрудник.Физлицо,
			|					РаботникиОрганизаций.Организация) КАК ДатыДвижений
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|					ПО ДатыДвижений.Период = РаботникиОрганизаций.Период
			|						И ДатыДвижений.Организация = РаботникиОрганизаций.Организация
			|						И ДатыДвижений.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
			|						И (РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|						И (РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))) КАК Сотрудники
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|				ПО Сотрудники.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник) КАК ПодразделенияСотрудников
			|		ПО РаботникиОрганизаций.Физлицо = ПодразделенияСотрудников.Физлицо
			|ГДЕ
			//|	ПодразделенияСотрудников.ПодразделениеОрганизации = &парамПодразделениеОрганизации" + ТекстОграниченияБанк();
			|	ПодразделенияСотрудников.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)" + ТекстОграниченияБанк();
		Иначе
			Запрос.Текст = Запрос.Текст + ТекстОграниченияБанк("ГДЕ")+" И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1";
		КонецЕсли;
		
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ РаботникиОрганизаций.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|                                                                          
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " РаботникиОрганизаций.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		//О.Т. Аверсон 26.09.2017 № 
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.АмортизацияАвто Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПоАмортизацииАвтомобилейСрезПоследних.Сотрудник.ФизЛицо как ФизЛицо,
		|	ИСТИНА КАК Авторасчет,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ДанныеПоАмортизацииАвтомобилейСрезПоследних.Сотрудник.Код КАК ТабНомер,
		|	ДанныеПоАмортизацииАвтомобилейСрезПоследних.СуммаВыплаты КАК Сумма
		|ИЗ
		|	РегистрСведений.ДанныеПоАмортизацииАвтомобилей.СрезПоследних КАК ДанныеПоАмортизацииАвтомобилейСрезПоследних
		|ГДЕ
		|	ДанныеПоАмортизацииАвтомобилейСрезПоследних.Период МЕЖДУ &Период И &Период1";
		Запрос.УстановитьПараметр("Период",НачалоМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("Период1",КонецМесяца(ПериодРегистрации));
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		//О.Т. Аверсон 26.09.2017 № 
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ИСТИНА КАК Авторасчет,
		|	РаботникиОрганизаций1.Сотрудник.Код как ТабНомер
		|ИЗ
		|	РегистрНакопления.РасчетПервойПоловиныМесяца.Обороты(
		|		&парамДатаНачала,
		|		&парамДатаОкончания,
		|		Месяц,
		|		Организация = &парамОрганизация";
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|		    И Физлицо В
			|				(ВЫБРАТЬ
			|					РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДатаКадровая, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|						И Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДатаКадровая
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
			|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|					И ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДатаКадровая
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|					КОНЕЦ = &парамПодразделениеОрганизации)"
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|					КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации) )"
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		Запрос.Текст = Запрос.Текст + "
		|	) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки" + ТекстСоединенияБанк() + " 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций1
		//Островская Татьяна 17.02.2014 № 17118
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
		|			ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
		//Островская Татьяна 17.02.2014 № 17118
		|	ПО РаботникиОрганизаций1.Сотрудник = Увольнение.Сотрудник
		
		|	ПО ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо = РаботникиОрганизаций1.Сотрудник.Физлицо
		|ГДЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОборот > 0 И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 И НЕ РаботникиОрганизаций1.Сотрудник.Физлицо В
		|	(ВЫБРАТЬ
		|		ЛицевыеСчетаРаботниковОрганизации.ФизЛицо
		|	ИЗ
		|		РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации)";
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		//Островская Татьяна 24.12.2013 № 16992
		Запрос.УстановитьПараметр("парамДатаНачала", ПериодРегистрации);
		Запрос.УстановитьПараметр("парамДатаОкончания", КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("парамДатаКадровая", КонецДня(ПериодРегистрации + (Цел(День(КонецМесяца(ПериодРегистрации)) / 2) - 1) * 86400));   
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Тогда
		
		Запрос.Текст = 
		"
		//Аверсон 20.07.2021 КВВ СВФР-007883 (
		|ВЫБРАТЬ
		|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо КАК ФизЛицо,
		|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК Код
		|ПОМЕСТИТЬ ВтДогПодр
		|ИЗ
		|Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|ГДЕ
		
		//СВЭЙ 21.02.2024 КВВ СВФР-012387 (
		//|ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамМесяц
		//|И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамМесяц
		|НАЧАЛОПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,МЕСЯЦ) <= &парамМесяц
		|И НАЧАЛОПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,МЕСЯЦ) >= &парамМесяц
		//СВЭЙ 21.02.2024 КВВ СВФР-012387 )
		
		|И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
		|И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация";
		Если Не ПодразделениеОрганизации.Пустая() Тогда 
			Запрос.Текст = Запрос.Текст + "
			|И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|;
		//Аверсон 20.07.2021 КВВ СВФР-007883 )
		
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо,
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование КАК НаимФЛ,  //Аверсон 20.07.2021 КВВ СВФР-007883
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ИСТИНА КАК Авторасчет,
		
		//Аверсон 20.07.2021 КВВ СВФР-007883 (
		//|	РаботникиОрганизаций.Сотрудник.Код как ТабНомер
		|ВЫБОР КОГДА
		|ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) <> 1 
		|И ВзаиморасчетыСРаботникамиОрганизацииОстатки.ФизЛицо В
		|(Выбрать ВтДогПодр.ФизЛицо Из ВтДогПодр)
		|ТОГДА
		|""""
		|ИНАЧЕ
		|РаботникиОрганизаций.Сотрудник.Код 
		|КОНЕЦ      как ТабНомер
		//Аверсон 20.07.2021 КВВ СВФР-007883 )
		
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
		//заявка №2074 (база заявок Кристалла) Дмитрук О.Г.
		//|		&парамДата,
		|		&парамДатаРегистрации,
		//заявка №2074
		|		Организация = &парамОрганизация";
		Если УчетЗадолженностиПоМесяцам Тогда
			Запрос.Текст = Запрос.Текст + "
			|			И ПериодВзаиморасчетов = &парамМесяц";
		КонецЕсли;
		Если Не ПодразделениеОрганизации.Пустая() Тогда 
			Запрос.Текст = Запрос.Текст + "
			|			И Физлицо В
			|				(ВЫБРАТЬ
			|					РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДатаРегистрации, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|						И Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДатаРегистрации
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
			|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|					И ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДатаРегистрации
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|					КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			|		
			|				ОБЪЕДИНИТЬ ВСЕ
			|		
			|				ВЫБРАТЬ
			|					ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
			|				ИЗ
			|					Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
			|				ГДЕ                                                     
			|					ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамМесяц    //Аверсон 20.07.2021 КВВ СВФР-007883 было &парамДатаРегистрации
			|					И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамМесяц //Аверсон 20.07.2021 КВВ СВФР-007883 было &парамДатаРегистрации
			|					И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
			|					И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация
			//|					И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации = &парамПодразделениеОрганизации)"
			|					И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации))"
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		//толик		
		//Островская Татьяна 24.12.2013 № 16992
		|	) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки" + ТекстСоединенияБанк() + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		//Островская Татьяна 17.02.2014 № 17118
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
		|			ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
		//Островская Татьяна 17.02.2014 № 17118
		|	ПО РаботникиОрганизаций.Сотрудник = Увольнение.Сотрудник
		
		|	ПО ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|ГДЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток > 0 
		
		//Аверсон 20.07.2021 КВВ СВФР-007883 (
		//|И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1" 
		|И (ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 
		|ИЛИ 
		|(ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) <> 1 
		|И ВзаиморасчетыСРаботникамиОрганизацииОстатки.ФизЛицо В
		|(Выбрать ВтДогПодр.ФизЛицо Из ВтДогПодр)))"
		//Аверсон 20.07.2021 КВВ СВФР-007883 )
		
		+ ТекстОграниченияБанк(, "ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо");
		
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|СГРУППИРОВАТЬ ПО
		|Увольнение.ДатаУвольнения,
		|ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо,
		|РаботникиОрганизаций.Сотрудник.Код";
		//Аверсон 20.07.2021 КВВ СВФР-007883 ( (закомментировано)
		//|УПОРЯДОЧИТЬ ПО";
		////Островская Татьяна 24.12.2013 № 16992
		//если Организация.ИНН = "100765738" Тогда 
		//	Запрос.Текст = Запрос.Текст + " ТабНомер";
		//иначе
		//	Запрос.Текст = Запрос.Текст + " ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование";
		//КонецЕсли;
		////Островская Татьяна 24.12.2013 № 16992
		//Аверсон 20.07.2021 КВВ СВФР-007883 ) (закомментировано)
		
		Запрос.УстановитьПараметр("парамДатаРегистрации", КонецМесяца(ПериодРегистрации) + 1);
		
		//Аверсон 20.07.2021 КВВ СВФР-007883 (
		//Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		ТЗЗ = Запрос.Выполнить().Выгрузить();
		если Организация.ИНН = "100765738" Тогда
			ТЗЗ.Сортировать("ТабНомер");
		Иначе
			ТЗЗ.Сортировать("НаимФЛ");
		КонецЕсли;
		Зарплата.Загрузить(ТЗЗ);
		//Аверсон 20.07.2021 КВВ СВФР-007883 )
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Задолженность И НЕ УчетЗадолженностиПоМесяцам Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ИСТИНА КАК Авторасчет,
		|	РаботникиОрганизаций.Сотрудник.Код как ТабНомер
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
		|		&парамМесяц,
		|		Организация = &парамОрганизация";
		Если Не ПодразделениеОрганизации.Пустая() Тогда 
			Запрос.Текст = Запрос.Текст + "
			|			И Физлицо В
			|				(ВЫБРАТЬ
			|					РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо
			|				ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|						И Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|				ГДЕ
			|					ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
			|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|					И ВЫБОР
			|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|					КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|					КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|		
			|				ОБЪЕДИНИТЬ ВСЕ
			|		
			|				ВЫБРАТЬ
			|					ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
			|				ИЗ
			|					Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
			|				ГДЕ
			|					ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамДата
			|					И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамДата
			|					И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
			|					И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОрганизация
			|					И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации = &парамПодразделениеОрганизации)"
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		Запрос.Текст = Запрос.Текст + "
		|	) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки" + ТекстСоединенияБанк() + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ПО ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо = РаботникиОрганизаций.Сотрудник.Физлицо,
		//Островская Татьяна 17.02.2014 № 17118
		|	(ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
		//Островская Татьяна 17.02.2014 № 17118
		//толик		
		|ГДЕ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток > 0 И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1" + ТекстОграниченияБанк(, "ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо ");
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачислениеПоБольничномуЛисту.Сотрудник.Физлицо КАК Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Истина КАК Авторасчет,
		|	НачислениеПоБольничномуЛисту.Сотрудник.Код как ТАбНомер
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту" + ТекстСоединенияБанк("НачислениеПоБольничномуЛисту.Сотрудник");
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|	ПО НачислениеПоБольничномуЛисту.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			//15119 05.03.25 синт.ошибка
			Запрос.Текст = Запрос.Текст +"
			|	ЛЕВОЕ СОЕДИНЕНИЕ(ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|	ПО НачислениеПоБольничномуЛисту.Сотрудник = Увольнение.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|	КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|	И НачислениеПоБольничномуЛисту.Организация = &парамОрганизация"
		Иначе 
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +"ЛЕВОЕ СОЕДИНЕНИЕ(ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|	ПО НачислениеПоБольничномуЛисту.Сотрудник = Увольнение.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	НачислениеПоБольничномуЛисту.Организация = &парамОрганизация"
		КонецЕсли;
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ НачислениеПоБольничномуЛисту.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	И НачислениеПоБольничномуЛисту.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
		|	И НачислениеПоБольничномуЛисту.Проведен
		|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118
		//толик
		|	И НачислениеПоБольничномуЛисту.ПериодРегистрации = &парамМесяц" + ТекстОграниченияБанк(, "НачислениеПоБольничномуЛисту.Сотрудник.Физлицо ") + "
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " НачислениеПоБольничномуЛисту.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("парамДатаОкончания", КонецДня(ДатаОкончания));
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные Тогда 
		//толик	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачислениеОтпускаРаботникамОрганизаций.Сотрудник.Физлицо КАК Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Истина КАК Авторасчет,
		|	НачислениеОтпускаРаботникамОрганизаций.Сотрудник.Код как ТабНомер
		|ИЗ
		|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций" + ТекстСоединенияБанк("НачислениеОтпускаРаботникамОрганизаций.Сотрудник")+ "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамОрганизация) КАК РаботникиОрганизацийСрезПоследних
		|	ПО НачислениеОтпускаРаботникамОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
		//Островская Татьяна 17.02.2014 № 17118
		Запрос.Текст = Запрос.Текст +", ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
		|	ПО НачислениеОтпускаРаботникамОрганизаций.Сотрудник = Увольнение.Сотрудник";
		//Островская Татьяна 17.02.2014 № 17118
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|	КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|	И НачислениеОтпускаРаботникамОрганизаций.Организация = &парамОрганизация"
		Иначе 
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	НачислениеОтпускаРаботникамОрганизаций.Организация = &парамОрганизация"
		КонецЕсли;
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ НачислениеОтпускаРаботникамОрганизаций.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	И НачислениеОтпускаРаботникамОрганизаций.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
		|	И НачислениеОтпускаРаботникамОрганизаций.Проведен
		|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118
		|	И НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации = &парамМесяц" + ТекстОграниченияБанк(, "РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо") + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " НачислениеОтпускаРаботникамОрганизаций.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		
		Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Командировочные Тогда
		//Островская Татьяна 24.12.2013 № 16992
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОплатаПоСреднемуЗаработку.Сотрудник.Физлицо КАК Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Истина КАК Авторасчет,
		|	ОплатаПоСреднемуЗаработку.Сотрудник.Код как ТабНомер
		|ИЗ
		|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку" + ТекстСоединенияБанк("ОплатаПоСреднемуЗаработку.Сотрудник");
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|	ПО ОплатаПоСреднемуЗаработку.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +", (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|	КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|	И ОплатаПоСреднемуЗаработку.Организация = &парамОрганизация"
		Иначе 
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +", (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ОплатаПоСреднемуЗаработку.Организация = &парамОрганизация"
		КонецЕсли;
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ОплатаПоСреднемуЗаработку.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|	И ОплатаПоСреднемуЗаработку.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
		|	И ОплатаПоСреднемуЗаработку.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = &парамКомандировка
		|	И ОплатаПоСреднемуЗаработку.Проведен
		|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118
		//толик
		|	И ОплатаПоСреднемуЗаработку.ПериодРегистрации = &парамМесяц" + ТекстОграниченияБанк(, "ОплатаПоСреднемуЗаработку.Сотрудник.Физлицо ") + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " ОплатаПоСреднемуЗаработку.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Запрос.УстановитьПараметр("парамДатаНачала",	ДатаНачала);
		Запрос.УстановитьПараметр("парамДатаОкончания",	ДатаОкончания);
		Запрос.УстановитьПараметр("парамКомандировка",	Справочники.КлассификаторИспользованияРабочегоВремени.Командировка);
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РасчетПриУвольненииРаботникаОрганизаций.Сотрудник.Физлицо КАК Физлицо,
		|	0 КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Истина КАК Авторасчет,
		|	РасчетПриУвольненииРаботникаОрганизаций.Сотрудник.Код как ТабНомер
		|ИЗ
		|	Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизаций" + ТекстСоединенияБанк("РасчетПриУвольненииРаботникаОрганизаций.Сотрудник");
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
			|	ПО РасчетПриУвольненииРаботникаОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +", ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|	ПО РасчетПриУвольненииРаботникаОрганизаций.Сотрудник = Увольнение.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
			|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|	КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|	И РасчетПриУвольненииРаботникаОрганизаций.Организация = &парамОрганизация"
		Иначе 
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +", ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|	ПО РасчетПриУвольненииРаботникаОрганизаций.Сотрудник = Увольнение.Сотрудник";
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	РасчетПриУвольненииРаботникаОрганизаций.Организация = &парамОрганизация"
		КонецЕсли;
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ РасчетПриУвольненииРаботникаОрганизаций.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|	И РасчетПриУвольненииРаботникаОрганизаций.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
		|	И РасчетПриУвольненииРаботникаОрганизаций.Проведен
		|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118
		//толик
		|	И РасчетПриУвольненииРаботникаОрганизаций.ПериодРегистрации = &парамМесяц" + ТекстОграниченияБанк(, "РасчетПриУвольненииРаботникаОрганизаций.Сотрудник.Физлицо ") + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " РасчетПриУвольненииРаботникаОрганизаций.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Премии Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПремииРаботниковОрганизацийНачисления.Сотрудник.Физлицо КАК Физлицо,
		|	0 КАК Сумма,
		//толик		|	ПремииРаботниковОрганизацийНачисления.Результат КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	Истина КАК Авторасчет,
		|	ПремииРаботниковОрганизацийНачисления.Сотрудник.Код как ТабНомер //Островская Татьяна 24.12.2013 № 16992
		|ИЗ
		|	Документ.ПремииРаботниковОрганизаций.Начисления КАК ПремииРаботниковОрганизацийНачисления" + ТекстСоединенияБанк("ПремииРаботниковОрганизацийНачисления.Сотрудник") + " 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамОрганизация) КАК РаботникиОрганизаций
		|	ПО ПремииРаботниковОрганизацийНачисления.Сотрудник = РаботникиОрганизаций.Сотрудник ";
		
		// ПСА 09-12-2020 СВФР-006920 +++
		Если не ЗначениеЗаполнено(ДокументОснование) Тогда
			//Островская Татьяна 17.02.2014 № 17118
			Запрос.Текст = Запрос.Текст +", (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение";
			//Островская Татьяна 17.02.2014 № 17118
		КонецЕсли;
		// +++ПСА 09-12-2020 СВФР-006920
		
		Если Не ПодразделениеОрганизации.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизаций.ПериодЗавершения <= &парамДата
			|				И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
			|				ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации 
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			//|	КОНЕЦ = &парамПодразделениеОрганизации
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			// + СВЭЙ КДЯ СВФР-004644 13.08.19
			|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации)
			// - СВЭЙ КДЯ СВФР-004644 13.08.19
			|	И ПремииРаботниковОрганизацийНачисления.Ссылка = &парамСсылка"
		Иначе 
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ПремииРаботниковОрганизацийНачисления.Ссылка = &парамСсылка"
		КонецЕсли;
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ПремииРаботниковОрганизацийНачисления.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		// ПСА 09-12-2020 СВФР-006920 +++
		Если не ЗначениеЗаполнено(ДокументОснование) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118";
		КонецЕсли;
		// +++ПСА 09-12-2020 СВФР-006920
		Запрос.Текст = Запрос.Текст + "
		|	И ПремииРаботниковОрганизацийНачисления.Ссылка.Проведен
		|	И ПремииРаботниковОрганизацийНачисления.Ссылка.ПериодРегистрации = &парамМесяц" + ТекстОграниченияБанк(, "РаботникиОрганизаций.Сотрудник.Физлицо ") + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " ПремииРаботниковОрганизацийНачисления.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		
		Запрос.УстановитьПараметр("парамСсылка", ДокументОснование);
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПрочиеРазовыеНачисления.Сотрудник.Физлицо КАК Физлицо,
		|	СУММА(ПрочиеРазовыеНачисления.Сумма) КАК Сумма,
		|	0 КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ИСТИНА КАК Авторасчет,
		|	ПрочиеРазовыеНачисления.Сотрудник.Код как ТабНомер //Островская Татьяна 24.12.2013 № 16992
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		СУММА(РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Результат) КАК Сумма
		|	ИЗ
		|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
		|	ГДЕ
		
		//  СВЭЙ СВФР-014088 СОА 25.11.24(
		//|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = &парамСсылка
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка В (&парамСсылка)
		//  СВЭЙ СВФР-014088 СОА 25.11.24)
		
		|		И РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка.Проведен
		|		И РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка.ПериодРегистрации = &парамМесяц
		|СГРУППИРОВАТЬ ПО
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник,
		|		СУММА(РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Результат) КАК Сумма
		|	ИЗ
		|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
		|	ГДЕ
		
		// СВЭЙ СВФР-014088 СОА 25.11.24(
		//|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = &парамСсылка
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка В (&парамСсылка)
		// СВЭЙ СВФР-014088 СОА 25.11.24)
		
		|		И РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка.Проведен
		|		И РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка.ПериодРегистрации = &парамМесяц
		|СГРУППИРОВАТЬ ПО
		|		РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник
		|
		|) КАК ПрочиеРазовыеНачисления" + ТекстСоединенияБанк("ПрочиеРазовыеНачисления.Сотрудник", Истина); //СВЭЙ 27.05.2024 КВВ СВФР-013110 (второй параметр ТекстСоединенияБанк())
		#Если Клиент Тогда
		Текст = "Взять данные без проверки уволенных";     /// берем данные без проверки уволенных
		Ответ = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );
		
		ПроверкаУволенных = Ложь; //Аверсон ЕАЕ 08.01.2025 СВФР-017752
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда  		
			Если Не ПодразделениеОрганизации.Пустая() Тогда
				Запрос.Текст = Запрос.Текст + "
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизацийСрезПоследних
				|	ПО ПрочиеРазовыеНачисления.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
				//Островская Татьяна 17.02.2014 № 17118
				Запрос.Текст = Запрос.Текст +", ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|ГДЕ
				|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|	ПО ПрочиеРазовыеНачисления.Сотрудник = Увольнение.Сотрудник";
				//Островская Татьяна 17.02.2014 № 17118
				Запрос.Текст = Запрос.Текст + "
				|ГДЕ
				|	ВЫБОР
				|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &парамДата
				|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
				|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации 
				//толик
				// + СВЭЙ КДЯ СВФР-004644 13.08.19
				//|	КОНЕЦ = &парамПодразделениеОрганизации" 
				// - СВЭЙ КДЯ СВФР-004644 13.08.19
				// + СВЭЙ КДЯ СВФР-004644 13.08.19
				|	КОНЕЦ В ИЕРАРХИИ (&парамПодразделениеОрганизации) "
				// - СВЭЙ КДЯ СВФР-004644 13.08.19
				+ ТекстОграниченияБанк(, "РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо ")+" И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118"; //Аверсон 13.07.2020 КВВ СВФР-006280 (.Сотрудник.Физлицо)
				
				ПроверкаУволенных = Истина; //Аверсон ЕАЕ 08.01.2025 СВФР-017752
				
			Иначе	
				////Островская Татьяна 17.02.2014 № 17118
				//Запрос.Текст = Запрос.Текст +", ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				//|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				//|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				//|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				//|ИЗ
				//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				//|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				//|ГДЕ
				//|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				//|	ПО ПрочиеРазовыеНачисления.Сотрудник = Увольнение.Сотрудник";
				////Островская Татьяна 17.02.2014 № 17118
				//Запрос.Текст = Запрос.Текст + ТекстОграниченияБанк("ГДЕ", "ПрочиеРазовыеНачисления.Сотрудник.Физлицо ")+" И ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 //Островская Татьяна 17.02.2014 № 17118";
			КонецЕсли;  
		КонецЕсли;  
		#КонецЕсли
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу и Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " И НЕ ПрочиеРазовыеНачисления.Сотрудник.Физлицо.Наименование В (&Наименование)";
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("вакансия 1 1");
			Запрос.УстановитьПараметр("Наименование",СписокВакансий);
		КонецЕсли;
		
		//Аверсон ЕАЕ 08.01.2026 СВФР-017752
		Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
			Если ПроверкаУволенных = Истина Тогда
				Запрос.Текст = Запрос.Текст + "
				|И НЕ ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета ЕСТЬ NULL";
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|ГДЕ НЕ ЛицевыеСчетаРаботниковОрганизации.НомерЛицевогоСчета ЕСТЬ NULL";
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-017752
		
		Запрос.Текст = Запрос.Текст + "
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеРазовыеНачисления.Сотрудник.Физлицо,
		|	0,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
		|	ИСТИНА,
		|	ПрочиеРазовыеНачисления.Сотрудник.Код";

		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО";
		//Островская Татьяна 24.12.2013 № 16992
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = Запрос.Текст + " ТабНомер";
		иначе
			Запрос.Текст = Запрос.Текст + " ПрочиеРазовыеНачисления.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		//Островская Татьяна 24.12.2013 № 16992
		
		Запрос.УстановитьПараметр("БанкДока", Банк); //СВЭЙ 27.05.2024 КВВ СВФР-013110
		
		// СВЭЙ СВФР-014088 СОА 25.11.24 (
		//Запрос.УстановитьПараметр("парамСсылка", ДокументОснование);
		МассивДокументов = Новый Массив;
		Если ТабличнаяЧастьДокументОснование.Количество()>0 Тогда
			Для каждого строка Из ТабличнаяЧастьДокументОснование Цикл
				МассивДокументов.Добавить(строка.Основание);		
			КонецЦикла;
		Иначе	
			МассивДокументов.Добавить(ДокументОснование);
		КонецЕсли; 		
		Запрос.УстановитьПараметр("парамСсылка", МассивДокументов);
		// СВЭЙ СВФР-014088 СОА 25.11.24 )
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		//Аверсон 15.03.2021 КВВ СВФР-007294 (
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ 
		|ПАВБ.Регистратор.ФизЛицо.Код КАК ТабНомер,
		|ПАВБ.Регистратор.ФизЛицо КАК ФизЛицо,
		|ПАВБ.Регистратор.НомерСчета КАК НомерСчета,
		|ПАВБ.Регистратор.Получатель КАК Получатель
		|ИЗ РегистрСведений.ПеречислениеАлиментовВБанк КАК ПАВБ
		|ГДЕ ПАВБ.БанкПолучатель = &БанкПолучатель
		|СГРУППИРОВАТЬ ПО
		|ПАВБ.Регистратор.ФизЛицо,
		|ПАВБ.Регистратор.НомерСчета,
		|ПАВБ.Регистратор.Получатель";
		З.УстановитьПараметр("БанкПолучатель", Банк);
		Зарплата.Загрузить(З.Выполнить().Выгрузить());
		//Аверсон 15.03.2021 КВВ СВФР-007294 )
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДетскиеПособия Тогда
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Банк", Банк);
		Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ПериодРегистрации));
		
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	СУММА(ГосударственныеПособияСрезПоследних.Размер) КАК Размер, //Сумма, убрала чтоб не заполнялось О.Т. Аверсон 21.08.2018 № 2361
			|	ИСТИНА КАК Авторасчет,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код КАК ТабНомер,
			|	Лицевые.Банк
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия.СрезПоследних(&парамНачало, ) КАК ГосударственныеПособияСрезПоследних
			|		ПО (ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И
			|			 (ВЫБОР
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида)			
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаВИЧ)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВичИнфицРебенка)
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет)
			|			КОНЕЦ = ГосударственныеПособияСрезПоследних.ВидПособия)
			//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк КАК Банк
			|		ИЗ
			|			РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			//О.Т. Аверсон 24.10.2017 № 1153 убрать
			//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|					ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация КАК Организация,
			//|					МАКСИМУМ(ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата) КАК РегистраторДата
			//|				ИЗ
			//|					РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			//|				ГДЕ
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			//|					И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата <= &парамНачало
			//|				
			//|				СГРУППИРОВАТЬ ПО
			//|					ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация) КАК ВложенныйЗапрос
			//|				ПО ЛицевыеСчетаРаботниковОрганизации.ФизЛицо = ВложенныйЗапрос.ФизЛицо
			//|					И ЛицевыеСчетаРаботниковОрганизации.Организация = ВложенныйЗапрос.Организация
			//|					И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата = ВложенныйЗапрос.РегистраторДата
			//О.Т. Аверсон 24.10.2017 № 1153
			|		ГДЕ
			|			ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|			И ЛицевыеСчетаРаботниковОрганизации.Банк = &Банк";
			//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//|			И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата <= &парамНачало
			//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			
			//Аверсон 12.04.2021 КВВ СВФР-007440 (
			Если ПоОсновномуРС Тогда
				Запрос.Текст = Запрос.Текст + "
				|И (ЛицевыеСчетаРаботниковОрганизации.ОсновнойРС = ИСТИНА 
				|ИЛИ ЛицевыеСчетаРаботниковОрганизации.ФизЛицо В (&СписокСОднимРС))"; 
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			//Аверсон 12.04.2021 КВВ СВФР-007440 )
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк) КАК Лицевые
			|		ПО НачисленияРаботниковОрганизации.Сотрудник.Физлицо = Лицевые.ФизЛицо
			//О.Т. Аверсон 04.01.2018 № 1409
			|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|ПО НачисленияРаботниковОрганизации.Сотрудник = Увольнение.Сотрудник
			
			//О.Т. Аверсон 04.01.2018 № 1409
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ Увольнение.ДатаУвольнения <= НачисленияРаботниковОрганизации.ПериодЗавершения
			|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
			|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.СпособРасчета В(&СпособРасчета)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение В(&ВидРасчетаПособие)
			|	И ЕСТЬNULL(ГосударственныеПособияСрезПоследних.ВидПособия, 1) <> 1
			//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//|	И Лицевые.Банк = &Банк
			//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код,
			|	Лицевые.Банк
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо.Наименование";
		иначе // через кассу
			Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ПериодРегистрации));
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	СУММА(ГосударственныеПособияСрезПоследних.Размер) КАК Сумма,
			|	ИСТИНА КАК Авторасчет,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код КАК ТабНомер
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия.СрезПоследних(&парамНачало, ) КАК ГосударственныеПособияСрезПоследних
			|		ПО (ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И
			|			(ВЫБОР
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаВИЧ)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВичИнфицРебенка)
			//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет)
			//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
			|			КОНЕЦ = ГосударственныеПособияСрезПоследних.ВидПособия)
			//О.Т. Аверсон 04.01.2018 № 1409
			|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|ПО НачисленияРаботниковОрганизации.Сотрудник = Увольнение.Сотрудник
			//О.Т. Аверсон 04.01.2018 № 1409
			//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк КАК Банк
			|		ИЗ
			|			РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			|		ГДЕ
			|			ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			|		СГРУППИРОВАТЬ ПО
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк) КАК Лицевые
			|		ПО НачисленияРаботниковОрганизации.Сотрудник.Физлицо = Лицевые.ФизЛицо
			//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ Увольнение.ДатаУвольнения <= НачисленияРаботниковОрганизации.ПериодЗавершения
			|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
			|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.СпособРасчета В(&СпособРасчета)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение В(&ВидРасчетаПособие)
			|	И ЕСТЬNULL(ГосударственныеПособияСрезПоследних.ВидПособия, 1) <> 1
			|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
			//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|   И Лицевые.Банк IS NULL
			//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо.Наименование";	
		КонецЕсли;
		ВидПособия = Новый СписокЗначений;
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет);
		//О.Т. Аверсон 21.07.2017 № 851
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		//О.Т. Аверсон 21.07.2017 № 851
		
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаВичИнфицРебенка);
		//О.Т. Аверсон 23.10.2017 № 1153
		
		
		Запрос.УстановитьПараметр("ВидПособияНаРебенкаДо3Лет", ВидПособия);
		СпособРасчета = Новый СписокЗначений;
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет);
		//О.Т. Аверсон 21.07.2017 № 851
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		//О.Т. Аверсон 21.07.2017 № 851
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаВИЧ);
		//О.Т. Аверсон 23.10.2017 № 1153
		
		//О.Т. Аверсон 11.06.2018 № 2061
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//Если Организация.НачислениеЕжемесячныхПособийОтдельнымДок Тогда 
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		СпособРасчета = Новый СписокЗначений;
		ВидРасчетаПособие = Новый СписокЗначений;
		для Каждого стр из Справочники.ГруппыРасчетов.ДетскиеПособия.Основные Цикл 
			СпособРасчета.Добавить(стр.ВидРасчета.СпособРасчета);
			ВидРасчетаПособие.Добавить(стр.ВидРасчета);
		КонецЦикла;
		Запрос.Текст = СтрЗаменить(запрос.Текст,"(ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И","");
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//КонецЕсли;
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//О.Т. Аверсон 11.06.2018 № 2061
		
		
		Запрос.УстановитьПараметр("ВидРасчетаПособие", ВидРасчетаПособие);
		Запрос.УстановитьПараметр("СпособРасчета", СпособРасчета);
		Запрос.УстановитьПараметр("парамНачало", ПериодРегистрации);
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		//(начало) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПособияФСС Тогда
		
		Если НЕ ЗначениеЗаполнено( ДокументОснование ) 
			ИЛИ ТипЗнч( ДокументОснование ) <> Тип( "ДокументСсылка.НачислениеЕдиновременныхПособийЗаСчетФСС" ) ИЛИ НЕ ДокументОснование.Проведен Тогда
			
			Сообщить( "Пожалуйста, укажите в поле ""по документу"" в качестве документа-основания проведенный д-т ""Начисление единовременных пособий за счет ФСЗН"" ", 
			СтатусСообщения.Важное );	
			Возврат;
			
		КонецЕсли; 
		
		
		Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	СУММА(НачисленияРаботниковОрганизации.Результат) КАК Сумма,
			|	ИСТИНА КАК Авторасчет,
			//|	МАКСИМУМ( Сотрудники.Код ) КАК ТабНомер,
			|	Лицевые.Банк
			|ИЗ (ВЫБРАТЬ Физлицо,Результат
			|	 ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления 
			|	 ГДЕ Ссылка = &ДокументОснование И Ссылка.Проведен И ВидПособия В (&ВидПособияФСС)
			|    ОБЪЕДИНИТЬ ВСЕ
			|    ВЫБРАТЬ Физлицо,Результат
			|	 ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления 
			|	 ГДЕ Ссылка = &ДокументОснование И Ссылка.Проведен 
			|	 ) КАК НачисленияРаботниковОрганизации
			|
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК Сотрудники
			//|       ПО НачисленияРаботниковОрганизации.Физлицо = Сотрудники.Физлицо
			//|          И НЕ Сотрудники.ПометкаУдаления И Сотрудники.Актуальность
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|								ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|								ЛицевыеСчетаРаботниковОрганизации.Банк КАК Банк
			|							   ИЗ
			|								РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			|							   ГДЕ
			|								ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			|								И ЛицевыеСчетаРаботниковОрганизации.Банк = &Банк";
			//Аверсон 12.04.2021 КВВ СВФР-007440 (
			Если ПоОсновномуРС Тогда
				Запрос.Текст = Запрос.Текст + "
				|И (ЛицевыеСчетаРаботниковОрганизации.ОсновнойРС = ИСТИНА 
				|ИЛИ ЛицевыеСчетаРаботниковОрганизации.ФизЛицо В (&СписокСОднимРС))"; 
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			//Аверсон 12.04.2021 КВВ СВФР-007440 )
			|		
			|							   СГРУППИРОВАТЬ ПО
			|								ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			|								ЛицевыеСчетаРаботниковОрганизации.Банк) КАК Лицевые
			|		ПО НачисленияРаботниковОрганизации.Физлицо = Лицевые.ФизЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Физлицо,
			|	Лицевые.Банк
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Физлицо.Наименование";
			
		Иначе // через кассу
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	СУММА(НачисленияРаботниковОрганизации.Результат) КАК Сумма,
			|	ИСТИНА КАК Авторасчет,
			//|	МАКСИМУМ( Сотрудники.Код ) КАК ТабНомер,
			|	Лицевые.Банк
			|ИЗ (ВЫБРАТЬ Физлицо,Результат
			|	 ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.Начисления 
			|	 ГДЕ Ссылка = &ДокументОснование И Ссылка.Проведен И ВидПособия В (&ВидПособияФСС)
			|    ОБЪЕДИНИТЬ ВСЕ
			|    ВЫБРАТЬ Физлицо,Результат
			|	 ИЗ Документ.НачислениеЕдиновременныхПособийЗаСчетФСС.ОсновныеНачисления 
			|	 ГДЕ Ссылка = &ДокументОснование И Ссылка.Проведен 
			|	 ) КАК НачисленияРаботниковОрганизации
			|
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК Сотрудники
			//|       ПО НачисленияРаботниковОрганизации.Физлицо = Сотрудники.Физлицо
			//|          И НЕ Сотрудники.ПометкаУдаления И Сотрудники.Актуальность
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|								ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|								ЛицевыеСчетаРаботниковОрганизации.Банк КАК Банк
			|							   ИЗ
			|								РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			|							   ГДЕ
			|								ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			|								И ЛицевыеСчетаРаботниковОрганизации.Банк = &Банк
			|		
			|							   СГРУППИРОВАТЬ ПО
			|								ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			|								ЛицевыеСчетаРаботниковОрганизации.Банк) КАК Лицевые
			|		ПО НачисленияРаботниковОрганизации.Физлицо = Лицевые.ФизЛицо
			|ГДЕ
			|       Лицевые.Банк IS NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Физлицо,
			|	Лицевые.Банк
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Физлицо.Наименование";
			
		КонецЕсли;
		
		ВидПособияФСС = Новый СписокЗначений;
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПриУсыновленииРебенка);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.МинимумПособияПоУходуЗаПервымРебенкомДоПолутораЛет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.МинимумПособияПоУходуЗаПоследующимРебенкомДоПолутораЛет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.МаксимумПособияПоУходуЗаРебенкомДоПолутораЛет);
		
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеМатериОдиночкеДо1_5Лет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеМатериОдиночкеДо3Лет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериНадб40До3Лет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериОдиночкеДо1_5Лет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРабМатериОдиночкеДо3Лет);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНеРаботающейМатериДо3Лет);
		
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ВСвязиСоСмертью);
		ВидПособияФСС.Добавить(Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей);
		Запрос.УстановитьПараметр("ВидПособияФСС", ВидПособияФСС);
			
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Банк", Банк);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование );
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		//(конец) добавлено Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		если ФормироватьПромежуточнуюВедомость Тогда 
			Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
			Док.Дата = Дата;
			Док.Организация = Организация;
			ТЧ1 = ДокументОснование.ОсновныеНачисления;
			ТЧ2 = ДокументОснование.Начисления;
			ТЧВедомость = Док.Начисления;
			ВременнаяТаблица = ТЧ1.Выгрузить(); 
			ВременнаяТаблица.Свернуть("Сотрудник,ВидРасчета,ДатаНачала,ДатаОкончания","Результат");

			Для Каждого Строка из ВременнаяТаблица Цикл
				СтрокаДок = ТЧВедомость.Добавить();   
				СтрокаДок.ВидРасчета = Строка.ВидРасчета; 
				СтрокаДок.Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Строка.ДатаНачала,Новый Структура("Сотрудник",Строка.Сотрудник) ).Должность;
				СтрокаДок.ПериодНачисления = Строка.ДатаНачала;
				СтрокаДок.ПериодНачисленияКонец = Строка.ДатаОкончания;
				СтрокаДок.Результат = Строка.Результат;
				СтрокаДок.ТабельныйНомер = Строка.Сотрудник.Код;
				СтрокаДок.ФизЛицо = Строка.Сотрудник.Физлицо;
			КонецЦикла;	
				ВременнаяТаблица1 = ТЧ2.Выгрузить(); 
			ВременнаяТаблица1.Свернуть("Сотрудник,Физлицо,ВидПособия,ДатаСобытия","Результат");	
			Для Каждого Строка из ВременнаяТаблица1 Цикл
				СтрокаДок = ТЧВедомость.Добавить();  
				Если Строка.ВидПособия = Перечисления.ВидыГосударственныхПособий.ВСвязиСоСмертью Тогда
					ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ВСвязиСоСмертью;
				ИначеЕсли Строка.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриПостановкеНаУчетВРанниеСрокиБеременности Тогда
					ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности
				ИначеЕсли Строка.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриРожденииРебенка Тогда
					ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка
				ИначеЕсли Строка.ВидПособия = Перечисления.ВидыГосударственныхПособий.ПриРожденииВторогоИПоследующихДетей Тогда
					ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей
				Иначе
					ВидРасчета = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка
				КонецЕсли;
				
				СтрокаДок.ВидРасчета = ВидРасчета; 
				СтрокаДок.Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Строка.ДатаСобытия,Новый Структура("Сотрудник",Строка.Сотрудник) ).Должность;
				СтрокаДок.ПериодНачисления = ДокументОснование.Дата;
				СтрокаДок.ПериодНачисленияКонец = ДокументОснование.Дата;
				СтрокаДок.Результат = Строка.Результат;
				СтрокаДок.ТабельныйНомер = Строка.Сотрудник.Код;
				СтрокаДок.ФизЛицо = Строка.Физлицо;
			КонецЦикла;	
			ТЧВедомость = Док.Начисления;
			СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
			Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
				ТЧВедомость.Удалить(ПустаяСтрока);
			КонецЦикла;	
					
			если ТЧВедомость.Количество()> 0  Тогда 	
				Если ПометкаУдаления Тогда 
					Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе	
					Попытка	
						Док.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Док.Записать(РежимЗаписиДокумента.Запись);
					КонецПопытки;
				КонецЕсли;
				ДокументВедомость = Док.Ссылка;
			КонецЕсли; 			
		КонецЕсли;
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощью ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда //Аверсон 21.02.2020 КВВ СВФР-005569 (+Единовр)
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Физлицо,
		|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
		|	ВложенныйЗапрос.Авторасчет,
		|	ВложенныйЗапрос.ТабНомер
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
		|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|		ИСТИНА КАК Авторасчет,
		|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабНомер
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
		|		И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
		|		ИСТИНА,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
		|	И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций
		|	или ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций)//О.Т. Аверсон 15.12.2017 № 1344
		|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Физлицо,
		|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
		|	ВложенныйЗапрос.Авторасчет,
		|	ВложенныйЗапрос.ТабНомер";
		
		СпособРасчета = Новый СписокЗначений;
		СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Материальная помощь"));
		СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения);//О.Т. Аверсон 15.12.2017 № 1344
		//Аверсон 21.02.2020 КВВ СВФР-005569 (
		Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда
			СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Единовременная выплата на оздоровление"));
		КонецЕсли;
		//Аверсон 21.02.2020 КВВ СВФР-005569 )
		
		Запрос.УстановитьПараметр("ВидРасчета", СпособРасчета);
		Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
		Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ВозвратНДФЛ 
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПособияФСС  //см. выше
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Дивиденды Тогда
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ЗаполнитьДокумент(ДокументОснование)
			
		КонецЕсли;
		
		//Аверсон ЕАЕ 21.10.2021 СВФР-008256
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоСпискуНаАванс Тогда
		ЗапросПоСпискуНаАванс = Новый Запрос;
		ЗапросПоСпискуНаАванс.Текст = 
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокНаАванс.ФизЛицо,
		|	СУММА(СписокНаАванс.Сумма) КАК Сумма
		|ИЗ
		|	РегистрСведений.СписокНаАванс КАК СписокНаАванс"
		+  ТекстСоединенияБанк("СписокНаАванс")  //Аверсон 27.11.2022 КВВ СВФР-009907
		+ "
		|ГДЕ СписокНаАванс.Период = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		
		//Аверсон ЕАЕ 02.09.2024 СВФР-013643
		|%УсловиеПодразделение%"
		//Аверсон СВФР-013643
		
		+ ТекстОграниченияБанк(, "СписокНаАванс.Физлицо") //Аверсон 27.11.2022 КВВ СВФР-009907
		+ "
		|СГРУППИРОВАТЬ ПО
		|	СписокНаАванс.ФизЛицо";
		
		//Аверсон ЕАЕ 02.09.2024 СВФР-013643
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			УсловиеПодразделение = "И СписокНаАванс.Регистратор.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
		Иначе 
			УсловиеПодразделение = "";
		КонецЕсли; 
		ЗапросПоСпискуНаАванс.Текст = СтрЗаменить(ЗапросПоСпискуНаАванс.Текст, "%УсловиеПодразделение%", УсловиеПодразделение);
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			ЗапросПоСпискуНаАванс.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		КонецЕсли;
		//Аверсон СВФР-013643
		
		//Аверсон 27.11.2022 КВВ СВФР-009907 (
		ЗапросПоСпискуНаАванс.УстановитьПараметр("парамОрганизация", Организация);
		ЗапросПоСпискуНаАванс.УстановитьПараметр("Банк", Банк);
		ЗапросПоСпискуНаАванс.УстановитьПараметр("СписокСОднимРС",	СписокСОднимРС);
		//Аверсон 27.11.2022 КВВ СВФР-009907 )
		
		ЗапросПоСпискуНаАванс.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		Зарплата.Загрузить(ЗапросПоСпискуНаАванс.Выполнить().Выгрузить());
		//Аверсон СВФР-008256
	КонецЕсли;
	
КонецПроцедуры //  Автозаполнение

//Аверсон-софт, Плиско Ю.А. 10.11.2014 по аналогии с  "Тарификационный список.erf" 
Процедура РасчетТарифногоОклада() Экспорт
	Перем ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга;
	
	Если Не Организация.ИНН ="100765738"  Тогда
		Возврат
	КонецЕсли; 
	
	ПовышениеТК = Истина;
	Доплаты  = Истина;  
	Надбавки  = Истина;      
	НачДата = ПериодРегистрации;//Дата;
	ПоПодразделениям = Ложь;	
	Подразделение  = ПодразделениеОрганизации;
	
	СписокПовышения = новый СписокЗначений;
	СписокНадбавки = новый СписокЗначений;
	СписокДоплаты = новый СписокЗначений;
	ТаблицаПовышения = новый ТаблицаЗначений;
	ТаблицаНадбавки = новый ТаблицаЗначений;
	ТаблицаДоплаты = новый ТаблицаЗначений;
	ТаблицаПовышения.Колонки.Добавить("ВидРасчета");
	ТаблицаПовышения.Колонки.Добавить("Коэф");
	ТаблицаПовышения.Колонки.Добавить("Сумма");
	ТаблицаНадбавки.Колонки.Добавить("ВидРасчета");
	ТаблицаНадбавки.Колонки.Добавить("Коэф");
	ТаблицаНадбавки.Колонки.Добавить("Сумма");
	ТаблицаДоплаты.Колонки.Добавить("ВидРасчета");
	ТаблицаДоплаты.Колонки.Добавить("Коэф");
	ТаблицаДоплаты.Колонки.Добавить("Сумма");
	Выборка = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Повышения Тогда
			СписокПовышения.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаПовышения.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Надбавки Тогда 
			СписокНадбавки.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаНадбавки.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Доплаты Тогда 
			СписокДоплаты.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаДоплаты.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	Выборка = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Повышения Тогда
			СписокПовышения.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаПовышения.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Надбавки Тогда 
			СписокНадбавки.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаНадбавки.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		ИначеЕсли Выборка.Доплаты Тогда 
			СписокДоплаты.Добавить(Выборка.Ссылка);
			ТекСтр = ТаблицаДоплаты.Добавить();
			ТекСтр.ВидРасчета = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПовышенияИтог = ТаблицаПовышения.Скопировать(,"ВидРасчета,Сумма");
	ТаблицаНадбавкиИтог = ТаблицаНадбавки.Скопировать(,"ВидРасчета,Сумма");
	ТаблицаДоплатыИтог = ТаблицаДоплаты.Скопировать(,"ВидРасчета,Сумма");
	
	ТаблицаПовышенияИтог.ЗаполнитьЗначения(0,"Сумма");
	ТаблицаНадбавкиИтог.ЗаполнитьЗначения(0,"Сумма");
	ТаблицаДоплатыИтог.ЗаполнитьЗначения(0,"Сумма");
	
	ТарифныйОкладОбщая = 0;
	ДолжностнойОкладОбщая = 0;
	МесОкладОбщая = 0;
	ТекущаяПремияОбщая = 0;
	ИтогоОбщая = 0;
	
	ПодразделениеСтарое = "";
	ЗапросНеВход = Новый Запрос;
	ЗапросНеВход.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК Подразделение,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.КоэффициентЕТС, 1) КАК КоэффициентЕТС,
	|	РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
	|	РаботникиОрганизацийСрезПоследних.Категория,
	|	РаботникиОрганизацийСрезПоследних.ТарифнаяСтавкаПервогоРазряда,
	|	ДопФизЛица.Специальность,
	|	ДопФизЛица.ВидСтажа,
	|	ДопФизЛица.ДатаОтсчета,
	|	РаботникиОрганизацийСрезПоследних.РазрядЕТС,
	|	ВЫБОР
	|		КОГДА Коэффициенты.Коэффициент = 0
	|				ИЛИ Коэффициенты.Коэффициент = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КорректКоэффициент.Размер = 0
	|				ИЛИ Коэффициенты.КорректКоэффициент.Размер = NULL
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(Коэффициенты.КорректКоэффициент.Размер, 1)
	|	КОНЕЦ КАК КорректКоэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.ПовышКоэффициент = 0
	|				ИЛИ Коэффициенты.ПовышКоэффициент = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.ПовышКоэффициент
	|	КОНЕЦ КАК ПовышКоэффициент,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентСложность = 0
	|				ИЛИ Коэффициенты.КоэффициентСложность = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.КоэффициентСложность
	|	КОНЕЦ КАК КоэффициентСложность,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентТехнологОперации = 0
	|				ИЛИ Коэффициенты.КоэффициентТехнологОперации = NULL
	|			ТОГДА 1
	|		ИНАЧЕ Коэффициенты.КоэффициентТехнологОперации
	|	КОНЕЦ КАК КоэффициентТехнологОперации,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабНомер,
	|	ДопФизЛица.РазмерМесяцев,
	|	ДопФизЛица.РазмерДней,
	|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок,
	|	ДопФизЛица.ВидСтажа1,
	|	ДопФизЛица.ДатаОтсчета1,
	|	ДопФизЛица.РазмерМесяцев1,
	|	ДопФизЛица.РазмерДней1,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, Сотрудник.Физлицо в (&СписокСотрудников)) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ФизическиеЛицаОбразование.Специальность КАК Специальность,
	|			NULL КАК ВидСтажа,
	|			NULL КАК ДатаОтсчета,
	|			ФизическиеЛицаОбразование.Ссылка КАК Ссылка,
	|			NULL КАК РазмерМесяцев,
	|			NULL КАК РазмерДней,
	|			NULL КАК РазмерМесяцев1,
	|			NULL КАК РазмерДней1,
	|			NULL КАК ВидСтажа1,
	|			NULL КАК ДатаОтсчета1
	|		ИЗ
	|			Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			NULL,
	|			ФизическиеЛицаСтажи.ВидСтажа,
	|			ФизическиеЛицаСтажи.ДатаОтсчета,
	|			ФизическиеЛицаСтажи.Ссылка,
	|			ФизическиеЛицаСтажи.РазмерМесяцев,
	|			ФизическиеЛицаСтажи.РазмерДней,
	|			ВложенныйЗапрос.РазмерМесяцев1,
	|			ВложенныйЗапрос.РазмерДней1,
	|			ВложенныйЗапрос.ВидСтажа1,
	|			ВложенныйЗапрос.ДатаОтсчета1
	|		ИЗ
	|			Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
	|				ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ФизическиеЛицаСтажи.ВидСтажа КАК ВидСтажа1,
	|					ФизическиеЛицаСтажи.ДатаОтсчета КАК ДатаОтсчета1,
	|					ФизическиеЛицаСтажи.РазмерМесяцев КАК РазмерМесяцев1,
	|					ФизическиеЛицаСтажи.РазмерДней КАК РазмерДней1,
	|					ФизическиеЛицаСтажи.Ссылка КАК Ссылка
	|				ИЗ
	|					Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
	|				ГДЕ
	|					ФизическиеЛицаСтажи.ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.СтажВОтрасли)) КАК ВложенныйЗапрос
	|				ПО ФизическиеЛицаСтажи.Ссылка = ВложенныйЗапрос.Ссылка
	|		ГДЕ
	|			ФизическиеЛицаСтажи.ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.НепрерывныйСтаж)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФизическиеЛицаСтажи.Ссылка,
	|			ФизическиеЛицаСтажи.ВидСтажа,
	|			ФизическиеЛицаСтажи.ДатаОтсчета,
	|			ФизическиеЛицаСтажи.РазмерМесяцев,
	|			ФизическиеЛицаСтажи.РазмерДней,
	|			ВложенныйЗапрос.РазмерМесяцев1,
	|			ВложенныйЗапрос.РазмерДней1,
	|			ВложенныйЗапрос.ВидСтажа1,
	|			ВложенныйЗапрос.ДатаОтсчета1) КАК ДопФизЛица
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ДопФизЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Ссылка КАК Ссылка,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Коэффициент КАК Коэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КорректКоэффициент КАК КорректКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.ПовышКоэффициент КАК ПовышКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентСложность КАК КоэффициентСложность,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентТехнологОперации КАК КоэффициентТехнологОперации
	|		ИЗ
	|			Справочник.ЕдинаяТарифнаяСеткаРБ.Коэффициенты КАК ЕдинаяТарифнаяСеткаРБКоэффициенты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Ссылка,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.Коэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КорректКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.ПовышКоэффициент,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентСложность,
	|			ЕдинаяТарифнаяСеткаРБКоэффициенты.КоэффициентТехнологОперации) КАК Коэффициенты
	|		ПО РаботникиОрганизацийСрезПоследних.Должность.СтрокаЕТС = Коэффициенты.Ссылка
	|	ГДЕ
	|	Выбор
	|Когда РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
	|Тогда Ложь Иначе Истина Конец
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	|   //И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|	//И РаботникиОрганизацийСрезПоследних.Сотрудник.Код МЕЖДУ &ТабНач И &ТабКон
	|
	|УПОРЯДОЧИТЬ ПО
	|//	ПодразделениеОрганизацииНаименование,
	|	ТабельныйНомер
	|ИТОГИ
	|	СУММА(КоэффициентЕТС),
	|	СУММА(ПовышенныйКоэффициентЕТС),
	|	СУММА(Коэффициент),
	|	СУММА(КорректКоэффициент),
	|	СУММА(ПовышКоэффициент),
	|	СУММА(КоэффициентСложность),
	|	СУММА(КоэффициентТехнологОперации)
	|ПО
	|	ОБЩИЕ";
	
	
	ЗапросНеВход.УстановитьПараметр("Организация", Организация);
	ЗапросНеВход.УстановитьПараметр("Дата", НачДата);
	//
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Авторасчет", Истина);
	Зарплата_ = Зарплата.НайтиСтроки(ПараметрыОтбора);
	МассивФизлицо = Новый Массив;
	Для каждого СтрЗарплата_ Из Зарплата_ Цикл
		МассивФизлицо.Добавить(СтрЗарплата_.Физлицо);
	КонецЦикла; 
	ЗапросНеВход.УстановитьПараметр("СписокСотрудников",МассивФизлицо );
	//
	ЗапросНеВход.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Если ЗначениеЗаполнено(Подразделение) или ПоПодразделениям Тогда
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//	ПодразделениеОрганизацииНаименование,","ПодразделениеОрганизацииНаименование,");
	иначе
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//	ПодразделениеОрганизацииНаименование,","");
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Подразделение) Тогда 
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации","");
	Иначе 
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.Сотрудник.Код МЕЖДУ &ТабНач И &ТабКон","");
		
		ЗапросНеВход.Текст = СтрЗаменить(ЗапросНеВход.Текст,"//И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации","И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &ПодразделениеОрганизации");
	КонецЕсли;
	
	
	РезОбщий = ЗапросНеВход.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РегистраторВыбытие = Новый СписокЗначений;
	
	результат=0; 	
	
	//#
	РазмерБазовойВеличины = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина)).Размер;
	если ЗначениеЗаполнено(Подразделение) Тогда
		ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("Организация,ТарифнаяСтавка",Подразделение.Владелец,Справочники.ТарифныеСтавкиПервогоРазряда.Основная)).Размер;
	иначе
		ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(КонецМесяца(КонецМесяца(НачДата)),Новый Структура("ТарифнаяСтавка",Справочники.ТарифныеСтавкиПервогоРазряда.Основная)).Размер;
	КонецЕсли;
	Ном = 14; 
	Н=17;
	
	ТарифнаяСтавка1Разряда = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(НачДата).Размер;
	РезОбщий.Следующий();
	РезНеВх = РезОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	пока РезНеВх.Следующий() Цикл 
		если РезНеВх.Сотрудник = Null Тогда 
			Продолжить;
		КонецЕсли;
		ЛетСтажа = 0;
		если РезНеВх.ВидСтажа = Справочники.ВидыСтажа.НепрерывныйСтаж Тогда 
			ДатаОтсчета = ДобавитьМесяц (РезНеВх.ДатаОтсчета,-РезНеВх.РазмерМесяцев)-РезНеВх.РазмерДней *24*60*60;
			ДатаВыслуги =НачДата;
			ОбщегоНазначения.РазобратьРазностьДат(ДатаВыслуги,ДатаОтсчета,ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга);
			ЛетСтажа = ГодВыслуга;
		КонецЕсли;
		ЛетСтажа1 = 0;
		Если РезНеВх.ВидСтажа1 = Справочники.ВидыСтажа.СтажВОтрасли Тогда
			ДатаОтсчета = ДобавитьМесяц (РезНеВх.ДатаОтсчета1,-РезНеВх.РазмерМесяцев1)-РезНеВх.РазмерДней1 *24*60*60;
			ДатаВыслуги = НачДата;
			ОбщегоНазначения.РазобратьРазностьДат(ДатаВыслуги,ДатаОтсчета,ГодВыслуга,МесяцВыслугаМес,ДеньВыслуга);
			ЛетСтажа1 = ГодВыслуга;
		КонецЕсли;
		
		ПечОбъемРаботыПоДолжности = РезНеВх.ЗанимаемыхСтавок;
		
		Заполнить(РезНеВх);
		Если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда
			Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(РезНеВх.Сотрудник.Наименование);
		Иначе
			Сотрудник = "ВАКАНСИЯ";
		КонецЕсли;
		
		ТарифныйОклад = ОбщегоНазначения.ОкруглитьЗначение2016(?(не (ТарифнаяСтавка1Разряда=null или ТарифнаяСтавка1Разряда=0) ,ТарифнаяСтавка1Разряда,1)*?(не (РезНеВх.Коэффициент=null или  РезНеВх.Коэффициент=0),РезНеВх.Коэффициент,1) * ?(не (РезНеВх.КорректКоэффициент=null или РезНеВх.КорректКоэффициент=0) ,РезНеВх.КорректКоэффициент,1)
		* ?(не( РезНеВх.ПовышКоэффициент=null или  РезНеВх.ПовышКоэффициент=0) ,РезНеВх.ПовышКоэффициент,1) * ?(не (РезНеВх.КоэффициентСложность=null или РезНеВх.КоэффициентСложность=0),РезНеВх.КоэффициентСложность,1) * ?(не (РезНеВх.КоэффициентТехнологОперации=null или РезНеВх.КоэффициентТехнологОперации=0),РезНеВх.КоэффициентТехнологОперации,1)*ПечОбъемРаботыПоДолжности,НачДата);//О.Т. Аверсон 14.03.2016 № 949
		ТарифныйОкладОбщая = ТарифныйОкладОбщая+ТарифныйОклад;
		
		Заполнить(РезНеВх);
		Заполнить(РезНеВх);
		
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.Текст = 
		"ВЫБРАТЬ
		|	&парамНачало КАК Период,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.Код ЕСТЬ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОсновноеНачисление,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|						ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|					ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|				КОНЕЦ
		|		ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|	КОНЕЦ КАК Действие,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель1Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель1
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель2Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель2
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель3Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель3
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель4Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель4
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель5Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель5
		|	КОНЕЦ КАК Показатель5,
		|	ВЫБОР
		|		КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|				И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НачисленияРаботниковОрганизации.Показатель6Завершения
		|		ИНАЧЕ НачисленияРаботниковОрганизации.Показатель6
		|	КОНЕЦ КАК Показатель6,
		|	НачисленияРаботниковОрганизации.Сотрудник КАК Сотрудник,
		|	НачисленияРаботниковОрганизации.ДатаНачалаСобытия КАК ДатаНачалаСобытия
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&парамНачало,
		|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И Сотрудник В (&Сотрудник)
		|				И Организация В (&Организация)) КАК НачисленияРаботниковОрганизации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И НачисленияРаботниковОрганизации.ВидРасчета В(&ВидРасчета)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидРасчета";
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокПовышения);
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		ОбщаяСумма = 0;
		ОбщаяСуммаДоплНадбавка = 0;
		ВидСтажа = 0;
		
		ЭтоПовышения=Истина;
		ЭтоНадбавка=Ложь;
		
		ТаблицаПовышения.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаПовышения.ЗаполнитьЗначения(0,"Сумма");
		
		КоэффициентПовыш = 0;
		СуммаПовыш=0;
		БылВТО = Ложь;
		
		пока РезНачисления.Следующий() Цикл 
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Стаж по специальности (отрасли)") Тогда
				КоэфПоказатель1 = 0;
				если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда 
					КоэффициентСтажа = РезНачисления.ВидРасчета.КоэффициентСтажа.ССылка;
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ШкалаКоэффициентовСтажа.Величина
					|ИЗ
					|	РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
					|ГДЕ
					|	ШкалаКоэффициентовСтажа.КоэффициентСтажа.Ссылка = &КоэффициентСтажа
					|	И ШкалаКоэффициентовСтажа.СтажС <= &Стаж
					|	И ШкалаКоэффициентовСтажа.СтажПо > &Стаж";
					
					Запрос.УстановитьПараметр("Стаж", ЛетСтажа1);
					Запрос.УстановитьПараметр("КоэффициентСтажа", КоэффициентСтажа);
					
					РезультатСтаж = Запрос.Выполнить().Выбрать();
					Пока РезультатСтаж.Следующий() Цикл
						КоэфПоказатель1 = РезультатСтаж.Величина;
					КонецЦикла;
				КонецЕсли;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
			Иначе
				КоэфПоказатель1 = РезНачисления.Показатель1;	
				Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Вредность") Тогда
					СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(РезНеВх.ЗанимаемыхСтавок*ТарифнаяСтавка1Разряда* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
				Иначе
					Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышающий коэфф") Тогда	
						Если Не БылВТО Тогда
							СуммаПовыш=ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);
						Иначе
							КоэфПоказатель1=0;
						КонецЕсли;
					ИначеЕсли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышение ВТО") Тогда		
						Если КоэфПоказатель1 > 40 Тогда
							БылВТО = ИСТИНА;
						КонецЕсли;
					КонецЕсли;
					СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
				КонецЕсли;	
			КонецЕсли;
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если ПовышениеТК Тогда
				НайденнаяСтрока = ТаблицаПовышения.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаПовышенияИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если БылВТО и Не СуммаПовыш = 0 Тогда
			ВидРасчетаПовыш = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Повышающий коэфф");
			НайденныйРасчетПовыш = СписокПовышения.НайтиПоЗначению(ВидРасчетаПовыш);
			Если Не НайденныйРасчетПовыш = Неопределено Тогда
				ОбщаяСумма = ОбщаяСумма - СуммаПовыш;
				если ПовышениеТК Тогда
					НайденнаяСтрока = ТаблицаПовышения.Найти(ВидРасчетаПовыш,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = 0;
						НайденнаяСтрока.Сумма = 0;
					КонецЕсли;
					НайденнаяСтрока1 = ТаблицаПовышенияИтог.Найти(ВидРасчетаПовыш,"ВидРасчета");
					Если не НайденнаяСтрока1 = Неопределено Тогда
						НайденнаяСтрока1.Сумма = НайденнаяСтрока1.Сумма - СуммаПовыш;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" и ЭтоПовышения и Не ЭтоНадбавка Тогда 
			ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Стаж по специальности (отрасли)");
			НайденныйРасчет = СписокПовышения.НайтиПоЗначению(ВидРасчета);
			Если Не НайденныйРасчет = Неопределено Тогда
				КоэфПоказатель1 = 20;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
				ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
				если ПовышениеТК Тогда
					НайденнаяСтрока = ТаблицаПовышения.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = КоэфПоказатель1;
						НайденнаяСтрока.Сумма = СуммаОтПроцента;
					КонецЕсли;
					НайденнаяСтрока1 = ТаблицаПовышенияИтог.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока1 = Неопределено Тогда
						НайденнаяСтрока1.Сумма = НайденнаяСтрока1.Сумма + СуммаОтПроцента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		ДолжностнойОклад = ТарифныйОклад+ОбщаяСумма;
		ДолжностнойОкладОбщая = ДолжностнойОкладОбщая + ДолжностнойОклад;
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокДоплаты);
		ОбщаяСумма = 0;
		
		ЗапросВремя = Новый Запрос;
		ЗапросВремя.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ОсновноеЗначениеНорма
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата1, ) КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = ВложенныйЗапрос.ГрафикРаботы)
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
		
		ЗапросВремя.УстановитьПараметр("Дата1",НачДата);
		ЗапросВремя.УстановитьПараметр("Дата2",КонецМесяца(НачДата));
		ЗапросВремя.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		
		ТаблицаДоплаты.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаДоплаты.ЗаполнитьЗначения(0,"Сумма");
		
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		пока РезНачисления.Следующий() Цикл
			КоэфПоказатель1 = РезНачисления.Показатель1;
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Доплата за вредность") Тогда 
				РабочихЧасов = 0;
				РезВремя = ЗапросВремя.Выполнить().Выбрать();
				Пока РезВремя.Следующий() Цикл
					РабочихЧасов = РезВремя.ОсновноеЗначениеНорма;
				КонецЦикла;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифнаяСтавка1Разряда* КоэфПоказатель1*РабочихЧасов/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
			Иначе	
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т.  949
			КонецЕсли;
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если Доплаты Тогда
				НайденнаяСтрока = ТаблицаДоплаты.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаДоплатыИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;			
		
		ЗапросНачисления.УстановитьПараметр("Организация",Организация);
		ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
		ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("ВидРасчета",СписокНадбавки);
		
		ТаблицаНадбавки.ЗаполнитьЗначения(0,"Коэф");
		ТаблицаНадбавки.ЗаполнитьЗначения(0,"Сумма");
		
		ЭтоПовышения = Ложь;
		ЭтоНадбавка = Истина;
		
		РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
		пока РезНачисления.Следующий() Цикл
			КоэфПоказатель1 = РезНачисления.Показатель1;
			Если РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("ПАЛ; ЦВВК") Тогда  // замена наименования ПАЛ; СМЛ
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(РезНеВх.ЗанимаемыхСтавок * ТарифнаяСтавка1Разряда* КоэфПоказатель1/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949
			Иначеесли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Выслуга") Тогда 
				КоэфПоказатель1 = 0;
				если Не Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда
					КоэффициентСтажа = РезНачисления.ВидРасчета.КоэффициентСтажа.ССылка;
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ШкалаКоэффициентовСтажа.Величина
					|ИЗ
					|	РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
					|ГДЕ
					|	ШкалаКоэффициентовСтажа.КоэффициентСтажа.Ссылка = &КоэффициентСтажа
					|	И ШкалаКоэффициентовСтажа.СтажС <= &Стаж
					|	И ШкалаКоэффициентовСтажа.СтажПо > &Стаж";
					
					Запрос.УстановитьПараметр("Стаж", ЛетСтажа);
					Запрос.УстановитьПараметр("КоэффициентСтажа", КоэффициентСтажа);
					
					РезультатСтаж = Запрос.Выполнить().Выбрать();
					Пока РезультатСтаж.Следующий() Цикл
						КоэфПоказатель1 = РезультатСтаж.Величина;
					КонецЦикла;
				КонецЕсли;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад* КоэфПоказатель1/100,НачДата); //О.Т.
			Иначеесли РезНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Надбавка") Тогда //О.Т. Аверсон 03.05.2017 № 555
				СуммаОтПроцента = 0;	
			Иначе	
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифныйОклад* КоэфПоказатель1/100,НачДата);//О.Т.
			КонецЕсли;	
			ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
			если Надбавки Тогда
				НайденнаяСтрока = ТаблицаНадбавки.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Коэф = КоэфПоказатель1;
					НайденнаяСтрока.Сумма = СуммаОтПроцента;
				КонецЕсли;
				НайденнаяСтрока = ТаблицаНадбавкиИтог.Найти(РезНачисления.ВидРасчета,"ВидРасчета");
				Если не НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1"  и Не ЭтоПовышения и ЭтоНадбавка Тогда 
			ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Выслуга");
			НайденныйРасчет = СписокНадбавки.НайтиПоЗначению(ВидРасчета);
			Если Не НайденныйРасчет = Неопределено Тогда
				КоэфПоказатель1 = 15;
				СуммаОтПроцента = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад* КоэфПоказатель1/100,НачДата);//О.Т. 949
				ОбщаяСумма = ОбщаяСумма + СуммаОтПроцента;
				если Надбавки Тогда
					НайденнаяСтрока = ТаблицаНадбавки.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Коэф = КоэфПоказатель1;
						НайденнаяСтрока.Сумма = СуммаОтПроцента;
					КонецЕсли;
					НайденнаяСтрока = ТаблицаНадбавкиИтог.Найти(ВидРасчета,"ВидРасчета");
					Если не НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма + СуммаОтПроцента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		
		МесячныйФондЗП = ДолжностнойОклад + ОбщаяСумма; 
		МесОкладОбщая = МесОкладОбщая+МесячныйФондЗП;
		
		если Врег(РезНеВх.Сотрудник.Наименование) = "ВАКАНСИЯ 1 1" Тогда 
			КоэфПремия = 60;
		иначе
			КоэфПремия = 0;
			ПремияОсновная = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию("Премия"); 
			ЗапросНачисления.УстановитьПараметр("Организация",Организация);
			ЗапросНачисления.УстановитьПараметр("парамНачало",КонецМесяца(НачДата));
			ЗапросНачисления.УстановитьПараметр("Сотрудник",РезНеВх.Сотрудник);
			ЗапросНачисления.УстановитьПараметр("ВидРасчета",ПремияОсновная);
			РезНачисления = ЗапросНачисления.Выполнить().Выбрать();
			пока РезНачисления.Следующий() Цикл
				КоэфПремия = РезНачисления.Показатель1;
			КонецЦикла;
		КонецЕсли;
		КоэфПремия = КоэфПремия;
		Премия = ОбщегоНазначения.ОкруглитьЗначение2016(ДолжностнойОклад *КоэфПремия/100,НачДата);//О.Т. Аверсон 15.03.2016 № 949 
		ТекущаяПремияОбщая = ТекущаяПремияОбщая+Премия;
		ИтогоСтрока =МесячныйФондЗП+Премия; 
		//---------------------- Запись в регистр МесячныйФондРаботниковОрганизации --------------------
		Регистр =РегистрыСведений.МесячныйФондРаботниковОрганизации.СоздатьНаборЗаписей();
		Регистр.Отбор.Период.Установить(НачалоМесяца(НачДата));
		Регистр.Отбор.Сотрудник.Установить(РезНеВх.Сотрудник);
		Регистр.Отбор.Организация.Установить(Организация);
		Регистр.Прочитать();
		если Регистр.Количество()>0 Тогда 
			если Регистр[0].МесячныйФонд <> ИтогоСтрока Тогда 
				Регистр[0].МесячныйФонд 	= ИтогоСтрока;
				Регистр[0].ТарифныйОклад 	= ТарифныйОклад;
				Регистр[0].Оклад 			= ДолжностнойОклад;
				Если Регистр.Количество() > 0 И ЗначениеЗаполнено(Регистр[0].Период) Тогда
					Регистр[0].Сотрудник = РезНеВх.Сотрудник;
					Регистр.Отбор.Сотрудник.Использование	= Истина;
					Регистр.Отбор.Сотрудник.Значение			= Регистр[0].Сотрудник;
					Регистр.Отбор.Период.Использование		= Истина;
					Регистр.Отбор.Период.Значение			= Регистр[0].Период;
					Регистр.Отбор.Организация.Использование		= Истина;
					Регистр.Отбор.Организация.Значение			= Регистр[0].Организация;
					Регистр.Записать(Истина);
				КонецЕсли;
			КонецЕсли;
		иначе
			ЗаписьНабора = Регистр.Добавить();
			ЗаписьНабора.Период 							= НачалоМесяца(НачДата);
			ЗаписьНабора.Организация                        = Организация;
			ЗаписьНабора.Сотрудник 							= РезНеВх.Сотрудник;
			ЗаписьНабора.МесячныйФонд                       = ИтогоСтрока;
			ЗаписьНабора.ТарифныйОклад                      = ТарифныйОклад;
			ЗаписьНабора.Оклад                      		= ДолжностнойОклад;
			Если Регистр.Количество() > 0 И ЗначениеЗаполнено(Регистр[0].Период) Тогда
				Регистр[0].Сотрудник = РезНеВх.Сотрудник;
				Регистр.Отбор.Сотрудник.Использование	= Истина;
				Регистр.Отбор.Сотрудник.Значение			= Регистр[0].Сотрудник;
				Регистр.Отбор.Период.Использование		= Истина;
				Регистр.Отбор.Период.Значение			= Регистр[0].Период;
				Регистр.Отбор.Организация.Использование		= Истина;
				Регистр.Отбор.Организация.Значение			= Регистр[0].Организация;
				Регистр.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
		//------------------------------------------------------------------ конец записи в регистр
		ИтогоОбщая = ИтогоОбщая+ИтогоСтрока;
		ПодразделениеСтарое = РезНеВх.Подразделение;
	КонецЦикла;	
	
КонецПроцедуры

Функция СформироватьЗапросПоШапке()//О.Т. 04.02.2015 № 333
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПерваяПоловинаТекущегоМесяца" , Перечисления.ПериодНачисленияЗарплаты.ПерваяПоловинаТекущегоМесяца);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизаций.Дата,
	|	ЗарплатаКВыплатеОрганизаций.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплатеОрганизаций.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЗарплатаКВыплатеОрганизаций.Организация
	|		ИНАЧЕ ЗарплатаКВыплатеОрганизаций.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ЗарплатаКВыплатеОрганизаций.Организация КАК ОбособленноеПодразделение,
	|	ЗарплатаКВыплатеОрганизаций.Ссылка,
	//|	ВЫБОР
	//|		КОГДА ЗарплатаКВыплатеОрганизаций.ДатаНачала = &ПерваяПоловинаТекущегоМесяца
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	|	ЛОЖЬ КАК ЭтоРасчетПервойПоловиныМесяца,
	|	СписокНачисления.КоличествоСтрок КАК НачисленияКоличествоСтрок
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки) КАК КоличествоСтрок
	|	ИЗ
	|		Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|	ГДЕ
	|		ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка) КАК СписокНачисления,
	|	Документ.ЗарплатаКВыплатеОрганизаций КАК ЗарплатаКВыплатеОрганизаций
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизаций.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()


Процедура Рассчитать(ВариантРасчета, ПроцентВыплаты = 100) Экспорт
	
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;//О.Т. Аверсон 29.03.2016 № 950
	Запрос.УстановитьПараметр("парамОрганизация",	Организация);
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	//толик не нужно на конец текущей даты а на конец месяца период регистрации 
	//	Запрос.УстановитьПараметр("парамДата",			Макс(Дата,КонецМесяца(ПериодРегистрации) + 1));
	Запрос.УстановитьПараметр("парамДата",			КонецМесяца(ПериодРегистрации) + 1);
	Запрос.УстановитьПараметр("парамМесяц",			ПериодРегистрации);
	Запрос.УстановитьПараметр("парамПроцент",		РассчитатьПроцентКомпенсации());
	Запрос.УстановитьПараметр("парамПроцентВыплаты",ПроцентВыплаты);
	// О.Т. 28.10.2014 225
	Запрос.УстановитьПараметр("ПериодДействия",			НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодДействия1",			КонецМесяца(ПериодРегистрации));
	// О.Т. 28.10.2014 225
	
	//Аверсон ЕАЕ 03.08.2021 СВФР-007945
	Запрос.УстановитьПараметр("ПериодДействия2", НачалоМесяца(КонецМесяца(ПериодРегистрации) + 1));
	//Аверсон СВФР-007945
	
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс Тогда 
		
		//Аверсон-софт, Плиско Ю.А. 10.11.2014
		РасчетТарифногоОклада();
		//----------------------------------------------
		
		// О.Т. 28.10.2014 225
		
		Если Организация.ИНН = "100074549" Тогда     
			//О.Т. Аверсон 06.04.2016 № 1027
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизации,
			|	СотрудникиОрганизаций.Физлицо
			|ПОМЕСТИТЬ ВТСотрудники
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник
			|ГДЕ
			|	(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
			|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|	И СотрудникиОрганизаций.Организация = &парамОрганизация
			|	И НЕ РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			Запрос.Выполнить();	
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ВЫБОР
			|		КОГДА ВТСотр.ПодразделениеОрганизации ПОДОБНО ""Училище""
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|					ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса / 100 * &парамПроцентВыплаты
			|				ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|			КОНЕЦ
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса / 100 * &парамПроцентВыплаты * &парамПроцент
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамДата, ) КАК АвансыРаботникамОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АвансыРаботникамОрганизацийСрезПоследних.Физлицо
			|			И (АвансыРаботникамОрганизацийСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВТСотр
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТСотр.ФизЛицо
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
			|			РаботникиОрганизацийСрезПоследних.Период КАК Период,
			|			РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор
			|		ИЗ
			|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних) КАК РаботникиОрганизации
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = РаботникиОрганизации.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
		иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса / 100 * &парамПроцентВыплаты
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса / 100 * &парамПроцентВыплаты * &парамПроцент
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамДата, ) КАК АвансыРаботникамОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АвансыРаботникамОрганизацийСрезПоследних.Физлицо
			|			И (АвансыРаботникамОрганизацийСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
		КонецЕсли;
		//О.Т. Аверсон 06.04.2016 № 1027
		
		// О.Т. 28.10.2014 225
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		//заявка №1916 (база заявок Кристалла) 
		КолДней = 0;
		Для Каждого ТекСтрока из Зарплата Цикл
			Если не БезУчетаНеявок Тогда 
				ЗапросОтпуск = Новый Запрос;
				ТекстЗапросаОтпуск = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ОтпускаФактическиеПоСотрудникам.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|	ВЫБОР
				|		КОГДА ОтпускаФактическиеПоСотрудникам.НачалоОтпуска < &НачПериод
				|			ТОГДА &НачПериод
				|		ИНАЧЕ ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
				|	КОНЕЦ КАК НачалоОтпуска,
				|	ВЫБОР
				|		КОГДА ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска > &КонПериод
				|			ТОГДА &КонПериод
				|		ИНАЧЕ ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
				|	КОНЕЦ КАК ОкончаниеОтпуска
				|ИЗ
				|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
				|ГДЕ
				|	(ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный)
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть)
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный)
				//заявка №1931 (база заявок Кристалла) Дмитрук О.Г.
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком))
				//заявка №1931
				|	И ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска > &НачПериод
				|	И ОтпускаФактическиеПоСотрудникам.Сотрудник.Физлицо = &Физлицо
				|УПОРЯДОЧИТЬ ПО
				|	ОкончаниеОтпуска";
				
				ЗапросОтпуск.УстановитьПараметр("НачПериод", НачалоМесяца(ПериодРегистрации));
				ЗапросОтпуск.УстановитьПараметр("КонПериод", КонецМесяца(ПериодРегистрации));
				ЗапросОтпуск.УстановитьПараметр("Физлицо", ТекСтрока.Физлицо);
				ЗапросОтпуск.Текст = ТекстЗапросаОтпуск;
				
				ТЗ = ЗапросОтпуск.Выполнить().Выгрузить();
				
				Если ТЗ.Количество() > 0 Тогда
					Если ТЗ[0].ОкончаниеОтпуска < НачалоМесяца(ПериодРегистрации) Тогда
						Продолжить;
					КонецЕсли;
					//О.Т. 19.03.2015 № 395
					ДобавлениеСтрокДата = Новый ТаблицаЗначений;
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаНачала");
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаОкончания");
					ДатаКонПрошл = "";
					Для Каждого стрТЗ из ТЗ Цикл 
						если ДатаКонПрошл ="" или КонецДня(ДатаКонПрошл)+1 <> стрТЗ.НачалоОтпуска Тогда 
							СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
							СтрокаДобавлениеСтрокДата.ДатаНачала = стрТЗ.НачалоОтпуска;
						КонецЕсли;
						СтрокаДобавлениеСтрокДата.ДатаОкончания = стрТЗ.ОкончаниеОтпуска;
						ДатаКонПрошл = стрТЗ.ОкончаниеОтпуска;
					КонецЦикла;
					
					ПрошлДействиеКонец1 = ТЗ[0].НачалоОтпуска-86400;
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала,
					|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания,
					|	СостояниеРаботниковОрганизаций.Период КАК Период,
					|	СостояниеРаботниковОрганизаций.ПериодЗавершения
					|ИЗ
					|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
					|		ПО СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
					|			И СостояниеРаботниковОрганизаций.Период > ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала
					|			И СостояниеРаботниковОрганизаций.ПериодЗавершения <= ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания
					|ГДЕ
					|	СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
					|	И СостояниеРаботниковОрганизаций.Сотрудник.ФизЛицо = &ФизЛицо
					|	И СостояниеРаботниковОрганизаций.Организация = &Организация
					|
					|УПОРЯДОЧИТЬ ПО
					|	Период";
					
					Запрос.УстановитьПараметр("Организация", Организация);
					Запрос.УстановитьПараметр("ФизЛицо", ТекСтрока.Физлицо);
					
					РезультатЗапросаОтзыв = Запрос.Выполнить().Выбрать();
					ДобавлениеСтрокДата1 = Новый ТаблицаЗначений;
					ДобавлениеСтрокДата1.Колонки.Добавить("ДатаНачала");
					ДобавлениеСтрокДата1.Колонки.Добавить("ДатаОкончания");
					Первый = Истина;
					для Каждого стрДобавлениеСтрок из ДобавлениеСтрокДата Цикл 
						РезультатЗапросаОтзыв = Запрос.Выполнить().Выбрать();
						Пока РезультатЗапросаОтзыв.Следующий() Цикл
							если РезультатЗапросаОтзыв.Период> стрДобавлениеСтрок.ДатаОкончания или РезультатЗапросаОтзыв.ПериодЗавершения <= стрДобавлениеСтрок.ДатаНачала Тогда 
								Продолжить;
							КонецЕсли;
							
							если Первый Тогда
								если РезультатЗапросаОтзыв.Период > стрДобавлениеСтрок.ДатаНачала Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();	
									СтрокаДобавлениеСтрокДата1.ДатаНачала = стрДобавлениеСтрок.ДатаНачала;
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатЗапросаОтзыв.Период - 86400);
									
								КонецЕсли;
								ПрошлДействиеКонец1 = РезультатЗапросаОтзыв.ПериодЗавершения;
							иначе
								
								если НачалоДня(ПрошлДействиеКонец1)<> стрДобавлениеСтрок.ДатаОкончания+86400 Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
									СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатЗапросаОтзыв.Период) - 86400;
								КонецЕсли;
								ПрошлДействиеКонец1 = РезультатЗапросаОтзыв.ПериодЗавершения;
								
								
							КонецЕсли;
							Первый = Ложь;
						КонецЦикла;
						если НачалоДня(ПрошлДействиеКонец1)<> стрДобавлениеСтрок.ДатаОкончания+86400 Тогда
							СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
							СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
							СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
							ПрошлДействиеКонец1 = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
						КонецЕсли;	
					КонецЦикла;
					
					
					КоличествоДней = 0;
					Для каждого СтрДней Из ДобавлениеСтрокДата1 Цикл
						ЗапросДней = Новый Запрос;
						ТекстЗапросаДней = "ВЫБРАТЬ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
						|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни
						|ИЗ
						|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
						|ГДЕ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачДатаКалендаря 
						|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонДатаКалендаря";
						
						ЗапросДней.Текст = ТекстЗапросаДней;
						ЗапросДней.УстановитьПараметр("НачДатаКалендаря", СтрДней.ДатаНачала);
						ЗапросДней.УстановитьПараметр("КонДатаКалендаря", СтрДней.ДатаОкончания);
						
						КолДней = ЗапросДней.Выполнить().Выгрузить();
						Для Каждого стрКолДней из КолДней Цикл 
							КоличествоДней = КоличествоДней+стрКолДней.КалендарныеДни;
						КонецЦикла;
					КонецЦикла; 
					Для каждого СтрДней Из ДобавлениеСтрокДата1 Цикл				
						Если КоличествоДней > 5 Тогда
							ТекСтрока.Сумма = 0;
							Сообщить("" + ТекСтрока.Физлицо + " находится в отпуске с " + Формат(СтрДней.ДатаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(СтрДней.ДатаОкончания,"ДФ=dd.MM.yyyy"));
						КонецЕсли;
					КонецЦикла;
					//О.Т. 19.03.2015 № 395
				КонецЕсли;
			КонецЕсли;
			
			//заявка №1942 (база заявок Кристалла) Дмитрук О.Г.
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				ЗапросКасса = Новый Запрос;
				ТекстЗапросаКасса = "ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = &Физлицо
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка <> &Ссылка
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
				|	И (НЕ ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ПометкаУдаления)
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.ПлановыйАванс)
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезКассу)";
				
				ЗапросКасса.УстановитьПараметр("НачПериод", НачалоМесяца(ПериодРегистрации));
				ЗапросКасса.УстановитьПараметр("КонПериод", КонецМесяца(ПериодРегистрации));
				ЗапросКасса.УстановитьПараметр("Физлицо", ТекСтрока.Физлицо);
				ЗапросКасса.УстановитьПараметр("Ссылка", Ссылка);
				
				ЗапросКасса.Текст = ТекстЗапросаКасса;
				
				ТЗ = ЗапросКасса.Выполнить().Выгрузить();
				
				Если ТЗ.Количество() > 0 Тогда
					ТекСтрока.Сумма = 0;
					Сообщить("По работнику " + ТекСтрока.Физлицо + " аванс начислили по кассе!", СтатусСообщения.Важное);
				КонецЕсли;
			КонецЕсли;
			//заявка №1942
			
		КонецЦикла;
		
		
		//О.Т. Аверсон 10.01.2018 № 1426
		ЗапросАлименты = Новый Запрос;
		ЗапросАлименты.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ КАК СпособРасчетаИЛ,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокумента,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер КАК Размер,
		|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
		|ГДЕ
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ИсполнительныйЛист
		|	И ПлановыеУдержанияРаботниковОрганизаций.Организация = &Организация
		|	И ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо В(&ФизЛицо)
		|	И ПлановыеУдержанияРаботниковОрганизаций.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
		|	И &Период МЕЖДУ ПлановыеУдержанияРаботниковОрганизаций.Период И ВЫБОР
		|			КОГДА ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &Период
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента,
		|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер";
		
		ЗапросАлименты.УстановитьПараметр("Организация", Организация);
		ЗапросАлименты.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросАлименты.УстановитьПараметр("ФизЛицо", Зарплата.ВыгрузитьКолонку("ФизЛицо"));
		
		ТЗАлименты = ЗапросАлименты.Выполнить().Выгрузить();
		
		Для Каждого Стр из Зарплата Цикл 
			МассивАлименты = ТЗАлименты.НайтиСтроки(Новый Структура("ФизЛицо",Стр.Физлицо));
			Если МассивАлименты.Количество()>0 Тогда
				Сч = 0;
				Для Каждого стрМассивАлименты из МассивАлименты Цикл 
					Если Сч = 1 Тогда 
						Стр.Примечание = Стр.Примечание + " ";
					КонецЕсли;
					
					Стр.Примечание = Стр.Примечание + стрМассивАлименты.ВидИсполнительногоДокумента +" "+ Строка(стрМассивАлименты.Размер)+?(стрМассивАлименты.СпособРасчетаИЛ = 1,"%","руб.") +" до "+ Формат(стрМассивАлименты.ПериодЗавершения-1,"ДЛФ=Д")+"г.";
					Сч = 1;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		//О.Т. Аверсон 10.01.2018 № 1426
		
		
		
		//сразу же и очистим строки с 0 суммой
		//мПустоеЗначение = Зарплата.НайтиСтроки(Новый Структура("Сумма", 0));     
		//Для Каждого мСтрока Из мПустоеЗначение Цикл
		//	Зарплата.Удалить(мСтрока);
		//КонецЦикла;
		
		//Аверсон 15.03.2021 КВВ СВФР-007294 (
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
		З = Новый Запрос;
		З.Текст = 
		"ВЫБРАТЬ
		|УдержанияРаботниковОрганизаций.Регистратор,
		|УдержанияРаботниковОрганизаций.ФизЛицо,
		|УдержанияРаботниковОрганизаций.ФизЛицо.Код КАК ТабНомер,
		|УдержанияРаботниковОрганизаций.ВидРасчета,
		|УдержанияРаботниковОрганизаций.ПериодРегистрации КАК Период,
		|СУММА(УдержанияРаботниковОрганизаций.Результат) КАК Сумма,
		|ТЧУдержания.ДокументОснование,
		|ТЧУдержания.ДокументОснование.Получатель КАК Получатель,
		|ТЧУдержания.ДокументОснование.НомерСчета КАК НомерСчета
		|ИЗ
		|РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
		|ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыРаботникамОрганизаций.Удержания КАК ТЧУдержания
		|ПО УдержанияРаботниковОрганизаций.Регистратор.Ссылка = ТЧУдержания.Ссылка
		|И УдержанияРаботниковОрганизаций.ВидРасчета = ТЧУдержания.ВидРасчета
		|И  УдержанияРаботниковОрганизаций.ФизЛицо = ТЧУдержания.ФизЛицо
		|И УдержанияРаботниковОрганизаций.Результат = ТЧУдержания.Результат
		|И УдержанияРаботниковОрганизаций.ДокументОснование = ТЧУдержания.ДокументОснование
		|ГДЕ
		|УдержанияРаботниковОрганизаций.Организация = &Организация
		|И УдержанияРаботниковОрганизаций.ФизЛицо В (&ФизЛицо)
		|И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|И УдержанияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций
		|И ТЧУдержания.ДокументОснование ССЫЛКА Документ.ИсполнительныйЛист
		|И НЕ УдержанияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.ПочтовыйСборПоИЛ)
		|И ТЧУдержания.ДокументОснование.БанкПолучатель = &БанкПолучатель
		|
		|СГРУППИРОВАТЬ ПО
		|УдержанияРаботниковОрганизаций.ФизЛицо,
		|УдержанияРаботниковОрганизаций.ВидРасчета,
		|УдержанияРаботниковОрганизаций.Регистратор,
		|ТЧУдержания.ДокументОснование,
		|ТЧУдержания.ДокументОснование.Получатель,
		|ТЧУдержания.ДокументОснование.НомерСчета,
		|УдержанияРаботниковОрганизаций.ПериодРегистрации";
		З.УстановитьПараметр("Организация",Организация);
		З.УстановитьПараметр("БанкПолучатель",Банк);
		З.УстановитьПараметр("ДатаНачала",ДатаНачала);
		З.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
		З.УстановитьПараметр("ФизЛицо",Зарплата.ВыгрузитьКолонку("ФизЛицо"));
		Зарплата.Загрузить(З.Выполнить().Выгрузить());
		//Аверсон 15.03.2021 КВВ СВФР-007294 )	
		
		//О.Т. 28.01.2015 № 17827	
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДетскиеПособия Тогда
		//Аверсон 11.04.2021 КВВ СВФР-007438 (
		СписокФизЛиц = Новый Массив;
		Для Каждого СтрЗП Из Зарплата Цикл
			СписокФизЛиц.Добавить(СтрЗП.Физлицо);
		КонецЦикла;
		Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛиц);
		
		//Аверсон 11.04.2021 КВВ СВФР-007438 )
		
		если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда 
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("Банк", Банк);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	Сумма(ВЫРАЗИТЬ(ГосударственныеПособияСрезПоследних.Размер * НачисленияРаботниковОрганизации.Показатель1 / 100 КАК ЧИСЛО(15, 2)) / (РАЗНОСТЬДАТ(&ПарамНачало, &ПарамКонец, ДЕНЬ) + 1) * (РАЗНОСТЬДАТ(ВЫБОР
			|	КОГДА НачисленияРаботниковОрганизации.Период > &ПарамНачалоМес
			|		ТОГДА НачисленияРаботниковОрганизации.Период
			|	ИНАЧЕ &ПарамНачалоМес
			|КОНЕЦ, ВЫБОР
			|	КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения < ДОБАВИТЬКДАТЕ(&ПарамКонецМес, ДЕНЬ, 1)
			|			И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА НачисленияРаботниковОрганизации.ПериодЗавершения
			|	ИНАЧЕ ДОБАВИТЬКДАТЕ(&ПарамКонецМес, ДЕНЬ, 1)
			|КОНЕЦ, ДЕНЬ) )) КАК Сумма, //О.Т. Аверсон 28.12.2017 № (убрана + 1, т.к. в плановых +1 день отображается)
			|	ИСТИНА КАК Авторасчет,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код КАК ТабНомер,
			|	Лицевые.Банк
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия.СрезПоследних(&парамКонец, ) КАК ГосударственныеПособияСрезПоследних
			|		ПО (ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И
			|			 (ВЫБОР
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида)
			
			
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет)
			
			|			КОНЕЦ = ГосударственныеПособияСрезПоследних.ВидПособия)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк КАК Банк
			|		ИЗ
			|			РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			//О.Т. Аверсон 24.10.2017 № 1153 убрать
			//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|					ЛицевыеСчетаРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация КАК Организация,
			//|					МАКСИМУМ(ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата) КАК РегистраторДата
			//|				ИЗ
			//|					РегистрСведений.ЛицевыеСчетаРаботниковОрганизации КАК ЛицевыеСчетаРаботниковОрганизации
			//|				ГДЕ
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			//|					И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата <= &парамНачало
			//|				
			//|				СГРУППИРОВАТЬ ПО
			//|					ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			//|					ЛицевыеСчетаРаботниковОрганизации.Организация) КАК ВложенныйЗапрос
			//|				ПО ЛицевыеСчетаРаботниковОрганизации.ФизЛицо = ВложенныйЗапрос.ФизЛицо
			//|					И ЛицевыеСчетаРаботниковОрганизации.Организация = ВложенныйЗапрос.Организация
			//|					И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата = ВложенныйЗапрос.РегистраторДата
			//О.Т. Аверсон 24.10.2017 № 1153
			|		ГДЕ
			|			ЛицевыеСчетаРаботниковОрганизации.Организация = &Организация
			|			И ЛицевыеСчетаРаботниковОрганизации.Регистратор.Дата <= &парамНачало
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЛицевыеСчетаРаботниковОрганизации.ФизЛицо,
			|			ЛицевыеСчетаРаботниковОрганизации.Банк) КАК Лицевые
			|		ПО НачисленияРаботниковОрганизации.Сотрудник.Физлицо = Лицевые.ФизЛицо
			//О.Т. Аверсон 04.01.2018 № 1409
			|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|ПО НачисленияРаботниковОрганизации.Сотрудник = Увольнение.Сотрудник
			
			//О.Т. Аверсон 04.01.2018 № 1409
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ Увольнение.ДатаУвольнения <= НачисленияРаботниковОрганизации.ПериодЗавершения
			|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
			|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.СпособРасчета В(&СпособРасчета)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение В(&ВидРасчетаПособие)
			|	И ЕСТЬNULL(ГосударственныеПособияСрезПоследних.ВидПособия, 1) <> 1
			|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
			//|	И Лицевые.Банк = &Банк   //Аверсон 12.06.2021 КВВ СВФР-007696 (закомментировано)
			|   И НачисленияРаботниковОрганизации.Сотрудник.Физлицо В (&СписокФизЛиц) //Аверсон 11.04.2021 КВВ СВФР-007438
			
			|	СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код,
			|	Лицевые.Банк
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо.Наименование";
			
		иначе
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	Сумма(ВЫРАЗИТЬ(ГосударственныеПособияСрезПоследних.Размер * НачисленияРаботниковОрганизации.Показатель1 / 100 КАК ЧИСЛО(15, 2)) / (РАЗНОСТЬДАТ(&ПарамНачало, &ПарамКонец, ДЕНЬ) + 1) * (РАЗНОСТЬДАТ(ВЫБОР
			|	КОГДА НачисленияРаботниковОрганизации.Период > &ПарамНачалоМес
			|		ТОГДА НачисленияРаботниковОрганизации.Период
			|	ИНАЧЕ &ПарамНачалоМес
			|КОНЕЦ, ВЫБОР
			|	КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения < ДОБАВИТЬКДАТЕ(&ПарамКонецМес, ДЕНЬ, 1)
			|			И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА НачисленияРаботниковОрганизации.ПериодЗавершения
			|	ИНАЧЕ ДОБАВИТЬКДАТЕ(&ПарамКонецМес, ДЕНЬ, 1)
			|КОНЕЦ, ДЕНЬ) )) КАК Сумма, //О.Т. Аверсон 28.12.2017 № (убрана + 1, т.к. в плановых +1 день отображается)
			|	ИСТИНА КАК Авторасчет,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код КАК ТабНомер
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГосударственныеПособия.СрезПоследних(&парамКонец, ) КАК ГосударственныеПособияСрезПоследних
			|		ПО (ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И
			|			 (ВЫБОР
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет)
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида)
			
			
			//О.Т. Аверсон 21.07.2017 № 851
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет)
			|				КОГДА НачисленияРаботниковОрганизации.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет)
			|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет)
			
			|			КОНЕЦ = ГосударственныеПособияСрезПоследних.ВидПособия)
			//О.Т. Аверсон 04.01.2018 № 1409
			|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
			|ПО НачисленияРаботниковОрганизации.Сотрудник = Увольнение.Сотрудник
			
			//О.Т. Аверсон 04.01.2018 № 1409
			|ГДЕ
			|	ВЫБОР
			|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
			|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ИЛИ Увольнение.ДатаУвольнения <= НачисленияРаботниковОрганизации.ПериодЗавершения
			|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
			|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение.СпособРасчета В(&СпособРасчета)
			|	И НачисленияРаботниковОрганизации.ВидРасчетаИзмерение В(&ВидРасчетаПособие)
			|	И ЕСТЬNULL(ГосударственныеПособияСрезПоследних.ВидПособия, 1) <> 1
			|	И НачисленияРаботниковОрганизации.Период <= &парамКонец
			|   И НачисленияРаботниковОрганизации.Сотрудник.Физлицо В (&СписокФизЛиц) //Аверсон 11.04.2021 КВВ СВФР-007438
			
			|	СГРУППИРОВАТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо,
			|	НачисленияРаботниковОрганизации.Сотрудник.Код    
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачисленияРаботниковОрганизации.Сотрудник.Физлицо.Наименование";
		КонецЕсли;
		ВидПособия = Новый СписокЗначений;
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаДетейВВозрастеОт3До18);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаВторогоИПоследующихДо3Лет);
		//О.Т. Аверсон 21.07.2017 № 851
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		//О.Т. Аверсон 21.07.2017 № 851
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаДо18ЛетНадб40);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаИнвалида);
		ВидПособия.Добавить(Перечисления.ВидыГосударственныхПособий.ПособиеНаРебенкаСтарше3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		
		
		Запрос.УстановитьПараметр("ВидПособияНаРебенкаДо3Лет", ВидПособия);
		СпособРасчета = Новый СписокЗначений;
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаДетейВВозрастеОт3До18);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет);
		//О.Т. Аверсон 21.07.2017 № 851
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемей);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеСтарше3ЛетИзОтдельныхКатегорийСемейИнвалид);
		//О.Т. Аверсон 21.07.2017 № 851
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида);
		СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет);
		//О.Т. Аверсон 23.10.2017 № 1153
		
		//О.Т. Аверсон 11.06.2018 № 2061
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//Если Организация.НачислениеЕжемесячныхПособийОтдельнымДок Тогда 
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		СпособРасчета = Новый СписокЗначений;
		ВидРасчетаПособие = Новый СписокЗначений;
		для Каждого стр из Справочники.ГруппыРасчетов.ДетскиеПособия.Основные Цикл 
			СпособРасчета.Добавить(стр.ВидРасчета.СпособРасчета);
			ВидРасчетаПособие.Добавить(стр.ВидРасчета);
		КонецЦикла;
		Запрос.Текст = СтрЗаменить(запрос.Текст,"(ГосударственныеПособияСрезПоследних.ВидПособия В (&ВидПособияНаРебенкаДо3Лет)) И","");
		//(начало) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//КонецЕсли;
		//(конец) закомментировано Кухарчуком Д.Я. 12.07.18, Задача СВФР-002160
		//О.Т. Аверсон 11.06.2018 № 2061
		
		
		Запрос.УстановитьПараметр("ВидРасчетаПособие", ВидРасчетаПособие);		
		Запрос.УстановитьПараметр("СпособРасчета", СпособРасчета);
		Запрос.УстановитьПараметр("парамНачало", ПериодРегистрации);
		Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ПериодРегистрации));
		//О.Т. 11.03.2015 № 
		Запрос.УстановитьПараметр("ПарамНачалоМес", НачалоМесяца(ДатаНачала));
		Запрос.УстановитьПараметр("ПарамКонецМес", КонецМесяца(ДатаОкончания));
		//О.Т. 11.03.2015 № 
		Запрос.УстановитьПараметр("ДатаНач", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон", ДатаОкончания);
		Запрос.УстановитьПараметр("ДниПолные", ПериодРегистрации);
		Запрос.УстановитьПараметр("Дни", ПериодРегистрации);
		ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
		ТЗОбработанная = Новый ТаблицаЗначений;
		ТЗОбработанная.Колонки.Добавить("Физлицо");
		ТЗОбработанная.Колонки.Добавить("ВыплаченностьЗарплаты");
		ТЗОбработанная.Колонки.Добавить("Сумма");
		ТЗОбработанная.Колонки.Добавить("Авторасчет");
		ТЗОбработанная.Колонки.Добавить("ТабНомер"); 
		ПорядокОкругленияПособия = Константы.ОкруглениеПособий.Получить();
		//ПСА 28.05.2021 СВФР-007570+++
		//Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл 
		//	СтрТЗОбработанная = ТЗОбработанная.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрТЗОбработанная,стрТЗ);
		//	СтрТЗОбработанная.Сумма = ОбщегоНазначения.ОкруглитьРезультат(СтрТЗОбработанная.Сумма,ПорядокОкругленияПособия);
		//КонецЦикла;
		Если СписокФизЛиц.Количество() = 0 Тогда
			Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл 
				СтрТЗОбработанная = ТЗОбработанная.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТЗОбработанная,стрТЗ);
				СтрТЗОбработанная.Сумма = ОбщегоНазначения.ОкруглитьРезультат(СтрТЗОбработанная.Сумма,ПорядокОкругленияПособия);
			КонецЦикла;
		Иначе
			Для Каждого ЭлементМассива из СписокФизЛиц Цикл
				ОтборФизЛицо = Новый Структура("ФизЛицо", ЭлементМассива);
				НайденныеСтроки = ТаблицаЗначенийЗП.НайтиСтроки(ОтборФизЛицо);
				СтрТЗОбработанная = ТЗОбработанная.Добавить();
				СтрТЗОбработанная.ФизЛицо = ЭлементМассива;
				Если НайденныеСтроки.Количество()>0 Тогда
					Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
						ЗаполнитьЗначенияСвойств(СтрТЗОбработанная,СтрокаТЗ);
						СтрТЗОбработанная.Сумма = ОбщегоНазначения.ОкруглитьРезультат(СтрТЗОбработанная.Сумма,ПорядокОкругленияПособия);
					КонецЦикла;
				Иначе
					СтрТЗОбработанная = ТЗОбработанная.Добавить();
					СтрТЗОбработанная.ФизЛицо = ЭлементМассива;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		//+++ПСА 28.05.2021 СВФР-007570
		ТЗОбработанная.Свернуть("Физлицо,ВыплаченностьЗарплаты,Авторасчет,ТабНомер","Сумма");
		
		Зарплата.Загрузить(ТЗОбработанная);
		//О.Т. 28.01.2015 № 17827
		//О.Т. Аверсон 03.01.2017 № 119
		
	//Аверсон ЕАЕ 30.07.2025 СВФР-016347
	//ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам И Организация.ИНН = "100765738" Тогда
	//Аверсон СВФР-016347
	
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ИСТИНА КАК Авторасчет,
			|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней) КАК ОтработаноДней,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту  //О.Т.(К) 11.03.2015 № Убрана группировка
			|	СГРУППИРОВАТЬ ПО
			|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
			|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код";
			
			Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
			Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
			
			ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
			
			// Получим реквизиты шапки из запроса
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			// позиционируем выборку
			ВыборкаПоШапкеДокумента.Следующий();
			
			если ЗначениеЗаполнено(ДокументВедомость) Тогда 
				Док = ДокументВедомость.ПолучитьОбъект();
				Док.Начисления.Очистить();
				Док.Удержания.Очистить();
			иначе
				Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
				Док.Дата = Дата;//О.Т. Аверсон 01.12.2015
				Док.Организация = Организация;
			КонецЕсли;
			
			СписокФизлицТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Работники.Физлицо КАК Физлицо
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
			|
			|ГДЕ
			|	Работники.Ссылка = &парамРегистратор";
			ДополнительныеПараметрыЗапросаНДФЛ  = Неопределено;
			ВыборкаПодразделений = "";
			
			ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , Ложь, ВыборкаПодразделений,,Истина);
			Если ДанныеНДФЛ <> Неопределено Тогда
				ФизлицаСписок = НеОпределено;
				ЗаполнитьНаборЗаписейПоДаннымНДФЛ(, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, ,ФизлицаСписок, "", ВыборкаПодразделений,Док,ТаблицаЗначенийЗП);
			КонецЕсли;			
			
			
			ВидРасчетаИскл = Новый СписокЗначений;
			ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
			ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
			Запрос.УстановитьПараметр("ВидРасчетаИскл",ВидРасчетаИскл);
			Запрос.УстановитьПараметр("Регистратор",ДокументВедомость);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Если Зарплата.Количество() = 0 Тогда
				УсловиеНаСписокФизЛиц = Истина;
			Иначе
				УсловиеНаСписокФизЛиц = "
				|	БазаНачисления.Физлицо В
				|			(ВЫБРАТЬ
				|				Вт_Физлица.Физлицо
				|			ИЗ
				|				Вт_Физлица КАК Вт_Физлица)";
				
			КонецЕсли;	
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
			|ПОМЕСТИТЬ Вт_Физлица
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БазаНачисления.Физлицо,
			|	БазаНачисления.ВыплаченностьЗарплаты,
			|	БазаНачисления.Авторасчет,
			|	БазаНачисления.ТабельныйНомер,
			|	СУММА(БазаНачисления.Сумма) КАК Сумма,
			|	СУММА(СведенияРасчетноПлатВедомости.Результат) КАК Результат
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
			|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|		ИСТИНА КАК Авторасчет,
			|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
			|		СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма,
			|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|	ГДЕ
			|		ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|		И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
			|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета) КАК БазаНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СведенияПоРасчетноПлатежнойВедомости.Организация КАК Организация,
			|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо КАК ФизЛицо,
			|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
			|			СведенияПоРасчетноПлатежнойВедомости.Результат КАК Результат
			|		ИЗ
			|			РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
			|		ГДЕ
			|			СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ &ПериодНач И &ПериодКон
			|			И НЕ СведенияПоРасчетноПлатежнойВедомости.ВидРасчета В (&ВидРасчетаИскл)
			|			И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор) КАК СведенияРасчетноПлатВедомости
			|		ПО БазаНачисления.Физлицо = СведенияРасчетноПлатВедомости.ФизЛицо
			|			И БазаНачисления.ВидРасчета = СведенияРасчетноПлатВедомости.ВидРасчета
			|ГДЕ " + УсловиеНаСписокФизЛиц + "
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаНачисления.Авторасчет,
			|	БазаНачисления.ВыплаченностьЗарплаты,
			|	БазаНачисления.Физлицо,
			|	БазаНачисления.ТабельныйНомер";
			ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
			ТаблицаЗначенийЗП = Новый ТаблицаЗначений;
			ТаблицаЗначенийЗП.Колонки.Добавить("Физлицо");
			ТаблицаЗначенийЗП.Колонки.Добавить("ВыплаченностьЗарплаты");
			ТаблицаЗначенийЗП.Колонки.Добавить("Авторасчет");
			ТаблицаЗначенийЗП.Колонки.Добавить("ТабельныйНомер");
			ТаблицаЗначенийЗП.Колонки.Добавить("Сумма");
			ТаблицаЗначенийЗП.Колонки.Добавить("Результат");
			ТаблицаЗначенийЗП.Колонки.Добавить("Налог");
			ТаблицаЗначенийЗП.Колонки.Добавить("ПенсионныйНалог");
			Для каждого стрТЗ Из ТаблицаЗначений Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Налог,
				|	ВложенныйЗапрос.Результат КАК ПенсионныйНалог
				|ИЗ
				|	РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания,
				|	(ВЫБРАТЬ
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Результат
				|	ИЗ
				|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
				|	ГДЕ
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
				|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаПенс)
				|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
				|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос
				|ГДЕ
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
				|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаНДФЛ)
				|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
				|	И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор";
				
				Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
				Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
				Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
				Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
				Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
				Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				СтрТаблицаЗначенийЗП = ТаблицаЗначенийЗП.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТаблицаЗначенийЗП,стрТЗ);
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СтрТаблицаЗначенийЗП.Налог = ВыборкаДетальныеЗаписи.Налог;
					СтрТаблицаЗначенийЗП.ПенсионныйНалог = ВыборкаДетальныеЗаписи.ПенсионныйНалог;
				КонецЦикла;
				
			КонецЦикла; 
			
			ТЧРасчетнаяВедомость = Док.Начисления;
			ТЧРасчетнаяВедомостьУд = Док.Удержания;
			Зарплата.Очистить();
			Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл
				МассивТЧРасчетнаяВедомость = ТЧРасчетнаяВедомость.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
				//П.С. 18.12.2015 № СВ00-000764
				МассивТЧРасчетнаяВедомостьУд = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
				
				//МассивТЧРасчетнаяВедомостьУдПенс = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд));
				//МассивТЧРасчетнаяВедомостьУдНДФЛ = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")));
				СтрокаЗарплата = Зарплата.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗарплата,стрТЗ);
				//Для Каждого СтрПенс из МассивТЧРасчетнаяВедомостьУдПенс Цикл 
				//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрПенс.Результат;		
				//КонецЦикла;
				//Для Каждого СтрНДФЛ из МассивТЧРасчетнаяВедомостьУдНДФЛ Цикл
				//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрНДФЛ.Результат;
				//КонецЦикла;
				
				Для Каждого СтрУд из МассивТЧРасчетнаяВедомостьУд Цикл 
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрУд.Результат;		
				КонецЦикла;
				
				СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма-(?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог));
			КонецЦикла;
			если ФормироватьПромежуточнуюВедомость Тогда 
				ТЧВедомость = Док.Начисления;
				СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
				Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					ТЧВедомость.Удалить(ПустаяСтрока);
				КонецЦикла;	
				ТЧВедомостьУ = Док.Удержания;
				СтрокиКУдалению =ТЧВедомостьУ.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
				Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					ТЧВедомостьУ.Удалить(ПустаяСтрока);
				КонецЦикла;	
				
				
				если ТЧВедомость.Количество()> 0 или ТЧВедомостьУ.Количество()> 0 Тогда 	
					Если ПометкаУдаления Тогда //П.С. 17-12-2015
						Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Иначе	
						Попытка	
							Док.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							Док.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли;
					ДокументВедомость = Док.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		
		//О.Т. Аверсон 03.01.2017 № 119
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощью ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда //Аверсон 21.02.2020 КВВ СВФР-005569 (+Единовр)
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ИСТИНА КАК Авторасчет,
			|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней) КАК ОтработаноДней,
			|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	СГРУППИРОВАТЬ ПО
			|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
			|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код
			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
			|	ИСТИНА,
			|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
			|	Сумма(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
			|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|	0,
			|	0,
			|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
			|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|ИЗ
			|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|ГДЕ
			|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|	И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций
			|	или ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций)//О.Т. Аверсон 15.12.2017 № 1344
			|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)  //О.Т.(К) 11.03.2015 № Убрана группировка
			|		СГРУППИРОВАТЬ ПО
			|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
			|ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
			|ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
			|ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
			|ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код";
			
			СпособРасчета = Новый СписокЗначений;
			СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Материальная помощь"));  
			СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДниБезУвольнения);//О.Т. Аверсон 15.12.2017 № 1344
			//Аверсон 21.02.2020 КВВ СВФР-005569 (
			Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда
				СпособРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Единовременная выплата на оздоровление"));
			КонецЕсли;
			//Аверсон 21.02.2020 КВВ СВФР-005569 )
			
			
			Запрос.УстановитьПараметр("ВидРасчета", СпособРасчета);
			Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
			Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
			
			ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
			
			// Получим реквизиты шапки из запроса
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			// позиционируем выборку
			ВыборкаПоШапкеДокумента.Следующий();
			
			если ЗначениеЗаполнено(ДокументВедомость) Тогда 
				Док = ДокументВедомость.ПолучитьОбъект();
				Док.Начисления.Очистить();
				Док.Удержания.Очистить();
			иначе
				Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
				Док.Дата = Дата;//О.Т. Аверсон 01.12.2015
				Док.Организация = Организация;
			КонецЕсли;
			
			СписокФизлицТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Работники.Физлицо КАК Физлицо
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
			|
			|ГДЕ
			|	Работники.Ссылка = &парамРегистратор";
			ДополнительныеПараметрыЗапросаНДФЛ  = Неопределено;
			ВыборкаПодразделений = "";
			
			ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , Ложь, ВыборкаПодразделений,,Истина);
			Если ДанныеНДФЛ <> Неопределено Тогда
				ФизлицаСписок = НеОпределено;
				ЗаполнитьНаборЗаписейПоДаннымНДФЛ(, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, ,ФизлицаСписок, "", ВыборкаПодразделений,Док,ТаблицаЗначенийЗП);
			КонецЕсли;			
			
			
			ВидРасчетаИскл = Новый СписокЗначений;
			ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
			ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
			Запрос.УстановитьПараметр("ВидРасчетаИскл",ВидРасчетаИскл);
			Запрос.УстановитьПараметр("Регистратор",ДокументВедомость);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Если Зарплата.Количество() = 0 Тогда
				УсловиеНаСписокФизЛиц = Истина;
			Иначе
				УсловиеНаСписокФизЛиц = "
				|	БазаНачисления.Физлицо В
				|			(ВЫБРАТЬ
				|				Вт_Физлица.Физлицо
				|			ИЗ
				|				Вт_Физлица КАК Вт_Физлица)";
				
			КонецЕсли;	
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
			|ПОМЕСТИТЬ Вт_Физлица
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	БазаНачисления.Физлицо,
			|	БазаНачисления.ВыплаченностьЗарплаты,
			|	БазаНачисления.Авторасчет,
			|	БазаНачисления.ТабельныйНомер,
			|	СУММА(БазаНачисления.Сумма) КАК Сумма,
			|	СУММА(СведенияРасчетноПлатВедомости.Результат) КАК Результат
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
			|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|		ИСТИНА КАК Авторасчет,
			|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
			|		СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма,
			|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|	ГДЕ
			|		ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|		И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
			|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
			|		ИСТИНА,
			|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
			|		СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|	ГДЕ
			|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &ПериодНач И &ПериодКон
			|	И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций
			|	или ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций)//О.Т. Аверсон 15.12.2017 № 1344
			|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
			|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета) КАК БазаНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СведенияПоРасчетноПлатежнойВедомости.Организация КАК Организация,
			|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо КАК ФизЛицо,
			|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
			|			СведенияПоРасчетноПлатежнойВедомости.Результат КАК Результат
			|		ИЗ
			|			РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
			|		ГДЕ
			|			СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ &ПериодНач И &ПериодКон
			|			И НЕ СведенияПоРасчетноПлатежнойВедомости.ВидРасчета В (&ВидРасчетаИскл)
			|			И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор) КАК СведенияРасчетноПлатВедомости
			|		ПО БазаНачисления.Физлицо = СведенияРасчетноПлатВедомости.ФизЛицо
			|			И БазаНачисления.ВидРасчета = СведенияРасчетноПлатВедомости.ВидРасчета
			|ГДЕ " + УсловиеНаСписокФизЛиц + "
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаНачисления.Авторасчет,
			|	БазаНачисления.ВыплаченностьЗарплаты,
			|	БазаНачисления.Физлицо,
			|	БазаНачисления.ТабельныйНомер";
			ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
			ТаблицаЗначенийЗП = Новый ТаблицаЗначений;
			ТаблицаЗначенийЗП.Колонки.Добавить("Физлицо");
			ТаблицаЗначенийЗП.Колонки.Добавить("ВыплаченностьЗарплаты");
			ТаблицаЗначенийЗП.Колонки.Добавить("Авторасчет");
			ТаблицаЗначенийЗП.Колонки.Добавить("ТабельныйНомер");
			ТаблицаЗначенийЗП.Колонки.Добавить("Сумма");
			ТаблицаЗначенийЗП.Колонки.Добавить("Результат");
			ТаблицаЗначенийЗП.Колонки.Добавить("Налог");
			ТаблицаЗначенийЗП.Колонки.Добавить("ПенсионныйНалог");
			Для каждого стрТЗ Из ТаблицаЗначений Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Налог,
				|	ВложенныйЗапрос.Результат КАК ПенсионныйНалог
				|ИЗ
				|	РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания,
				|	(ВЫБРАТЬ
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Результат
				|	ИЗ
				|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
				|	ГДЕ
				|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
				|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаПенс)
				|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
				|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос
				|ГДЕ
				|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
				|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаНДФЛ)
				|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
				|	И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор";
				
				Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
				Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
				Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
				Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
				Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
				Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				СтрТаблицаЗначенийЗП = ТаблицаЗначенийЗП.Добавить();
				ЗаполнитьЗначенияСвойств(СтрТаблицаЗначенийЗП,стрТЗ);
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СтрТаблицаЗначенийЗП.Налог = ВыборкаДетальныеЗаписи.Налог;
					СтрТаблицаЗначенийЗП.ПенсионныйНалог = ВыборкаДетальныеЗаписи.ПенсионныйНалог;
				КонецЦикла;
				
			КонецЦикла; 
			
			ТЧРасчетнаяВедомость = Док.Начисления;
			ТЧРасчетнаяВедомостьУд = Док.Удержания;
			Зарплата.Очистить();
			Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл
				МассивТЧРасчетнаяВедомость = ТЧРасчетнаяВедомость.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
				//П.С. 18.12.2015 № СВ00-000764
				//ПСА 04.10.2021 СВФР-008215 +++
				//МассивТЧРасчетнаяВедомостьУд = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
				МассивТЧРасчетнаяВедомостьУд = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ТабельныйНомер",стрТЗ.ФизЛицо, стрТЗ.ТабельныйНомер));
				//+++ПСА 04.10.2021 СВФР-008215 
				
				//МассивТЧРасчетнаяВедомостьУдПенс = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд));
				//МассивТЧРасчетнаяВедомостьУдНДФЛ = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")));
				СтрокаЗарплата = Зарплата.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗарплата,стрТЗ);
				//Для Каждого СтрПенс из МассивТЧРасчетнаяВедомостьУдПенс Цикл 
				//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрПенс.Результат;		
				//КонецЦикла;
				//Для Каждого СтрНДФЛ из МассивТЧРасчетнаяВедомостьУдНДФЛ Цикл
				//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрНДФЛ.Результат;
				//КонецЦикла;
				
				Для Каждого СтрУд из МассивТЧРасчетнаяВедомостьУд Цикл 
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрУд.Результат;		
				КонецЦикла;
				
				СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма-(?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог));
			КонецЦикла;
			если ФормироватьПромежуточнуюВедомость Тогда 
				ТЧВедомость = Док.Начисления;
				СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
				Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					ТЧВедомость.Удалить(ПустаяСтрока);
				КонецЦикла;
				
				//Аверсон ЕАЕ 30.12.2021 СВФР-008504
				//ТЧВедомость = Док.Удержания;
				//СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
				//Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
				//	ТЧВедомость.Удалить(ПустаяСтрока);
				//КонецЦикла;	
				ТЧВедомостьУд = Док.Удержания;
				СтрокиКУдалению =ТЧВедомостьУд.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
				Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					ТЧВедомостьУд.Удалить(ПустаяСтрока);
				КонецЦикла;	
				//Аверсон СВФР-008504
				
				если ТЧВедомость.Количество()> 0 
					
					//Аверсон ЕАЕ 30.12.2021 СВФР-008504
					ИЛИ ТЧВедомостьУд.Количество() > 0
					//Аверсон СВФР-008504
					
					Тогда 	
					Если ПометкаУдаления Тогда //П.С. 17-12-2015
						Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Иначе	
						Попытка	
							Док.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							Док.Записать(РежимЗаписиДокумента.Запись);
						КонецПопытки;
					КонецЕсли;
					ДокументВедомость = Док.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		//заявка №1916   
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.АвансЗаПервуюПоловинуМесяца Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|			ТОГДА РасчетПервойПоловиныМесяцаОбороты.СуммаВзаиморасчетовОборот / 100 * &парамПроцентВыплаты
		|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|			ТОГДА РасчетПервойПоловиныМесяцаОбороты.СуммаВзаиморасчетовОборот / 100 * &парамПроцентВыплаты * &парамПроцент
		|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
		|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПервойПоловиныМесяца.Обороты(
		|		&парамДатаНачала,
		|		&парамДатаОкончания,
		|		Месяц,
		|		Организация = &парамОрганизация
		|		    И Физлицо В
		|		        (ВЫБРАТЬ
		|		            ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
		|		        ИЗ
		|		            Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		        ГДЕ
		|		            ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК РасчетПервойПоловиныМесяцаОбороты
		|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = РасчетПервойПоловиныМесяцаОбороты.Физлицо
		|			И (РасчетПервойПоловиныМесяцаОбороты.СуммаВзаиморасчетовОборот > 0)
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
		
		Запрос.УстановитьПараметр("парамДатаНачала", ПериодРегистрации);
		Запрос.УстановитьПараметр("парамДатаОкончания", КонецМесяца(ПериодРегистрации));
		
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата или ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата или
		(ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении и ВариантРасчета = "ОстаткиСНалогамиУв") Тогда
		если не ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении и ?(Организация.ДенежноеДовольствие, не(ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата),истина) Тогда 
			
			//Аверсон ЕАЕ 22.06.2021 СВФР-007745
			Если УчетЗадолженностиПоМесяцам Тогда
				//Запрос.Текст = 
				//Аверсон 22.07.2021 КВВ СВФР-007902 ( (закомментирована часть кода, далее - новое)
				//"ВЫБРАТЬ
				//|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				//|	ВЫБОР
				//|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				//|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
				//|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				//|	КОНЕЦ КАК Сумма,
				//|	ВЫБОР
				//|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				//|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				//|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				//|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				//|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				//|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				//|ИЗ
				//|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
				//|		,
				//|		Организация = &парамОрганизация И ПериодВзаиморасчетов = &ПарамМесяц
				//|		    И Физлицо В
				//|		        (ВЫБРАТЬ
				//|		            ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				//|		        ИЗ
				//|		            Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				//|		        ГДЕ
				//|		            ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				//|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				//|			И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
				//|ГДЕ
				//|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				//|
				//|УПОРЯДОЧИТЬ ПО
				//|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
				//"ВЫБРАТЬ  
				//|ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо,
				//|СУММА(ВЫБОР КОГДА
				//|ВзаиморасчетыСРаботникамиОрганизацииОстатки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				//|ТОГДА -ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетов
				//|ИНАЧЕ ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетов
				//|КОНЕЦ) КАК Сальдо
				//|ПОМЕСТИТЬ ВтСальдо
				//|ИЗ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				//|ГДЕ  ВзаиморасчетыСРаботникамиОрганизацииОстатки.Организация = &парамОрганизация
				//|И ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо В
				//|(ВЫБРАТЬ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				//|ИЗ
				//|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				//|ГДЕ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)
				//|И КОНЕЦПЕРИОДА(ВзаиморасчетыСРаботникамиОрганизацииОстатки.Период,МЕСЯЦ) = КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПарамМесяц,МЕСЯЦ),ДЕНЬ,-1),МЕСЯЦ)					
				//|СГРУППИРОВАТЬ ПО
				//|ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				//|;
				//|
				//|ВЫБРАТЬ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				//|ВЫБОР
				//|КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				//|ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
				//|ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				//|КОНЕЦ КАК Сумма,
				//|ВЫБОР
				//|КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				//|ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				//|ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				//|КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				//|ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				//|ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки
				//|ПОМЕСТИТЬ ВтТЧ
				//|ИЗ
				//|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
				//|,
				//|Организация = &парамОрганизация И ПериодВзаиморасчетов = &ПарамМесяц
				//|И Физлицо В
				//|(ВЫБРАТЬ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				//|ИЗ
				//|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				//|ГДЕ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				//|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				//|И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
				//|ГДЕ
				//|ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка   
				//|;
				//|ВЫБРАТЬ 
				//|ВтТЧ.Физлицо,
				//|ВЫБОР КОГДА
				//|(ВтТЧ.Сумма + ВтСальдо.Сальдо) < 0 
				//|ТОГДА 0
				//|ИНАЧЕ
				//|(ВтТЧ.Сумма + ВтСальдо.Сальдо)
				//|КОНЕЦ КАК Сумма,
				//|ВтТЧ.КомпенсацияЗаЗадержкуЗарплаты,
				//|ВтТЧ.ВыплаченностьЗарплаты,
				//|ВтТЧ.Авторасчет,
				//|ВтТЧ.НомерСтроки
				//|ИЗ ВтТЧ КАК ВтТЧ
				//|ЛЕВОЕ СОЕДИНЕНИЕ ВтСальдо КАК ВтСальдо
				//|ПО ВтТЧ.ФизЛицо = ВтСальдо.ФизЛицо
				//|УПОРЯДОЧИТЬ ПО
				//|ВтТЧ.НомерСтроки";
				//Аверсон 22.07.2021 КВВ СВФР-007902 )
				
				//Аверсон 05.07.2023 КВВ СВФР-010911 (
				Запрос.Текст = ""; 
				БезБудущегоПФ_т1 = ""; БезБудущегоПФ_т2 = "";
				Если БезБудущегоПФ Тогда 
					Запрос.Текст = Запрос.Текст + "
					|ВЫБРАТЬ 
					|ОСН.ФизЛицо,
					|СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ОСН.Результат,0) * &ПроцентПФ/100 КАК ЧИСЛО(15, 2))) КАК СуммаПФБудОтпусков
					|ПОМЕСТИТЬ ВтБудОтпусков
					|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОСН
					|ГДЕ ОСН.ФизЛицо В
					|(ВЫБРАТЬ
					|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
					|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
					|ГДЕ
					|ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)
					|И ОСН.Организация = &парамОрганизация
					|И ОСН.ПериодРегистрации = &ПарамМесяц
					|И ОСН.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
					|И КОНЕЦПЕРИОДА(ОСН.ПериодРегистрации,МЕСЯЦ) < НАЧАЛОПЕРИОДА(ОСН.ПериодДействияНачало,МЕСЯЦ)
					|СГРУППИРОВАТЬ ПО
					|ОСН.ФизЛицо
					|;
					|";
					БезБудущегоПФ_т1 = " - ЕСТЬNULL(ВтБудОтпусков.СуммаПФБудОтпусков, 0)";
					БезБудущегоПФ_т2 = "ЛЕВОЕ СОЕДИНЕНИЕ ВтБудОтпусков ПО ВтТЧ.ФизЛицо = ВтБудОтпусков.ФизЛицо";
					ПроцентПФ = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации, 
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения", Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,Организация.ОсновнаяСтавкаНалогообложения)).Размер;
					Запрос.УстановитьПараметр("ПроцентПФ",ПроцентПФ);
				КонецЕсли;
				
				Запрос.Текст = Запрос.Текст +
				//Аверсон 05.07.2023 КВВ СВФР-010911 )
				
				//Аверсон ЕАЕ 22.07.2021 СВФР-007902
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
				|	ВЫБОР
				|	КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|	ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовКонечныйОстаток, 0) / 100 * &парамПроцентВыплаты
				|	ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|   ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовРасход, 0) КАК СуммаВыплаты,
				|	ВЫБОР
				|	КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|	ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовКонечныйОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				|	ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
				|ПОМЕСТИТЬ ВТБудущиеВыплаты
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
				|	&ПериодДействия2,,,,
				|	Организация = &парамОрганизация
				|	И ПериодВзаиморасчетов = &ПарамМесяц
				|	И Физлицо В
				|			(ВЫБРАТЬ
				|				ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|			ИЗ
				|				Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|			ГДЕ
				|				ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Физлицо,
				|	НомерСтроки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
				|	ВЫБОР
				|	КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|	ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовКонечныйОстаток, 0) / 100 * &парамПроцентВыплаты
				|	ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовНачальныйОстаток КАК СальдоНаНачало,
				|	ВЫБОР
				|	КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|	ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовКонечныйОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				|	ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
				|ПОМЕСТИТЬ ВтТЧ
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(
				|	&ПериодДействия,&ПериодДействия1,,,
				|	Организация = &парамОрганизация
				|	И Физлицо В
				|			(ВЫБРАТЬ
				|				ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|			ИЗ
				|				Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|			ГДЕ
				|				ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Физлицо,
				|	НомерСтроки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ВтТЧ.Физлицо,
				//|	ВЫБОР
				//|	КОГДА ВтТЧ.СальдоНаНачало + ЕСТЬNULL(ВтСальдо.Сумма, 0) < 0
				//|	ТОГДА 0
				//|	ИНАЧЕ ВтТЧ.СальдоНаНачало + ЕСТЬNULL(ВтСальдо.Сумма, 0) 
				//|   КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|	КОГДА ВтТЧ.Сумма - ЕСТЬNULL(ВТБудущиеВыплаты.СуммаВыплаты, 0)" + БезБудущегоПФ_т1 + " < 0  //Аверсон 05.07.2023 КВВ СВФР-010911 (БезБудущегоПФ_т1)
				|	ТОГДА 0
				|	ИНАЧЕ ВтТЧ.Сумма - ЕСТЬNULL(ВТБудущиеВыплаты.СуммаВыплаты, 0)" + БезБудущегоПФ_т1 + " //Аверсон 05.07.2023 КВВ СВФР-010911 (БезБудущегоПФ_т1)
				|   КОНЕЦ КАК Сумма,
				|	ВтТЧ.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВтТЧ.ВыплаченностьЗарплаты,
				|	ВтТЧ.Авторасчет,
				|	ВтТЧ.НомерСтроки
				|ИЗ
				|	ВтТЧ КАК ВтТЧ
				|" + БезБудущегоПФ_т2 + " //Аверсон 05.07.2023 КВВ СВФР-010911
				|ЛЕВОЕ СОЕДИНЕНИЕ ВТБудущиеВыплаты КАК ВТБудущиеВыплаты
				|ПО ВтТЧ.Физлицо = ВТБудущиеВыплаты.Физлицо
				|	И ВтТЧ.НомерСтроки = ВТБудущиеВыплаты.НомерСтроки
				|УПОРЯДОЧИТЬ ПО
				|	ВтТЧ.НомерСтроки";
				
				//Аверсон СВФР-007902
			Иначе
				//Аверсон СВФР-007745
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
				|		&парамДата,
				|		Организация = &парамОрганизация
				|		    И Физлицо В
				|		        (ВЫБРАТЬ
				|		            ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|		        ИЗ
				|		            Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		        ГДЕ
				|		            ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				|			И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
			КонецЕсли;
			
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			//ИначеЕсли Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Тогда 
			
		иначе
			
			если не Организация.ИНН = "100765738" и не Организация.ДенежноеДовольствие Тогда 
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|   ЕСТЬNULL(НДФЛРасчетыСБюджетомОбороты.НалогПриход,0) КАК ПодоходныйНалог
				//Аверсон СВФР-016347
				
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
				|		&парамДата,
				|		Организация = &парамОрганизация
				|		    И Физлицо В
				|		        (ВЫБРАТЬ
				|		            ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|		        ИЗ
				|		            Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		        ГДЕ
				|		            ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				|			И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛРасчетыСБюджетом.Обороты(&ПериодДействия,&ПериодДействия1,Авто,Организация = &парамОрганизация 
				|																		И ФизЛицо В (ВЫБРАТЬ
				|		            																	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|		        																	ИЗ
				|		            																	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		        																	ГДЕ
				|		            																	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК НДФЛРасчетыСБюджетомОбороты
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НДФЛРасчетыСБюджетомОбороты.Физлицо
				//Аверсон СВФР-016347
				
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
				
				
				Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			иначе //О.Т. 03.04.2015 Для госпиталя
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.Сумма,
				|	ВложенныйЗапрос.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
				|	ВложенныйЗапрос.Авторасчет
				|ПОМЕСТИТЬ ВТФизЛица
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
				|		ВЫБОР
				|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|				ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
				|			ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|		КОНЕЦ КАК Сумма,
				|		ВЫБОР
				|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|				ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
				|			ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|		КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет КАК Авторасчет
				|	ИЗ
				|		Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
				|					&парамДата,
				|					Организация = &парамОрганизация
				|						И Физлицо В
				|							(ВЫБРАТЬ
				|								ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|							ИЗ
				|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|							ГДЕ
				|								ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
				|			ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
				|				И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
				|	ГДЕ
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.Авторасчет,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
				|	ВложенныйЗапрос.Сумма,
				|	ВложенныйЗапрос.КомпенсацияЗаЗадержкуЗарплаты";
				
				
				Если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
					Запрос.УстановитьПараметр("парамДатаНачала",	НачалоМесяца(ПериодРегистрации));
					Запрос.УстановитьПараметр("парамДатаОкончания", КонецМесяца(ПериодРегистрации)); 
				иначе
					Запрос.УстановитьПараметр("парамДатаНачала",	НачалоМесяца(ДатаНачала));
					Запрос.УстановитьПараметр("парамДатаОкончания", КонецМесяца(ДатаОкончания)); 
				КонецЕсли;
				Запрос.Выполнить();
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат),
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней),
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов),
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование КАК ФизЛицоНаименование
				|ИЗ
				|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|			И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания)//О.Т. Аверсон 21.01.2017 № период регистрации
				|	СГРУППИРОВАТЬ ПО
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	Сумма(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
				|	NULL,
				|	NULL,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование
				|ИЗ
				|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания) //О.Т. Аверсон 21.01.2017 № период регистрации
				|	СГРУППИРОВАТЬ ПО
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код
				
				|
				|УПОРЯДОЧИТЬ ПО
				|	ФизЛицоНаименование";
				
				
				
				ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
				
				// Получим реквизиты шапки из запроса
				ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
				// позиционируем выборку
				ВыборкаПоШапкеДокумента.Следующий();
				
				если ЗначениеЗаполнено(ДокументВедомость) Тогда 
					Док = ДокументВедомость.ПолучитьОбъект();
					Док.Начисления.Очистить();
					Док.Удержания.Очистить();
				иначе
					Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
					Док.Дата = Дата;//О.Т. Аверсон 01.12.2015
					Док.Организация = Организация;
				КонецЕсли;
				
				СписокФизлицТекст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Физлицо КАК Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
				|
				|ГДЕ
				|	Работники.Ссылка = &парамРегистратор";
				ДополнительныеПараметрыЗапросаНДФЛ  = Неопределено;
				ВыборкаПодразделений = "";
				ТЗАванс = новый ТаблицаЗначений;
				ТЗАванс.Колонки.Добавить("Работник");
				ТЗАванс.Колонки.Добавить("СуммаАванса");
				
				СуммаАванса = 0;
				ФизЛицоПрошл = "";
				Для Каждого стрТаблицаЗначенийЗП из ТаблицаЗначенийЗП Цикл 
					
					Строка = Док.Начисления.Добавить();
					Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
					Строка.ПериодНачисления = стрТаблицаЗначенийЗП.ПериодДействияНачало;
					Строка.ПериодНачисленияКонец = стрТаблицаЗначенийЗП.ПериодДействияКонец;
					ЗапросПрием = Новый Запрос;
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
					
					ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
					
					
					РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
					Период = ПериодРегистрации;
					Если РезультатЗапросаПрием.Количество()>0 Тогда 
						Период = РезультатЗапросаПрием[0].Период;
					КонецЕсли;
					
					
					СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
					Строка.Должность = СведенияОРаботнике.Должность;
					ЗаполнитьЗначенияСвойств(Строка,стрТаблицаЗначенийЗП);
					если стрТаблицаЗначенийЗП.ФизЛицо <> ФизЛицоПрошл Тогда 
						
						ЗапросНДФЛ = Новый Запрос;
						ЗапросНДФЛ.Текст = 
						"ВЫБРАТЬ
						|	СУММА(НДФЛРасчетыСБюджетом.Налог) КАК Налог,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетЛичный) КАК ПримененныйВычетЛичный,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетей) КАК ПримененныйВычетНаДетей,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейИнвалидов) КАК ПримененныйВычетНаДетейИнвалидов,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейЛьгота) КАК ПримененныйВычетНаДетейЛьгота,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйДополнительныйВычет) КАК ПримененныйДополнительныйВычет,
						|	НДФЛРасчетыСБюджетом.ФизЛицо,
						|	НДФЛРасчетыСБюджетом.Период,
						|	НДФЛРасчетыСБюджетом.ВидДвижения
						|ИЗ
						|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
						|ГДЕ
						|	НДФЛРасчетыСБюджетом.ФизЛицо = &ФизЛицо
						|	И НДФЛРасчетыСБюджетом.Организация = &Организация
						|	И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ДатаНачала И &ДатаОкончания  //О.Т. Аверсон 23.01.2017 № 200
						|
						|СГРУППИРОВАТЬ ПО
						|	НДФЛРасчетыСБюджетом.Период,
						|	НДФЛРасчетыСБюджетом.ФизЛицо,
						|	НДФЛРасчетыСБюджетом.ВидДвижения";
						Если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
							ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодРегистрации));
							ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодРегистрации));
						иначе
							ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаНачала));
							ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаОкончания));
						КонецЕсли;
						ЗапросНДФЛ.УстановитьПараметр("Организация", Организация);
						ЗапросНДФЛ.УстановитьПараметр("ФизЛицо", стрТаблицаЗначенийЗП.ФизЛицо);
						
						РезультатЗапроса = ЗапросНДФЛ.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл    
							Если ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
								СтрТЗАванс = ТЗАванс.Добавить();
								СтрТЗАванс.Работник = стрТаблицаЗначенийЗП.ФизЛицо;
								СтрТЗАванс.СуммаАванса = ВыборкаДетальныеЗаписи.Налог;
								Продолжить;
							КонецЕсли;
							
							Строка = Док.Удержания.Добавить();
							
							ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи);
							Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
							МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",стрТаблицаЗначенийЗП.ФизЛицо)); 
							Если МассивСотрудник.Количество() > 0 Тогда
								ТекСтрока = МассивСотрудник[0];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = стрТаблицаЗначенийЗП.Сотрудник.Код;
							иначе
								СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрТаблицаЗначенийЗП.ФизЛицо.Наименование);
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = СотрудникПодбор.Код;
							КонецЕсли;
							Строка.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог");
							Строка.ПериодУдержания = ВыборкаДетальныеЗаписи.Период;
							
							Строка.Результат = ВыборкаДетальныеЗаписи.Налог;
						КонецЦикла;
						
						ЗапросНДФЛ = Новый Запрос;
						ЗапросНДФЛ.Текст = 
						"ВЫБРАТЬ
						|	ЕСНИсчисленный.ФизЛицо,
						|	СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
						|	ЕСНИсчисленный.Период
						|ИЗ
						|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						|ГДЕ
						|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						|	И ЕСНИсчисленный.Организация = &Организация
						|	И ЕСНИсчисленный.Период МЕЖДУ &ДатаНачала И &ДатаОкончания //О.Т. Аверсон 23.01.2017 № 200
						|
						|СГРУППИРОВАТЬ ПО
						|	ЕСНИсчисленный.Период,
						|	ЕСНИсчисленный.ФизЛицо";
						
						если Организация.ДенежноеДовольствие  и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
							ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодРегистрации));
							ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодРегистрации));
						иначе
							ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаНачала));
							ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаОкончания));
						КонецЕсли;
						ЗапросНДФЛ.УстановитьПараметр("Организация", Организация);
						ЗапросНДФЛ.УстановитьПараметр("ФизЛицо", стрТаблицаЗначенийЗП.ФизЛицо);
						
						РезультатЗапроса = ЗапросНДФЛ.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Строка = Док.Удержания.Добавить();   
							Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
							МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",стрТаблицаЗначенийЗП.ФизЛицо)); 
							Если МассивСотрудник.Количество() > 0 Тогда
								ТекСтрока = МассивСотрудник[0];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
								Строка.Должность = СведенияОРаботнике.Должность;     
								Строка.ТабельныйНомер = стрТаблицаЗначенийЗП.Сотрудник.Код;
							иначе
								СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрТаблицаЗначенийЗП.ФизЛицо.Наименование);
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = СотрудникПодбор.Код;
							КонецЕсли;
							Строка.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
							//ПСА 12.11.2021 СВФР-008304 +++
							//Строка.ПериодУдержания = ВыборкаДетальныеЗаписи.Период;
							Строка.ПериодУдержания = КонецМесяца(ВыборкаДетальныеЗаписи.Период);
							//+++ПСА 12.11.2021 СВФР-008304
							
							Строка.Результат = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
						КонецЦикла;
						
						
						//П.С. 18.12.2015 № СВ00-000764
						
						ЗапросУдержанияРаботниковОрганизаций = Новый Запрос;
						ЗапросУдержанияРаботниковОрганизаций.Текст = 
						"ВЫБРАТЬ
						|	УдержанияРаботниковОрганизаций.ФизЛицо,
						|	УдержанияРаботниковОрганизаций.ВидРасчета,
						//ПСА 12.11.2021 СВФР-008304 +++
						//|	УдержанияРаботниковОрганизаций.ПериодРегистрации КАК Период,
						|	УдержанияРаботниковОрганизаций.БазовыйПериодКонец КАК Период,
						//+++ПСА 12.11.2021 СВФР-008304
						|	СУММА(УдержанияРаботниковОрганизаций.Результат) КАК Результат
						|ИЗ
						|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
						|ГДЕ
						|	УдержанияРаботниковОрганизаций.Организация = &Организация
						|	И УдержанияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
						|	И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
						|
						|СГРУППИРОВАТЬ ПО
						|	УдержанияРаботниковОрганизаций.ФизЛицо,
						|	УдержанияРаботниковОрганизаций.ВидРасчета,
						//ПСА 12.11.2021 СВФР-008304 +++
						//|	УдержанияРаботниковОрганизаций.ПериодРегистрации
						|	УдержанияРаботниковОрганизаций.БазовыйПериодКонец
						//+++ПСА 12.11.2021 СВФР-008304
						|";
						
						ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("Организация", Организация);
						если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
							ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодРегистрации));
							ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодРегистрации));
						иначе  							
							ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаНачала));
							ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаОкончания));
						КонецЕсли;
						ЗапросУдержанияРаботниковОрганизаций.УстановитьПараметр("ФизЛицо", стрТаблицаЗначенийЗП.ФизЛицо);
						
						РезультатЗапроса = ЗапросУдержанияРаботниковОрганизаций.Выполнить();
						
						Выборка = РезультатЗапроса.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							Строка = Док.Удержания.Добавить();   
							Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
							МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",стрТаблицаЗначенийЗП.ФизЛицо)); 
							Если МассивСотрудник.Количество() > 0 Тогда
								ТекСтрока = МассивСотрудник[0];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
								Строка.Должность = СведенияОРаботнике.Должность;      
								Строка.ТабельныйНомер = стрТаблицаЗначенийЗП.Сотрудник.Код;
							иначе
								СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрТаблицаЗначенийЗП.ФизЛицо.Наименование);
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = СотрудникПодбор.Код;
							КонецЕсли;
							Строка.ВидРасчета = Выборка.ВидРасчета;
							Строка.ПериодУдержания = Выборка.Период;
							Строка.Результат = Выборка.Результат;
						КонецЦикла;
						
						
					КонецЕсли;
					
					ФизЛицоПрошл = стрТаблицаЗначенийЗП.ФизЛицо;
				КонецЦикла;
				
				
				
				
				
				ВидРасчетаИскл = Новый СписокЗначений;
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
				Запрос.УстановитьПараметр("ВидРасчетаИскл",ВидРасчетаИскл);
				Запрос.УстановитьПараметр("Регистратор",ДокументВедомость);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	БазаНачисления.ФизЛицо,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.Авторасчет,
				|	СУММА(СведенияРасчетноПлатВедомости.Результат) КАК Результат,
				|	СУММА(БазаНачисления.Сумма) КАК Сумма
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВТФизЛица.ФизЛицо КАК ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты КАК ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет КАК Авторасчет,
				|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
				|		СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма
				|	ИЗ
				|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|			ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|				И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.Авторасчет,
				|		ВТФизЛица.ВыплаченностьЗарплаты
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет,
				|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|		СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
				|	ИЗ
				|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|			ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет,
				|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета) КАК БазаНачисления
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СведенияПоРасчетноПлатежнойВедомости.Организация КАК Организация,
				|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо КАК ФизЛицо,
				|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
				|			СУММА(СведенияПоРасчетноПлатежнойВедомости.Результат) КАК Результат
				|		ИЗ
				|			РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
				|		ГДЕ
				|			СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ &ПериодНач И &ПериодКон
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.ВидРасчета В (&ВидРасчетаИскл)
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор
				|		
				|		СГРУППИРОВАТЬ ПО
				|			СведенияПоРасчетноПлатежнойВедомости.Организация,
				|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета,
				|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо) КАК СведенияРасчетноПлатВедомости
				|		ПО БазаНачисления.ФизЛицо = СведенияРасчетноПлатВедомости.ФизЛицо
				|			И БазаНачисления.ВидРасчета = СведенияРасчетноПлатВедомости.ВидРасчета
				|
				|СГРУППИРОВАТЬ ПО
				|	БазаНачисления.Авторасчет,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.ФизЛицо";
				если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
					Запрос.УстановитьПараметр("ПериодНач", НачалоМесяца(ПериодРегистрации));
					Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ПериодРегистрации));
				иначе
					Запрос.УстановитьПараметр("ПериодНач", НачалоМесяца(ДатаНачала));
					Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ДатаОкончания));
				КонецЕсли;
				ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
				ТаблицаЗначенийЗП = Новый ТаблицаЗначений;
				ТаблицаЗначенийЗП.Колонки.Добавить("Физлицо");
				ТаблицаЗначенийЗП.Колонки.Добавить("ВыплаченностьЗарплаты");
				ТаблицаЗначенийЗП.Колонки.Добавить("Авторасчет");
				ТаблицаЗначенийЗП.Колонки.Добавить("ТабельныйНомер");
				ТаблицаЗначенийЗП.Колонки.Добавить("Сумма");
				ТаблицаЗначенийЗП.Колонки.Добавить("Результат");
				ТаблицаЗначенийЗП.Колонки.Добавить("Налог");
				ТаблицаЗначенийЗП.Колонки.Добавить("ПенсионныйНалог");
				Для каждого стрТЗ Из ТаблицаЗначений Цикл
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВложенныйЗапрос.Организация,
					|	ВложенныйЗапрос.ФизЛицо,
					|	ВложенныйЗапрос.ВидРасчета,
					|	ЕСТЬNULL(ВложенныйЗапрос.ПенсионныйНалог, 0) КАК ПенсионныйНалог,
					|	ЕСТЬNULL(ВложенныйЗапрос.Налог, 0) КАК Налог
					|ИЗ
					|	(ВЫБРАТЬ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
					|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК ПенсионныйНалог,
					|		NULL КАК Налог
					|	ИЗ
					|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
					|	ГДЕ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаПенс)
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор
					|	
					|	СГРУППИРОВАТЬ ПО
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета,
					|		NULL,
					|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат)
					|	ИЗ
					|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
					|	ГДЕ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаНДФЛ)
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор
					|	
					|	СГРУППИРОВАТЬ ПО
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета) КАК ВложенныйЗапрос";
					
					Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
					Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
					если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
						Запрос.УстановитьПараметр("ПериодНач", ПериодРегистрации);
						Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ПериодРегистрации));
					иначе
						Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
						Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
					КонецЕсли;
					Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
					Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					СтрТаблицаЗначенийЗП = ТаблицаЗначенийЗП.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТаблицаЗначенийЗП,стрТЗ);
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						СтрТаблицаЗначенийЗП.Налог = ВыборкаДетальныеЗаписи.Налог;
						СтрТаблицаЗначенийЗП.ПенсионныйНалог = ВыборкаДетальныеЗаписи.ПенсионныйНалог;
					КонецЦикла;
					
				КонецЦикла; 
				
				ТЧРасчетнаяВедомость = Док.Начисления;
				ТЧРасчетнаяВедомостьУд = Док.Удержания;
				Зарплата.Очистить();
				Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл
					МассивТЧРасчетнаяВедомость = ТЧРасчетнаяВедомость.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
					//П.С. 18.12.2015 № СВ00-000764
					МассивТЧРасчетнаяВедомостьУд = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
					//
					//МассивТЧРасчетнаяВедомостьУдПенс = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд));
					//МассивТЧРасчетнаяВедомостьУдНДФЛ = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")));
					СтрокаЗарплата = Зарплата.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗарплата,стрТЗ);
					
					
					//Для Каждого СтрПенс из МассивТЧРасчетнаяВедомостьУдПенс Цикл 
					//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрПенс.Результат;		
					//КонецЦикла;
					//Для Каждого СтрНДФЛ из МассивТЧРасчетнаяВедомостьУдНДФЛ Цикл
					//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрНДФЛ.Результат;
					//КонецЦикла;
					
					Для Каждого СтрУд из МассивТЧРасчетнаяВедомостьУд Цикл
						СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрУд.Результат;
					КонецЦикла;
					
					//Аверсон ЕАЕ 30.12.2021 СВФР-008504
					ТЗУдержанияПредВедомость = Новый ТаблицаЗначений;
					ТЗУдержанияПредВедомость.Колонки.Добавить("ВидРасчета");
					ТЗУдержанияПредВедомость.Колонки.Добавить("Результат");
					//Аверсон СВФР-008504
					
					Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
						Если ?(стрТЗ.Результат=Null,0,стрТЗ.Результат) <> 0 Тогда 
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомости.Результат) КАК Результат
							|ИЗ
							|	РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
							|ГДЕ
							|	СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ &ПериодНач И &ПериодКон
							|	И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор
							|	И СведенияПоРасчетноПлатежнойВедомости.ФизЛицо = &ФизЛицо
							|	И СведенияПоРасчетноПлатежнойВедомости.Организация = &Организация
							|
							|СГРУППИРОВАТЬ ПО
							|	СведенияПоРасчетноПлатежнойВедомости.ВидРасчета";
							
							Запрос.УстановитьПараметр("Организация", Организация);
							Запрос.УстановитьПараметр("ПериодНач", ПериодРегистрации);
							Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ПериодРегистрации));
							Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
							Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
							
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								МассивНач = Док.Начисления.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ВыборкаДетальныеЗаписи.ВидРасчета));
								Если МассивНач.Количество()> 0 Тогда 
									МассивНач[0].Результат =МассивНач[0].Результат - ВыборкаДетальныеЗаписи.Результат; 
								КонецЕсли;
								
							КонецЦикла;
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК Результат,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетЛичный) КАК ПримененныйВычетЛичный,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетНаДетей) КАК ПримененныйВычетНаДетей,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетНаДетейЛьгота) КАК ПримененныйВычетНаДетейЛьгота,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйвычетДополнительный) КАК ПримененныйвычетДополнительный,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетИмущественныйРасход) КАК ПримененныйВычетИмущественныйРасход,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетСоциальныйСПроцентами) КАК ПримененныйВычетСоциальныйСПроцентами,
							|	СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетСтраховойРасход) КАК ПримененныйВычетСтраховойРасход
							|ИЗ
							|	РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
							|ГДЕ
							|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
							|	И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор
							|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
							|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация = &Организация
							|
							|СГРУППИРОВАТЬ ПО
							|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета";
							
							Запрос.УстановитьПараметр("Организация", Организация);
							Запрос.УстановитьПараметр("ПериодНач", ПериодРегистрации);
							Запрос.УстановитьПараметр("ПериодКон", КонецМесяца(ПериодРегистрации));
							Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
							Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
							
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							
							//Аверсон ЕАЕ 30.12.2021 СВФР-008504
							//ТЗУдержанияПредВедомость = Новый ТаблицаЗначений;
							//ТЗУдержанияПредВедомость.Колонки.Добавить("ВидРасчета");
							//ТЗУдержанияПредВедомость.Колонки.Добавить("Результат");
							ТЗУдержанияПредВедомость.Очистить();
							//Аверсон СВФР-008504
							
							Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
								МассивУд = Док.Удержания.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ВыборкаДетальныеЗаписи.ВидРасчета));
								Если МассивУд.Количество()> 0 Тогда 
									МассивУд[0].Результат =МассивУд[0].Результат - ВыборкаДетальныеЗаписи.Результат; 
									МассивУд[0].ПримененныйВычетЛичный =МассивУд[0].ПримененныйВычетЛичный - ВыборкаДетальныеЗаписи.ПримененныйВычетЛичный;
									МассивУд[0].ПримененныйВычетНаДетей =МассивУд[0].ПримененныйВычетНаДетей - ВыборкаДетальныеЗаписи.ПримененныйВычетНаДетей;
									МассивУд[0].ПримененныйВычетНаДетейЛьгота =МассивУд[0].ПримененныйВычетНаДетейЛьгота - ВыборкаДетальныеЗаписи.ПримененныйВычетНаДетейЛьгота;
									МассивУд[0].ПримененныйВычетИмущественныйРасход =МассивУд[0].ПримененныйВычетИмущественныйРасход - ВыборкаДетальныеЗаписи.ПримененныйВычетИмущественныйРасход;
									МассивУд[0].ПримененныйВычетСоциальныйСПроцентами =МассивУд[0].ПримененныйВычетСоциальныйСПроцентами - ВыборкаДетальныеЗаписи.ПримененныйВычетСоциальныйСПроцентами;
									МассивУд[0].ПримененныйВычетСтраховойРасход =МассивУд[0].ПримененныйВычетСтраховойРасход - ВыборкаДетальныеЗаписи.ПримененныйВычетСтраховойРасход;
									МассивУд[0].ПримененныйвычетДополнительный =МассивУд[0].ПримененныйвычетДополнительный - ВыборкаДетальныеЗаписи.ПримененныйвычетДополнительный;
								КонецЕсли;
								
								//Аверсон ЕАЕ 30.12.2021 СВФР-008504
								Если ВыборкаДетальныеЗаписи.ВидРасчета <> ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")
									И ВыборкаДетальныеЗаписи.ВидРасчета <> ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд Тогда
									НовоеПредУдержание = ТЗУдержанияПредВедомость.Добавить();
									ЗаполнитьЗначенияСвойств(НовоеПредУдержание, ВыборкаДетальныеЗаписи);
								КонецЕсли;
								//Аверсон СВФР-008504
								
							КонецЦикла;
							
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					//О.Т. Аверсон 01.02.2017 № 245
					ЗапросАванс = Новый Запрос;
					ЗапросАванс.Текст = 
					"ВЫБРАТЬ
					|	ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов
					|ИЗ
					|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
					|ГДЕ
					|	ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Физлицо = &Физлицо
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Организация = &Организация
					|	И ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов <> 0";
					
					ЗапросАванс.УстановитьПараметр("Организация", Организация);
					если Организация.ДенежноеДовольствие и ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата  Тогда
						ЗапросАванс.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
						ЗапросАванс.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					иначе
						ЗапросАванс.УстановитьПараметр("Период", НачалоМесяца(ДатаНачала));
						ЗапросАванс.УстановитьПараметр("Период1", КонецМесяца(ДатаОкончания));
					КонецЕсли;
					ЗапросАванс.УстановитьПараметр("Физлицо", стрТЗ.ФизЛицо);
					
					РезультатАванс = ЗапросАванс.Выполнить().Выбрать();
					СуммаАванса = 0;
					Пока РезультатАванс.Следующий() Цикл
						СуммаАванса = СуммаАванса+ РезультатАванс.СуммаВзаиморасчетов;
					КонецЦикла;
					Если не ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ДенежноеДовольствиеВыплата Тогда 
						СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма - СуммаАванса;
					КонецЕсли;
					//О.Т. Аверсон 01.02.2017 № 245
					
					//Аверсон ЕАЕ 30.12.2021 СВФР-008504
					ПредРезультат = ?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог);
					Для Каждого ПредУдержание Из ТЗУдержанияПредВедомость Цикл
						ПредРезультат = ПредРезультат - ПредУдержание.Результат;	
					КонецЦикла;
					//СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма-(?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог));
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма - ПредРезультат;
					//Аверсон СВФР-008504
					
				КонецЦикла;
				если ФормироватьПромежуточнуюВедомость Тогда 
					ТЧВедомость = Док.Начисления;
					СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомость.Удалить(ПустаяСтрока);
					КонецЦикла;	
					
					//Аверсон ЕАЕ 30.12.2021 СВФР-008504
					//ТЧВедомость = Док.Удержания;
					//СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
					//Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					//	ТЧВедомость.Удалить(ПустаяСтрока);
					//КонецЦикла;	
					ТЧВедомостьУд = Док.Удержания;
					СтрокиКУдалению =ТЧВедомостьУд.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомостьУд.Удалить(ПустаяСтрока);
					КонецЦикла;	
					//Аверсон СВФР-008504
					
					если ТЧВедомость.Количество()> 0 
						
						//Аверсон ЕАЕ 30.12.2021 СВФР-008504
						ИЛИ ТЧВедомостьУд.Количество()> 0
						//Аверсон СВФР-008504
						
						Тогда 	
						Если ПометкаУдаления Тогда //П.С. 17-12-2015
							Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Иначе	
							Попытка	
								Док.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								Док.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						КонецЕсли;
						ДокументВедомость = Док.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			//О.Т. 03.04.2015 Для госпиталя	
			
		КонецЕсли;
		
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Задолженность И УчетЗадолженностиПоМесяцам Тогда // документ остался со времен учетной политики, когда учет велся без привязки к периодам, просто обнулим суммы
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|			ТОГДА 0
		|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Задолженность И НЕ УчетЗадолженностиПоМесяцам Тогда // если по месяцам, то мы ее тут не считаем (используется документ "Перенос задолженности")
		// при методе учета задолженности не по месяцам расчет задолженности делаем до текущего периода (не включительно): по состоянию на дату парамМесяц
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты
		|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|			ТОГДА ЕСТЬNULL(ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток, 0) / 100 * &парамПроцентВыплаты * &парамПроцент
		|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
		|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
		|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
		|		&парамМесяц,
		|		Организация = &парамОрганизация
		|		    И Физлицо В
		|		        (ВЫБРАТЬ
		|		            ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
		|		        ИЗ
		|		            Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		        ГДЕ
		|		            ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки
		|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОрганизацииОстатки.Физлицо
		|			И (ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток >= 0)
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ВариантРасчета = "ОстаткиСНалогами" Тогда
		Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц)
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты + (&ЗначениеМатПомощь * НачисленияРаботниковОрганизаций.КолМатПомошь)* НачисленияРаботниковОрганизаций.ЗанимаемыхСтавок
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СУММА(ВложенныйЗапрос.Результат) КАК Результат,
			|			ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
			|			СУММА(ВЫБОР
			|					КОГДА ВложенныйЗапрос.Регистратор.ПерваяПоловинаМесяца
			|							И ВложенныйЗапрос.ОсновноеНачисление
			|						ТОГДА 1
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК КолМатПомошь,
			|			ВложенныйЗапрос.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
			
			|		ИЗ
			|			(ВЫБРАТЬ
			|				СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			|				ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|				ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Регистратор,
			|				ИСТИНА КАК ОсновноеНачисление,
			|				РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|			ИЗ
			|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|				ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			|			ГДЕ
			|				ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
			|				И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
			|				И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|				И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|				ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
			|				РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|			
			|			ОБЪЕДИНИТЬ ВСЕ
			|			
			|			ВЫБРАТЬ
			|				СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			|				ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|				ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
			|				ЛОЖЬ,
			|				РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|			ИЗ
			|				РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|				ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			|			ГДЕ
			|				ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
			|				И ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
			|				И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|				И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|				ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
			|				РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ВложенныйЗапрос
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ВложенныйЗапрос.ФизЛицо, ВложенныйЗапрос.ЗанимаемыхСтавок) КАК НачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
			|	НачисленияРаботниковОрганизаций.КолМатПомошь,
			|	НачисленияРаботниковОрганизаций.ЗанимаемыхСтавок
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			СуммаМатпомощь = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания, Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МатПомощьНаОздоровление)).Размер; 
			Запрос.УстановитьПараметр("ЗначениеМатПомощь",СуммаМатпомощь);//О.Т. Аверсон 06.05.2016 № 1028			
			Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
			//О.Т. Аверсон 10.01.2018 № 1426
			ЗапросАлименты = Новый Запрос;
			ЗапросАлименты.Текст = 
			"ВЫБРАТЬ
			|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ КАК СпособРасчетаИЛ,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокумента,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер КАК Размер,
			|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения
			|ИЗ
			|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
			|ГДЕ
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ИсполнительныйЛист
			|	И ПлановыеУдержанияРаботниковОрганизаций.Организация = &Организация
			|	И ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо В(&ФизЛицо)
			|	И ПлановыеУдержанияРаботниковОрганизаций.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
			|	И &Период МЕЖДУ ПлановыеУдержанияРаботниковОрганизаций.Период И ВЫБОР
			|			КОГДА ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА &Период
			|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента,
			|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер";
			
			ЗапросАлименты.УстановитьПараметр("Организация", Организация);
			ЗапросАлименты.УстановитьПараметр("Период", ПериодРегистрации);
			ЗапросАлименты.УстановитьПараметр("ФизЛицо", Зарплата.ВыгрузитьКолонку("ФизЛицо"));
			
			ТЗАлименты = ЗапросАлименты.Выполнить().Выгрузить();
			
			Для Каждого Стр из Зарплата Цикл 
				МассивАлименты = ТЗАлименты.НайтиСтроки(Новый Структура("ФизЛицо",Стр.Физлицо));
				Если МассивАлименты.Количество()>0 Тогда
					Сч = 0;
					Для Каждого стрМассивАлименты из МассивАлименты Цикл 
						Если Сч = 1 Тогда 
							Стр.Примечание = Стр.Примечание + " ";
						КонецЕсли;
						
						Стр.Примечание = Стр.Примечание + стрМассивАлименты.ВидИсполнительногоДокумента +" "+ Строка(стрМассивАлименты.Размер)+?(стрМассивАлименты.СпособРасчетаИЛ = 1,"%","руб.") +" до "+ Формат(стрМассивАлименты.ПериодЗавершения-1,"ДЛФ=Д")+"г.";
						Сч = 1;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			//О.Т. Аверсон 10.01.2018 № 1426
			
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Командировочные Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат)/ 100 * &парамПроцентВыплаты 
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОплатаПоСреднемуЗаработку)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = &парамКомандировка)
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("парамДатаНачала",	ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			Запрос.УстановитьПараметр("парамКомандировка",	Справочники.КлассификаторИспользованияРабочегоВремени.Командировка);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении Тогда 
			если не Организация.ИНН = "100765738" Тогда 
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)/ 100 * &парамПроцентВыплаты 
				|					ИНАЧЕ 0
				|				КОНЕЦ
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
				|					ИНАЧЕ 0
				|				КОНЕЦ
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РасчетПриУвольненииРаботникаОрганизаций)
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
				
				Запрос.УстановитьПараметр("парамДатаНачала",	ДатаНачала);
				Запрос.УстановитьПараметр("парамДатаОкончания", КонецДня(ДатаОкончания)); 
				Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			иначе //О.Т. 03.04.2015 Для госпиталя
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
				|	ВложенныйЗапрос.Авторасчет,
				|	ВложенныйЗапрос.Сотрудник
				|ПОМЕСТИТЬ ВТФизЛица
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
				|		ВЫБОР
				|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|				ТОГДА ВЫБОР
				|						КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|							ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты
				|						ИНАЧЕ 0
				|					КОНЕЦ
				|			ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|		КОНЕЦ КАК Сумма,
				|		ВЫБОР
				|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|				ТОГДА ВЫБОР
				|						КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|							ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
				|						ИНАЧЕ 0
				|					КОНЕЦ
				|			ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|		КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет КАК Авторасчет,
				|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
				|	ИЗ
				|		Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|			ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РасчетПриУвольненииРаботникаОрганизаций)
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
				|	ГДЕ
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|		ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
				|		ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
				|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
				|	ВложенныйЗапрос.Авторасчет,
				|	ВложенныйЗапрос.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВложенныйЗапрос.Сотрудник";
				
				
				
				Запрос.УстановитьПараметр("парамДатаНачала",	ДатаНачала);
				Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания); 
				Запрос.Выполнить();
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат),
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней),
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов),
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование КАК ФизЛицоНаименование
				|ИЗ
				|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|			И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания)//О.Т. Аверсон 09.02.2016 № 869
				|	СГРУППИРОВАТЬ ПО
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	Сумма(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
				|	NULL,
				|	NULL,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование
				|ИЗ
				|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания)//О.Т. Аверсон 09.02.2016 № 869
				|	СГРУППИРОВАТЬ ПО
				|	ВТФизЛица.ФизЛицо,
				|	ВТФизЛица.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛица.ВыплаченностьЗарплаты,
				|	ВТФизЛица.Авторасчет,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.Наименование,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код
				|
				|УПОРЯДОЧИТЬ ПО
				|	ФизЛицоНаименование";
				
				
				
				ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
				
				// Получим реквизиты шапки из запроса
				ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
				// позиционируем выборку
				ВыборкаПоШапкеДокумента.Следующий();
				
				если ЗначениеЗаполнено(ДокументВедомость) Тогда 
					Док = ДокументВедомость.ПолучитьОбъект();
					Док.Начисления.Очистить();
					Док.Удержания.Очистить();
				иначе
					Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
					Док.Дата = Дата;//О.Т. Аверсон 01.12.2015
					Док.Организация = Организация;
				КонецЕсли;
				
				СписокФизлицТекст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Физлицо КАК Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
				|
				|ГДЕ
				|	Работники.Ссылка = &парамРегистратор";
				ДополнительныеПараметрыЗапросаНДФЛ  = Неопределено;
				ВыборкаПодразделений = "";
				
				ТЗАванс = новый ТаблицаЗначений;
				ТЗАванс.Колонки.Добавить("Работник");
				ТЗАванс.Колонки.Добавить("СуммаАванса");
				СуммаАванса = 0;
				ФизЛицоПрошл = "";
				Для Каждого стрТаблицаЗначенийЗП из ТаблицаЗначенийЗП Цикл 
					
					Строка = Док.Начисления.Добавить();
					Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
					Строка.ПериодНачисления = стрТаблицаЗначенийЗП.ПериодДействияНачало;
					Строка.ПериодНачисленияКонец = стрТаблицаЗначенийЗП.ПериодДействияКонец;
					ЗапросПрием = Новый Запрос;
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
					
					ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
					
					
					РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
					Период = ПериодРегистрации;
					Если РезультатЗапросаПрием.Количество()>0 Тогда 
						Период = РезультатЗапросаПрием[0].Период;
					КонецЕсли;
					СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
					Строка.Должность = СведенияОРаботнике.Должность;
					ЗаполнитьЗначенияСвойств(Строка,стрТаблицаЗначенийЗП);
					если стрТаблицаЗначенийЗП.ФизЛицо <> ФизЛицоПрошл Тогда 
						
						ЗапросНДФЛ = Новый Запрос;
						ЗапросНДФЛ.Текст = 
						"ВЫБРАТЬ
						|	СУММА(НДФЛРасчетыСБюджетом.Налог) КАК Налог,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетЛичный) КАК ПримененныйВычетЛичный,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетей) КАК ПримененныйВычетНаДетей,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейИнвалидов) КАК ПримененныйВычетНаДетейИнвалидов,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйВычетНаДетейЛьгота) КАК ПримененныйВычетНаДетейЛьгота,
						|	СУММА(НДФЛРасчетыСБюджетом.ПримененныйДополнительныйВычет) КАК ПримененныйДополнительныйВычет,
						|	НДФЛРасчетыСБюджетом.ФизЛицо,
						|	НДФЛРасчетыСБюджетом.Период,
						|	НДФЛРасчетыСБюджетом.ВидДвижения
						|ИЗ
						|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
						|ГДЕ
						|	НДФЛРасчетыСБюджетом.ФизЛицо = &ФизЛицо
						|	И НДФЛРасчетыСБюджетом.Организация = &Организация
						|	И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ДатаНачала И &ДатаОкончания //О.Т. Аверсон 23.01.2017 № 200
						|
						|СГРУППИРОВАТЬ ПО
						|	НДФЛРасчетыСБюджетом.Период,
						|	НДФЛРасчетыСБюджетом.ФизЛицо,
						|	НДФЛРасчетыСБюджетом.ВидДвижения";
						
						ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", ДатаНачала);
						ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
						ЗапросНДФЛ.УстановитьПараметр("Организация", Организация);
						ЗапросНДФЛ.УстановитьПараметр("ФизЛицо", стрТаблицаЗначенийЗП.ФизЛицо);
						
						РезультатЗапроса = ЗапросНДФЛ.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
							
							Если ВыборкаДетальныеЗаписи.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 
								СтрТЗАванс = ТЗАванс.Добавить();
								СтрТЗАванс.Работник = стрТаблицаЗначенийЗП.ФизЛицо;
								СтрТЗАванс.СуммаАванса = ВыборкаДетальныеЗаписи.Налог;
								Продолжить;
							КонецЕсли;
							
							Строка = Док.Удержания.Добавить();
							
							ЗаполнитьЗначенияСвойств(Строка,ВыборкаДетальныеЗаписи);
							Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
							МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",стрТаблицаЗначенийЗП.ФизЛицо)); 
							Если МассивСотрудник.Количество() > 0 Тогда
								ТекСтрока = МассивСотрудник[0];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
								Строка.Должность = СведенияОРаботнике.Должность; 
								Строка.ТабельныйНомер = стрТаблицаЗначенийЗП.Сотрудник.Код;
							иначе
								СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрТаблицаЗначенийЗП.ФизЛицо.Наименование);
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = СотрудникПодбор.Код;
							КонецЕсли;
							Строка.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог");
							Строка.ПериодУдержания = ВыборкаДетальныеЗаписи.Период;
							
							Строка.Результат = ВыборкаДетальныеЗаписи.Налог;
						КонецЦикла;
						
						ЗапросНДФЛ = Новый Запрос;
						ЗапросНДФЛ.Текст = 
						"ВЫБРАТЬ
						|	ЕСНИсчисленный.ФизЛицо,
						|	СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
						|	ЕСНИсчисленный.Период
						|ИЗ
						|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
						|ГДЕ
						|	ЕСНИсчисленный.ФизЛицо = &ФизЛицо
						|	И ЕСНИсчисленный.Организация = &Организация
						|	И ЕСНИсчисленный.Период МЕЖДУ &ДатаНачала И &ДатаОкончания //О.Т. Аверсон 23.01.2017 № 200
						|
						|СГРУППИРОВАТЬ ПО
						|	ЕСНИсчисленный.Период,
						|	ЕСНИсчисленный.ФизЛицо";
						
						ЗапросНДФЛ.УстановитьПараметр("ДатаНачала", ДатаНачала);
						ЗапросНДФЛ.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
						ЗапросНДФЛ.УстановитьПараметр("Организация", Организация);
						ЗапросНДФЛ.УстановитьПараметр("ФизЛицо", стрТаблицаЗначенийЗП.ФизЛицо);
						
						РезультатЗапроса = ЗапросНДФЛ.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Строка = Док.Удержания.Добавить();   
							Строка.ФизЛицо 						= стрТаблицаЗначенийЗП.ФизЛицо; 
							МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",стрТаблицаЗначенийЗП.ФизЛицо)); 
							Если МассивСотрудник.Количество() > 0 Тогда
								ТекСтрока = МассивСотрудник[0];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", стрТаблицаЗначенийЗП.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",стрТаблицаЗначенийЗП.Сотрудник));
								Строка.Должность = СведенияОРаботнике.Должность;
								Строка.ТабельныйНомер = стрТаблицаЗначенийЗП.Сотрудник.Код; 
							иначе
								СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стрТаблицаЗначенийЗП.ФизЛицо.Наименование);
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
								Строка.Должность = СведенияОРаботнике.Должность;  
								Строка.ТабельныйНомер = СотрудникПодбор.Код;
							КонецЕсли;
							Строка.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
							Строка.ПериодУдержания = ВыборкаДетальныеЗаписи.Период;
							
							Строка.Результат = ВыборкаДетальныеЗаписи.ПенсионныйФонд;
						КонецЦикла;
						
						
						
						
						
					КонецЕсли;
					
					ФизЛицоПрошл = стрТаблицаЗначенийЗП.ФизЛицо;
				КонецЦикла;
				
				
				
				
				
				ВидРасчетаИскл = Новый СписокЗначений;
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
				Запрос.УстановитьПараметр("ВидРасчетаИскл",ВидРасчетаИскл);
				Запрос.УстановитьПараметр("Регистратор",ДокументВедомость);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	БазаНачисления.ФизЛицо,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.Авторасчет,
				|	СУММА(СведенияРасчетноПлатВедомости.Результат) КАК Результат,
				|	СУММА(БазаНачисления.Сумма) КАК Сумма
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВТФизЛица.ФизЛицо КАК ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты КАК ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет КАК Авторасчет,
				|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
				|		СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма
				|	ИЗ
				|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|			ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|				И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания) //О.Т. Аверсон 21.01.2017 № ПериодРегистрации
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.Авторасчет,
				|		ВТФизЛица.ВыплаченностьЗарплаты
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет,
				|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|		СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
				|	ИЗ
				|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
				|			ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛица.ФизЛицо
				|				И (ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &парамДатаНачала И &парамДатаОкончания) //О.Т. Аверсон 21.01.2017 № ПериодРегистрации
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ВТФизЛица.ФизЛицо,
				|		ВТФизЛица.ВыплаченностьЗарплаты,
				|		ВТФизЛица.Авторасчет,
				|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета) КАК БазаНачисления
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СведенияПоРасчетноПлатежнойВедомости.Организация КАК Организация,
				|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо КАК ФизЛицо,
				|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
				|			СУММА(СведенияПоРасчетноПлатежнойВедомости.Результат) КАК Результат
				|		ИЗ
				|			РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
				|		ГДЕ
				|			СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ &ПериодНач И &ПериодКон
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.ВидРасчета В (&ВидРасчетаИскл)
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор
				|		
				|		СГРУППИРОВАТЬ ПО
				|			СведенияПоРасчетноПлатежнойВедомости.Организация,
				|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета,
				|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо) КАК СведенияРасчетноПлатВедомости
				|		ПО БазаНачисления.ФизЛицо = СведенияРасчетноПлатВедомости.ФизЛицо
				|			И БазаНачисления.ВидРасчета = СведенияРасчетноПлатВедомости.ВидРасчета
				|
				|СГРУППИРОВАТЬ ПО
				|	БазаНачисления.Авторасчет,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.ФизЛицо";
				Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
				Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
				ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
				ТаблицаЗначенийЗП = Новый ТаблицаЗначений;
				ТаблицаЗначенийЗП.Колонки.Добавить("Физлицо");
				ТаблицаЗначенийЗП.Колонки.Добавить("ВыплаченностьЗарплаты");
				ТаблицаЗначенийЗП.Колонки.Добавить("Авторасчет");
				ТаблицаЗначенийЗП.Колонки.Добавить("ТабельныйНомер");
				ТаблицаЗначенийЗП.Колонки.Добавить("Сумма");
				ТаблицаЗначенийЗП.Колонки.Добавить("Результат");
				ТаблицаЗначенийЗП.Колонки.Добавить("Налог");
				ТаблицаЗначенийЗП.Колонки.Добавить("ПенсионныйНалог");
				Для каждого стрТЗ Из ТаблицаЗначений Цикл
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВложенныйЗапросПереименовать.Организация КАК Организация,
					|	ВложенныйЗапросПереименовать.ФизЛицо КАК ФизЛицо,
					|	ВложенныйЗапросПереименовать.ВидРасчета КАК ВидРасчета,
					|	ВложенныйЗапросПереименовать.Результат КАК Налог,
					|	ВложенныйЗапрос.Результат КАК ПенсионныйНалог
					|ИЗ
					|	(ВЫБРАТЬ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
					|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК Результат
					|	ИЗ
					|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
					|	ГДЕ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаПенс)
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор
					|	
					|	СГРУППИРОВАТЬ ПО
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация) КАК ВложенныйЗапрос,
					|	(ВЫБРАТЬ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
					|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК Результат,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период КАК Период,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор КАК Регистратор
					|	ИЗ
					|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
					|	ГДЕ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаНДФЛ)
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор
					|	
					|	СГРУППИРОВАТЬ ПО
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период) КАК ВложенныйЗапросПереименовать
					|ГДЕ
					|	ВложенныйЗапросПереименовать.Период МЕЖДУ &ПериодНач И &ПериодКон
					|	И ВложенныйЗапросПереименовать.ВидРасчета В(&ВидРасчетаНДФЛ)
					|	И ВложенныйЗапросПереименовать.ФизЛицо = &ФизЛицо
					|	И НЕ ВложенныйЗапросПереименовать.Регистратор = &Регистратор";
					
					Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
					Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
					Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
					Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
					Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
					Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					СтрТаблицаЗначенийЗП = ТаблицаЗначенийЗП.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТаблицаЗначенийЗП,стрТЗ);
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						СтрТаблицаЗначенийЗП.Налог = ВыборкаДетальныеЗаписи.Налог;
						СтрТаблицаЗначенийЗП.ПенсионныйНалог = ВыборкаДетальныеЗаписи.ПенсионныйНалог;
					КонецЦикла;
					
				КонецЦикла; 
				
				ТЧРасчетнаяВедомость = Док.Начисления;
				ТЧРасчетнаяВедомостьУд = Док.Удержания;
				Зарплата.Очистить();
				Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл
					МассивТЧРасчетнаяВедомость = ТЧРасчетнаяВедомость.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
					МассивТЧРасчетнаяВедомостьУдПенс = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд));
					МассивТЧРасчетнаяВедомостьУдНДФЛ = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")));
					СтрокаЗарплата = Зарплата.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗарплата,стрТЗ);
					Для Каждого СтрПенс из МассивТЧРасчетнаяВедомостьУдПенс Цикл 
						СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрПенс.Результат;		
					КонецЦикла;
					Для Каждого СтрНДФЛ из МассивТЧРасчетнаяВедомостьУдНДФЛ Цикл
						СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрНДФЛ.Результат;
					КонецЦикла;
					//О.Т. Аверсон 01.02.2017 № 245
					ЗапросАванс = Новый Запрос;
					ЗапросАванс.Текст = 
					"ВЫБРАТЬ
					|	ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов
					|ИЗ
					|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
					|ГДЕ
					|	ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Физлицо = &Физлицо
					|	И ВзаиморасчетыСРаботникамиОрганизаций.Организация = &Организация
					|	И ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов <> 0";
					
					ЗапросАванс.УстановитьПараметр("Организация", Организация);
					ЗапросАванс.УстановитьПараметр("Период", НачалоМесяца(ДатаНачала));
					ЗапросАванс.УстановитьПараметр("Период1", КонецМесяца(ДатаОкончания));
					ЗапросАванс.УстановитьПараметр("Физлицо", стрТЗ.ФизЛицо);
					
					РезультатАванс = ЗапросАванс.Выполнить().Выбрать();
					СуммаАванса = 0;
					Пока РезультатАванс.Следующий() Цикл
						СуммаАванса = СуммаАванса+ РезультатАванс.СуммаВзаиморасчетов;
					КонецЦикла;
					
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма - СуммаАванса;
					//О.Т. Аверсон 01.02.2017 № 245
					
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма-(?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог));
				КонецЦикла;
				если ФормироватьПромежуточнуюВедомость Тогда 
					ТЧВедомость = Док.Начисления;
					СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомость.Удалить(ПустаяСтрока);
					КонецЦикла;	
					
					//Аверсон ЕАЕ 30.12.2021 СВФР-008504
					//ТЧВедомость = Док.Удержания;
					//СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
					//Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
					//	ТЧВедомость.Удалить(ПустаяСтрока);
					//КонецЦикла;	
					ТЧВедомостьУд = Док.Удержания;
					СтрокиКУдалению =ТЧВедомостьУд.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомостьУд.Удалить(ПустаяСтрока);
					КонецЦикла;
					//Аверсон СВФР-008504
					
					если ТЧВедомость.Количество()> 0 
						
						//Аверсон ЕАЕ 30.12.2021 СВФР-008504
						ИЛИ ТЧВедомостьУд.Количество()> 0
						//Аверсон СВФР-008504
						
						Тогда 	
						Если ПометкаУдаления Тогда //П.С. 17-12-2015
							Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Иначе	
							Попытка	
								Док.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								Док.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						КонецЕсли;
						ДокументВедомость = Док.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			//О.Т. 03.04.2015 Для госпиталя			
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Премии Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)/ 100 * &парамПроцентВыплаты 
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор)
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("парамРегистратор", ДокументОснование);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления Тогда 
			
			если Организация.ИНН = "100765738" Тогда //О.Т. Аверсон 13.03.2017 № 396
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ИСТИНА КАК Авторасчет,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноДней) КАК ОтработаноДней,
				|	Сумма(ОсновныеНачисленияРаботниковОрганизаций.ОтработаноЧасов) КАК ОтработаноЧасов,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
				|ИЗ
				|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|ГДЕ
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации Между НачалоПериода(&ПарамМесяц,Месяц) и КонецПериода(&ПарамМесяц,Месяц)
				|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
				
				|	СГРУППИРОВАТЬ ПО
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
				|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код   				
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
				|	ИСТИНА,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
				|	Сумма(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|	NULL,
				|	NULL,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
				|ИЗ
				|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|ГДЕ
				|	ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации Между НачалоПериода(&ПарамМесяц,Месяц) и КонецПериода(&ПарамМесяц,Месяц)
				|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор) //О.Т.(К) 11.03.2015 № Убрана группировка
				|	СГРУППИРОВАТЬ ПО
				|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
				|ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
				|ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
				|ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
				|ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код";
				
				Запрос.УстановитьПараметр("ПарамМесяц", ПериодРегистрации);
				МассивДокументов = Новый Массив;
				Если ТабличнаяЧастьДокументОснование.Количество()>0 Тогда
					Для каждого строка Из ТабличнаяЧастьДокументОснование Цикл
						МассивДокументов.Добавить(строка.Основание.Ссылка);		
					КонецЦикла;
				Иначе	
					МассивДокументов.Добавить(ДокументОснование);
				КонецЕсли; 

				Запрос.УстановитьПараметр("парамРегистратор", МассивДокументов);  //список документов обрабатываем

				
				ТаблицаЗначенийЗП = Запрос.Выполнить().Выгрузить();
				
				// Получим реквизиты шапки из запроса
				ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
				// позиционируем выборку
				ВыборкаПоШапкеДокумента.Следующий();
				
				если ЗначениеЗаполнено(ДокументВедомость) Тогда 
					Док = ДокументВедомость.ПолучитьОбъект();
					Док.Начисления.Очистить();
					Док.Удержания.Очистить();
				иначе
					Док = Документы.РасчетноПлатежнаяВедомостьПромежуточная.СоздатьДокумент();
					Док.Дата = Дата;//О.Т. Аверсон 01.12.2015
					Док.Организация = Организация;
				КонецЕсли;
				
				СписокФизлицТекст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Физлицо КАК Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
				|
				|ГДЕ
				|	Работники.Ссылка = &парамРегистратор";
				ДополнительныеПараметрыЗапросаНДФЛ  = Неопределено;
				ВыборкаПодразделений = "";
				
				ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , Ложь, ВыборкаПодразделений,,Истина,МассивДокументов);
				Если ДанныеНДФЛ <> Неопределено Тогда
					ФизлицаСписок = НеОпределено;
					ЗаполнитьНаборЗаписейПоДаннымНДФЛ(, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, ,ФизлицаСписок, "", ВыборкаПодразделений,Док,ТаблицаЗначенийЗП);
				КонецЕсли;			
				
				
				ВидРасчетаИскл = Новый СписокЗначений;
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
				ВидРасчетаИскл.Добавить(ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
				Запрос.УстановитьПараметр("ВидРасчетаИскл",ВидРасчетаИскл);
				Запрос.УстановитьПараметр("Регистратор",ДокументВедомость);
				Запрос.УстановитьПараметр("Ссылка",Ссылка);
				Если Зарплата.Количество() = 0 Тогда
					УсловиеНаСписокФизЛиц = Истина;
				Иначе
					УсловиеНаСписокФизЛиц = "
					|	БазаНачисления.Физлицо В
					|			(ВЫБРАТЬ
					|				Вт_Физлица.Физлицо
					|			ИЗ
					|				Вт_Физлица КАК Вт_Физлица)";
					
				КонецЕсли;	
				Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|ПОМЕСТИТЬ Вт_Физлица
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	БазаНачисления.Физлицо,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.Авторасчет,
				|	БазаНачисления.ТабельныйНомер,
				|	СУММА(БазаНачисления.Сумма) КАК Сумма,
				|	СУММА(СведенияРасчетноПлатВедомости.Результат) КАК Результат
				|ИЗ
				|	( ВЫБРАТЬ
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты,
				|	ВложенныйЗапрос.Авторасчет,
				|	ВложенныйЗапрос.ТабельныйНомер,
				|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
				|	ВложенныйЗапрос.ВидРасчета
				|ИЗ
				|	(ВЫБРАТЬ
				|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК Физлицо,
				|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|		ИСТИНА КАК Авторасчет,
				|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
				|		ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Сумма,
				|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
				|	ИЗ
				|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|	ГДЕ
				|		ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации Между НачалоПериода(&ПарамМесяц,Месяц) и КонецПериода(&ПарамМесяц,Месяц)
				|		И ОсновныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено),
				|		ИСТИНА,
				|		ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.Код,
				|		ДополнительныеНачисленияРаботниковОрганизаций.Результат,
				|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета
				|	ИЗ
				|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|	ГДЕ
				|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации Между НачалоПериода(&ПарамМесяц,Месяц) и КонецПериода(&ПарамМесяц,Месяц)
				|		И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)) КАК ВложенныйЗапрос			
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Физлицо,
				|	ВложенныйЗапрос.ВидРасчета,
				|	ВложенныйЗапрос.Авторасчет,
				|	ВложенныйЗапрос.ТабельныйНомер,
				|	ВложенныйЗапрос.ВыплаченностьЗарплаты) КАК БазаНачисления
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СведенияПоРасчетноПлатежнойВедомости.Организация КАК Организация,
				|			СведенияПоРасчетноПлатежнойВедомости.ФизЛицо КАК ФизЛицо,
				|			СведенияПоРасчетноПлатежнойВедомости.ВидРасчета КАК ВидРасчета,
				|			СведенияПоРасчетноПлатежнойВедомости.Результат КАК Результат
				|		ИЗ
				|			РегистрСведений.СведенияПоРасчетноПлатежнойВедомости КАК СведенияПоРасчетноПлатежнойВедомости
				|		ГДЕ
				|			СведенияПоРасчетноПлатежнойВедомости.Период МЕЖДУ НачалоПериода(&ПарамМесяц,Месяц) И КонецПериода(&ПарамМесяц,Месяц)
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.ВидРасчета В (&ВидРасчетаИскл)
				|			И НЕ СведенияПоРасчетноПлатежнойВедомости.Регистратор = &Регистратор) КАК СведенияРасчетноПлатВедомости
				|		ПО БазаНачисления.Физлицо = СведенияРасчетноПлатВедомости.ФизЛицо
				|			И БазаНачисления.ВидРасчета = СведенияРасчетноПлатВедомости.ВидРасчета
				|ГДЕ " + УсловиеНаСписокФизЛиц + "
				|
				|СГРУППИРОВАТЬ ПО
				|	БазаНачисления.Авторасчет,
				|	БазаНачисления.ВыплаченностьЗарплаты,
				|	БазаНачисления.Физлицо,
				|	БазаНачисления.ТабельныйНомер";
				ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
				ТаблицаЗначенийЗП = Новый ТаблицаЗначений;
				ТаблицаЗначенийЗП.Колонки.Добавить("Физлицо");
				ТаблицаЗначенийЗП.Колонки.Добавить("ВыплаченностьЗарплаты");
				ТаблицаЗначенийЗП.Колонки.Добавить("Авторасчет");
				ТаблицаЗначенийЗП.Колонки.Добавить("ТабельныйНомер");
				ТаблицаЗначенийЗП.Колонки.Добавить("Сумма");
				ТаблицаЗначенийЗП.Колонки.Добавить("Результат");
				ТаблицаЗначенийЗП.Колонки.Добавить("Налог");
				ТаблицаЗначенийЗП.Колонки.Добавить("ПенсионныйНалог");
				Для каждого стрТЗ Из ТаблицаЗначений Цикл
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
					|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
					|	СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
					|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Налог,
					|	ВложенныйЗапрос.Результат КАК ПенсионныйНалог
					|ИЗ
					|	РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания,
					|	(ВЫБРАТЬ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация КАК Организация,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо КАК ФизЛицо,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета КАК ВидРасчета,
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат КАК Результат
					|	ИЗ
					|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
					|	ГДЕ
					|		СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаПенс)
					|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос
					|ГДЕ
					|	СведенияПоРасчетноПлатежнойВедомостиУдержания.Период МЕЖДУ &ПериодНач И &ПериодКон
					|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета В(&ВидРасчетаНДФЛ)
					|	И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
					|	И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор";
					
					Запрос.УстановитьПараметр("ВидРасчетаНДФЛ", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
					Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
					Запрос.УстановитьПараметр("ПериодНач", ДатаНачала);
					Запрос.УстановитьПараметр("ПериодКон", КонецДня(ДатаОкончания));
					Запрос.УстановитьПараметр("ФизЛицо", стрТЗ.ФизЛицо);
					Запрос.УстановитьПараметр("Регистратор", ДокументВедомость);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					СтрТаблицаЗначенийЗП = ТаблицаЗначенийЗП.Добавить();
					ЗаполнитьЗначенияСвойств(СтрТаблицаЗначенийЗП,стрТЗ);
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						СтрТаблицаЗначенийЗП.Налог = ВыборкаДетальныеЗаписи.Налог;
						СтрТаблицаЗначенийЗП.ПенсионныйНалог = ВыборкаДетальныеЗаписи.ПенсионныйНалог;
					КонецЦикла;
					
				КонецЦикла; 
				
				ТЧРасчетнаяВедомость = Док.Начисления;
				ТЧРасчетнаяВедомостьУд = Док.Удержания;
				Зарплата.Очистить();
				Для Каждого стрТЗ из ТаблицаЗначенийЗП Цикл
					МассивТЧРасчетнаяВедомость = ТЧРасчетнаяВедомость.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
					//П.С. 18.12.2015 № СВ00-000764
					МассивТЧРасчетнаяВедомостьУд = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо",стрТЗ.ФизЛицо));
					
					//МассивТЧРасчетнаяВедомостьУдПенс = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд));
					//МассивТЧРасчетнаяВедомостьУдНДФЛ = ТЧРасчетнаяВедомостьУд.НайтиСтроки(Новый Структура("ФизЛицо,ВидРасчета",стрТЗ.ФизЛицо,ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")));
					СтрокаЗарплата = Зарплата.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗарплата,стрТЗ);
					//Для Каждого СтрПенс из МассивТЧРасчетнаяВедомостьУдПенс Цикл 
					//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрПенс.Результат;		
					//КонецЦикла;
					//Для Каждого СтрНДФЛ из МассивТЧРасчетнаяВедомостьУдНДФЛ Цикл
					//	СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрНДФЛ.Результат;
					//КонецЦикла;
					
					Для Каждого СтрУд из МассивТЧРасчетнаяВедомостьУд Цикл 
						СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма- СтрУд.Результат;		
					КонецЦикла;
					
					СтрокаЗарплата.Сумма = СтрокаЗарплата.Сумма-(?(стрТЗ.Результат=Null,0,стрТЗ.Результат)-?(стрТЗ.ПенсионныйНалог=Null или стрТЗ.ПенсионныйНалог=Неопределено,0,стрТЗ.ПенсионныйНалог)-?(стрТЗ.Налог=Null или стрТЗ.Налог=Неопределено,0,стрТЗ.Налог));
				КонецЦикла;
				если ФормироватьПромежуточнуюВедомость Тогда 
					ТЧВедомость = Док.Начисления;
					СтрокиКУдалению =ТЧВедомость.НайтиСтроки(Новый Структура("Результат",0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомость.Удалить(ПустаяСтрока);
					КонецЦикла;	
					ТЧВедомостьУ = Док.Удержания;
					СтрокиКУдалению =ТЧВедомостьУ.НайтиСтроки(Новый Структура("ПримененныйВычетЛичный,ПримененныйВычетНаДетей,ПримененныйВычетНаДетейЛьгота,ПримененныйвычетДополнительный,ПримененныйВычетИмущественныйРасход,ПримененныйВычетСоциальныйСПроцентами,ПримененныйВычетСтраховойРасход,Результат", 0,0,0,0,0,0,0,0));
					Для Каждого ПустаяСтрока из СтрокиКУдалению Цикл
						ТЧВедомостьУ.Удалить(ПустаяСтрока);
					КонецЦикла;	
					
					
					если ТЧВедомость.Количество()> 0 или ТЧВедомостьУ.Количество()> 0 Тогда 	
						Если ПометкаУдаления Тогда //П.С. 17-12-2015
							Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Иначе	
							Попытка	
								Док.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								Док.Записать(РежимЗаписиДокумента.Запись);
							КонецПопытки;
						КонецЕсли;
						ДокументВедомость = Док.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
				//О.Т. Аверсон 13.03.2017 № 396	
			иначе
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты
				|					ИНАЧЕ 0
				|				КОНЕЦ
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) / 100 * &парамПроцентВыплаты * &парамПроцент
				|					ИНАЧЕ 0
				|				КОНЕЦ
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				|			ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат
				|		ИЗ
				|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|		ГДЕ
				|			ОсновныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
				|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|			ДополнительныеНачисленияРаботниковОрганизаций.Результат
				|		ИЗ
				|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ГДЕ
				|			ДополнительныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
				|			И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц) КАК НачисленияРаботниковОрганизаций
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";  
				МассивДокументов = Новый Массив;
				Если ТабличнаяЧастьДокументОснование.Количество()>0 Тогда
					Для каждого строка Из ТабличнаяЧастьДокументОснование Цикл
						МассивДокументов.Добавить(строка.Основание.Ссылка);		
					КонецЦикла;
				Иначе	
					МассивДокументов.Добавить(ДокументОснование);
				КонецЕсли; 
				Запрос.УстановитьПараметр("парамРегистратор", МассивДокументов);
				Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
				
			КонецЕсли;
			
			
		КонецЕсли;
	ИначеЕсли ВариантРасчета = "ОстаткиЗаВычетомНалогов" или ВариантРасчета = "ОстаткиЗаВычетомНалоговБезВычетов" Тогда 
		//О.Т. 20.01.2015 № 17804
		//СтавкаНДФЛ = РегистрыСведений.ШкалаПодоходногоНалога.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).Налог;
		//СтавкаПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("ВидОтчисления",Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)).Размер;
		//СтавкаОбщ = СтавкаНДФЛ+СтавкаПенс;
		//О.Т. 20.01.2015 № 17804
		МассивСпособовРасчета = Новый Массив;
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентом);
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);//О.Т. Аверсон 24.05.2017 № 665
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела);//О.Т. Аверсон 24.05.2017 № 665
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.Процентом);
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП); //О.Т. Аверсон 04.11.2016 № 1501
		//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы);
		МассивСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор);
		Запрос.УстановитьПараметр("УдержанияПроцентом",	МассивСпособовРасчета);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		//Запрос.УстановитьПараметр("СтавкаОбщ",	СтавкаОбщ); //О.Т. 20.01.2015 № 17804
		
		КоэфПлановыхУдержаний = "ЕСТЬNULL(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано, 0)";
		//Островская Татьяна 22.11.2012 № 16010
		ТаблицаПлановыхУдержаний = "ВЫБРАТЬ
		|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
		|			СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения) КАК ВсегоУдержано
		
		//|			ВЫБОР
		//|					КОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &парамМесяц
		//|							И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|						ТОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения
		//|					ИНАЧЕ ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения
		//|				КОНЕЦ) КАК ВсегоУдержано
		|		ИЗ
		|			РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
		|					&парамМесяц,
		|					Организация = &ГоловнаяОрганизация
		|						И ВидРасчета.СпособРасчета В (&УдержанияПроцентом)
		|						И Физлицо В
		|							(ВЫБРАТЬ
		|								ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
		|							ИЗ
		|								Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|							ГДЕ
		|								ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо";
		//Островская Татьяна 22.11.2012 № 16010
		ТаблицаНДФЛ = "РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
		|				&парамМесяц,
		|				Физлицо В
		|					(ВЫБРАТЬ
		|						ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
		|					ИЗ
		|						Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|					ГДЕ
		|						ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка))";
		
		//О.Т. Аверсон 29.03.2016 № 950
		КоэфНДФЛ = "ВЫБОР
		|	КОГДА ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
		|		ТОГДА 30
		|	ИНАЧЕ выбор когда ВТФизЛицаСНалогообл.СтавкаЕсть = 1 тогда ВТФизЛицаСНалогообл.СтавкаИнд иначе ВТФизЛицаСНалогообл.Ставка конец
		|КОНЕЦ";
		
		//О.Т. Аверсон 11.11.2016 № 24
		КоэфНДФЛНалог = "ВЫБОР
		|	КОГДА ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
		|		ТОГДА 30
		|	ИНАЧЕ выбор когда ВТФизЛицаСНалогообл.СтавкаЕсть = 1 тогда ВТФизЛицаСНалогообл.СтавкаИндНДФЛ иначе ВТФизЛицаСНалогообл.СтавкаНДФЛ конец
		|КОНЕЦ";
		КоэфНДФЛПФ = "ВЫБОР
		|	КОГДА ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
		|		ТОГДА 0
		|	ИНАЧЕ выбор когда ВТФизЛицаСНалогообл.СтавкаЕсть = 1 тогда ВТФизЛицаСНалогообл.СтавкаИндПФ иначе ВТФизЛицаСНалогообл.СтавкаПФ конец
		|КОНЕЦ";
		//О.Т. Аверсон 11.11.2016 № 24
		
		ЗапросСотрудники = Новый Запрос;
		ЗапросСотрудники.УстановитьПараметр("Период", КонецМесяца(ПериодРегистрации));
		ЗапросСотрудники.УстановитьПараметр("Организация", Организация);
		ЗапросСотрудники.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка,
		|	СотрудникиОрганизаций.Физлицо,
		|	СотрудникиОрганизаций.ВидНалогообложенияОсновной,
		|	РаботникиОрганизацийСрезПоследних.Регистратор,
		|	СотрудникиОрганизаций.Наименование КАК Наименование
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
		|			ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник
		|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = СотрудникиОрганизаций.Физлицо
		|ГДЕ
		|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		ЗапросСотрудники.УстановитьПараметр("Ссылка",Ссылка);
		РезультатЗапросаСотр = ЗапросСотрудники.Выполнить().Выбрать();
		Массив = Новый Массив; 
		КЧ = Новый КвалификаторыЧисла(10, 2);
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		ТаблЗначФизЛица = новый ТаблицаЗначений;
		ТаблЗначФизЛица.Колонки.Добавить("ФизЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ТаблЗначФизЛица.Колонки.Добавить("ВидНалогообложения",Новый ОписаниеТипов("СправочникСсылка.ВидыНалогообложения"));
		ТаблЗначФизЛица.Колонки.Добавить("Ставка",ОписаниеТиповЧ);
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаНДФЛ",ОписаниеТиповЧ); //О.Т. Аверсон 11.11.2016 № 24
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаПФ",ОписаниеТиповЧ); //О.Т. Аверсон 11.11.2016 № 24
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаЕсть",ОписаниеТиповЧ); // 1 или 0
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаИнд",ОписаниеТиповЧ);
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаИндНДФЛ",ОписаниеТиповЧ);//О.Т. Аверсон 11.11.2016 № 24
		ТаблЗначФизЛица.Колонки.Добавить("СтавкаИндПФ",ОписаниеТиповЧ);//О.Т. Аверсон 11.11.2016 № 24
		ФизЛицоПрошл = "";
		Пока РезультатЗапросаСотр.Следующий() Цикл
			Если не ТипЗнч(РезультатЗапросаСотр.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда 
				МассивТаблЗнач = ТаблЗначФизЛица.НайтиСтроки(Новый Структура("ФизЛицо",РезультатЗапросаСотр.ФизЛицо));
				Если МассивТаблЗнач.Количество()=0 Тогда 
					СтрТаблЗначФизЛица = ТаблЗначФизЛица.Добавить();
					СтрТаблЗначФизЛица.ФизЛицо = РезультатЗапросаСотр.ФизЛицо;
					Если РезультатЗапросаСотр.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
						ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
					иначе
						ВидНалогообложения = РезультатЗапросаСотр.ВидНалогообложенияОсновной;
					КонецЕсли;
					ЗапросШкала = Новый Запрос;
					ЗапросШкала.Текст = "ВЫБРАТЬ
					|	ШкалаПодоходногоНалогаСрезПоследних.Налог
					|ИЗ
					|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(
					|			&КонецПериода,
					|			Организация = &Организация
					|				И ВидНалогообложения = &ВидНалогообложения) КАК ШкалаПодоходногоНалогаСрезПоследних
					|
					|УПОРЯДОЧИТЬ ПО
					|	ШкалаПодоходногоНалогаСрезПоследних.НижнийПредел";
					ЗапросШкала.УстановитьПараметр("КонецПериода", ПериодРегистрации);
					ЗапросШкала.УстановитьПараметр("Организация", Организация);
					ЗапросШкала.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
					Шкала = ЗапросШкала.Выполнить().Выгрузить();
					СтрТаблЗначФизЛица.Ставка = 0;
					СтрТаблЗначФизЛица.СтавкаНДФЛ = 0;//О.Т. Аверсон 11.11.2016 № 24
					Для Каждого СтрШкала из Шкала Цикл 
						СтрТаблЗначФизЛица.Ставка = СтрШкала.Налог;
						СтрТаблЗначФизЛица.СтавкаНДФЛ = СтрШкала.Налог;
					КонецЦикла;
					СтрТаблЗначФизЛица.Ставка = СтрТаблЗначФизЛица.Ставка + РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения)).Размер;
					СтрТаблЗначФизЛица.СтавкаПФ = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),
					Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения)).Размер;
					
					ЗапросИндСтавкаНалогообл = Новый Запрос;
					ЗапросИндСтавкаНалогообл.Текст = 
					"ВЫБРАТЬ
					|	ИноеНалогообложениеПоСотрудникамСрезПоследних.НДФЛ,
					|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
					|ИЗ
					|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
					|			&Период,
					|			Организация = &Организация
					|				И ВидНалогообложения = &ВидНалогообложения
					|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
					
					ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
					ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
					ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ПериодРегистрации);
					ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", РезультатЗапросаСотр.Ссылка); 
					РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
					ЕстьИндивидСтавка = Ложь;
					СтавкаФСЗН = 0;
					СтавкаБГС = 0;
					СтрТаблЗначФизЛица.СтавкаЕсть = 0;
					Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
						СтрТаблЗначФизЛица.СтавкаЕсть = 1;
						СтрТаблЗначФизЛица.СтавкаИнд = РезИндСтавкаНалогообл[0].НДФЛ + РезИндСтавкаНалогообл[0].ПенсионныйФонд;
						СтрТаблЗначФизЛица.СтавкаИндНДФЛ = РезИндСтавкаНалогообл[0].НДФЛ;//О.Т. Аверсон 11.11.2016 № 24
						СтрТаблЗначФизЛица.СтавкаИндПФ = РезИндСтавкаНалогообл[0].ПенсионныйФонд;//О.Т. Аверсон 11.11.2016 № 24
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			МассивТаблЗнач = ТаблЗначФизЛица.НайтиСтроки(Новый Структура("ФизЛицо",РезультатЗапросаСотр.ФизЛицо));
			Если МассивТаблЗнач.Количество()=0 и ФизЛицоПрошл <> РезультатЗапросаСотр.ФизЛицо и ФизЛицоПрошл <> "" Тогда 
				СтрТаблЗначФизЛица = ТаблЗначФизЛица.Добавить();
				СтрТаблЗначФизЛица.ФизЛицо = РезультатЗапросаСотр.ФизЛицо;
				Если РезультатЗапросаСотр.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
					ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
				иначе
					ВидНалогообложения = РезультатЗапросаСотр.ВидНалогообложенияОсновной;
				КонецЕсли;
				ЗапросШкала = Новый Запрос;
				ЗапросШкала.Текст = "ВЫБРАТЬ
				|	ШкалаПодоходногоНалогаСрезПоследних.Налог
				|ИЗ
				|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(
				|			&КонецПериода,
				|			Организация = &Организация
				|				И ВидНалогообложения = &ВидНалогообложения) КАК ШкалаПодоходногоНалогаСрезПоследних
				|
				|УПОРЯДОЧИТЬ ПО
				|	ШкалаПодоходногоНалогаСрезПоследних.НижнийПредел";
				ЗапросШкала.УстановитьПараметр("КонецПериода", ПериодРегистрации);
				ЗапросШкала.УстановитьПараметр("Организация", Организация);
				ЗапросШкала.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
				Шкала = ЗапросШкала.Выполнить().Выгрузить();
				СтрТаблЗначФизЛица.Ставка = 0;
				СтрТаблЗначФизЛица.СтавкаНДФЛ = 0;
				Для Каждого СтрШкала из Шкала Цикл 
					СтрТаблЗначФизЛица.Ставка = СтрШкала.Налог;
					СтрТаблЗначФизЛица.СтавкаНДФЛ = СтрШкала.Налог;
				КонецЦикла;
				СтрТаблЗначФизЛица.Ставка = СтрТаблЗначФизЛица.Ставка + РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),
				Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения)).Размер;
				
				СтрТаблЗначФизЛица.СтавкаПФ = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),
				Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения)).Размер;
				
				
				
				ЗапросИндСтавкаНалогообл = Новый Запрос;
				ЗапросИндСтавкаНалогообл.Текст = 
				"ВЫБРАТЬ
				|	ИноеНалогообложениеПоСотрудникамСрезПоследних.НДФЛ,
				|	ИноеНалогообложениеПоСотрудникамСрезПоследних.ПенсионныйФонд
				|ИЗ
				|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
				|			&Период,
				|			Организация = &Организация
				|				И ВидНалогообложения = &ВидНалогообложения
				|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
				
				ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
				ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
				ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ПериодРегистрации);
				ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", РезультатЗапросаСотр.Ссылка); 
				РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
				ЕстьИндивидСтавка = Ложь;
				СтавкаФСЗН = 0;
				СтавкаБГС = 0;
				СтрТаблЗначФизЛица.СтавкаЕсть = 0;
				Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
					СтрТаблЗначФизЛица.СтавкаЕсть = 1;
					СтрТаблЗначФизЛица.СтавкаИнд = РезИндСтавкаНалогообл[0].НДФЛ + РезИндСтавкаНалогообл[0].ПенсионныйФонд;
					СтрТаблЗначФизЛица.СтавкаИндНДФЛ = РезИндСтавкаНалогообл[0].НДФЛ;//О.Т. Аверсон 11.11.2016 № 24
					СтрТаблЗначФизЛица.СтавкаИндПФ = РезИндСтавкаНалогообл[0].ПенсионныйФонд;//О.Т. Аверсон 11.11.2016 № 24
				КонецЕсли;
				
			КонецЕсли; 		
			ФизЛицоПрошл = РезультатЗапросаСотр.ФизЛицо;
		КонецЦикла;
		ТекстФИзЛицаПоНалогообл = "ВЫБРАТЬ
		|	ТаблицаФизЛиц.ФизЛицо,
		|	ТаблицаФизЛиц.Ставка,
		|	ТаблицаФизЛиц.СтавкаНДФЛ,
		|	ТаблицаФизЛиц.СтавкаПФ,
		|	ТаблицаФизЛиц.СтавкаЕсть,
		|	ТаблицаФизЛиц.СтавкаИнд,
		|	ТаблицаФизЛиц.СтавкаИндНДФЛ,
		|	ТаблицаФизЛиц.СтавкаИндПФ //О.Т. Аверсон 11.11.2016 № 24
		|ПОМЕСТИТЬ ВТФизЛицаСНалогообл
		|ИЗ
		|	&ТЗ КАК ТаблицаФизЛиц";
		Запрос.Текст = ТекстФИзЛицаПоНалогообл;
		Запрос.УстановитьПараметр("ТЗ",ТаблЗначФизЛица);
		Запрос.Выполнить();
		//О.Т. Аверсон 28.03.2016 № 950
		
		//Аверсон ЕАЕ 07.08.2025 СВФР-016347
		//Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда 
		//	
		//	Запрос.УстановитьПараметр("парамПричинаПоБеременности", Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
		//	
		//	// у больничных КоэфНДФЛ может быть нулевым: ОсновныеНачисленияРаботниковОрганизаций.Регистратор.ПричинаНетрудоспособности.Ссылка
		//	Запрос.Текст =
		//	"ВЫБРАТЬ
		//	|	Больничные.Физлицо КАК Физлицо,
		//	|	ВЫБОР
		//	|		КОГДА Больничные.Авторасчет
		//	|			ТОГДА ВЫБОР
		//	|					КОГДА СУММА(Больничные.Результат) > 0
		//	|						ТОГДА ВЫБОР
		//	|								КОГДА " + КоэфПлановыхУдержаний + " + 
		//	|									ВЫБОР
		//	|										КОГДА Больничные.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам) 
		//	|											ТОГДА 0 
		//	|										ИНАЧЕ " + КоэфНДФЛ + "
		//	|									КОНЕЦ >= 100
		//	|									ТОГДА 0
		//	|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(Больничные.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2)) -
		//	|									ВЫБОР
		//	|										КОГДА Больничные.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам) ТОГДА
		//	|											ВЫРАЗИТЬ(СУММА(Больничные.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
		//	|										ИНАЧЕ 0
		//	|									КОНЕЦ
		//	|							КОНЕЦ
		//	|					ИНАЧЕ 0
		//	|				КОНЕЦ / 100 * &парамПроцентВыплаты
		//	|		ИНАЧЕ СУММА(Больничные.Сумма)
		//	|	КОНЕЦ КАК Сумма,
		//	|	ВЫБОР
		//	|		КОГДА Больничные.Авторасчет
		//	|			ТОГДА ВЫБОР
		//	|					КОГДА СУММА(Больничные.Результат) > 0
		//	|						ТОГДА ВЫБОР
		//	|								КОГДА " + КоэфПлановыхУдержаний + " + 
		//	|									ВЫБОР
		//	|										КОГДА Больничные.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам) 
		//	|											ТОГДА 0 
		//	|										ИНАЧЕ " + КоэфНДФЛ + "
		//	|									КОНЕЦ >= 100
		//	|									ТОГДА 0
		//	|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(Больничные.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2)) -
		//	|									ВЫБОР
		//	|										КОГДА Больничные.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам) ТОГДА
		//	|											ВЫРАЗИТЬ(СУММА(Больничные.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
		//	|										ИНАЧЕ 0
		//	|									КОНЕЦ
		//	|							КОНЕЦ
		//	|					ИНАЧЕ 0
		//	|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
		//	|		ИНАЧЕ СУММА(Больничные.КомпенсацияЗаЗадержкуЗарплаты)
		//	|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
		//	|	Больничные.ВыплаченностьЗарплаты КАК ВыплаченностьЗарплаты,
		//	|	Больничные.Авторасчет КАК Авторасчет,
		//	|	Больничные.НомерСтроки КАК НомерСтроки
		//	|ИЗ
		//	|	(ВЫБРАТЬ
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо КАК Физлицо,
		//	|		ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Документ.НачислениеПоБольничномуЛисту).ПричинаНетрудоспособности КАК ПричинаНетрудоспособности,
		//	|		ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат,
		//	|		ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.Сумма КАК Сумма,
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК КомпенсацияЗаЗадержкуЗарплаты,
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет КАК Авторасчет,
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
		//	|	ИЗ
		//	|		Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
		//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//	|			ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо
		//	|				И (ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Документ.НачислениеПоБольничномуЛисту).Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
		//	|				И (ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
		//	|				И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
		//	|				И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц)
		//	|	ГДЕ
		//	|		ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка) КАК Больничные
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		//	|		ПО Больничные.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
		//	|		ПО Больничные.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
		//	
		//	//Аверсон ЕАЕ 30.07.2025 СВФР-016347
		//	//|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
		//	|		ПО Больничные.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо
		//	//Аверсон СВФР-016347
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
		//	|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
		//	|	Больничные.ВыплаченностьЗарплаты,
		//	|	Больничные.Физлицо,
		//	|	Больничные.НомерСтроки,
		//	|	Больничные.Авторасчет,
		//	|	Больничные.ПричинаНетрудоспособности,
		//	|	ВТФизЛицаСНалогообл.Ставка,
		//	
		//	//Аверсон ЕАЕ 30.07.2025 СВФР-016347
		//	|   ВТФизЛицаСНалогообл.СтавкаЕсть,
		//	|   ВТФизЛицаСНалогообл.СтавкаИнд
		//	//Аверсон СВФР-016347
		//	
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	Больничные.НомерСтроки";
		//	
		//	Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
		//	Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
		//	Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		//ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные Тогда
		Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда
		//Аверсон СВФР-016347
			
			//О.Т. Аверсон 16.03.2017 № 301
			СписокФизлицТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Работники.Физлицо КАК Физлицо
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
			|
			|ГДЕ
			|	Работники.Ссылка = &парамРегистратор";
			
			ДополнительныеПараметрыЗапросаНДФЛ = Неопределено;
			
			
			ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , Ложь, Неопределено);
			
			
			ТекущееФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			ТекущийГод = 0;
			
			ТаблицаПН = Новый ТаблицаЗначений;
			ТаблицаПН.Колонки.Добавить("ФизЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
			ТаблицаПН.Колонки.Добавить("Период");
			Массив = Новый Массив; 
			КЧ = Новый КвалификаторыЧисла(10, 2);
			Массив.Добавить(Тип("Число"));
			ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
			
			ТаблицаПН.Колонки.Добавить("СтандартныеВычеты",ОписаниеТиповЧ);
			//ТаблицаПН.Колонки.Добавить("ЛичныйВычет");
			
			УжеПрименилиЛичный = 0;
			УжеПрименилиДетский = 0;
			УжеПрименилиДетскийЛьгота = 0;
			УжеПрименилиДополнительный = 0;
			
			ВычетыПримененныеДетский = 0;
			ВычетыПримененныеЛичный = 0;
			ВычетыПримененныеДетскийЛьгота = 0;
			ВычетыПримененныеДополнительный = 0;
			
			Пока ДанныеНДФЛ.Следующий() цикл
				Если ТекущееФизлицо <> ДанныеНДФЛ.ФизЛицо ИЛИ ТекущийГод <> Год(ДанныеНДФЛ.Период) Тогда
					
					УжеПрименили312 = 0;
					УжеПрименили311 = 0;
					
					// уже примененные вычеты
					УжеПрименилиЛичный = 0;
					УжеПрименилиДетский = 0;
					УжеПрименилиДетскийЛьгота = 0;
					УжеПрименилиДополнительный = 0;
					ТекущееФизлицо = ДанныеНДФЛ.ФизЛицо;
					ТекущийГод = Год(ДанныеНДФЛ.Период);
					
				КонецЕсли;  
				
				
				ВычетыПримененныеДетский = (ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.РанееПримененныеВычетыДетские - УжеПрименилиДетский);
				
				ВычетыПримененныеЛичный = ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.РанееПримененныеВычетыЛичные - УжеПрименилиЛичный;
				ВычетыПримененныеДетскийЛьгота = ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота  - ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьгота  - УжеПрименилиДетскийЛьгота;
				ВычетыПримененныеДополнительный =  ДанныеНДФЛ.ПримененныеВычетыДополнительные - ДанныеНДФЛ.РанееПримененныеВычетыДополнительные - УжеПрименилиДополнительный;
				
				
				ОграничениеНДФЛ = РегистрыСведений.НДФЛРазмерВычетов.ПолучитьПоследнее(ДанныеНДФЛ.Период, Новый Структура("КодВычета",Справочники.ВычетыНДФЛ.Код640страх)).ОграничениеПоДоходам;
				
				
				Вычеты312Остаток = ДанныеНДФЛ.Вычет312Остаток - УжеПрименили312;
				ВычетыПримененные312ЗаМесяц = ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц;//Вычеты312Остаток; // не видит примененный выяет   04.12.2024 СВФР-014359
				
				//О.Т. Аверсон 23.08.2016 № 
				Если ДанныеНДФЛ.Период = Дата(2016,07,01) Тогда 
					УжеПрименили311 = ОбщегоНазначения.ОкруглитьЗначение2016(УжеПрименили311/10000,ПериодРегистрации);
				КонецЕсли;
				
				
				Вычеты311Остаток = ДанныеНДФЛ.Вычет311Остаток - УжеПрименили311;                                                                         
				ВычетыПримененные311ЗаМесяц = ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;//Вычеты311Остаток; // не видит примененный выяет  04.12.2024 СВФР-014359
				
				ГодПредыдущий = ДанныеНДФЛ.Период;
				
				
				ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц;			
				
				
				Запрос1 = Новый Запрос;
				Запрос1.Текст = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА ВложенныйЗапрос.Имя > 1
				|			ТОГДА РазмерВычета611.РазмерВРублях * ВложенныйЗапрос.Имя
				|		ИНАЧЕ ВложенныйЗапрос.РазмерВРублях * ВложенныйЗапрос.Имя
				|	КОНЕЦ КАК РазмерВРубляхДо18,
				|	NULL КАК РазмерВРубляхПосле18,
				|	NULL КАК РазмерВРублях611,
				|	NULL КАК РазмерВРублях620
				|ИЗ
				|	(ВЫБРАТЬ
				|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
				|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
				|	ИЗ
				|		(ВЫБРАТЬ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
				|		ГДЕ
				|			РАЗНОСТЬДАТ(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения, &ДатаВычета, МЕСЯЦ) <= 216
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код610)
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
				|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
				|		
				|		СГРУППИРОВАТЬ ПО
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ВЫБОР
				|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
				|						ТОГДА 0
				|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
				|				КОНЕЦ КАК Поле1,
				|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
				|			ИЗ
				|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
				|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
				|	
				|	СГРУППИРОВАТЬ ПО
				|		РазмерВычета.РазмерВРублях) КАК ВложенныйЗапрос,
				|	(ВЫБРАТЬ
				|		ВЫБОР
				|			КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
				|				ТОГДА 0
				|			ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
				|		КОНЕЦ КАК Поле1,
				|		НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|		НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
				|	ИЗ
				|		РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних
				|	ГДЕ
				|		НДФЛРазмерВычетовСрезПоследних.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код611)) КАК РазмерВычета611
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	Дети610После18.РазмерВРублях * Дети610После18.Имя,
				|	NULL,
				|	NULL
				|ИЗ
				|	(ВЫБРАТЬ
				|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
				|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
				|	ИЗ
				|		(ВЫБРАТЬ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
				|		ГДЕ
				|			РАЗНОСТЬДАТ(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения, &ДатаВычета, МЕСЯЦ) > 216
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код610)
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
				|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
				|		
				|		СГРУППИРОВАТЬ ПО
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ВЫБОР
				|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
				|						ТОГДА 0
				|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
				|				КОНЕЦ КАК Поле1,
				|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
				|			ИЗ
				|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
				|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
				|	
				|	СГРУППИРОВАТЬ ПО
				|		РазмерВычета.РазмерВРублях) КАК Дети610После18
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	NULL,
				|	Дети611.РазмерВРублях * Дети611.Имя,
				|	NULL
				|ИЗ
				|	(ВЫБРАТЬ
				|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
				|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
				|	ИЗ
				|		(ВЫБРАТЬ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
				|		ГДЕ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код611)
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
				|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
				|		
				|		СГРУППИРОВАТЬ ПО
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ВЫБОР
				|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
				|						ТОГДА 0
				|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
				|				КОНЕЦ КАК Поле1,
				|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
				|			ИЗ
				|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
				|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
				|	
				|	СГРУППИРОВАТЬ ПО
				|		РазмерВычета.РазмерВРублях) КАК Дети611
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	NULL,
				|	NULL,
				|	NULL,
				|	Код620.РазмерВРублях
				|ИЗ
				|	(ВЫБРАТЬ
				|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
				|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
				|	ИЗ
				|		(ВЫБРАТЬ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
				|		ИЗ
				|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
				|		ГДЕ
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код620)
				|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
				|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
				|			И ВЫБОР
				|					КОГДА НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА ИСТИНА
				|					ИНАЧЕ НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
				|				КОНЕЦ
				|		
				|		СГРУППИРОВАТЬ ПО
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
				|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ВЫБОР
				|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
				|						ТОГДА 0
				|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
				|				КОНЕЦ КАК Поле1,
				|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
				|			ИЗ
				|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
				|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
				|	
				|	СГРУППИРОВАТЬ ПО
				|		РазмерВычета.РазмерВРублях) КАК Код620";
				
				Запрос1.УстановитьПараметр("ДатаВычета", ДанныеНДФЛ.Период);
				Запрос1.УстановитьПараметр("Физлицо", ТекущееФизлицо);
				
				РезультатЗапроса = Запрос1.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВычетыСтанд = 0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Запрос2 = Новый Запрос;                   // проверка на применяеость вычетов если нет то и давать нечего  СВФР-014359 04.12.24 
					Запрос2.Текст =
					"ВЫБРАТЬ
					|	НДФЛПрименениеВычетов.Физлицо КАК Физлицо,
					|	НДФЛПрименениеВычетов.Организация,
					|	НДФЛПрименениеВычетов.Период КАК Период
					|ИЗ
					|	РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
					|ГДЕ
					|	НДФЛПрименениеВычетов.Организация = &Организация
					|	И НДФЛПрименениеВычетов.Физлицо = &Физлицо";
					Запрос2.УстановитьПараметр("Физлицо", ТекущееФизлицо);
					Запрос2.УстановитьПараметр("Организация", Организация);
					
					РезультатЗапроса2 = Запрос2.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса2.Выбрать();
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл  						
						ВычетыСтанд = ВычетыСтанд + ?(ВыборкаДетальныеЗаписи.РазмерВРубляхДо18 = null,0,ВыборкаДетальныеЗаписи.РазмерВРубляхДо18) + 
						?(ВыборкаДетальныеЗаписи.РазмерВРубляхПосле18 = Null,0,ВыборкаДетальныеЗаписи.РазмерВРубляхПосле18) +
						?(ВыборкаДетальныеЗаписи.РазмерВРублях611 = Null,0,ВыборкаДетальныеЗаписи.РазмерВРублях611) + 
						?(ВыборкаДетальныеЗаписи.РазмерВРублях620=null,0,ВыборкаДетальныеЗаписи.РазмерВРублях620);
					КонецЦикла;    					
				КонецЦикла;
				
				
				УжеПрименилиЛичный = УжеПрименилиЛичный + ВычетыПримененныеЛичный;
				УжеПрименилиДетский = УжеПрименилиДетский + ВычетыПримененныеДетский;
				УжеПрименилиДетскийЛьгота = УжеПрименилиДетскийЛьгота + ВычетыПримененныеДетскийЛьгота;
				УжеПрименилиДополнительный = УжеПрименилиДополнительный + ВычетыПримененныеДополнительный;
				Если ВычетыПримененныеДетский + ВычетыПримененныеЛичный + ВычетыПримененныеДетскийЛьгота + УжеПрименилиДополнительный>0 или ВычетыСтанд>0 Тогда 
					МассивТаблицаПН = ТаблицаПН.НайтиСтроки(Новый Структура("Физлицо,Период",ТекущееФизлицо,ДанныеНДФЛ.Период));
					Если МассивТаблицаПН.Количество()=0 Тогда 
						СтрТаблицаПН = ТаблицаПН.Добавить();
						СтрТаблицаПН.ФизЛицо = ТекущееФизлицо;
						СтрТаблицаПН.Период = ДанныеНДФЛ.Период;
						Если ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд Тогда 
							СтрТаблицаПН.СтандартныеВычеты =ДанныеНДФЛ.ДоходЗаПериод;
						ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные312ЗаМесяц Тогда
							СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
							УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
						ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные311ЗаМесяц Тогда
							СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
							УжеПрименили312 = УжеПрименили312 + ВычетыПримененные311ЗаМесяц;
							
						ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные312ЗаМесяц+ВычетыПримененные311Мес Тогда
							СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
							УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
							УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311Мес;
						Иначе 
							СтрТаблицаПН.СтандартныеВычеты = ВычетыПримененныеЛичный+ ВычетыСтанд-(ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЗаМесяц+ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьготаЗаМесяц+ДанныеНДФЛ.РанееПримененныеВычетыДополнительныеЗаМесяц)+ВычетыПримененные312ЗаМесяц-ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц+ВычетыПримененные311Мес-ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
							УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
							УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311Мес;
							
						КонецЕсли;
					КонецЕсли;
					//СтрТаблицаПН.ЛичныйВычет = ВычетыПримененныеЛичный;
				КонецЕсли;
				
			КонецЦикла;
			ТаблицаПН.Свернуть("ФизЛицо","СтандартныеВычеты");
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаВычеты.ФизЛицо,
			|	ТаблицаВычеты.СтандартныеВычеты
			|ПОМЕСТИТЬ ВТВычеты
			|ИЗ
			|	&ТаблицаВычеты КАК ТаблицаВычеты"; 
			Запрос.УстановитьПараметр("ТаблицаВычеты",ТаблицаПН); 
			Запрос.Выполнить();
			//О.Т. Аверсон 16.03.2017 № 301		
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				Запрос.Текст =
				
				//СВЭЙ 04.10.2023 КВВ СВФР-011559 (
				"ВЫБРАТЬ 
				|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета, //СВЭЙ 06.12.2023 КВВ СВФР-011881
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) КАК ПериодДействияНачало
				|ПОМЕСТИТЬ ВтОснНачРезультатДляПФ
				|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|ГДЕ
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
				|И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
				|И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				|СГРУППИРОВАТЬ ПО 
				|ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета, //СВЭЙ 06.12.2023 КВВ СВФР-011881
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				|ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
				|НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ)
				|;
				//СВЭЙ 04.10.2023 КВВ СВФР-011559 )
				
				|ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) <0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец
				|									- СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) //О.Т. Аверсон 11.11.2016 № 24
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты + Сумма(НачисленияРаботниковОрганизаций.МатПомощь) * НачисленияРаботниковОрганизаций.ЗанимаемыхСтавок
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2))<0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец  как ПодоходныйНалог,
				|	СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) как ПенсионныйФонд,
				|	СУММА(ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) как Вычеты,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|							ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,";
				
			иначе 				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) <0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец
				|									- СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) //О.Т. Аверсон 11.11.2016 № 24
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты + Сумма(НачисленияРаботниковОрганизаций.МатПомощь)* НачисленияРаботниковОрганизаций.ЗанимаемыхСтавок
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2))<0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец  как ПодоходныйНалог,
				|	СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) как ПенсионныйФонд,
				|	0 как Вычеты,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			|	ВТФизЛицаСНалогообл.Ставка
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	Сумма(ВложенныйЗапрос.Результат) КАК Результат,
			|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
			|	Сумма(ВложенныйЗапрос.РезультатДляПФ) КАК РезультатДляПФ, 
			|	Сумма(ВЫБОР
			|		КОГДА ВложенныйЗапрос.Регистратор.ПерваяПоловинаМесяца и ВложенныйЗапрос.ОсновноеНачисление
			|			ТОГДА &ЗначениеМатПомощь
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК МатПомощь,
			|	ВложенныйЗапрос.ЗанимаемыхСтавок
			|ИЗ
			|	(ВЫБРАТЬ
			|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Регистратор,
			|	null КАК РезультатДляПФ,
			|	ИСТИНА КАК ОсновноеНачисление,
			|	NULL КАК ПериодРегистрации,
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|				ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			|			И (ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
			|	И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
			|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
			
			|СГРУППИРОВАТЬ ПО
			|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаПФ,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд,
			|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			
			
			|ОБЪЕДИНИТЬ ВСЕ
			
			|ВЫБРАТЬ
			|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
			|	Null,
			|	ЛОЖЬ,
			|	NULL,
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|ИЗ
			|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|				ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			|		ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			|			И (ВЫБОР
			|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|ГДЕ
			|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
			|	И ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
			|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
			
			|СГРУППИРОВАТЬ ПО
			|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаПФ,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд,
			|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			
			|ОБЪЕДИНИТЬ ВСЕ
			
			
			|ВЫБРАТЬ
			|	null КАК Результат,";
			
			//СВЭЙ 04.10.2023 КВВ СВФР-011559 (
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				Запрос.Текст = Запрос.Текст + "
				|ВтОснНачРезультатДляПФ.Сотрудник.ФизЛицо,
				|ВтОснНачРезультатДляПФ.Регистратор,
				|ВЫРАЗИТЬ(
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту ТОГДА 0 ИНАЧЕ
				//Аверсон СВФР-016347
				
				|ВЫБОР КОГДА ((НЕ &ТолькоТекущий) 
				|ИЛИ (&ТолькоТекущий И ВтОснНачРезультатДляПФ.ПериодДействияНачало = &парамМесяц))
				|ТОГДА
				|ВЫБОР
				|КОГДА Сумма(ВтОснНачРезультатДляПФ.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|ТОГДА Сумма(ВтОснНачРезультатДляПФ.Результат)
				|ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 
				|ИНАЧЕ 0 
				|КОНЕЦ
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|КОНЕЦ
				//Аверсон СВФР-016347
				
				|КАК ЧИСЛО(15,2)),
				|ИСТИНА,
				|ВтОснНачРезультатДляПФ.ПериодДействияНачало,";
			Иначе
				//СВЭЙ 04.10.2023 КВВ СВФР-011559 )
				
				Запрос.Текст = Запрос.Текст + "
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				
				//Аверсон 15.08.2023 КВВ СВФР-011039 (
				//|	ВЫРАЗИТЬ(ВЫБОР
				//|			КОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|				ТОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат)
				//|			ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|		КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 КАК ЧИСЛО(15,2)),
				
				|ВЫРАЗИТЬ(
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|ВЫБОР КОГДА ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту ТОГДА 0 ИНАЧЕ
				//Аверсон СВФР-016347
				
				|ВЫБОР КОГДА ((НЕ &ТолькоТекущий) 
				|ИЛИ (&ТолькоТекущий И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &парамМесяц))
				|ТОГДА
				|ВЫБОР
				|			КОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|				ТОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат)
				|			ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|		КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 
				|ИНАЧЕ 0 
				|КОНЕЦ
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|КОНЕЦ
				//Аверсон СВФР-016347
				
				|КАК ЧИСЛО(15,2)),
				//Аверсон 15.08.2023 КВВ СВФР-011039 )
				
				|	ИСТИНА,
				|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ),";
			КонецЕсли;
			
			
			Запрос.Текст = Запрос.Текст + "
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
			|				ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
			
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			|			И (ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо";
			
			//СВЭЙ 04.10.2023 КВВ СВФР-011559 (
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				Запрос.Текст = Запрос.Текст + "
				|ЛЕВОЕ СОЕДИНЕНИЕ ВтОснНачРезультатДляПФ
				|ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = ВтОснНачРезультатДляПФ.Сотрудник
				|И ОсновныеНачисленияРаботниковОрганизаций.Регистратор = ВтОснНачРезультатДляПФ.Регистратор
				|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ВтОснНачРезультатДляПФ.ВидРасчета //СВЭЙ 06.12.2023 КВВ СВФР-011881
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = ВтОснНачРезультатДляПФ.ПериодРегистрации
				|И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = ВтОснНачРезультатДляПФ.ПериодДействияНачало";
			КонецЕсли;
			//СВЭЙ 04.10.2023 КВВ СВФР-011559 )
			
			Запрос.Текст = Запрос.Текст + "
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
			|	И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
			|	И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц";
			
			//Аверсон 15.08.2023 КВВ СВФР-011039 ( (закомментировано)
			////Аверсон 21.07.2023 КВВ СВФР-011039 (
			//|И ВЫБОР КОГДА &ТолькоТекущий 
			//|ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &парамМесяц 
			//|ИНАЧЕ ИСТИНА
			//|КОНЕЦ
			////Аверсон 21.07.2023 КВВ СВФР-011039 )
			//Аверсон 15.08.2023 КВВ СВФР-011039 ) (закомментировано)
			
			//СВЭЙ 04.10.2023 КВВ СВФР-011559 (
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				Запрос.Текст = Запрос.Текст + "
				|И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = ВтОснНачРезультатДляПФ.Сотрудник
				|И ОсновныеНачисленияРаботниковОрганизаций.Регистратор = ВтОснНачРезультатДляПФ.Регистратор
				|И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ВтОснНачРезультатДляПФ.ВидРасчета //СВЭЙ 06.12.2023 КВВ СВФР-011881
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = ВтОснНачРезультатДляПФ.ПериодРегистрации
				|И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = ВтОснНачРезультатДляПФ.ПериодДействияНачало
				|СГРУППИРОВАТЬ ПО
				|ВтОснНачРезультатДляПФ.Сотрудник.Физлицо,
				
				//Аверсон ЕАЕ 08.08.2025 СВФР-016347
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				//Аверсон СВФР-016347
				
				|ВтОснНачРезультатДляПФ.Регистратор,";
			Иначе
				//СВЭЙ 04.10.2023 КВВ СВФР-011559 )
				
				Запрос.Текст = Запрос.Текст + "
				|СГРУППИРОВАТЬ ПО
				|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор,";
			КонецЕсли;
			
			
			Запрос.Текст = Запрос.Текст + "			
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаПФ,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд,
			|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,";
			
			
			//СВЭЙ 04.10.2023 КВВ СВФР-011559 (
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				Запрос.Текст = Запрос.Текст + "
				|ВтОснНачРезультатДляПФ.ПериодДействияНачало,
				|ВЫБОР КОГДА &ТолькоТекущий = ИСТИНА ТОГДА
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|ИНАЧЕ
				|ВтОснНачРезультатДляПФ.ПериодДействияНачало
				|КОНЕЦ,";
			Иначе
				//СВЭЙ 04.10.2023 КВВ СВФР-011559 )
				
				Запрос.Текст = Запрос.Текст + "
				|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ),
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,"; //Аверсон 15.08.2023 КВВ СВФР-011039
			КонецЕсли;
			
			Запрос.Текст = Запрос.Текст + "
			|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ВложенныйЗапрос
			|	СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.ФизЛицо,
			|	ВложенныйЗапрос.ЗанимаемыхСтавок) КАК НачисленияРаботниковОрганизаций //О.Т. Аверсон 06.05.2016 № 1028
			
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычеты КАК ВТВычеты
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТВычеты.ФизЛицо //О.Т. Аверсон 16.03.2017 № 301
			|
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
			|	НачисленияРаботниковОрганизаций.ЗанимаемыхСтавок,
			|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|	ВТФизЛицаСНалогообл.СтавкаПФ,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд,
			|	ВТФизЛицаСНалогообл.СтавкаИндНДФЛ,
			|	ВТФизЛицаСНалогообл.СтавкаИндПФ, 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			СуммаМатпомощь = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания, Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МатПомощьНаОздоровление)).Размер; 
			Запрос.УстановитьПараметр("ЗначениеМатПомощь",СуммаМатпомощь);//О.Т. Аверсон 06.05.2016 № 1028
			Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			//О.Т. Аверсон 11.11.2016 № 24
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			Запрос.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
			//О.Т. Аверсон 11.11.2016 № 24
			Запрос.УстановитьПараметр("ТолькоТекущий", РасчетДопПенсииИПФБезБудПериода); //Аверсон 21.07.2023 КВВ СВФР-011039
			
			//Аверсон ЕАЕ 07.08.2025 СВФР-016347
			Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.НачислениеОтпускаРаботникамОрганизаций", "Документ.НачислениеПоБольничномуЛисту");
			КонецЕсли;
			//Аверсон СВФР-016347
			
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
			//О.Т. Аверсон 10.01.2018 № 1426
			ЗапросАлименты = Новый Запрос;
			ЗапросАлименты.Текст = 
			"ВЫБРАТЬ
			|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ КАК СпособРасчетаИЛ,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокумента,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер КАК Размер,
			|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения
			|ИЗ
			|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
			|ГДЕ
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ИсполнительныйЛист
			|	И ПлановыеУдержанияРаботниковОрганизаций.Организация = &Организация
			|	И ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо В(&ФизЛицо)
			|	И ПлановыеУдержанияРаботниковОрганизаций.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
			|	И &Период МЕЖДУ ПлановыеУдержанияРаботниковОрганизаций.Период И ВЫБОР
			|			КОГДА ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА &Период
			|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента,
			|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ,
			|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер";
			
			ЗапросАлименты.УстановитьПараметр("Организация", Организация);
			ЗапросАлименты.УстановитьПараметр("Период", ПериодРегистрации);
			ЗапросАлименты.УстановитьПараметр("ФизЛицо", Зарплата.ВыгрузитьКолонку("ФизЛицо"));
			
			ТЗАлименты = ЗапросАлименты.Выполнить().Выгрузить();
			
			Для Каждого Стр из Зарплата Цикл 
				МассивАлименты = ТЗАлименты.НайтиСтроки(Новый Структура("ФизЛицо",Стр.Физлицо));
				Если МассивАлименты.Количество()>0 Тогда
					Сч = 0;
					Для Каждого стрМассивАлименты из МассивАлименты Цикл 
						Если Сч = 1 Тогда 
							Стр.Примечание = Стр.Примечание + " ";
						КонецЕсли;
						
						Стр.Примечание = Стр.Примечание + стрМассивАлименты.ВидИсполнительногоДокумента +" "+ Строка(стрМассивАлименты.Размер)+?(стрМассивАлименты.СпособРасчетаИЛ = 1,"%","руб.") +" до "+ Формат(стрМассивАлименты.ПериодЗавершения-1,"ДЛФ=Д")+"г.";
						Сч = 1;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			//О.Т. Аверсон 10.01.2018 № 1426
			
			//Аверсон ЕАЕ 24.08.2022 СВФР-009465
			//Доп.пенсия
			Если Организация.УчетДополнительнойПенсии Тогда
				ТекстДопПенсия = "
				|ВЫБРАТЬ
				|Сумма(ВложенныйЗапрос.Результат) КАК Результат,
				|ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
				|Сумма(ВложенныйЗапрос.ДопПенсия) КАК ДопПенсия, 
				|ВложенныйЗапрос.ЗанимаемыхСтавок
				|ИЗ
				|(ВЫБРАТЬ
				|СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Регистратор,
				|null КАК ДопПенсия,
				|ИСТИНА КАК ОсновноеНачисление,
				|NULL КАК ПериодРегистрации,
				|РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
				|ИЗ
				|РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|			ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
				|
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц) КАК СтавкиДопПенсии
				|	ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				|ГДЕ
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
				|И 
				|ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
				|И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				
				|СГРУППИРОВАТЬ ПО
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				|СтавкиДопПенсии.ПроцентРаботника,
				|РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
				
				|ОБЪЕДИНИТЬ ВСЕ
				
				|ВЫБРАТЬ
				|СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
				|Null,
				|ЛОЖЬ,
				|NULL,
				|РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
				|ИЗ
				|РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|			ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц) КАК СтавкиДопПенсии
				|	ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				|ГДЕ
				|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
				|	И ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
				|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
				|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
				
				|СГРУППИРОВАТЬ ПО
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
				|	СтавкиДопПенсии.ПроцентРаботника,
				|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
				
				|ОБЪЕДИНИТЬ ВСЕ
				
				|ВЫБРАТЬ
				|null КАК Результат,
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				
				//Аверсон 15.08.2023 КВВ СВФР-011039 (
				//|ВЫРАЗИТЬ(ВЫБОР
				//|		КОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|			ТОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат)
				//|		ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|	КОНЕЦ * ЕСТЬNULL(СтавкиДопПенсии.ПроцентРаботника,0) / 100 КАК Число(15,2)),
				
				|ВЫРАЗИТЬ(
				|ВЫБОР КОГДА ((НЕ &ТолькоТекущий) 
				|ИЛИ (&ТолькоТекущий И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &парамМесяц))
				|ТОГДА
				|ВЫБОР
				|		КОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|			ТОГДА Сумма(ОсновныеНачисленияРаботниковОрганизаций.Результат)
				|		ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|	КОНЕЦ * ЕСТЬNULL(СтавкиДопПенсии.ПроцентРаботника,0) / 100 
				|ИНАЧЕ 0 
				|КОНЕЦ
				|КАК ЧИСЛО(15,2)),
				//Аверсон 15.08.2023 КВВ СВФР-011039 )
				
				|ИСТИНА,
				|НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ),
				|РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
				|ИЗ
				|РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|			ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
				
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц) КАК СтавкиДопПенсии
				|	ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				|ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				|	И (ВЫБОР
				|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				|		ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				|	КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				
				|ГДЕ
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания
				|И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация
				|И ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				
				//Аверсон 15.08.2023 КВВ СВФР-011039 ( (закомментировано)
				////Аверсон 21.07.2023 КВВ СВФР-011039 (
				//|И ВЫБОР КОГДА &ТолькоТекущий 
				//|ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &парамМесяц 
				//|ИНАЧЕ ИСТИНА
				//|КОНЕЦ
				////Аверсон 21.07.2023 КВВ СВФР-011039 )
				//Аверсон 15.08.2023 КВВ СВФР-011039 ) (закомментировано)
				
				|СГРУППИРОВАТЬ ПО
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
				|СтавкиДопПенсии.ПроцентРаботника,
				|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				|НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ),
				|ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, //Аверсон 15.08.2023 КВВ СВФР-011039
				|РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ВложенныйЗапрос
				|СГРУППИРОВАТЬ ПО
				|ВложенныйЗапрос.ФизЛицо,
				|ВложенныйЗапрос.ЗанимаемыхСтавок";
				
				//Аверсон ЕАЕ 07.08.2025 СВФР-016347
				Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда
					ТекстДопПенсия = СтрЗаменить(ТекстДопПенсия, "Документ.НачислениеОтпускаРаботникамОрганизаций", "Документ.НачислениеПоБольничномуЛисту");	
				КонецЕсли;
				//Аверсон СВФР-016347
				
				ЗапросДопПенсия = Новый Запрос;
				ЗапросДопПенсия.Текст = ТекстДопПенсия;
				ЗапросДопПенсия.УстановитьПараметр("парамДатаНачала", ДатаНачала);
				ЗапросДопПенсия.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
				ЗапросДопПенсия.УстановитьПараметр("парамМесяц", ПериодРегистрации);
				ЗапросДопПенсия.УстановитьПараметр("парамОрганизация", Организация);
				ЗапросДопПенсия.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
				ЗапросДопПенсия.УстановитьПараметр("ТолькоТекущий", РасчетДопПенсииИПФБезБудПериода); //Аверсон 21.07.2023 КВВ СВФР-011039
				
				ТЗДопПенсия = ЗапросДопПенсия.Выполнить().Выгрузить();
				Для Каждого Стр Из Зарплата Цикл
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ФизЛицо", Стр.Физлицо);
					МассивДопПенсия = ТЗДопПенсия.НайтиСтроки(СтруктураОтбора);
					Для Каждого Эл Из МассивДопПенсия Цикл
						//Стр.ДопПенсия = Стр.ДопПенсия + Эл.ДопПенсия;
						Стр.ДопПенсия = Стр.ДопПенсия + ?(ЗначениеЗаполнено(Эл.ДопПенсия),Эл.ДопПенсия,0); //Аверсон 15.08.2023 КВВ СВФР-011039
					КонецЦикла;
					Стр.Сумма = Стр.Сумма - Стр.ДопПенсия;
				КонецЦикла;
			КонецЕсли;
			//Аверсон СВФР-009465
			
			//Аверсон 11.01.2023 КВВ СВФР-010099 (
			Для Каждого Стр Из Зарплата Цикл
				Если (Стр.Сумма + Стр.ПенсионныйФонд) < Стр.Вычеты Тогда
					Стр.Вычеты = Стр.Сумма + Стр.ПенсионныйФонд;
				КонецЕсли;
			КонецЦикла;
			//Аверсон 11.01.2023 КВВ СВФР-010099 )
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Командировочные Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА ВЫБОР
			|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
			|									ТОГДА 0
			|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			|									- ВЫРАЗИТЬ(СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
			|							КОНЕЦ
			|						ИНАЧЕ 0
			|				КОНЕЦ / 100 * &парамПроцентВыплаты
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА ВЫБОР
			|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
			|									ТОГДА 0
			|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			|									- ВЫРАЗИТЬ(СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
			|							КОНЕЦ
			|						ИНАЧЕ 0
			|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОплатаПоСреднемуЗаработку)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц)
			|			И (ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = &парамКомандировка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
			|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("парамДатаНачала",	ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания",	ДатаОкончания);
			Запрос.УстановитьПараметр("парамКомандировка",	Справочники.КлассификаторИспользованияРабочегоВремени.Командировка);
			
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении Тогда 
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА ВЫБОР
			|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
			|									ТОГДА 0
			|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 2))
			|							КОНЕЦ
			|						ИНАЧЕ 0
			|				КОНЕЦ / 100 * &парамПроцентВыплаты
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА ВЫБОР
			|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
			|									ТОГДА 0
			|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 2))
			|							КОНЕЦ
			|						ИНАЧЕ 0
			|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.Дата МЕЖДУ &парамДатаНачала И &парамДатаОкончания)
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &парамОрганизация)
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.РасчетПриУвольненииРаботникаОрганизаций)
			|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
			|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.УстановитьПараметр("парамДатаНачала", ДатаНачала);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			Запрос.УстановитьПараметр("парамДатаОкончания", ДатаОкончания);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Премии Тогда 
			//
			//ПСА 12.11.2021 СВФР-008301 +++
			Если ВариантРасчета = "ОстаткиЗаВычетомНалогов" Тогда
				СписокФизлицТекст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Работники.Физлицо КАК Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
				|
				|ГДЕ
				|	Работники.Ссылка = &парамРегистратор";
				
				ДополнительныеПараметрыЗапросаНДФЛ = Неопределено;
				
				
				ДанныеНДФЛ = ПроведениеРасчетов.ПолучитьДанныеНДФЛПоРегистратору(Неопределено, Неопределено, ПериодРегистрации, Организация, Организация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапросаНДФЛ, , Ложь, Неопределено);
				
				
				ТекущееФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
				ТекущийГод = 0;
				
				ТаблицаПН = Новый ТаблицаЗначений;
				ТаблицаПН.Колонки.Добавить("ФизЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
				ТаблицаПН.Колонки.Добавить("Период");
				Массив = Новый Массив; 
				КЧ = Новый КвалификаторыЧисла(10, 2);
				Массив.Добавить(Тип("Число"));
				ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
				
				ТаблицаПН.Колонки.Добавить("СтандартныеВычеты",ОписаниеТиповЧ);
				//ТаблицаПН.Колонки.Добавить("ЛичныйВычет");
				
				УжеПрименилиЛичный = 0;
				УжеПрименилиДетский = 0;
				УжеПрименилиДетскийЛьгота = 0;
				УжеПрименилиДополнительный = 0;
				
				ВычетыПримененныеДетский = 0;
				ВычетыПримененныеЛичный = 0;
				ВычетыПримененныеДетскийЛьгота = 0;
				ВычетыПримененныеДополнительный = 0;
				
				Пока ДанныеНДФЛ.Следующий() цикл
					Если ТекущееФизлицо <> ДанныеНДФЛ.ФизЛицо ИЛИ ТекущийГод <> Год(ДанныеНДФЛ.Период) Тогда
						
						УжеПрименили312 = 0;
						УжеПрименили311 = 0;
						
						// уже примененные вычеты
						УжеПрименилиЛичный = 0;
						УжеПрименилиДетский = 0;
						УжеПрименилиДетскийЛьгота = 0;
						УжеПрименилиДополнительный = 0;
						ТекущееФизлицо = ДанныеНДФЛ.ФизЛицо;
						ТекущийГод = Год(ДанныеНДФЛ.Период);
						
					КонецЕсли;  
					
					
					ВычетыПримененныеДетский = (ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.РанееПримененныеВычетыДетские - УжеПрименилиДетский);
					
					ВычетыПримененныеЛичный = ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.РанееПримененныеВычетыЛичные - УжеПрименилиЛичный;
					ВычетыПримененныеДетскийЛьгота = ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота  - ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьгота  - УжеПрименилиДетскийЛьгота;
					ВычетыПримененныеДополнительный =  ДанныеНДФЛ.ПримененныеВычетыДополнительные - ДанныеНДФЛ.РанееПримененныеВычетыДополнительные - УжеПрименилиДополнительный;
					
					
					ОграничениеНДФЛ = РегистрыСведений.НДФЛРазмерВычетов.ПолучитьПоследнее(ДанныеНДФЛ.Период, Новый Структура("КодВычета",Справочники.ВычетыНДФЛ.Код640страх)).ОграничениеПоДоходам;
					
					
					Вычеты312Остаток = ДанныеНДФЛ.Вычет312Остаток - УжеПрименили312;
					ВычетыПримененные312ЗаМесяц = Вычеты312Остаток;
					
					//О.Т. Аверсон 23.08.2016 № 
					Если ДанныеНДФЛ.Период = Дата(2016,07,01) Тогда 
						УжеПрименили311 = ОбщегоНазначения.ОкруглитьЗначение2016(УжеПрименили311/10000,ПериодРегистрации);
					КонецЕсли;
					
					
					Вычеты311Остаток = ДанныеНДФЛ.Вычет311Остаток - УжеПрименили311;
					ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
					
					ГодПредыдущий = ДанныеНДФЛ.Период;
					
					
					ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц;			
					
					
					Запрос1 = Новый Запрос;
					Запрос1.Текст = 
					"ВЫБРАТЬ
					|	ВЫБОР
					|		КОГДА ВложенныйЗапрос.Имя > 1
					|			ТОГДА РазмерВычета611.РазмерВРублях * ВложенныйЗапрос.Имя
					|		ИНАЧЕ ВложенныйЗапрос.РазмерВРублях * ВложенныйЗапрос.Имя
					|	КОНЕЦ КАК РазмерВРубляхДо18,
					|	NULL КАК РазмерВРубляхПосле18,
					|	NULL КАК РазмерВРублях611,
					|	NULL КАК РазмерВРублях620
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
					|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
					|	ИЗ
					|		(ВЫБРАТЬ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
					|		ИЗ
					|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
					|		ГДЕ
					|			РАЗНОСТЬДАТ(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения, &ДатаВычета, МЕСЯЦ) <= 216
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код610)
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
					|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
					|		
					|		СГРУППИРОВАТЬ ПО
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|				ВЫБОР
					|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
					|						ТОГДА 0
					|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
					|				КОНЕЦ КАК Поле1,
					|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
					|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
					|			ИЗ
					|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
					|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
					|	
					|	СГРУППИРОВАТЬ ПО
					|		РазмерВычета.РазмерВРублях) КАК ВложенныйЗапрос,
					|	(ВЫБРАТЬ
					|		ВЫБОР
					|			КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
					|				ТОГДА 0
					|			ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
					|		КОНЕЦ КАК Поле1,
					|		НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
					|		НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
					|	ИЗ
					|		РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних
					|	ГДЕ
					|		НДФЛРазмерВычетовСрезПоследних.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код611)) КАК РазмерВычета611
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	NULL,
					|	Дети610После18.РазмерВРублях * Дети610После18.Имя,
					|	NULL,
					|	NULL
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
					|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
					|	ИЗ
					|		(ВЫБРАТЬ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
					|		ИЗ
					|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
					|		ГДЕ
					|			РАЗНОСТЬДАТ(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаРождения, &ДатаВычета, МЕСЯЦ) > 216
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код610)
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
					|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
					|		
					|		СГРУППИРОВАТЬ ПО
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|				ВЫБОР
					|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
					|						ТОГДА 0
					|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
					|				КОНЕЦ КАК Поле1,
					|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
					|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
					|			ИЗ
					|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
					|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
					|	
					|	СГРУППИРОВАТЬ ПО
					|		РазмерВычета.РазмерВРублях) КАК Дети610После18
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	NULL,
					|	NULL,
					|	Дети611.РазмерВРублях * Дети611.Имя,
					|	NULL
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
					|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
					|	ИЗ
					|		(ВЫБРАТЬ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
					|		ИЗ
					|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
					|		ГДЕ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код611)
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
					|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
					|		
					|		СГРУППИРОВАТЬ ПО
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|				ВЫБОР
					|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
					|						ТОГДА 0
					|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
					|				КОНЕЦ КАК Поле1,
					|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
					|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
					|			ИЗ
					|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
					|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
					|	
					|	СГРУППИРОВАТЬ ПО
					|		РазмерВычета.РазмерВРублях) КАК Дети611
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	NULL,
					|	NULL,
					|	NULL,
					|	Код620.РазмерВРублях
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(ВложенныйЗапрос.Имя) КАК Имя,
					|		РазмерВычета.РазмерВРублях КАК РазмерВРублях
					|	ИЗ
					|		(ВЫБРАТЬ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя КАК Имя,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет КАК ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета КАК КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка КАК Ссылка
					|		ИЗ
					|			Документ.НДФЛСтандартныеВычетыФизлиц.СоставСемьи КАК НДФЛСтандартныеВычетыФизлицСоставСемьи
					|		ГДЕ
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка.Физлицо = &Физлицо
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код620)
					|			И НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет = ИСТИНА
					|			И НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаНачалаВычета, МЕСЯЦ) <= &ДатаВычета
					|			И ВЫБОР
					|					КОГДА НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|						ТОГДА ИСТИНА
					|					ИНАЧЕ НДФЛСтандартныеВычетыФизлицСоставСемьи.ДатаКонцаВычета >= &ДатаВычета
					|				КОНЕЦ
					|		
					|		СГРУППИРОВАТЬ ПО
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Ссылка,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.КодВычета,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.ПрименятьВычет,
					|			НДФЛСтандартныеВычетыФизлицСоставСемьи.Имя) КАК ВложенныйЗапрос
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|				ВЫБОР
					|					КОГДА НДФЛРазмерВычетовСрезПоследних.КодВычета ЕСТЬ NULL 
					|						ТОГДА 0
					|					ИНАЧЕ НДФЛРазмерВычетовСрезПоследних.КодВычета
					|				КОНЕЦ КАК Поле1,
					|				НДФЛРазмерВычетовСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
					|				НДФЛРазмерВычетовСрезПоследних.РазмерВРублях КАК РазмерВРублях
					|			ИЗ
					|				РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(&ДатаВычета, ) КАК НДФЛРазмерВычетовСрезПоследних) КАК РазмерВычета
					|			ПО ВложенныйЗапрос.КодВычета = РазмерВычета.Поле1
					|	
					|	СГРУППИРОВАТЬ ПО
					|		РазмерВычета.РазмерВРублях) КАК Код620";
					
					Запрос1.УстановитьПараметр("ДатаВычета", ДанныеНДФЛ.Период);
					Запрос1.УстановитьПараметр("Физлицо", ТекущееФизлицо);
					
					РезультатЗапроса = Запрос1.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					ВычетыСтанд = 0;
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ВычетыСтанд = ВычетыСтанд + ?(ВыборкаДетальныеЗаписи.РазмерВРубляхДо18 = null,0,ВыборкаДетальныеЗаписи.РазмерВРубляхДо18) + 
						?(ВыборкаДетальныеЗаписи.РазмерВРубляхПосле18 = Null,0,ВыборкаДетальныеЗаписи.РазмерВРубляхПосле18) +
						?(ВыборкаДетальныеЗаписи.РазмерВРублях611 = Null,0,ВыборкаДетальныеЗаписи.РазмерВРублях611) + 
						?(ВыборкаДетальныеЗаписи.РазмерВРублях620=null,0,ВыборкаДетальныеЗаписи.РазмерВРублях620);
					КонецЦикла;
					
					
					УжеПрименилиЛичный = УжеПрименилиЛичный + ВычетыПримененныеЛичный;
					УжеПрименилиДетский = УжеПрименилиДетский + ВычетыПримененныеДетский;
					УжеПрименилиДетскийЛьгота = УжеПрименилиДетскийЛьгота + ВычетыПримененныеДетскийЛьгота;
					УжеПрименилиДополнительный = УжеПрименилиДополнительный + ВычетыПримененныеДополнительный;
					Если ВычетыПримененныеДетский + ВычетыПримененныеЛичный + ВычетыПримененныеДетскийЛьгота + УжеПрименилиДополнительный>0 или ВычетыСтанд>0 Тогда 
						МассивТаблицаПН = ТаблицаПН.НайтиСтроки(Новый Структура("Физлицо,Период",ТекущееФизлицо,ДанныеНДФЛ.Период));
						Если МассивТаблицаПН.Количество()=0 Тогда 
							СтрТаблицаПН = ТаблицаПН.Добавить();
							СтрТаблицаПН.ФизЛицо = ТекущееФизлицо;
							СтрТаблицаПН.Период = ДанныеНДФЛ.Период;
							Если ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд Тогда 
								СтрТаблицаПН.СтандартныеВычеты =ДанныеНДФЛ.ДоходЗаПериод;
							ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные312ЗаМесяц Тогда
								СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
								УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
							ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные311ЗаМесяц Тогда
								
								//Аверсон 03.01.2023 КВВ СВФР-010099 (
								//СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод;
								Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Премии
									ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Отпускные 
									ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления Тогда
									Если НачалоМесяца(ДанныеНДФЛ.Период) = НачалоМесяца(ПериодРегистрации) Тогда
										СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
									Иначе 
										СтрТаблицаПН.СтандартныеВычеты = 0;
									КонецЕсли;
								Иначе
									СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод;
								КонецЕсли;
								//Аверсон 03.01.2023 КВВ СВФР-010099 )
								
								УжеПрименили312 = УжеПрименили312 + ВычетыПримененные311ЗаМесяц;
								
							ИначеЕсли ДанныеНДФЛ.ДоходЗаПериод < ВычетыПримененныеЛичный+ ВычетыСтанд+ВычетыПримененные312ЗаМесяц+ВычетыПримененные311Мес Тогда
								СтрТаблицаПН.СтандартныеВычеты = ДанныеНДФЛ.ДоходЗаПериод; 
								УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
								УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311Мес;
							Иначе 
								СтрТаблицаПН.СтандартныеВычеты = ВычетыПримененныеЛичный+ ВычетыСтанд-(ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЗаМесяц+ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьготаЗаМесяц+ДанныеНДФЛ.РанееПримененныеВычетыДополнительныеЗаМесяц)+ВычетыПримененные312ЗаМесяц-ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц+ВычетыПримененные311Мес-ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
								УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
								УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311Мес;
								
							КонецЕсли;
						КонецЕсли;
						//СтрТаблицаПН.ЛичныйВычет = ВычетыПримененныеЛичный;
					КонецЕсли;
					
				КонецЦикла;
				ТаблицаПН.Свернуть("ФизЛицо","СтандартныеВычеты");
				
				Запрос.Текст = "ВЫБРАТЬ
				|	ТаблицаВычеты.ФизЛицо,
				|	ТаблицаВычеты.СтандартныеВычеты
				|ПОМЕСТИТЬ ВТВычеты
				|ИЗ
				|	&ТаблицаВычеты КАК ТаблицаВычеты"; 
				Запрос.УстановитьПараметр("ТаблицаВычеты",ТаблицаПН); 
				Запрос.Выполнить();
				
				РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
				Запрос.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛНалог + "  >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат - "
				
				//Аверсон 11.01.2023 КВВ СВФР-010099 (
				//|ЕстьNull(ВТВычеты.СтандартныеВычеты,0))" 
				+ "
				|(ВЫБОР КОГДА ЕстьNull(ВТВычеты.СтандартныеВычеты,0) = 0 Тогда 0
				|ИНАЧЕ
				|ВЫБОР КОГДА
				|ВТВычеты.СтандартныеВычеты > ДополнительныеНачисленияРаботниковОрганизаций.Результат
				|ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат 
				|ИНАЧЕ ВТВычеты.СтандартныеВычеты
				|КОНЕЦ
				|КОНЕЦ ))" +
				//Аверсон 11.01.2023 КВВ СВФР-010099 )
				
				" * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2))
				|									- СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ)				
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + "  >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 2))
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2))<0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат - ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец  как ПодоходныйНалог,
				|	СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) как ПенсионныйФонд,
				|	СУММА(ЕстьNull(ВТВычеты.СтандартныеВычеты,0)) как Вычеты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор)
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
				|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычеты КАК ВТВычеты
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТВычеты.ФизЛицо //О.Т. Аверсон 16.03.2017 № 301
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				|	ВЫРАЗИТЬ(ВЫБОР
				|			КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|				ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
				|			ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|		КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 КАК ЧИСЛО(15, 2)) КАК РезультатДляПФ
				|ИЗ
				|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				|			И (ВЫБОР
				|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
				|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
				|ГДЕ
				|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				|	И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
				|
				|СГРУППИРОВАТЬ ПО
				|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				|	ВТФизЛицаСНалогообл.СтавкаПФ,
				|	ВТФизЛицаСНалогообл.СтавкаЕсть,
				|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
				|	ВТФизЛицаСНалогообл.СтавкаНДФЛ,
				|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ) КАК НачисленияРаботниковОрганизаций
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
				|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛицаСНалогообл.Ставка,
				|	ВТФизЛицаСНалогообл.СтавкаЕсть,
				|	ВТФизЛицаСНалогообл.СтавкаИнд,
				|	ВТФизЛицаСНалогообл.СтавкаНДФЛ,
				|	ВТФизЛицаСНалогообл.СтавкаИндНДФЛ
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
			Иначе
				//+++ПСА 12.11.2021 СВФР-008301	
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + "  >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 2))
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
				|	КОНЕЦ КАК Сумма,
				|	ВЫБОР
				|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
				|			ТОГДА ВЫБОР
				|					КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) > 0
				|						ТОГДА ВЫБОР
				|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + "  >= 100
				|									ТОГДА 0
				|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
				|									- ВЫРАЗИТЬ(СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 2))
				|							КОНЕЦ
				|						ИНАЧЕ 0
				|				КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
				|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
				|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
				|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор)
				|			И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
				|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
				|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
				|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
				|	ВТФизЛицаСНалогообл.Ставка,
				|	ВТФизЛицаСНалогообл.СтавкаЕсть,
				|	ВТФизЛицаСНалогообл.СтавкаИнд
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
			КонецЕсли;
			Запрос.УстановитьПараметр("парамРегистратор", ДокументОснование);
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
			//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			Если Организация.УчетДополнительнойПенсии Тогда
				ТекстДопПенсия = "ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	СУММА(НачисленияРаботниковОрганизаций.ДопПенсия) как ДопПенсия,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки
				|ИЗ
				|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
				|	И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор)
				|	И (ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц)
				|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|					ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
				|					СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения) КАК ВсегоУдержано
				|				   ИЗ
				|					РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
				|						&парамМесяц,
				|						Организация = &ГоловнаяОрганизация
				|						И ВидРасчета.СпособРасчета В (&УдержанияПроцентом)
				|						И Физлицо В
				|								(ВЫБРАТЬ
				|									ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|								 ИЗ
				|									Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|								 ГДЕ
				|									ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				
				|					СГРУППИРОВАТЬ ПО
				|						ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
				|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|					СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|					ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				|					ВЫРАЗИТЬ(ВЫБОР
				|							КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|							ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
				|							ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				|							КОНЕЦ * ЕСТЬNULL(СтавкиДопПенсии.ПроцентРаботника, 0) / 100 КАК ЧИСЛО(15, 2)) КАК ДопПенсия
				|				   ИЗ
				|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|				   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамМесяц, ) КАК РаботникиОрганизацийСрезПоследних
				|				   ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
				|				   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				|				   ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				|						И (ВЫБОР
				|							КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				|							ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				|							ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				|							КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц, ) КАК СтавкиДопПенсии
				|					ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				|					ГДЕ
				|						ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				|						И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
				
				|					СГРУППИРОВАТЬ ПО
				|						ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|						СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				|						СтавкиДопПенсии.ПроцентРаботника
				|) КАК НачисленияРаботниковОрганизаций
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				
				|СГРУППИРОВАТЬ ПО
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки
				
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
				
				ЗапросДопПенсия = Новый Запрос;
				ЗапросДопПенсия.Текст = ТекстДопПенсия;
				ЗапросДопПенсия.УстановитьПараметр("ГоловнаяОрганизация", Организация);
				ЗапросДопПенсия.УстановитьПараметр("парамМесяц", ПериодРегистрации);
				ЗапросДопПенсия.УстановитьПараметр("парамРегистратор", ДокументОснование);
				ЗапросДопПенсия.УстановитьПараметр("парамСсылка", Ссылка);
				
				//Аверсон 11.01.2023 КВВ СВФР-010099 (
				Если НЕ ЗначениеЗаполнено(РазмерСреднейЗарплаты) Тогда
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
				КонецЕсли;
				//Аверсон 11.01.2023 КВВ СВФР-010099 )
				
				ЗапросДопПенсия.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
				ЗапросДопПенсия.УстановитьПараметр("УдержанияПроцентом", МассивСпособовРасчета);
				ТЗДопПенсия = ЗапросДопПенсия.Выполнить().Выгрузить();
				Для Каждого Стр Из Зарплата Цикл
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ФизЛицо", Стр.Физлицо);
					СтруктураОтбора.Вставить("НомерСтроки", Стр.НомерСтроки);
					МассивДопПенсия = ТЗДопПенсия.НайтиСтроки(СтруктураОтбора);
					Для Каждого Эл Из МассивДопПенсия Цикл
						//Стр.ДопПенсия = Стр.ДопПенсия + Эл.ДопПенсия;
						Стр.ДопПенсия = Стр.ДопПенсия + ?(ЗначениеЗаполнено(Эл.ДопПенсия),Эл.ДопПенсия,0); //Аверсон 11.01.2023 КВВ СВФР-010099
					КонецЦикла;
					Стр.Сумма = Стр.Сумма - Стр.ДопПенсия;
				КонецЦикла;
			КонецЕсли;
			//Аверсон СВФР-009465
			
			//Аверсон 11.01.2023 КВВ СВФР-010099 (
			Для Каждого Стр Из Зарплата Цикл
				Если (Стр.Сумма + Стр.ПенсионныйФонд) < Стр.Вычеты Тогда
					Стр.Вычеты = Стр.Сумма + Стр.ПенсионныйФонд;
				КонецЕсли;
			КонецЦикла;
			//Аверсон 11.01.2023 КВВ СВФР-010099 )
			
		ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления Тогда 
			
			//Аверсон 10.03.2023 КВВ СВФР-010490 ( 
			ЗТекст = "";
			//Если Организация.УчетДополнительнойПенсии Тогда
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 (		
			Если ВариантРасчета = "ОстаткиЗаВычетомНалоговБезВычетов" Тогда
				ЗТекст = "
				|ВЫБРАТЬ 
				|Значение(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизЛицо,
				|0 КАК СуммаВычета 
				|ПОМЕСТИТЬ ВтСуммыВычетов
				|;";
			Иначе
				//Аверсон 13.03.2023 КВВ СВФР-010490 )
				ЗТекст = "
				|ВЫБРАТЬ 
				|НДФЛ.ФизЛицо,
				|СУММА(НДФЛ.СуммаВычета) КАК СуммаВычета 
				|ПОМЕСТИТЬ ВтСуммыВычетов
				|ИЗ РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛ
				|ГДЕ НДФЛ.Регистратор В (&парамРегистратор)
				|И НДФЛ.СуммаВычета <> 0  
				|СГРУППИРОВАТЬ ПО
				|НДФЛ.ФизЛицо
				|;";
			КонецЕсли;
			
			ЗТекст = ЗТекст + "
			|
			|ВЫБРАТЬ   
			|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,				
			|ВТФизЛицаСНалогообл.СтавкаПФ,
			|ВТФизЛицаСНалогообл.СтавкаЕсть,
			|ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			
			|ПОМЕСТИТЬ ВтНачислений				
			|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			|ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			|И (ВЫБОР
			|КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			|ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			|КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)				
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			|ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			
			
			|ГДЕ
			|ОсновныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
			|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
			|СГРУППИРОВАТЬ ПО
			|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
			|ВТФизЛицаСНалогообл.СтавкаПФ,
			|ВТФизЛицаСНалогообл.СтавкаЕсть,
			|ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ      
			|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,				
			|ВТФизЛицаСНалогообл.СтавкаПФ,
			|ВТФизЛицаСНалогообл.СтавкаЕсть,
			|ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			
			|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			|ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			|И (ВЫБОР
			|КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			|ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			|ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			|КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)				
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			|ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			
			
			|ГДЕ
			|ДополнительныеНачисленияРаботниковОрганизаций.Регистратор В (&парамРегистратор)
			|И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
			|СГРУППИРОВАТЬ ПО
			|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,				
			|ВТФизЛицаСНалогообл.СтавкаПФ,
			|ВТФизЛицаСНалогообл.СтавкаЕсть,
			|ВТФизЛицаСНалогообл.СтавкаИндПФ,
			|ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			
			|;			
			|
			|ВЫБРАТЬ 
			|ВтНачислений.ФизЛицо,
			|ВтНачислений.Результат - ЕстьNull(ВтСуммыВычетов.СуммаВычета,0) КАК Результат,
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 (
			|ВтНачислений.Результат КАК РезультатБезУчетаВычетов,
			|ЕстьNull(ВтСуммыВычетов.СуммаВычета,0) КАК Вычеты,
			//Аверсон 13.03.2023 КВВ СВФР-010490 )
			
			|ВтНачислений.ОграничениеПоДоходам,				
			|ВтНачислений.СтавкаПФ,
			|ВтНачислений.СтавкаЕсть,
			|ВтНачислений.СтавкаИндПФ,
			|ВтНачислений.СтавкаНДФЛ,
			|ВтНачислений.НеЯвляетсяНалоговымРезидентомРФ
			
			|ПОМЕСТИТЬ ВтНачисленийСУчетомВычетов
			|ИЗ ВтНачислений
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыВычетов
			|ПО ВтНачислений.ФизЛицо = ВтСуммыВычетов.ФизЛицо
			|;
			|";
			//КонецЕсли;
			//Аверсон 10.03.2023 КВВ СВФР-010490 )
			
			ЗТекст = ЗТекст +
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 ( 
			//|	ВЫБОР
			//|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			//|			ТОГДА ВЫБОР
			//|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
			//|						ТОГДА ВЫБОР
			//|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + "  >= 100
			//|									ТОГДА 0
			//|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			//|									- ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
			//|							КОНЕЦ
			//|						ИНАЧЕ 0
			//|				КОНЕЦ / 100 * &парамПроцентВыплаты
			//|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			//|	КОНЕЦ КАК Сумма,
			|ВЫБОР
			|КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|ТОГДА
			|СУММА(НачисленияРаботниковОрганизаций.РезультатБезУчетаВычетов) // / 100 * &парамПроцентВыплаты  //Аверсон 15.03.2023 КВВ СВФР-010490 (закомментировано умножение на процент)
			|ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
			|КОНЕЦ КАК Сумма,
			|СУММА(НачисленияРаботниковОрганизаций.Вычеты) КАК Вычеты,
			//Аверсон 13.03.2023 КВВ СВФР-010490 )
			
			|	ВЫБОР
			|		КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет
			|			ТОГДА ВЫБОР
			|					КОГДА СУММА(НачисленияРаботниковОрганизаций.Результат) > 0
			|						ТОГДА ВЫБОР
			|								КОГДА " + КоэфПлановыхУдержаний + " + " + КоэфНДФЛ + " >= 100
			|									ТОГДА 0
			|								ИНАЧЕ ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * (1 - " + КоэфПлановыхУдержаний + " / 100) КАК ЧИСЛО(10, 2))
			|									- ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛ + " / 100 КАК ЧИСЛО(10, 0))
			|							КОНЕЦ
			|						ИНАЧЕ 0
			|			КОНЕЦ / 100 * &парамПроцентВыплаты * &парамПроцент
			|		ИНАЧЕ ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты
			|	КОНЕЦ КАК КомпенсацияЗаЗадержкуЗарплаты,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
			
			//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			|	Выбор когда ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2))<0 тогда 0 иначе ВЫРАЗИТЬ(СУММА(НачисленияРаботниковОрганизаций.Результат) * " + КоэфНДФЛНалог + " / 100 КАК ЧИСЛО(10, 2)) конец  как ПодоходныйНалог,
			|	СУММА(НачисленияРаботниковОрганизаций.РезультатДляПФ) как ПенсионныйФонд
			//Аверсон СВФР-009465
			
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ (";
			
			//Аверсон 10.03.2023 КВВ СВФР-010490 (
			//Если Организация.УчетДополнительнойПенсии Тогда
			ЗТекст = ЗТекст + "
			|
			|ВЫБРАТЬ
			|ВтНачисленийСУчетомВычетов.ФизЛицо КАК ФизЛицо,
			|СУММА(ВтНачисленийСУчетомВычетов.Результат) КАК Результат,	
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 (
			|СУММА(ВтНачисленийСУчетомВычетов.РезультатБезУчетаВычетов) КАК РезультатБезУчетаВычетов,
			|СУММА(ВтНачисленийСУчетомВычетов.Вычеты) КАК Вычеты,
			//Аверсон 13.03.2023 КВВ СВФР-010490 )
			
			|ВЫРАЗИТЬ(ВЫБОР
			|КОГДА СУММА(ВтНачисленийСУчетомВычетов.Результат) < &СредняяЗП * ВтНачисленийСУчетомВычетов.ОграничениеПоДоходам
			|ТОГДА СУММА(ВтНачисленийСУчетомВычетов.Результат)
			|ИНАЧЕ &СредняяЗП * ВтНачисленийСУчетомВычетов.ОграничениеПоДоходам
			|КОНЕЦ * ВЫБОР
			|КОГДА ВтНачисленийСУчетомВычетов.НеЯвляетсяНалоговымРезидентомРФ
			|ТОГДА 0
			|ИНАЧЕ 
			|ВЫБОР КОГДА ВтНачисленийСУчетомВычетов.СтавкаЕсть = 1 
			|ТОГДА ВтНачисленийСУчетомВычетов.СтавкаИндПФ 
			|ИНАЧЕ ВтНачисленийСУчетомВычетов.СтавкаПФ КОНЕЦ
			|КОНЕЦ/ 100 КАК ЧИСЛО(15, 2)) КАК РезультатДляПФ
			|ИЗ ВтНачисленийСУчетомВычетов 
			|СГРУППИРОВАТЬ ПО
			|ВтНачисленийСУчетомВычетов.ФизЛицо,
			|ВтНачисленийСУчетомВычетов.ОграничениеПоДоходам,
			|ВтНачисленийСУчетомВычетов.СтавкаПФ,
			|ВтНачисленийСУчетомВычетов.СтавкаЕсть,
			|ВтНачисленийСУчетомВычетов.СтавкаИндПФ,
			|ВтНачисленийСУчетомВычетов.СтавкаНДФЛ,
			|ВтНачисленийСУчетомВычетов.НеЯвляетсяНалоговымРезидентомРФ
			|";
			//Иначе
			//Аверсон 10.03.2023 КВВ СВФР-010490 )
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 ( (закомментировано)
			//	ЗТекст = ЗТекст + "
			//	|
			//	|			ВЫБРАТЬ
			//	|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	//|			ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат,
			//	|			СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
			//	|	ВЫРАЗИТЬ(ВЫБОР
			//	|			КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
			//	|				ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат)
			//	|			ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
			//	|		КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 КАК ЧИСЛО(15, 2)) КАК РезультатДляПФ
			//	//Аверсон СВФР-009465
			//	
			//	|		ИЗ
			//	|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			//	|		ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			//	|			И (ВЫБОР
			//	|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			//	|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			//	|				ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			//	|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			//	|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			//	|		ПО ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			//	
			//	//Аверсон СВФР-009465
			//	
			//	|		ГДЕ
			//	|			ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
			//	|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	| СГРУППИРОВАТЬ ПО
			//	|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			//	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
			//	|	ВТФизЛицаСНалогообл.СтавкаПФ,
			//	|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			//	|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
			//	|	ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			//	|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ
			//	//Аверсон СВФР-009465
			//	
			//	|		ОБЪЕДИНИТЬ ВСЕ
			//	|		
			//	|		ВЫБРАТЬ
			//	|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	//|			ДополнительныеНачисленияРаботниковОрганизаций.Результат
			//	|			СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
			//	|	ВЫРАЗИТЬ(ВЫБОР
			//	|			КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
			//	|				ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
			//	|			ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
			//	|		КОНЕЦ * " + КоэфНДФЛПФ + "/ 100 КАК ЧИСЛО(15, 2)) КАК РезультатДляПФ
			//	//Аверсон СВФР-009465
			//	
			//	|		ИЗ
			//	|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
			//	|		ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
			//	|			И (ВЫБОР
			//	|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
			//	|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
			//	|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
			//	|			КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			//	|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВТФизЛицаСНалогообл.ФизЛицо
			//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&парамМесяц, ) КАК ГражданствоФизЛицСрезПоследних
			//	|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			//	
			//	//Аверсон СВФР-009465
			//	
			//	|		ГДЕ
			//	|			ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
			//	|			И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
			//	
			//	//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			//	| СГРУППИРОВАТЬ ПО
			//	|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			//	|	СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
			//	|	ВТФизЛицаСНалогообл.СтавкаПФ,
			//	|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			//	|	ВТФизЛицаСНалогообл.СтавкаИндПФ,
			//	|	ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			//	|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ";
			//	//Аверсон СВФР-009465
			//КонецЕсли;
			//Аверсон 13.03.2023 КВВ СВФР-010490 ) (закомментировано) 
			
			ЗТекст = ЗТекст + "
			
			|) КАК НачисленияРаботниковОрганизаций
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ТаблицаПлановыхУдержаний + ") КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ " + ТаблицаНДФЛ + " КАК ГражданствоФизЛицСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ГражданствоФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСНалогообл КАК ВТФизЛицаСНалогообл
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТФизЛицаСНалогообл.ФизЛицо //О.Т. Аверсон 29.03.2016 № 950
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ,
			|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВсегоУдержано,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Авторасчет,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма,
			|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты,
			|	ВТФизЛицаСНалогообл.Ставка,
			|	ВТФизЛицаСНалогообл.СтавкаЕсть,
			|	ВТФизЛицаСНалогообл.СтавкаИнд,
			
			//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			|   ВТФизЛицаСНалогообл.СтавкаНДФЛ,
			|   ВТФизЛицаСНалогообл.СтавкаИндНДФЛ
			//Аверсон СВФР-009465
			
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			Запрос.Текст = ЗТекст; //Аверсон 10.03.2023 КВВ СВФР-010490
				МассивДокументов = Новый Массив;
				Если ТабличнаяЧастьДокументОснование.Количество()>0 Тогда
					Для каждого строка Из ТабличнаяЧастьДокументОснование Цикл
						МассивДокументов.Добавить(строка.Основание.Ссылка);		
					КонецЦикла;
				Иначе	
					МассивДокументов.Добавить(ДокументОснование);
				КонецЕсли; 

			Запрос.УстановитьПараметр("парамРегистратор", МассивДокументов);
			
			//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			Запрос.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
			//Аверсон СВФР-009465
			
			Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
			
			//Аверсон ЕАЕ 25.08.2022 СВФР-009465
			Если Организация.УчетДополнительнойПенсии Тогда
				//Аверсон 10.03.2023 КВВ СВФР-010490 (
				ТекстДопПенсия = "
				|ВЫБРАТЬ 
				|НДФЛ.ФизЛицо,
				|СУММА(НДФЛ.СуммаВычета) КАК СуммаВычета 
				|ПОМЕСТИТЬ ВтСуммыВычетов2
				|ИЗ РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛ
				|ГДЕ НДФЛ.Регистратор = &парамРегистратор
				|И НДФЛ.СуммаВычета <> 0  
				|СГРУППИРОВАТЬ ПО
				|НДФЛ.ФизЛицо
				|; 
				|
				|ВЫБРАТЬ   
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				|СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0) КАК ПроцентРаботника				
				|ПОМЕСТИТЬ ВтНачислений2				
				|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				|ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				|И (ВЫБОР
				|КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				|ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				|ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				|КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц, ) КАК СтавкиДопПенсии
				|ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				|ГДЕ
				|ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				|И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				|СГРУППИРОВАТЬ ПО
				|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				|ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ      
				|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
				|ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0) КАК ПроцентРаботника			
				|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				|ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				|И (ВЫБОР
				|КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				|ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				|ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				|КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц, ) КАК СтавкиДопПенсии
				|ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник	
				|ГДЕ
				|ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				|И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
				|СГРУППИРОВАТЬ ПО
				|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				|ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0)				
				|;			
				|
				|ВЫБРАТЬ 
				|ВтНачислений2.ФизЛицо,
				|ЕстьNull(ВтСуммыВычетов2.СуммаВычета,0) КАК СуммаВычета,
				|ВтНачислений2.Результат - ЕстьNull(ВтСуммыВычетов2.СуммаВычета,0) КАК Результат,
				|ВтНачислений2.ОграничениеПоДоходам,
				|ВтНачислений2.ПроцентРаботника
				|ПОМЕСТИТЬ ВтНачисленийСУчетомВычетов2
				|ИЗ ВтНачислений2
				|ЛЕВОЕ СОЕДИНЕНИЕ ВтСуммыВычетов2
				|ПО ВтНачислений2.ФизЛицо = ВтСуммыВычетов2.ФизЛицо
				|;
				|";
				//Аверсон 10.03.2023 КВВ СВФР-010490 )
				
				
				ТекстДопПенсия =  ТекстДопПенсия + "ВЫБРАТЬ
				|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки КАК НомерСтроки,
				|СУММА(НачисленияРаботниковОрганизаций.ДопПенсия) как ДопПенсия
				|ИЗ
				|Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ЛЕВОЕ СОЕДИНЕНИЕ (
				
				//Аверсон 10.03.2023 КВВ СВФР-010490 ( (закомментировано)
				//|ВЫБРАТЬ
				//|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
				//|СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат,
				//|ВЫРАЗИТЬ(ВЫБОР
				//|КОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|	ТОГДА СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат)
				//|ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|КОНЕЦ * ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0) / 100 КАК ЧИСЛО(15, 2)) КАК ДопПенсия
				//|ИЗ
				//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				//|ПО ОсновныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				//|	И (ВЫБОР
				//|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				//|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				//|		ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				//|	КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц, ) КАК СтавкиДопПенсии
				//|ПО ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				//|ГДЕ
				//|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				//|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &парамМесяц
				//|СГРУППИРОВАТЬ ПО
				//|ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
				//|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				//|СтавкиДопПенсии.ПроцентРаботника
				//
				//|	ОБЪЕДИНИТЬ ВСЕ
				//
				//|	ВЫБРАТЬ
				//|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				//|		СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат),
				//|ВЫРАЗИТЬ(ВЫБОР
				//|		КОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат) < &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|			ТОГДА СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
				//|		ИНАЧЕ &СредняяЗП * СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам
				//|	КОНЕЦ * ЕстьNull(СтавкиДопПенсии.ПроцентРаботника, 0)/ 100 КАК ЧИСЛО(15, 2)) КАК ДопПенсия
				//|	ИЗ
				//|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
				//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиОтчисленийСФОТиЗП.СрезПоследних(&парамМесяц, ВидОтчисления = ЗНАЧЕНИЕ(ПеречислениЕ.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд)) КАК СтавкиОтчисленийСФОТиЗПСрезПоследних
				//|	ПО ДополнительныеНачисленияРаботниковОрганизаций.Организация = СтавкиОтчисленийСФОТиЗПСрезПоследних.Организация
				//|		И (ВЫБОР
				//|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной = ЗНАЧЕНИЕ(справочник.ВидыНалогообложения.пустаяссылка)
				//|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Организация.ОсновнаяСтавкаНалогообложения
				//|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник.ВидНалогообложенияОсновной
				//|		КОНЕЦ = СтавкиОтчисленийСФОТиЗПСрезПоследних.ВидНалогообложения)
				//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник.СрезПоследних(&парамМесяц, ) КАК СтавкиДопПенсии
				//|	ПО ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник = СтавкиДопПенсии.Сотрудник
				//|	ГДЕ
				//|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = &парамРегистратор
				//|		И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПериодРегистрации = &парамМесяц
				//|СГРУППИРОВАТЬ ПО
				//|ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
				//|СтавкиОтчисленийСФОТиЗПСрезПоследних.ОграничениеПоДоходам,
				//|СтавкиДопПенсии.ПроцентРаботника
				
				//Аверсон 10.03.2023 КВВ СВФР-010490 ) (закомментировано)
				
				//Аверсон 10.03.2023 КВВ СВФР-010490 (
				|ВЫБРАТЬ   
				|ВтНачисленийСУчетомВычетов2.ФизЛицо КАК ФизЛицо,
				|СУММА(ВтНачисленийСУчетомВычетов2.СуммаВычета) КАК СуммаВычета,
				|СУММА(ВтНачисленийСУчетомВычетов2.Результат) КАК Результат,
				|ВЫРАЗИТЬ(ВЫБОР
				|КОГДА СУММА(ВтНачисленийСУчетомВычетов2.Результат) < &СредняяЗП * ВтНачисленийСУчетомВычетов2.ОграничениеПоДоходам
				|ТОГДА СУММА(ВтНачисленийСУчетомВычетов2.Результат)
				|ИНАЧЕ &СредняяЗП * ВтНачисленийСУчетомВычетов2.ОграничениеПоДоходам
				|КОНЕЦ * ЕстьNull(ВтНачисленийСУчетомВычетов2.ПроцентРаботника, 0) / 100 КАК ЧИСЛО(15, 2)) КАК ДопПенсия				
				|ИЗ ВтНачисленийСУчетомВычетов2 
				|СГРУППИРОВАТЬ ПО
				|ВтНачисленийСУчетомВычетов2.ФизЛицо,
				|ВтНачисленийСУчетомВычетов2.ОграничениеПоДоходам,
				|ВтНачисленийСУчетомВычетов2.ПроцентРаботника
				//Аверсон 10.03.2023 КВВ СВФР-010490 ) 
				
				|) КАК НачисленияРаботниковОрганизаций
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = НачисленияРаботниковОрганизаций.ФизЛицо
				|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо КАК ФизЛицо,
				|	СУММА(ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.РазмерЗавершения) КАК ВсегоУдержано
				|ИЗ
				|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
				|			&парамМесяц,
				|			Организация = &ГоловнаяОрганизация
				|				И ВидРасчета.СпособРасчета В (&УдержанияПроцентом)
				|				И Физлицо В
				|					(ВЫБРАТЬ
				|						ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|					ИЗ
				|						Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|					ГДЕ
				|						ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				
				|СГРУППИРОВАТЬ ПО
				|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
				|ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо
				|ГДЕ
				|ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
				
				|СГРУППИРОВАТЬ ПО
				|ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
				|ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки
				
				
				|УПОРЯДОЧИТЬ ПО
				|НомерСтроки";
				
				ЗапросДопПенсия = Новый Запрос;
				ЗапросДопПенсия.Текст = ТекстДопПенсия;
				ЗапросДопПенсия.УстановитьПараметр("ГоловнаяОрганизация", Организация);
				ЗапросДопПенсия.УстановитьПараметр("парамМесяц", ПериодРегистрации);
				ЗапросДопПенсия.УстановитьПараметр("парамРегистратор", ДокументОснование);
				ЗапросДопПенсия.УстановитьПараметр("парамСсылка", Ссылка);
				ЗапросДопПенсия.УстановитьПараметр("СредняяЗП", РазмерСреднейЗарплаты);
				ЗапросДопПенсия.УстановитьПараметр("УдержанияПроцентом", МассивСпособовРасчета);
				ТЗДопПенсия = ЗапросДопПенсия.Выполнить().Выгрузить();
				Для Каждого Стр Из Зарплата Цикл
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ФизЛицо", Стр.Физлицо);
					СтруктураОтбора.Вставить("НомерСтроки", Стр.НомерСтроки);
					МассивДопПенсия = ТЗДопПенсия.НайтиСтроки(СтруктураОтбора);
					Для Каждого Эл Из МассивДопПенсия Цикл
						Стр.ДопПенсия = Стр.ДопПенсия + Эл.ДопПенсия;
					КонецЦикла;
					//Стр.Сумма = Стр.Сумма - Стр.ДопПенсия; //Аверсон 13.03.2023 КВВ СВФР-010490 (закомментировано)
				КонецЦикла;
			КонецЕсли;
			//Аверсон СВФР-009465
			
			//Аверсон 13.03.2023 КВВ СВФР-010490 (
			Для Каждого Стр Из Зарплата Цикл
				Стр.Сумма = Стр.Сумма - Стр.ДопПенсия - Стр.ПенсионныйФонд - Стр.ПодоходныйНалог;
			КонецЦикла;
			//Аверсон 13.03.2023 КВВ СВФР-010490 )
			
			//Аверсон 11.01.2023 КВВ СВФР-010099 (
			Для Каждого Стр Из Зарплата Цикл
				Если (Стр.Сумма + Стр.ПенсионныйФонд) < Стр.Вычеты Тогда
					Стр.Вычеты = Стр.Сумма + Стр.ПенсионныйФонд;
				КонецЕсли;
			КонецЦикла;
			//Аверсон 11.01.2023 КВВ СВФР-010099 )
			
			//Аверсон 15.03.2023 КВВ СВФР-010490 (
			Если ПроцентВыплаты <> 100 Тогда
				Для Каждого Стр Из Зарплата Цикл
					Стр.Сумма = Окр((Стр.Сумма*ПроцентВыплаты)/100,2);
				КонецЦикла;
			КонецЕсли;
			//Аверсон 15.03.2023 КВВ СВФР-010490 )
			
		КонецЕсли;
	КонецЕсли;
	
	//Аверсон 15.03.2021 КВВ СВФР-007294 (
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПолучателиАлиментов Тогда
		Зарплата.Свернуть("ФизЛицо,ПодоходныйНалог,ПенсионныйФонд,Вычеты,ВыплаченностьЗарплаты,КомпенсацияЗаЗадержкуЗарплаты,НалогСумма,СуммаНачислений,ТабНомер,Авторасчет,Примечание,Получатель,НомерСчета","Сумма");	
	Иначе
		//Аверсон 15.03.2021 КВВ СВФР-007294 )
		
		//Аверсон ЕАЕ 24.08.2022 СВФР-009465
		//Зарплата.Свернуть("ФизЛицо,Сумма,ПодоходныйНалог,ПенсионныйФонд,Вычеты,ВыплаченностьЗарплаты,КомпенсацияЗаЗадержкуЗарплаты,НалогСумма,СуммаНачислений,ТабНомер,Авторасчет,Примечание");	//Островская Татьяна 09.04.2014 № 17269
		Зарплата.Свернуть("ФизЛицо,Сумма,ПодоходныйНалог,ПенсионныйФонд,Вычеты,ВыплаченностьЗарплаты,КомпенсацияЗаЗадержкуЗарплаты,НалогСумма,СуммаНачислений,ТабНомер,Авторасчет,Примечание,ДопПенсия");	
		//Аверсон СВФР-009465
	КонецЕсли;
	
	//Аверсон ЕАЕ 27.03.2025 СВФР-015244
	//Несвиж
	Если Организация.ИНН = "691159723" Тогда
		Если ВариантРасчета = "ОстаткиСНалогамиУв" Тогда
			//Проверка остатка по взаиморасчетам
			Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Тогда
				//Получаем уволенных
				//ТЗУволенные = ПолучитьУволенных();
				
				//Получаем сальдо
				ТЗОстаткиВзаиморасчетов = ПолучитьОстаткиВзаиморасчетов();
				
				//Выводим сообщение
				Для Каждого Стр Из ТЗОстаткиВзаиморасчетов Цикл
					Сообщить("В строке " + СокрЛП(Стр.НомерСтроки) + " у сотрудника " + СокрЛП(Стр.ФизЛицо) + " остаток взаиморасчетов (" + Формат(Стр.Остаток,"ЧДЦ=2") + ") меньше выплачиваемой суммы.");
				КонецЦикла;

			КонецЕсли;
			//Проверка договоров
			Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.РасчетПриУвольнении Тогда
				ТЗБезДоговоров = ПолучитьСотрудниковБезДоговоров();
				Для Каждого Стр Из ТЗБезДоговоров Цикл
					Сообщить("В строке " + СокрЛП(Стр.НомерСтроки) + " у сотрудника " + СокрЛП(Стр.ФизЛицо) + " нет договора в периоде регистрации.");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-015244
	
КонецПроцедуры

//Аверсон-софт, Островская Татьяна 15.06.2012 № 15496
Процедура РассчитатьПроц(ВариантРасчета, ПроцентВыплаты = 0) Экспорт
	
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамОрганизация",	Организация);
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	//толик не нужно на конец текущей даты а на конец месяца период регистрации 
	//	Запрос.УстановитьПараметр("парамДата",			Макс(Дата,КонецМесяца(ПериодРегистрации) + 1));
	Запрос.УстановитьПараметр("парамДата",			КонецМесяца(ПериодРегистрации) + 1);
	Запрос.УстановитьПараметр("парамМесяц",			ПериодРегистрации);
	Запрос.УстановитьПараметр("парамПроцент",		РассчитатьПроцентКомпенсации());
	Запрос.УстановитьПараметр("парамПроцентВыплаты",ПроцентВыплаты);
	// О.Т. 28.10.2014 225
	Запрос.УстановитьПараметр("ПериодДействия",			НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодДействия1",			КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодДействия15",			НачалоМесяца(ПериодРегистрации)+86400*15-1);
	// О.Т. 28.10.2014 225
	
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс Тогда
		//Аверсон-софт, Плиско Ю.А. 10.11.2014
		РасчетТарифногоОклада();
		//----------------------------------------------
		
		//Островская Татьяна 16.12.2013 № 16979
		если Организация.ИНН = "100765738" Тогда 
			Запрос.Текст = // О.Т. 28.10.2014 225
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 КАК СуммаСт,
			|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
			|	МесячныйФондРаботниковОрганизацииСрезПоследних.МесячныйФонд * &парамПроцентВыплаты / 100 КАК Сумма,
			|	РаботникиОрганизации.Регистратор,
			|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&парамДата, ) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|				РаботникиОрганизацийСрезПоследних.Период КАК Период,
			|				РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, ) КАК РаботникиОрганизацийСрезПоследних) КАК РаботникиОрганизации
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МесячныйФондРаботниковОрганизации.СрезПоследних(&парамДата, ) КАК МесячныйФондРаботниковОрганизацииСрезПоследних
			|				ПО (МесячныйФондРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|					И РаботникиОрганизации.Сотрудник = МесячныйФондРаботниковОрганизацииСрезПоследних.Сотрудник
			|			ПО (РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник)
			|				И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
			|			И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|	И (НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|			ИЛИ ЕСТЬNULL(РаботникиОрганизации.Период, 0) = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки"; //О.Т. 21.01.2015 № 17811
			//О.Т. 05.09.2014 № 213
		ИначеЕсли Организация.ИНН = "100074549" Тогда
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			//О.Т. Аверсон 06.04.2016 № 1027
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование как ПодразделениеОрганизации,
			|	СотрудникиОрганизаций.Физлицо
			|ПОМЕСТИТЬ ВТСотрудники
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник
			|ГДЕ
			|	(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
			|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|	И СотрудникиОрганизаций.Организация = &парамОрганизация
			|	И НЕ РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			Запрос.Выполнить();	
			//О.Т. Аверсон 06.04.2016 № 1027
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ВЫБОР
			|		КОГДА ВТСотрудники.ПодразделениеОрганизации ПОДОБНО ""Училище""
			|			ТОГДА 0
			|		ИНАЧЕ 
			|		выбор КОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса >= 0
			|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса иначе "; 
			//О.Т. Аверсон 09.07.2018 № 2193
			Если ВариантРасчета = "КВыплатеЗаМесяцМесТарСтавка" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15";
			ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцСтавкаСПовыш" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15";
			ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцТарСтавка" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15";
			иначе
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			
			|	конец
			|	КОНЕЦ КАК Сумма,";
			Если ВариантРасчета = "КВыплатеЗаМесяцМесТарСтавка" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
			ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцСтавкаСПовыш" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции как Ставка";
			ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцТарСтавка" Тогда 
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка как Ставка";
			иначе
				Запрос.Текст = Запрос.Текст + " 
				|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			//О.Т. Аверсон 09.07.2018 № 2193
			
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&парамДата, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|				РаботникиОрганизацийСрезПоследних.Период КАК Период,
			|				РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацийСрезПоследних) КАК РаботникиОрганизации
			|			ПО ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник = РаботникиОрганизации.Сотрудник
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
			|			И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамДата, ) КАК АвансыРаботникамОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АвансыРаботникамОрганизацийСрезПоследних.Физлицо
			|			И (АвансыРаботникамОрганизацийСрезПоследних.Организация = &ПарамОрганизация)//О.Т. Аверсон 09.07.2018 № 2193
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			СУММА(РАЗНОСТЬДАТ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец > &ПериодДействия15
			|							ТОГДА &ПериодДействия15
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|					КОНЕЦ, ДЕНЬ) + 1) КАК ДниОтпуск
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодДействия И &ПериодДействия15
			|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОРганизаций.Отпускзасвойсчет)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК ДниПоОтпуску
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДниПоОтпуску.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВТСотрудники
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ВТСотрудники.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|	И (НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|			ИЛИ ЕСТЬNULL(РаботникиОрганизации.Период, 0) = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки"; //О.Т. Аверсон 06.04.2016 № 1027
			
		ИначеЕсли Организация.ИНН = "800009185" Тогда
			Запрос.Текст = // О.Т. 28.10.2014 225
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,
			|	ВЫБОР
			|		КОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса > 0
			|			ТОГДА АвансыРаботникамОрганизацийСрезПоследних.СуммаАванса * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15
			|		ИНАЧЕ ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15
			|	КОНЕЦ КАК Сумма,
			|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
			|	РаботникиОрганизации.Период,
			|	РаботникиОрганизации.Регистратор,
			|	ДниПоОтпуску.ДниОтпуск
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&парамДата, ) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|				РаботникиОрганизацийСрезПоследних.Период КАК Период,
			|				РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, ) КАК РаботникиОрганизацийСрезПоследних) КАК РаботникиОрганизации
			|			ПО ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник = РаботникиОрганизации.Сотрудник
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
			|			И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникамОрганизаций.СрезПоследних(&парамДата, ) КАК АвансыРаботникамОрганизацийСрезПоследних
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = АвансыРаботникамОрганизацийСрезПоследних.Физлицо
			|			И (АвансыРаботникамОрганизацийСрезПоследних.Организация = &ПарамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			СУММА(РАЗНОСТЬДАТ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец > &ПериодДействия15
			|							ТОГДА &ПериодДействия15
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|					КОНЕЦ, ДЕНЬ) + 1) КАК ДниОтпуск
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодДействия И &ПериодДействия15
			|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОРганизаций.Отпускзасвойсчет)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК ДниПоОтпуску
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДниПоОтпуску.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|	И (НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|			ИЛИ ЕСТЬNULL(РаботникиОрганизации.Период, 0) = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки";//О.Т. 21.01.2015 № 17811
			//О.Т. 05.09.2014 № 213
		иначе
			Запрос.Текст = // О.Т. 28.10.2014 225
			"ВЫБРАТЬ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено) КАК ВыплаченностьЗарплаты,";
			
			//(начало) добавлено Кухарчуком Д.Я. 18.12.18, Задача СВФР-002942, Аверсон-Софт
			Если БезУчетаНеявок Тогда
				
				Если ВариантРасчета = "КВыплатеЗаМесяцМесТарСтавка" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
				ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцСтавкаСПовыш" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции * &парамПроцентВыплаты / 100 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции как Ставка";
				ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцТарСтавка" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка * &парамПроцентВыплаты / 100 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка как Ставка";
				иначе
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
				КонецЕсли;
				
			Иначе	
				//(конец) добавлено Кухарчуком Д.Я. 18.12.18, Задача СВФР-002942, Аверсон-Софт
				
				//О.Т. Аверсон 29.11.2017
				Если ВариантРасчета = "КВыплатеЗаМесяцМесТарСтавка" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
				ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцСтавкаСПовыш" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции как Ставка";
				ИначеЕсли ВариантРасчета = "КВыплатеЗаМесяцТарСтавка" Тогда 
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка как Ставка";
				иначе
					Запрос.Текст = Запрос.Текст + " 
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка * &парамПроцентВыплаты / 100 * (15 - ЕСТЬNULL(ДниПоОтпуску.ДниОтпуск, 0)) / 15 КАК Сумма,
					|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка как Ставка";
				КонецЕсли;
				//О.Т. Аверсон 29.11.2017
				
				//(начало) добавлено Кухарчуком Д.Я. 18.12.18, Задача СВФР-002942, Аверсон-Софт
			КонецЕсли; // БезУчетаНеявок
			//(конец) добавлено Кухарчуком Д.Я. 18.12.18, Задача СВФР-002942, Аверсон-Софт
			
			Запрос.Текст = Запрос.Текст + "
			|ИЗ
			|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&парамДата, ) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|				РаботникиОрганизацийСрезПоследних.Период КАК Период,
			|				РаботникиОрганизацийСрезПоследних.Регистратор КАК Регистратор
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДата, ) КАК РаботникиОрганизацийСрезПоследних) КАК РаботникиОрганизации
			|			ПО ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник = РаботникиОрганизации.Сотрудник
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо
			|			И (ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация = &парамОрганизация)
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
			|			И ОсновныеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК Основные
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = Основные.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			СУММА(РАЗНОСТЬДАТ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, ВЫБОР
			|						КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец > &ПериодДействия15
			|							ТОГДА &ПериодДействия15
			|						ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|					КОНЕЦ, ДЕНЬ) + 1) КАК ДниОтпуск
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодДействия И &ПериодДействия15
			|			И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОРганизаций.Отпускзасвойсчет)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК ДниПоОтпуску
			|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = ДниПоОтпуску.ФизЛицо
			|ГДЕ
			|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &парамСсылка
			|	И ЕСТЬNULL(Основные.ВидРасчета, 0) = 0
			|	И (НЕ РаботникиОрганизации.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
			|			ИЛИ ЕСТЬNULL(РаботникиОрганизации.Период, 0) = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки"; //О.Т. 21.01.2015 № 17811
			
		КонецЕсли;
		
		//Островская Татьяна 16.12.2013 № 16979
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		Зарплата.Свернуть("Физлицо,ТабНомер,Авторасчет,Сумма,ВыплаченностьЗарплаты,КомпенсацияЗаЗадержкуЗарплаты,НалогСумма,СуммаНачислений");//О.Т. 05.09.2014
		//заявка №1916 (база заявок Кристалла) 
		КолДней = 0;
		Для Каждого ТекСтрока из Зарплата Цикл
			Если не БезУчетаНеявок Тогда 
				ЗапросОтпуск = Новый Запрос;
				ТекстЗапросаОтпуск = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ОтпускаФактическиеПоСотрудникам.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|	ВЫБОР
				|		КОГДА ОтпускаФактическиеПоСотрудникам.НачалоОтпуска < &НачПериод
				|			ТОГДА &НачПериод
				|		ИНАЧЕ ОтпускаФактическиеПоСотрудникам.НачалоОтпуска
				|	КОНЕЦ КАК НачалоОтпуска,
				|	ВЫБОР
				|		КОГДА ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска > &КонПериод
				|			ТОГДА &КонПериод
				|		ИНАЧЕ ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска
				|	КОНЕЦ КАК ОкончаниеОтпуска
				|ИЗ
				|	РегистрСведений.ОтпускаФактическиеПоСотрудникам КАК ОтпускаФактическиеПоСотрудникам
				|ГДЕ
				|	(ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный)
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть)
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный)
				//заявка №1931 (база заявок Кристалла) Дмитрук О.Г.
				|			ИЛИ ОтпускаФактическиеПоСотрудникам.Состояние = ЗНАЧЕНИЕ(Перечисление.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком))
				//заявка №1931
				|	И ОтпускаФактическиеПоСотрудникам.ОкончаниеОтпуска > &НачПериод
				|	И ОтпускаФактическиеПоСотрудникам.Сотрудник.Физлицо = &Физлицо
				|УПОРЯДОЧИТЬ ПО
				|	ОкончаниеОтпуска ";
				
				ЗапросОтпуск.УстановитьПараметр("НачПериод", НачалоМесяца(ПериодРегистрации));
				ЗапросОтпуск.УстановитьПараметр("КонПериод", КонецМесяца(ПериодРегистрации));
				ЗапросОтпуск.УстановитьПараметр("Физлицо", ТекСтрока.Физлицо);
				ЗапросОтпуск.Текст = ТекстЗапросаОтпуск;
				
				ТЗ = ЗапросОтпуск.Выполнить().Выгрузить();
				
				Если ТЗ.Количество() > 0 Тогда
					Если ТЗ[0].ОкончаниеОтпуска < НачалоМесяца(ПериодРегистрации) Тогда
						Продолжить;
					КонецЕсли;
					
					ДобавлениеСтрокДата = Новый ТаблицаЗначений;
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаНачала");
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаОкончания");
					ДатаКонПрошл = "";
					Для Каждого стрТЗ из ТЗ Цикл 
						если ДатаКонПрошл ="" или КонецДня(ДатаКонПрошл)+1 <> стрТЗ.НачалоОтпуска Тогда 
							СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
							СтрокаДобавлениеСтрокДата.ДатаНачала = стрТЗ.НачалоОтпуска;
						КонецЕсли;
						СтрокаДобавлениеСтрокДата.ДатаОкончания = стрТЗ.ОкончаниеОтпуска;
						ДатаКонПрошл = стрТЗ.ОкончаниеОтпуска;
					КонецЦикла;
					ПрошлДействиеКонец1 = ТЗ[0].НачалоОтпуска-86400;
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала,
					|	ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания,
					|	СостояниеРаботниковОрганизаций.Период КАК Период,
					|	СостояниеРаботниковОрганизаций.ПериодЗавершения
					|ИЗ
					|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
					|		ПО СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
					|			И СостояниеРаботниковОрганизаций.Период > ОтпускаОрганизацийРаботникиОрганизации.ДатаНачала
					|			И СостояниеРаботниковОрганизаций.ПериодЗавершения <= ОтпускаОрганизацийРаботникиОрганизации.ДатаОкончания
					|ГДЕ
					|	СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтзывИзОтпуска
					|	И СостояниеРаботниковОрганизаций.Сотрудник.ФизЛицо = &ФизЛицо
					|	И СостояниеРаботниковОрганизаций.Организация = &Организация
					|
					|УПОРЯДОЧИТЬ ПО
					|	Период";
					
					Запрос.УстановитьПараметр("Организация", Организация);
					Запрос.УстановитьПараметр("ФизЛицо", ТекСтрока.Физлицо);
					
					РезультатЗапросаОтзыв = Запрос.Выполнить().Выбрать();
					ДобавлениеСтрокДата1 = Новый ТаблицаЗначений;
					ДобавлениеСтрокДата1.Колонки.Добавить("ДатаНачала");
					ДобавлениеСтрокДата1.Колонки.Добавить("ДатаОкончания");
					Первый = Истина;
					для Каждого стрДобавлениеСтрок из ДобавлениеСтрокДата Цикл
						РезультатЗапросаОтзыв = Запрос.Выполнить().Выбрать();
						Пока РезультатЗапросаОтзыв.Следующий() Цикл
							если РезультатЗапросаОтзыв.Период> стрДобавлениеСтрок.ДатаОкончания или РезультатЗапросаОтзыв.ПериодЗавершения <= стрДобавлениеСтрок.ДатаНачала Тогда 
								Продолжить;
							КонецЕсли;
							
							если Первый Тогда
								если РезультатЗапросаОтзыв.Период > стрДобавлениеСтрок.ДатаНачала Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();	
									СтрокаДобавлениеСтрокДата1.ДатаНачала = стрДобавлениеСтрок.ДатаНачала;
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатЗапросаОтзыв.Период - 86400);
									
								КонецЕсли;
								ПрошлДействиеКонец1 = РезультатЗапросаОтзыв.ПериодЗавершения;
							иначе
								
								если НачалоДня(ПрошлДействиеКонец1)<> стрДобавлениеСтрок.ДатаОкончания+86400 Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
									СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатЗапросаОтзыв.Период) - 86400;
								КонецЕсли;
								ПрошлДействиеКонец1 = РезультатЗапросаОтзыв.ПериодЗавершения;
								
								
							КонецЕсли;
							Первый = Ложь;
						КонецЦикла;
						если НачалоДня(ПрошлДействиеКонец1)<> стрДобавлениеСтрок.ДатаОкончания+86400 Тогда
							СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
							СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
							СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
							ПрошлДействиеКонец1 = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
						КонецЕсли;	
					КонецЦикла;
					
					
					КоличествоДней = 0;
					Для каждого СтрДней Из ДобавлениеСтрокДата1 Цикл
						ЗапросДней = Новый Запрос;
						ТекстЗапросаДней = "ВЫБРАТЬ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
						|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни
						|ИЗ
						|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
						|ГДЕ
						|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачДатаКалендаря 
						|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонДатаКалендаря";
						
						ЗапросДней.Текст = ТекстЗапросаДней;
						ЗапросДней.УстановитьПараметр("НачДатаКалендаря", СтрДней.ДатаНачала);
						ЗапросДней.УстановитьПараметр("КонДатаКалендаря", СтрДней.ДатаОкончания);
						
						КолДней = ЗапросДней.Выполнить().Выгрузить();
						Для Каждого стрКолДней из КолДней Цикл 
							КоличествоДней = КоличествоДней+стрКолДней.КалендарныеДни;
						КонецЦикла;
					КонецЦикла; 
					Для каждого СтрДней Из ДобавлениеСтрокДата1 Цикл				
						Если КоличествоДней > 5 Тогда
							ТекСтрока.Сумма = 0;
							Сообщить("" + ТекСтрока.Физлицо + " находится в отпуске с " + Формат(СтрДней.ДатаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(СтрДней.ДатаОкончания,"ДФ=dd.MM.yyyy"));
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			//заявка №1942 (база заявок Кристалла) Дмитрук О.Г.
			Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк Тогда
				ЗапросКасса = Новый Запрос;
				ТекстЗапросаКасса = "ВЫБРАТЬ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо
				|ИЗ
				|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
				|ГДЕ
				|	ЗарплатаКВыплатеОрганизацийЗарплата.Физлицо = &Физлицо
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка <> &Ссылка
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ПериодРегистрации МЕЖДУ &НачПериод И &КонПериод
				|	И (НЕ ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ПометкаУдаления)
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.ПлановыйАванс)
				|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка.СпособВыплаты = ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыЗарплаты.ЧерезКассу)";
				
				ЗапросКасса.УстановитьПараметр("НачПериод", НачалоМесяца(ПериодРегистрации));
				ЗапросКасса.УстановитьПараметр("КонПериод", КонецМесяца(ПериодРегистрации));
				ЗапросКасса.УстановитьПараметр("Физлицо", ТекСтрока.Физлицо);
				ЗапросКасса.УстановитьПараметр("Ссылка", Ссылка);
				
				ЗапросКасса.Текст = ТекстЗапросаКасса;
				
				ТЗ = ЗапросКасса.Выполнить().Выгрузить();
				
				Если ТЗ.Количество() > 0 Тогда
					ТекСтрока.Сумма = 0;
					Сообщить("По работнику " + ТекСтрока.Физлицо + " аванс начислили по кассе!", СтатусСообщения.Важное);
				КонецЕсли;
			КонецЕсли;
			//заявка №1942
			
		КонецЦикла;
		
		
		//О.Т. Аверсон 10.01.2018 № 1426
		ЗапросАлименты = Новый Запрос;
		ЗапросАлименты.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ КАК СпособРасчетаИЛ,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокумента,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер КАК Размер,
		|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
		|ГДЕ
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ИсполнительныйЛист
		|	И ПлановыеУдержанияРаботниковОрганизаций.Организация = &Организация
		|	И ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо В(&ФизЛицо)
		|	И ПлановыеУдержанияРаботниковОрганизаций.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
		|	И &Период МЕЖДУ ПлановыеУдержанияРаботниковОрганизаций.Период И ВЫБОР
		|			КОГДА ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &Период
		|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ, -1)
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.ВидИсполнительногоДокумента,
		|	ПлановыеУдержанияРаботниковОрганизаций.ПериодЗавершения,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.СпособРасчетаИЛ,
		|	ПлановыеУдержанияРаботниковОрганизаций.Регистратор.Размер";
		
		ЗапросАлименты.УстановитьПараметр("Организация", Организация);
		ЗапросАлименты.УстановитьПараметр("Период", ПериодРегистрации);
		ЗапросАлименты.УстановитьПараметр("ФизЛицо", Зарплата.ВыгрузитьКолонку("ФизЛицо"));
		
		ТЗАлименты = ЗапросАлименты.Выполнить().Выгрузить();
		
		Для Каждого Стр из Зарплата Цикл 
			МассивАлименты = ТЗАлименты.НайтиСтроки(Новый Структура("ФизЛицо",Стр.Физлицо));
			Если МассивАлименты.Количество()>0 Тогда
				Сч = 0;
				Для Каждого стрМассивАлименты из МассивАлименты Цикл 
					Если Сч = 1 Тогда 
						Стр.Примечание = Стр.Примечание + " ";
					КонецЕсли;
					
					Стр.Примечание = Стр.Примечание + стрМассивАлименты.ВидИсполнительногоДокумента +" "+ Строка(стрМассивАлименты.Размер)+?(стрМассивАлименты.СпособРасчетаИЛ = 1,"%","руб.") +" до "+ Формат(стрМассивАлименты.ПериодЗавершения-1,"ДЛФ=Д")+"г.";
					Сч = 1;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		//О.Т. Аверсон 10.01.2018 № 1426
		
		//О.Т. 06.10.2014 не нужна очистка
		//сразу же и очистим строки с 0 суммой
		//мПустоеЗначение = Зарплата.НайтиСтроки(Новый Структура("Сумма", 0));
		//Для Каждого мСтрока Из мПустоеЗначение Цикл
		//	Зарплата.Удалить(мСтрока);
		//КонецЦикла;
		
		//заявка №1916 
	КонецЕсли;
	
КонецПроцедуры
//Аверсон-софт, Островская Татьяна 15.06.2012 № 15496

Процедура ЗаменаЗначенийКолонкиВыплаченности(ВыбранноеЗначение) Экспорт
	
	Если ВыбранноеЗначение = "НеВыплачено" Тогда
		ТЧ = Зарплата.Выгрузить();
		ТЧ.ЗаполнитьЗначения(Перечисления.ВыплаченностьЗарплаты.НеВыплачено,"ВыплаченностьЗарплаты");
		Зарплата.Загрузить(ТЧ);
	Иначе 	
		Если ВыбранноеЗначение = "Выплачено" Тогда
			ЗначениеНаЗамену = Перечисления.ВыплаченностьЗарплаты.Выплачено
		ИначеЕсли ВыбранноеЗначение = "Задепонировано" Тогда
			ЗначениеНаЗамену = Перечисления.ВыплаченностьЗарплаты.Задепонировано
		КонецЕсли; 
		Для каждого СтрокаТЧ Из Зарплата Цикл
			Если СтрокаТЧ.ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.НеВыплачено Тогда
				СтрокаТЧ.ВыплаченностьЗарплаты = ЗначениеНаЗамену
			КонецЕсли;  
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // ЗаменаЗначенийВТабличнойЧасти()

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	//если ФормироватьПромежуточнуюВедомость Тогда 
	//	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
	//		Возврат Новый Структура("Т53,Т49,КО2,Реестр","Форма Т-53","Форма Т-49","РКО","Реестр депонированных сумм");
	//	Иначе
	//		Возврат Новый Структура("ПереченьПолностью, ФормированиеФайлаВБанк, ФормированиеФайлаЗПБелагропромбанк,РПВ", "Список плательщиков в банк", "Формирование файла","Формирование файла для ЗП Белагропромбанк","РПВ"); // №14657 18.01.2012 , Дыма 		
	//	КонецЕсли;
	//иначе
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетОтОбратного
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РасчетОтОбратного = Ложь;
	Если РезультатЗапроса.Следующий() Тогда 
		РасчетОтОбратного = РезультатЗапроса.РасчетОтОбратного;
	КонецЕсли;
	
	
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
		Если РасчетОтОбратного Тогда 
			Возврат Новый Структура("Т53,Т49,КО2,Реестр,МакетРублиЧ","Форма Т-53","Форма Т-49","РКО","Реестр депонированных сумм","Макет Рубли чистые");
		иначе
			Возврат Новый Структура("Т53,Т49,КО2,Реестр","Форма Т-53","Форма Т-49","РКО","Реестр депонированных сумм");
		КонецЕсли;
	Иначе
		Если РасчетОтОбратного Тогда 
			Возврат Новый Структура("ПереченьПолностью, ФормированиеФайлаВБанк, ФормированиеФайлаЗПБелагропромбанк,МакетРублиЧ", "Список плательщиков в банк", "Формирование файла","Формирование файла для ЗП Белагропромбанк","Макет Рубли чистые"); // №14657 18.01.2012 , Дыма 		
		иначе
			Возврат Новый Структура("ПереченьПолностью, ФормированиеФайлаВБанк, ФормированиеФайлаЗПБелагропромбанк", "Список плательщиков в банк", "Формирование файла","Формирование файла для ЗП Белагропромбанк"); // №14657 18.01.2012 , Дыма 		
		КонецЕсли;
	КонецЕсли; 
	//КонецЕсли;
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Рассчитывает "усредненную" 1/300 часть ставки рефинансирования ЦБ
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   число - коэффициент, на который следует умножать сумму выплаты
//
Функция РассчитатьПроцентКомпенсации() Экспорт
	
	Если ДнейНеВыплаты = 0 Тогда
		Возврат 0
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РАЗНОСТЬДАТ(ПериодыИзмененияСтавки.ДатаC, ПериодыИзмененияСтавки.ДатаПо, ДЕНЬ) * ПериодыИзмененияСтавки.Размер / 300 / 100), 0) КАК ПроцентКомпенсации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА СтавкаРефинансированияЦБ.Период > &ДатаВыплаты
	|				ТОГДА СтавкаРефинансированияЦБ.Период
	|			ИНАЧЕ &ДатаВыплаты
	|		КОНЕЦ КАК ДатаC,
	|		ЕСТЬNULL(ВЫБОР
	|				КОГДА МИНИМУМ(СледующаяДата.Период) >= &ДатаДокумента
	|					ТОГДА &ДатаДокумента
	|				ИНАЧЕ МИНИМУМ(СледующаяДата.Период)
	|			КОНЕЦ, &ДатаДокумента) КАК ДатаПо,
	|		СтавкаРефинансированияЦБ.Размер КАК Размер
	|	ИЗ
	|		РегистрСведений.СтавкаРефинансированияЦБ КАК СтавкаРефинансированияЦБ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкаРефинансированияЦБ КАК СледующаяДата
	|			ПО СтавкаРефинансированияЦБ.Период < СледующаяДата.Период
	|	ГДЕ
	|		СтавкаРефинансированияЦБ.Период <= &ДатаДокумента
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтавкаРефинансированияЦБ.Размер,
	|		СтавкаРефинансированияЦБ.Период
	|	
	|	ИМЕЮЩИЕ
	|		ЕСТЬNULL(МИНИМУМ(СледующаяДата.Период), &ДатаДокумента) >= &ДатаВыплаты) КАК ПериодыИзмененияСтавки";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("ДатаВыплаты", Дата - 86400 * ДнейНеВыплаты);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить()[0].ПроцентКомпенсации
	
КонецФункции // РассчитатьПроцентКомпенсации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Зарплата,,"Физлицо");
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	ЗаполнитьДокумент(Основание);
КонецПроцедуры

Процедура ЗаполнитьНаборЗаписейПоДаннымНДФЛ(НаборЗаписей, ДанныеНДФЛ, ВыборкаПоШапкеДокумента, Перерасчет = Ложь, ФизлицаСписок = Неопределено, КомментироватьРасчет = Ложь, ВыборкаПодразделений,Док,ТаблицаЗначенийЗП) //О.Т. 04.02.2015 № 333
	ЗаписьГода = Истина;
	УжеИсчислили = 0;
	УжеПрименилиЛичный = 0;
	УжеПрименилиДетский = 0;
	УжеПрименилиДетскийИнвалидов = 0;
	ТекущееФизлицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	ТекущийГод = 0;
	СтруктураПоиска = Новый Структура("Физлицо, МесяцНалоговогоПериода");
	
	// строим соответствие физлиц, по  которым считается НДФЛ и индексов их строк табличной части НДФЛ
	РаботникиДляРасчетаНДФЛ = Новый Соответствие;
	РасчетПоФизлицу = Ложь;
	//Если НЕ (ФизлицаСписок = НеОпределено) И Перерасчет = Ложь Тогда
	//	// расчет по одному физлицу
	//	РасчетПоФизлицу = Истина;
	//	РаботникиДляРасчетаНДФЛ.Вставить(ФизлицаСписок[0].Значение);
	//	СтруктураПоиска = Новый Структура("ФизЛицо", ФизлицаСписок[0].Значение);
	//	// запоминаем позицию физлица в табличной части
	//	ИндексСтрокиТаблицыНДФЛ = НеОпределено;
	//	МассивСтрок = НДФЛ.НайтиСтроки(СтруктураПоиска);
	//	Для Каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
	//		Если ИндексСтрокиТаблицыНДФЛ = НеОпределено Тогда
	//			ИндексСтрокиТаблицыНДФЛ = СтрокаТабличнойЧасти.НомерСтроки - 1;
	//		КонецЕсли;
	//		НДФЛ.Удалить(СтрокаТабличнойЧасти);
	//	КонецЦикла;
	//	Если ИндексСтрокиТаблицыНДФЛ = НеОпределено Тогда
	//		ИндексСтрокиТаблицыНДФЛ = 0;
	//	КонецЕсли;
	//	
	//ИначеЕсли НЕ (ФизлицаСписок = Неопределено) Тогда
	//	// это перерасчет
	//	Для Каждого ЭлементСписка Из ФизлицаСписок Цикл
	//		РаботникиДляРасчетаНДФЛ.Вставить(ЭлементСписка.Значение);
	//	КонецЦикла;
	//Иначе //расчет всего документа
	//Для Каждого Строка Из НДФЛ Цикл
	//	РаботникиДляРасчетаНДФЛ.Вставить(Строка.Физлицо);
	//КонецЦикла;
	//// очистим результаты расчета НДФЛ, которые находятся в табличной части документа
	//НДФЛ.Очистить();
	
	//КонецЕсли;
	
	//ЗапросШкала = Новый Запрос;
	//ЗапросШкала.Текст = "ВЫБРАТЬ
	//|	ШкалаПодоходногоНалогаСрезПоследних.Налог
	//|ИЗ
	//|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(&КонецПериода, ) КАК ШкалаПодоходногоНалогаСрезПоследних
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НижнийПредел";
	//ЗапросШкала.УстановитьПараметр("КонецПериода", ПериодРегистрации);
	//Шкала = ЗапросШкала.Выполнить().Выгрузить();
	
	
	СтруктураПоискаПодразделения = Новый Структура("Физлицо,Период");
	ФизЛицоПрошл = "";
	//Аверсон 03.11.2020 ПСА СВФР-006605 +++
	Вычет311ОстатокПрошл = 0;
	Пока ДанныеНДФЛ.Следующий() Цикл
		если ДанныеНДФЛ.Период <> Дата(2015,1,1) и ДанныеНДФЛ.Период <> Дата(2015,2,1) и ДанныеНДФЛ.Период <> Дата(2015,3,1) Тогда  
			//если ДанныеНДФЛ.Период = ПериодРегистрации Тогда
			//О.Т. Аверсон 27.03.2016 № 950
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Ссылка,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК Порядок
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
			|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
			|	И СотрудникиОрганизаций.Физлицо = &Физлицо
			|	И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок";
			Запрос.УстановитьПараметр("ФизЛицо",ДанныеНДФЛ.ФизЛицо);
			Запрос.УстановитьПараметр("ГоловнаяОрганизация",Организация);
			Выборка = Запрос.Выполнить().Выбрать();
			Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			Пока Выборка.Следующий() Цикл 
				Сотрудник = Выборка.Ссылка;
			КонецЦикла;
			Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
			КонецЕсли;
			//О.Т. Аверсон 27.03.2016 № 950			
			ЗапросШкала = Новый Запрос;
			ЗапросШкала.Текст = "ВЫБРАТЬ
			|	ШкалаПодоходногоНалогаСрезПоследних.Налог
			|ИЗ
			|	РегистрСведений.ШкалаПодоходногоНалога.СрезПоследних(&КонецПериода, ) КАК ШкалаПодоходногоНалогаСрезПоследних
			|ГДЕ
			|	ШкалаПодоходногоНалогаСрезПоследних.Организация = &Организация
			|	И ШкалаПодоходногоНалогаСрезПоследних.ВидНалогообложения = &ВидНалогообложения
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШкалаПодоходногоНалогаСрезПоследних.НижнийПредел";
			ЗапросШкала.УстановитьПараметр("КонецПериода", ДанныеНДФЛ.Период);//О.Т. 09.01.2015 № 
			ЗапросШкала.УстановитьПараметр("Организация", Организация);
			ЗапросШкала.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			Шкала = ЗапросШкала.Выполнить().Выгрузить();
			
			ЗапросИндСтавкаНалогообл = Новый Запрос;
			ЗапросИндСтавкаНалогообл.Текст = 
			"ВЫБРАТЬ
			|	ИноеНалогообложениеПоСотрудникамСрезПоследних.НДФЛ
			|ИЗ
			|	РегистрСведений.ИноеНалогообложениеПоСотрудникам.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ВидНалогообложения = &ВидНалогообложения
			|				И Сотрудник = &Сотрудник) КАК ИноеНалогообложениеПоСотрудникамСрезПоследних";
			
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("ВидНалогообложения", ВидНалогообложения);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Организация", Организация);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Период", ДанныеНДФЛ.Период);
			ЗапросИндСтавкаНалогообл.УстановитьПараметр("Сотрудник", Сотрудник); 
			РезИндСтавкаНалогообл = ЗапросИндСтавкаНалогообл.Выполнить().Выгрузить();
			ЕстьИндивидСтавка = Ложь;
			СтавкаНДФЛИнд = 0;
			Если РезИндСтавкаНалогообл.Количество()>0 Тогда 
				ЕстьИндивидСтавка = Истина;
				СтавкаНДФЛИнд = РезИндСтавкаНалогообл[0].НДФЛ;
			КонецЕсли;
			
			если ЗаписьГода Тогда 
				ГодПредыдущий = ДанныеНДФЛ.период;
				ЗаписьГода = Ложь;
			КонецЕсли;
			
			Если ТекущееФизлицо <> ДанныеНДФЛ.ФизЛицо ИЛИ ТекущийГод <> Год(ДанныеНДФЛ.Период) Тогда
				УжеИсчислили = 0;
				// уже примененные вычеты
				УжеПрименилиЛичный = 0;
				УжеПрименилиДетский = 0;
				УжеПрименилиДетскийЛьгота = 0;
				УжеПрименилиДополнительный = 0;
				
				УжеПрименили312 = 0;
				УжеПрименили311 = 0;
				УжеПрименили640Страх = 0;
				// текущие физлицо и год периода
				ТекущееФизлицо = ДанныеНДФЛ.ФизЛицо;
				ТекущийГод = Год(ДанныеНДФЛ.Период);
			КонецЕсли;
			ВычетыПримененные312ЗаМесяц = 0;
			ВычетыПримененные311ЗаМесяц = 0;
			ВычетыПримененные640СтрахЗаМесяц = 0;
			//енд			
			
			
			ВычетыПримененныеДетский = (ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.РанееПримененныеВычетыДетские - УжеПрименилиДетский);
			
			
			ВычетыПримененныеЛичный = ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.РанееПримененныеВычетыЛичные - УжеПрименилиЛичный;
			ВычетыПримененныеДетскийЛьгота = ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота  - ДанныеНДФЛ.РанееПримененныеВычетыДетскиеЛьгота  - УжеПрименилиДетскийЛьгота;
			ВычетыПримененныеДополнительный =  ДанныеНДФЛ.ПримененныеВычетыДополнительные - ДанныеНДФЛ.РанееПримененныеВычетыДополнительные - УжеПрименилиДополнительный;
			ДоходЗаПериодДляВычета = ДанныеНДФЛ.ДоходЗаПериод - (ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод + ДанныеНДФЛ.ПримененныеВычетыДетскиеЗаПериод  + ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьготаЗаПериод + ДанныеНДФЛ.ПримененныеВычетыДополнительныеЗаПериод);
			
			ОграничениеНДФЛ = РегистрыСведений.НДФЛРазмерВычетов.ПолучитьПоследнее(ДанныеНДФЛ.Период, Новый Структура("КодВычета",Справочники.ВычетыНДФЛ.Код640страх)).ОграничениеПоДоходам;
			
			
			Вычеты640СтрахОстаток = ДанныеНДФЛ.Вычет640СтрахОстаток - УжеПрименили640Страх;
			Если ДоходЗаПериодДляВычета > 0 тогда
				Если  Вычеты640СтрахОстаток > ДоходЗаПериодДляВычета тогда
					Если ДоходЗаПериодДляВычета > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = ДоходЗаПериодДляВычета;
					КонецЕсли;
				Иначе
					Если Вычеты640СтрахОстаток > ОграничениеНДФЛ тогда
						ВычетыПримененные640СтрахЗаМесяц = ОграничениеНДФЛ;
					Иначе
						ВычетыПримененные640СтрахЗаМесяц = Вычеты640СтрахОстаток;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//О.Т. Аверсон 12.09.2017 № 1028 убрана проверка, т.к. Доход расчитывается только за тек месяц
			Вычеты312Остаток = ДанныеНДФЛ.Вычет312Остаток - УжеПрименили312;
			ВычетыПримененные312ЗаМесяц = Вычеты312Остаток;
			
			//Вычеты312Остаток = ДанныеНДФЛ.Вычет312Остаток - УжеПрименили312;
			//Если ДоходЗаПериодДляВычета > 0 тогда
			//	Если  Вычеты312Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц тогда
			//		ВычетыПримененные312ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные640СтрахЗаМесяц;
			//	Иначе
			//		ВычетыПримененные312ЗаМесяц = Вычеты312Остаток;
			//	КонецЕсли;
			//КонецЕсли;
			//О.Т. Аверсон 12.09.2017 № 1028
			
			//О.Т. Аверсон 22.05.2018 № 1991
			Вычеты311Остаток = ДанныеНДФЛ.Вычет311Остаток - УжеПрименили311; 			
			ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
			
			//Вычеты311Остаток = ДанныеНДФЛ.Вычет311Остаток - УжеПрименили311;
			//Если ДоходЗаПериодДляВычета > 0 тогда
			//	Если  Вычеты311Остаток > ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц тогда 
			//		ВычетыПримененные311ЗаМесяц = ДоходЗаПериодДляВычета - ВычетыПримененные312ЗаМесяц - ВычетыПримененные640СтрахЗаМесяц;
			//	Иначе
			//		ВычетыПримененные311ЗаМесяц = Вычеты311Остаток;
			//	КонецЕсли;
			//КонецЕсли;
			//О.Т. Аверсон 22.05.2018 № 1991
			
			ГодПредыдущий = ДанныеНДФЛ.Период;
			если ДанныеНДФЛ.Период = ПериодРегистрации Тогда 
				ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц -  ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
			Иначе 
				ВычетыПримененные311Мес = ВычетыПримененные311ЗаМесяц;
			КонецЕсли;
			
			МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеНДФЛ.ФизЛицо)); 
			//если ДанныеНДФЛ.Период = ПериодРегистрации Тогда
			Для Каждого стрСтрока из МассивСотрудник Цикл	
				Если НачалоМесяца(стрСтрока.ПериодДействияНачало) = ДанныеНДФЛ.Период Тогда
					Строка = Док.Начисления.Добавить();
					Строка.ФизЛицо 						= ДанныеНДФЛ.ФизЛицо; 
					Строка.ПериодНачисления = стрСтрока.ПериодДействияНачало;
					Строка.ПериодНачисленияКонец = стрСтрока.ПериодДействияКонец;
					ТекСтрока = стрСтрока;
					ЗапросПрием = Новый Запрос;
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
					
					ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник);
					
					
					РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
					Период = ПериодРегистрации;
					Если РезультатЗапросаПрием.Количество()>0 Тогда 
						Период = РезультатЗапросаПрием[0].Период;
					КонецЕсли;
					
					СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",ТекСтрока.Сотрудник));
					Строка.Должность = СведенияОРаботнике.Должность;
					ЗаполнитьЗначенияСвойств(Строка,ТекСтрока);
				КонецЕсли;
			КонецЦикла;
			//КонецЕсли;
			
			//Аверсон ЕАЕ 11.11.2024 СВФР-014033 (задваивались строки по отпуску по беременности и родам)
			//Если ФизЛицоПрошл <> ДанныеНДФЛ.ФизЛицо Тогда 
			//	Для Каждого стрСтрока из МассивСотрудник Цикл	
			//		Если НачалоМесяца(стрСтрока.ПериодДействияНачало) > ПериодРегистрации и стрСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам Тогда
			//			Строка = Док.Начисления.Добавить();
			//			Строка.ФизЛицо 						= ДанныеНДФЛ.ФизЛицо; 
			//			Строка.ПериодНачисления = стрСтрока.ПериодДействияНачало;
			//			Строка.ПериодНачисленияКонец = стрСтрока.ПериодДействияКонец;
			//			ТекСтрока = стрСтрока;
			//			ЗапросПрием = Новый Запрос;
			//			ЗапросПрием.Текст = 
			//			"ВЫБРАТЬ
			//			|	РаботникиОрганизаций.Период
			//			|ИЗ
			//			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			//			|ГДЕ
			//			|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
			//			|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			//			|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
			//			
			//			ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
			//			ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
			//			ЗапросПрием.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник);
			//			
			//			
			//			РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
			//			Период = ПериодРегистрации;
			//			Если РезультатЗапросаПрием.Количество()>0 Тогда 
			//				Период = РезультатЗапросаПрием[0].Период;
			//			КонецЕсли;
			//			
			//			СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",ТекСтрока.Сотрудник));
			//			Строка.Должность = СведенияОРаботнике.Должность;
			//			ЗаполнитьЗначенияСвойств(Строка,ТекСтрока);
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			//Аверсон СВФР-014033
			
			
			
			Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощью 
				или ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам
				или ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления  //П.С. 17.12.2015 № СВ00-000764
				ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой //Аверсон 21.02.2020 КВВ СВФР-005569
				Тогда 
				//О.Т. Аверсон 16.11.2016 № 31
				БудМесяцВкл = Ложь;
				Для Каждого СтрНач из Док.Начисления Цикл 
					если НачалоМесяца(СтрНач.ПериодНачисления) = ДанныеНДФЛ.Период Тогда 
						БудМесяцВкл = Истина;
					КонецЕсли;					
				КонецЦикла;
				//О.Т. Аверсон 16.11.2016 № 31
				если ДанныеНДФЛ.Период = ПериодРегистрации или БудМесяцВкл Тогда
					
					Если ДанныеНДФЛ.Резидент Тогда
						НалогИсчисленный = (ДанныеНДФЛ.ДоходЗаПериод - ДанныеНДФЛ.ПримененныеВычетыЛичныеЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДетскиеЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьготаЗаПериод - ДанныеНДФЛ.ПримененныеВычетыДополнительныеЗаПериод - ВычетыПримененные640СтрахЗаМесяц  - ВычетыПримененные312ЗаМесяц - ВычетыПримененные311Мес )*ОКР(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,2,0);
						УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
						НалогИсчисленный = ОбщегоНазначения.ОкруглитьПоВалюте(НалогИсчисленный,Константы.ВалютаРегламентированногоУчета.Получить());
						
						НалогИсчисленный = НалогИсчисленный;
						
					Иначе
						НалогИсчисленный = ДанныеНДФЛ.НалогИсчисленный;
						УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
					КонецЕсли;
				иначе
					НалогИсчисленный = 0;
					УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
					
				КонецЕсли;
			Иначе
				
				Если ДанныеНДФЛ.Резидент Тогда
					НалогИсчисленный = ((ДанныеНДФЛ.ДоходЗаГод - ДанныеНДФЛ.ПримененныеВычетыЛичные - ДанныеНДФЛ.ПримененныеВычетыДетские - ДанныеНДФЛ.ПримененныеВычетыДетскиеЛьгота - ДанныеНДФЛ.ПримененныеВычетыДополнительные - (ВычетыПримененные640СтрахЗаМесяц + УжеПрименили640Страх) - (ВычетыПримененные312ЗаМесяц + УжеПрименили312) - (ВычетыПримененные311Мес + УжеПрименили311))*ОКР(?(ЕстьИндивидСтавка,СтавкаНДФЛИнд,Шкала[0].Налог)/100,2,0) - ДанныеНДФЛ.НалогРанееИсчисленный) - УжеИсчислили;
					УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
					НалогИсчисленный = ОбщегоНазначения.ОкруглитьПоВалюте(НалогИсчисленный,Константы.ВалютаРегламентированногоУчета.Получить());
					
					НалогИсчисленный = НалогИсчисленный;
					
				Иначе
					НалогИсчисленный = ДанныеНДФЛ.НалогИсчисленный;
					УжеИсчислили = УжеИсчислили + НалогИсчисленный;//О.Т. 07.07.2014 № 108
				КонецЕсли;
				
			КонецЕсли;
			
			ВычетыПримененные640Страх = Мин(ВычетыПримененные640СтрахЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц,ОграничениеНДФЛ-ДанныеНДФЛ.РанееПримененныеВычеты640СтрахЗаМесяц); //Островская Татьяна 11.03.2014 № 17170
			//Островская Татьяна 27.03.2014 № 17170
			если УжеПрименили640Страх >= ОграничениеНДФЛ Тогда 
				ВычетыПримененные640Страх = 0;
			КонецЕсли;
			//Островская Татьяна 27.03.2014 № 17170
			ВычетыПримененные312 = ВычетыПримененные312ЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты312ЗаМесяц;
			ВычетыПримененные311 = ВычетыПримененные311ЗаМесяц - ДанныеНДФЛ.РанееПримененныеВычеты311ЗаМесяц;
			
			// Запомним суммы для следующей итерации
			//УжеИсчислили = УжеИсчислили + НалогИсчисленный;
			УжеПрименилиЛичный = УжеПрименилиЛичный + ВычетыПримененныеЛичный;
			УжеПрименилиДетский = УжеПрименилиДетский + ВычетыПримененныеДетский;
			УжеПрименилиДетскийЛьгота = УжеПрименилиДетскийЛьгота + ВычетыПримененныеДетскийЛьгота;
			УжеПрименилиДополнительный = УжеПрименилиДополнительный + ВычетыПримененныеДополнительный;
			УжеПрименили312 = УжеПрименили312 + ВычетыПримененные312ЗаМесяц;
			УжеПрименили311 = УжеПрименили311 + ВычетыПримененные311ЗаМесяц;
			УжеПрименили640Страх = УжеПрименили640Страх + ВычетыПримененные640СтрахЗаМесяц;
			
			
			ЗапросПоРасчетнойВедомости = Новый Запрос;
			ЗапросПоРасчетнойВедомости.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ВложенныйЗапрос.Результат, 0) КАК Результат,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетЛичный, 0) КАК ПримененныйВычетЛичный,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетНаДетей, 0) КАК ПримененныйВычетНаДетей,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетНаДетейЛьгота, 0) КАК ПримененныйВычетНаДетейЛьгота,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйвычетДополнительный, 0) КАК ПримененныйвычетДополнительный,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетИмущественныйРасход, 0) КАК ПримененныйВычетИмущественныйРасход,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетСоциальныйСПроцентами, 0) КАК ПримененныйВычетСоциальныйСПроцентами,
			|	ЕСТЬNULL(ВложенныйЗапрос.ПримененныйВычетСтраховойРасход, 0) КАК ПримененныйВычетСтраховойРасход
			|ИЗ
			|	(ВЫБРАТЬ
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК Результат,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетЛичный) КАК ПримененныйВычетЛичный,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетНаДетей) КАК ПримененныйВычетНаДетей,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетНаДетейЛьгота) КАК ПримененныйВычетНаДетейЛьгота,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйвычетДополнительный) КАК ПримененныйвычетДополнительный,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетИмущественныйРасход) КАК ПримененныйВычетИмущественныйРасход,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетСоциальныйСПроцентами) КАК ПримененныйВычетСоциальныйСПроцентами,
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.ПримененныйВычетСтраховойРасход) КАК ПримененныйВычетСтраховойРасход
			|	ИЗ
			|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
			|	ГДЕ
			|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ПериодУдержания МЕЖДУ &Период И &Период1
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация = &Организация
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета = &ВидРасчета
			|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос";
			
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Организация", Организация);
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Период", НачалоМесяца(ДанныеНДФЛ.Период));
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Период1", КонецМесяца(ДанныеНДФЛ.Период));
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("ФизЛицо", ДанныеНДФЛ.ФизЛицо);
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Регистратор", ДокументВедомость.Ссылка);
			РезультатПоРасчетнойВед = ЗапросПоРасчетнойВедомости.Выполнить().Выбрать();
			УжеПрименилиПоВедРезультат = 0;
			УжеПрименилиПоВедЛичный = 0;
			УжеПрименилиПоВедНаДетей = 0;
			УжеПрименилиПоВедНаДетейЛьгота = 0;
			УжеПрименилиПоВедДополнительный = 0;
			УжеПрименилиПоВедИмущественный = 0;
			УжеПрименилиПоВедСоциальный = 0;
			УжеПрименилиПоВедСтраховой = 0;
			Пока РезультатПоРасчетнойВед.Следующий() Цикл
				УжеПрименилиПоВедРезультат = РезультатПоРасчетнойВед.Результат;
				УжеПрименилиПоВедЛичный = РезультатПоРасчетнойВед.ПримененныйВычетЛичный;
				УжеПрименилиПоВедНаДетей = РезультатПоРасчетнойВед.ПримененныйВычетНаДетей;
				УжеПрименилиПоВедНаДетейЛьгота = РезультатПоРасчетнойВед.ПримененныйВычетНаДетейЛьгота;
				УжеПрименилиПоВедДополнительный = РезультатПоРасчетнойВед.ПримененныйвычетДополнительный;
				УжеПрименилиПоВедИмущественный = РезультатПоРасчетнойВед.ПримененныйВычетИмущественныйРасход;
				УжеПрименилиПоВедСоциальный = РезультатПоРасчетнойВед.ПримененныйВычетСоциальныйСПроцентами;
				УжеПрименилиПоВедСтраховой = РезультатПоРасчетнойВед.ПримененныйВычетСтраховойРасход;
			КонецЦикла;
			если ДанныеНДФЛ.Период = ПериодРегистрации Тогда
				Строка = Док.Удержания.Добавить();
				Строка.ФизЛицо 						= ДанныеНДФЛ.ФизЛицо; 
				//ПСА 20.10.2021 СВФР-008215 +++
				//МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеНДФЛ.ФизЛицо)); 
				ВременнаяТЗ_ЗП = ТаблицаЗначенийЗП.Скопировать(,"ФизЛицо, Сотрудник,Результат");
				ВременнаяТЗ_ЗП.Свернуть("ФизЛицо, Сотрудник","Результат");
				МассивСотрудник = ВременнаяТЗ_ЗП.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеНДФЛ.ФизЛицо)); 
				//+++ПСА 20.10.2021 СВФР-008215
				
				Если МассивСотрудник.Количество() > 0 Тогда 
					ТекСтрока = МассивСотрудник[0];
					ЗапросПрием = Новый Запрос;
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
					
					ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник);
					
					
					РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
					Период = ПериодРегистрации;
					Если РезультатЗапросаПрием.Количество()>0 Тогда 
						Период = РезультатЗапросаПрием[0].Период;
					КонецЕсли;
					
					СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",ТекСтрока.Сотрудник));
					Строка.Должность = СведенияОРаботнике.Должность;
					Строка.ТабельныйНомер = ТекСтрока.Сотрудник.Код;
					//ПСА 04.10.2021 СВФР-008215 +++
					Если МассивСотрудник.Количество() > 1 Тогда
						ИтСуммаКРаспределению = ТекСтрока.Результат;
						Для Счетчик = 1 По МассивСотрудник.Количество()-1 Цикл
							СтрокаМассива = МассивСотрудник[Счетчик];
							ЗапросПрием = Новый Запрос;
							ЗапросПрием.Текст = 
							"ВЫБРАТЬ
							|	РаботникиОрганизаций.Период
							|ИЗ
							|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
							|ГДЕ
							|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
							|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
							|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
							
							ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
							ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
							ЗапросПрием.УстановитьПараметр("Сотрудник", СтрокаМассива.Сотрудник);
							
							
							РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
							Период = ПериодРегистрации;
							Если РезультатЗапросаПрием.Количество()>0 Тогда 
								Период = РезультатЗапросаПрием[0].Период;
							КонецЕсли;
							
							СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СтрокаМассива.Сотрудник));
							НоваяСтрока = Док.Удержания.Добавить();
							НоваяСтрока.ФизЛицо 	   = СтрокаМассива.ФизЛицо; 							
							НоваяСтрока.Должность      = СведенияОРаботнике.Должность;
							НоваяСтрока.ТабельныйНомер = СтрокаМассива.Сотрудник.Код;
							НоваяСтрока.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог");
							НоваяСтрока.ПериодУдержания = ДанныеНДФЛ.Период;							
							ИтСуммаКРаспределению = ИтСуммаКРаспределению + СтрокаМассива.Результат;
						КонецЦикла;	
					КонецЕсли;
					//+++ПСА 04.10.2021 СВФР-008215
				иначе
					СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ДанныеНДФЛ.ФизЛицо.Наименование);
					ЗапросПрием = Новый Запрос;
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
					|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
					
					ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
					ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
					
					
					РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
					Период = ПериодРегистрации;
					Если РезультатЗапросаПрием.Количество()>0 Тогда 
						Период = РезультатЗапросаПрием[0].Период;
					КонецЕсли;
					
					СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
					Строка.Должность = СведенияОРаботнике.Должность;  
					Строка.ТабельныйНомер = СотрудникПодбор.Код;
				КонецЕсли;
				Строка.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог");
				Строка.ПериодУдержания = ДанныеНДФЛ.Период;
				Строка.Результат   						= ОбщегоНазначения.ОкруглитьПоВалюте(НалогИсчисленный-УжеПрименилиПоВедРезультат,Константы.ВалютаРегламентированногоУчета.Получить());
				Строка.ПримененныйВычетЛичный		= ВычетыПримененныеЛичный-УжеПрименилиПоВедЛичный;
				Строка.ПримененныйВычетНаДетей		= ВычетыПримененныеДетский-УжеПрименилиПоВедНаДетей;
				Строка.ПримененныйВычетНаДетейЛьгота	= ВычетыПримененныеДетскийЛьгота-УжеПрименилиПоВедНаДетейЛьгота;
				Строка.ПримененныйВычетДополнительный   = ВычетыПримененныеДополнительный-УжеПрименилиПоВедДополнительный;
				Строка.ПримененныйВычетИмущественныйРасход		= ВычетыПримененные311-УжеПрименилиПоВедИмущественный;
				Строка.ПримененныйВычетСоциальныйСПроцентами		= ВычетыПримененные312-УжеПрименилиПоВедСоциальный;
				Строка.ПримененныйВычетСтраховойРасход		= ВычетыПримененные640Страх-УжеПрименилиПоВедСтраховой;
				//Аверсон 03.11.2020 ПСА СВФР-006605 +++
				Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда
					Если Вычет311ОстатокПрошл = ДанныеНДФЛ.Вычет311Остаток 
						и Вычет311ОстатокПрошл <> 0 
						и ДанныеНДФЛ.РанееПримененныеВычеты311 < ДанныеНДФЛ.Вычет311Остаток Тогда
						Строка.ПримененныйВычетИмущественныйРасход		=   Строка.Результат;
						Строка.Результат = 0;
					КонецЕсли;	
				КонецЕсли;	
				//+++Аверсон 03.11.2020 ПСА СВФР-006605
				//ПСА 04.10.2021 СВФР-008215 +++
				Если МассивСотрудник.Количество() > 1 и Строка.Результат <> 0  и ИтСуммаКРаспределению <> 0 Тогда
					СуммаДляРаспределения = Строка.Результат;
					СуммаИсходная = СуммаДляРаспределения;
					
					Для Каждого СтрокаМассива Из МассивСотрудник Цикл
						КоэффициентРаспределения = СтрокаМассива.Результат/ИтСуммаКРаспределению;
						СуммаРаспределения = СуммаИсходная*КоэффициентРаспределения;
						ОтборСтрок = Новый Структура();
						ОтборСтрок.Вставить("ФизЛицо",СтрокаМассива.ФизЛицо);
						ОтборСтрок.Вставить("ТабельныйНомер",СтрокаМассива.Сотрудник.Код);
						ОтборСтрок.Вставить("ВидРасчета",ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог"));
						ОтборСтрок.Вставить("ПериодУдержания",ДанныеНДФЛ.Период);							
						
						СтрокиОтбора = Док.Удержания.найтиСтроки(ОтборСтрок);
						Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
							СтрокаОтбора.Результат =  СуммаРаспределения;
							СуммаДляРаспределения = СуммаДляРаспределения - СтрокаОтбора.Результат;
						КонецЦикла;	
					КонецЦикла;	
					Строка.Результат = Строка.Результат - СуммаДляРаспределения;						
				КонецЕсли;	
				//+++ПСА 04.10.2021 СВФР-008215
				
			КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
		ФизЛицоПрошл = ДанныеНДФЛ.ФизЛицо;
		Вычет311ОстатокПрошл = ДанныеНДФЛ.Вычет311Остаток;
	КонецЦикла;
	
	// сформируем и запишем доходы НДФЛ по начислениям документа
	НаборЕСНСведенияОДоходах = РегистрыНакопления.ЕСНСведенияОДоходах.СоздатьНаборЗаписей();
	НаборЕСНСведенияОДоходах.Отбор.Регистратор.Значение = Ссылка;
	НаборЕСНСведенияОДоходах.Очистить();
	
	
	СформироватьДоходыПоПенсионномуФонду(ВыборкаПоШапкеДокумента, НаборЕСНСведенияОДоходах,Неопределено,ВыборкаПоШапкеДокумента.Ссылка.ХарактерВыплаты);
	
	НаборЕСНСведенияОДоходах.Записать();
	
	
	ДанныеДляРасчетаЕСН = ПолучитьДанныеРасчетаЕСН(Организация,Неопределено);
	
	Пока ДанныеДляРасчетаЕСН.Следующий() Цикл
		
		// Пропустим нулевые строки
		Если ДанныеДляРасчетаЕСН.БазаДоходФСЗН = 0  Тогда			
			Продолжить;
		КонецЕсли;
		//О.Т. Аверсон 27.03.2016 № 950
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка,
		|	ВЫБОР
		|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
		|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
		|	И СотрудникиОрганизаций.Физлицо = &Физлицо
		|	И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		Запрос.УстановитьПараметр("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
		Пока Выборка.Следующий() Цикл 
			Сотрудник = Выборка.Ссылка;
		КонецЦикла;
		Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
		иначе
			ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
		КонецЕсли;
		//О.Т. Аверсон 27.03.2016 № 950
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ВидНалогообложения));
		СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ВидНалогообложения));
		СтруктураФСЗНИнвалиды = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗНИнвалиды,ВидНалогообложения));
		
		Если СтруктураПенс.Количество()<>0 тогда
			СтавкаПенсионныйФонд = СтруктураПенс.Размер;
		Иначе
			Сообщить("Не заполнена ставка пенсионного фонда");
			СтавкаПенсионныйФонд = 0;
		КонецЕсли;
		
		Если СтруктураФСЗН.Количество()<>0 тогда
			СтавкаФСЗН = СтруктураФСЗН.Размер;
		Иначе
			Сообщить("Не заполнена ставка отчислений в ФСЗН");
			СтавкаФСЗН = 0;
		КонецЕсли;
		
		Если СтруктураФСЗНИнвалиды.Количество()<>0 тогда
			СтавкаФСЗНИнвалиды = СтруктураФСЗНИнвалиды.Размер;
		Иначе
			Сообщить("Не заполнена ставка отчислений в ФСЗН по инвалидам");
			СтавкаФСЗНИнвалиды = 0;
		КонецЕсли;
		
		
		//Аверсон-софт, Островская Татьяна 20.08.2012 № 15686
		//если ДанныеДляРасчетаЕСН.Месяц = ПериодРегистрации Тогда
		если ДанныеДляРасчетаЕСН.Месяц <> Дата(2015,1,1) и ДанныеДляРасчетаЕСН.Месяц <> Дата(2015,2,1) и ДанныеДляРасчетаЕСН.Месяц <> Дата(2015,3,1) Тогда
			ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
			//если ПенсФондБудМес = 1 тогда //Островская Татьяна 28.04.2014 № 17321 
			ЗапросОтп = Новый Запрос;
			ЗапросОтп.Текст = 
			"ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
			|	ОсновныеНачисленияРаботниковОрганизаций.Результат,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
			|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодДействияНачало И &ПериодДействияНачало1
			|	И МЕСЯЦ(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации) <> МЕСЯЦ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало)
			|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации <> &ПериодРегистрации
			|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицоСтр";
			ЗапросОтп.УстановитьПараметр("ПериодДействияНачало", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			ЗапросОтп.УстановитьПараметр("ПериодДействияНачало1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			ЗапросОтп.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
			
			ЗапросОтп.УстановитьПараметр("ФизЛицоСтр", ДанныеДляРасчетаЕСН.ФизЛицо);
			
			
			РезОтп = ЗапросОтп.Выполнить().Выбрать();
			БазаОтпуск = 0;
			пока РезОтп.Следующий() цикл
				БазаОтпуск = БазаОтпуск + РезОтп.Результат;//Наркевич 08.07.2014 при более одном переходящем виде расчета нужно суммировать
			КонецЦикла;
			//иначе
			//	БазаОтпуск = 0;
			//КонецЕсли;
			//Аверсон-софт, Островская Татьяна 20.08.2012 № 15686
			
			//О.Т. 15.09.2014 № 17594
			СуммаУжеНачислПенс = 0;
			//если ПенсФондБудМес = 1 тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
			|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд
			|ИЗ
			|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			|ГДЕ
			|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация
			|	И ЕСНИсчисленный.ФизЛицо = &ФизЛицо
			|	И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетовНаМесяцНач И &ПериодВзаиморасчетовНаМесяцКон
			|	И ЕСНИсчисленный.ПериодВзаиморасчетов <> &ПериодРегистрации";
			
			Запрос.УстановитьПараметр("парамГоловнаяОрганизация", Организация);
			Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцНач", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Запрос.УстановитьПараметр("ПериодВзаиморасчетовНаМесяцКон", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			РезУжеНачисленный = Запрос.Выполнить().Выбрать();
			Пока РезУжеНачисленный.Следующий() Цикл 
				СуммаУжеНачислПенс = СуммаУжеНачислПенс + РезУжеНачисленный.ПенсионныйФонд;
			КонецЦикла;
			//КонецЕсли;
			//О.Т. 15.09.2014 № 17594	
			
			
			//О.Т. 18.12.2014 № 17744
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	БазаДляНачислений.ФизЛицо КАК ФизЛицо,
			|	БазаДляНачислений.Месяц КАК Месяц,
			|	СУММА(БазаДляНачислений.БазаДоходФСЗН) КАК БазаДоходФСЗН
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основная.ФизЛицо КАК ФизЛицо,
			|		Основная.Месяц КАК Месяц,
			|		ВЫБОР
			|			КОГДА Основная.ДоходФСЗН = &парамПодлежитОбложению
			|				ТОГДА Основная.ОблагаемыйДоход
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК БазаДоходФСЗН,
			|		ВЫБОР
			|			КОГДА Основная.ДоходСтрах = &парамПодлежитОбложению
			|				ТОГДА Основная.ОблагаемыйДоход
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК БазаДоходСтрах,
			|		ВЫБОР
			|			КОГДА Основная.доходЕдиныйПлатеж = &парамПодлежитОбложению
			|				ТОГДА Основная.ОблагаемыйДоход
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК БазаДоходЕдиныйПлатеж
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ЕСННачисления.ФизЛицо КАК ФизЛицо,
			|			ЕСННачисления.Месяц КАК Месяц,
			|			ЕСННачисления.ДоходФСЗН КАК ДоходФСЗН,
			|			ЕСННачисления.ДоходСтрах КАК ДоходСтрах,
			|			ЕСННачисления.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
			|			ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
			|		ИЗ
			|			(ВЫБРАТЬ
			|				ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|				НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
			|				ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН,
			|				ЕСНСведенияОДоходах.ДоходСтрах КАК ДоходСтрах,
			|				ЕСНСведенияОДоходах.доходЕдиныйПлатеж КАК доходЕдиныйПлатеж,
			|				ЕСНСведенияОДоходах.Результат КАК ОблагаемыйДоход
			|			ИЗ
			|				РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			|			ГДЕ
			|				ЕСНСведенияОДоходах.Период МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
			|				И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &парамНачалоМесяцаПериодаРегистрации И &парамКонецМесяцаПериодаРегистрации
			|				И ЕСНСведенияОДоходах.ОбособленноеПодразделение В(&СписокВсехПодразделенийОрганизации)
			|				И НЕ(ЕСНСведенияОДоходах.Период МЕЖДУ &ПериодРегистрации И &ПериодРегистрации1)) КАК ЕСННачисления
			|		ГДЕ
			|			ЕСННачисления.ФизЛицо = &ФизЛицо) КАК Основная) КАК БазаДляНачислений
			|
			|СГРУППИРОВАТЬ ПО
			|	БазаДляНачислений.ФизЛицо,
			|	БазаДляНачислений.Месяц";
			
			Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			Запрос.УстановитьПараметр("парамПодлежитОбложению", Перечисления.ДоходыФСС_НС.Облагается);
			СписокВсехПодразделенийОрганизации = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
			СписокВсехПодразделенийОрганизации.Добавить(Организация);
			Запрос.УстановитьПараметр("СписокВсехПодразделенийОрганизации", СписокВсехПодразделенийОрганизации);
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
			Запрос.УстановитьПараметр("ПериодРегистрации1", КонецМесяца(ПериодРегистрации));
			
			
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
			СуммаБазаДрПериод = 0;
			Пока РезультатЗапроса.Следующий() Цикл
				СуммаБазаДрПериод = СуммаБазаДрПериод + РезультатЗапроса.БазаДоходФСЗН;
			КонецЦикла;
			//О.Т. 18.12.2014 № 17744
			
			
			
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц)-1,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			
			
			Если СтруктураПенс.ОграничениеПоДоходам = 0 ИЛИ РазмерСреднейЗарплаты = 0 тогда
				БазаДоходПенсионныйФонд = ДанныеДляРасчетаЕСН.БазаДоходФСЗН + БазаОтпуск + СуммаБазаДрПериод;
			Иначе	
				БазаДоходПенсионныйФонд = ?(ДанныеДляРасчетаЕСН.БазаДоходФСЗН + БазаОтпуск + СуммаБазаДрПериод > СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты, СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты, ДанныеДляРасчетаЕСН.БазаДоходФСЗН+ БазаОтпуск + СуммаБазаДрПериод);
				
			КонецЕсли;
			//Аверсон-софт, Островская Татьяна 20.08.2012 № 15686
			//Аверсон-софт, Островская Татьяна 13.06.2012 № 15494
			НеПравоНаПенсию = Ложь;
			Запрос = Новый Запрос;
			Запрос.Текст  = 
			"ВЫБРАТЬ
			|	ГражданствоФизЛиц.ФизЛицо,
			|	ГражданствоФизЛиц.Страна,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
			|ГДЕ
			|	ГражданствоФизЛиц.ФизЛицо = &ФизЛицо
			|	И ГражданствоФизЛиц.НеИмеетПравоНаПенсию = ИСТИНА";
			Запрос.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() цикл
				
				НеПравоНаПенсию =	Выборка.НеИмеетПравоНаПенсию;
				
			КонецЦикла;
			
			ЗапросПоРасчетнойВедомости = Новый Запрос;
			ЗапросПоРасчетнойВедомости.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ВложенныйЗапрос.Результат, 0) КАК Результат
			|ИЗ
			|	(ВЫБРАТЬ
			|		СУММА(СведенияПоРасчетноПлатежнойВедомостиУдержания.Результат) КАК Результат
			|	ИЗ
			|		РегистрСведений.СведенияПоРасчетноПлатежнойВедомостиУдержания КАК СведенияПоРасчетноПлатежнойВедомостиУдержания
			|	ГДЕ
			|		СведенияПоРасчетноПлатежнойВедомостиУдержания.ПериодУдержания МЕЖДУ &Период И &Период1
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ФизЛицо = &ФизЛицо
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.Организация = &Организация
			|		И СведенияПоРасчетноПлатежнойВедомостиУдержания.ВидРасчета = &ВидРасчета
			|		И НЕ СведенияПоРасчетноПлатежнойВедомостиУдержания.Регистратор = &Регистратор) КАК ВложенныйЗапрос";
			
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Организация", Организация);
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Период", НачалоМесяца(ДанныеДляРасчетаЕСН.Месяц));
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Период1", КонецМесяца(ДанныеДляРасчетаЕСН.Месяц));
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("ФизЛицо", ДанныеДляРасчетаЕСН.ФизЛицо);
			ЗапросПоРасчетнойВедомости.УстановитьПараметр("Регистратор", ДокументВедомость.Ссылка);
			
			РезультатПоРасчетнойВед = ЗапросПоРасчетнойВедомости.Выполнить().Выбрать();
			УжеПрименилиПоВедРезультат = 0;
			Пока РезультатПоРасчетнойВед.Следующий() Цикл
				УжеПрименилиПоВедРезультат = РезультатПоРасчетнойВед.Результат;
			КонецЦикла;
			
			
			МассивНоваяСтрока = Док.Начисления.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо));
			если МассивНоваяСтрока.Количество()>0 Тогда 
				если ДанныеДляРасчетаЕСН.Месяц = ПериодРегистрации Тогда //О.Т. Аверсон 23.01.2017 № 200
					НоваяСтрока = Док.Удержания.Добавить();
					НоваяСтрока.ФизЛицо 						= ДанныеДляРасчетаЕСН.ФизЛицо; 
					
					//ПСА 20.10.2021 СВФР-008215 +++
					//МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо)); 
					ВременнаяТЗ_ЗП = ТаблицаЗначенийЗП.Скопировать(,"ФизЛицо, Сотрудник,Результат");
					ВременнаяТЗ_ЗП.Свернуть("ФизЛицо, Сотрудник","Результат");
					МассивСотрудник = ВременнаяТЗ_ЗП.НайтиСтроки(Новый Структура("ФизЛицо",ДанныеДляРасчетаЕСН.ФизЛицо)); 
					//+++ПСА 20.10.2021 СВФР-008215
					Если МассивСотрудник.Количество() > 0 Тогда
						ТекСтрока = МассивСотрудник[0];
						ЗапросПрием = Новый Запрос;
						ЗапросПрием.Текст = 
						"ВЫБРАТЬ
						|	РаботникиОрганизаций.Период
						|ИЗ
						|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
						|ГДЕ
						|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
						|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
						|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
						
						ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
						ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
						ЗапросПрием.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник);
						
						
						РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
						Период = ПериодРегистрации;
						Если РезультатЗапросаПрием.Количество()>0 Тогда 
							Период = РезультатЗапросаПрием[0].Период;
						КонецЕсли;
						
						СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",ТекСтрока.Сотрудник));
						НоваяСтрока.Должность = СведенияОРаботнике.Должность;
						НоваяСтрока.ТабельныйНомер = ТекСтрока.Сотрудник.Код; 
						//ПСА 04.10.2021 СВФР-008215 +++
						Если МассивСотрудник.Количество() > 1 Тогда
							ИтСуммаКРаспределению = ТекСтрока.Результат;
							Для Счетчик = 1 По МассивСотрудник.Количество()-1 Цикл
								СтрокаМассива = МассивСотрудник[Счетчик];
								ЗапросПрием = Новый Запрос;
								ЗапросПрием.Текст = 
								"ВЫБРАТЬ
								|	РаботникиОрганизаций.Период
								|ИЗ
								|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
								|ГДЕ
								|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
								|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
								|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
								
								ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
								ЗапросПрием.УстановитьПараметр("Сотрудник", СтрокаМассива.Сотрудник);
								
								
								РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
								Период = ПериодРегистрации;
								Если РезультатЗапросаПрием.Количество()>0 Тогда 
									Период = РезультатЗапросаПрием[0].Период;
								КонецЕсли;
								НС = Док.Удержания.Добавить();
								НС.ФизЛицо 						= ДанныеДляРасчетаЕСН.ФизЛицо; 
								
								СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СтрокаМассива.Сотрудник));
								НС.Должность = СведенияОРаботнике.Должность;
								НС.ТабельныйНомер = СтрокаМассива.Сотрудник.Код; 
								НС.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
								НС.ПериодУдержания = ДанныеДляРасчетаЕСН.Месяц;
								ИтСуммаКРаспределению = ИтСуммаКРаспределению + СтрокаМассива.Результат;
							КонецЦикла;	
						КонецЕсли;
						//+++ПСА 04.10.2021 СВФР-008215
					иначе
						СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ДанныеДляРасчетаЕСН.ФизЛицо.Наименование);
						ЗапросПрием = Новый Запрос;
						ЗапросПрием.Текст = 
						"ВЫБРАТЬ
						|	РаботникиОрганизаций.Период
						|ИЗ
						|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
						|ГДЕ
						|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
						|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
						|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
						
						ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
						ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
						ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
						
						
						РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
						Период = ПериодРегистрации;
						Если РезультатЗапросаПрием.Количество()>0 Тогда 
							Период = РезультатЗапросаПрием[0].Период;
						КонецЕсли;
						
						СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
						НоваяСтрока.Должность = СведенияОРаботнике.Должность;  
						НоваяСтрока.ТабельныйНомер = СотрудникПодбор.Код;
					КонецЕсли;
					НоваяСтрока.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд;
					НоваяСтрока.ПериодУдержания = ДанныеДляРасчетаЕСН.Месяц;
					
					если  НеПравоНаПенсию тогда
						НоваяСтрока.Результат = 0;
					иначе
						НоваяСтрока.Результат = ОбщегоНазначения.ОкруглитьПоВалюте(БазаДоходПенсионныйФонд * СтавкаПенсионныйФонд/100, Константы.ВалютаРегламентированногоУчета.Получить()) - данныеДляРасчетаЕСН.ПенсионныйФонд - СуммаУжеНачислПенс-УжеПрименилиПоВедРезультат;//О.Т. 10.10.2014 Добавлена СуммаУжеНачислПенс
					КонецЕсли;
					
					//ПСА 04.10.2021 СВФР-008215 +++
					Если МассивСотрудник.Количество() > 1 и НоваяСтрока.Результат <> 0  и ИтСуммаКРаспределению <> 0 Тогда
						СуммаДляРаспределения = НоваяСтрока.Результат;
						СуммаИсходная = СуммаДляРаспределения;						
						Для Каждого СтрокаМассива Из МассивСотрудник Цикл
							КоэффициентРаспределения = СтрокаМассива.Результат/ИтСуммаКРаспределению;
							СуммаРаспределения = СуммаИсходная*КоэффициентРаспределения;
							ОтборСтрок = Новый Структура();
							ОтборСтрок.Вставить("ФизЛицо",СтрокаМассива.ФизЛицо);
							ОтборСтрок.Вставить("ТабельныйНомер",СтрокаМассива.Сотрудник.Код);
							ОтборСтрок.Вставить("ВидРасчета",ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
							ОтборСтрок.Вставить("ПериодУдержания",ДанныеДляРасчетаЕСН.Месяц);							
							
							СтрокиОтбора = Док.Удержания.найтиСтроки(ОтборСтрок);
							Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
								СтрокаОтбора.Результат =  СуммаРаспределения;
								СуммаДляРаспределения = СуммаДляРаспределения - СтрокаОтбора.Результат;
							КонецЦикла;	
						КонецЦикла;	
						НоваяСтрока.Результат = НоваяСтрока.Результат - СуммаДляРаспределения;						
					КонецЕсли;	
					//+++ПСА 04.10.2021 СВФР-008215
				КонецЕсли;
			КонецЕсли;
			//Аверсон-софт, Островская Татьяна 13.06.2012 № 15494
		КонецЕсли;
	КонецЦикла;
	
	НаборЕСНСведенияОДоходах.Очистить();
	НаборЕСНСведенияОДоходах.Записать();
	
	//// заполним НДФЛ
	//Для Каждого Элемент Из РаботникиДляРасчетаНДФЛ Цикл
	//	НоваяСтрока = НДФЛ.Добавить();
	//	НоваяСтрока.ФизЛицо = Элемент.Ключ;
	//	НоваяСтрока.МесяцНалоговогоПериода = НачалоМесяца(ПериодРегистрации);
	//КонецЦикла;
	
	//П.С. 17.12.2015
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощью ИЛИ ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.МатпомощьИОтпускныеСМатпомощьюИЕдинВыплатой Тогда  //Аверсон 21.02.2020 КВВ СВФР-005569 (+Единовр)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧНачисления.ФизЛицо,
		|	ТЧНачисления.Результат,
		|	НАЧАЛОПЕРИОДА(ТЧНачисления.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления
		|ПОМЕСТИТЬ Вт_Начисления
		|ИЗ
		|	&ТЧНачисления КАК ТЧНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧУдержания.ФизЛицо,
		|	ТЧУдержания.Результат,
		|	НАЧАЛОПЕРИОДА(ТЧУдержания.ПериодУдержания, МЕСЯЦ) КАК ПериодУдержания
		|ПОМЕСТИТЬ Вт_Удержания
		|ИЗ
		|	&ТЧУдержания КАК ТЧУдержания
		|ГДЕ
		|	ТЧУдержания.ВидРасчета = &ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧУдержания.ФизЛицо,
		|	ТЧУдержания.Результат,
		|	НАЧАЛОПЕРИОДА(ТЧУдержания.ПериодУдержания, МЕСЯЦ) КАК ПериодУдержания
		|ПОМЕСТИТЬ Вт_УдержанияПенс
		|ИЗ
		|	&ТЧУдержания КАК ТЧУдержания
		|ГДЕ
		|	ТЧУдержания.ВидРасчета = &ВидРасчетаПенс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Начисления.ФизЛицо,
		|	Вт_Начисления.ПериодНачисления,
		|	СУММА(Вт_Начисления.Результат) КАК Результат
		|ПОМЕСТИТЬ Вт_ИтНачисления
		|ИЗ
		|	Вт_Начисления КАК Вт_Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Начисления.ФизЛицо,
		|	Вт_Начисления.ПериодНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Удержания.ФизЛицо,
		|	Вт_Удержания.ПериодУдержания,
		|	СУММА(Вт_Удержания.Результат) КАК Результат
		|ПОМЕСТИТЬ Вт_ИтУдержания
		|ИЗ
		|	Вт_Удержания КАК Вт_Удержания
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Удержания.ФизЛицо,
		|	Вт_Удержания.ПериодУдержания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Удержания.ФизЛицо,
		|	Вт_Удержания.ПериодУдержания,
		|	СУММА(Вт_Удержания.Результат) КАК Результат
		|ПОМЕСТИТЬ Вт_ИтУдержанияПенс
		|ИЗ
		|	Вт_УдержанияПенс КАК Вт_Удержания
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Удержания.ФизЛицо,
		|	Вт_Удержания.ПериодУдержания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ФизЛицо,
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ВидРасчета,
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Показатель1 КАК СтавкаПроценты,
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Регистратор.Предел КАК Предел,
		|	ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Регистратор
		|ПОМЕСТИТЬ Вт_ИсполнительныеЛисты
		|ИЗ
		|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
		|			&ДатаДок,
		|			Организация = &Организация
		|				И ФизЛицо В
		|					(ВЫБРАТЬ
		|						Вт_ИтНачисления.ФизЛицо
		|					ИЗ
		|						Вт_ИтНачисления КАК Вт_ИтНачисления)) КАК ПлановыеУдержанияРаботниковОрганизацийСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ДатаДок >= ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Период
		|			ИНАЧЕ &ДатаДок МЕЖДУ ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.Период И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ПериодЗавершения
		|		КОНЕЦ
		|	И ПлановыеУдержанияРаботниковОрганизацийСрезПоследних.ДокументОснование ССЫЛКА Документ.ИсполнительныйЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ИсполнительныеЛисты.ФизЛицо КАК ФизЛицо,
		|	Вт_ИсполнительныеЛисты.ВидРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета В (&СпособыРасчетаПНиПФ)
		|				ТОГДА ЕСТЬNULL((ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0)) * Вт_ИсполнительныеЛисты.СтавкаПроценты / 100, 0)
		|			КОГДА Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета В (&СпособыРасчетаПНиПФФиксСуммой)
		|				ТОГДА ВЫБОР
		|						КОГДА Вт_ИсполнительныеЛисты.Регистратор.Размер < ЕСТЬNULL(ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0), 0)
		|							ТОГДА Вт_ИсполнительныеЛисты.Регистратор.Размер
		|						ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0), 0)
		|					КОНЕЦ
		|			ИНАЧЕ ЕСТЬNULL((ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0)) * Вт_ИсполнительныеЛисты.СтавкаПроценты / 100, 0)
		|		КОНЕЦ) КАК Результат,
		|	&ДатаДок1 КАК ПериодУдержания,
		|	Вт_ИсполнительныеЛисты.Предел,
		|	Вт_ИсполнительныеЛисты.Регистратор КАК ДокументОснование
		|ПОМЕСТИТЬ Вт_ИтогБезПочтовогоСбора
		|ИЗ
		|	Вт_ИтНачисления КАК Вт_ИтНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИсполнительныеЛисты КАК Вт_ИсполнительныеЛисты
		|		ПО Вт_ИтНачисления.ФизЛицо = Вт_ИсполнительныеЛисты.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИтУдержания КАК Вт_ИтУдержания
		|		ПО Вт_ИтНачисления.ПериодНачисления = Вт_ИтУдержания.ПериодУдержания
		|			И Вт_ИтНачисления.ФизЛицо = Вт_ИтУдержания.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИтУдержанияПенс КАК Вт_ИтУдержанияПенс
		|		ПО Вт_ИтНачисления.ПериодНачисления = Вт_ИтУдержанияПенс.ПериодУдержания
		|			И Вт_ИтНачисления.ФизЛицо = Вт_ИтУдержанияПенс.ФизЛицо
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета В (&СпособыРасчетаПНиПФ)
		|				ТОГДА ЕСТЬNULL((ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0)) * Вт_ИсполнительныеЛисты.СтавкаПроценты / 100, 0)
		|			КОГДА Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета В (&СпособыРасчетаПНиПФФиксСуммой)
		|				ТОГДА ВЫБОР
		|						КОГДА Вт_ИсполнительныеЛисты.Регистратор.Размер < ЕСТЬNULL(ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0), 0)
		|							ТОГДА Вт_ИсполнительныеЛисты.Регистратор.Размер
		|						ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержанияПенс.Результат, 0), 0)
		|					КОНЕЦ
		|			ИНАЧЕ ЕСТЬNULL((ЕСТЬNULL(Вт_ИтНачисления.Результат, 0) - ЕСТЬNULL(Вт_ИтУдержания.Результат, 0)) * Вт_ИсполнительныеЛисты.СтавкаПроценты / 100, 0)
		|		КОНЕЦ <> 0
		|	И Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета <> &СпособРасчетаПочтовыйСбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ИсполнительныеЛисты.Регистратор,
		|	Вт_ИсполнительныеЛисты.ФизЛицо,
		|	Вт_ИсполнительныеЛисты.ВидРасчета,
		|	Вт_ИсполнительныеЛисты.Предел
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ИсполнительныеЛисты.ФизЛицо,
		|	Вт_ИсполнительныеЛисты.ВидРасчета,
		|	СУММА(ЕСТЬNULL(ЕСТЬNULL(Вт_ИтогБезПочтовогоСбора.Результат, 0)* Вт_ИсполнительныеЛисты.СтавкаПроценты / 100, 0)) КАК Результат,
		|	&ДатаДок1 КАК ПериодУдержания,
		|	Вт_ИсполнительныеЛисты.Предел,
		|	Вт_ИсполнительныеЛисты.Регистратор КАК ДокументОснование
		|ПОМЕСТИТЬ Вт_ИтогПочтовыйСбор
		|ИЗ
		|	Вт_ИсполнительныеЛисты КАК Вт_ИсполнительныеЛисты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ИтогБезПочтовогоСбора КАК Вт_ИтогБезПочтовогоСбора
		|		ПО Вт_ИсполнительныеЛисты.ФизЛицо = Вт_ИтогБезПочтовогоСбора.ФизЛицо
		|			И (Вт_ИтогБезПочтовогоСбора.ВидРасчета.СпособРасчета = &СпособРасчетаАлименты)
		|ГДЕ
		|	Вт_ИсполнительныеЛисты.ВидРасчета.СпособРасчета = &СпособРасчетаПочтовыйСбор
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_ИсполнительныеЛисты.Регистратор,
		|	Вт_ИсполнительныеЛисты.ФизЛицо,
		|	Вт_ИсполнительныеЛисты.ВидРасчета,
		|	Вт_ИсполнительныеЛисты.Предел
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_ИтогБезПочтовогоСбора.ФизЛицо,
		|	Вт_ИтогБезПочтовогоСбора.ВидРасчета,
		|	Вт_ИтогБезПочтовогоСбора.Результат,
		|	Вт_ИтогБезПочтовогоСбора.ПериодУдержания,
		|	Вт_ИтогБезПочтовогоСбора.Предел,
		|	Вт_ИтогБезПочтовогоСбора.ДокументОснование
		|ИЗ
		|	Вт_ИтогБезПочтовогоСбора КАК Вт_ИтогБезПочтовогоСбора
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Вт_ИтогПочтовыйСбор.ФизЛицо,
		|	Вт_ИтогПочтовыйСбор.ВидРасчета,
		|	Вт_ИтогПочтовыйСбор.Результат,
		|	Вт_ИтогПочтовыйСбор.ПериодУдержания,
		|	Вт_ИтогПочтовыйСбор.Предел,
		|	Вт_ИтогПочтовыйСбор.ДокументОснование
		|ИЗ
		|	Вт_ИтогПочтовыйСбор КАК Вт_ИтогПочтовыйСбор";
		
		Запрос.УстановитьПараметр("ДатаДок", Док.Дата);
		Запрос.УстановитьПараметр("ДатаДок1", ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", Док.Организация);
		Запрос.УстановитьПараметр("ТЧНачисления", Док.Начисления);
		Запрос.УстановитьПараметр("ТЧУдержания", Док.Удержания);
		Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию("Подоходный налог")); 
		//О.Т. Аверсон 02.06.2017 № 679
		СпособыРасчетаПНиПФ = Новый СписокЗначений;
		СпособыРасчетаПНиПФ.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);
		СпособыРасчетаПНиПФ.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела); 
		
		Запрос.УстановитьПараметр("СпособыРасчетаПНиПФ", СпособыРасчетаПНиПФ);
		СпособыРасчетаПНиПФФикс = Новый СписокЗначений;
		СпособыРасчетаПНиПФФикс.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФФиксСуммой);
		СпособыРасчетаПНиПФФикс.Добавить(Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПределаФиксСуммой); 
		
		Запрос.УстановитьПараметр("СпособыРасчетаПНиПФФиксСуммой", СпособыРасчетаПНиПФФикс);
		
		Запрос.УстановитьПараметр("ВидРасчетаПенс", ПланыВидовРасчета.УдержанияОрганизаций.ПенсионныйФонд);
		//О.Т. Аверсон 02.06.2017 № 679
		
		Запрос.УстановитьПараметр("СпособРасчетаПочтовыйСбор", Перечисления.СпособыРасчетаОплатыТруда.ПочтовыйСбор);
		Запрос.УстановитьПараметр("СпособРасчетаАлименты", Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Док.Удержания.Добавить();
			НоваяСтрока.ФизЛицо = Выборка.ФизЛицо; 
			МассивСотрудник = ТаблицаЗначенийЗП.НайтиСтроки(Новый Структура("ФизЛицо",Выборка.ФизЛицо)); 
			Если МассивСотрудник.Количество() > 0 Тогда
				ТекСтрока = МассивСотрудник[0];
				ЗапросПрием = Новый Запрос;
				ЗапросПрием.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
				|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
				|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
				
				ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
				ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
				ЗапросПрием.УстановитьПараметр("Сотрудник", ТекСтрока.Сотрудник);
				
				
				РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
				Период = ПериодРегистрации;
				Если РезультатЗапросаПрием.Количество()>0 Тогда 
					Период = РезультатЗапросаПрием[0].Период;
				КонецЕсли;
				
				СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",ТекСтрока.Сотрудник));
				НоваяСтрока.Должность = СведенияОРаботнике.Должность; 
				НоваяСтрока.ТабельныйНомер = ТекСтрока.Сотрудник.Код;
			иначе
				СотрудникПодбор = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(Выборка.ФизЛицо.Наименование);
				ЗапросПрием = Новый Запрос;
				ЗапросПрием.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1
				|	И РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
				|	И РаботникиОрганизаций.Сотрудник = &Сотрудник";
				
				ЗапросПрием.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
				ЗапросПрием.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
				ЗапросПрием.УстановитьПараметр("Сотрудник", СотрудникПодбор);
				
				
				РезультатЗапросаПрием = ЗапросПрием.Выполнить().Выгрузить();
				Период = ПериодРегистрации;
				Если РезультатЗапросаПрием.Количество()>0 Тогда 
					Период = РезультатЗапросаПрием[0].Период;
				КонецЕсли;
				
				СведенияОРаботнике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период, Новый Структура("Сотрудник",СотрудникПодбор));
				НоваяСтрока.Должность = СведенияОРаботнике.Должность;  
				НоваяСтрока.ТабельныйНомер = СотрудникПодбор.Код;
			КонецЕсли;
			НоваяСтрока.ВидРасчета = Выборка.ВидРасчета;
			
			НоваяСтрока.ПериодУдержания = Выборка.ПериодУдержания;
			Если Выборка.ВидРасчета.способРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПредела или
				Выборка.ВидРасчета.способРасчета = Перечисления.СпособыРасчетаОплатыТруда.УдержаниеПоИсполнительномуЛистуБезПНИПФДоПределаФиксСуммой Тогда 
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	СУММА(ВЫБОР
				|			КОГДА НакопленныеДанные.ПериодРегистрации <= Основной.ПериодРегистрации
				|					И Основной.БазовыйПериодНачало >= НакопленныеДанные.БазовыйПериодНачало
				|				ТОГДА НакопленныеДанные.Результат
				|			ИНАЧЕ 0
				|		КОНЕЦ) КАК УжеНачисленоЗаВсюИсторию,
				|	НакопленныеДанные.ФизЛицо КАК ФизЛицо,
				|	НакопленныеДанные.ВидРасчета КАК ВидРасчета,
				|	НакопленныеДанные.ДокументОснование КАК ДокументОснование
				|ИЗ
				|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК Основной
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.УдержанияРаботниковОрганизаций КАК НакопленныеДанные
				|		ПО Основной.ФизЛицо = НакопленныеДанные.ФизЛицо
				|			И Основной.ВидРасчета = НакопленныеДанные.ВидРасчета
				|			И Основной.ПериодРегистрации >= НакопленныеДанные.ПериодРегистрации
				|			И Основной.Организация = НакопленныеДанные.Организация
				|			И Основной.ДокументОснование = НакопленныеДанные.ДокументОснование
				|			И Основной.Регистратор <> НакопленныеДанные.Регистратор
				|			И Основной.Сторно = НакопленныеДанные.Сторно
				|ГДЕ
				|	Основной.Авторасчет
				|	И Основной.ВидРасчета = &ВидРасчета
				|	И Основной.ФизЛицо = &ФизЛицо
				|	И Основной.ПериодРегистрации = &ПериодРегистрации
				|	И Основной.ДокументОснование = &ДокументОснование
				|
				|СГРУППИРОВАТЬ ПО
				|	НакопленныеДанные.ФизЛицо,
				|	НакопленныеДанные.ВидРасчета,
				|	НакопленныеДанные.ДокументОснование";
				
				Запрос.УстановитьПараметр("ВидРасчета", Выборка.ВидРасчета);
				Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
				Запрос.УстановитьПараметр("ФизЛицо", Выборка.ФизЛицо);
				Запрос.УстановитьПараметр("ДокументОснование", Выборка.ДокументОснование);
				
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				УжеНачисленоЗаВсюИсторию=0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					УжеНачисленоЗаВсюИсторию = УжеНачисленоЗаВсюИсторию + ВыборкаДетальныеЗаписи.УжеНачисленоЗаВсюИсторию;
				КонецЦикла;
				ПределПоДокументуОснованию = Выборка.Предел;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				
				
				
				НоваяСтрока.Результат = ОбщегоНазначения.ОкруглитьПоВалюте(Мин(Выборка.Результат, ПределПоДокументуОснованию  - УжеНачисленоЗаВсюИсторию), Константы.ВалютаРегламентированногоУчета.Получить());
			иначе				
				НоваяСтрока.Результат = ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.Результат, Константы.ВалютаРегламентированногоУчета.Получить()); 
			КонецЕсли;
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьНаборЗаписейПоДаннымНДФЛ()

Функция ПолучитьДанныеРасчетаЕСН(ГоловнаяОрганизация, ФизЛицо = Неопределено)//О.Т. 04.02.2015 № 333
	
	//ЗапросДок = Новый Запрос;
	//ЗапросДок.Текст = 
	//"ВЫБРАТЬ
	//|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка,
	//|	МЕСЯЦ(НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации) КАК Месяц
	//|ИЗ
	//|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
	//|ГДЕ
	//|	НачислениеЗарплатыРаботникамОрганизаций.Проведен = ИСТИНА
	//|	И МЕСЯЦ(НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации) = &ПериодРегистрации
	//|	И ГОД(НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации) = &ПериодРегистрации2";
	//ЗапросДок.УстановитьПараметр("ПериодРегистрации", Месяц(Ссылка.Дата - 2851200));
	//ЗапросДок.УстановитьПараметр("ПериодРегистрации2", Год(Ссылка.Дата - 2851200));
	//РезДок = ЗапросДок.Выполнить().Выбрать();
	//пока РезДок.Следующий() цикл
	//	СсылкаПред = РезДок.Ссылка;
	//КонецЦикла;
	
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоМесяцаПериодаРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамПодлежитОбложению", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамВидСтавокЕСНиПФР", ГоловнаяОрганизация.ВидСтавокЕСНиПФР);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГруппа1", "I");
	Запрос.УстановитьПараметр("парамГруппа2", "II");
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("парамМуж", Перечисления.ПолФизическихЛиц.Мужской);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	
	
	
	
	ЛьготаИнвалидов = "100000";
	
	СписокВсехПодразделенийОрганизации = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокВсехПодразделенийОрганизации.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокВсехПодразделенийОрганизации", СписокВсехПодразделенийОрганизации);
	// ---------------------------------------------------------------------------
	// тексты запросов
	//
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцеы с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
		ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	
	// ФизлицаДляРасчета
	//
	//ФизлицаДляРасчетаТекст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо
	//|ИЗ
	//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
	//|ГДЕ
	//|	ЕСНСведенияОДоходах.Период = &парамПериодРегистрации
	//|	И ЕСНСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение";
	
	// Составим текст запроса для выбора списка физлиц, по которым надо считать НДФЛ
	Если НЕ (Физлицо = Неопределено) Тогда
		ФизлицаДляРасчетаТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &Регистратор и Работники.Физлицо = &парамФизлицо";
		
		ДополнительныеПараметрыЗапроса  = Новый Структура;
		ДополнительныеПараметрыЗапроса.Вставить("парамФизлицо", Физлицо);
	Иначе
		ФизлицаДляРасчетаТекст  = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &Регистратор";
		
		ДополнительныеПараметрыЗапроса  = Неопределено;
	КонецЕсли;
	
	// установим дополнительные параметры
	Если ДополнительныеПараметрыЗапроса <> Неопределено Тогда
		Для каждого Поле Из ДополнительныеПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
		КонецЦикла;
	КонецЕсли;
	
	// ДанныеОПравеНаПенсию
	// Таблица Таблица Данные о праве на пенсию: - таблица это список иностранцев и периодов
	// Поля:
	//		Физлицо, 
	//		Месяц - месяц налогового периода
	// 
	// Описание:
	//	Выбираем Из Списка периодов
	//	Внутреннее соединение с ГражданствоФизЛиц.СрезПоследних
	//  по равенству периодов
	//  условие: что физлицо - не имеет права на пенсию
	//
	ДанныеОПравеНаПенсиюТекст = "
	|ВЫБРАТЬ
	|	Месяц(Периоды.Период) КАК Месяц,
	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекст+") КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛиц.Период = Периоды.ПериодРегистра И ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо И ГражданствоФизЛиц.НеИмеетПравоНаПенсию
	|";
	
	
	
	
	// ДоходыПоФизлицамМесяцамКодамТекст
	// Таблица ЕСН-доходы по ФЛ и Периодам:
	// Поля:
	// Описание:
	// Выбираем из ЕСНОсновныеНачисления ,ЕСНДополнительныеНачисления и ЕСНСведенияОДоходах и суммируем результат
	// с начала года по текущий период
	ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
	если ПенсФондБудМес = 1 тогда
		ДоходыПоФизлицамМесяцамКодамТекст = 
		"ВЫБРАТЬ
		|	ЕСННачисления.ФизЛицо КАК ФизЛицо,
		|	ЕСННачисления.Месяц,
		|	ЕСННачисления.ДоходФСЗН,
		|	ЕСННачисления.ДоходСтрах,
		|	ЕСННачисления.ДоходЕдиныйПлатеж,
		|	ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		|		ЕСНСведенияОДоходах.ДоходФСЗН,
		|		ЕСНСведенияОДоходах.ДоходСтрах,
		|		ЕСНСведенияОДоходах.ДоходЕдиныйПлатеж,
		|		ЕСНСведенияОДоходах.Результат КАК ОблагаемыйДоход
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	
		|	ГДЕ
		|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации И
		|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации 
		//|		И ЕСНСведенияОДоходах.Регистратор = &Регистратор
		//|		И ЕСНСведенияОДоходах.Регистратор = &Регистратор2 
		|		И ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации)) КАК ЕСННачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСННачисления.ФизЛицо = Физлица.ФизЛицо";  
	иначе
		ДоходыПоФизлицамМесяцамКодамТекст = 
		"ВЫБРАТЬ
		|	ЕСННачисления.ФизЛицо КАК ФизЛицо,
		|	ЕСННачисления.Месяц,
		|	ЕСННачисления.ДоходФСЗН,
		|	ЕСННачисления.ДоходСтрах,
		|	ЕСННачисления.ДоходЕдиныйПлатеж,
		|	ЕСННачисления.ОблагаемыйДоход КАК ОблагаемыйДоход
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		|		ЕСНСведенияОДоходах.ДоходФСЗН,
		|		ЕСНСведенияОДоходах.ДоходСтрах,
		|		ЕСНСведенияОДоходах.ДоходЕдиныйПлатеж,	
		|		ЕСНСведенияОДоходах.Результат КАК ОблагаемыйДоход
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Период >= &парамНачалоМесяцаПериодаРегистрации И
		|		ЕСНСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации И
		|		ЕСНСведенияОДоходах.Регистратор = &Регистратор И
		|		ЕСНСведенияОДоходах.ОбособленноеПодразделение в (&СписокВсехПодразделенийОрганизации)) КАК ЕСННачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСННачисления.ФизЛицо = Физлица.ФизЛицо";
		
	КонецЕсли;
	
	
	Запрос.Текст = ДоходыПоФизлицамМесяцамКодамТекст;
	// ДанныеОбИнвалидности
	// Таблица Данных об Инвалидности: - таблица это список инвалидов и периодов инвалидности
	// поля:
	//		Физлицо, 
	//		Месяц - месяц налогового периода
	// Описание:	
	//	Выбираем Из Список периодов (таблица - список периодов с начала года по текущий период
	//	Внутреннее соединение с СведенияОбИнвалидностиФизлиц.СрезПоследних
	//	по равенству периодов
	//  условие: что физлицо - Инвалид
	// 
	ДанныеОбИнвалидностиТекст = "
	|ВЫБРАТЬ
	//	|	Месяц(Периоды.Период) КАК Месяц,
	|	ВЫБОР КОГДА (СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = &парамГруппа1 ИЛИ СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = &парамГруппа2) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ КАК Группа,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ИЗ
	|	(ВЫБРАТЬ
	//	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекст+") КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо) КАК Периоды//,
	//	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра И СведенияОбИнвалидностиФизлиц.Физлицо = Периоды.Физлицо И СведенияОбИнвалидностиФизлиц.Инвалидность
	|";
	Запрос.Текст = ДанныеОбИнвалидностиТекст;
	
	
	// ОблагаемаяБазаПоМесяцам
	// Таблица Баз для исчисления ЕСН по месяцам налогового периода:
	// Поля:
	//		ФизЛицо
	//		Месяц - месяц налогового периода
	//		БазаФедеральныйБюджет         - база для налогообложения ЕСН в части налога в федеральный бюджет
	//		ЛьготаИнвалидуФБ   			  - сумма льготы инвалиду по ЕСН в части налога в федеральный бюджет
	//		БазаФСС                       - база для налогообложения ЕСН в части налога в ФСС
	//		ЛьготаИнвалидуФСС  			  - сумма льготы инвалиду по ЕСН в части налога в ФСС
	//		БазаФОМС					  - база для налогообложения ЕСН в части налогов в ФОМС
	//		ЛьготаИнвалидуФОМС 			  - сумма льготы инвалиду по ЕСН в части налога в ФОМС
	//		БазаПФР			   			  - база для взносов в ПФР (включая доходы, облагаемые ЕНВД)
	//		БазаПФР_ЕНВД			   	  - сумма облагаемых ПФР доходов, подподающих под ЕНВД
	//
	// Описание:
	//	
	// 	1) выбираем из ДоходыПоФизлицамМесяцамКодамТекст
	// 		и суммируем ОблагаемыйДоход для всех составных частей ЕСН. При этом учитывается входимость в базу
	// 		по флажку в справочнике - это База.
	//		Доход, облагаемый ЕНВД, не включаем в базу ЕСН. 
	//		Доход иностранца не включаем в базу ПФР.
	//		Для инвалидов считается база отдельно, но из неё исключаем договора подряда.
	//  2) суммировать ОблагаемыйДоход для всех составных частей ЕСН при входимости в базу и признака инвалидности - это ЛьготаИнвалиду по всем частям ЕСН
	
	
	ОблагаемаяБазаПоМесяцам = "
	|ВЫБРАТЬ
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	ВЫБОР КОГДА НЕ((Инвалид.Физлицо) ЕСТЬ NULL ) ТОГДА Инвалид.Группа ИНАЧЕ 0 КОНЕЦ КАК Группа,
	|	ВЫБОР КОГДА Основная.ДоходФСЗН = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходФСЗН,
	|	ВЫБОР КОГДА Основная.ДоходСтрах = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходСтрах,
	|	ВЫБОР КОГДА Основная.ДоходЕдиныйПлатеж = &парамПодлежитОбложению ТОГДА Основная.ОблагаемыйДоход ИНАЧЕ 0 КОНЕЦ КАК БазаДоходЕдиныйПлатеж
	|ИЗ
	|	("+ДоходыПоФизлицамМесяцамКодамТекст+") КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК Инвалид
	|		ПО Инвалид.Физлицо = Основная.ФизЛицо //И Инвалид.Месяц = Основная.Месяц
	|";
	
	Запрос.Текст = ОблагаемаяБазаПоМесяцам;
	если ПенсФондБудМес = 1 тогда
		ИсчисленныйЕСНТекст = 
		"ВЫБРАТЬ
		|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL ТОГДА 35 ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН КОНЕЦ КАК ПроцентФСЗН,
		|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		|	ВЫБОР КОГДА НЕ((Инвалид.Физлицо) ЕСТЬ NULL ) ТОГДА Инвалид.Группа ИНАЧЕ 0 КОНЕЦ КАК Группа,
		|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
		|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		|ИЗ
		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСНИсчисленный.ФизЛицо = Физлица.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК Инвалид
		|		ПО Инвалид.Физлицо = ЕСНИсчисленный.ФизЛицо //И Инвалид.Месяц = ЕСНИсчисленный.ПериодВзаиморасчетов
		|
		|ГДЕ
		|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация И
		|	ЕСНИсчисленный.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации И
		|	ЕСНИсчисленный.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации";
	иначе
		ИсчисленныйЕСНТекст = 
		"ВЫБРАТЬ
		|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР КОГДА ЕСНИсчисленный.ПроцентФСЗН ЕСТЬ NULL ТОГДА 35 ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН КОНЕЦ КАК ПроцентФСЗН,
		|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК Месяц,
		|	ВЫБОР КОГДА НЕ((Инвалид.Физлицо) ЕСТЬ NULL ) ТОГДА Инвалид.Группа ИНАЧЕ 0 КОНЕЦ КАК Группа,
		|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		|	ЕСНИсчисленный.ЕдиныйПлатеж КАК ЕдиныйПлатеж,
		|	ЕСНИсчисленный.ОбязательноеСтрахование КАК ОбязательноеСтрахование
		|ИЗ
		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляРасчетаТекст + ") КАК Физлица
		|		ПО ЕСНИсчисленный.ФизЛицо = Физлица.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК Инвалид
		|		ПО Инвалид.Физлицо = ЕСНИсчисленный.ФизЛицо //И Инвалид.Месяц = ЕСНИсчисленный.ПериодВзаиморасчетов
		|
		|ГДЕ
		|	ЕСНИсчисленный.Организация = &парамГоловнаяОрганизация И
		|	ЕСНИсчисленный.ПериодВзаиморасчетов >= &парамНачалоМесяцаПериодаРегистрации И //Островская Татьяна 28.04.2014 № 17321
		|	ЕСНИсчисленный.ПериодВзаиморасчетов <= &парамКонецМесяцаПериодаРегистрации";
		
	КонецЕсли;
	
	
	
	ДляИсчисленияЕСНТекст = "
	|ВЫБРАТЬ
	|	НачисленияПФ.ФизЛицо,
	|	НачисленияПФ.Месяц,
	|	НачисленияПФ.Группа,
	|	СУММА(НачисленияПФ.БазаДоходФСЗН) КАК БазаДоходФСЗН,
	|	СУММА(НачисленияПФ.БазаДоходСтрах) КАК БазаДоходСтрах,
	|	СУММА(НачисленияПФ.БазаДоходЕдиныйПлатеж) КАК БазаДоходЕдиныйПлатеж,
	|	СУММА(НачисленияПФ.ПенсионныйФонд) КАК ПенсионныйФонд,
	|	СУММА(НачисленияПФ.НачисленныйФСЗН) КАК НачисленныйФСЗН,
	|	СУММА(НачисленияПФ.НачисленныйСтрах) КАК НачисленныйСтрах,
	|	СУММА(НачисленияПФ.НачисленныйЕдиныйПлатеж) КАК НачисленныйЕдиныйПлатеж
	|	ИЗ
	|		(ВЫБРАТЬ
	|			БазаДляНачислений.ФизЛицо,
	|			БазаДляНачислений.Месяц,
	|			БазаДляНачислений.Группа,
	|			СУММА(БазаДляНачислений.БазаДоходФСЗН) КАК БазаДоходФСЗН,
	|			СУММА(БазаДляНачислений.БазаДоходСтрах) КАК БазаДоходСтрах,
	|			СУММА(БазаДляНачислений.БазаДоходЕдиныйПлатеж) КАК БазаДоходЕдиныйПлатеж,
	|  			0 КАК ПенсионныйФонд,
	|  			0 КАК НачисленныйФСЗН,
	|   		0 КАК НачисленныйСтрах,
	|   		0 КАК НачисленныйЕдиныйПлатеж
	|		ИЗ
	|			("+ОблагаемаяБазаПоМесяцам+") КАК БазаДляНачислений
	|		СГРУППИРОВАТЬ ПО
	|			БазаДляНачислений.ФизЛицо,
	|			БазаДляНачислений.Месяц,
	|           БазаДляНачислений.Группа
	|
	|  		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			Отчсиления.ФизЛицо,
	|			Отчсиления.Месяц,
	|           Отчсиления.Группа,
	|   		0 КАК БазаДоходФСЗН,
	|  			0 КАК БазаДоходСтрах,
	|  			0 КАК БазаДоходЕдиныйПлатеж,
	|			СУММА(Отчсиления.ПенсионныйФонд) КАК ПенсионныйФонд,
	|			СУММА(Отчсиления.ФСЗН) КАК НачисленныйФСЗН,
	|			СУММА(Отчсиления.ОбязательноеСтрахование) КАК НачисленныйСтрах,
	|			СУММА(Отчсиления.ЕдиныйПлатеж) КАК НачисленныйЕдиныйПлатеж
	|		ИЗ
	|			("+ИсчисленныйЕСНТекст+") КАК Отчсиления
	|	
	|		СГРУППИРОВАТЬ ПО
	|			Отчсиления.ФизЛицо,
	|			Отчсиления.Месяц,
	|			Отчсиления.Группа) НачисленияПФ
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПФ.ФизЛицо,
	|	НачисленияПФ.Месяц,
	|	НачисленияПФ.Группа
	|";
	
	
	Запрос.Текст = ДляИсчисленияЕСНТекст;
	
	Возврат Запрос.Выполнить().Выбрать();
	
	
	
КонецФункции  // ПолучитьДанныеРасчетаЕСН

// получает доходы ПенсонногоФонда по табличным частям с доходами
// Параметры:
//		ВыборкаПоШапкеДокумента - спозиционированная выборка по шапке документа
//		НаборЗаписей - таблица значений или набор записей рег-ра - "приемник" сведений о доходах
//		
Процедура СформироватьДоходыПоПенсионномуФонду(ВыборкаПоШапкеДокумента, НаборЗаписей, ФизЛицо = Неопределено,ХарактерВыплаты = Неопределено)
	
	
	// Составим текст запроса для выбора списка физлиц, по которым надо считать песионный фонд
	Если НЕ (Физлицо = Неопределено) Тогда
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор и Работники.Физлицо = &парамФизлицо";
		
		ДополнительныеПараметрыЗапроса  = Новый Структура;
		ДополнительныеПараметрыЗапроса.Вставить("парамФизлицо", Физлицо);
	Иначе
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор";
		
		ДополнительныеПараметрыЗапроса  = Неопределено;
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка" , Ссылка);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамСпособНеОблагаетсяКодДоходаЕСН", Перечисления.ДоходыФСС_НС.НеОблагается);
	Запрос.УстановитьПараметр("парамПустойКодЕСНУ", Справочники.ДоходыЕСН.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодЕСН", Справочники.ДоходыЕСН.ОблагаетсяПолностью);
	Запрос.УстановитьПараметр("парамПериодРегистрации",			ПериодРегистрации);
	Запрос.УстановитьПараметр("парамОрганизация",				Организация);
	Запрос.УстановитьПараметр("парамРегистратор",				Ссылка);
	
	
	// установим дополнительные параметры
	Если ДополнительныеПараметрыЗапроса <> Неопределено Тогда
		Для каждого Поле Из ДополнительныеПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(Поле.Ключ, Поле.Значение);
		КонецЦикла;
	КонецЕсли;
	
	//О.Т. 24.06.2014 № 71
	ДополнительноеУсловие = "";
	ДополнительноеУсловиеВнешнееОсновное = "";
	ДополнительноеУсловиеВнешнееДополнительное = "";
	//Если ПодразделениеОрганизации.Пустая() И Ответственный.Пустая() Тогда
	//	ДополнительноеУсловие = "";
	//	ДополнительноеУсловиеВнешнее = "";
	//ИначеЕсли ПодразделениеОрганизации.Пустая() Тогда
	//	Если глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].РасчетЗарплатыОрганизацииПоОтветственным Тогда
	//		ДополнительноеУсловие = " И ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
	//		ДополнительноеУсловиеВнешнееОсновное = " И ОсновныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
	//		ДополнительноеУсловиеВнешнееДополнительное = " И ДополнительныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамПериодРегистрации) Расчетчики ГДЕ Расчетчики.Пользователь = &парамОтветственный)";
	//		
	//	КонецЕсли;
	//Иначе
	//	Запрос.УстановитьПараметр("парамПодразделениеОрганизации",	ПодразделениеОрганизации);
	//	ДополнительноеУсловие = " И ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
	//	ДополнительноеУсловиеВнешнееОсновное = " И ОсновныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
	//	ДополнительноеУсловиеВнешнееДополнительное = " И ДополнительныеНачисления.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделениеОрганизации)";
	//КонецЕсли;
	//О.Т. 24.06.2014 № 71 Убрано условие на подразделение организации,т.к. у физлица могут быть перемещения по подразделению в середине месяца
	//Островская Татьяна 10.12.2012 № 15
	//Аверсон-софт, Островская Татьяна 14.08.2012 № 15681
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеУчета.ФизЛицо,
	|	ДанныеУчета.КодДоходаЕСН,
	|	ВЫБОР КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН КОНЕЦ КАК ДоходФСЗН, //ДанныеУчета.ДоходФСЗН,
	|	ВЫБОР КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН КОНЕЦ КАК ДоходСтрах, //ДанныеУчета.ДоходСтрах,
	|	ВЫБОР КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН КОНЕЦ КАК ДоходЕдиныйПлатеж, //ДанныеУчета.ДоходЕдиныйПлатеж,
	|	ДанныеУчета.Результат,
	|	ДанныеУчета.ВидРасчета,
	|	ДанныеУчета.ПериодДействия,
	|	ДанныеУчета.ПериодВзаимоРасчетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
	|		ВЫБОР
	|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
	|				ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
	|			КОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
	|				ТОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН
	|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
	|		КОНЕЦ КАК КодДоходаЕСН,
	|		ОсновныеНачисления.Организация КАК Организация,
	|		ОсновныеНачисления.Результат КАК Результат,
	|		ОсновныеНачисления.ВидРасчета,
	|		ОсновныеНачисления.ПериодРегистрации КАК ПериодВзаимоРасчетов, //О.Т.(К) 25.01.2017 № периодРегистрации
	|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействия,
	|		ОсновныеНачисления.Регистратор
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|					ОсновныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					ОсновныеНачисления.Организация КАК Организация,
	|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
	|				ИЗ
	|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
	|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета И РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало
	|				
	|				ГДЕ
	|					ВЫБОР КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL ТОГДА ОсновныеНачисления.Организация ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец КОНЕЦ = &парамОрганизация И
	|					ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации И ОсновныеНачисления.Сотрудник.Физлицо В (" + СписокФизЛицТекст + ")" +ДополнительноеУсловиеВнешнееОсновное+"
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ОсновныеНачисления.Сотрудник,
	|					ОсновныеНачисления.Сотрудник.ФизЛицо,
	|					ОсновныеНачисления.Организация,
	|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
	|				ПО СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник И СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация И СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета И СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период
	|			ПО РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник И РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация И РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета
	|	
	|	ГДЕ
	|		ВЫБОР КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL ТОГДА ОсновныеНачисления.Организация ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец КОНЕЦ = &парамОрганизация И
	|		ОсновныеНачисления.ПериодРегистрации = &парамПериодРегистрации И ОсновныеНачисления.Сотрудник.Физлицо В (" + СписокФизЛицТекст + ")" +ДополнительноеУсловиеВнешнееОсновное+"
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|    ВЫБРАТЬ
	|		ДополнительныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|		ВЫБОР КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ ТОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ ТОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН КОНЕЦ КАК КодДоходаЕСН,
	|		ДополнительныеНачисления.Организация КАК Организация,
	|		ДополнительныеНачисления.Результат КАК Результат,
	|		ДополнительныеНачисления.ВидРасчета,
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) КАК ПериодВзаимоРасчетов, // О.Т. 06.11.2014 //О.Т.(К) 25.01.2017 № Перодрегистрации
	|		ДополнительныеНачисления.БазовыйПериодНачало,
	|		ДополнительныеНачисления.Регистратор
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|					ДополнительныеНачисления.Сотрудник.ФизЛицо КАК ФизЛицо,
	|					ДополнительныеНачисления.Организация КАК Организация,
	|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
	|				ИЗ
	|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
	|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
	|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета И РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации
	|				
	|				ГДЕ
	|					ВЫБОР КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL ТОГДА ДополнительныеНачисления.Организация ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец КОНЕЦ = &парамОрганизация И
	|					НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации И ДополнительныеНачисления.Сотрудник.Физлицо В (" + СписокФизЛицТекст + ")" +ДополнительноеУсловиеВнешнееДополнительное+"
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ДополнительныеНачисления.Сотрудник,
	|					ДополнительныеНачисления.Сотрудник.ФизЛицо,
	|					ДополнительныеНачисления.Организация,
	|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
	|				ПО СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник И СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация И СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета И СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период
	|			ПО РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник И РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация И РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета
	|				
	|	ГДЕ
	|		ВЫБОР КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL ТОГДА ДополнительныеНачисления.Организация ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец КОНЕЦ = &парамОрганизация И
	|		НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации И ДополнительныеНачисления.Сотрудник.Физлицо В (" + СписокФизЛицТекст + ")" +ДополнительноеУсловиеВнешнееДополнительное+"
	|   ) КАК ДанныеУчета";
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|		ГДЕ
		|	(ДанныеУчета.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)";
	иначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.ПрочиеРазовыеНачисления Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|		ГДЕ
		|	(ДанныеУчета.Регистратор ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций)";
	иначе
		
		ТекстЗапроса = ТекстЗапроса + "
		|		ГДЕ
		|	(ДанныеУчета.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
		|			ИЛИ ДанныеУчета.Регистратор ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций
		|				И ДанныеУчета.ВидРасчета в (&ВидРасчета))";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|СГРУППИРОВАТЬ ПО
	|ДанныеУчета.ФизЛицо,
	|ДанныеУчета.КодДоходаЕСН,
	|ДанныеУчета.ВидРасчета,
	|ДанныеУчета.ПериодДействия,
	|ДанныеУчета.ПериодВзаимоРасчетов,
	|ВЫБОР
	|	КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
	|		ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
	|	ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
	|КОНЕЦ,
	|ВЫБОР
	|	КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
	|		ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
	|	ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
	|КОНЕЦ,
	|ВЫБОР
	|	КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
	|		ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
	|	ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
	|КОНЕЦ,
	|ДанныеУчета.Результат";
	//Аверсон-софт, Островская Татьяна 14.08.2012 № 15681
	//Островская Татьяна 10.12.2012 № 15
	СписокВидовРасчета = Новый СписокЗначений;
	СписокВидовРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Материальная помощь"));
	СписокВидовРасчета.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.НайтиПоНаименованию("Единовременная выплата на оздоровление")); //Аверсон 21.02.2020 КВВ СВФР-005569
	Запрос.УстановитьПараметр("ВидРасчета",СписокВидовРасчета);
	Запрос.Текст = ТекстЗапроса;	
	Доходы = Запрос.Выполнить().Выбрать();
	//сформируем движения ЕСНСведенияОДоходах
	Пока Доходы.Следующий() Цикл
		
		Движение = НаборЗаписей.Добавить();
		// измерения
		Движение.Период						= ПериодРегистрации;
		Движение.ПериодВзаимоРасчетов       = Доходы.ПериодВзаимоРасчетов;
		Движение.Физлицо					= Доходы.Физлицо;
		Движение.Организация				= Организация;
		
		//ресурсы
		Движение.Результат					= Доходы.Результат;
		
		//реквизиты
		Движение.КодДоходаЕСН				= Доходы.КодДоходаЕСН;
		Движение.ДоходФСЗН 					= Доходы.ДоходФСЗН;
		Движение.ДоходСтрах 				= Доходы.ДоходСтрах;
		Движение.ДоходЕдиныйПлатеж 			= Доходы.ДоходЕдиныйПлатеж;
		Движение.ОбособленноеПодразделение	= Организация;
		
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьДоходыПоКодамНДФЛ()



//толик
#Если Клиент Тогда
	
	Функция ПечатьТ53Подр1(ВыборкаДляШапки, ВыборкаРаботники1, ТабДокумент, Макет, мПодр)
		
		мСумма = 0;
		
		// подсчитываем количество страниц документа - для корректного разбиения на страницы
		ВсегоСтрокДокумента = ВыборкаРаботники1.Количество();
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		ОбластьМакетаПодвал.Параметры.РКО = "Расходный кассовый ордер № _______ от  ""___"" ___________ 20 ___ г.";
		
		// массив с двумя строками - для разбиения на страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		ВывестиДанныеРКО = Ложь;
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
		//О.Т. Аверсон 08.07.2016 № 949
		Если ПериодРегистрации >= Дата(2016,07,1) Тогда 
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,
			Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер;
			
			ОбластьМакетаСтрока.Область("R1C7").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаСтрока.Область("R1C8").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаИтогПоСтранице.Область("R1C7").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаИтогПоСтранице.Область("R1C8").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C7").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R1C8").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
			ОбластьМакетаПодвал.Область("R5C9").Формат =  "ЧДЦ="+Строка(ЗначениеОкругления);
		КонецЕсли;
		//О.Т. Аверсон 08.07.2016 № 949
		
		
		// выводим данные о руководителях организации
		Пока ВыборкаДляШапки.Следующий() Цикл
			
			ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ВыборкаДляШапки); // Шапка документа.
			ОбластьМакетаШапкаДокумента.Параметры.ПодразделениеОрганизации		= мПодр;
			//ОбластьМакетаШапкаДокумента.Параметры.ОтчетныйПериодПо		= ?(НЕ ЗначениеЗаполнено(ПериодРегистрации),ПериодРегистрации,КонецМесяца(ПериодРегистрации));
			ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации	= СокрЛП(ОбластьМакетаШапкаДокумента.Параметры.НазваниеОрганизации);
			
			//Если ВыборкаДляШапки.Сумма <> 0 Тогда
			//	ОбластьМакетаШапкаДокумента.Параметры.СуммаДок = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.Сумма, Валюта);
			//	ОбластьМакетаШапкаДокумента.Параметры.СуммаДокРублей = Цел(ВыборкаДляШапки.Сумма);
			//	//ОбластьМакетаШапкаДокумента.Параметры.СуммаДокКопеек = (ВыборкаДляШапки.Сумма - Цел(ВыборкаДляШапки.Сумма)) * 100
			//КонецЕсли;
			Если ВыборкаДляШапки.ОплаченоПолностью Тогда
				Если ВыборкаДляШапки.ВсегоДепонировано > 0 Тогда
					ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоДепонировано, Валюта);
				Иначе 
					ОбластьМакетаПодвал.Параметры.ВсегоДепонировано = "---";
				КонецЕсли;
				Если ВыборкаДляШапки.ВсегоВыплачено > 0 Тогда
					ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДляШапки.ВсегоВыплачено, Валюта);
				Иначе 
					ОбластьМакетаПодвал.Параметры.ВсегоВыплачено = "---";
				КонецЕсли;
				ВывестиДанныеРКО = ВыборкаДляШапки.КоличествоРКО = 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		//толик	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0;
		// выводим данные по строкам документа.
		Для Каждого ВыборкаРаботники Из ВыборкаРаботники1 Цикл
			//	Пока ВыборкаРаботники.Следующий() Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаРаботники);
			Если ВывестиДанныеРКО И Не ПустаяСтрока(ВыборкаРаботники.ПредставлениеДокумента) Тогда
				ОбластьМакетаПодвал.Параметры.РКО = ВыборкаРаботники.ПредставлениеДокумента;
				ВывестиДанныеРКО = Ложь;
			КонецЕсли;
			//		ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании = ОбластьМакетаСтрока.Параметры.ЗаписьОДепонировании + " " + Символы.ПС + " ";
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			мСумма = мСумма + ВыборкаРаботники.Сумма;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				
				ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
				ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаШапка);
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.НомерСтроки = ВыведеноСтрок;
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ВыборкаРаботники.Сумма;
			
		КонецЦикла;
		
		ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		ОбластьМакетаПодвал.Параметры.КоличествоЛистов = ?(ВыведеноСтрок = 0,"",ВыведеноСтраниц);
		Если мСумма <> 0 Тогда
			ОбластьМакетаПодвал.Параметры.СуммаДок = РаботаСДиалогами.СформироватьСуммуПрописью(мСумма, Валюта);
			ОбластьМакетаПодвал.Параметры.СуммаДокРублей = ОбщегоНазначения.ОкруглитьЗначение2016(мСумма,Дата);//О.Т. Аверсон 08.07.2016 № 949
			ОбластьМакетаПодвал.Параметры.ИтогоПоВедомости = ОбщегоНазначения.ОкруглитьЗначение2016(мСумма,Дата);//О.Т. Аверсон 08.07.2016 № 949
		КонецЕсли;
		
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Физлицо = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
		ТабДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		//толик	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЦикла;	
		
		
		//	Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ53подр()
	
#КонецЕсли

//П.С. 17.12.2015
Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(ДокументВедомость) Тогда
		ДокументВедомостьОбъект = ДокументВедомость.ПолучитьОбъект();
		Если ПометкаУдаления Тогда
			ДокументВедомостьОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе	
			Попытка	
				ДокументВедомостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокументВедомостьОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

Функция  ПечатьРублиЧ() Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ(пееееч)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ЗарплатаКВыплатеОрганизаций.ПолучитьМакет("МакетРублиЧ");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	// Зарплата
	Область = Макет.ПолучитьОбласть("ЗарплатаШапка");
	ТабДок.Вывести(Область);
	ОбластьЗарплата = Макет.ПолучитьОбласть("Зарплата");
	Для Каждого ТекСтрокаЗарплата Из Зарплата Цикл
		ОбластьЗарплата.Параметры.Заполнить(ТекСтрокаЗарплата);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммыПоСотрудникам.РублиЧ
		|ИЗ
		|	РегистрСведений.СуммыПоСотрудникам КАК СуммыПоСотрудникам
		|ГДЕ
		|	СуммыПоСотрудникам.Период МЕЖДУ &Период И &Период1
		|	И СуммыПоСотрудникам.ФизЛицо = &ФизЛицо";
		
		Запрос.УстановитьПараметр("Период", ПериодРегистрации);
		Запрос.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("ФизЛицо", ТекСтрокаЗарплата.ФизЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		РублиЧ = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			РублиЧ = РублиЧ + ВыборкаДетальныеЗаписи.РублиЧ;
		КонецЦикла;
		ОбластьЗарплата.Параметры.РублиЧ = РублиЧ;
		
		//О.Т. Аверсон 23.07.2018 № 2231
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
		|ГДЕ
		|	ВзаиморасчетыСРаботникамиОрганизаций.Физлицо = &Физлицо
		|	И ВзаиморасчетыСРаботникамиОрганизаций.Организация = &Организация
		|	И ВзаиморасчетыСРаботникамиОрганизаций.ХарактерВыплаты = &ХарактерВыплаты
		|	И ВзаиморасчетыСРаботникамиОрганизаций.Период МЕЖДУ &Период И &Период1";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", ПериодРегистрации);
		Запрос.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("ФизЛицо", ТекСтрокаЗарплата.ФизЛицо);
		Запрос.УстановитьПараметр("ХарактерВыплаты", Перечисления.ХарактерВыплатыЗарплаты.ПлановыйАванс);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Аванс = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Аванс = Аванс + ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СуммаВзаиморасчетов),ВыборкаДетальныеЗаписи.СуммаВзаиморасчетов,0);
		КонецЦикла;
		
		ОбластьЗарплата.Параметры.Аванс = Аванс;
		
		
		//(начало) добавлено Кухарчуком Д.Я. 21.12.18, Задача № СВФР-002976, Аверсон-Софт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ISNULL( СУММА( УдержанияРаботниковОрганизаций.Результат ) , 0 ) КАК УдержанияЗаТелефон
		|ИЗ
		|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
		|ГДЕ
		|	УдержанияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И УдержанияРаботниковОрганизаций.ВидРасчета = &ВидРасчетаУдержанияЗаТелефон
		|	И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоПериодаРегистрации И &КонецПериодаРегистрации
		|	И УдержанияРаботниковОрганизаций.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("НачалоПериодаРегистрации", ПериодРегистрации);
		Запрос.УстановитьПараметр("КонецПериодаРегистрации", КонецМесяца(ПериодРегистрации));
		Запрос.УстановитьПараметр("ВидРасчетаУдержанияЗаТелефон", ПланыВидовРасчета.УдержанияОрганизаций.НайтиПоНаименованию( "Удержания за телефон", Истина) );
		Запрос.УстановитьПараметр("ФизЛицо", ТекСтрокаЗарплата.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		УдержанияЗаТелефон = ?( Выборка.Следующий(), Выборка.УдержанияЗаТелефон, 0 );
		
		ОбластьЗарплата.Параметры.УдержанияЗаТелефон = УдержанияЗаТелефон;
		//(конец) добавлено Кухарчуком Д.Я. 21.12.18, Задача № СВФР-002976, Аверсон-Софт
		
		
		//О.Т. Аверсон 23.07.2018 № 2231
		ОбластьЗарплата.Параметры.Отклонение = РублиЧ - ТекСтрокаЗарплата.Сумма - Аванс 
		- УдержанияЗаТелефон; //добавлено Кухарчуком Д.Я. 21.12.18, Задача № СВФР-002976, Аверсон-Софт
		ТабДок.Вывести(ОбластьЗарплата);
	КонецЦикла;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецФункции

//Аверсон ЕАЕ 27.03.2025 СВФР-015244
//Несвиж
Функция ПолучитьУволенных()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Сотрудник.Код КАК ТабНомер,
		|	РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|   И РаботникиОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаКон", Дата);
	Запрос.УстановитьПараметр("ДатаНач", КонецМесяца(ПериодРегистрации) + 1);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьОстаткиВзаиморасчетов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.Сотрудник.Код КАК ТабНомер,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТУволенные
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|   И РаботникиОрганизаций.Организация = &Организация
	|;
	|////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.ТабНомер,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки,
	|   ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаВзаиморасчетовОстаток,0) КАК Остаток
	|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&ДатаКон, ФизЛицо В (ВЫБРАТЬ ВТУволенные.ФизЛицо ИЗ ВТУволенные) И Организация = &Организация) КАК ОстаткиВзаиморасчетов
	|ПО ЗарплатаКВыплатеОрганизацийЗарплата.ФизЛицо = ОстаткиВзаиморасчетов.ФизЛицо
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТУволенные
	|ПО ЗарплатаКВыплатеОрганизацийЗарплата.ФизЛицо = ВТУволенные.ФизЛицо
	//|	И ЗарплатаКВыплатеОрганизацийЗарплата.ТабНомер = ВТУволенные.ТабНомер
	|ГДЕ НЕ ВТУволенные.Сотрудник ЕСТЬ NULL
	|	И ЕСТЬNULL(ОстаткиВзаиморасчетов.СуммаВзаиморасчетовОстаток,0) < ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
	|	И ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Дата)+1);
	Запрос.УстановитьПараметр("ДатаНач", КонецМесяца(ПериодРегистрации) + 1);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Функция ПолучитьСотрудниковБезДоговоров()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.ФизЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.НомерСтроки
	|ИЗ Документ.ЗарплатаКВыплатеОрганизаций.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|ПО ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|	И ЗарплатаКВыплатеОрганизацийЗарплата.ФизЛицо = ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо
	//|	И ЗарплатаКВыплатеОрганизацийЗарплата.ТабНомер = ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код
	|	И НЕ (ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала > &ДатаКон ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания < &ДатаНач)
	
	|ГДЕ ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &Ссылка
	|	И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо ЕСТЬ NULL
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ПериодРегистрации));
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции
//Аверсон СВФР-015244
