//толик
Процедура ПередЗаписью(Отказ, Замещение, ТолькоЗапись)
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		мРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(СтрокаНабора.ПериодДействияНачало),СтрокаНабора.ПериодДействияНачало,СтрокаНабора.БазовыйПериодНачало),//СтрокаНабора.ПериодДействияНачало,
			Новый Структура("Организация, Сотрудник", СтрокаНабора.Организация, СтрокаНабора.Сотрудник));
			
		мРаботникиОрганизацийОкончание = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(СтрокаНабора.ПериодДействияКонец),СтрокаНабора.ПериодДействияКонец,СтрокаНабора.БазовыйПериодКонец),//СтрокаНабора.ПериодДействияКонец,
			Новый Структура("Организация, Сотрудник", СтрокаНабора.Организация, СтрокаНабора.Сотрудник)); //Аверсон 27.04.2022 КВВ СВФР-008970	
			
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		//СтрокаНабора.Категория = мРаботникиОрганизаций.Категория;
		//Аверсон СВФР-008461
		
		СтрокаНабора.Должность = мРаботникиОрганизаций.Должность;
		
		//Аверсон 27.04.2022 КВВ СВФР-008970 (
		ПроверкаНаОкончание = Ложь;
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Должность) Тогда
			СтрокаНабора.Должность = мРаботникиОрганизацийОкончание.Должность;
			ПроверкаНаОкончание = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ПодразделениеОрганизации) И ПроверкаНаОкончание Тогда
			СтрокаНабора.ПодразделениеОрганизации = мРаботникиОрганизацийОкончание.ПодразделениеОрганизации;
		КонецЕсли;
		//Аверсон 27.04.2022 КВВ СВФР-008970 )
		
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		//Если не ЗначениеЗаполнено(мРаботникиОрганизаций.Категория)  ТОгда
		//	СтрокаНабора.Категория = мРаботникиОрганизаций.Должность.Категория;
		//КонецЕсли;
		//Аверсон СВФР-008461
		
		//Аверсон ЕАЕ 07.12.2021 СВФР-008461
		Если СтрокаНабора.Организация.ПрочаяКатегорияДляНачисленияУволенным Тогда
			Уволен = СотрудникУволен(СтрокаНабора.Сотрудник, СтрокаНабора.ПериодРегистрации);
			КатегорияПрочее = Справочники.КатегорииРаботников.НайтиПоНаименованию("Прочее", Истина);
		Иначе
			Уволен = Ложь;
			КатегорияПрочее = Справочники.КатегорииРаботников.НайтиПоНаименованию("Прочее", Истина);
		КонецЕсли;
		Если Уволен И СтрокаНабора.Организация.ПрочаяКатегорияДляНачисленияУволенным И Не КатегорияПрочее.Пустая() Тогда
			СтрокаНабора.Категория = КатегорияПрочее;
		Иначе
			СтрокаНабора.Категория = мРаботникиОрганизаций.Категория;
			
			//Аверсон 27.04.2022 КВВ СВФР-008970 (
			//Если не ЗначениеЗаполнено(мРаботникиОрганизаций.Категория)  ТОгда
			//	СтрокаНабора.Категория = мРаботникиОрганизаций.Должность.Категория;
			//КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаНабора.Категория) И ПроверкаНаОкончание Тогда
				СтрокаНабора.Категория = мРаботникиОрганизацийОкончание.Категория;  
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаНабора.Категория) Тогда
				СтрокаНабора.Категория = СтрокаНабора.Должность.Категория;
			КонецЕсли;
			//Аверсон 27.04.2022 КВВ СВФР-008970 )
		КонецЕсли;
		//Аверсон СВФР-008461
		
		//Аверсон 23.05.2022 КВВ СВФР-009094 (
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.ауМестоРаботы) 
			И (ЗначениеЗаполнено(мРаботникиОрганизаций.ауМестоРаботы) ИЛИ ЗначениеЗаполнено(мРаботникиОрганизацийОкончание.ауМестоРаботы)) Тогда
			СтрокаНабора.ауМестоРаботы = ?(ЗначениеЗаполнено(мРаботникиОрганизаций.ауМестоРаботы),мРаботникиОрганизаций.ауМестоРаботы, мРаботникиОрганизацийОкончание.ауМестоРаботы);
		КонецЕсли;
		//Аверсон 23.05.2022 КВВ СВФР-009094 )
		//СВФР-017061 16.10.2025
		Если не ЗначениеЗаполнено(СтрокаНабора.ПодразделениеОрганизации) тогда
			СтрокаНабора.ПодразделениеОрганизации = мРаботникиОрганизацийОкончание.ПодразделениеОрганизации;
		КонецЕсли;
		//СВФР-017061 16.10.2025
	КонецЦикла;
КонецПроцедуры

//Аверсон ЕАЕ 07.12.2021 СВФР-008461
Функция СотрудникУволен(Сотр, НаДату)
	Уволен = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизацийСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НаДату, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Уволен = Истина;
	КонецЕсли;
	
	Возврат Уволен;
КонецФункции
//Аверсон СВФР-008461
