////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение(ПостроительЗапроса = Неопределено, ПоРаботникамОрганизаций = Истина, СтруктураУволенные = Неопределено) Экспорт //Аверсон ЕАЕ 10.03.2021 СВФР-007269 параметр ПоРаботникамОрганизаций, СтруктураУволенные
	
	ТаблицаСведенияОСтаже = новый ТаблицаЗначений;
	ТаблицаСведенияОСтаже.Колонки.Добавить("Сотрудник");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ФизЛицо");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДатаНачалаРабот");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДатаОкончанияРабот");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ВидДеятельности");
	//О.Т. Аверсон 26.05.2017 № 673
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДопСведения1");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДопСведения2");
	//О.Т. Аверсон 26.05.2017 № 673
	ТаблицаСведенияОСтаже.Колонки.Добавить("Категория");
	
	//Аверсон ЕАЕ 08.01.2022 СВФР-008552
	ТаблицаСведенияОСтаже.Колонки.Добавить("КодППС");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ПодКод");
	//Аверсон СВФР-008552
	
	СписокПустыхНомеровПФР = Новый СписокЗначений;
	СписокПустыхНомеровПФР.Добавить("");
	СписокПустыхНомеровПФР.Добавить("              ");
	
	СписокПричин = Новый СписокЗначений;
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.Увольнение);
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;//О.Т. Аверсон 31.05.2016 № 
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",				ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("СписокПустыхНомеровПФР",		СписокПустыхНомеровПФР);
	Запрос.УстановитьПараметр("Увольнение",		СписокПричин);
	Запрос.УстановитьПараметр("ДатаНачала" , 		НачалоГода(ДатаРегистрации)); //О.Т. Аверсон 19.06.2017 № 735 (не квартал а год!)
	Запрос.УстановитьПараметр("ДатаАктуальности" , 	КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , 	Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , 	Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , 	Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	Запрос.УстановитьПараметр("ТипТелефон" , 	Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипАдрес" , 	Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.НайтиПоКоду("112"));
	//О.Т. Аверсон 31.05.2016 № 1178
	Если ПостроительЗапроса = Неопределено Тогда 
		//Аверсон ЕАЕ 28.07.2021 СВФР-007922
		
		//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	РаботникиОрганизаций.Сотрудник КАК Ссылка,
		//|	РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
		//|ИЗ
		//|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций";
		//
		////Аверсон ЕАЕ 10.03.2021 СВФР-007269
		//Если Не ПоРаботникамОрганизаций Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РаботникиОрганизаций", "ДополнительныеДанныеДляППС");
		//КонецЕсли;
		////Аверсон СВФР-007269
		
		Если ПоРаботникамОрганизаций Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РаботникиОрганизаций.Сотрудник КАК Ссылка,
			|	РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
			|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности,
			|	ДополнительныеДанныеДляППССрезПоследних.Сотрудник
			|ПОМЕСТИТЬ ВТДопДанные
			|ИЗ
			|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&ДатаНачала) КАК ДополнительныеДанныеДляППССрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Период,
			|	Сотрудник
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод,
			|	ВТДопДанные.Сотрудник
			|ПОМЕСТИТЬ ВТМаксПериоды
			|ИЗ
			|	ВТДопДанные КАК ВТДопДанные
			|СГРУППИРОВАТЬ ПО
			|	ВТДопДанные.Сотрудник
			|ИНДЕКСИРОВАТЬ ПО
			|	МаксПериод,
			|	Сотрудник
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТМаксПериоды.Сотрудник
			|ПОМЕСТИТЬ ВТРаботающиеНаНачПериода
			|ИЗ
			|	ВТМаксПериоды КАК ВТМаксПериоды
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
			|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
			|       	И ВТМаксПериоды.Сотрудник = ВТДопДанные.Сотрудник
			|ГДЕ
			|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6
			|;
			|///////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТРаботающиеНаНачПериода.Сотрудник КАК Ссылка,
			|	ВТРаботающиеНаНачПериода.Сотрудник.ФизЛицо КАК ФизЛицо
			|ИЗ ВТРаботающиеНаНачПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеДанныеДляППС.Сотрудник,
			|	ДополнительныеДанныеДляППС.Сотрудник.ФизЛицо
			|ИЗ РегистрСведений.ДополнительныеДанныеДляППС КАК ДополнительныеДанныеДляППС
			|ГДЕ ДополнительныеДанныеДляППС.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
			|	И ДополнительныеДанныеДляППС.ВидДеятельности.ИспользуетсяВПУ6
			|";
		КонецЕсли;
		//Аверсон СВФР-007922
		
		СписокСотрудников = Запрос.Выполнить().Выгрузить();
		
	иначе
		ИсходныйТекстПостроителя = ПостроительЗапроса.Текст;
		ТекстЗапросаПоСпискуРаботников = СтрЗаменить(ИсходныйТекстПостроителя,"РАЗРЕШЕННЫЕ","");
		ПостроительЗапроса.Текст = ТекстЗапросаПоСпискуРаботников;
		ПостроительЗапроса.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ПостроительЗапроса.Выполнить();
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокРаботников.Сотрудник КАК Ссылка,
		|	СписокРаботников.ФизЛицо
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников";
		ПостроительЗапроса.Текст = СотрудникиТекст;
		ПостроительЗапроса.Выполнить();
		СписокСотрудников = ПостроительЗапроса.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	//Аверсон ЕАЕ 29.07.2021 СВФР-007922
	//Исключаем уволенных, если нужно
	СписокУволенных = ПолучитьСписокУволенных(СтруктураУволенные, СписокСотрудников);
	//Аверсон СВФР-007922
	
	//О.Т. Аверсон 31.05.2016 № 1178
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
	|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
	|	ДомашниеТелефоны.Поле3 КАК Телефоны,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
	|	СписокФизлиц.Физлицо,
	|	СписокФизлиц.Физлицо.Пол КАК Пол,
	|	СписокФизлиц.Физлицо.ДатаРождения КАК ДатаРождения,
	|	СписокФизлиц.Физлицо.СтраховойНомерПФР КАК ЛичныйНомер,
	|	СписокФизлиц.Физлицо.МестоРождения КАК МестоРождения,
	|	СписокФизлиц.Физлицо.СтатусКатегория КАК Категория,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
	|			ТОГДА &СтранаПоУмолчанию
	|		ИНАЧЕ ГражданствоФизЛиц.Страна
	|	КОНЕЦ КАК Гражданство,
	//Аверсон ЕАЕ 29.07.2021 СВФР-007922
	|	СписокФизлиц.Сотрудник
	//Аверсон СВФР-007922
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо,
	//Аверсон ЕАЕ 29.07.2021 СВФР-007922
	|		РаботникиОрганизаций.Сотрудник КАК Сотрудник
	//Аверсон СВФР-007922
	|	ИЗ
	//Аверсон ЕАЕ 19.11.2021 СВФР-008371
	
	//ПСА 04.11.2021 СВФР-008305 +++
	//|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности) КАК РаботникиОрганизаций	
	//|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, НЕ Регистратор ССылка Документ.УвольнениеИзОрганизаций) КАК РаботникиОрганизаций
	
	|(ВЫБРАТЬ
	|	РабНаНачало.Сотрудник КАК Сотрудник
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала, Сотрудник В (&Сотрудник) И ОбособленноеПодразделение = &Организация) РабНаНачало
	|ГДЕ РабНаНачало.ВидДеятельностиИзмерение.ИспользуетсяВПУ6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабЗаПериод.Сотрудник
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РабЗаПериод
	|ГДЕ РабЗаПериод.Период МЕЖДУ &ДатаНачала И &ДатаАктуальности
	|	И РабЗаПериод.ОбособленноеПодразделение = &Организация
	|	И РабЗаПериод.Сотрудник В (&Сотрудник)
	|	И РабЗаПериод.ВидДеятельностиИзмерение.ИспользуетсяВПУ6 
	|) КАК РаботникиОрганизаций
	
	//+++ПСА 04.11.2021 СВФР-008305 	
	//|	ГДЕ
	//|		РаботникиОрганизаций.ОбособленноеПодразделение = &Организация
	//|		И ГОД(РаботникиОрганизаций.Период) = ГОД(&ДатаАктуальности) //О.Т. Аверсон 03.04.2019 № 4191
	
	//|		И РаботникиОрганизаций.ВидДеятельностиИзмерение.ИспользуетсяВПУ6
	//
	//|		И РаботникиОрганизаций.Сотрудник В(&Сотрудник)
	
	//Аверсон СВФР-008371
	|) КАК СписокФизлиц //О.Т. Аверсон 31.05.2016 № 1178
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
	|		ПО СписокФизлиц.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СписокФизлиц.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СписокФизлиц.Физлицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
	|		ПО (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
	|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
	|			И (ДомашниеТелефоны.Объект = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
	|		ПО СписокФизлиц.Физлицо = АдресаФактические.Объект
	|			И (АдресаФактические.Вид = &ВидАдресаФактический)
	|			И (АдресаФактические.Тип = &ТипАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
	|		ПО СписокФизлиц.Физлицо = АдресаРегистрации.Объект
	|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
	|			И (АдресаФактические.Тип = &ТипАдрес)";
	
	//Аверсон ЕАЕ 15.03.2021 СВФР-007269
	Если Не ПоРаботникамОрганизаций Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РаботникиОрганизаций.ВидДеятельностиИзмерение.ИспользуетсяВПУ6", "");
		
		//(26.01.2022)
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РабЗаПериод.ВидДеятельностиИзмерение.ИспользуетсяВПУ6", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ РабНаНачало.ВидДеятельностиИзмерение.ИспользуетсяВПУ6", "");
		//
		
	КонецЕсли;
	//Аверсон СВФР-007269
	
	Запрос.УстановитьПараметр("Сотрудник",СписокСотрудников); //О.Т. Аверсон 31.05.2016 № 1178
	ТаблицаРаботникиОрганизации = Новый таблицаЗначений();
	ДопРаботникиОрганизации = Новый Массив;
	
	ТаблицаРаботникиОрганизации = (Запрос.Выполнить().Выгрузить());
	
	//Аверсон ЕАЕ 29.07.2021 СВФР-007922
	//Убираем уволенных
	КолСтрок = ТаблицаРаботникиОрганизации.Количество();
	Если КолСтрок > 0 Тогда
		ИндексПоследнейСтроки = КолСтрок - 1;
		Для н = -ИндексПоследнейСтроки По 0 Цикл
			ИндексТекущейСтроки = -н;
			СтрТаблицы = ТаблицаРаботникиОрганизации[ИндексТекущейСтроки];
			Если СписокУволенных.Найти(СтрТаблицы.Сотрудник) <> Неопределено Тогда
				ТаблицаРаботникиОрганизации.Удалить(СтрТаблицы);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон СВФР-007922
	
	РаботникиОрганизации.Загрузить(ТаблицаРаботникиОрганизации);
	СписокСотрНов = Новый СписокЗначений;
	СписокФизЛицНов = Новый СписокЗначений;
	
	Для Каждого стрСотр из РаботникиОрганизации Цикл 
		МассивСписок = СписокСотрудников.НайтиСтроки(Новый Структура("ФизЛицо",стрСотр.ФизЛицо));
		
		//Аверсон ЕАЕ 13.05.2025 СВФР-015630
		//Если МассивСписок.Количество()>0 Тогда 
		//	СписокСотрНов.Добавить(МассивСписок[0].Ссылка);
		//КонецЕсли;
		Для Каждого Эл Из МассивСписок Цикл 
			СписокСотрНов.Добавить(Эл.Ссылка);
		КонецЦикла;
		//Аверсон СВФР-015630
		
		СписокФизЛицНов.Добавить(стрСотр.ФизЛицо);
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСНСведенияОДоходахППС.ФизЛицо,
	|	ЕСНСведенияОДоходахППС.Период,
	|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов,
	|	ЕСНСведенияОДоходахППС.ФондППС,
	|	ЕСНСведенияОДоходахППС.ППС,
	|	ЕСНСведенияОДоходахППС.ТарифВзносов,
	|	ЕСНСведенияОДоходахППС.ВидДеятельности,
	
	//Аверсон ЕАЕ 27.04.2022 СВФР-008985
	|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
	|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
	//Аверсон СВФР-008985
	
	|ИЗ
	|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
	|ГДЕ
	|	ЕСНСведенияОДоходахППС.Период МЕЖДУ &Период И &Период1
	|	И ЕСНСведенияОДоходахППС.ФизЛицо В(&СписокФизЛиц)";
	Запрос.УстановитьПараметр("Период", НачалоГода(ДатаРегистрации)); //О.Т. Аверсон 19.06.2017 № 735 (не квартал а год!) 
	Запрос.УстановитьПараметр("Период1", КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛицНов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Аверсон ЕАЕ 28.11.2021 СВФР-008371
	ТЗСведенияОВзносах = СведенияОВзносах.Выгрузить();
	ТЗСведенияОВзносах.Очистить();
	
	Для к = 1 По 3 Цикл
		Если к = 1 Тогда
			ИмяКолонки = "Выплаты";
		ИначеЕсли к = 2 Тогда
			ИмяКолонки = "Пособия";
		Иначе
			ИмяКолонки = "Взносы";
		КонецЕсли;
		Колонка = ТЗСведенияОВзносах.Колонки.Найти(ИмяКолонки);
		ТЗСведенияОВзносах.Колонки.Удалить(Колонка);
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		МассивТипов = новый Массив;
		МассивТипов.Добавить(Тип("Число"));        
		ТЗСведенияОВзносах.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов(МассивТипов,,,КЧ));
	КонецЦикла;
	//Аверсон СВФР-008371
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Аверсон ЕАЕ 28.11.2021 СВФР-008371
		//СтрСведенияОВзносах = СведенияОВзносах.Добавить();
		СтрСведенияОВзносах = ТЗСведенияОВзносах.Добавить();
		//Аверсон СВФР-008371
		
		СотрудникВзн = "";
		МассивСписок = СписокСотрудников.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаДетальныеЗаписи.ФизЛицо));
		Если МассивСписок.Количество()>0 Тогда 
			СотрудникВзн = МассивСписок[0].Ссылка;
		КонецЕсли;
		СтрСведенияОВзносах.Сотрудник = СотрудникВзн;
		СтрСведенияОВзносах.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
		//ПСА 08-12-2020 СВФР-006829 +++
		//СтрСведенияОВзносах.Месяц = ВыборкаДетальныеЗаписи.Период;
		СтрСведенияОВзносах.Месяц = ВыборкаДетальныеЗаписи.ПериодВзаиморасчетов;
		//+++ПСА 08-12-2020 СВФР-006829
		СтрСведенияОВзносах.Выплаты = ВыборкаДетальныеЗаписи.ФондППС;
		СтрСведенияОВзносах.Взносы = ВыборкаДетальныеЗаписи.ППС;
		СтрСведенияОВзносах.ТарифВзносов = ВыборкаДетальныеЗаписи.ТарифВзносов;		
		СтрСведенияОВзносах.Категория = ВыборкаДетальныеЗаписи.ФизЛицо.СтатусКатегория;
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		СтрСведенияОВзносах.ПодКод = ВыборкаДетальныеЗаписи.ПодКод;
		СтрСведенияОВзносах.КодППС = ВыборкаДетальныеЗаписи.КодППС;
		//Аверсон СВФР-008985
		
	КонецЦикла;
	//ПСА 08-12-2020 СВФР-006829 +++
	
	//Аверсон ЕАЕ 28.11.2021 СВФР-008371
	//СведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов, Сотрудник,Договор,Категория, ВидДоговора","Выплаты,Пособия,Взносы");
	
	//Аверсон ЕАЕ 27.04.2022 СВФР-008985
	//ТЗСведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов, Сотрудник,Договор,Категория, ВидДоговора","Выплаты,Пособия,Взносы");
	ТЗСведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов, Сотрудник,Договор,Категория, ВидДоговора, ПодКод, КодППС","Выплаты,Пособия,Взносы");
	//Аверсон СВФР-008985
	
	Для Каждого Стр Из ТЗСведенияОВзносах Цикл
		НоваяСтр = СведенияОВзносах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
	КонецЦикла;
	//Аверсон СВФР-008371
	
	//+++ПСА 08-12-2020 СВФР-006829
	ТаблицаИсключений = СформироватьТаблицуЗаработка(СписокФизЛицНов);
	
	НачалоКварталаД = НачалоГода(ДатаРегистрации);
	КонецКварталаД = КонецКвартала(ДатаРегистрации);
	ТЗСведенияОСтаже = Новый ТаблицаЗначений;
	ТЗСведенияОСтаже.Колонки.Добавить("ТабНомер");
	ТЗСведенияОСтаже.Колонки.Добавить("Сотрудник");
	ТЗСведенияОСтаже.Колонки.Добавить("Период");
	ТЗСведенияОСтаже.Колонки.Добавить("ВидДеятельности");
	//О.Т. Аверсон 26.05.2017 № 673
	ТЗСведенияОСтаже.Колонки.Добавить("ДопСведения1");
	ТЗСведенияОСтаже.Колонки.Добавить("ДопСведения2");
	//О.Т. Аверсон 26.05.2017 № 673
	
	//Аверсон ЕАЕ 08.01.2022 СВФР-008552
	ТЗСведенияОСтаже.Колонки.Добавить("КодППС");
	ТЗСведенияОСтаже.Колонки.Добавить("ПодКод");
	//Аверсон СВФР-008552
	
	Пока НачалоКварталаД <= КонецКварталаД Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизаций.Период < &Период
		|			ТОГДА &Период
		|		ИНАЧЕ РаботникиОрганизаций.Период
		|	КОНЕЦ КАК Период,
		|	РаботникиОрганизаций.ВидДеятельностиИзмерение,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения11 как ДополнительныеСведения11,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения21 как ДополнительныеСведения21,
		
		//Аверсон ЕАЕ 08.01.2022 СВФР-008552
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
		//Аверсон СВФР-008552
		
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизацийЗаПериод.Сотрудник,
		|	РаботникиОрганизацийЗаПериод.Период,
		|	РаботникиОрганизацийЗаПериод.ВидДеятельностиИзмерение,
		|	РаботникиОрганизацийЗаПериод.Должность.ДополнительныеСведения11,
		|	РаботникиОрганизацийЗаПериод.Должность.ДополнительныеСведения21,
		|	ВЫРАЗИТЬ(РаботникиОрганизацийЗаПериод.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС,
		|	ВЫРАЗИТЬ(РаботникиОрганизацийЗаПериод.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийЗаПериод
		|ГДЕ РаботникиОрганизацийЗаПериод.Период МЕЖДУ &Период И &ПериодКонец
		|	И РаботникиОрганизацийЗаПериод.Сотрудник В(&СписокСотрудников)
		//Аверсон СВФР-008985
		
		|";
		
		Запрос.УстановитьПараметр("Период", НачалоКварталаД); 
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(НачалоКварталаД));
		//Аверсон СВФР-008985
		
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрНов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗапросУв = Новый Запрос;
			ЗапросУв.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУв.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			ЗапросУв.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			
			РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()> 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			//Аверсон ЕАЕ 28.07.2021 СВФР-007922
			//Проверка на вид деятельности
			Если Не ПоРаботникамОрганизаций Тогда
				ЗапросППС = Новый Запрос;
				ЗапросППС.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
				|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
				|ПОМЕСТИТЬ ВТДопДанные
				|ИЗ
				|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ДополнительныеДанныеДляППССрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод
				|ПОМЕСТИТЬ ВТМаксПериоды
				|ИЗ
				|	ВТДопДанные КАК ВТДопДанные
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	МаксПериод
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТМаксПериоды.МаксПериод КАК Период,
				|	ВТДопДанные.ВидДеятельности
				|ИЗ
				|	ВТМаксПериоды КАК ВТМаксПериоды
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
				|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
				|ГДЕ
				|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6
				|";
				
				ЗапросППС.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
				ЗапросППС.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
				
				РезультатЗапросаППС = ЗапросППС.Выполнить();
				Если РезультатЗапросаППС.Пустой() Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-007922
			
			СтрТЗСведенияОСтаже = ТЗСведенияОСтаже.Добавить();
			СтрТЗСведенияОСтаже.Сотрудник =ВыборкаДетальныеЗаписи.Сотрудник;
			СтрТЗСведенияОСтаже.ТабНомер =ВыборкаДетальныеЗаписи.Сотрудник.Код;
			СтрТЗСведенияОСтаже.Период =ВыборкаДетальныеЗаписи.Период;
			
			//Аверсон ЕАЕ 15.03.2021 СВФР-007269
			Если ПоРаботникамОрганизаций Тогда
				СтрТЗСведенияОСтаже.ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			Иначе
				СтрТЗСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			КонецЕсли;
			//Аверсон СВФР-007269
			
			//О.Т. Аверсон 26.05.2017 № 673
			СтрТЗСведенияОСтаже.ДопСведения1 = ВыборкаДетальныеЗаписи.ДополнительныеСведения11;
			СтрТЗСведенияОСтаже.ДопСведения2 = ВыборкаДетальныеЗаписи.ДополнительныеСведения21;
			//О.Т. Аверсон 26.05.2017 № 673
			
			//Аверсон ЕАЕ 01.08.2022 СВФР-008552
			СтрТЗСведенияОСтаже.КодППС = ВыборкаДетальныеЗаписи.КодППС;
			СтрТЗСведенияОСтаже.ПодКод = ВыборкаДетальныеЗаписи.ПодКод;
			//Аверсон СВФР-008552
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.ВидДеятельностиИзмерение,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения11 как ДополнительныеСведения11,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения21 как ДополнительныеСведения21,
		
		//Аверсон ЕАЕ 08.01.2022 СВФР-008552
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
		//Аверсон СВФР-008552
		
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
		|	И РаботникиОрганизаций.Период между &Период и &Период1";
		
		Запрос.УстановитьПараметр("Период", НачалоКварталаД+86400); 
		Запрос.УстановитьПараметр("Период1", КонецМесяца(НачалоКварталаД));
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрНов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗапросУв = Новый Запрос;
			ЗапросУв.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУв.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			ЗапросУв.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			
			РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()> 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			//Аверсон ЕАЕ 28.07.2021 СВФР-007922
			//Проверка на вид деятельности
			Если Не ПоРаботникамОрганизаций Тогда
				ЗапросППС = Новый Запрос;
				ЗапросППС.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
				|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
				|ПОМЕСТИТЬ ВТДопДанные
				|ИЗ
				|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ДополнительныеДанныеДляППССрезПоследних
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод
				|ПОМЕСТИТЬ ВТМаксПериоды
				|ИЗ
				|	ВТДопДанные КАК ВТДопДанные
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	МаксПериод
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТМаксПериоды.МаксПериод КАК Период,
				|	ВТДопДанные.ВидДеятельности
				|ИЗ
				|	ВТМаксПериоды КАК ВТМаксПериоды
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
				|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
				|ГДЕ
				|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6";
				
				ЗапросППС.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
				ЗапросППС.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
				
				РезультатЗапросаППС = ЗапросППС.Выполнить();
				Если РезультатЗапросаППС.Пустой() Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-007922
			
			
			//Аверсон ЕАЕ 18.11.2021 СВФР-008371
			Если ПоРаботникамОрганизаций Тогда
				ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			Иначе
				ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			КонецЕсли;
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			СтруктураПоиска.Вставить("Период", НачалоМесяца(ВыборкаДетальныеЗаписи.Период));
			СтруктураПоиска.Вставить("ВидДеятельности", ВидДеятельности);
			ПериодыСтаж = ТЗСведенияОСтаже.НайтиСтроки(СтруктураПоиска);
			Если ПериодыСтаж.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			//Если ПредыдущийВидДеятельности = ВидДеятельности Тогда
			//	Продолжить;
			//КонецЕсли;
			//Аверсон СВФР-008371
			
			СтрТЗСведенияОСтаже = ТЗСведенияОСтаже.Добавить();
			СтрТЗСведенияОСтаже.Сотрудник =ВыборкаДетальныеЗаписи.Сотрудник; 
			СтрТЗСведенияОСтаже.ТабНомер =ВыборкаДетальныеЗаписи.Сотрудник.Код;
			СтрТЗСведенияОСтаже.Период =ВыборкаДетальныеЗаписи.Период;
			
			//Аверсон ЕАЕ 18.11.2021 СВФР-008371
			//Аверсон ЕАЕ 15.03.2021 СВФР-007269
			//Если ПоРаботникамОрганизаций Тогда
			//	СтрТЗСведенияОСтаже.ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			//Иначе
			//	СтрТЗСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			//КонецЕсли;
			СтрТЗСведенияОСтаже.ВидДеятельности = ВидДеятельности;
			//Аверсон ЕАЕ 15.03.2021 СВФР-007269
			//Аверсон СВФР-008371
			
			//О.Т. Аверсон 26.05.2017 № 673
			СтрТЗСведенияОСтаже.ДопСведения1 = ВыборкаДетальныеЗаписи.ДополнительныеСведения11;
			СтрТЗСведенияОСтаже.ДопСведения2 = ВыборкаДетальныеЗаписи.ДополнительныеСведения21;
			//О.Т. Аверсон 26.05.2017 № 673
			
			//Аверсон ЕАЕ 01.08.2022 СВФР-008552
			СтрТЗСведенияОСтаже.КодППС = ВыборкаДетальныеЗаписи.КодППС;
			СтрТЗСведенияОСтаже.ПодКод = ВыборкаДетальныеЗаписи.ПодКод;
			//Аверсон СВФР-008552
		КонецЦикла;
		
		
		
		НачалоКварталаД = ДобавитьМесяц(НачалоКварталаД,1);
	КонецЦикла;
	ТЗСведенияОСтаже.Сортировать("ТабНомер,Период");
	
	//Аверсон ЕАЕ 17.11.2021 СВФР-008371
	//дополним таблицу исключений периодами, когда сотрудник работал в неподходящем для пу6 виде деятельности
	ДополнитьТаблицуИсключений(ТаблицаИсключений, ТЗСведенияОСтаже);
	//Аверсон СВФР-008371
	
	СтрСведенияОСтаже = ТаблицаСведенияОСтаже;
	СотрудникПрошл = "";
	ЕстьИсклПоПериоду = Ложь;
	Для Каждого Стр из ТЗСведенияОСтаже Цикл 
		
		//Аверсон ЕАЕ 13.05.2025 СВФР-015630
		//ТаблицаИсключений1 = ТаблицаИсключений.НайтиСтроки(Новый Структура("ФизЛицо",Стр.Сотрудник.ФизЛицо));
		ТаблицаИсключений1 = ТаблицаИсключений.НайтиСтроки(Новый Структура("ФизЛицо,Сотрудник",Стр.Сотрудник.ФизЛицо,Стр.Сотрудник));
		//Аверсон СВФР-015630
		
		Если СотрудникПрошл = Стр.Сотрудник Тогда 
			Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда
				Если СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности и СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1 и СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2 
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					И СтрСведенияОСтаже.КодППС = Стр.КодППС И СтрСведенияОСтаже.ПодКод = Стр.ПодКод
					//Аверсон СВФР-008552
					
					Тогда 
					Если НачалоМесяца(СтрСведенияОСтаже.ДатаНачалаРабот) = НачалоМесяца(Стр.Период) Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = Стр.Период-1;
					КонецЕсли;
					
					Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) = Стр.Период-1 или НачалоДня(СтрСведенияОСтаже.ДатаОкончанияРабот) = НачалоДня(Стр.Период) Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					иначе
						СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
						СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
						СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
						СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
						СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
						СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
						//О.Т. Аверсон 26.05.2017 № 673
						СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
						СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
						//О.Т. Аверсон 26.05.2017 № 673
						СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
						
						//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
						Если ПоРаботникамОрганизаций Тогда
							СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
						Иначе
							СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
						КонецЕсли;
						//Аверсон СВФР-008371
						
						//Аверсон ЕАЕ 08.01.2022 СВФР-008552
						СтрСведенияОСтаже.КодППС = Стр.КодППС;
						СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
						//Аверсон СВФР-008552
					КонецЕсли;
				иначе
					Если Стр.Период-1<= СтрСведенияОСтаже.ДатаОкончанияРабот и СтрСведенияОСтаже.ДатаНачалаРабот < Стр.Период-1 Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = Стр.Период-1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ЕстьИсклПоПериоду = Ложь;
			для Каждого стрИскл из ТаблицаИсключений1 Цикл 
				Если не (Стр.Период >= стрИскл.ДатаНачала и Стр.Период <= стрИскл.ДатаКонец) и не (стрИскл.ДатаНачала >= Стр.Период и стрИскл.ДатаНачала <= КонецМесяца(Стр.Период)) Тогда 
					Продолжить;
				КонецЕсли;
				Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0 Тогда 
					СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
					СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
					СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
					СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
					СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;//О.Т. Аверсон 26.05.2017 № 673
					СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2; //О.Т. Аверсон 26.05.2017 № 673   					
					СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
					
					//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
					Если ПоРаботникамОрганизаций Тогда
						СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					Иначе
						СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					КонецЕсли;
					//Аверсон СВФР-008371
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					СтрСведенияОСтаже.КодППС = Стр.КодППС;
					СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
					//Аверсон СВФР-008552
				КонецЕсли;
				ПропускатьСтроку = Ложь;
				для Каждого стрИсклПроверка из ТаблицаИсключений1 Цикл
					Если  стрИскл.ДатаНачала > стрИсклПроверка.ДатаНачала и стрИскл.ДатаНачала <= стрИсклПроверка.ДатаКонец Тогда 
						Если СтрСведенияОСтаже.ДатаНачалаРабот >= стрИскл.ДатаНачала  Тогда 
							ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
							ПропускатьСтроку = Истина;
							КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
							Если КолСтрок <> 0 Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				если ПропускатьСтроку Тогда 
					Продолжить;
				КонецЕсли;
				
				
				если стрИскл.ДатаНачала >= СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаНачала <= СтрСведенияОСтаже.ДатаОкончанияРабот Тогда 
					ОкончаниеПрошл = СтрСведенияОСтаже.ДатаОкончанияРабот;
					ВидДеятПрошл = СтрСведенияОСтаже.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					ДопСведения1Прошл = СтрСведенияОСтаже.ДопСведения1;
					ДопСведения2Прошл = СтрСведенияОСтаже.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					КодППСПрошл = СтрСведенияОСтаже.КодППС;
					ПодКодПрошл = СтрСведенияОСтаже.ПодКод;
					//Аверсон СВФР-008552
					
					Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаКонец = КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) Тогда
						ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
						КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
						Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда 
							СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;  
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;  
									//Аверсон СВФР-008552
									
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;  
									//Аверсон СВФР-008552
									
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
								Если ПоРаботникамОрганизаций Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								Иначе
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//Аверсон СВФР-008371
								
							КонецЕсли;
						КонецЕсли;
					иначе 							
						СтрСведенияОСтаже.ДатаОкончанияРабот = стрИскл.ДатаНачала-1;
						
						
						Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот Тогда 
							СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
							СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
							
							//Аверсон ЕАЕ 05.02.2024 СВФР-012287
							СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
							//Аверсон СВФР-012287
							
						иначе 	
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;  
									//Аверсон СВФР-008552
									
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;  
									//Аверсон СВФР-008552
									
								КонецЕсли;
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
								Если ПоРаботникамОрганизаций Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								Иначе
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//Аверсон СВФР-008371
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					ЕстьИсклПоПериоду = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			если (ЕстьИсклПоПериоду = Ложь) и ?(ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0,истина,СтрСведенияОСтаже.ДатаОкончанияРабот < Стр.Период) Тогда 
				СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
				СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
				СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
				СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
				СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
				СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
				//О.Т. Аверсон 26.05.2017 № 673
				СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
				СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
				//О.Т. Аверсон 26.05.2017 № 673
				
				СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
				
				//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
				Если ПоРаботникамОрганизаций Тогда
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				Иначе
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				КонецЕсли;
				//Аверсон СВФР-008371
				
				//Аверсон ЕАЕ 08.01.2022 СВФР-008552
				СтрСведенияОСтаже.КодППС = Стр.КодППС;
				СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
				//Аверсон СВФР-008552
			КонецЕсли;
			
		иначе
			//Если СотрудникПрошл <> "" Тогда 
			ЕстьИсклПоПериоду = Ложь;
			для Каждого стрИскл из ТаблицаИсключений1 Цикл
				Если не (Стр.Период >= стрИскл.ДатаНачала и Стр.Период <= стрИскл.ДатаКонец) и не (стрИскл.ДатаНачала >= Стр.Период и стрИскл.ДатаНачала <= КонецМесяца(Стр.Период)) Тогда 
					Продолжить;
				КонецЕсли;
				
				Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0 Тогда 
					СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
					СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
					СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
					СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
					СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
					
					//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
					Если ПоРаботникамОрганизаций Тогда
						СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					Иначе
						СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					КонецЕсли;
					//Аверсон СВФР-008371
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					СтрСведенияОСтаже.КодППС = Стр.КодППС;
					СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
					//Аверсон СВФР-008552
				КонецЕсли;
				
				если стрИскл.ДатаНачала >= СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаНачала <= СтрСведенияОСтаже.ДатаОкончанияРабот Тогда 
					ОкончаниеПрошл = СтрСведенияОСтаже.ДатаОкончанияРабот;
					ВидДеятПрошл = СтрСведенияОСтаже.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					ДопСведения1Прошл = СтрСведенияОСтаже.ДопСведения1;
					ДопСведения2Прошл = СтрСведенияОСтаже.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					КодППСПрошл = СтрСведенияОСтаже.КодППС;
					ПодКодПрошл = СтрСведенияОСтаже.ПодКод;
					//Аверсон СВФР-008552
					
					Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаКонец = КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) Тогда
						ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
						КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
						Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда 
							СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
									//Аверсон СВФР-008552
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;
									//Аверсон СВФР-008552
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
								Если ПоРаботникамОрганизаций Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								Иначе
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//Аверсон СВФР-008371
								
							КонецЕсли;
						КонецЕсли;
					иначе 							
						СтрСведенияОСтаже.ДатаОкончанияРабот = стрИскл.ДатаНачала-1;
						
						Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот Тогда 
							СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
							СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
						иначе 	
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								
								//СВЭЙ 29.04.2024 КВВ СВФР-012950 (
								Если НЕ ЗначениеЗаполнено(СтрСведенияОСтаже.ВидДеятельности) Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//СВЭЙ 29.04.2024 КВВ СВФР-012950 )
								
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
									//Аверсон СВФР-008552
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;
									//Аверсон СВФР-008552
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
								Если ПоРаботникамОрганизаций Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								Иначе
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//Аверсон СВФР-008371
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					ЕстьИсклПоПериоду = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			//КонецЕсли;
			если ЕстьИсклПоПериоду = Ложь Тогда 
				
				СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
				СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
				СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
				СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
				СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
				СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
				//О.Т. Аверсон 26.05.2017 № 673
				СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
				СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
				//О.Т. Аверсон 26.05.2017 № 673
				
				СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
				
				//Аверсон ЕАЕ 15.11.2021 СВФР-008371 (26.01.2022)
				Если ПоРаботникамОрганизаций Тогда
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				Иначе
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				КонецЕсли;
				//Аверсон СВФР-008371
				
				//Аверсон ЕАЕ 08.01.2022 СВФР-008552
				СтрСведенияОСтаже.КодППС = Стр.КодППС;
				СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
				//Аверсон СВФР-008552
			КонецЕсли;
		КонецЕсли;
		
		СотрудникПрошл = Стр.Сотрудник;
	КонецЦикла;
	ТаблицаСведенияОСтаже.Сортировать("Сотрудник,ДатаНачалаРабот");
	
	Для Каждого СтрСтаж из ТаблицаСведенияОСтаже Цикл
		
		//Аверсон ЕАЕ 15.11.2021 СВФР-008371
		Если НЕ ЗначениеЗаполнено(СтрСтаж.ВидДеятельности) Тогда
			Продолжить;
		КонецЕсли;
		//Аверсон СВФР-008371
		
		Запрос = Новый Запрос;
		ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот);
		ДатаКон = СтрСтаж.ДатаОкончанияРабот;
		Пока ДатаН <= НачалоМесяца(ДатаКон) Цикл 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНСведенияОДоходахППС.ФизЛицо,
			|	ЕСНСведенияОДоходахППС.Период,
			|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов,
			|	ЕСНСведенияОДоходахППС.ФондППС,
			|	ЕСНСведенияОДоходахППС.ППС,
			|	ЕСНСведенияОДоходахППС.ТарифВзносов,
			|	ЕСНСведенияОДоходахППС.ВидДеятельности
			|ИЗ
			|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
			|ГДЕ
			|	ЕСНСведенияОДоходахППС.Период МЕЖДУ &Период И &Период1
			|	И ЕСНСведенияОДоходахППС.ФизЛицо = &ФизЛицо";
			Запрос.УстановитьПараметр("Период", НачалоМесяца(ДатаН)); 
			Запрос.УстановитьПараметр("Период1", КонецМесяца(ДатаН));
			Запрос.УстановитьПараметр("ФизЛицо", СтрСтаж.ФизЛицо);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
			//О.Т. Аверсон 22.06.2017 № 757
			Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда 
				//Если КонецМесяца(ДатаН) = КонецМесяца(ДатаКон) Тогда 
				//	Если не НачалоМесяца(СтрСтаж.ДатаНачалаРабот) = НачалоМесяца(ДатаН) Тогда 
				//		СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(СтрСтаж.ДатаНачалаРабот);
				//		СтрСведенияОСтаже = СведенияОСтаже.Добавить();
				//		ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
				//	КонецЕсли;
				//иначе
				//	Если НачалоМесяца(СтрСтаж.ДатаНачалаРабот) = НачалоМесяца(ДатаН) Тогда 
				//		СтрСведенияОСтаже.ДатаНачалаРабот = КонецМесяца(ДатаН)+1;
				//	иначе
				//		СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(СтрСтаж.ДатаНачалаРабот);
				//		СтрСведенияОСтаже = СведенияОСтаже.Добавить();
				//		ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
				//		СтрСведенияОСтаже.ДатаНачалаРабот = КонецМесяца(ДатаН)+1;
				//		СтрСведенияОСтаже.ДатаОкончанияРабот = ДатаКон;
				//	КонецЕсли;
				//КонецЕсли;
				
			иначе
				Если КонецМесяца(ДатаН) = КонецМесяца(ДатаКон) Тогда
					Если ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот) Тогда 
						СтрСведенияОСтаже = СведенияОСтаже.Добавить();
						ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
					иначе
						Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот)+1 <> ДатаН Тогда 
							СтрСведенияОСтаже = СведенияОСтаже.Добавить();
							ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
							СтрСведенияОСтаже.ДатаНачалаРабот = ДатаН;
						КонецЕсли;
						
					КонецЕсли;
					
					СтрСведенияОСтаже.ДатаОкончанияРабот = СтрСтаж.ДатаОкончанияРабот;
				иначе  
					Если ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот) Тогда
						СтрСведенияОСтаже = СведенияОСтаже.Добавить();
						ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
					иначе
						Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот)+1 <> ДатаН Тогда 
							СтрСведенияОСтаже = СведенияОСтаже.Добавить();
							ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
							СтрСведенияОСтаже.ДатаНачалаРабот = ДатаН;
						КонецЕсли;
						
					КонецЕсли;
					
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(ДатаН);
				КонецЕсли;
				
				//Аверсон ЕАЕ 29.07.2021 СВФР-007922
				
				ЗапросУв = Новый Запрос;
				ЗапросУв.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизацийСрезПоследних.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
				|ГДЕ
				|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
				
				ЗапросУв.УстановитьПараметр("Период", СтрСведенияОСтаже.ДатаОкончанияРабот);
				ЗапросУв.УстановитьПараметр("Сотрудник", СтрСтаж.Сотрудник);
				
				РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
				Если РезультатЗапроса.Количество()> 0 Тогда
					СтрСведенияОСтаже.ДатаОкончанияРабот = РезультатЗапроса[0].Период-1;
					прервать;
				КонецЕсли;
				
				//Аверсон СВФР-007922
				
			КонецЕсли;
			
			//Аверсон ЕАЕ 29.07.2021 СВФР-007922
			
			//ЗапросУв = Новый Запрос;
			//ЗапросУв.Текст = 
			//"ВЫБРАТЬ
			//|	РаботникиОрганизацийСрезПоследних.Период
			//|ИЗ
			//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			//|ГДЕ
			//|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			//
			//ЗапросУв.УстановитьПараметр("Период", СтрСведенияОСтаже.ДатаОкончанияРабот);
			//ЗапросУв.УстановитьПараметр("Сотрудник", СтрСтаж.Сотрудник);
			//
			//РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
			//Если РезультатЗапроса.Количество()> 0 Тогда
			//	СтрСведенияОСтаже.ДатаОкончанияРабот = РезультатЗапроса[0].Период-1;
			//	прервать;
			//КонецЕсли;
			
			//О.Т. Аверсон 22.06.2017 № 757 неправильно заполнялось
			
			//Аверсон СВФР-007922
			
			
			
			ДатаН = ДобавитьМесяц(ДатаН,1);
		КонецЦикла;
		
		
	КонецЦикла;
	
	//СВЭЙ 29.04.2024 КВВ СВФР-012950 (
	Если СведенияОСтаже.Количество() > 0 Тогда     
		ОтборПустойППС = Новый Структура;
		ОтборПустойППС.Вставить("КодППС", 0);
		СтрокиПустойППС = СведенияОСтаже.НайтиСтроки(ОтборПустойППС);
		Для Каждого Стр Из СтрокиПустойППС Цикл 
			СпрПрофф = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецДня(Стр.ДатаНачалаРабот),Новый Структура("Сотрудник",Стр.Сотрудник)).Должность.СправочникПрофессий;
			Если СпрПрофф <> Неопределено Тогда
				
				//Аверсон ЕАЕ 13.05.2025 СВФР-015630
				//Стр.КодППС = СпрПрофф.КодППС;
				Если ТипЗнч(СпрПрофф) = Тип("СправочникСсылка.ОКРБ") Тогда
					Стр.КодППС = СпрПрофф.КодОКРБ;	
				Иначе
					Стр.КодППС = СпрПрофф.КодППС;	
				КонецЕсли; 
				//Аверсон СВФР-015630
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//СВЭЙ 29.04.2024 КВВ СВФР-012950 )	
	
КонецФункции

//Аверсон ЕАЕ 29.07.2021 СВФР-007922
Функция ПолучитьСписокУволенных(СтруктураУволенные, СписокСотрудников)
	СписокУволенных = Новый Массив;
	
	Если СтруктураУволенные = Неопределено Тогда
		Возврат СписокУволенных;
	КонецЕсли;
	
	ВключатьУволенных = СтруктураУволенные.ВключатьУволенных;
	ДатаУвольнения = СтруктураУволенные.ДатаУвольнения;
	
	НачГода = НачалоГода(ДатаРегистрации);
	
	Если Не ВключатьУволенных Тогда
		ДатаНач = НачГода;
		ДатаКон = КонецДня(ДатаРегистрации);
	Иначе
		
		//Аверсон ЕАЕ 26.04.2022 СВФР-008985
		//Если Не ЗначениеЗаполнено(ДатаУвольнения) ИЛИ ДатаУвольнения <= НачГода Тогда
		Если Не ЗначениеЗаполнено(ДатаУвольнения) Тогда //ИЛИ ДатаУвольнения < НачГода Тогда
			//Аверсон СВФР-008985	
			
			Возврат СписокУволенных;
		Иначе
			ДатаНач = НачГода;
			ДатаКон = НачалоДня(ДатаУвольнения) - 1;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РаботникиОрганизаций.Сотрудник
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	
	//Аверсон ЕАЕ 26.04.2022 СВФР-008985
	//|	ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, СЕКУНДА, -1) МЕЖДУ &НачДата И &КонДата
	|	ДОБАВИТЬКДАТЕ(РаботникиОрганизаций.Период, СЕКУНДА, -1) <= &КонДата
	//Аверсон СВФР-008985
	
	|	И РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
	
	Запрос.УстановитьПараметр("КонДата", ДатаКон);
	
	//Аверсон ЕАЕ 26.04.2022 СВФР-008985
	//Запрос.УстановитьПараметр("НачДата", ДатаНач);
	//Аверсон СВФР-008985
	
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокУволенных.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
	КонецЦикла;
	
	Возврат СписокУволенных;
КонецФункции
//Аверсон СВФР-007922

//Аверсон ЕАЕ 15.03.2021 СВФР-007269
Функция ПолучитьВидДеятельности(Сотр, Дат)
	ВидД = Справочники.ОсобыеУсловияТруда.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
	|ИЗ
	|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Дат, Сотрудник = &Сотр) КАК ДополнительныеДанныеДляППССрезПоследних";
	
	Запрос.УстановитьПараметр("Дат", Дат);
	Запрос.УстановитьПараметр("Сотр", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидД = ВыборкаДетальныеЗаписи.ВидДеятельности;
	КонецЦикла;
	
	Возврат ВидД;
КонецФункции
//Аверсон СВФР-007269

//Аверсон ЕАЕ 15.11.2021 СВФР-008371
Функция ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(Сотр, Дат)
	ВидД = Справочники.ОсобыеУсловияТруда.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение КАК ВидДеятельности
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дат, Сотрудник = &Сотр) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("Дат", Дат);
	Запрос.УстановитьПараметр("Сотр", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидД = ВыборкаДетальныеЗаписи.ВидДеятельности;
	КонецЦикла;
	
	Возврат ВидД;
КонецФункции
//Аверсон

Функция СформироватьТаблицуЗаработка(СписокФизЛицНов) 
	//Островская Татьяна 11.06.2013 № 16547
	
	СписокФизЛиц = СписокФизЛицНов;
	
	Запрос = Новый Запрос;
	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	
	Разрезы = Новый Массив(4);
	Разрезы[0] = "ДоходФСЗН";
	Разрезы[1] = "ДоходСтрах";
	Разрезы[2] = "ДоходЕдиногоПлатежа";
	Разрезы[3] = "КодДоходаЕСН";
	
	Запрос.УстановитьПараметр("парамИзмерения",		Измерения);
	Запрос.УстановитьПараметр("парамРазрезыЕСН",	Разрезы);
	Запрос.УстановитьПараметр("парамКатегорияПервичная", Справочники.КатегорииРасчетов.Первичное);
	Запрос.УстановитьПараметр("парамПустойСпособЕСНУ", Перечисления.ДоходыФСС_НС.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамСпособНеОблагаетсяКодДоходаЕСН", Перечисления.ДоходыФСС_НС.НеОблагается);
	Запрос.УстановитьПараметр("парамПустойКодЕСНУ", Справочники.ДоходыЕСН.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодЕСН", Справочники.ДоходыЕСН.ОблагаетсяПолностью);
	Запрос.УстановитьПараметр("ОблагаетсяСтрах", Справочники.ДоходыЕСН.ОблагаетсяСтрах);
	
	Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛиц);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчисленияНаППС", Перечисления.ДоходыФСС_НС.НеОблагается);
	Запрос.УстановитьПараметр("Период", НачалоГода(ДатаРегистрации));
	Запрос.УстановитьПараметр("Период1", КонецКвартала(ДатаРегистрации));
	
	Запрос.УстановитьПараметр("ВидДеятельности", Справочники.ОсобыеУсловияТруда.ПустаяСсылка());
	Запрос.УстановитьПараметр("Должность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	
	ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
	если ПенсФондБудМес = 1 тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 28.08.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС КАК ВидРасчетаОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.ПериодДействияНачало КАК ДатаНачала,
		|	ДанныеУчета.ПериодДействияКонец КАК ДатаКонец,
		|	ДанныеУчета.Сторно
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.Сторно КАК Сторно
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ОсновныеНачисления.Организация КАК Организация,
		|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ОсновныеНачисления.Организация
		|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &Период И &Период1
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо,
		|					ОсновныеНачисления.Организация,
		|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|			ИЗ
		|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ОсновныеНачисления.Организация
		|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		//|		//И ОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		//|		И ОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		//Аверсон СВФР-016452
		
		|		И ОсновныеНачисления.ФизЛицо В(&СписокФизЛиц)) КАК ДанныеУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 28.08.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.ПериодДействияКонец,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ПериодДействияНачало,
		|	ДанныеУчета.ФизЛицо";
	иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 28.08.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС КАК ВидРасчетаОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.ПериодДействияНачало КАК ДатаНачала,
		|	ДанныеУчета.ПериодДействияКонец КАК ДатаКонец,
		|	ДанныеУчета.Сторно
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.Сторно КАК Сторно
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ОсновныеНачисления.Организация КАК Организация,
		|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ОсновныеНачисления.Организация
		|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &Период И &Период1
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо,
		|					ОсновныеНачисления.Организация,
		|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|			ИЗ
		|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ОсновныеНачисления.Организация
		|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		//|		И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &Период И &Период1
		|		И ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &Период И &Период1  //Аверсон 12.08.2021 КВВ СВФР-007893 (пункт 3)
		
		//Аверсон ЕАЕ 28.08.2025 СВФР-016452
		//Запрос вернет все начисления
		//|		И ОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		//Аверсон СВФР-016452
		
		|		И ОсновныеНачисления.ФизЛицо В(&СписокФизЛиц)) КАК ДанныеУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 28.08.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	ДанныеУчета.ПериодДействияНачало,
		|	ДанныеУчета.ПериодДействияКонец,
		|	ДанныеУчета.Сторно";
		
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"));
	Массив.Добавить(Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисленияОрганизаций"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , );
	
	ИсходнаяТаблица = Новый ТаблицаЗначений;
	ИсходнаяТаблица.Колонки.Добавить("Сотрудник");
	ИсходнаяТаблица.Колонки.Добавить("ФизЛицо");
	ИсходнаяТаблица.Колонки.Добавить("ВидРасчета",ОписаниеТиповС);
	ИсходнаяТаблица.Колонки.Добавить("Результат");	
	ИсходнаяТаблица.Колонки.Добавить("ДатаНачала");
	ИсходнаяТаблица.Колонки.Добавить("ДатаКонец");
	ИсходнаяТаблица.Колонки.Добавить("ПериодРегистрации");
	
	//Аверсон ЕАЕ 28.08.2025 СВФР-016452
	//Получим все (понадобится дальше), но отберем только не облагаемые, чтобы не нарушить то, что было
	//ТЗИсходнаяТаблица = Запрос.Выполнить().Выгрузить();
	ТЗИсходнаяТаблицаВсе = Запрос.Выполнить().Выгрузить();
	СтрОтбора = Новый Структура;
	СтрОтбора.Вставить("ВидРасчетаОтчисленияНаППС",Перечисления.ДоходыФСС_НС.НеОблагается);
	НужныеСтроки = ТЗИсходнаяТаблицаВсе.НайтиСтроки(СтрОтбора);
	ТЗИсходнаяТаблица = ТЗИсходнаяТаблицаВсе.Скопировать(НужныеСтроки,);
	//Аверсон СВФР-016452
	
	ГруппаИсклИзППС = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Основные;
	
	ГруппаИсклИзППС_НеполныйДень = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Надбавки; //Аверсон 26.07.2021 КВВ СВФР-007893
	
	//СВЭЙ 27.10.2023 КВВ СВФР-011719 (
	ВидыРасчетовКоторыеИсключаются = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Доплаты.ВыгрузитьКолонку("ВидРасчета");
	ВидыРасчетовПослеКоторыхИсключаются = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Повышения.ВыгрузитьКолонку("ВидРасчета"); 
	ТЗИсходнаяТаблицаКопия = ТЗИсходнаяТаблица.Скопировать();	
	//СВЭЙ 27.10.2023 КВВ СВФР-011719 )	
	
	Для Каждого стр из ТЗИсходнаяТаблица Цикл 
		МассивИскл = ГруппаИсклИзППС.НайтиСтроки(Новый Структура("ВидРасчета",стр.ВидРасчета)); 
		Если МассивИскл.Количество()>0 Тогда 
			
			//Аверсон 26.07.2021 КВВ СВФР-007893 (
			Если ГруппаИсклИзППС_НеполныйДень.Количество() > 0  И ГруппаИсклИзППС_НеполныйДень.НайтиСтроки(Новый Структура("ВидРасчета",стр.ВидРасчета)).Количество() > 0 Тогда
				Если ТипЗнч(стр.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
					ЗНД = Новый Запрос;
					ЗНД.Текст = "
					|ВЫБРАТЬ 
					|Нач.ВидРасчета,
					|СУММА(ЕСТЬNULL(Нач.ОплаченоДней,0)) КАК ОплаченоДней
					|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Нач
					|ГДЕ
					|Нач.Сотрудник = &Сотрудник
					|И Нач.ВидРасчета = &ВР
					|И Нач.ПериодДействияКонец = &ДатаКон
					|СГРУППИРОВАТЬ ПО
					|ВидРасчета";
					ЗНД.УстановитьПараметр("Сотрудник",стр.Сотрудник);
					ЗНД.УстановитьПараметр("ВР",стр.ВидРасчета);
					ЗНД.УстановитьПараметр("ДатаКон",стр.ДатаКонец);
					РезЗНД = ЗНД.Выполнить().Выгрузить();
					Если РезЗНД.Количество() > 0 Тогда
						Если РезЗНД[0].ОплаченоДней > 0 И РезЗНД[0].ОплаченоДней < 1 Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//Аверсон 26.07.2021 КВВ СВФР-007893 )
			
			СтрИсходнаяТаблица = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрИсходнаяТаблица,стр);
			
			//ПСА 28-09-2020 СВФР-006604 +++
			Если СтрИсходнаяТаблица.ДатаКонец < КонецКвартала(ДатаРегистрации) Тогда
				
				//СВЭЙ 27.10.2023 КВВ СВФР-011719 (
				ПродолжатьПроверку = Истина;
				Если ВидыРасчетовПослеКоторыхИсключаются.Найти(СтрИсходнаяТаблица.ВидРасчета) <> Неопределено
					И ВидыРасчетовКоторыеИсключаются.Количество() <> 0 Тогда
					
					Для Каждого ВРИскл ИЗ ВидыРасчетовКоторыеИсключаются Цикл
						Отбор1 = Новый Структура;    
						Отбор1.Вставить("ВидРасчета", ВРИскл);
						Отбор1.Вставить("ФизЛицо", Стр.ФизЛицо);
						Отбор1.Вставить("Сотрудник", Стр.Сотрудник);
						
						СтрокиОтбор1 = ТЗИсходнаяТаблицаКопия.НайтиСтроки(Отбор1);
						Если СтрокиОтбор1.Количество() > 0 Тогда 
							Для Каждого С1 ИЗ СтрокиОтбор1 Цикл
								Если С1.Сторно = Истина Тогда
									Продолжить;
								КонецЕсли;  
								ОтборСторно = Новый Структура;    
								ОтборСторно.Вставить("Сторно", Истина);
								ОтборСторно.Вставить("ВидРасчета", С1.ВидРасчета);
								ОтборСторно.Вставить("ДатаКонец", С1.ДатаКонец);
								ОтборСторно.Вставить("ДатаНачала", С1.ДатаНачала);
								ОтборСторно.Вставить("Результат", -С1.Результат); 
								ОтборСторно.Вставить("ФизЛицо", С1.ФизЛицо);
								ОтборСторно.Вставить("Сотрудник", С1.Сотрудник);
								
								СтрокиСторно = ТЗИсходнаяТаблицаКопия.НайтиСтроки(ОтборСторно);
								Если СтрокиСторно.Количество() > 0 Тогда
									Продолжить;
								КонецЕсли;  
								
								Если КонецДня(стр.ДатаКонец)+1 = С1.ДатаНачала Тогда
									ПродолжатьПроверку = Ложь;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;						
					КонецЦикла;
				КонецЕсли;  
				Если ПродолжатьПроверку Тогда
					//СВЭЙ 27.10.2023 КВВ СВФР-011719 )
					
					//Аверсон 23.08.2021 КВВ СВФР-007893 ( (пункт 2)
					ЗапросПоПраздникам = Новый Запрос;
					ЗапросПоПраздникам.Текст = "
					|ВЫБРАТЬ
					|РабочееВремяРаботниковОрганизаций.Сотрудник
					|ИЗ РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
					|ГДЕ
					|РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
					|И РабочееВремяРаботниковОрганизаций.ДатаНачала = &Период 
					|И РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник";
					ЗапросПоПраздникам.УстановитьПараметр("ВидИспользованияРабочегоВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Праздники);
					ЗапросПоПраздникам.УстановитьПараметр("Сотрудник", Стр.Сотрудник);
					ЗапросПоПраздникам.УстановитьПараметр("Период", КонецДня(стр.ДатаКонец)+1);
					РезЗапросПоПраздникам = ЗапросПоПраздникам.Выполнить().Выгрузить();
					Если РезЗапросПоПраздникам.Количество() = 0 Тогда
						//Аверсон 23.08.2021 КВВ СВФР-007893 ) (пункт 2)
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389
						//Получим все графики сотрудника (индивидуальные и по табелю за период документа)
						//Для нахождения следующего рабочего дня после окончания больничного
						МассивГрафиков = Новый Массив;
						//Аверсон СВФР-009389
						
						//Аверсон 29.04.2021 КВВ СВФР-007514 (
						ПоГрафику = "";
						ЗапросИндГрафик = Новый Запрос;
						ЗапросИндГрафик.Текст = "
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389
						//|ВЫБРАТЬ
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						//Аверсон СВФР-009389
						
						|ВводИндГрафиковР.Ссылка
						|ИЗ Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндГрафиковР
						|ГДЕ ВводИндГрафиковР.Сотрудник = &Сотрудник
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389 
						//|И ВводИндГрафиковР.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации,МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации,МЕСЯЦ)
						|И ВводИндГрафиковР.Ссылка.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодНач,МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодКон,МЕСЯЦ)
						//Аверсон СВФР-009389
						
						|И ВводИндГрафиковР.Ссылка.Проведен = ИСТИНА
						|И ВводИндГрафиковР.Ссылка.СпособВводаДанных = ЗНАЧЕНИЕ(Перечисление.СпособыВводаДанныхОВремени.ПоДням)";
						ЗапросИндГрафик.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389
						//ЗапросИндГрафик.УстановитьПараметр("ПериодРегистрации",СтрИсходнаяТаблица.ДатаКонец);
						ЗапросИндГрафик.УстановитьПараметр("ПериодНач", НачалоКвартала(ДатаРегистрации));
						ЗапросИндГрафик.УстановитьПараметр("ПериодКон", КонецКвартала(ДатаРегистрации));
						//Аверсон СВФР-009389
						
						ТЗЗапросИндГрафик = ЗапросИндГрафик.Выполнить().Выгрузить();
						Если ТЗЗапросИндГрафик.Количество() <> 0 Тогда
							ПоГрафику = Стр.Сотрудник;
							
							//Аверсон ЕАЕ 27.07.2022 СВФР-009389
							Если МассивГрафиков.Найти(ПоГрафику) = Неопределено Тогда
								МассивГрафиков.Добавить(ПоГрафику);
							КонецЕсли;
							//Аверсон СВФР-009389
							
							//Аверсон ЕАЕ 27.07.2022 СВФР-009389 закомментировано
							//обычные графики будем находить в любом случае
							//а не только тогда, когда нет индивидуальных
							//Иначе
							//	//Аверсон 29.04.2021 КВВ СВФР-007514 )
							//	ЗапросГрафик = Новый Запрос;
							//	ЗапросГрафик.Текст = 
							//	"ВЫБРАТЬ
							//	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
							//	|ИЗ
							//	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
							//	|			&ДатаСреза,
							//	|			Организация = &Организация
							//	|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
							//	
							//	ЗапросГрафик.УстановитьПараметр("ДатаСреза", КонецКвартала(ДатаРегистрации));
							//	ЗапросГрафик.УстановитьПараметр("Организация", Организация);
							//	ЗапросГрафик.УстановитьПараметр("Сотрудник", стр.Сотрудник);
							//	
							//	РезультатЗапросаГрафик = ЗапросГрафик.Выполнить();
							//	ВыборкаГр = РезультатЗапросаГрафик.Выбрать();
							//	
							//	Если ВыборкаГр.Следующий() Тогда
							//		ПоГрафику = ВыборкаГр.ГрафикРаботы;   //Аверсон 29.04.2021 КВВ СВФР-007514
							//	КонецЕсли;
							//Аверсон СВФР-009389
							
						КонецЕсли;
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389
						ЗапросГрафик = Новый Запрос;
						ЗапросГрафик.Текст = 
						"ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
						|ИЗ
						|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
						|			&ПериодНач,
						|			Организация = &Организация
						|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
						|
						|ОБЪЕДИНИТЬ
						|
						|ВЫБРАТЬ
						|	РаботникиОрганизаций.ГрафикРаботы	
						|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
						|ГДЕ РаботникиОрганизаций.Организация = &Организация
						|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
						|	И РаботникиОрганизаций.Период МЕЖДУ &ПериодНач И &ПериодКон
						|";
						
						ЗапросГрафик.УстановитьПараметр("ПериодНач", НачалоКвартала(ДатаРегистрации));
						ЗапросГрафик.УстановитьПараметр("ПериодКон", КонецКвартала(ДатаРегистрации));
						ЗапросГрафик.УстановитьПараметр("Организация", Организация);
						ЗапросГрафик.УстановитьПараметр("Сотрудник", стр.Сотрудник);
						
						РезультатЗапросаГрафик = ЗапросГрафик.Выполнить();
						ВыборкаГр = РезультатЗапросаГрафик.Выбрать();
						
						Пока ВыборкаГр.Следующий() Цикл
							ПоГрафику = ВыборкаГр.ГрафикРаботы;   
							Если МассивГрафиков.Найти(ПоГрафику) = Неопределено Тогда
								МассивГрафиков.Добавить(ПоГрафику);
							КонецЕсли;
						КонецЦикла;
						//Аверсон СВФР-009389
						
						//Аверсон ЕАЕ 27.07.2022 СВФР-009389
						//Если ПоГрафику <> "" Тогда //Аверсон 29.04.2021 КВВ СВФР-007514
						Если МассивГрафиков.Количество() > 0 Тогда
							//Аверсон СВФР-009389
							
							ЗапросРД = Новый Запрос;
							ЗапросРД.Текст = 
							"ВЫБРАТЬ ПЕРВЫЕ 1
							|	ГрафикиРаботыПоВидамВремени.Дата
							|ИЗ
							|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
							|ГДЕ
							
							//Аверсон ЕАЕ 27.07.2022 СВФР-009389
							//|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
							|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы В (&ГрафикРаботы)
							//Аверсон СВФР-009389
							
							|	И ГрафикиРаботыПоВидамВремени.План = ИСТИНА
							|	И ГрафикиРаботыПоВидамВремени.Дата > &ДатаПроверки
							|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
							|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <> 0";
							
							ЗапросРД.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоДням);
							//ЗапросРД.УстановитьПараметр("ГрафикРаботы", ВыборкаГр.ГрафикРаботы);
							
							//Аверсон ЕАЕ 27.07.2022 СВФР-009389
							//ЗапросРД.УстановитьПараметр("ГрафикРаботы", ПоГрафику); //Аверсон 29.04.2021 КВВ СВФР-007514
							ЗапросРД.УстановитьПараметр("ГрафикРаботы", МассивГрафиков);
							//Аверсон СВФР-009389
							
							ЗапросРД.УстановитьПараметр("ДатаПроверки", СтрИсходнаяТаблица.ДатаКонец);
							
							РезультатЗапросаРД = ЗапросРД.Выполнить();
							
							ВыборкаРД = РезультатЗапросаРД.Выбрать();
							
							Если ВыборкаРД.Следующий() Тогда
								ДатаПроверки = ВыборкаРД.Дата;
								Если ДатаПроверки >= КонецКвартала(ДатаРегистрации)Тогда
									ДатаКонец = КонецКвартала(ДатаРегистрации);
								Иначе
									ДатаКонец = ДатаПроверки-1;
								КонецЕсли;	
								Если КонецМесяца(ДатаКонец) > КонецМесяца(СтрИсходнаяТаблица.ДатаКонец)  Тогда
									СтрИсходнаяТаблица.ДатаКонец = КонецМесяца(СтрИсходнаяТаблица.ДатаКонец);
									СтрИсходнаяТаблица = ИсходнаяТаблица.Добавить();
									ЗаполнитьЗначенияСвойств(СтрИсходнаяТаблица,стр);
									СтрИсходнаяТаблица.ДатаНачала = НачалоМесяца(ДатаКонец);
									СтрИсходнаяТаблица.ДатаКонец = ДатаКонец;
								Иначе
									СтрИсходнаяТаблица.ДатаКонец = ДатаКонец;
								КонецЕсли;	
								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; //СВЭЙ 27.10.2023 КВВ СВФР-011719
			КонецЕсли;	
			//+++ПСА 28-09-2020 СВФР-006604
		КонецЕсли;
	КонецЦикла;
	
	//ПСА 08-12-2020 СВФР-006829 +++
	ВР_ОплатаОтпуска = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни;
	ПараметрыОтпуска = Новый Структура();
	
	//Аверсон ЕАЕ 15.11.2021 СВФР-008371
	//ПараметрыОтпуска.Вставить("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
	ВидыРасчетовКоторыеИсключаются = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Доплаты.ВыгрузитьКолонку("ВидРасчета");
	ВидыРасчетовПослеКоторыхИсключаются = Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Повышения.ВыгрузитьКолонку("ВидРасчета");
	
	ТЗИсходнаяТаблица.Сортировать("Сотрудник,ДатаНачала");
	//Аверсон СВФР-008371	
	
	ТЗИсходнаяТаблицаКопия = ТЗИсходнаяТаблица.Скопировать(); //СВЭЙ 27.10.2023 КВВ СВФР-011719
	
	Для Каждого стр из ТЗИсходнаяТаблица Цикл 
		
		//Аверсон ЕАЕ 15.11.2021 СВФР-008371
		//Если Стр.ВидРасчета = ВР_ОплатаОтпуска Тогда
		Если ВидыРасчетовКоторыеИсключаются.Найти(Стр.ВидРасчета) <> Неопределено Тогда
			//Аверсон СВФР-008371
			
			//СВЭЙ 27.10.2023 КВВ СВФР-011719 (
			Если Стр.Сторно = Истина Тогда
				Продолжить;
			КонецЕсли;  
			ОтборСторно = Новый Структура;    
			ОтборСторно.Вставить("Сторно", Истина);
			ОтборСторно.Вставить("ВидРасчета", Стр.ВидРасчета);
			ОтборСторно.Вставить("ДатаКонец", Стр.ДатаКонец);
			ОтборСторно.Вставить("ДатаНачала", Стр.ДатаНачала);
			ОтборСторно.Вставить("Результат", -Стр.Результат); 
			ОтборСторно.Вставить("ФизЛицо", Стр.ФизЛицо);
			ОтборСторно.Вставить("Сотрудник", Стр.Сотрудник);
			
			СтрокиСторно = ТЗИсходнаяТаблицаКопия.НайтиСтроки(ОтборСторно);
			Если СтрокиСторно.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			//СВЭЙ 27.10.2023 КВВ СВФР-011719 )
			
			ПараметрыОтпуска.Вставить("ФизЛицо", стр.ФизЛицо);
			ПараметрыОтпуска.Вставить("Сотрудник",Стр.Сотрудник);
			СтрокиОтпускаЗаСвойСчет = ИсходнаяТаблица.НайтиСтроки(ПараметрыОтпуска);
			Если СтрокиОтпускаЗаСвойСчет.Количество() > 0 Тогда
				Для Каждого СтрокаОтпуска из СтрокиОтпускаЗаСвойСчет Цикл
					
					//Аверсон ЕАЕ 15.11.2021 СВФР-008371
					Если ВидыРасчетовПослеКоторыхИсключаются.Найти(СтрокаОтпуска.ВидРасчета) = Неопределено
						И ВидыРасчетовКоторыеИсключаются.Найти(СтрокаОтпуска.ВидРасчета) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					//Аверсон СВФР-008371
					
					Если  СтрокаОтпуска.ДатаКонец + 1 = Стр.ДатаНачала Тогда
						СтрИсходнаяТаблица = ИсходнаяТаблица.Добавить();
						ЗаполнитьЗначенияСвойств(СтрИсходнаяТаблица,стр);
						Если СтрИсходнаяТаблица.ДатаКонец < КонецКвартала(ДатаРегистрации) Тогда
							ЗапросГрафик = Новый Запрос;
							ЗапросГрафик.Текст = 
							"ВЫБРАТЬ
							|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы
							|ИЗ
							|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
							|			&ДатаСреза,
							|			Организация = &Организация
							|				И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
							
							ЗапросГрафик.УстановитьПараметр("ДатаСреза", КонецКвартала(ДатаРегистрации));
							ЗапросГрафик.УстановитьПараметр("Организация", Организация);
							ЗапросГрафик.УстановитьПараметр("Сотрудник", стр.Сотрудник);
							
							РезультатЗапросаГрафик = ЗапросГрафик.Выполнить();
							
							ВыборкаГр = РезультатЗапросаГрафик.Выбрать();
							
							Если ВыборкаГр.Следующий() Тогда
								ЗапросРД = Новый Запрос;
								ЗапросРД.Текст = 
								"ВЫБРАТЬ ПЕРВЫЕ 1
								|	ГрафикиРаботыПоВидамВремени.Дата
								|ИЗ
								|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
								|ГДЕ
								|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
								|	И ГрафикиРаботыПоВидамВремени.План = ИСТИНА
								|	И ГрафикиРаботыПоВидамВремени.Дата > &ДатаПроверки
								|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени
								|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <> 0";
								
								ЗапросРД.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоДням);
								ЗапросРД.УстановитьПараметр("ГрафикРаботы", ВыборкаГр.ГрафикРаботы);
								ЗапросРД.УстановитьПараметр("ДатаПроверки", СтрИсходнаяТаблица.ДатаКонец);
								
								РезультатЗапросаРД = ЗапросРД.Выполнить();
								
								ВыборкаРД = РезультатЗапросаРД.Выбрать();
								
								Если ВыборкаРД.Следующий() Тогда
									ДатаПроверки = ВыборкаРД.Дата;
									Если ДатаПроверки >= КонецКвартала(ДатаРегистрации)Тогда
										ДатаКонец = КонецКвартала(ДатаРегистрации);
									Иначе
										ДатаКонец = ДатаПроверки-1;
									КонецЕсли;	
									Если КонецМесяца(ДатаКонец) > КонецМесяца(СтрИсходнаяТаблица.ДатаКонец)  Тогда
										СтрИсходнаяТаблица.ДатаКонец = КонецМесяца(СтрИсходнаяТаблица.ДатаКонец);
										СтрИсходнаяТаблица = ИсходнаяТаблица.Добавить();
										ЗаполнитьЗначенияСвойств(СтрИсходнаяТаблица,стр);
										СтрИсходнаяТаблица.ДатаНачала = НачалоМесяца(ДатаКонец);
										СтрИсходнаяТаблица.ДатаКонец = ДатаКонец;
									Иначе
										СтрИсходнаяТаблица.ДатаКонец = ДатаКонец;
									КонецЕсли;	
									
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	//+++ПСА 08-12-2020 СВФР-006829
	
	если ПенсФондБудМес = 1 тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС КАК ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.БазовыйНачало КАК ДатаНачала,
		|	ДанныеУчета.БазовыйКонец КАК ДатаКонец,
		|	ДанныеУчета.ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
		|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ДополнительныеНачисления.Организация КАК Организация,
		|		ДополнительныеНачисления.Результат КАК Результат,
		|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ДополнительныеНачисления.Организация КАК Организация,
		|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ДополнительныеНачисления.Организация
		|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) МЕЖДУ &Период И &Период1
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ДополнительныеНачисления.Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо,
		|					ДополнительныеНачисления.Организация,
		|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|			ИЗ
		|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДополнительныеНачисления.Организация
		|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) МЕЖДУ &Период И &Период1
		|		И ДополнительныеНачисления.ФизЛицо В(&СписокФизЛиц)
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452 
		//Получим все, потом отберем
		//|		И ДополнительныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		//Аверсон СВФР-016452
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДополнительныеНачисления.БазовыйПериодНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец,
		|		ДополнительныеНачисления.Сотрудник,
		|		ДополнительныеНачисления.ВидРасчета,
		|		ДополнительныеНачисления.Организация,
		|		ДополнительныеНачисления.ПериодРегистрации,
		|		ДополнительныеНачисления.Сотрудник.Физлицо,
		|		ДополнительныеНачисления.Результат) КАК ДанныеУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	ДанныеУчета.ПериодРегистрации,
		|	ДанныеУчета.БазовыйКонец,
		|	ДанныеУчета.БазовыйНачало,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо";
	иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС КАК ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.БазовыйНачало КАК ДатаНачала,
		|	ДанныеУчета.БазовыйКонец КАК ДатаКонец,
		|	ДанныеУчета.ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
		|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ДополнительныеНачисления.Результат КАК Результат,
		|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ДополнительныеНачисления.Организация КАК Организация,
		|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ДополнительныеНачисления.Организация
		|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) МЕЖДУ &Период И &Период1
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ДополнительныеНачисления.Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо,
		|					ДополнительныеНачисления.Организация,
		|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|			ИЗ
		|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДополнительныеНачисления.Организация
		|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) МЕЖДУ &Период И &Период1
		|		И ДополнительныеНачисления.ФизЛицо В(&СписокФизЛиц)
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		//Получим все, потом отберем
		//|		И ДополнительныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		//Аверсон СВФР-016452
		
		|) КАК ДанныеУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		|   ДанныеУчета.ВидРасчета.ОтчисленияНаППС,
		//Аверсон СВФР-016452
		
		|	ДанныеУчета.БазовыйНачало,
		|	ДанныеУчета.БазовыйКонец,
		|	ДанныеУчета.ПериодРегистрации";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	
	Результат = Запрос.Выполнить().Выбрать();
	//Островская Татьяна 11.06.2013 № 16547
	
	Пока Результат.Следующий() Цикл
		
		//Аверсон ЕАЕ 03.09.2025 СВФР-016452
		НовСтр = ТЗИсходнаяТаблицаВсе.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Результат);
		Если Результат.ОтчисленияНаППС = Перечисления.ДоходыФСС_НС.Облагается Тогда
			Продолжить;
		КонецЕсли;
		//Аверсон СВФР-016452
		
		МассивИскл = ГруппаИсклИзППС.НайтиСтроки(Новый Структура("ВидРасчета",Результат.ВидРасчета)); 
		Если МассивИскл.Количество()>0 Тогда
			мНоваяСтрока = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, Результат);
		КонецЕсли;
		//мНоваяСтрока.Тип = 1;
		
	КонецЦикла;
	
	//Аверсон ЕАЕ 03.09.2025 СВФР-016452
	ТЗСотрудники = ТЗИсходнаяТаблицаВсе.Скопировать(,"Сотрудник");
	ТЗСотрудники.Свернуть("Сотрудник");
	СписокСотрудников = ТЗСотрудники.ВыгрузитьКолонку("Сотрудник");
	ТЗРабочиеДни = ПолучитьРабочиеДниСотрудников(СписокСотрудников, НачалоГода(ДатаРегистрации), КонецКвартала(ДатаРегистрации));
	
	ТЗИсходнаяТаблицаВсе.Сортировать("Сотрудник,ДатаНачала");
	Для Каждого Стр Из ТЗИсходнаяТаблицаВсе Цикл 
		
		Если ВидыРасчетовПослеКоторыхИсключаются.Найти(Стр.ВидРасчета) = Неопределено Тогда //Найдем отпуска (которые исключаются)
			Продолжить;
		КонецЕсли;
		ПервоначальнаяДатаКонец = Стр.ДатаКонец;
		
		ПоследнийДеньПослеКоторыхИсключаются = Стр.ДатаКонец; //это может быть и выходной
		СледующийРабочийДеньСотрудника = ПолучитьСледующийРабочийДень(Стр.Сотрудник, ПоследнийДеньПослеКоторыхИсключаются, ТЗРабочиеДни);
		
		//Проверим, следует ли он за видом расчета из массива "После которых исключаются"
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник", Стр.Сотрудник);
		НужныеСтрокиСотрудник = ТЗИсходнаяТаблицаВсе.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрСотр Из НужныеСтрокиСотрудник Цикл
			Если ВидыРасчетовКоторыеИсключаются.Найти(СтрСотр.ВидРасчета) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			Если (СледующийРабочийДеньСотрудника <> Неопределено И СледующийРабочийДеньСотрудника = СтрСотр.ДатаНачала) ИЛИ
				КонецДня(Стр.ДатаКонец) + 1 = СтрСотр.ДатаНачала Тогда //в этом месте надо считать не +1, а след рабочий день
				Стр.ДатаКонец = СтрСотр.ДатаКонец;
				
				ПоследнийДеньПослеКоторыхИсключаются = Стр.ДатаКонец; //это может быть и выходной
				СледующийРабочийДеньСотрудника = ПолучитьСледующийРабочийДень(Стр.Сотрудник, ПоследнийДеньПослеКоторыхИсключаются, ТЗРабочиеДни);
				
			КонецЕсли;
		КонецЦикла;
		
		СтруктураОтбораИсходная = Новый Структура;
		СтруктураОтбораИсходная.Вставить("Сотрудник",  Стр.Сотрудник);
		СтруктураОтбораИсходная.Вставить("ВидРасчета", Стр.ВидРасчета);
		СтруктураОтбораИсходная.Вставить("ДатаНачала", Стр.ДатаНачала);
		СтруктураОтбораИсходная.Вставить("ДатаКонец",  ПервоначальнаяДатаКонец);
		
		НужныеСтроки = ИсходнаяТаблица.НайтиСтроки(СтруктураОтбораИсходная);
		Если НужныеСтроки.Количество() > 0 Тогда
			НужныеСтроки[0].ДатаКонец = Стр.ДатаКонец;	
		Иначе
			НовСтр = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЕсли;
	КонецЦикла;
	//Аверсон СВФР-016452
	
	//мПустоеЗначение = ИсходнаяТаблица.НайтиСтроки(Новый Структура("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается));
	//Для Каждого мСтрока Из мПустоеЗначение Цикл
	//	ИсходнаяТаблица.Удалить(мСтрока);
	//КонецЦикла;
	
	//Аверсон ЕАЕ 13.05.2025 СВФР-015630
	//ИсходнаяТаблица.Свернуть("ФизЛицо, ДатаНачала,ДатаКонец", "Результат");
	//ИсходнаяТаблица.Сортировать("ФизЛицо,ДатаНачала");
	ИсходнаяТаблица.Свернуть("ФизЛицо, Сотрудник, ДатаНачала, ДатаКонец", "Результат");
	ИсходнаяТаблица.Сортировать("ФизЛицо, Сотрудник, ДатаНачала");
	//Аверсон СВФР-015630
	
	//Аверсон ЕАЕ 17.11.2021 СВФР-008371
	СвернутьПериоды(ИсходнаяТаблица);
	//Аверсон СВФР-008371
	
	Возврат ИсходнаяТаблица;
	
КонецФункции

//Аверсон ЕАЕ 04.09.2025 СВФР-016452
Функция ПолучитьСледующийРабочийДень(Сотр, ПослеДаты, ТЗРабочиеДни)
	СледДень = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|*
	|ПОМЕСТИТЬ ВТТЗ
	|ИЗ &ТЗ КАК ТЗ
	|;
	|////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТТЗ.РабочийДень
	|ИЗ ВТТЗ
	|ГДЕ ВТТЗ.Сотрудник = &Сотрудник
	|	И ВТТЗ.РабочийДень > &ПослеДаты
	|";
	Запрос.УстановитьПараметр("Сотрудник", Сотр);
	Запрос.УстановитьПараметр("ТЗ", ТЗРабочиеДни);
	Запрос.УстановитьПараметр("ПослеДаты", ПослеДаты);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СледДень = Выборка.РабочийДень;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СледДень;
КонецФункции

Функция ПолучитьРабочиеДниСотрудников(СписокСотрудников, Нач, Кон)
	
	//сюда будем записывать рабочие дни
	ТЗРабочиеДни = Новый ТаблицаЗначений;
	ТЗРабочиеДни.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	ТЗРабочиеДни.Колонки.Добавить("РабочийДень", ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	
	//Получим данные инд.графиков
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник,
		|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов1 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних1 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных1 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День1,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов2 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних2 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных2 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День2,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов3 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних3 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных3 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День3,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов4 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних4 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных4 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День4,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов5 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних5 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных5 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День5,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов6 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних6 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных6 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День6,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов7 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних7 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных7 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День7,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов8 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних8 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных8 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День8,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов9 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних9 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных9 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День9,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов10 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних10 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных10 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День10,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов11 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних11 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных11 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День11,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов12 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних12 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных12 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День12,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов13 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних13 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных13 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День13,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов14 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних14 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных14 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День14,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов15 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних15 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных15 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День15,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов16 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних16 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных16 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День16,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов17 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних17 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных17 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День17,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов18 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних18 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных18 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День18,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов19 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних19 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных19 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День19,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов20 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних20 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных20 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День20,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов21 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних21 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных21 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День21,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов22 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних22 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных22 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День22,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов23 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних23 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных23 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День23,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов24 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних24 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных24 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День24,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов25 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних25 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных25 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День25,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов26 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних26 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных26 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День26,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов27 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних27 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных27 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День27,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов28 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних28 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных28 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День28,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов29 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних29 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных29 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День29,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов30 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних30 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных30 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День30,
		|	ВЫБОР
		|		КОГДА ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Часов31 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовВечерних31 <> 0
		|				ИЛИ ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.ЧасовНочных31 <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК День31,
		|	НАЧАЛОПЕРИОДА(ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК Месяц
		|ИЗ
		|	Документ.ВводИндивидуальныхГрафиковРаботыОрганизации.ГрафикРаботы КАК ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы
		|ГДЕ
		|	ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Ссылка.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВводИндивидуальныхГрафиковРаботыОрганизацииГрафикРаботы.Сотрудник В(&СписокСотрудников)";
	
	Запрос.УстановитьПараметр("КонецПериода", Кон);
	Запрос.УстановитьПараметр("НачалоПериода", Нач);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	ТЗИндГрафики = Запрос.Выполнить().Выгрузить();
	
	//Заполним рабочие дни
	Для Каждого Стр Из ТЗИндГрафики Цикл
		Для н = 1 По 31 Цикл 
			ИмяКолонки = "День" + СокрЛП(н);
			Если Стр[ИмяКолонки] = ИСТИНА Тогда
				ТекДата = Дата(Год(Стр.Месяц), Месяц(Стр.Месяц), н);
				НоваяСтр = ТЗРабочиеДни.Добавить();
				НоваяСтр.Сотрудник = Стр.Сотрудник;
				НоваяСтр.РабочийДень = ТекДата;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Получим рабочие дни из общих графиков
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.Месяц,
		|	ГрафикиРаботыПоВидамВремени.План,
		|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|	ГрафикиРаботыПоВидамВремени.ВидВремени,
		|	ГрафикиРаботыПоВидамВремени.Дата
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &Нач И &Кон
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|	И ГрафикиРаботыПоВидамВремени.ВидВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаДни)
		|	И ГрафикиРаботыПоВидамВремени.План
		|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <> 0
		|УПОРЯДОЧИТЬ ПО
		|	ГрафикРаботы,
		|   Месяц,
		|   Дата
		|";
	
	Запрос.УстановитьПараметр("Кон", Кон);
	Запрос.УстановитьПараметр("Нач", Нач);
	
	ТЗОбщГрафики = Запрос.Выполнить().Выгрузить();
	
    ТекМесяц = НачалоМесяца(Нач);
	Пока ТекМесяц < Кон Цикл
		//Получим графики сотрудников за месяц (они могли меняться)
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РОСрез.Сотрудник,
		|	&парамНачало КАК Период,
		|	РОСрез.ГрафикРаботы
		|ПОМЕСТИТЬ ВТРО
		|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамНачало, Сотрудник В (&СписокСотрудников)) КАК РОСрез
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РО.Сотрудник,
		|	РО.Период,
		|	РО.ГрафикРаботы
		|ИЗ РегистрСведений.РаботникиОрганизаций КАК РО
		|ГДЕ РО.Сотрудник В (&СписокСотрудников)
		|	И РО.Период МЕЖДУ &парамНачало И &парамКонец
		|;
		|//////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРО.Сотрудник,
		|	ВТРО.ГрафикРаботы,
		|	ВТРО.Период КАК НачПериод,
		|	МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТРОБольше.Период,СЕКУНДА,-1),&парамКонец)) КАК КонПериод
		|ИЗ ВТРО
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТРО КАК ВТРОБольше
		|ПО ВТРО.Сотрудник = ВТРОБольше.Сотрудник
		|	И ВТРО.Период < ВТРОБольше.Период
		|СГРУППИРОВАТЬ ПО
		|	ВТРО.Сотрудник,
		|	ВТРО.ГрафикРаботы,
		|	ВТРО.Период
		|";
		Запрос.УстановитьПараметр("парамНачало", НачалоМесяца(ТекМесяц));
		Запрос.УстановитьПараметр("парамКонец", КонецМесяца(ТекМесяц));
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
		ТЗПериодыГрафики = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Сотр Из СписокСотрудников Цикл
			//проверяем, есть ли инд график по сотруднику за этот месяц
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Сотрудник", Сотр); 
			СтруктураОтбора.Вставить("Месяц", ТекМесяц);
			СтрокиИндГрафик = ТЗИндГрафики.НайтиСтроки(СтруктураОтбора);
			Если СтрокиИндГрафик.Количество() > 0 Тогда //Есть
				Продолжить;
			Иначе //Нет
				//Получаем периоды работы сотрудника по графикам
				СтруктураОтбораПериодыГрафиков = Новый Структура;
				СтруктураОтбораПериодыГрафиков.Вставить("Сотрудник", Сотр);
				НужныеСтрокиПериодыГрафиков = ТЗПериодыГрафики.НайтиСтроки(СтруктураОтбораПериодыГрафиков);
				
				Для Каждого СтрГр Из НужныеСтрокиПериодыГрафиков Цикл
					НачГрафик = СтрГр.НачПериод;
					КонГрафик = СтрГр.КонПериод;
					График = СтрГр.ГрафикРаботы;
					
					ТекДата = НачГрафик;
					Пока ТекДата <= КонГрафик Цикл
						//Проверяем, рабочий ли был день по графику
						СтруктураОтбораОбщиеГрафики = Новый Структура;
						СтруктураОтбораОбщиеГрафики.Вставить("ГрафикРаботы", График);
						СтруктураОтбораОбщиеГрафики.Вставить("Дата", ТекДата);
						НужныеСтрокиРабочиеДни = ТЗОбщГрафики.НайтиСтроки(СтруктураОтбораОбщиеГрафики);
						Если НужныеСтрокиРабочиеДни.Количество() > 0 Тогда
							НоваяСтр = ТЗРабочиеДни.Добавить();
							НоваяСтр.Сотрудник = Сотр;
							НоваяСтр.РабочийДень = ТекДата;
						КонецЕсли;
						ТекДата = КонецДня(ТекДата) + 1;	
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ТекМесяц = КонецМесяца(ТекМесяц) + 1;
	КонецЦикла;
	ТЗРабочиеДни.Сортировать("Сотрудник,РабочийДень");
	Возврат ТЗРабочиеДни;
КонецФункции
//Аверсон СВФР-016452

//Аверсон ЕАЕ 17.11.2021 СВФР-008371
Функция НайтиПересекающиесяСтроки(ТабРез, ФизЛицо, ДатаНачала, ДатаКонец, Сотр) //Аверсон ЕАЕ 12.05.2025 СВФР-015630 Сотр
	НужнаяСтр = Неопределено;
	Для Каждого Стр Из ТабРез Цикл
		Если Стр.ФизЛицо <> ФизЛицо ИЛИ Стр.Сотрудник <> Сотр Тогда //Аверсон ЕАЕ 12.05.2025 СВФР-015630 Сотр
			Продолжить;
		КонецЕсли;
		Если ДатаКонец < Стр.ДатаНачала ИЛИ ДатаНачала > Стр.ДатаКонец Тогда
			Продолжить;
		КонецЕсли;
		НужнаяСтр = Стр;
		Прервать;
	КонецЦикла;
	Возврат НужнаяСтр;
КонецФункции

Функция НайтиПредСтроку(ТабРез, ФизЛицо, ДатаНачала, ДатаКонец, Сотр) //Аверсон ЕАЕ 12.05.2025 СВФР-015630 Сотр
	ПредСтрока = Неопределено;
	Для Каждого Стр Из ТабРез Цикл
		Если Стр.ФизЛицо <> ФизЛицо ИЛИ Стр.Сотрудник <> Сотр Тогда //Аверсон ЕАЕ 12.05.2025 СВФР-015630 Сотр
			Продолжить;
		КонецЕсли;
		Если КонецДня(Стр.ДатаКонец) + 1 = НачалоДня(ДатаНачала) И НачалоМесяца(Стр.ДатаКонец) = НачалоМесяца(ДатаНачала) Тогда
			ПредСтрока = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ПредСтрока;
КонецФункции

Процедура СвернутьПериоды(ИсходнаяТаблица)
	//Аверсон ЕАЕ 17.11.2021 СВФР-008371
	ИсходнаяТаблицаРезультат = ИсходнаяТаблица.Скопировать();
	ИсходнаяТаблицаРезультат.Очистить();
	
	ИсходнаяТаблицаФизЛицо = ИсходнаяТаблица.Скопировать();
	
	//Аверсон ЕАЕ 12.05.2025 СВФР-015630
	//ИсходнаяТаблицаФизЛицо.Свернуть("ФизЛицо");
	ИсходнаяТаблицаФизЛицо.Свернуть("ФизЛицо,Сотрудник");
    //Аверсон СВФР-015630
	
	Для Каждого СтрФизЛицо Из ИсходнаяТаблицаФизЛицо Цикл
		СтруктураПоиска = Новый Структура("ФизЛицо", СтрФизЛицо.ФизЛицо);
		
		//Аверсон ЕАЕ 12.05.2025 СВФР-015630
		СтруктураПоиска.Вставить("Сотрудник", СтрФизЛицо.Сотрудник);
		//Аверсон СВФР-015630
		
		СтрокиФизЛицо = ИсходнаяТаблица.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Эл Из СтрокиФизЛицо Цикл
			//если в результате нет периодов, пересекающихся с этим
			
			//Аверсон ЕАЕ 12.05.2025 СВФР-015630
			//НужнаяСтрРезультат = НайтиПересекающиесяСтроки(ИсходнаяТаблицаРезультат, Эл.ФизЛицо, Эл.ДатаНачала, Эл.ДатаКонец);
			НужнаяСтрРезультат = НайтиПересекающиесяСтроки(ИсходнаяТаблицаРезультат, Эл.ФизЛицо, Эл.ДатаНачала, Эл.ДатаКонец, Эл.Сотрудник);
			//Аверсон СВФР-015630
			
			Если НужнаяСтрРезультат = Неопределено Тогда
				//если есть пред. период - присоединяем к нему
				
				//Аверсон ЕАЕ 12.05.2025 СВФР-015630
				//ПредСтрока = НайтиПредСтроку(ИсходнаяТаблицаРезультат, Эл.ФизЛицо, Эл.ДатаНачала, Эл.ДатаКонец);
				ПредСтрока = НайтиПредСтроку(ИсходнаяТаблицаРезультат, Эл.ФизЛицо, Эл.ДатаНачала, Эл.ДатаКонец, Эл.Сотрудник);
				//Аверсон СВФР-015630
				
				Если ПредСтрока = Неопределено Тогда
					НоваяСтр = ИсходнаяТаблицаРезультат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтр, Эл);
				Иначе
					ПредСтрока.ДатаКонец = Эл.ДатаКонец;
				КонецЕсли;
				//если есть - изменим дату начала и/или дату окончания
			Иначе
				Если Эл.ДатаНачала < НужнаяСтрРезультат.ДатаНачала Тогда
					НужнаяСтрРезультат.ДатаНачала = Эл.ДатаНачала;
				КонецЕсли;
				Если Эл.ДатаКонец > НужнаяСтрРезультат.ДатаКонец Тогда
					НужнаяСтрРезультат.ДатаКонец = Эл.ДатаКонец;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Аверсон ЕАЕ 12.05.2025 СВФР-015630
	//ИсходнаяТаблицаРезультат.Сортировать("ФизЛицо,ДатаНачала");
	ИсходнаяТаблицаРезультат.Сортировать("ФизЛицо,Сотрудник,ДатаНачала");
	//Аверсон СВФР-015630
	
	ИсходнаяТаблица = ИсходнаяТаблицаРезультат;
КонецПроцедуры

Процедура ДополнитьТаблицуИсключений(ТаблицаИсключений, ПериодыСтажа)
	ЗакрытьПериод = Ложь;
	ПериодыСтажа.Свернуть("ВидДеятельности,ДопСведения1,ДопСведения2,КодППС,Период,ПодКод,Сотрудник,ТабНомер");  //СВЭЙ 29.04.2024 КВВ СВФР-012950
	ПериодыСтажа.Сортировать("Сотрудник,Период");
	ПериодыСтажаСотрудники = ПериодыСтажа.Скопировать();
	ПериодыСтажаСотрудники.Свернуть("Сотрудник");
	ТекСотр = "";  //СВЭЙ 29.04.2024 КВВ СВФР-012950
	Для Каждого СтрСотр Из ПериодыСтажаСотрудники Цикл
		СтруктураПоиска = Новый Структура("Сотрудник", СтрСотр.Сотрудник);
		СтрокиПоСотруднику = ПериодыСтажа.НайтиСтроки(СтруктураПоиска);
		Для Каждого Стр Из СтрокиПоСотруднику Цикл
			Если Не ЗначениеЗаполнено(Стр.ВидДеятельности) Тогда
				НоваяСтр = ТаблицаИсключений.Добавить();
				НоваяСтр.ФизЛицо = Стр.Сотрудник.ФизЛицо;
				НоваяСтр.ДатаНачала = Стр.Период;
				НоваяСтр.ДатаКонец = КонецМесяца(Стр.Период);
				
				//Аверсон ЕАЕ 12.05.2025 СВФР-015630
				НоваяСтр.Сотрудник = Стр.Сотрудник;
				//Аверсон СВФР-015630
				
				ЗакрытьПериод = Истина;
				ТекСотр =  Стр.Сотрудник; //СВЭЙ 29.04.2024 КВВ СВФР-012950
			Иначе
				Если ЗакрытьПериод 
					И ТекСотр = Стр.Сотрудник Тогда //СВЭЙ 29.04.2024 КВВ СВФР-012950
					НоваяСтр.ДатаКонец = КонецДня(НачалоДня(Стр.Период) - 1);
					ЗакрытьПериод = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//Аверсон ЕАЕ 12.05.2025 СВФР-015630
	//ТаблицаИсключений.Сортировать("ФизЛицо,ДатаНачала"); 
	ТаблицаИсключений.Сортировать("ФизЛицо,Сотрудник,ДатаНачала");
	//Аверсон СВФР-015630
	
	СвернутьПериоды(ТаблицаИсключений);
КонецПроцедуры
//Аверсон СВФР-008371

#Если Клиент Тогда
	
	// Формирует файл, который можно будет записать на дискетку
	//
	// Параметры: 
	//  Нет
	//
	// Возвращаемое значение:
	//  Строка - содержимое файла
	//
	Функция СформироватьВыходнойФайл(Отказ) Экспорт
		
		мДлиннаСуток = 86400;
		
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
			Отказ = Истина;
			Возврат "";
		КонецЕсли;	
		
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		Результат					=	СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации			=	Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		//убрал за ненадобностью	
		//Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
		//КонецЕсли;	 
		
		СписокОбработанныхАнкет = Новый СписокЗначений;
		
		ТекстФайла	=	"";
		НомерДокументаВПачке = 0;
		
		//Формируем заголовок выходного файла
		ДатаФормирования = ВыборкаПоШапкеДокумента.Дата;
		ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
		МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
		ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
		ДатаЗаполнения   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		НомерПачки 				= ПроцедурыПерсонифицированогоУчета.НомерПачкиДокумента(ВыборкаПоШапкеДокумента.Номер);
		КоличествоДокументов 	= ВыборкаПоРаботникиОрганизации.Количество();
		
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		Запрос.УстановитьПараметр("СписокОтчитывающихсяПодразделений", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
		Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
		Запрос.УстановитьПараметр("НачалоНП", НачалоГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)); //О.Т.(К) 10.06.2016 НЕ ГОД А КВАРТАЛ
		Запрос.УстановитьПараметр("КонецНП", КонецКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		Запрос.УстановитьПараметр("ДатаПодачиСведений", ВыборкаПоШапкеДокумента.ПериодРегистрации);// дата акуальности сведений о доходах и налогах
		
		
		// Выборка списка физлиц, для которых надо получать доходы
		СписокФизлицТекст = "ВЫБРАТЬ 
		|	ТЧРаботникиОрганизации.ФизЛицо
		|ИЗ
		|	Документ.СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	ЕСНСведенияОДоходахППС.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
		|	СРЕДНЕЕ(ЕСНСведенияОДоходахППС.ТарифВзносов) КАК ТарифВзносов,
		|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ФондППС, 0)) КАК ФондППС,
		|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ППС, 0)) КАК ППС,
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
		//Аверсон СВФР-008985
		
		|ИЗ
		|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
		|ГДЕ
		|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|	И ЕСНСведенияОДоходахППС.Организация = &СписокОтчитывающихсяПодразделений
		|	И ЕСНСведенияОДоходахППС.ФизЛицо В(" + СписокФизлицТекст + ")
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСНСведенияОДоходахППС.ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ),
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод
		//Аверсон СВФР-008985
		
		|	УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	Период
		|";
		
		//	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		ПромежуточнаяТаблица = Запрос.Выполнить().Выгрузить();
		
		//Аверсон ЕАЕ 27.04.2022 СВФР-008985
		//ПромежуточнаяТаблица.Свернуть("ФизЛицо, Период, ТарифВзносов","ФондППС, ППС");
		ПромежуточнаяТаблица.Свернуть("ФизЛицо, Период, ТарифВзносов, ПодКод, КодППС","ФондППС, ППС");
		//Аверсон СВФР-008985
		
		//Аверсон ЕАЕ 12.11.2021 СВФР-008366
		ДоходыПоКодамПрофессий =
		"ВЫБРАТЬ
		|	ЕСНСведенияОДоходахППС.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
		|	ЕСНСведенияОДоходахППС.ТарифВзносов КАК ТарифВзносов,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод,
		|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ФондППС, 0)) КАК ФондППС,
		|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ППС, 0)) КАК ППС
		
		|ИЗ
		|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
		|ГДЕ
		|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|	И ЕСНСведенияОДоходахППС.Организация = &СписокОтчитывающихсяПодразделений
		|	И ЕСНСведенияОДоходахППС.ФизЛицо В(" + СписокФизлицТекст + ")
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСНСведенияОДоходахППС.ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ),
		|   ЕСНСведенияОДоходахППС.ТарифВзносов,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС,
		|	ВЫРАЗИТЬ(ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод
		|
		|	УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	Период";
		
		ЗапросПоКодамПрофессий = Новый Запрос;
		ЗапросПоКодамПрофессий.УстановитьПараметр("ДокументСсылка" , Ссылка);
		ЗапросПоКодамПрофессий.УстановитьПараметр("СписокОтчитывающихсяПодразделений", ВыборкаПоШапкеДокумента.Организация);
		ЗапросПоКодамПрофессий.УстановитьПараметр("НачалоНП", НачалоГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)); 
		ЗапросПоКодамПрофессий.УстановитьПараметр("КонецНП", КонецКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		ЗапросПоКодамПрофессий.Текст = ДоходыПоКодамПрофессий;
		ПромежуточнаяТаблицаПоКодамПрофессий = ЗапросПоКодамПрофессий.Выполнить().Выгрузить();
		ПромежуточнаяТаблицаПоКодамПрофессий.Свернуть("ФизЛицо, Период, ТарифВзносов, КодППС, ПодКод","ФондППС, ППС");
		//Аверсон СВФР-008366
		
		ПТДопСведОстаже = ПолучитьДанныеДляЗаполненияСтажа(ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ПериодРегистрации);
		//Островская Татьяна 19.06.2013 № 16549
		если Формат(ДатаФормирования,"ДФ=""ММММ""") = "Январь" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Февраль" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Март" Тогда 
			Квартал = 4;
		ИначеЕсли Формат(ДатаФормирования,"ДФ=""ММММ""") = "Апрель" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Май" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Июнь" Тогда 
			Квартал = 1;
		ИначеЕсли Формат(ДатаФормирования,"ДФ=""ММММ""") = "Июль" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Август" или Формат(ДатаФормирования,"ДФ=""ММММ""") = "Сентябрь" Тогда 
			Квартал = 2;
		иначе
			Квартал = 3;
		КонецЕсли;
		Если Год(ДатаФормирования)< 2009 Тогда 
			Сообщить("Год отчетного периода не должен быть меньше 2009 года!");
		КонецЕсли;
		ТекстФайла = Новый ТекстовыйДокумент;
		//Островская Татьяна 19.06.2013 № 16549
		текстФайла.ДобавитьСтроку("ЗГЛВ=1.5=");
		СтрокаПоменять = Врег("<ПАЧК="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)= "", " ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)) +"="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)= ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР))+
		"="+?(СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное) = ""," ",СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное))+"="+Прав(ВыборкаПоШапкеДокумента.Номер,5)+"="+"И="+Квартал+ "="+СтрЗаменить(СокрЛП(Год(ДатаФормирования))," ",""));
		ТекстФайла.ДобавитьСтроку(СтрокаПоменять);
		
		//ТекстФайла.ДобавитьСтроку("ТИПД=ПУ-6=1= = = =>");
		
		//О.Т. Аверсон 08.06.2016 № 1178
		если НазначениеПенсии Тогда
			СтрокаПУ3 = "<ПУ-6=П=";
		ИначеЕсли Корректирующая Тогда 
			СтрокаПУ3 = "<ПУ-6=К=";
		иначе
			СтрокаПУ3 = "<ПУ-6=И=";
		КонецЕсли;
		//О.Т. Аверсон 08.06.2016 № 1178
		
		ТипЗаписиЗамена2   = СтрокаПУ3+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР) = ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)) +"=";
		//ТипЗаписиЗамена2 = "= ="+
		ТекСтрока = 2;
		ИтогДохода = 0;
		ИтогВзнос = 0;
		ИтогУплат = 0;
		
		РаботДоход = 0;
		РаботВзнос = 0;
		
		СтрокаЗамены = 2;
		
		СуммаВсегоПоВзносамГод = 0;
		СуммаВсегоПоВзносам1МКв = 0;
		СуммаВсегоПоВзносам2МКв = 0;
		СуммаВсегоПоВзносам3МКв = 0;
		
		Пока ВыборкаПоРаботникиОрганизации.Следующий()	Цикл
			
			//Аверсон ЕАЕ 26.04.2022 СВФР-008985
			
			ТЗНЧСЛ = Новый ТаблицаЗначений;
			ТЗНЧСЛ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
			ТЗНЧСЛ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
			ТЗНЧСЛ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
			ТЗНЧСЛ.Колонки.Добавить("ПодКод", Новый ОписаниеТипов("Строка")); //СВФР-008985
			ТЗНЧСЛ.Колонки.Добавить("КодППС", Новый ОписаниеТипов("Число"));
			
			ТЗСТАЖ = Новый ТаблицаЗначений;
			ТЗСТАЖ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
			ТЗСТАЖ.Колонки.Добавить("ДатаНач", Новый ОписаниеТипов("Дата"));
			ТЗСТАЖ.Колонки.Добавить("ДатаКон", Новый ОписаниеТипов("Дата"));
			ТЗСТАЖ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
			ТЗСТАЖ.Колонки.Добавить("ПодКод", Новый ОписаниеТипов("Строка")); //СВФР-008985
			ТЗСТАЖ.Колонки.Добавить("КодППС", Новый ОписаниеТипов("Число"));
			
			ТЗПУ = Новый ТаблицаЗначений;
			ТЗПУ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
			ТЗПУ.Колонки.Добавить("ДатаНач", Новый ОписаниеТипов("Дата"));
			ТЗПУ.Колонки.Добавить("ДатаКон", Новый ОписаниеТипов("Дата"));
			ТЗПУ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
			ТЗПУ.Колонки.Добавить("ПодКод", Новый ОписаниеТипов("Строка")); //СВФР-008985
			ТЗПУ.Колонки.Добавить("КодППС", Новый ОписаниеТипов("Число"));
			//Аверсон СВФР-008985
			
			//Контроль дубля строк
			ТипЗаписиНач = "НЧСЛ=";
			СтрокиПоРаботнику = ПромежуточнаяТаблица.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо)); 
			Если СтрокиПоРаботнику.Количество()<> 0 тогда
				РаботДоход = 0;
				РаботВзнос = 0;
				ТипЗаписиЗамена=ТипЗаписиЗамена2; 
				//Инициалы должны быть указаны
				Фамилия = ВРег(?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия)));
				Имя = Врег(?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Имя),1)));
				Отчество = Врег(?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество),1)));
				Категория =?(ВыборкаПоРаботникиОрганизации.Категория = "", "01", СокрЛП(ВыборкаПоРаботникиОрганизации.Категория));
				
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТипЗаписиЗамена = ТипЗаписиЗамена+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"=";
				ДанныеСотрудника = ?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"=";
				ТипЗаписиЗамена = ТипЗаписиЗамена + ДанныеСотрудника;
				//Аверсон СВФР-008366
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				НомерДокументаВПачке = 	НомерДокументаВПачке + 1;
				
				НомерДокументаВПачке = НомерДокументаВПачке;
				
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТекстФайла.ДобавитьСтроку(ТипЗаписиЗамена);
				//Аверсон СВФР-008366
				
				ТекСтрока = ТекСтрока+1;
				
				СтрокаЗамены = ТекСтрока;
				ИтогДоходаДляРаботника =0;
				ИтогВзносДляРаботника = 0;
				КоличествоМес = 0;
				ПоследнийМесяцНачисления = Дата(1,1,1);
				ПервыйМесяцНачисления = Дата(1,1,1);
				
				//Аверсон ЕАЕ 26.04.2022 СВФР-008985 комментарий
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТЗНЧСЛ = Новый ТаблицаЗначений;
				//ТЗНЧСЛ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
				//ТЗНЧСЛ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
				//ТЗНЧСЛ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
				//Аверсон СВФР-008366
				//Аверсон СВФР-008985
				
				Для каждого СтрокаМес из СтрокиПоРаботнику цикл
					Если (ЗначениеЗаполнено(СтрокаМес.ФондППС)) Тогда
						Если ПервыйМесяцНачисления = Дата(1,1,1) Тогда 
							ПервыйМесяцНачисления = СтрокаМес.Период;
						КонецЕсли;
						
						ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
						СтрЗар = ?(СтрокаМес.ФондППС = 0, " ", СокрЛП(Строка(Формат(СтрокаМес.ФондППС,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						СтрВзн = ?((СтрокаМес.ППС) = 0, " ", СокрЛП(Строка(Формат(СтрокаМес.ППС,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+Формат(Месяц(СтрокаМес.Период),"ЧГ=0")+"="+СтрЗар+"="+СтрВзн+"="+" =");
						
						//Аверсон ЕАЕ 12.11.2021 СВФР-008366
						НоваяС = ТЗНЧСЛ.Добавить();
						НоваяС.Стр  = СтрокаЗар;
						НоваяС.Период = СтрокаМес.Период;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//Аверсон СВФР-008366
						
						//Аверсон ЕАЕ 27.04.2022 СВФР-008985
						НоваяС.ПодКод = СтрокаМес.ПодКод;
						НоваяС.КодППС = СтрокаМес.КодППС;
						//Аверсон СВФР-008985
						
						ТекСтрока = ТекСтрока+1;
						ТарифВзносов = СтрокаМес.ТарифВзносов;
						ИтогДохода = ИтогДохода + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ФондППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						ИтогВзнос = ИтогВзнос + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						
						РаботДоход = РаботДоход + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ФондППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						РаботВзнос = РаботВзнос + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						
						ИтогДоходаДляРаботника = ИтогДоходаДляРаботника + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ФондППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						ИтогВзносДляРаботника = ИтогВзносДляРаботника + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.ППС, ДатаФормирования);//О.Т. Аверсон 17.03.2016 № 949
						КоличествоМес = КоличествоМес+1;
						ПоследнийМесяцНачисления = КонецМесяца(СтрокаМес.Период);
					КонецЕсли;
				КонецЦикла;
				ДатаФормирования = ПоследнийМесяцНачисления;
				ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
				МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
				ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
				ПоследнийМесяцНачисления1   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
				
				ДатаФормирования = ПервыйМесяцНачисления;
				ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
				МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
				ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
				ПервыйМесяцНачисления1   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
				
				//ТипЗаписиЗамена = ТипЗаписиЗамена+ТарифВзносов +"= ="+ИтогДоходаДляРаботника+"="+ИтогВзносДляРаботника+"=0="+КоличествоМес;
				
				
				ТипЗаписиНач = "СТАЖ=";
				
				//Аверсон ЕАЕ 26.04.2022 СВФР-008985 Комментарий
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТЗСТАЖ = Новый ТаблицаЗначений;
				//ТЗСТАЖ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
				//ТЗСТАЖ.Колонки.Добавить("ДатаНач", Новый ОписаниеТипов("Дата"));
				//ТЗСТАЖ.Колонки.Добавить("ДатаКон", Новый ОписаниеТипов("Дата"));
				//ТЗСТАЖ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
				//Аверсон СВФР-008366
				//Аверсон СВФР-008985
				
				МассивСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо)); 
				
				//СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо)); 
				КоличествоЗаписейОСтаже = 0;
				ПредыдущийВидДейтельности = "";
				ПредыдущееОкончаниеРабот = "";
				ДатаНачалаРабот = "";
				Для каждого СтрокаСтаж из МассивСведенияОСтаже цикл
					Если ЗначениеЗаполнено(СтрокаСтаж.ВидДеятельности) Тогда 
						ЗапросДолжность = Новый Запрос;
						ЗапросДолжность.Текст = 
						"ВЫБРАТЬ
						|	РаботникиОрганизацийСрезПоследних.Должность
						|ИЗ
						|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
						
						ЗапросДолжность.УстановитьПараметр("Период", СтрокаСтаж.ДатаОкончанияРабот);
						ЗапросДолжность.УстановитьПараметр("Сотрудник", СтрокаСтаж.Сотрудник);
						РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
						Пока РезультатДолжность.Следующий() Цикл 
							Должность = РезультатДолжность.Должность;
						КонецЦикла;
						
						
						
						ДатаФормирования = СтрокаСтаж.ДатаНачалаРабот;
						ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						
						ДатаФормирования = СтрокаСтаж.ДатаОкончанияРабот;
						ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						Если ТипЗнч(Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
							КодПрофессии = СтрЗаменить(СокрЛП(Должность.СправочникПрофессий.КодППС)," ","");
							ПодКод = СокрЛП(Должность.СправочникПрофессий.Подкод);
							Если ЗначениеЗаполнено(ПодКод) = 0  Тогда
								ПодКод = " ";
							КонецЕсли;	
						иначеЕсли ТипЗнч(Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
							КодПрофессии = СтрЗаменить(СокрЛП(Должность.СправочникПрофессий.КодОКРБ)," ","");
							ПодКод = СокрЛП(Должность.СправочникПрофессий.Подкод);
							Если ЗначениеЗаполнено(ПодКод) = 0  Тогда
								ПодКод = " ";
							КонецЕсли;	
						иначе
							КодПрофессии = " ";
							ПодКод = " ";
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Должность.КодПроизвПрофессииДолжности.КодДолжностиПрофессий) Тогда 
							КодДолжностиПрофессий = СтрЗаменить(СокрЛП(Должность.КодПроизвПрофессииДолжности.КодДолжностиПрофессий)," ","");
						иначе
							КодДолжностиПрофессий = " ";
						КонецЕсли;
						
						если Должность.КодСостДолжностиВрача1 = Перечисления.КодСоставнойДолжностиВрача1.Начальник Тогда 
							КодСостДолжностиВрача1 = "1";
						иначеесли Должность.КодСостДолжностиВрача1 = Перечисления.КодСоставнойДолжностиВрача1.Заведующий Тогда
							КодСостДолжностиВрача1 = "2";
						иначе
							КодСостДолжностиВрача1 = " ";
						КонецЕсли;
						если Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Отделение Тогда 
							КодСостДолжностиВрача2 = "1";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Лаборатория Тогда 
							КодСостДолжностиВрача2 = "2";							
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Кабинет Тогда 
							КодСостДолжностиВрача2 = "3";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Центр Тогда 
							КодСостДолжностиВрача2 = "4";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Отдел Тогда 
							КодСостДолжностиВрача2 = "5";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.ОтделениеЛаборатории Тогда 
							КодСостДолжностиВрача2 = "6";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.ЖенскаяКонсультация Тогда 
							КодСостДолжностиВрача2 = "7";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Подстанция Тогда 
							КодСостДолжностиВрача2 = "8";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Амбулатория Тогда 
							КодСостДолжностиВрача2 = "9";
						иначеесли Должность.КодСостДолжностиВрача2 = Перечисления.КодСоставнойДолжностиВрача2.Лаборатория Тогда 
							КодСостДолжностиВрача2 = "10";
						иначе
							КодСостДолжностиВрача2 = " ";
						КонецЕсли;
						
						Если ТипЗнч(Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
							СправочникПрофессий = "2";
						ИначеЕсли ТипЗнч(Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
							СправочникПрофессий = "1";
						иначе
							СправочникПрофессий = " ";
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаСтаж.ВидДеятельности) Тогда
							ВидыДеятельностиКод = СтрЗаменить(СокрЛП(СтрокаСтаж.ВидДеятельности)," ","");
						иначе
							ВидыДеятельностиКод = " ";
						КонецЕсли;
						Если ЗначениеЗаполнено(Должность.ДополнительныеСведения11) Тогда
							ДополнительныеСведения11 = СокрЛП(Должность.ДополнительныеСведения11);
						иначе
							ДополнительныеСведения11 = " ";
						КонецЕсли;
						Если ЗначениеЗаполнено(Должность.ДополнительныеСведения12) Тогда
							ДополнительныеСведения12 = СокрЛП(Должность.ДополнительныеСведения12);
						иначе
							ДополнительныеСведения12 = " ";
						КонецЕсли;
						Если ЗначениеЗаполнено(Должность.ДополнительныеСведения21) Тогда
							ДополнительныеСведения21 = СтрЗаменить(СокрЛП(Должность.ДополнительныеСведения21)," ","");
						иначе
							ДополнительныеСведения21 = " ";
						КонецЕсли;
						Если ЗначениеЗаполнено(Должность.ДополнительныеСведения22) Тогда
							ДополнительныеСведения22 = СтрЗаменить(СокрЛП(Должность.ДополнительныеСведения22)," ","");
						иначе
							ДополнительныеСведения22 = " ";
						КонецЕсли;
						
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+?(ПервыйМесяцНачисления > СтрокаСтаж.ДатаНачалаРабот,ПервыйМесяцНачисления1,ДатаНачалаРабот)+"="+?(ПоследнийМесяцНачисления < СтрокаСтаж.ДатаОкончанияРабот и ПоследнийМесяцНачисления <> Дата(1,1,1),ПоследнийМесяцНачисления1,ДатаОкончанияРабот)
						+"="+Прав(Строка(КодПрофессии),5)+"="+ Прав(ПодКод,3)+"="+ КодДолжностиПрофессий+"="+
						КодСостДолжностиВрача1+"="+КодСостДолжностиВрача2+"="+СправочникПрофессий+"="+ВидыДеятельностиКод+"="+ДополнительныеСведения11+"="+ДополнительныеСведения12+"="+ДополнительныеСведения21+"="
						+ДополнительныеСведения22+"=");
						
						
						//Аверсон ЕАЕ 12.11.2021 СВФР-008366
						НоваяС = ТЗСТАЖ.Добавить();
						НоваяС.Стр = СтрокаЗар;
						НоваяС.ДатаНач = ?(ПервыйМесяцНачисления > СтрокаСтаж.ДатаНачалаРабот,ПервыйМесяцНачисления,СтрокаСтаж.ДатаНачалаРабот);
						НоваяС.ДатаКон = ?(ПоследнийМесяцНачисления < СтрокаСтаж.ДатаОкончанияРабот и ПоследнийМесяцНачисления <> Дата(1,1,1),ПоследнийМесяцНачисления,СтрокаСтаж.ДатаОкончанияРабот);
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//Аверсон СВФР-008366
						
						//Аверсон ЕАЕ 27.04.2022 СВФР-008985
						НоваяС.ПодКод = СтрокаСтаж.ПодКод;
						НоваяС.КодППС = СтрокаСтаж.КодППС;
						//Аверсон СВФР-008985
						
						ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	ТипЗаписиЗамена = ТипЗаписиЗамена+НомерДоговора+"="+ДатаДокумента+"= = =";
						//КонецЕсли;
						ПредыдущийВидДейтельности = СтрокаСтаж.ВидДеятельности;
						ПредыдущееОкончаниеРабот = СтрокаСтаж.ДатаОкончанияРабот;
					КонецЕсли;
					
				КонецЦикла;
				//ТипЗаписиЗамена = ТипЗаписиЗамена+"="+КоличествоЗаписейОСтаже+"="+Формат(ДатаФормирования,"ДФ=""дд.ММ.гггг""")+Квартал+
				//Год(ДатаФормирования)+"="+ВыборкаПоРаботникиОрганизации.Телефоны;
				
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТекстФайла.ЗаменитьСтроку(ТекСтрока, ТипЗаписиЗамена);
				//Аверсон СВФР-008366
				
				//Аверсон ЕАЕ 26.04.2022 СВФР-008985
				//СтрокаЗар = СтрокаЗар + ">";
				//ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
				//Аверсон СВФР-008985
				
				Если Категория <> "03" тогда
					//ТипЗаписиЗамена = ТипЗаписиЗамена+" = = = =";//О.Т. Аверсон 03.10.2016 № 1471
				КонецЕсли;
				
				//О.Т. Аверсон 03.10.2016 № 1471	
				ЗапросУплачено = Новый Запрос;
				ЗапросУплачено.Текст = 
				"ВЫБРАТЬ
				|	УплаченоВзносовНаППС.Результат
				|ИЗ
				|	РегистрСведений.УплаченоВзносовНаППС КАК УплаченоВзносовНаППС
				|ГДЕ
				|	УплаченоВзносовНаППС.ФизЛицо = &ФизЛицо
				|	И (УплаченоВзносовНаППС.ПериодС МЕЖДУ &ПериодС И &ПериодС1 ИЛИ &ПериодС МЕЖДУ УплаченоВзносовНаППС.ПериодС И УплаченоВзносовНаППС.ПериодПо)
				|	И УплаченоВзносовНаППС.Организация = &Организация";
				
				ЗапросУплачено.УстановитьПараметр("Организация", Организация);
				ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)); //О.Т.(К) 10.06.2016 НЕ ГОД А КВАРТАЛ
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации));
				ЗапросУплачено.УстановитьПараметр("ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо);				
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();
				УплаченоППС = 0;
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					УплаченоППС = УплаченоППС+РезультатЗапросаУплачено.Результат;
					
				КонецЦикла;
				ИтогУплат = ИтогУплат + ОбщегоНазначения.ОкруглитьЗначение2016(УплаченоППС, ДатаФормирования);
				
				//О.Т. Аверсон 03.10.2016 № 1471
				
				ТипЗаписиЗамена = ВРЕГ(ТипЗаписиЗамена+Формат(ТарифВзносов,"ЧДЦ=1")+"="+" ="+ ?(РаботДоход = 0, " ", СокрЛП(Строка(Формат(РаботДоход,"ЧДЦ=2;ЧГ=0"))))+"="+
				?(РаботВзнос = 0, " ", СокрЛП(Строка(Формат(РаботВзнос,"ЧДЦ=2;ЧГ=0"))))+"="+Строка(Формат(УплаченоППС,"ЧДЦ=2;ЧГ=0"))+"="+Формат(КоличествоМес,"ЧГ=0")+"="+?(КоличествоЗаписейОСтаже=0," ",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже,"ЧГ=0"))))+"="+ДатаЗаполнения+"="+Квартал+"="+Формат(ГОД(ВыборкаПоШапкеДокумента.ПериодРегистрации),"ЧГ=0")
				+"="+СтрЗаменить(?(ВыборкаПоРаботникиОрганизации.Телефоны=""," ",ВыборкаПоРаботникиОрганизации.Телефоны),"-","")+"=");
				
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				//ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, ТипЗаписиЗамена);
				//Аверсон СВФР-008366
				
				//Аверсон ЕАЕ 12.11.2021 СВФР-008366
				СтруктураДанных = Новый Структура;
				
				СтрокиПоРаботникуПоКодамПрофессий = ПромежуточнаяТаблицаПоКодамПрофессий.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо)); 
				
				ПустаяТаблица = ПромежуточнаяТаблицаПоКодамПрофессий.Скопировать();
				ПустаяТаблица.Очистить();
				
				СтруктураДанных.Вставить("ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо);
				СтруктураДанных.Вставить("СтрокиПоРаботнику", СтрокиПоРаботникуПоКодамПрофессий);
				СтруктураДанных.Вставить("УплаченоППС", УплаченоППС);
				СтруктураДанных.Вставить("НачалоСтроки", ТипЗаписиЗамена2);
				СтруктураДанных.Вставить("ДанныеСотрудника", ДанныеСотрудника);
				СтруктураДанных.Вставить("Квартал", Квартал);
				СтруктураДанных.Вставить("ДатаЗаполнения", ДатаЗаполнения);
				СтруктураДанных.Вставить("Год", Формат(ГОД(ВыборкаПоШапкеДокумента.ПериодРегистрации),"ЧГ=0"));
				СтруктураДанных.Вставить("Телефон", СтрЗаменить(?(ВыборкаПоРаботникиОрганизации.Телефоны=""," ",ВыборкаПоРаботникиОрганизации.Телефоны),"-",""));
				СтруктураДанных.Вставить("ПустаяТаблица", ПустаяТаблица);
				
				//Аверсон ЕАЕ 26.04.2022 СВФР-008985 Комментарий
				//ТЗПУ = Неопределено;
				//Аверсон СВФР-008985
				
				Строки_ПУ_6 = ПолучитьСтрокиПУ6(СтруктураДанных, ТекСтрока, ТЗПУ);
				
				
				//ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, Строки_ПУ_6);
				//Аверсон СВФР-008366
				
				ЗапросУплачено.Текст = СтрЗаменить(ЗапросУплачено.Текст,"И (УплаченоВзносовНаППС.ПериодС МЕЖДУ &ПериодС И &ПериодС1 ИЛИ &ПериодС МЕЖДУ УплаченоВзносовНаППС.ПериодС И УплаченоВзносовНаППС.ПериодПо)","И УплаченоВзносовНаППС.Период МЕЖДУ &ПериодС И &ПериодС1");
				ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)); 
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();     				
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					СуммаВсегоПоВзносамГод = СуммаВсегоПоВзносамГод+РезультатЗапросаУплачено.Результат;					
				КонецЦикла;
				
				ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации)); 
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецМесяца(НачалоКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();     				
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					СуммаВсегоПоВзносам1МКв = СуммаВсегоПоВзносам1МКв+РезультатЗапросаУплачено.Результат;					
				КонецЦикла;
				
				ЗапросУплачено.УстановитьПараметр("ПериодС", ДобавитьМесяц(НачалоКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации),1)); 
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецМесяца(ДобавитьМесяц(НачалоКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации),1)));
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();     				
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					СуммаВсегоПоВзносам2МКв = СуммаВсегоПоВзносам2МКв+РезультатЗапросаУплачено.Результат;					
				КонецЦикла;
				
				ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоМесяца(КонецКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации))); 
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецКвартала(ВыборкаПоШапкеДокумента.ПериодРегистрации));
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();     				
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					СуммаВсегоПоВзносам3МКв = СуммаВсегоПоВзносам3МКв+РезультатЗапросаУплачено.Результат;					
				КонецЦикла;
				
				
				
				
			КонецЕсли;
			
			//Аверсон ЕАЕ 12.11.2021 СВФР-008366
			Для Каждого Стр Из ТЗНЧСЛ Цикл
				
				//Аверсон ЕАЕ 27.04.2022 СВФР-008985
				//Прд = Стр.Период;
				ПодКод = Стр.ПодКод;
				КодППС = Стр.КодППС;
				//Аверсон СВФР-008985
				
				Для Каждого С Из ТЗПУ Цикл
					
					//Аверсон ЕАЕ 27.04.2022 СВФР-008985
					//Если Прд >= С.ДатаНач И Прд <= С.ДатаКон Тогда
					Если ПодКод = С.ПодКод И КодППС = С.КодППС Тогда
						//Аверсон СВФР-008985	
						
						Стр.Ключ = С.Ключ;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Для Каждого Стр Из ТЗСТАЖ Цикл
				
				//Аверсон ЕАЕ 27.04.2022 СВФР-008985
				//ДатаНач = Стр.ДатаНач;
				//ДатаКон = Стр.ДатаКон;
				ПодКод = Стр.ПодКод;
				КодППС = Стр.КодППС;
				//Аверсон СВФР-008985
				
				Для Каждого С Из ТЗПУ Цикл
					
					//Аверсон ЕАЕ 27.04.2022 СВФР-008985 
					//Если ДатаНач >= С.ДатаНач И ДатаКон <= С.ДатаКон Тогда
					Если ПодКод = С.ПодКод И КодППС = С.КодППС Тогда
						//Аверсон СВФР-008985	
						
						Стр.Ключ = С.Ключ;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если ТЗНЧСЛ.Количество() > 0 Тогда
				Для Каждого Стр Из ТЗПУ Цикл
					
					//Аверсон ЕАЕ 27.04.2022 СВФР-008985
					//Заполним в строке "ПУ-6" количество записей о стаже
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Ключ", Стр.Ключ);
					НужныеСтрокиСТАЖ = ТЗСТАЖ.НайтиСтроки(СтруктураПоиска);
					КЗС = НужныеСтрокиСТАЖ.Количество(); //КолЗаписейОСтаже
					Если КЗС = 0 Тогда //если нет строк стажа - будет добавлена строка СТАЖ с пустыми значениями
						КЗС = 1;
					КонецЕсли;
					КЗССтр = СокрЛП(КЗС) + "=";
					Стр.Стр = СтрЗаменить(Стр.Стр, "%КолЗаписейОСтаже%", КЗССтр);
					//Аверсон СВФР-008985
					
					ТекстФайла.ДобавитьСтроку(Стр.Стр);
					
					//Аверсон ЕАЕ 27.04.2022 СВФР-008985 Комментарий
					//СтруктураПоиска = Новый Структура;
					//СтруктураПоиска.Вставить("Ключ", Стр.Ключ);
					//Аверсон СВФР-008985
					
					НужныеСтрокиНЧСЛ = ТЗНЧСЛ.НайтиСтроки(СтруктураПоиска);
					Для Каждого Эл Из НужныеСтрокиНЧСЛ Цикл
						ТекстФайла.ДобавитьСтроку(Эл.Стр);	
					КонецЦикла;
					
					//Аверсон ЕАЕ 27.04.2022 СВФР-008985 Комментарий
					//НужныеСтрокиСТАЖ = ТЗСТАЖ.НайтиСтроки(СтруктураПоиска);
					//Аверсон СВФР-008985
					
					Если НужныеСтрокиСТАЖ.Количество() = 0 Тогда
						ПустаяСтрокаСТАЖ = "СТАЖ= = = = = = = = = = = = = =>";
						ТекстФайла.ДобавитьСтроку(ПустаяСтрокаСТАЖ);
						ТекСтрока = ТекСтрока+1;
						Сообщить("У сотрудника " + СокрЛП(ВыборкаПоРаботникиОрганизации.ФизЛицо) + " нет стажа.");
					Иначе
						н = 0;
						Для Каждого Эл Из НужныеСтрокиСТАЖ Цикл
							н = н + 1;
							Если н = НужныеСтрокиСТАЖ.Количество() Тогда
								ДобавляемСтроку = Эл.Стр + ">";
							Иначе
								ДобавляемСтроку = Эл.Стр;
							КонецЕсли;
							ТекстФайла.ДобавитьСтроку(ДобавляемСтроку);	
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//Аверсон СВФР-008366
			
			//Аверсон ЕАЕ 26.04.2022 СВФР-008985
			//ТЗНЧСЛ.Очистить();
			//ТЗСТАЖ.Очистить();
			//ТЗПУ.Очистить();
			//Аверсон СВФР-008985
			
		КонецЦикла; 
		
		
		
		
		СтрокаФайла = "="+ ?(ИтогДохода = 0, " ", СокрЛП(Строка(Формат(ИтогДохода,"ЧДЦ=2;ЧГ=0"))))+"="+
		?(ИтогВзнос = 0, " ", СокрЛП(Строка(Формат(ИтогВзнос,"ЧДЦ=2;ЧГ=0"))))+"="+?(ИтогУплат = 0, " ", СокрЛП(Строка(Формат(ИтогУплат,"ЧДЦ=2;ЧГ=0"))))+"=1="+Строка(СуммаВсегоПоВзносамГод)+"="+Строка(СуммаВсегоПоВзносам1МКв)+
		"=" + Строка(СуммаВсегоПоВзносам2МКв) + "="+Строка(СуммаВсегоПоВзносам3МКв)+ "=>";
		ТекстФайла.ЗаменитьСтроку(2, СтрокаПоменять+СтрокаФайла);
		
		РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
		б = Сред(РабочийКаталог,7);
		в = Найти(б,Символ(34));
		путьИБ = Лев(б, в-1);
		
		Попытка //О.Т. Аверсон 06.02.2018 № 1551 попытка
			ТекстФайла.Записать(путьИБ+"\"+Номер+".txt",КодировкаТекста.ANSI);		
		Исключение
			Путь = "";
			ДиалогФыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			ДиалогФыбораФайла.Фильтр						=	"Файл данных (*)|*";
			ДиалогФыбораФайла.Заголовок						=	"Выберите каталог";
			ДиалогФыбораФайла.ПредварительныйПросмотр		=	Ложь;
			//ДиалогФыбораФайла.Расширение					=	"dbf";
			ДиалогФыбораФайла.ИндексФильтра					=	0;
			ДиалогФыбораФайла.Каталог						=	Путь;
			ДиалогФыбораФайла.ПроверятьСуществованиеФайла	=	Ложь;
			Если ДиалогФыбораФайла.Выбрать() Тогда
				Путь = ДиалогФыбораФайла.Каталог;
			КонецЕсли;
			ТекстФайла.Записать(Путь+"\"+Номер+".txt",КодировкаТекста.ANSI);
		КонецПопытки;
		
		
		
		Возврат ТекстФайла.ПолучитьТекст();
		
	КонецФункции //Островская Татьяна 19.06.2013 № 16549
	
	//Аверсон ЕАЕ 12.11.2021 СВФР-008366
	Функция ПолучитьСтрокиПУ6(СтруктураДанных, ТекСтрока, ТЗПУ)
		СтрокиПУ6 = "";
		
		//Аверсон ЕАЕ 26.04.2022 СВФР-008985 Комментарий
		////Аверсон ЕАЕ 12.11.2021 СВФР-008366
		//ТЗПУ = Новый ТаблицаЗначений;
		//ТЗПУ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"));
		//ТЗПУ.Колонки.Добавить("ДатаНач", Новый ОписаниеТипов("Дата"));
		//ТЗПУ.Колонки.Добавить("ДатаКон", Новый ОписаниеТипов("Дата"));
		//ТЗПУ.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Число"));
		////Аверсон СВФР-008366
		//Аверсон СВФР-008985
		
		ТЗ = СтруктураДанных.ПустаяТаблица;
		Для Каждого Эл Из СтруктураДанных.СтрокиПоРаботнику Цикл
			НоваяСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтр, Эл);
		КонецЦикла;
		
		ТЗКоды = ТЗ.Скопировать();
		ТЗКоды.Свернуть("ТарифВзносов,КодППС,ПодКод", "ФондППС,ППС");
		н = 0; УплаченоППСРаспределили = 0;
		Для Каждого Стр Из ТЗКоды Цикл
			н = н + 1;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ТарифВзносов", Стр.ТарифВзносов);
			СтруктураОтбора.Вставить("КодППС", Стр.КодППС);
			СтруктураОтбора.Вставить("ПодКод", Стр.ПодКод);
			
			НужныеСтроки = ТЗ.НайтиСтроки(СтруктураОтбора);
			НачПериода = '00010101';
			КонПериода = '00010101';
			КоличествоМесяцев = НужныеСтроки.Количество();	
			Если НужныеСтроки.Количество() > 0 Тогда
				НачПериода = НужныеСтроки[0].Период;
				КонПериода = КонецМесяца(НужныеСтроки[КоличествоМесяцев - 1].Период);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
				КоличествоЗаписейОСтаже = ПолучитьКоличествоЗаписейОСтаже(СтруктураДанных.ФизЛицо, НачПериода, КонПериода);
			Иначе
				КоличествоЗаписейОСтаже = 0;
			КонецЕсли;
			
			Коэф = ВРЕГ(Формат(Стр.ТарифВзносов,"ЧДЦ=1"))+"="+" =";
			ФондППС = ?(Стр.ФондППС = 0, " ", ВРЕГ(СокрЛП(Строка(Формат(Стр.ФондППС,"ЧДЦ=2;ЧГ=0")))))+"=";
			ППС = ?(Стр.ППС = 0, " ", ВРЕГ(СокрЛП(Строка(Формат(Стр.ППС,"ЧДЦ=2;ЧГ=0")))))+"=";
			
			УплаченоППСВсего = СтруктураДанных.УплаченоППС;
			ФондППСВсего = ТЗКоды.Итог("ФондППС");
			Если н = ТЗКоды.Количество() Тогда
				УплаченоППСЧасть = УплаченоППСВсего - УплаченоППСРаспределили;	
			Иначе
				Если ФондППСВсего = 0 Тогда
					УплаченоППСЧасть = 0;
				Иначе
					УплаченоППСЧасть = Окр(УплаченоППСВсего * Стр.ФондППС / ФондППСВсего, 2);
				КонецЕсли;
			КонецЕсли;
			
			УплаченоППССтр = ВРЕГ(Строка(Формат(УплаченоППСЧасть,"ЧДЦ=2;ЧГ=0")))+"="; //???
			КолМесяцев = Формат(КоличествоМесяцев,"ЧГ=0")+"=";
			
			//Аверсон ЕАЕ 27.04.2022 СВФР-008985 заполним позже 
			//КолЗаписейОСтаже = ?(КоличествоЗаписейОСтаже=0," ",ВРЕГ(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже,"ЧГ=0")))))+"="; //???
			КолЗаписейОСтаже = "%КолЗаписейОСтаже%";
			//Аверсон СВФР-008985
			
			ДатаЗаполнения = СтруктураДанных.ДатаЗаполнения + "=";
			Квартал = СокрЛП(СтруктураДанных.Квартал) + "=";
			Год = СтруктураДанных.Год + "=";
			Телефон = СтруктураДанных.Телефон + "=";
			
			СтрокиПУ6 = СтрокиПУ6 + ?(СтрокиПУ6 <> "", Символы.ПС, "") + СтруктураДанных.НачалоСтроки + СтруктураДанных.ДанныеСотрудника + Коэф + 
			ФондППС + ППС + УплаченоППССтр + КолМесяцев + КолЗаписейОСтаже + ДатаЗаполнения + Квартал + Год + Телефон;
			
			//Аверсон ЕАЕ 12.11.2021 СВФР-008366
			НоваяС = ТЗПУ.Добавить();
			НоваяС.Стр = СтруктураДанных.НачалоСтроки + СтруктураДанных.ДанныеСотрудника + Коэф + 
			ФондППС + ППС + УплаченоППССтр + КолМесяцев + КолЗаписейОСтаже + ДатаЗаполнения + Квартал + Год + Телефон;
			НоваяС.ДатаНач = НачПериода;
			НоваяС.ДатаКон = КонПериода;
			НоваяС.Ключ = н;
			//Аверсон СВФР-008366
			
			//Аверсон ЕАЕ 27.04.2022 СВФР-008985
			НоваяС.ПодКод = Стр.ПодКод;
			НоваяС.КодППС = Стр.КодППС;
			//Аверсон СВФР-008985
			
			Если н > 1 Тогда
				ТекСтрока = ТекСтрока + 1;
			КонецЕсли;
			
			УплаченоППСРаспределили = УплаченоППСРаспределили + УплаченоППСЧасть;
		КонецЦикла;
		Возврат СтрокиПУ6;
		
	КонецФункции
	
	Функция ПолучитьКоличествоЗаписейОСтаже(ФизЛицо,Нач,Кон)
		КолЗаписей = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(1) КАК КолЗаписей
		|ИЗ
		|	Документ.СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУ.СведенияОСтаже КАК СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУСведенияОСтаже
		|ГДЕ
		|	СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУСведенияОСтаже.ДатаНачалаРабот МЕЖДУ &Нач И &Кон
		|	И СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУСведенияОСтаже.ДатаОкончанияРабот МЕЖДУ &Нач И &Кон
		|	И СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУСведенияОСтаже.Ссылка = &Ссылка
		|	И СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУСведенияОСтаже.ФизЛицо = &ФизЛицо";
		
		Запрос.УстановитьПараметр("Кон", Кон);
		Запрос.УстановитьПараметр("Нач", Нач);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			КолЗаписей = ВыборкаДетальныеЗаписи.КолЗаписей;
		КонецЕсли;
		
		Возврат КолЗаписей;
	КонецФункции
	//Аверсон СВФР-008366
	
	Функция ПолучитьДанныеДляЗаполненияСтажа(Организация, Год) Экспорт
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		Запрос.УстановитьПараметр("НачалоНП", НачалоГода(Год));
		Запрос.УстановитьПараметр("КонецНП", КонецГода(Год));
		
		СписокФизлицТекст = "ВЫБРАТЬ 
		|	ТЧРаботникиОрганизации.ФизЛицо
		|ИЗ
		|	Документ.СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		//Островская Татьяна 19.06.2013 № 16549					
		ЗапросТекст = 
		"ВЫБРАТЬ
		|	РасчетППСОтработанноеВремя.Должность КАК Должность,
		|	РасчетППСОтработанноеВремя.ФизЛицо КАК ФизЛицо,
		|	РасчетППСОтработанноеВремя.ВидДеятельности КАК ВидДейтельности,
		|	РасчетППСОтработанноеВремя.Ссылка.Номер КАК НомерДокумента,
		|	РасчетППСОтработанноеВремя.Ссылка.Дата КАК ДатаДокумента,
		|	МАКСИМУМ(РасчетППСОтработанноеВремя.Дата) КАК ОкончаниеРабот,
		|	МИНИМУМ(РасчетППСОтработанноеВремя.Дата) КАК НачалоРабот,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача1 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача1.Начальник)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ДолжностьКодСостДолжностиВрача1,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Отделение)
		|			ТОГДА 1
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Кабинет)
		|			ТОГДА 3
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Центр)
		|			ТОГДА 4
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Отдел)
		|			ТОГДА 5
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.ОтделениеЛаборатории)
		|			ТОГДА 6
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.ЖенскаяКонсультация)
		|			ТОГДА 7
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Подстанция)
		|			ТОГДА 8
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Амбулатория)
		|			ТОГДА 9
		|	КОНЕЦ КАК ДолжностьКодСостДолжностиВрача2,
		|	РасчетППСОтработанноеВремя.Должность.КодПроизвПрофессииДолжности.Код,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.Ссылка ССЫЛКА Справочник.ОКРБ
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК СправочникПрофессий,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.Ссылка ССЫЛКА Справочник.ППС
		|			ТОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.ПодКод
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПодКод
		|ИЗ
		|	Документ.РасчетППС.ОтработанноеВремя КАК РасчетППСОтработанноеВремя
		|ГДЕ
		|	РасчетППСОтработанноеВремя.ФизЛицо В
		|			("+СписокФизлицТекст+")
		|	И РасчетППСОтработанноеВремя.Ссылка.ПериодРегистрации МЕЖДУ &НачалоНП И &КонецНП
		|	И РасчетППСОтработанноеВремя.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетППСОтработанноеВремя.ВидДеятельности,
		|	РасчетППСОтработанноеВремя.Ссылка.Номер,
		|	РасчетППСОтработанноеВремя.Ссылка.Дата,
		|	РасчетППСОтработанноеВремя.ФизЛицо,
		|	РасчетППСОтработанноеВремя.Должность,
		|	РасчетППСОтработанноеВремя.Группа,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача1 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача1.Начальник)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Отделение)
		|			ТОГДА 1
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Кабинет)
		|			ТОГДА 3
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Центр)
		|			ТОГДА 4
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Отдел)
		|			ТОГДА 5
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.ОтделениеЛаборатории)
		|			ТОГДА 6
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.ЖенскаяКонсультация)
		|			ТОГДА 7
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Подстанция)
		|			ТОГДА 8
		|		КОГДА РасчетППСОтработанноеВремя.Должность.КодСостДолжностиВрача2 = ЗНАЧЕНИЕ(перечисление.КодСоставнойДолжностиВрача2.Амбулатория)
		|			ТОГДА 9
		|	КОНЕЦ,
		|	РасчетППСОтработанноеВремя.Должность.КодПроизвПрофессииДолжности.Код,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.Ссылка ССЫЛКА Справочник.ОКРБ
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.Ссылка ССЫЛКА Справочник.ППС
		|			ТОГДА РасчетППСОтработанноеВремя.Должность.СправочникПрофессий.ПодКод
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	ВидДейтельности,
		|	Должность,
		|	НачалоРабот";
		//Островская Татьяна 19.06.2013 № 16549
		//	" + СписокФизлицТекст + "
		Запрос.Текст = ЗапросТекст;
		ТаблицаСтажа = Запрос.Выполнить().Выгрузить();
		
		// Удалим из таблицы стажа незначимые записи:
		//  - если по физлицу имеется 2 непрерывных записи с одинаковыми условиями труда, то объединим данные записи 
		Н = ТаблицаСтажа.Количество() - 1;
		Пока Н > 0 Цикл
			
			ТекущаяЗапись = ТаблицаСтажа[Н];
			ПредшествующаяЗапись = ТаблицаСтажа[Н-1];
			
			Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
				И ((НачалоДня(ТекущаяЗапись.НачалоРабот) = НачалоДня(ПредшествующаяЗапись.ОкончаниеРабот))
				ИЛИ (НачалоДня(ТекущаяЗапись.НачалоРабот-86400) = НачалоДня(ПредшествующаяЗапись.ОкончаниеРабот)))// если записи непрерывны (идут друг за другом по времени)
				// и совпадают параметры стажа
				И ТекущаяЗапись.ВидДейтельности = ПредшествующаяЗапись.ВидДейтельности  
				// и должность
				И ТекущаяЗапись.Должность = ПредшествующаяЗапись.Должность  
				Тогда
				// объединим записи в одну
				ПредшествующаяЗапись.ОкончаниеРабот = ТекущаяЗапись.ОкончаниеРабот;
				ТаблицаСтажа.Удалить(ТекущаяЗапись);
			КонецЕсли; 
			Н = Н - 1;	
		КонецЦикла;
		
		ПредшествующееФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		МассивСтрок = Новый Массив;
		СтрокСтажа = 0;
		СтруктураПоиска = Новый Структура("ФизЛицо");
		Н = ТаблицаСтажа.Количество();
		Пока Н > 0 Цикл
			
			ТекущаяЗапись = ТаблицаСтажа[Н - 1];
			
			Если ТекущаяЗапись.ФизЛицо <> ПредшествующееФизЛицо Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущаяЗапись);
				МассивСтрок = ТаблицаСтажа.НайтиСтроки(СтруктураПоиска);
				ПредшествующееФизЛицо = ТекущаяЗапись.ФизЛицо;
			КонецЕсли; 
			
			СтрокСтажа = МассивСтрок.Количество();
			
			НачалоРабот = ТекущаяЗапись.НачалоРабот;
			ОкончаниеРабот = ТекущаяЗапись.ОкончаниеРабот;
			
			Для Сч = 1 По СтрокСтажа Цикл
				СтрокаСтажа = МассивСтрок[СтрокСтажа - Сч];
				Если СтрокаСтажа.ВидДейтельности = "ДЕТИ" тогда
					
					Если НачалоРабот = СтрокаСтажа.НачалоРабот И ТекущаяЗапись.ВидДейтельности <> "ДЕТИ" тогда
						ТекущаяЗапись.НачалоРабот = НачалоДня(СтрокаСтажа.ОкончаниеРабот + 1);
					КонецЕсли;
					
					Если НачалоРабот < СтрокаСтажа.НачалоРабот Тогда
						Если ОкончаниеРабот > СтрокаСтажа.ОкончаниеРабот Тогда
							НоваяСтрока = ТаблицаСтажа.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяЗапись);
							НоваяСтрока.НачалоРабот = КонецДня(СтрокаСтажа.ОкончаниеРабот) + 1;
							НоваяСтрока.ОкончаниеРабот = ОкончаниеРабот;
							ТекущаяЗапись.ОкончаниеРабот = НачалоДня(СтрокаСтажа.НачалоРабот) -1;
							
							
						КонецЕсли;
					КонецЕсли;		
					
					Если ОкончаниеРабот = СтрокаСтажа.ОкончаниеРабот И ТекущаяЗапись.ВидДейтельности <> "ДЕТИ" тогда
						ТекущаяЗапись.ОкончаниеРабот = НачалоДня(СтрокаСтажа.НачалоРабот - 1);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;				
			Н = Н - 1;	
		КонецЦикла;
		
		ТаблицаСтажа.Сортировать("ФизЛицо,НачалоРабот,ВидДейтельности");	
		
		Возврат ТаблицаСтажа;
		
	КонецФункции
	
	//Процедура вывода файла сведений на печать
	Процедура ПечатьФайла(РежимПечати = 0, МестоВызова = "") Экспорт
		
		ЕстьОшибки = Ложь;
		ТекстФайла = РегламентированнаяОтчетность.ПолучитьТекстФайла(ЭтотОбъект,ЕстьОшибки);
		Если ЕстьОшибки тогда
			Возврат;
		КонецЕсли;	 
		
		Макет = ПолучитьМакет("ФормаАДВ_1");
		ДокументРезультат = Новый ТабличныйДокумент;
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_ФормаАДВ_1";
		
		//Получаем таблицу формата записи
		ДокументФорматЗаписей = ПолучитьМакет("ФорматЗаписей");
		ТаблицаФорматаЗаписи = ПроцедурыПерсонифицированогоУчета.ПолучитьФорматЗаписи("АНКТ",ДокументФорматЗаписей);
		
		//Получаем инициализированную структуру, соответствующую формату записи 
		//ПустаяЗапись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		
		//Обработка заголовка файла
		ИнформацияОПачке = Новый Структура;
		Если ПроцедурыПерсонифицированогоУчета.РазобратьЗаголовокФайла(ТекстФайла,ИнформацияОПачке)=0 тогда
			Возврат;
		КонецЕсли;	
		
		//Обработка документов файла
		ОбластьАнкета = Макет.ПолучитьОбласть("Анкета");
		
		Для Н=5 по СтрЧислоСтрок(ТекстФайла) цикл
			//Прочитаем запись из файла
			СтрокаФайла = СтрПолучитьСтроку(ТекстФайла,Н);
			Запись = ПроцедурыПерсонифицированогоУчета.ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
			СтрОшибка = "";
			Если НЕ ПроцедурыПерсонифицированогоУчета.РазложитьСтрокуВСтруктуруЗаписи(СтрокаФайла,"АНКТ",ТаблицаФорматаЗаписи,Запись,СтрОшибка) тогда
				Сообщить("Ошибка в строке файла № "+Н+": "+СтрОшибка);
				Возврат;
			КонецЕсли;	
			
			ОбластьАнкета.Параметры.ДатаЗаполнения					= 	"Дата заполнения "+ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДатаЗаполнения);
			ОбластьАнкета.Параметры.Фамилия 						= Запись.Фамилия; 
			ОбластьАнкета.Параметры.Имя 							= Запись.Имя; 
			ОбластьАнкета.Параметры.Отчество 						= Запись.Отчество; 
			ОбластьАнкета.Параметры.Пол 							= Запись.Пол+"     (м/ж)"; 
			ОбластьАнкета.Параметры.ДатаРождения 					= ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.СтандартнаяДатаРождения); 
			
			//Место рождения
			ОбластьАнкета.Параметры.МестоРожденияТип 				= 	?(Запись.ТипМестаРождения = "ОСОБОЕ", "особое", "");
			ОбластьАнкета.Параметры.МестоРожденияГород 				= 	Запись.МестоРожденияНаселенныйПункт;
			ОбластьАнкета.Параметры.МестоРожденияРайон 				= 	Запись.МестоРожденияРайон;
			ОбластьАнкета.Параметры.МестоРожденияОбласть			= 	Запись.МестоРожденияОбласть;
			ОбластьАнкета.Параметры.МестоРожденияСтрана			 	= 	Запись.МестоРожденияСтрана;
			
			ОбластьАнкета.Параметры.Гражданство 					= 	Запись.Гражданство;
			
			//Паспортные данные
			НаименованиеДокумента 									= 	Запись.ДокументНаименование;
			Серия1 													= 	Запись.ДокументСерияРимскиеЦифры;
			Серия2 													= 	Запись.ДокументСерияРусскиеБуквы;
			
			СерияНомер = Серия1 +?( СокрЛП(НаименованиеДокумента) 	= ВРЕГ("паспорт РБ"), " ", ?( СокрЛП(НаименованиеДокумента) = ВРЕГ("паспорт"), "-", "") ) + Серия2 +",  " + Формат(Запись.ДокументНомер,"ЧГ=0");
			
			ОбластьАнкета.Параметры.НаименованиеДокумента		= 	НаименованиеДокумента;
			ОбластьАнкета.Параметры.СерияНомер			 		= 	СерияНомер;
			ОбластьАнкета.Параметры.ДатаВыдачи 					= 	ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДокументДатаВыдачи);
			ОбластьАнкета.Параметры.КемВыдан 					= 	Запись.ДокументКемВыдан;
			
			//Адреса
			ОбластьАнкета.Параметры.АдресРегистрации 			=	ПроцедурыПерсонифицированогоУчета.ПредставлениеАдресадляПФР(Запись.АдресРегистрации,0,"");
			ОбластьАнкета.Параметры.АдресФактический 			= 	ПроцедурыПерсонифицированогоУчета.ПредставлениеАдресадляПФР(Запись.АдресФактический,0,"");
			ОбластьАнкета.Параметры.Телефоны 					= 	Запись.Телефоны;
			
			ДокументРезультат.Вывести(ОбластьАнкета);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		РаботаСДиалогами.НапечататьДокумент(ДокументРезультат,1,Ложь,"Анкета застрахованного лица АДВ-1");
		
		//Печать описи документов
		ДокументОписи = Новый ТабличныйДокумент;
		ДокументОписи.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_АДВ_6";
		ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,Дата,Ответственный.ФизЛицо);
		ПроцедурыПерсонифицированогоУчета.ВывестиОписьАДВ6(ДокументОписи,ИнформацияОПачке,ОтветственныеЛица);
		РаботаСДиалогами.НапечататьДокумент(ДокументОписи,1,Ложь,"Опись документов АДВ-6");
	КонецПроцедуры
	
#КонецЕсли

//ПСА 21.09.2021 СВФР-008045 +++
Процедура ЗаполнитьСведенияОСтажеВзносахПоРаботнику(ВыбФизЛицо) Экспорт
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ФизЛицо", ВыбФизЛицо);
	НайденныеСтроки = СведенияОСтаже.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ ИЗ НайденныеСтроки Цикл
		СведенияОСтаже.Удалить(СтрокаТЧ);
	КонецЦикла;	
	НайденныеСтроки = СведенияОВзносах.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ ИЗ НайденныеСтроки Цикл
		СведенияОВзносах.Удалить(СтрокаТЧ);
	КонецЦикла;	
	
	ТаблицаСведенияОСтаже = новый ТаблицаЗначений;
	ТаблицаСведенияОСтаже.Колонки.Добавить("Сотрудник");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ФизЛицо");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДатаНачалаРабот");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДатаОкончанияРабот");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ВидДеятельности");
	//О.Т. Аверсон 26.05.2017 № 673
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДопСведения1");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ДопСведения2");
	//О.Т. Аверсон 26.05.2017 № 673
	ТаблицаСведенияОСтаже.Колонки.Добавить("Категория");
	
	//Аверсон ЕАЕ 08.01.2022 СВФР-008552
	ТаблицаСведенияОСтаже.Колонки.Добавить("КодППС");
	ТаблицаСведенияОСтаже.Колонки.Добавить("ПодКод");
	//Аверсон СВФР-008552
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизаций.Сотрудник КАК Ссылка,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК Физлицо
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.Сотрудник.Физлицо = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", ВыбФизЛицо);
	
	СписокСотрудников = ЗАпрос.Выполнить().Выгрузить();
	
	СписокСотрНов = Новый СписокЗначений;
	СписокФизЛицНов = Новый СписокЗначений;
	СписокФизЛицНов.Добавить(ВыбФизЛицо);
	МассивСписок = СписокСотрудников.НайтиСтроки(Новый Структура("ФизЛицо",ВыбФизЛицо));
	
	//Аверсон ЕАЕ 12.05.2025 СВФР-015630
	//Если МассивСписок.Количество()>0 Тогда 
	//	СписокСотрНов.Добавить(МассивСписок[0].Ссылка);
	//КонецЕсли;
	Для Каждого Эл Из МассивСписок Цикл
		СписокСотрНов.Добавить(Эл.Ссылка);	
	КонецЦикла;
	//Аверсон СВФР-015630
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСНСведенияОДоходахППС.ФизЛицо,
	|	ЕСНСведенияОДоходахППС.Период,
	|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов,
	|	ЕСНСведенияОДоходахППС.ФондППС,
	|	ЕСНСведенияОДоходахППС.ППС,
	|	ЕСНСведенияОДоходахППС.ТарифВзносов,
	|	ЕСНСведенияОДоходахППС.ВидДеятельности
	|ИЗ
	|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
	|ГДЕ
	|	ЕСНСведенияОДоходахППС.Период МЕЖДУ &Период И &Период1
	|	И ЕСНСведенияОДоходахППС.ФизЛицо В(&СписокФизЛиц)";
	Запрос.УстановитьПараметр("Период", НачалоГода(ДатаРегистрации)); //О.Т. Аверсон 19.06.2017 № 735 (не квартал а год!) 
	Запрос.УстановитьПараметр("Период1", КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛицНов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Аверсон ЕАЕ 28.11.2021 СВФР-008371
	ТЗСведенияОВзносах = СведенияОВзносах.Выгрузить();
	ТЗСведенияОВзносах.Очистить();
	
	Для к = 1 По 3 Цикл
		Если к = 1 Тогда
			ИмяКолонки = "Выплаты";
		ИначеЕсли к = 2 Тогда
			ИмяКолонки = "Пособия";
		Иначе
			ИмяКолонки = "Взносы";
		КонецЕсли;
		Колонка = ТЗСведенияОВзносах.Колонки.Найти(ИмяКолонки);
		ТЗСведенияОВзносах.Колонки.Удалить(Колонка);
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		МассивТипов = новый Массив;
		МассивТипов.Добавить(Тип("Число"));        
		ТЗСведенияОВзносах.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов(МассивТипов,,,КЧ));
	КонецЦикла;
	//Аверсон СВФР-008371
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Аверсон ЕАЕ 28.11.2021 СВФР-008371
		//СтрСведенияОВзносах = СведенияОВзносах.Добавить();
		СтрСведенияОВзносах = ТЗСведенияОВзносах.Добавить();
		//Аверсон СВФР-008371
		
		СотрудникВзн = "";
		МассивСписок = СписокСотрудников.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаДетальныеЗаписи.ФизЛицо));
		Если МассивСписок.Количество()>0 Тогда 
			СотрудникВзн = МассивСписок[0].Ссылка;
		КонецЕсли;
		СтрСведенияОВзносах.Сотрудник = СотрудникВзн;
		СтрСведенияОВзносах.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
		//ПСА 08-12-2020 СВФР-006829 +++
		//СтрСведенияОВзносах.Месяц = ВыборкаДетальныеЗаписи.Период;
		СтрСведенияОВзносах.Месяц = ВыборкаДетальныеЗаписи.ПериодВзаиморасчетов;
		//+++ПСА 08-12-2020 СВФР-006829
		СтрСведенияОВзносах.Выплаты = ВыборкаДетальныеЗаписи.ФондППС;
		СтрСведенияОВзносах.Взносы = ВыборкаДетальныеЗаписи.ППС;
		СтрСведенияОВзносах.ТарифВзносов = ВыборкаДетальныеЗаписи.ТарифВзносов;		
		СтрСведенияОВзносах.Категория = ВыборкаДетальныеЗаписи.ФизЛицо.СтатусКатегория;
		
	КонецЦикла;
	//ПСА 08-12-2020 СВФР-006829 +++
	
	//Аверсон ЕАЕ 28.11.2021 СВФР-008371
	//СведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов, Сотрудник,Договор,Категория, ВидДоговора","Выплаты,Пособия,Взносы");
	ТЗСведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов, Сотрудник,Договор,Категория, ВидДоговора","Выплаты,Пособия,Взносы");
	//Аверсон СВФР-008371
	
	//Аверсон ЕАЕ 28.11.2021 СВФР-008371
	Для Каждого Стр Из ТЗСведенияОВзносах Цикл
		НоваяСтр = СведенияОВзносах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, Стр);
	КонецЦикла;
	//Аверсон СВФР-008371
	
	//+++ПСА 08-12-2020 СВФР-006829
	ТаблицаИсключений = СформироватьТаблицуЗаработка(СписокФизЛицНов);
	
	НачалоКварталаД = НачалоГода(ДатаРегистрации);
	КонецКварталаД = КонецКвартала(ДатаРегистрации);
	ТЗСведенияОСтаже = Новый ТаблицаЗначений;
	ТЗСведенияОСтаже.Колонки.Добавить("ТабНомер");
	ТЗСведенияОСтаже.Колонки.Добавить("Сотрудник");
	ТЗСведенияОСтаже.Колонки.Добавить("Период");
	ТЗСведенияОСтаже.Колонки.Добавить("ВидДеятельности");
	//О.Т. Аверсон 26.05.2017 № 673
	ТЗСведенияОСтаже.Колонки.Добавить("ДопСведения1");
	ТЗСведенияОСтаже.Колонки.Добавить("ДопСведения2");
	//О.Т. Аверсон 26.05.2017 № 673
	
	//Аверсон ЕАЕ 08.01.2022 СВФР-008552
	ТЗСведенияОСтаже.Колонки.Добавить("КодППС");
	ТЗСведенияОСтаже.Колонки.Добавить("ПодКод");
	//Аверсон СВФР-008552
	
	Пока НачалоКварталаД <= КонецКварталаД Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизаций.Период < &Период
		|			ТОГДА &Период
		|		ИНАЧЕ РаботникиОрганизаций.Период
		|	КОНЕЦ КАК Период,
		|	РаботникиОрганизаций.ВидДеятельностиИзмерение,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения11 как ДополнительныеСведения11,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения21 как ДополнительныеСведения21,
		
		//Аверсон ЕАЕ 08.01.2022 СВФР-008552
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
		//Аверсон СВФР-008552
		
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)";
		
		Запрос.УстановитьПараметр("Период", НачалоКварталаД); 
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрНов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗапросУв = Новый Запрос;
			ЗапросУв.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУв.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			ЗапросУв.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			
			РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()> 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			//Аверсон ЕАЕ 28.07.2021 СВФР-007922
			//Проверка на вид деятельности
			//ЗапросППС = Новый Запрос;
			//ЗапросППС.Текст = 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
			//|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
			//|ПОМЕСТИТЬ ВТДопДанные
			//|ИЗ
			//|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ДополнительныеДанныеДляППССрезПоследних
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Период
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод
			//|ПОМЕСТИТЬ ВТМаксПериоды
			//|ИЗ
			//|	ВТДопДанные КАК ВТДопДанные
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	МаксПериод
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ВТМаксПериоды.МаксПериод КАК Период,
			//|	ВТДопДанные.ВидДеятельности
			//|ИЗ
			//|	ВТМаксПериоды КАК ВТМаксПериоды
			//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
			//|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
			//|ГДЕ
			//|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6
			//|";
			//
			//ЗапросППС.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			//ЗапросППС.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			//
			//РезультатЗапросаППС = ЗапросППС.Выполнить();
			//Если РезультатЗапросаППС.Пустой() Тогда 
			//	Продолжить;
			//КонецЕсли;
			//Аверсон СВФР-007922
			
			СтрТЗСведенияОСтаже = ТЗСведенияОСтаже.Добавить();
			СтрТЗСведенияОСтаже.Сотрудник =ВыборкаДетальныеЗаписи.Сотрудник;
			СтрТЗСведенияОСтаже.ТабНомер =ВыборкаДетальныеЗаписи.Сотрудник.Код;
			СтрТЗСведенияОСтаже.Период =ВыборкаДетальныеЗаписи.Период;
			
			//Аверсон ЕАЕ 15.03.2021 СВФР-007269
			СтрТЗСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			Если НЕ ЗначениеЗаполнено(СтрТЗСведенияОСтаже.ВидДеятельности) Тогда
				СтрТЗСведенияОСтаже.ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			КонецЕсли;	
			//Аверсон СВФР-007269
			
			//О.Т. Аверсон 26.05.2017 № 673
			СтрТЗСведенияОСтаже.ДопСведения1 = ВыборкаДетальныеЗаписи.ДополнительныеСведения11;
			СтрТЗСведенияОСтаже.ДопСведения2 = ВыборкаДетальныеЗаписи.ДополнительныеСведения21;
			//О.Т. Аверсон 26.05.2017 № 673
			
			//Аверсон ЕАЕ 01.08.2022 СВФР-008552
			СтрТЗСведенияОСтаже.КодППС = ВыборкаДетальныеЗаписи.КодППС;
			СтрТЗСведенияОСтаже.ПодКод = ВыборкаДетальныеЗаписи.ПодКод;
			//Аверсон СВФР-008552
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.ВидДеятельностиИзмерение,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения11 как ДополнительныеСведения11,
		|	РаботникиОрганизаций.Должность.ДополнительныеСведения21 как ДополнительныеСведения21,
		
		//Аверсон ЕАЕ 08.01.2022 СВФР-008552
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).КодППС КАК КодППС,
		|	ВЫРАЗИТЬ(РаботникиОрганизаций.Должность.СправочникПрофессий КАК Справочник.ППС).ПодКод КАК ПодКод
		//Аверсон СВФР-008552
		
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Сотрудник В(&СписокСотрудников)
		|	И РаботникиОрганизаций.Период между &Период и &Период1";
		
		Запрос.УстановитьПараметр("Период", НачалоКварталаД+86400); 
		Запрос.УстановитьПараметр("Период1", КонецМесяца(НачалоКварталаД));
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрНов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗапросУв = Новый Запрос;
			ЗапросУв.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУв.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			ЗапросУв.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			
			РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
			Если РезультатЗапроса.Количество()> 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			//Аверсон ЕАЕ 28.07.2021 СВФР-007922
			//Проверка на вид деятельности
			//ЗапросППС = Новый Запрос;
			//ЗапросППС.Текст = 
			//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
			//|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
			//|ПОМЕСТИТЬ ВТДопДанные
			//|ИЗ
			//|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ДополнительныеДанныеДляППССрезПоследних
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Период
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			//|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод
			//|ПОМЕСТИТЬ ВТМаксПериоды
			//|ИЗ
			//|	ВТДопДанные КАК ВТДопДанные
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	МаксПериод
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	ВТМаксПериоды.МаксПериод КАК Период,
			//|	ВТДопДанные.ВидДеятельности
			//|ИЗ
			//|	ВТМаксПериоды КАК ВТМаксПериоды
			//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
			//|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
			//|ГДЕ
			//|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6";
			//
			//ЗапросППС.УстановитьПараметр("Период", ВыборкаДетальныеЗаписи.Период);
			//ЗапросППС.УстановитьПараметр("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			//
			//РезультатЗапросаППС = ЗапросППС.Выполнить();
			//Если РезультатЗапросаППС.Пустой() Тогда 
			//	Продолжить;
			//КонецЕсли;
			//Аверсон СВФР-007922
			
			//Аверсон ЕАЕ 17.11.2021 СВФР-008371
			ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			Если НЕ ЗначениеЗаполнено(ВидДеятельности) Тогда
				ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			СтруктураПоиска.Вставить("Период", НачалоМесяца(ВыборкаДетальныеЗаписи.Период));
			СтруктураПоиска.Вставить("ВидДеятельности", ВидДеятельности);
			ПериодыСтаж = ТЗСведенияОСтаже.НайтиСтроки(СтруктураПоиска);
			Если ПериодыСтаж.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			//Если ВидДеятельности = ПредыдущийВидДеятельности Тогда
			//	Продолжить;
			//КонецЕсли;
			//Аверсон СВФР-008371
			
			СтрТЗСведенияОСтаже = ТЗСведенияОСтаже.Добавить();
			СтрТЗСведенияОСтаже.Сотрудник =ВыборкаДетальныеЗаписи.Сотрудник; 
			СтрТЗСведенияОСтаже.ТабНомер =ВыборкаДетальныеЗаписи.Сотрудник.Код;
			СтрТЗСведенияОСтаже.Период =ВыборкаДетальныеЗаписи.Период;
			
			//Аверсон ЕАЕ 17.11.2021 СВФР-008371
			////Аверсон ЕАЕ 15.03.2021 СВФР-007269
			//СтрТЗСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельности(ВыборкаДетальныеЗаписи.Сотрудник, ВыборкаДетальныеЗаписи.Период);
			//Если НЕ ЗначениеЗаполнено(СтрТЗСведенияОСтаже.ВидДеятельности) Тогда
			//	СтрТЗСведенияОСтаже.ВидДеятельности = ВыборкаДетальныеЗаписи.ВидДеятельностиИзмерение;
			//КонецЕсли;	
			////Аверсон ЕАЕ 15.03.2021 СВФР-007269
			СтрТЗСведенияОСтаже.ВидДеятельности = ВидДеятельности;
			//Аверсон СВФР-008371
			
			//О.Т. Аверсон 26.05.2017 № 673
			СтрТЗСведенияОСтаже.ДопСведения1 = ВыборкаДетальныеЗаписи.ДополнительныеСведения11;
			СтрТЗСведенияОСтаже.ДопСведения2 = ВыборкаДетальныеЗаписи.ДополнительныеСведения21;
			//О.Т. Аверсон 26.05.2017 № 673
			
			//Аверсон ЕАЕ 01.08.2022 СВФР-008552
			СтрТЗСведенияОСтаже.КодППС = ВыборкаДетальныеЗаписи.КодППС;
			СтрТЗСведенияОСтаже.ПодКод = ВыборкаДетальныеЗаписи.ПодКод;
			//Аверсон СВФР-008552
		КонецЦикла;
		
		
		
		НачалоКварталаД = ДобавитьМесяц(НачалоКварталаД,1);
	КонецЦикла;
	ТЗСведенияОСтаже.Сортировать("ТабНомер,Период");
	
	//Аверсон ЕАЕ 17.11.2021 СВФР-008371
	//дополним таблицу исключений периодами, когда сотрудник работал в неподходящем для пу6 виде деятельности
	ДополнитьТаблицуИсключений(ТаблицаИсключений, ТЗСведенияОСтаже);
	//Аверсон СВФР-008371
	
	СтрСведенияОСтаже = ТаблицаСведенияОСтаже;
	СотрудникПрошл = "";
	ЕстьИсклПоПериоду = Ложь;
	Для Каждого Стр из ТЗСведенияОСтаже Цикл 
		ТаблицаИсключений1 = ТаблицаИсключений.НайтиСтроки(Новый Структура("ФизЛицо,Сотрудник",Стр.Сотрудник.ФизЛицо,Стр.Сотрудник));
		Если СотрудникПрошл = Стр.Сотрудник Тогда 
			Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда
				Если СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности и СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1 и СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2 
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					И СтрСведенияОСтаже.КодППС = Стр.КодППС И СтрСведенияОСтаже.ПодКод = Стр.ПодКод
					//Аверсон СВФР-008552
					
					Тогда 
					Если НачалоМесяца(СтрСведенияОСтаже.ДатаНачалаРабот) = НачалоМесяца(Стр.Период) Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = Стр.Период-1;
					КонецЕсли;
					
					Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) = Стр.Период-1 или НачалоДня(СтрСведенияОСтаже.ДатаОкончанияРабот) = НачалоДня(Стр.Период) Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					иначе
						СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
						СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
						СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
						СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
						СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
						СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
						//О.Т. Аверсон 26.05.2017 № 673
						СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
						СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
						//О.Т. Аверсон 26.05.2017 № 673
						СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
						
						//Аверсон ЕАЕ 15.11.2021 СВФР-008371
						СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
						//Аверсон СВФР-008371
						
						
						//Аверсон ЕАЕ 08.01.2022 СВФР-008552
						СтрСведенияОСтаже.КодППС = Стр.КодППС;
						СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
						//Аверсон СВФР-008552
					КонецЕсли;
				иначе
					Если Стр.Период-1<= СтрСведенияОСтаже.ДатаОкончанияРабот и СтрСведенияОСтаже.ДатаНачалаРабот < Стр.Период-1 Тогда 
						СтрСведенияОСтаже.ДатаОкончанияРабот = Стр.Период-1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ЕстьИсклПоПериоду = Ложь;
			для Каждого стрИскл из ТаблицаИсключений1 Цикл 
				Если не (Стр.Период >= стрИскл.ДатаНачала и Стр.Период <= стрИскл.ДатаКонец) и не (стрИскл.ДатаНачала >= Стр.Период и стрИскл.ДатаНачала <= КонецМесяца(Стр.Период)) Тогда 
					Продолжить;
				КонецЕсли;
				Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0 Тогда 
					СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
					СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
					СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
					СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
					СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;//О.Т. Аверсон 26.05.2017 № 673
					СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2; //О.Т. Аверсон 26.05.2017 № 673   					
					СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
					
					//Аверсон ЕАЕ 15.11.2021 СВФР-008371
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					//Аверсон СВФР-008371
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					СтрСведенияОСтаже.КодППС = Стр.КодППС;
					СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
					//Аверсон СВФР-008552
					
				КонецЕсли;
				ПропускатьСтроку = Ложь;
				для Каждого стрИсклПроверка из ТаблицаИсключений1 Цикл
					Если  стрИскл.ДатаНачала > стрИсклПроверка.ДатаНачала и стрИскл.ДатаНачала <= стрИсклПроверка.ДатаКонец Тогда 
						Если СтрСведенияОСтаже.ДатаНачалаРабот >= стрИскл.ДатаНачала  Тогда 
							ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
							ПропускатьСтроку = Истина;
							КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
							Если КолСтрок <> 0 Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				если ПропускатьСтроку Тогда 
					Продолжить;
				КонецЕсли;
				
				
				если стрИскл.ДатаНачала >= СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаНачала <= СтрСведенияОСтаже.ДатаОкончанияРабот Тогда 
					ОкончаниеПрошл = СтрСведенияОСтаже.ДатаОкончанияРабот;
					ВидДеятПрошл = СтрСведенияОСтаже.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					ДопСведения1Прошл = СтрСведенияОСтаже.ДопСведения1;
					ДопСведения2Прошл = СтрСведенияОСтаже.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					КодППСПрошл = СтрСведенияОСтаже.КодППС;
					ПодКодПрошл = СтрСведенияОСтаже.ПодКод;
					//Аверсон СВФР-008552
					
					Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаКонец = КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) Тогда
						ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
						КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
						Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда 
							СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;  
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;  
									//Аверсон СВФР-008552
									
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;
									//Аверсон СВФР-008552
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371
								СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								//Аверсон СВФР-008371
							КонецЕсли;
						КонецЕсли;
					иначе 							
						СтрСведенияОСтаже.ДатаОкончанияРабот = стрИскл.ДатаНачала-1;
						
						
						Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот Тогда 
							СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
							СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
						иначе 	
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;  
									//Аверсон СВФР-008552
									
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл;
									//Аверсон СВФР-008552
									
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371
								СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								//Аверсон СВФР-008371
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					ЕстьИсклПоПериоду = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			если (ЕстьИсклПоПериоду = Ложь) и ?(ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0,истина,СтрСведенияОСтаже.ДатаОкончанияРабот < Стр.Период) Тогда 
				СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
				СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
				СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
				СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
				СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
				СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
				//О.Т. Аверсон 26.05.2017 № 673
				СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
				СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
				//О.Т. Аверсон 26.05.2017 № 673
				
				СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
				
				//Аверсон ЕАЕ 15.11.2021 СВФР-008371
				СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				//Аверсон СВФР-008371
				
				//Аверсон ЕАЕ 08.01.2022 СВФР-008552
				СтрСведенияОСтаже.КодППС = Стр.КодППС;
				СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
				//Аверсон СВФР-008552
				
			КонецЕсли;
			
		иначе
			//Если СотрудникПрошл <> "" Тогда 
			ЕстьИсклПоПериоду = Ложь;
			для Каждого стрИскл из ТаблицаИсключений1 Цикл
				Если не (Стр.Период >= стрИскл.ДатаНачала и Стр.Период <= стрИскл.ДатаКонец) и не (стрИскл.ДатаНачала >= Стр.Период и стрИскл.ДатаНачала <= КонецМесяца(Стр.Период)) Тогда 
					Продолжить;
				КонецЕсли;
				
				Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()=0 Тогда 
					СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
					СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
					СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
					СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
					СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
					СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
					
					//Аверсон ЕАЕ 15.11.2021 СВФР-008371
					СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
					//Аверсон СВФР-008371
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					СтрСведенияОСтаже.КодППС = Стр.КодППС;
					СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
					//Аверсон СВФР-008552
				КонецЕсли;
				
				если стрИскл.ДатаНачала >= СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаНачала <= СтрСведенияОСтаже.ДатаОкончанияРабот Тогда 
					ОкончаниеПрошл = СтрСведенияОСтаже.ДатаОкончанияРабот;
					ВидДеятПрошл = СтрСведенияОСтаже.ВидДеятельности;
					//О.Т. Аверсон 26.05.2017 № 673
					ДопСведения1Прошл = СтрСведенияОСтаже.ДопСведения1;
					ДопСведения2Прошл = СтрСведенияОСтаже.ДопСведения2;
					//О.Т. Аверсон 26.05.2017 № 673
					
					//Аверсон ЕАЕ 08.01.2022 СВФР-008552
					КодППСПрошл = СтрСведенияОСтаже.КодППС;
					ПодКодПрошл = СтрСведенияОСтаже.ПодКод;
					//Аверсон СВФР-008552
					
					Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот и стрИскл.ДатаКонец = КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот) Тогда
						ТаблицаСведенияОСтаже.Удалить(СтрСведенияОСтаже);
						КолСтрок = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество();
						Если ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник)).Количество()>0 Тогда 
							СтрСведенияОСтаже = ТаблицаСведенияОСтаже.НайтиСтроки(Новый Структура("Сотрудник",Стр.Сотрудник))[КолСтрок-1];
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
									//Аверсон СВФР-008552
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл; 
									//Аверсон СВФР-008552
									
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371
								СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								//Аверсон СВФР-008371
							КонецЕсли;
						КонецЕсли;
					иначе 							
						СтрСведенияОСтаже.ДатаОкончанияРабот = стрИскл.ДатаНачала-1;
						
						Если стрИскл.ДатаНачала = СтрСведенияОСтаже.ДатаНачалаРабот Тогда 
							СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
							СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
						иначе 	
							Если ОкончаниеПрошл > стрИскл.ДатаКонец Тогда 
								
								//СВЭЙ 26.04.2024 КВВ СВФР-012950 (
								Если НЕ ЗначениеЗаполнено(СтрСведенияОСтаже.ВидДеятельности) Тогда
									СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								КонецЕсли;
								//СВЭЙ 26.04.2024 КВВ СВФР-012950 )

								СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
								СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
								СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
								СтрСведенияОСтаже.ДатаНачалаРабот = стрИскл.ДатаКонец+1;
								СтрСведенияОСтаже.ДатаОкончанияРабот = ОкончаниеПрошл;
								Если СтрСведенияОСтаже.ДатаНачалаРабот >= Стр.Период Тогда 
									СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
									СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = Стр.КодППС;
									СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
									//Аверсон СВФР-008552
								иначе
									СтрСведенияОСтаже.ВидДеятельности = ВидДеятПрошл;
									//О.Т. Аверсон 26.05.2017 № 673
									СтрСведенияОСтаже.ДопСведения1 = ДопСведения1Прошл;
									СтрСведенияОСтаже.ДопСведения2 = ДопСведения2Прошл; 
									//О.Т. Аверсон 26.05.2017 № 673
									
									//Аверсон ЕАЕ 08.01.2022 СВФР-008552
									СтрСведенияОСтаже.КодППС = КодППСПрошл;
									СтрСведенияОСтаже.ПодКод = ПодКодПрошл; 
									//Аверсон СВФР-008552
									
								КонецЕсли;
								
								СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
								
								//Аверсон ЕАЕ 15.11.2021 СВФР-008371
								СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
								//Аверсон СВФР-008371
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					ЕстьИсклПоПериоду = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			//КонецЕсли;
			если ЕстьИсклПоПериоду = Ложь Тогда 
				
				СтрСведенияОСтаже = ТаблицаСведенияОСтаже.Добавить();
				СтрСведенияОСтаже.Сотрудник = Стр.Сотрудник;
				СтрСведенияОСтаже.ФизЛицо = Стр.Сотрудник.ФизЛицо;
				СтрСведенияОСтаже.ДатаНачалаРабот = Стр.Период;
				СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(Стр.Период);
				СтрСведенияОСтаже.ВидДеятельности = Стр.ВидДеятельности;
				//О.Т. Аверсон 26.05.2017 № 673
				СтрСведенияОСтаже.ДопСведения1 = Стр.ДопСведения1;
				СтрСведенияОСтаже.ДопСведения2 = Стр.ДопСведения2;
				//О.Т. Аверсон 26.05.2017 № 673
				
				СтрСведенияОСтаже.Категория = Стр.Сотрудник.ФизЛицо.СтатусКатегория;
				
				//Аверсон ЕАЕ 15.11.2021 СВФР-008371
				СтрСведенияОСтаже.ВидДеятельности = ПолучитьВидДеятельностиИзРСРаботникиОрганизаций(СтрСведенияОСтаже.Сотрудник, СтрСведенияОСтаже.ДатаНачалаРабот);
				//Аверсон СВФР-008371
				
				//Аверсон ЕАЕ 08.01.2022 СВФР-008552
				СтрСведенияОСтаже.КодППС = Стр.КодППС;
				СтрСведенияОСтаже.ПодКод = Стр.ПодКод;
				//Аверсон СВФР-008552
			КонецЕсли;
		КонецЕсли;
		
		СотрудникПрошл = Стр.Сотрудник;
	КонецЦикла;
	ТаблицаСведенияОСтаже.Сортировать("Сотрудник,ДатаНачалаРабот");
	
	Для Каждого СтрСтаж из ТаблицаСведенияОСтаже Цикл
		
		//Аверсон ЕАЕ 15.11.2021 СВФР-008371
		Если НЕ ЗначениеЗаполнено(СтрСтаж.ВидДеятельности) Тогда
			Продолжить;
		КонецЕсли;
		//Аверсон СВФР-008371
		
		Запрос = Новый Запрос;
		ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот);
		ДатаКон = СтрСтаж.ДатаОкончанияРабот;
		Пока ДатаН <= НачалоМесяца(ДатаКон) Цикл 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНСведенияОДоходахППС.ФизЛицо,
			|	ЕСНСведенияОДоходахППС.Период,
			|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов,
			|	ЕСНСведенияОДоходахППС.ФондППС,
			|	ЕСНСведенияОДоходахППС.ППС,
			|	ЕСНСведенияОДоходахППС.ТарифВзносов,
			|	ЕСНСведенияОДоходахППС.ВидДеятельности
			|ИЗ
			|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
			|ГДЕ
			|	ЕСНСведенияОДоходахППС.Период МЕЖДУ &Период И &Период1
			|	И ЕСНСведенияОДоходахППС.ФизЛицо = &ФизЛицо";
			Запрос.УстановитьПараметр("Период", НачалоМесяца(ДатаН)); 
			Запрос.УстановитьПараметр("Период1", КонецМесяца(ДатаН));
			Запрос.УстановитьПараметр("ФизЛицо", СтрСтаж.ФизЛицо);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
			//О.Т. Аверсон 22.06.2017 № 757
			Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда 
				
			иначе
				Если КонецМесяца(ДатаН) = КонецМесяца(ДатаКон) Тогда
					Если ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот) Тогда 
						СтрСведенияОСтаже = СведенияОСтаже.Добавить();
						ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
					иначе
						Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот)+1 <> ДатаН Тогда 
							СтрСведенияОСтаже = СведенияОСтаже.Добавить();
							ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
							СтрСведенияОСтаже.ДатаНачалаРабот = ДатаН;
						КонецЕсли;
						
					КонецЕсли;
					
					СтрСведенияОСтаже.ДатаОкончанияРабот = СтрСтаж.ДатаОкончанияРабот;
				иначе  
					Если ДатаН = НачалоМесяца(СтрСтаж.ДатаНачалаРабот) Тогда
						СтрСведенияОСтаже = СведенияОСтаже.Добавить();
						ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
					иначе
						Если КонецДня(СтрСведенияОСтаже.ДатаОкончанияРабот)+1 <> ДатаН Тогда 
							СтрСведенияОСтаже = СведенияОСтаже.Добавить();
							ЗаполнитьЗначенияСвойств(СтрСведенияОСтаже,СтрСтаж);
							СтрСведенияОСтаже.ДатаНачалаРабот = ДатаН;
						КонецЕсли;
						
					КонецЕсли;
					
					СтрСведенияОСтаже.ДатаОкончанияРабот = КонецМесяца(ДатаН);
				КонецЕсли;
				
				//Аверсон ЕАЕ 29.07.2021 СВФР-007922
				
				ЗапросУв = Новый Запрос;
				ЗапросУв.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизацийСрезПоследних.Период
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
				|ГДЕ
				|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
				
				ЗапросУв.УстановитьПараметр("Период", СтрСведенияОСтаже.ДатаОкончанияРабот);
				ЗапросУв.УстановитьПараметр("Сотрудник", СтрСтаж.Сотрудник);
				
				РезультатЗапроса = ЗапросУв.Выполнить().Выгрузить();
				Если РезультатЗапроса.Количество()> 0 Тогда
					СтрСведенияОСтаже.ДатаОкончанияРабот = РезультатЗапроса[0].Период-1;
					прервать;
				КонецЕсли;
				
				//Аверсон СВФР-007922
				
			КонецЕсли;
			
			ДатаН = ДобавитьМесяц(ДатаН,1);
		КонецЦикла;
		
		
	КонецЦикла;
	
	//СВЭЙ 26.04.2024 КВВ СВФР-012950 (
	Если СведенияОСтаже.Количество() > 0 Тогда     
		ОтборПустойППС = Новый Структура;
		ОтборПустойППС.Вставить("КодППС", 0);
		СтрокиПустойППС = СведенияОСтаже.НайтиСтроки(ОтборПустойППС);
		Для Каждого Стр Из СтрокиПустойППС Цикл 
			СпрПрофф = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецДня(Стр.ДатаНачалаРабот),Новый Структура("Сотрудник",Стр.Сотрудник)).Должность.СправочникПрофессий;
			Если СпрПрофф <> Неопределено Тогда
				Стр.КодППС = СпрПрофф.КодППС;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//СВЭЙ 26.04.2024 КВВ СВФР-012950 )
	
КонецПроцедуры	
//+++ПСА 21.09.2021 СВФР-008045

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Номер, 
	|	Организация,
	|	ДатаРегистрации КАК ПериодРегистрации,
	|	Ответственный,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Выбирает данные, необходимые для заполнения утвержденных форм как из спр-ка
//  физлиц, так и из соотв. регистров сведений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Результат запроса к данным работников документа.
//
Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности" , Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АнкетаЗастрахованногоЛицаРаботники.НомерСтроки КАК НомерСтроки,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо КАК ФизЛицо,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер КОНЕЦ КАК ЛичныйНомер,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия КОНЕЦ КАК ДокументСерия,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер КОНЕЦ КАК ДокументНомер,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортДатаВыдачи ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортДатаВыдачи КОНЕЦ КАК ДокументДатаВыдачи,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан КОНЕЦ КАК ДокументКемВыдан,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации КОНЕЦ КАК ИндексРегистрации,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.Телефоны ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Телефоны КОНЕЦ КАК Телефоны,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.Фамилия ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Фамилия КОНЕЦ КАК Фамилия,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.Имя ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Имя КОНЕЦ КАК Имя,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.Отчество ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Отчество КОНЕЦ КАК Отчество,
	|	АнкетаЗастрахованногоЛицаРаботники.Пол,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриема ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриема КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения КОНЕЦ КАК ДатаУвольнения,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаРождения ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаРождения КОНЕЦ КАК ДатаРождения,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ГородРождения ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ГородРождения КОНЕЦ КАК ГородРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.Гражданство.Наименование КАК Страна,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.РайонРождения ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.РайонРождения КОНЕЦ КАК РайонРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.СтранаРождения,
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения КОНЕЦ КАК ОбластьРождения,
	|   ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.Категория.КодПФР ЕСТЬ NULL ТОГДА  "" ""  ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Категория.КодПФР КОНЕЦ КАК Категория
	|ИЗ
	|	Документ.СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУ.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботники
	|
	|ГДЕ
	|	АнкетаЗастрахованногоЛицаРаботники.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, которая подает сведения!", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ответственное лицо!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по работникам, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Фамилия, Имя, Отказ ,Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке № """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";
	// ФизЛицо
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не выбран работник!", Отказ ,Заголовок);
	Иначе	
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + ВыборкаПоСтрокамДокумента.ФизЛицо + " ";
		
		Если ЗначениеЗаполнено(СтрЗаменить(ВыборкаПоСтрокамДокумента.СтраховойНомерПФР,"-","")) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Уже имеет страховой номер!", Отказ ,Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Фамилия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана фамилия!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Имя) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задано имя!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Пол) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан пол!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаРождения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата рождения!", Отказ ,Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаРождения > Дата тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не может быть больше даты подачи сведений!", Отказ ,Заголовок);
			КонецЕсли;	 
		КонецЕсли;	
		
		Если СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "" 
			или СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "0" Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указано место рождения!", Отказ ,Заголовок);
		КонецЕсли; 
		
		//Паспортные данные
		Если ВыборкаПоСтрокамДокумента.ДокументВид = NULL Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указаны паспортные данные!", Отказ ,Заголовок);
			
		Иначе
			
			//Проверка реквизитов паспортных данных
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументВид) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан вид документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
			Иначе
				Если (ВыборкаПоСтрокамДокумента.ДатаРождения > ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не должна превышать дату выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
				КонецЕсли;
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументСерия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана серия документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан номер документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
		КонецЕсли; 
		
		// Проверка адреса регистрации и проживания
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.АдресРегистрации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан адрес регистрации (юридический адрес)!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(УправлениеКонтактнойИнформацией.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресРегистрации)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В адресе регистрации присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(УправлениеКонтактнойИнформацией.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресФактический)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В фактическом адресе проживания присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//При проведении файл формируем заново 
	ТекстФайла = "";
	#Если Клиент Тогда
		
		ТекстФайла = СформироватьВыходнойФайл(Отказ);
	#КонецЕсли
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	 
	
	//Сохраним сформированный файл сведений в регистре сведений
	Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
	Запись.Объект = Ссылка;
	Запись.ОписаниеДанных = "Файл-пачка форм ПУ-3";
	Запись.Данные = ТекстФайла; 
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"ФизЛицо");
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Макет1",	"Макет");
	
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	ТабДокумент = ПечатьМакета(ИмяМакета);
	
	Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер);
	
КонецФункции // Печать()

Функция ПечатьМакета(ИмяМакета) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	
	// запоминаем области макета
	Макет = ПолучитьМакет(ИмяМакета);
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Заголовок"); 
	ОбластьМакетаШапка1 = Макет.ПолучитьОбласть("Заголовок1");
	ОбластьМакетаВидДеят = Макет.ПолучитьОбласть("ВидыДеят");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСНСведенияОДоходахППС.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
	|	ЕСНСведенияОДоходахППС.ТарифВзносов КАК ТарифВзносов,
	|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ФондППС, 0)) КАК ФондППС,
	|	СУММА(ЕСТЬNULL(ЕСНСведенияОДоходахППС.ППС, 0)) КАК ППС,
	|	ЕСНСведенияОДоходахППС.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ЕСНСведенияОДоходахППС.ВидДеятельности,
	|	ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий как СправочникПрофессий
	|ИЗ
	|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
	|ГДЕ
	|	ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
	|	И ЕСНСведенияОДоходахППС.Организация = &СписокОтчитывающихсяПодразделений
	|	И ЕСНСведенияОДоходахППС.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ТЧРаботникиОрганизации.ФизЛицо
	|			ИЗ
	|				Документ.СведенияОИндивидуальномПенсионномСтрахованииРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|			ГДЕ
	|				ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСНСведенияОДоходахППС.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходахППС.ПериодВзаиморасчетов, МЕСЯЦ),
	|	ЕСНСведенияОДоходахППС.ТарифВзносов,
	|	ЕСНСведенияОДоходахППС.ФизЛицо.Наименование,
	|	ЕСНСведенияОДоходахППС.ВидДеятельности,
	|	ЕСНСведенияОДоходахППС.Должность.СправочникПрофессий
	| 
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицоНаименование, ВидДеятельности,СправочникПрофессий,
	|	Период";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоНП", НачалоГода(ДатаРегистрации));
	Запрос.УстановитьПараметр("КонецНП", КонецКвартала(ДатаРегистрации));
	Запрос.УстановитьПараметр("СписокОтчитывающихсяПодразделений", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРаботники = РезультатЗапроса.Выбрать();
	НевыводитьСтроку = Ложь;
	
	ВыведеноСтрок = 0;
	// выводим строки по работникам
	ПериодПрошл = "";
	ФизЛицоПрошл = "";
	ТарифВзносовПрошл = "";
	ВидДеятельностиПрошл = "";
	КодПрофессииПрошл = "";
	ДатаКон = Дата(1,1,1);
	ИтогФондППС = 0;
	ИтогППС =0;
	ДатаКон = Дата(1,1,1);
	Пока ВыборкаРаботники.Следующий() Цикл
		Если ТипЗнч(ВыборкаРаботники.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
			КодПрофессии = ВыборкаРаботники.СправочникПрофессий.КодППС;
		ИначеЕсли ТипЗнч(ВыборкаРаботники.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
			КодПрофессии = ВыборкаРаботники.СправочникПрофессий.КодОКРБ;
		иначе
			КодПрофессии = "";
		КонецЕсли;
		если ВыборкаРаботники.Физлицо <> ФизЛицоПрошл или ВыборкаРаботники.ТарифВзносов <> ТарифВзносовПрошл или ВыборкаРаботники.ВидДеятельности <> ВидДеятельностиПрошл или КодПрофессииПрошл <> КодПрофессии Тогда
			Если не ФизЛицоПрошл = "" Тогда 
				ОбластьМакетаШапка.Параметры.ИтогФондППС = ИтогФондППС;
				ОбластьМакетаШапка.Параметры.ИтогППС = ИтогППС;
				
				ЗапросУплачено = Новый Запрос; //О.Т. Аверсон 11.10.2016 № 1484
				ЗапросУплачено.Текст = 
				"ВЫБРАТЬ
				|	УплаченоВзносовНаППС.Результат
				|ИЗ
				|	РегистрСведений.УплаченоВзносовНаППС КАК УплаченоВзносовНаППС
				|ГДЕ
				|	УплаченоВзносовНаППС.ФизЛицо = &ФизЛицо
				|	И (УплаченоВзносовНаППС.ПериодС МЕЖДУ &ПериодС И &ПериодС1
				|	ИЛИ &ПериодС МЕЖДУ УплаченоВзносовНаППС.ПериодС И УплаченоВзносовНаППС.ПериодПо)
				|	И УплаченоВзносовНаППС.Организация = &Организация";
				
				ЗапросУплачено.УстановитьПараметр("Организация", Организация);
				ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоГода(ДатаРегистрации)); //О.Т.(К) 10.06.2016 НЕ ГОД А КВАРТАЛ
				ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецКвартала(ДатаРегистрации));
				ЗапросУплачено.УстановитьПараметр("ФизЛицо", ФизЛицоПрошл);				
				РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();
				УплаченоППС = 0;
				Пока РезультатЗапросаУплачено.Следующий() Цикл
					УплаченоППС = УплаченоППС+РезультатЗапросаУплачено.Результат;
					
				КонецЦикла;
				ИтогУплат = ОбщегоНазначения.ОкруглитьЗначение2016(УплаченоППС, ДатаРегистрации);
				
				ОбластьМакетаШапка.Параметры.ИтогУпл = ИтогУплат;
				ТабДокумент.Вывести(ОбластьМакетаШапка);
				
				МассивСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ВидДеятельности",ФизЛицоПрошл,ВидДеятельностиПрошл)); 
				Для Каждого стр из МассивСведенияОСтаже Цикл 
					//Если ПериодПрошл >= НачалоМесяца(Стр.ДатаНачалаРабот) и ПериодПрошл <= НачалоМесяца(Стр.ДатаОкончанияРабот) Тогда   
					ОбластьМакетаВидДеят.Параметры.ДатаНач = Формат(Стр.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""");
					ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(Стр.ДатаОкончанияРабот,"ДФ=""дд/ММ/гггг""");
					ДатаКон = Стр.ДатаОкончанияРабот;
					ОбластьМакетаВидДеят.Параметры.ВидДеят = стр.ВидДеятельности;
					
					ЗапросДолжность = Новый Запрос;
					ЗапросДолжность.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизацийСрезПоследних.Должность
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
					
					ЗапросДолжность.УстановитьПараметр("Период", Стр.ДатаНачалаРабот);
					ЗапросДолжность.УстановитьПараметр("Сотрудник", стр.Сотрудник);
					РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
					Пока РезультатДолжность.Следующий() Цикл
						Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
							ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
						ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
							ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
						иначе
							ОбластьМакетаВидДеят.Параметры.КодПроф = "";
						КонецЕсли;
						ОбластьМакетаВидДеят.Параметры.ДопСв1 = РезультатДолжность.Должность.ДополнительныеСведения11;
						ОбластьМакетаВидДеят.Параметры.ДопСв2 = РезультатДолжность.Должность.ДополнительныеСведения21;
						НевыводитьСтроку = Ложь;
						Если ОбластьМакетаВидДеят.Параметры.КодПроф <> КодПрофессииПрошл или стр.ВидДеятельности <> ВидДеятельностиПрошл Тогда 
							НевыводитьСтроку = Истина;
						КонецЕсли;
						
					КонецЦикла;
					
					
					
					
					ЗапросДолжность = Новый Запрос;
					ЗапросДолжность.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Период,
					|	РаботникиОрганизаций.Должность,
					|	РаботникиОрганизаций.ВидДеятельностиИзмерение как ВидДеятельности
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Сотрудник = &Сотрудник
					|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
					
					ЗапросДолжность.УстановитьПараметр("Период", Стр.ДатаНачалаРабот+86400);
					ЗапросДолжность.УстановитьПараметр("Период1", Стр.ДатаОкончанияРабот);
					ЗапросДолжность.УстановитьПараметр("Сотрудник", стр.Сотрудник);
					
					РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
					Пока РезультатДолжность.Следующий() Цикл 
						Если РезультатДолжность.Период < ДатаКон Тогда 
							ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(РезультатДолжность.Период-1,"ДФ=""дд/ММ/гггг""");
							ДатаКон = РезультатДолжность.Период-1;
						КонецЕсли;
						Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
							КодПрофессииДолжности = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
						ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
							КодПрофессииДолжности = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
						иначе
							КодПрофессииДолжности = Неопределено;
						КонецЕсли;
						Если не НевыводитьСтроку Тогда
							НевыводитьСтроку = Ложь;
							Если КодПрофессииДолжности <> КодПрофессииПрошл Тогда 
								НевыводитьСтроку = Истина;
							КонецЕсли;
						КонецЕсли;
						
						Если ВидДеятельностиПрошл = РезультатДолжность.ВидДеятельности и КодПрофессииДолжности = КодПрофессииПрошл Тогда  
							
							Если не НевыводитьСтроку Тогда 
								ТабДокумент.Вывести(ОбластьМакетаВидДеят);
							КонецЕсли; 			
							ОбластьМакетаВидДеят.Параметры.ДатаНач = Формат(РезультатДолжность.Период, "ДФ=""дд/ММ/гггг""");
							ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(Стр.ДатаОкончанияРабот,"ДФ=""дд/ММ/гггг""");
							ДатаКон = Стр.ДатаОкончанияРабот;
							
							Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
								ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
							ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
								ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
							иначе
								ОбластьМакетаВидДеят.Параметры.КодПроф = "";
							КонецЕсли;
							ОбластьМакетаВидДеят.Параметры.ДопСв1 = РезультатДолжность.Должность.ДополнительныеСведения11;
							ОбластьМакетаВидДеят.Параметры.ДопСв2 = РезультатДолжность.Должность.ДополнительныеСведения21;
							
							ОбластьМакетаВидДеят.Параметры.ВидДеят = стр.ВидДеятельности;
						КонецЕсли;
						НевыводитьСтроку = Ложь;
					КонецЦикла;      
					Если ОбластьМакетаВидДеят.Параметры.КодПроф = КодПрофессииПрошл и ОбластьМакетаВидДеят.Параметры.ВидДеят = ВидДеятельностиПрошл  Тогда 
						ТабДокумент.Вывести(ОбластьМакетаВидДеят);
					КонецЕсли;
					//КонецЕсли;
					
				КонецЦикла;
				ТабДокумент.Вывести(ОбластьМакетаШапка1);
				
				ИтогФондППС = 0;
				ИтогППС = 0;
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьМакетаШапка.Параметры.ФондППС1 = 0;
				ОбластьМакетаШапка.Параметры.ППС1 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС2 = 0;
				ОбластьМакетаШапка.Параметры.ППС2 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС3 = 0;
				ОбластьМакетаШапка.Параметры.ППС3 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС4 = 0;
				ОбластьМакетаШапка.Параметры.ППС4 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС5 = 0;
				ОбластьМакетаШапка.Параметры.ППС5 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС6 = 0;
				ОбластьМакетаШапка.Параметры.ППС6 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС7 = 0;
				ОбластьМакетаШапка.Параметры.ППС7 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС8 = 0;
				ОбластьМакетаШапка.Параметры.ППС8 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС9 = 0;
				ОбластьМакетаШапка.Параметры.ППС9 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС10 = 0;
				ОбластьМакетаШапка.Параметры.ППС10 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС11 = 0;
				ОбластьМакетаШапка.Параметры.ППС11 = 0;
				ОбластьМакетаШапка.Параметры.ФондППС12 = 0;
				ОбластьМакетаШапка.Параметры.ППС12 = 0;
				ОбластьМакетаВидДеят.Параметры.ДатаКон = "";
				ОбластьМакетаВидДеят.Параметры.ДатаНач = "";
				ОбластьМакетаВидДеят.Параметры.КодПроф = "";
				ОбластьМакетаВидДеят.Параметры.ДопСв1 = "";
				ОбластьМакетаВидДеят.Параметры.ДопСв2 = "";
				ОбластьМакетаВидДеят.Параметры.ВидДеят = "";
				ДатаКон = Дата(1,1,1);
			КонецЕсли;
			
			Если Месяц(НачалоКвартала(ДатаРегистрации)) = 1 Тогда 
				ОбластьМакетаШапка.Параметры.К1 = "Х";
			ИначеЕсли Месяц(НачалоКвартала(ДатаРегистрации)) = 4  Тогда 
				ОбластьМакетаШапка.Параметры.К1 = "Х";
				ОбластьМакетаШапка.Параметры.К2 = "Х";
			ИначеЕсли Месяц(НачалоКвартала(ДатаРегистрации)) = 7  Тогда 
				ОбластьМакетаШапка.Параметры.К1 = "Х";
				ОбластьМакетаШапка.Параметры.К2 = "Х";
				ОбластьМакетаШапка.Параметры.К3 = "Х";
			ИначеЕсли Месяц(НачалоКвартала(ДатаРегистрации)) = 10  Тогда 
				ОбластьМакетаШапка.Параметры.К1 = "Х";
				ОбластьМакетаШапка.Параметры.К2 = "Х";
				ОбластьМакетаШапка.Параметры.К3 = "Х";
				ОбластьМакетаШапка.Параметры.К4 = "Х";
			КонецЕсли;
			ОбластьМакетаШапка.Параметры.Г1 = Лев(СтрЗаменить(Год(ДатаРегистрации)," ",""),1);
			ОбластьМакетаШапка.Параметры.Г2 = Сред(СтрЗаменить(Год(ДатаРегистрации)," ",""),2,1);
			ОбластьМакетаШапка.Параметры.Г3 = Сред(СтрЗаменить(Год(ДатаРегистрации)," ",""),3,1);
			ОбластьМакетаШапка.Параметры.Г4 = Прав(СтрЗаменить(Год(ДатаРегистрации)," ",""),1);
			
			ОбластьМакетаШапка.Параметры.СтраховойНомер = ВыборкаРаботники.Физлицо.СтраховойНомерПФР;
			
			ЗапросФИО = Новый Запрос;
			ЗапросФИО.Текст = 
			"ВЫБРАТЬ
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество
			|ИЗ
			|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период) КАК ФИОФизЛицСрезПоследних
			|ГДЕ
			|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
			
			ЗапросФИО.УстановитьПараметр("ФизЛицо", ВыборкаРаботники.Физлицо);
			ЗапросФИО.УстановитьПараметр("Период", ДатаРегистрации);
			РезультатЗапросаФИО = ЗапросФИО.Выполнить().Выгрузить();
			если РезультатЗапросаФИО.Количество()>0 Тогда 
				ОбластьМакетаШапка.Параметры.Фамилия = РезультатЗапросаФИО[0].Фамилия;
				ОбластьМакетаШапка.Параметры.Имя = РезультатЗапросаФИО[0].Имя;
				ОбластьМакетаШапка.Параметры.Отчество = РезультатЗапросаФИО[0].Отчество;
				
			КонецЕсли;
			Если НазначениеПенсии Тогда 	
				ОбластьМакетаШапка.Параметры.Н = "Х";
			ИначеЕсли Корректирующая Тогда 	
				ОбластьМакетаШапка.Параметры.К = "Х";
			Иначе 
				ОбластьМакетаШапка.Параметры.И = "Х";
			КонецЕсли;
			
			
			ОбластьМакетаШапка.Параметры.УНП = Организация.ИНН;
			ОбластьМакетаШапка.Параметры.Организация = Организация.Наименование;
			ОбластьМакетаШапка.Параметры.ТарифВзносов = ВыборкаРаботники.ТарифВзносов;
			
			
			ОбластьМакетаШапка1.Параметры.ДатаДок = Формат(Дата,"ДФ=""дд/ММ/гггг""");
			Руководитель = "";
			Для Каждого стр из Организация.ОтветственныеЛица Цикл 
				если стр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководитель = Стр.Сотрудник;
				КонецЕсли;				
			КонецЦикла;
			ОбластьМакетаШапка1.Параметры.Руководитель = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Руководитель);
			
			ЗапросТел = Новый Запрос;
			ЗапросТел.Текст = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &Объект
			|	И КонтактнаяИнформация.Тип = &Тип
			|	И КонтактнаяИнформация.Вид = &Вид";
			
			ЗапросТел.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
			ЗапросТел.УстановитьПараметр("Объект", Организация);
			ЗапросТел.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			РезультатТел = ЗапросТел.Выполнить().Выгрузить();
			если РезультатТел.Количество()>0 Тогда 
				ОбластьМакетаШапка1.Параметры.ТелОрганизации = РезультатТел[0].Представление;
			КонецЕсли;
			
			
			ПериодПрошл = ВыборкаРаботники.Период;
		КонецЕсли;
		ДатаКон = ВыборкаРаботники.Период;
		Если Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 1 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС1 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС1 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 2 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС2 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС2 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 3 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС3 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС3 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 4 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС4 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС4 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 5 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС5 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС5 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 6 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС6 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС6 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 7 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС7 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС7 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 8 Тогда 
			ОбластьМакетаШапка.Параметры.ФондППС8 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС8 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 9 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС9 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС9 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 10 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС10 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС10 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 11 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС11 = ВыборкаРаботники.ФондППС;
			ОбластьМакетаШапка.Параметры.ППС11 = ВыборкаРаботники.ППС;
		ИначеЕсли Месяц(НачалоМесяца(ВыборкаРаботники.Период)) = 12 Тогда
			ОбластьМакетаШапка.Параметры.ФондППС12 = ВыборкаРаботники.ФондППС;	
			ОбластьМакетаШапка.Параметры.ППС12 = ВыборкаРаботники.ППС;
		КонецЕсли;
		ФизЛицоПрошл =ВыборкаРаботники.ФизЛицо;
		ТарифВзносовПрошл = ВыборкаРаботники.ТарифВзносов;
		ВидДеятельностиПрошл = ВыборкаРаботники.ВидДеятельности;
		КодПрофессииПрошл = КодПрофессии;
		ИтогФондППС = ИтогФондППС + ВыборкаРаботники.ФондППС;
		ИтогППС = ИтогППС + ВыборкаРаботники.ППС;
		
	КонецЦикла;
	
	
	
	//ПериодПрошл = Дата(2016,05,0);       сделать
	
	если ВыборкаРаботники.Количество()>0 Тогда 
		ОбластьМакетаШапка.Параметры.ИтогФондППС = ИтогФондППС;
		ОбластьМакетаШапка.Параметры.ИтогППС = ИтогППС;
		
		ЗапросУплачено = Новый Запрос; //О.Т. Аверсон 11.10.2016 № 1484
		ЗапросУплачено.Текст = 
		"ВЫБРАТЬ
		|	УплаченоВзносовНаППС.Результат
		|ИЗ
		|	РегистрСведений.УплаченоВзносовНаППС КАК УплаченоВзносовНаППС
		|ГДЕ
		|	УплаченоВзносовНаППС.ФизЛицо = &ФизЛицо
		|	И (УплаченоВзносовНаППС.ПериодС МЕЖДУ &ПериодС И &ПериодС1
		|			ИЛИ &ПериодС МЕЖДУ УплаченоВзносовНаППС.ПериодС И УплаченоВзносовНаППС.ПериодПо)
		|	И УплаченоВзносовНаППС.Организация = &Организация";
		
		ЗапросУплачено.УстановитьПараметр("Организация", Организация);
		ЗапросУплачено.УстановитьПараметр("ПериодС", НачалоГода(ДатаРегистрации)); //О.Т.(К) 10.06.2016 НЕ ГОД А КВАРТАЛ
		ЗапросУплачено.УстановитьПараметр("ПериодС1", КонецКвартала(ДатаРегистрации));
		ЗапросУплачено.УстановитьПараметр("ФизЛицо", ВыборкаРаботники.Физлицо);				
		РезультатЗапросаУплачено = ЗапросУплачено.Выполнить().Выбрать();
		УплаченоППС = 0;
		Пока РезультатЗапросаУплачено.Следующий() Цикл
			УплаченоППС = УплаченоППС+РезультатЗапросаУплачено.Результат;
			
		КонецЦикла;
		ИтогУплат = ОбщегоНазначения.ОкруглитьЗначение2016(УплаченоППС, ДатаРегистрации);
		
		ОбластьМакетаШапка.Параметры.ИтогУпл = ИтогУплат;
		
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		МассивСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ВидДеятельности",ВыборкаРаботники.Физлицо,ВыборкаРаботники.ВидДеятельности)); 
		Для Каждого стр из МассивСведенияОСтаже Цикл 
			//Если ПериодПрошл >= НачалоМесяца(Стр.ДатаНачалаРабот) и ПериодПрошл <= НачалоМесяца(Стр.ДатаОкончанияРабот) Тогда
			ОбластьМакетаВидДеят.Параметры.ДатаНач = Формат(Стр.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""");
			ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(Стр.ДатаОкончанияРабот,"ДФ=""дд/ММ/гггг""");
			ДатаКон = Стр.ДатаОкончанияРабот;
			ОбластьМакетаВидДеят.Параметры.ВидДеят = стр.ВидДеятельности;
			ЗапросДолжность = Новый Запрос;
			ЗапросДолжность.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Должность
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
			
			ЗапросДолжность.УстановитьПараметр("Период", Стр.ДатаНачалаРабот);
			ЗапросДолжность.УстановитьПараметр("Сотрудник", стр.Сотрудник);
			РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
			Пока РезультатДолжность.Следующий() Цикл 
				
				Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
					ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
				ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
					ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
				иначе
					ОбластьМакетаВидДеят.Параметры.КодПроф = "";
				КонецЕсли;
				ОбластьМакетаВидДеят.Параметры.ДопСв1 = РезультатДолжность.Должность.ДополнительныеСведения11;
				ОбластьМакетаВидДеят.Параметры.ДопСв2 = РезультатДолжность.Должность.ДополнительныеСведения21;
				Если ОбластьМакетаВидДеят.Параметры.КодПроф <> КодПрофессииПрошл или стр.ВидДеятельности <> ВидДеятельностиПрошл Тогда 
					НевыводитьСтроку = Истина;
				КонецЕсли;
			КонецЦикла;
			
			
			
			
			
			ЗапросДолжность = Новый Запрос;
			ЗапросДолжность.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизаций.Период,
			|	РаботникиОрганизаций.Должность,
			|	РаботникиОрганизаций.ВидДеятельностиИзмерение как ВидДеятельности
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|ГДЕ
			|	РаботникиОрганизаций.Сотрудник = &Сотрудник
			|	И РаботникиОрганизаций.Период МЕЖДУ &Период И &Период1";
			
			ЗапросДолжность.УстановитьПараметр("Период", Стр.ДатаНачалаРабот+86400);
			ЗапросДолжность.УстановитьПараметр("Период1", Стр.ДатаОкончанияРабот);
			ЗапросДолжность.УстановитьПараметр("Сотрудник", стр.Сотрудник);
			
			РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
			Пока РезультатДолжность.Следующий() Цикл 
				Если РезультатДолжность.Период < ДатаКон Тогда
					ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(РезультатДолжность.Период-1,"ДФ=""дд/ММ/гггг""");
					ДатаКон = РезультатДолжность.Период-1;
				КонецЕсли;
				Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
					КодПрофессииДолжности = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
				ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
					КодПрофессииДолжности = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
				иначе
					КодПрофессииДолжности = Неопределено;
				КонецЕсли;
				Если не НевыводитьСтроку Тогда 
					НевыводитьСтроку = Ложь;
					Если КодПрофессииДолжности <> КодПрофессииПрошл Тогда 
						НевыводитьСтроку = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ВидДеятельностиПрошл = РезультатДолжность.ВидДеятельности и КодПрофессииДолжности = КодПрофессииПрошл Тогда
					Если не НевыводитьСтроку Тогда 
						ТабДокумент.Вывести(ОбластьМакетаВидДеят);
					КонецЕсли;
					ОбластьМакетаВидДеят.Параметры.ДатаНач = Формат(РезультатДолжность.Период, "ДФ=""дд/ММ/гггг""");
					ОбластьМакетаВидДеят.Параметры.ДатаКон = Формат(Стр.ДатаОкончанияРабот,"ДФ=""дд/ММ/гггг""");
					ДатаКон = Стр.ДатаОкончанияРабот;
					
					Если ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ППС") Тогда 
						ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодППС;
					ИначеЕсли ТипЗнч(РезультатДолжность.Должность.СправочникПрофессий) = Тип("СправочникСсылка.ОКРБ") Тогда  							
						ОбластьМакетаВидДеят.Параметры.КодПроф = РезультатДолжность.Должность.СправочникПрофессий.КодОКРБ;
					иначе
						ОбластьМакетаВидДеят.Параметры.КодПроф = "";
					КонецЕсли;
					
					ОбластьМакетаВидДеят.Параметры.ДопСв1 = РезультатДолжность.Должность.ДополнительныеСведения11;
					ОбластьМакетаВидДеят.Параметры.ДопСв2 = РезультатДолжность.Должность.ДополнительныеСведения21;
					
					ОбластьМакетаВидДеят.Параметры.ВидДеят = стр.ВидДеятельности;
				КонецЕсли;
				НевыводитьСтроку = Ложь;
			КонецЦикла;
			Если ОбластьМакетаВидДеят.Параметры.КодПроф = КодПрофессииПрошл и ОбластьМакетаВидДеят.Параметры.ВидДеят = ВидДеятельностиПрошл  Тогда 
				ТабДокумент.Вывести(ОбластьМакетаВидДеят);
			КонецЕсли;
			
			
			//КонецЕсли;
		КонецЦикла;
		ТабДокумент.Вывести(ОбластьМакетаШапка1);
		
		ИтогФондППС = 0;
		ИтогППС = 0;
	КонецЕсли;
	
	
	Возврат ТабДокумент;
	
	
КонецФункции // Печать()
 
Процедура УдалитьСтрокиНачисленийПоРаботнику(ФизЛицо) Экспорт
	//СВЭЙ 26.04.2024 КВВ СВФР-012950 (
	СтруктураПоиска = Новый Структура("ФизЛицо", ФизЛицо);
	
	МассивСтрок = СведенияОСтаже.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		СведенияОСтаже.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	МассивСтрок = СведенияОВзносах.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		СведенияОВзносах.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	//СВЭЙ 26.04.2024 КВВ СВФР-012950 )
КонецПроцедуры
