////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда
	
	// Функция формирует табличный документ с печатной формой "Т-61",
	//
	// Возвращаемое значение:
	//	Табличный документ	- печатная форма
	//
	Функция ПечатьТ61() Экспорт
		
		// тексты запросов 
		
		РасчетСреднегоЗаработкаТекст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|			ТОГДА 1
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработокНеиндексируемый)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокЗаписей,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|					ИЛИ РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработокНеиндексируемый)
		|				ТОГДА РасчетСреднегоЗаработка.ОтработаноДней
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоДнейРасчетногоПериода,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|					ИЛИ РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработокНеиндексируемый)
		|				ТОГДА РасчетСреднегоЗаработка.ОтработаноЧасов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВсегоЧасовРасчетногоПериода,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|				ТОГДА РасчетСреднегоЗаработка.Результат * ВЫБОР
		|						КОГДА РасчетСреднегоЗаработка.КоэффициентИндексации < 1
		|							ТОГДА 1
		|						ИНАЧЕ РасчетСреднегоЗаработка.КоэффициентИндексации
		|					КОНЕЦ
		|			КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработокНеиндексируемый)
		|				ТОГДА РасчетСреднегоЗаработка.Результат
		|			КОГДА РасчетСреднегоЗаработка.ЧислоМесяцев = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ПоПремиям)
		|						ТОГДА РасчетСреднегоЗаработка.Результат * ВЫБОР
		|								КОГДА РасчетСреднегоЗаработка.КоэффициентИндексации < 1
		|									ТОГДА 1
		|								ИНАЧЕ РасчетСреднегоЗаработка.КоэффициентИндексации
		|							КОНЕЦ
		|					КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ПоФиксПремиям)
		|						ТОГДА РасчетСреднегоЗаработка.Результат * ВЫБОР
		|								КОГДА РасчетСреднегоЗаработка.КоэффициентИндексации < 1
		|									ТОГДА 1
		|								ИНАЧЕ РасчетСреднегоЗаработка.КоэффициентИндексации
		|							КОНЕЦ * ВЫБОР
		|								КОГДА РасчетСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ РасчетСреднегоЗаработка.ОтработаноПоПятидневке / РасчетСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ПоФиксПремиямНеИндексируемые)
		|						ТОГДА РасчетСреднегоЗаработка.Результат * ВЫБОР
		|								КОГДА РасчетСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ РасчетСреднегоЗаработка.ОтработаноПоПятидневке / РасчетСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					ИНАЧЕ РасчетСреднегоЗаработка.Результат
		|				КОНЕЦ * ВЫБОР
		|					КОГДА РасчетСреднегоЗаработка.ЧислоМесяцев > РасчетСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка
		|						ТОГДА РасчетСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка / РасчетСреднегоЗаработка.ЧислоМесяцев
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		КОНЕЦ) КАК ВсегоУчтено,
		|	НАЧАЛОПЕРИОДА(РасчетСреднегоЗаработка.БазовыйПериодНачало, МЕСЯЦ) КАК МесяцРасчетногоПериода,
		|	НАЧАЛОПЕРИОДА(РасчетСреднегоЗаработка.БазовыйПериодКонец, МЕСЯЦ) КАК БазовыйПериодКонец,
		|	РасчетСреднегоЗаработка.ВидРасчета КАК ВидРасчета,
		|	СУММА(РасчетСреднегоЗаработка.Результат) КАК Результат,
		|	РасчетСреднегоЗаработка.ЧислоМесяцев КАК МесяцевПремии,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&Индексируемые)
		|			ТОГДА РасчетСреднегоЗаработка.КоэффициентИндексации
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентИндексации,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.НормаПоПятидневке = 0
		|			ТОГДА 0
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ФиксированныеПремии)
		|			ТОГДА РасчетСреднегоЗаработка.ОтработаноПоПятидневке / РасчетСреднегоЗаработка.НормаПоПятидневке
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДоляВремени,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|			ТОГДА 0
		|		ИНАЧЕ РасчетСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка
		|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработка
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка КАК РасчетСреднегоЗаработка
		|ГДЕ
		|	РасчетСреднегоЗаработка.Регистратор = &Регистратор
		|	И РасчетСреднегоЗаработка.СпособРасчета = &СпособРасчета
		|	И (РасчетСреднегоЗаработка.Результат <> 0
		|			ИЛИ РасчетСреднегоЗаработка.ОтработаноДней <> 0
		|			ИЛИ РасчетСреднегоЗаработка.ОтработаноЧасов <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(РасчетСреднегоЗаработка.БазовыйПериодНачало, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(РасчетСреднегоЗаработка.БазовыйПериодКонец, МЕСЯЦ),
		|	РасчетСреднегоЗаработка.ЧислоМесяцев,
		|	РасчетСреднегоЗаработка.ВидРасчета,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&Индексируемые)
		|			ТОГДА РасчетСреднегоЗаработка.КоэффициентИндексации
		|		ИНАЧЕ 1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.НормаПоПятидневке = 0
		|			ТОГДА 0
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ФиксированныеПремии)
		|			ТОГДА РасчетСреднегоЗаработка.ОтработаноПоПятидневке / РасчетСреднегоЗаработка.НормаПоПятидневке
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|			ТОГДА 0
		|		ИНАЧЕ РасчетСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцРасчетногоПериода,
		|	ПорядокЗаписей,
		|	ВидРасчета,
		|	МесяцевПремии,
		|	КоэффициентИндексации
		|ИТОГИ
		|	СУММА(ВсегоДнейРасчетногоПериода),
		|	СУММА(ВсегоЧасовРасчетногоПериода),
		|	СУММА(ВсегоУчтено)
		|ПО
		|	ОБЩИЕ";
		
		НачисленияТекст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА Начисления.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДни), ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневка))
		|					ТОГДА Начисления.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НачисленоКомпенсации,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА Начисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.ВыходноеПособие)
		|					ТОГДА Начисления.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НачисленоВыходноеПособие,
		|	ЕСТЬNULL(СУММА(ВЫБОР
		|				КОГДА Начисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.СохраняемыйЗаработокНаВремяТрудоустройства)
		|					ТОГДА Начисления.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ), 0) КАК НачисленСохраняемыйЗаработок,
		|	ЕСТЬNULL(СУММА(Начисления.Результат), 0) КАК ВсегоВыплат
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК Начисления
		|ГДЕ
		|	Начисления.Регистратор = &Регистратор
		|	И (НЕ Начисления.Сторно)";
		//|	И (НЕ Начисления.ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.УдержаниеЗаНеотработанныйОтпускКалендарныеДни), ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.УдержаниеЗаНеотработанныйОтпускШестидневка)))";
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетПриУвольненииРаботникаОрганизаций_Т61";
		
		Макет = ПолучитьМакет("Т_61");
		СекцияРасчетСреднего = Макет.ПолучитьОбласть("РасчетСреднего");
		СекцияДополнительнаяСтрокаЗаработка = Макет.ПолучитьОбласть("ДополнительнаяСтрокаЗаработка");
		СекцияЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
		СекцияРасчетСреднегоИтого = Макет.ПолучитьОбласть("РасчетСреднегоИтого");
		СекцияПодвал = Макет.ПолучитьОбласть("Подвал");
		
		Запрос = Новый Запрос;
		
		ФиксированныеПремии = Новый Массив(4);
		ФиксированныеПремии[0] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		//ФиксированныеПремии[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямНеИндексируемые;
		//ФиксированныеПремии[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
		//ФиксированныеПремии[3] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииНеИндексируемые;
		
		ПоПремиям = Новый Массив(3);
		ПоПремиям[0] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		//ПоПремиям[1] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямИндексируемые;
		//ПоПремиям[2] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииИндексируемые;
		
		ПоФиксПремиямНеИндексируемые = Новый Массив(3);
		//ПоФиксПремиямНеИндексируемые[0] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
		//ПоФиксПремиямНеИндексируемые[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииНеИндексируемые;
		//ПоФиксПремиямНеИндексируемые[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямНеИндексируемые;
		
		ОсновнойЗаработок = Новый Массив(2);
		ОсновнойЗаработок[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		//ОсновнойЗаработок[1] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуИндексируемые;
		
		Индексируемые = Новый Массив(7);
		//Индексируемые[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуИндексируемые;
		//Индексируемые[1] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямИндексируемые;
		//Индексируемые[2] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииИндексируемые;
		Индексируемые[3] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		Индексируемые[4] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		Индексируемые[5] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		Индексируемые[6] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
		
		Запрос.УстановитьПараметр("Регистратор",			Ссылка);
		Запрос.УстановитьПараметр("СпособРасчета",			?(ПорядокРасчетаОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке));
		Запрос.УстановитьПараметр("Индексируемые",			Индексируемые);
		Запрос.УстановитьПараметр("ОсновнойЗаработок",		ОсновнойЗаработок);
		Запрос.УстановитьПараметр("ОсновнойЗаработокНеиндексируемый", ОсновнойЗаработок);
		Запрос.УстановитьПараметр("ПоФиксПремиям",			ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ПоПремиям",				ПоПремиям);
		Запрос.УстановитьПараметр("ФиксированныеПремии",	ФиксированныеПремии);
		Запрос.УстановитьПараметр("ПоФиксПремиямНеИндексируемые", ФиксированныеПремии);
		
		// ВЫВОД ДАННЫХ В ОТЧЕТ
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапкеДляПечати().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		
		// вывод лицевой стороны
		СекцияЛицеваяСторона.Параметры.Заполнить(ВыборкаПоШапкеДокумента);
		
		ТабДокумент.Вывести(СекцияЛицеваяСторона);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Выборка начисленных сумм 
		
		СекцияРасчетСреднего.Параметры.Заполнить(ВыборкаПоШапкеДокумента);
		
		НачисленоКомпенсации = 0;
		ВсегоВыплат = 0;
		Запрос.Текст = НачисленияТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НачисленоКомпенсации = Выборка.НачисленоКомпенсации;
			ВсегоВыплат = Выборка.ВсегоВыплат;
			СекцияПодвал.Параметры.Заполнить(Выборка);
			СекцияРасчетСреднего.Параметры.Заполнить(Выборка);
		КонецЕсли;
		
		// удержания за неиспользованный отпуск
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(Удержания.Результат), 0) КАК Результат
		|ИЗ
		|	(ВЫБРАТЬ
		|		Удержания.Результат КАК Результат
		|	ИЗ
		|		РегистрРасчета.УдержанияРаботниковОрганизаций КАК Удержания
		|	ГДЕ
		|		Удержания.Регистратор = &Регистратор
		|		И (НЕ Удержания.Сторно)) КАК Удержания";
		
		УдержаниеЗаНеиспользованныйОтпуск = 0;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УдержаниеЗаНеиспользованныйОтпуск = Выборка.Результат;
		КонецЕсли;
		Если УдержаниеЗаНеиспользованныйОтпуск <> 0 Тогда
			СекцияРасчетСреднего.Параметры.НачисленоКомпенсации = УдержаниеЗаНеиспользованныйОтпуск;
		КонецЕсли;
		
		// Вывод сведений о порядке расчета среднего заработка
		
		// по окончательным данным проведенного документа
		// собираем итоговые данные и рассчитываем средний заработок
		
		Запрос.Текст = РасчетСреднегоЗаработкаТекст;
		ВыборкаСреднегоЗаработка = Запрос.Выполнить().Выбрать();
		
		ОсновнойЗаработок = Новый Массив(3);
		ОсновнойЗаработок[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		//ОсновнойЗаработок[1] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуИндексируемые;
		//ОсновнойЗаработок[2] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуНеИндексируемые;
		
		НомерСтроки = 0;
		Пока ВыборкаСреднегоЗаработка.СледующийПоЗначениюПоля("МесяцРасчетногоПериода") Цикл
			Если ВыборкаСреднегоЗаработка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
				
				СекцияРасчетСреднего.Параметры.Заполнить(ВыборкаСреднегоЗаработка);
				СекцияРасчетСреднегоИтого.Параметры.Заполнить(ВыборкаСреднегоЗаработка);
				
				Если ВыборкаПоШапкеДокумента.ИспользоватьСреднеЧасовойЗаработок Тогда
					если ПериодРегистрации < Дата(2016,07,1) Тогда 
						СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = Окр(?(ВыборкаСреднегоЗаработка.ВсегоЧасовРасчетногоПериода = 0,0, ВыборкаСреднегоЗаработка.ВсегоУчтено / ВыборкаСреднегоЗаработка.ВсегоЧасовРасчетногоПериода),2);
					иначе
						СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = ОбщегоНазначения.ОкруглитьЗначение2016(?(ВыборкаСреднегоЗаработка.ВсегоЧасовРасчетногоПериода = 0,0, ВыборкаСреднегоЗаработка.ВсегоУчтено / ВыборкаСреднегоЗаработка.ВсегоЧасовРасчетногоПериода),ПериодРегистрации);//О.Т. Аверсон 14.03.2016 № 949
					КонецЕсли;
					
				Иначе
					если ПериодРегистрации < Дата(2016,07,1) Тогда 
						СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = Окр(?(ВыборкаСреднегоЗаработка.ВсегоДнейРасчетногоПериода = 0,0, ВыборкаСреднегоЗаработка.ВсегоУчтено / ВыборкаСреднегоЗаработка.ВсегоДнейРасчетногоПериода),2);
					иначе
						СекцияРасчетСреднего.Параметры.ЗаработокЗаЕдиницуВремени = ОбщегоНазначения.ОкруглитьЗначение2016(?(ВыборкаСреднегоЗаработка.ВсегоДнейРасчетногоПериода = 0,0, ВыборкаСреднегоЗаработка.ВсегоУчтено / ВыборкаСреднегоЗаработка.ВсегоДнейРасчетногоПериода),ПериодРегистрации);//О.Т. Аверсон 14.03.2016 № 949
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Пока ВыборкаСреднегоЗаработка.СледующийПоЗначениюПоля("ПорядокЗаписей") Цикл
					Пока ВыборкаСреднегоЗаработка.СледующийПоЗначениюПоля("ВидРасчета") Цикл
						
						НомерСтроки = НомерСтроки  + 1;
						
						// формируем описание периода к которому отнесена выводимая сумма
						Если ВыборкаСреднегоЗаработка.БазовыйПериодКонец = ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода Тогда
							Если НомерСтроки <= 12 Тогда
								СекцияРасчетСреднего.Параметры["Год" + НомерСтроки] = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода);
								СекцияРасчетСреднего.Параметры["Месяц" + НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ'");
							Иначе
								СекцияДополнительнаяСтрокаЗаработка.Параметры.Год = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода);
								СекцияДополнительнаяСтрокаЗаработка.Параметры.Месяц = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ'");
							КонецЕсли; 
						Иначе
							Если НомерСтроки <= 12 Тогда
								Если Год(ВыборкаСреднегоЗаработка.БазовыйПериодКонец) = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода) Тогда
									СекцияРасчетСреднего.Параметры["Год" + НомерСтроки] = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода);
									СекцияРасчетСреднего.Параметры["Месяц" + НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ'") + " - " + Формат(ВыборкаСреднегоЗаработка.БазовыйПериодКонец,"ДФ='ММММ'");
								Иначе
									СекцияРасчетСреднего.Параметры["Год" + НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ гггг'");
									СекцияРасчетСреднего.Параметры["Месяц" + НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.БазовыйПериодКонец,"ДФ='ММММ гггг'");
								КонецЕсли;
							Иначе
								Если Год(ВыборкаСреднегоЗаработка.БазовыйПериодКонец) = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода) Тогда
									СекцияДополнительнаяСтрокаЗаработка.Параметры.Год = Год(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода);
									СекцияДополнительнаяСтрокаЗаработка.Параметры.Месяц = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ'") + " - " + Формат(ВыборкаСреднегоЗаработка.БазовыйПериодКонец,"ДФ='ММММ'");
								Иначе
									СекцияДополнительнаяСтрокаЗаработка.Параметры.Год = Формат(ВыборкаСреднегоЗаработка.МесяцРасчетногоПериода,"ДФ='ММММ гггг'");
									СекцияДополнительнаяСтрокаЗаработка.Параметры.Месяц = Формат(ВыборкаСреднегоЗаработка.БазовыйПериодКонец,"ДФ='ММММ гггг'");
								КонецЕсли;
							КонецЕсли; 
						КонецЕсли;
						
						Если ОсновнойЗаработок.Найти(ВыборкаСреднегоЗаработка.ВидРасчета) <> Неопределено Тогда
							//основной заработок
							ВсегоУчтено = 0;
							ПримечаниеКСумме = ""; // формируем примечание к ячейке
							Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
								ВсегоУчтено = ВсегоУчтено + ВыборкаСреднегоЗаработка.ВсегоУчтено;
								Если ВыборкаСреднегоЗаработка.КоэффициентИндексации > 1 Тогда
									ПримечаниеКСумме = ПримечаниеКСумме + ?(ПримечаниеКСумме = "","",Символы.ПС) + "сумма заработка " + ВыборкаСреднегоЗаработка.Результат + " учтена с коэффициентом индексации " + ВыборкаСреднегоЗаработка.КоэффициентИндексации
								КонецЕсли;
							КонецЦикла;
							ОписаниеСуммы = ВсегоУчтено; 
							Если НомерСтроки <= 12 Тогда
								СекцияРасчетСреднего.Параметры["Сумма" + НомерСтроки] = ОписаниеСуммы;
								СекцияРасчетСреднего.Область(НомерСтроки + 7, 7).Примечание.Текст = ПримечаниеКСумме;
								Если НомерСтроки = 12  Тогда
									// вывод среднедневного (часового) заработка
									ТабДокумент.Вывести(СекцияРасчетСреднего);
								КонецЕсли; 
							Иначе
								СекцияДополнительнаяСтрокаЗаработка.Параметры.Сумма = ОписаниеСуммы;
								СекцияДополнительнаяСтрокаЗаработка.Область(1, 7).Примечание.Текст = ПримечаниеКСумме;
								ТабДокумент.Вывести(СекцияДополнительнаяСтрокаЗаработка);
							КонецЕсли; 
						Иначе
							// премии
							Пока ВыборкаСреднегоЗаработка.СледующийПоЗначениюПоля("МесяцевПремии") Цикл
								ВсегоУчтено = 0;
								ПримечаниеКСумме = ""; // формируем примечание к ячейке
								Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
									ВсегоУчтено = ВсегоУчтено + ВыборкаСреднегоЗаработка.ВсегоУчтено;
									Если ВыборкаСреднегоЗаработка.КоэффициентИндексации > 1 Или ВыборкаСреднегоЗаработка.ДоляВремени > 0 Тогда
										ПримечаниеКСумме = ПримечаниеКСумме + ?(ПримечаниеКСумме = "","",Символы.ПС) 
										+ "сумма премии " + ВыборкаСреднегоЗаработка.Результат + " учтена "
										+ ?(ВыборкаСреднегоЗаработка.МесяцевПремии > ВыборкаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка,Символы.ПС + "в месячной части за каждый месяц расчетного периода (" + ВыборкаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка + "/" + ВыборкаСреднегоЗаработка.МесяцевПремии + ") ","полностью ")
										+ ?(ВыборкаСреднегоЗаработка.КоэффициентИндексации > 1,
										Символы.ПС + "с коэффициентом индексации " + ВыборкаСреднегоЗаработка.КоэффициентИндексации + "; ","")
										+ ?(ВыборкаСреднегоЗаработка.ДоляВремени > 0,
										Символы.ПС + "пропорционально отработанному времени - в доле " + ВыборкаСреднегоЗаработка.ДоляВремени,"")
									КонецЕсли;
								КонецЦикла;
								ОписаниеСуммы = "Премия за " + ВыборкаСреднегоЗаработка.МесяцевПремии + " мес.: " + Формат(ВсегоУчтено,"ЧЦ=15; ЧДЦ=2; ЧН=-"); 
								Если НомерСтроки <= 12 Тогда
									СекцияРасчетСреднего.Параметры["Сумма" + НомерСтроки] = ОписаниеСуммы;
									СекцияРасчетСреднего.Область(НомерСтроки + 7, 7).Примечание.Текст = ПримечаниеКСумме;
									Если НомерСтроки = 12  Тогда
										// вывод среднедневного (часового) заработка
										ТабДокумент.Вывести(СекцияРасчетСреднего);
									КонецЕсли;
								Иначе
									СекцияДополнительнаяСтрокаЗаработка.Параметры.Сумма = ОписаниеСуммы;
									СекцияДополнительнаяСтрокаЗаработка.Область(1, 7).Примечание.Текст = ПримечаниеКСумме;
									ТабДокумент.Вывести(СекцияДополнительнаяСтрокаЗаработка);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НомерСтроки < 12 Тогда
			// вывод среднедневного (часового) заработка
			ТабДокумент.Вывести(СекцияРасчетСреднего);
		КонецЕсли;
		
		// итого средний заработок
		ТабДокумент.Вывести(СекцияРасчетСреднегоИтого);
		
		// Расчет суммы НДФЛ от ставки налога без учета льгот
		Если ВыборкаПоШапкеДокумента.НеЯвляетсяНалоговымРезидентомРФ Тогда
			СтавкаНДФЛ = ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛСНерезидента();
		Иначе	
			СтавкаНДФЛ = ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
		КонецЕсли; 
		СуммаНДФЛ =  ОбщегоНазначения.ОкруглитьЗначение2016(НачисленоКомпенсации * СтавкаНДФЛ/100, ПериодРегистрации);//О.Т. Аверсон 17.03.2016 № 949
		ВсегоУдержано = УдержаниеЗаНеиспользованныйОтпуск + СуммаНДФЛ;
		
		// расчет конечного сальдо
		Запрос.УстановитьПараметр("Период",			ДатаУвольнения);
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("Физлицо",		Сотрудник.Физлицо);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВзаиморасчетыСРаботникамиОрганизацииОстатки.СуммаВзаиморасчетовОстаток КАК НачальноеСальдо
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&Период, Физлицо  = &Физлицо И Организация  = &Организация) КАК ВзаиморасчетыСРаботникамиОрганизацииОстатки";
		
		КонечноеСальдо 	   = 0;
		КВыплате = Макс(0, ВсегоВыплат - ВсегоУдержано);
		Выборка  = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			КонечноеСальдо = ?(Выборка.НачальноеСальдо = Null,0,Выборка.НачальноеСальдо) + ВсегоВыплат - ВсегоУдержано - КВыплате;
			Если КонечноеСальдо > 0 Тогда
				СекцияПодвал.Параметры.ДолгЗаОрганизацией = КонечноеСальдо;
				
			Иначе
				СекцияПодвал.Параметры.ДолгЗаРаботником = 0 - КонечноеСальдо;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СекцияПодвал.Параметры.СуммаНДФЛ						 = СуммаНДФЛ;
		СекцияПодвал.Параметры.УдержаниеЗаНеиспользованныйОтпуск = УдержаниеЗаНеиспользованныйОтпуск;
		СекцияПодвал.Параметры.ВсегоУдержано					 = ВсегоУдержано;
		СекцияПодвал.Параметры.КВыплате							 = КВыплате;
		СекцияПодвал.Параметры.КВыплатеПрописью					 = РаботаСДиалогами.СформироватьСуммуПрописью(КВыплате, Константы.ВалютаРегламентированногоУчета.Получить());
		
		Если КВыплате > 0 Тогда
			СекцияПодвал.Параметры.КВыплатеРублиКопейки = "(" + ОбщегоНазначения.ОкруглитьЗначение2016(КВыплате,Дата)+ " руб. )";//О.Т. Аверсон 08.07.2016 № 949
		Иначе
			СекцияПодвал.Параметры.КВыплатеРублиКопейки = "(_____________руб.";
		КонецЕсли;
		
		ТабДокумент.Вывести(СекцияПодвал);
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьТ61()
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	// Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//	НазваниеМакета	- строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если Не Проведен Тогда
			РаботаСДиалогами.ВывестиПредупреждение("Документ можно распечатать только после его проведения!");
			Возврат Неопределено;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Получить экземпляр документа на печать
		Если      ИмяМакета = "Т61" Тогда
			ТабДокумент = ПечатьТ61();
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (Форма Т-61)");
			
		ИначеЕсли ИмяМакета = "РасчетСреднегоЗаработка" Тогда
			Если ДнейЧасовВыходногоПособия = 0 И ДнейЧасовСохраненияСреднегоЗаработка = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("По документу не выплачивается сохраняемый средний заработок!");
				Возврат Неопределено;
			КонецЕсли;
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			ВыборкаПоШапкеДокумента.Следующий();
			
			//Аверсон 05.04.2023 КВВ СВФР-010658 (пункт 2) (
			Если Организация.ИНН = "100194961" Тогда
				ТабДокумент = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаУвольнения, ?(ДнейЧасовВыходногоПособия = 0, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие), "за " + ДнейЧасовВыходногоПособия + ?(ВыходноеПособиеПоСокр," месяцев"," дней(часов)")+?(ДнейЧасовВыходногоПособия >0," выходного пособия","") , Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку,ВыборкаПоШапкеДокумента.СреднийЧасовойЗаработокДляКомпОтпуска,,,,,,СреднийЧасовойЗаработокДляКомпОтпуска);
			Иначе
				//Аверсон 05.04.2023 КВВ СВФР-010658 (пункт 2) )
				
				ТабДокумент = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаУвольнения, ?(ДнейЧасовВыходногоПособия = 0, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие), "за " + ДнейЧасовВыходногоПособия + ?(ВыходноеПособиеПоСокр," месяцев"," дней(часов)")+?(ДнейЧасовВыходногоПособия >0," выходного пособия","") , Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
			КонецЕсли;
			
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (расчет среднего заработка)");
			
		ИначеЕсли ИмяМакета = "РасчетКомпенсацииОтпуска" Тогда
			Если ДнейЧасовКомпенсацииУдержанияОтпуска = 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("По документу не выплачивается компенсация отпуска!");	
				Возврат Неопределено;
			КонецЕсли;
			
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			ВыборкаПоШапкеДокумента.Следующий();
			
			//Аверсон 15.12.2022 КВВ СВФР-010017 (
			//ТабДокумент = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаУвольнения, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск, "за " + ДнейЧасовКомпенсацииУдержанияОтпуска + " дней(часов) " + ?(ПризнакКомпенсацииОтпуска,"компенсации отпуска","удержания за отпуск"), ?(ПорядокРасчетаОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке), ИспользоватьСреднеЧасовойЗаработок,,,,,,СреднийЧасовойЗаработокДляКомпОтпуска);
			ТабДокумент = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаУвольнения, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск, "за " + ДнейЧасовКомпенсацииУдержанияОтпуска + " дней(часов) " + ?(ПризнакКомпенсацииОтпуска,"компенсации отпуска","удержания за отпуск"), ?(ПорядокРасчетаОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням,Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке), ВыборкаПоШапкеДокумента.СреднийЧасовойЗаработокДляКомпОтпуска,,,,,,СреднийЧасовойЗаработокДляКомпОтпуска);
			//Аверсон 15.12.2022 КВВ СВФР-010017 )
			
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (расчет среднего заработка " + ?(ПризнакКомпенсацииОтпуска,"компенсации отпуска","удержания за отпуск") + ")");
			
		КонецЕсли;
		
		
	КонецФункции // Печать()
	
#КонецЕсли

//Процедура рассчитывает начисления по среднему и заполняет реквизит Результат таблицы начислений
//
// Параметры:
//	РассчитываемыеТаблицы	- структура из элементов, соответствующих табличным частям документа. 
//								Значение Истина для каждого из элементов структуры означает необходимость расчета 
//								соответствующей табличной части документа
//	РежимПерерасчета		- булево - признак вызов расчета при перерасчете документа
//
Процедура Рассчитать(РассчитываемыеТаблицы, РежимПерерасчета = Ложь,НеСторноНач = Ложь) Экспорт //Островская Татьяна 31.10.2013 № 16864
	
	//Перед вызовом процедуры документ должнен быть записан, движения должны быть удалены 
	
	Отказ = Ложь;
	
	Заголовок = СтрЗаменить(ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка),"Проведение документа: ","Расчет документа: ");
	
	// Дата увольнения должна быть указана
	Если Не ЗначениеЗаполнено(ДатаУвольнения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата увольнения работника!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Очистим ТЧ Начисления
	Начисления.Очистить();
	
	// Создадим наборы записей используемых регистров 
	
	НаборДополнительныеНачисления = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборДополнительныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	НаборУдержания = РегистрыРасчета.УдержанияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборУдержания.Отбор.Регистратор.Значение = Ссылка;
	
	НаборРасчетСреднего = РегистрыРасчета.РасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	НаборРасчетСреднего.Отбор.Регистратор.Значение = Ссылка;
	
	// Если это документ-исправление, добавим сторно-записи из исправляемого документа.
	ПроведениеРасчетов.СформироватьСторноЗаписиПоПерерассчитываемомуДокументу(ПерерассчитываемыйДокумент,ВыборкаПоШапкеДокумента, Неопределено, НаборДополнительныеНачисления, НаборУдержания);
	
	Сч = 0;
	Пока Сч <= 1 Цикл //О.Т. Аверсон 20.10.2017 № 1108
		Если сч = 1 Тогда 
			Начисления.Очистить();
		КонецЕсли;
		
		// Начисления (удержания) документа.
		СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборДополнительныеНачисления, НаборУдержания,Сч);
		
		Если НЕ РассчитываемыеТаблицы.РасчетСреднего Тогда
			
			// запишем движения по среднему заработку для расчета начислений
			// получим реквизиты табличной части РасчетСреднего 
			РезультатЗапросаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего(ВыборкаПоШапкеДокумента,сч);
			ВыборкаПоРасчетСреднего = РезультатЗапросаПоРасчетСреднего.Выбрать();
			
			Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, НаборРасчетСреднего);
				КонецЕсли;
			КонецЦикла; 
			
			НаборРасчетСреднего.Записать();
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// рассчитываем записи начислений и если надо, записи расчета среднего заработка 
		Если РассчитываемыеТаблицы.Начисления Тогда
			//Островская Татьяна 31.10.2013 № 16864
			СреднийРассчитан = Ложь;
			
			Если НаборДополнительныеНачисления.Количество() <> 0 Тогда
				Если РассчитываемыеТаблицы.РасчетСреднего Тогда
					ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , НаборРасчетСреднего, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет); //292
					СреднийРассчитан = Истина;
					НачислДоп = НаборДополнительныеНачисления.Выгрузить();
					Для Каждого стрНач из НачислДоп цикл
						если не стрНач.Сторно тогда
							НеСторноНач = Истина; 
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДополнительныеНачисления, , , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);//292
				КонецЕсли;
			КонецЕсли;
			//Островская Татьяна 31.10.2013 № 16864
			Если РассчитываемыеТаблицы.РасчетСреднего Тогда
				ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("УдержанияРаботниковОрганизаций", НаборУдержания, , НаборРасчетСреднего, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);
			Иначе
				ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("УдержанияРаботниковОрганизаций", НаборУдержания, , , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение,,Истина,,,,,,,,,РассчитываемыеТаблицы.Пересчет);
			КонецЕсли;
			
			// перепишем записи начислений в документ
			ПереписатьНачисленияВТабличнуюЧастьДокумента(НаборДополнительныеНачисления);
			ПереписатьНачисленияВТабличнуюЧастьДокумента(НаборУдержания);
			
			ТаблицаЗаписей = НаборРасчетСреднего.Выгрузить();
			
		ИначеЕсли РассчитываемыеТаблицы.РасчетСреднего Тогда
			
			НаборДополнительныеНачисления.Записать();
			НаборУдержания.Записать();
			ПроведениеРасчетов.СформироватьИЗаписатьДанныеРасчетаСреднего("ДополнительныеНачисленияРаботниковОрганизаций", Ссылка, НаборРасчетСреднего,,,,РассчитываемыеТаблицы.Пересчет);//292
			ТаблицаЗаписей = НаборРасчетСреднего.Выгрузить();
			Если НаборУдержания.Количество() > 0 Тогда
				НаборРасчетСреднего.Очистить();
				ПроведениеРасчетов.СформироватьИЗаписатьДанныеРасчетаСреднего("УдержанияРаботниковОрганизаций", Ссылка, НаборРасчетСреднего,,,,РассчитываемыеТаблицы.Пересчет);//292
				
				Для Каждого СтрокаНабора Из НаборРасчетСреднего Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаЗаписей.Добавить(),СтрокаНабора)
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;                               
		
		Если РассчитываемыеТаблицы.РасчетСреднего Тогда
			РасчетСреднего.Очистить();
			РасчетСреднегоДляОтпуска.Очистить();
			ТаблицаЗаписей.Свернуть("СпособРасчета,БазовыйПериодКонец,БазовыйПериодНачало,ВидРасчета,КоэффициентИндексации,НормаПоПятидневке,ОтработаноДней,ОтработаноПоПятидневке,ОтработаноЧасов,Результат,ЧислоМесяцев,МесяцВыборки,ТекущаяТарифнаяСтавка,ТарифнаяСтавкаПериода,НормаДней,НормаЧасов,Включать");//Островская Татьяна 23.10.2013 № 16864
			
			//Аверсон 11.07.2021 КВВ СВФР-007560 (
			Для Каждого СтрокаНабора Из ТаблицаЗаписей Цикл
				Если СтрокаНабора.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямПоСреднему Тогда
					Окончание = СтрокаНабора.БазовыйПериодКонец;
					Отбор = Новый Структура;
					Отбор.Вставить("ВидРасчета",ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку);
					Строки = ТаблицаЗаписей.НайтиСтроки(Отбор);
					Для Каждого Стр_ Из Строки Цикл
						Окончание = Мин(Окончание,Стр_.БазовыйПериодКонец);
					КонецЦикла;
					Если СтрокаНабора.БазовыйПериодКонец <> Окончание Тогда
						СтрокаНабора.БазовыйПериодКонец = Окончание;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			//Аверсон 11.07.2021 КВВ СВФР-007560 )
			
			
			// перепишем записи расчета среднего заработка в документ
			Для каждого СтрокаНабора Из ТаблицаЗаписей Цикл
				Если СтрокаНабора.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку Тогда
					СтрокаТЧ = РасчетСреднего.Добавить();
					
				Иначе
					
					//Аверсон ЕАЕ 04.08.2022 СВФР-009371
					Если СтрокаНабора.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям 
						ИЛИ СтрокаНабора.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямПоСреднему Тогда
						Продолжить;
					КонецЕсли;
					//Аверсон СВФР-009371
					
					СтрокаТЧ = РасчетСреднегоДляОтпуска.Добавить();
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаНабора);
			КонецЦикла;
			
			//Аверсон ЕАЕ 22.07.2022 СВФР-009371
			РасчетСреднегоДляОтпуска.Сортировать("МесяцВыборки");
			//Аверсон СВФР-009371
			
		КонецЕсли;
		
		Если НаборРасчетСреднего.Количество()=0 Тогда
			Если РежимПерерасчета тогда
				// Для режима перерасчета запишем движения (набор записей расчета среднего уже записан)
				НаборДополнительныеНачисления.Записать();
				НаборУдержания.Записать();
				
			Иначе
				// Удаляем движения для режима интерактивного расчета 
				НаборДополнительныеНачисления.Очистить();
				НаборДополнительныеНачисления.Записать();
				
				НаборУдержания.Очистить();
				НаборУдержания.Записать();
				
				НаборРасчетСреднего.Очистить();
				НаборРасчетСреднего.Записать();
				
			КонецЕсли; 
			Сч = Сч+1;
		иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
	Если РежимПерерасчета тогда
		// Для режима перерасчета запишем движения (набор записей расчета среднего уже записан)
		НаборДополнительныеНачисления.Записать();
		НаборУдержания.Записать();
		
	Иначе
		// Удаляем движения для режима интерактивного расчета 
		НаборДополнительныеНачисления.Очистить();
		НаборДополнительныеНачисления.Записать();
		
		НаборУдержания.Очистить();
		НаборУдержания.Записать();
		
		НаборРасчетСреднего.Очистить();
		НаборРасчетСреднего.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // Рассчитать()

//Выполняет перерасчет по заданному списку физлиц
//
// Параметры:
//	Физлица	- массив - ссылки на физлиц
//
// Возвращаемое значение
//	Нет.
//
Процедура Перерассчитать(Физлица = Неопределено) Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	// Выполним полный перерасчет документа
	Рассчитать(Новый Структура("Начисления,РасчетСреднего",Истина,Истина), Истина);	
	// Зафиксируем данные табличных частей после расчета
	Записать();
	
	УчетнаяПолитикаПоПерсоналуОрганизации  = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");	
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "УчетЗадолженностиПоМесяцам");
	
	Движения.НДФЛСведенияОДоходах.Очистить();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий(); 
	
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
	КонецЦикла;
	
	Движения.НДФЛСведенияОДоходах.Записать();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записать();
	
	// Удалим записи перерасчета по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	
КонецПроцедуры // Перерассчитать()

// Заполняет документ по перерассчитываемому документу
// ИсходныйДокумент - тип ДокументОбъект.РасчетПриУвольненииРаботникаОрганизаций
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
	"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	
КонецПроцедуры  // ЗаполнитьПоПерерассчитываемомуДокументу()

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	
	СтруктураМакетов.Вставить("Т61",						"Форма Т-61");
	СтруктураМакетов.Вставить("РасчетСреднегоЗаработка",	"Расчет среднего заработка");	
	СтруктураМакетов.Вставить("РасчетКомпенсацииОтпуска",	"Расчет ср. заработка " + ?(ПризнакКомпенсацииОтпуска,"компенсации отпуска","удержания за отпуск"));	
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует записи регистра "ОсновныеНачисленияРаботниковОрганизаций" по данным шапки документа
//
Процедура СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборДополнительныеНачисления, НаборУдержания,Сч = 0)
	
	СтрокаОбщихПараметров = "ПодразделениеОрганизации,ОбособленноеПодразделение,ПериодРегистрации,Сотрудник,Физлицо,ГрафикРаботы,ДатаНачалаСобытия,ПериодРасчетаСреднегоЗаработкаОкончание,Авторасчет";
	
	Если ВыборкаПоШапкеДокумента.СуммированныйУчетРабочегоВремени Тогда
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
	Иначе
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ДнейЧасовВыходногоПособия > 0 и не ВыходноеПособиеПоСокр Тогда //О.Т. 12.09.2014 № 17568
		Движение = НаборДополнительныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
		
		Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидРасчета		 = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ВыходноеПособие;
		Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовВыходногоПособия;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие);
		Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработка;
		Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработка;
		Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
			Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие);
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие));  
		КонецЕсли;
		
	КонецЕсли;
	//О.Т. 12.09.2014 № 17568
	Если ВыходноеПособиеПоСокр Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
		
		Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидРасчета		 = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ВыходноеПособиеПоСокр;
		Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовВыходногоПособия;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособиеПоСокр);
		Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработка;
		Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработка;
		Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
			Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособиеПоСокр);
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособиеПоСокр));  
		КонецЕсли;
		
		
	КонецЕсли; 
	//О.Т. 12.09.2014 № 17568
	
	Если ВыборкаПоШапкеДокумента.ДнейЧасовСохраненияСреднегоЗаработка > 0 Тогда
		Движение = НаборДополнительныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
		
		Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидРасчета		 = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.СохраняемыйЗаработокНаВремяТрудоустройства;
		Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовСохраненияСреднегоЗаработка;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства);
		Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработка;
		Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработка;
		Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
			Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства);
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства));  
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииУдержанияОтпуска > 0 Тогда
		Если ВыборкаПоШапкеДокумента.ИспользоватьСреднеЧасовойЗаработок Тогда
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
		Иначе
			ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
		КонецЕсли;
		ДнейКомпенсЗаНеиспОтпВсего = 0; //Аверсон 17.06.2019 КВВ СВФР-004429
		Если ВыборкаПоШапкеДокумента.ПризнакКомпенсацииОтпуска Тогда
			ДнейКомпенсЗаНеиспОтпВсего = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска1+ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2+ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3+ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4; //Аверсон 17.06.2019 КВВ СВФР-004429
			Если ДнейКомпенсЗаНеиспОтпВсего = 0 Тогда
				Движение = НаборДополнительныеНачисления.Добавить();
			КонецЕсли;
		Иначе
			СтрокаОбщихПараметров = СтрЗаменить(СтрокаОбщихПараметров, "ПодразделениеОрганизации,", "");
			Движение = НаборУдержания.Добавить();			
		КонецЕсли;
		
		Если ДнейКомпенсЗаНеиспОтпВсего = 0 Тогда
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
			Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
			Движение.ВидРасчета		 = ВыборкаПоШапкеДокумента.ВидРасчетаСреднегоЗаработкаОтпуск;
			Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииУдержанияОтпуска;
			Движение.ВидУчетаВремени = ВидУчетаВремени;
			Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
			Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработкаОтпуска;
			Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработкаОтпуска;
			Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
				Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
				Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));  
			КонецЕсли;
			//Аверсон 17.06.2019 КВВ СВФР-004429 (
		Иначе
			Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска1 <> 0 Тогда
				Движение = НаборДополнительныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
				Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
				Движение.ВидРасчета		 = ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска1;
				Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска1;
				Движение.ВидУчетаВремени = ВидУчетаВремени;
				Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
				Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработкаОтпуска;
				Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработкаОтпуска;
				Если сч = 1 Тогда 
					Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
					Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));  
				КонецЕсли;
			КонецЕсли;
			Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2 <> 0 Тогда
				Движение = НаборДополнительныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
				Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
				Движение.ВидРасчета		 = ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска2;
				Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска2;
				Движение.ВидУчетаВремени = ВидУчетаВремени;
				Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
				Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработкаОтпуска;
				Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработкаОтпуска;
				Если сч = 1 Тогда 
					Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
					Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));  
				КонецЕсли;
			КонецЕсли;
			Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3 <> 0 Тогда
				Движение = НаборДополнительныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
				Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
				Движение.ВидРасчета		 = ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска3;
				Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска3;
				Движение.ВидУчетаВремени = ВидУчетаВремени;
				Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
				Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработкаОтпуска;
				Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработкаОтпуска;
				Если сч = 1 Тогда 
					Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
					Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));  
				КонецЕсли;
			КонецЕсли;
			Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4 <> 0 Тогда
				Движение = НаборДополнительныеНачисления.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
				Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
				Движение.ВидРасчета		 = ВыборкаПоШапкеДокумента.ВидРасчетаКомпенсацииОтпуска4;
				Движение.Показатель1	 = ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииОтпуска4;
				Движение.ВидУчетаВремени = ВидУчетаВремени;
				Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
				Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработкаОтпуска;
				Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработкаОтпуска;
				Если сч = 1 Тогда 
					Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
					Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));  
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//Аверсон 17.06.2019 КВВ СВФР-004429 )
	КонецЕсли;
	
	//О.Т. Аверсон 20.10.2017 № 1108
	Если ВыборкаПоШапкеДокумента.КомпенсВзаменПредупрежденияМес > 0 Тогда //О.Т. 12.09.2014 № 17568
		Движение = НаборДополнительныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаОбщихПараметров);
		
		Движение.Организация	 = ВыборкаПоШапкеДокумента.Организация;
		Движение.ВидРасчета		 = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияВзаменПредупреждения;
		Движение.Показатель1	 = ВыборкаПоШапкеДокумента.КомпенсВзаменПредупрежденияМес;
		Движение.ВидУчетаВремени = ВидУчетаВремени;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен);
		Движение.РучнойРасчетСреднегоЗаработка = РучнойРасчетСреднегоЗаработка;
		Движение.РазмерСреднегоЗаработка = РазмерСреднегоЗаработка;
		Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
			Движение.ПериодРасчетаСреднегоЗаработкаНачало = ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаНачало,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен);
			Движение.ПериодРасчетаСреднегоЗаработкаОкончание = КонецМесяца(ДобавитьМесяц(Движение.ПериодРасчетаСреднегоЗаработкаОкончание,- ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен));  
		КонецЕсли;
		
	КонецЕсли;
	//О.Т. Аверсон 20.10.2017 № 1108
	
КонецПроцедуры // СформироватьДвиженияПоНачислениям()

// На основе сформированных движений по регистру расчета заполняет ТЧ "Начисления"
//
Процедура ПереписатьНачисленияВТабличнуюЧастьДокумента(НаборДополнительныеНачисления)
	
	Для Каждого СтрокаНачислений Из НаборДополнительныеНачисления Цикл
		НоваяСтрока = Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНачислений);
		НоваяСтрока.Размер = СтрокаНачислений.Показатель1;
	КонецЦикла;
	
КонецПроцедуры // ПереписатьНачисленияВТабличнуюЧастьДокумента()

// Формирует запрос по шапке документа для целей вывода документа на печать
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапкеДляПечати()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	Запрос.УстановитьПараметр("ДатаУвольнения",			ДатаУвольнения);
	Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
	Запрос.УстановитьПараметр("Физлицо",				Сотрудник.Физлицо);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетПриУвольненииРаботникаОрганизации.Номер КАК НомерДокумента,
	|	РасчетПриУвольненииРаботникаОрганизации.Дата КАК ДатаДокумента,
	|	РасчетПриУвольненииРаботникаОрганизации.Организация.КодПоОКПО КАК КодПоОКПО,
	|	ВЫРАЗИТЬ(РасчетПриУвольненииРаботникаОрганизации.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник,
	|	РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения,
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовВыходногоПособия,
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовСохраненияСреднегоЗаработка,
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииУдержанияОтпуска,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.ПризнакКомпенсацииОтпуска
	|			ТОГДА РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииУдержанияОтпуска
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейКомпенсации,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.ПризнакКомпенсацииОтпуска
	|			ТОГДА 0
	|		ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииУдержанияОтпуска
	|	КОНЕЦ КАК ДнейУдержания,
	|	РасчетПриУвольненииРаботникаОрганизации.ПризнакКомпенсацииОтпуска,
	|	РасчетПриУвольненииРаботникаОрганизации.РабочийГодС,
	|	РасчетПриУвольненииРаботникаОрганизации.РабочийГодПо,
	|	РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, РасчетПриУвольненииРаботникаОрганизации.Сотрудник.Наименование) КАК ФИО,
	|	ВЫБОР
	|		КОГДА  РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаУвольнения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаУвольнения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность 
	|	КОНЕЦ КАК Должность,
	|	РасчетПриУвольненииРаботникаОрганизации.ИспользоватьСреднеЧасовойЗаработок КАК ИспользоватьСреднеЧасовойЗаработок,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник.НомерДоговора КАК НомерДоговора,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник.ДатаДоговора КАК ДатаДоговора,
	|	УвольнениеИзОрганизацииРаботникиОрганизации.СтатьяТКРФ.Наименование КАК ОснованиеУвольнения,
	|	""№ "" + ЕСТЬNULL(РасчетПриУвольненииРаботникаОрганизации.ДокументОснование.Номер, ""_____________"") КАК ДокументОснованиеНомер,
	|	ЕСТЬNULL(РасчетПриУвольненииРаботникаОрганизации.ДокументОснование.Дата, ""____   __________20___ года"") КАК ДокументОснованиеДата,
	|	ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ, ЛОЖЬ) КАК НеЯвляетсяНалоговымРезидентомРФ,
	|	РасчетПриУвольненииРаботникаОрганизации.Организация.Префикс,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник.Код КАК ТабельныйНомер
	|ИЗ
	|	Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаУвольнения, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаУвольнения, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаУвольнения, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацииРаботникиОрганизации
	|		ПО РасчетПриУвольненииРаботникаОрганизации.Сотрудник = УвольнениеИзОрганизацииРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	РасчетПриУвольненииРаботникаОрганизации.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	//Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаУвольнения);
	Запрос.УстановитьПараметр("ДатаАктуальности", ?(ЗначениеЗаполнено(ДатаВыборки),ДатаВыборки,ДатаУвольнения)); //Аверсон 19.06.2023 КВВ СВФР-010940
	
	Запрос.УстановитьПараметр("Сотрудник",			Сотрудник);
	Запрос.УстановитьПараметр("ДатаИзмененийТК2006",ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетПриУвольненииРаботникаОрганизации.СреднийЧасовойЗаработокДляКомпОтпуска, //Аверсон 15.12.2022 КВВ СВФР-010017
	|	РасчетПриУвольненииРаботникаОрганизации.Дата,
	|	РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.Дата < РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации
	|			ТОГДА РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.Дата > КОНЕЦПЕРИОДА(РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.Дата
	|	КОНЕЦ КАК ПериодРегистрацииДополнительныхНачислений,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РасчетПриУвольненииРаботникаОрганизации.Организация
	|		ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РасчетПриУвольненииРаботникаОрганизации.Организация
	|		ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	РасчетПриУвольненииРаботникаОрганизации.Организация КАК ОбособленноеПодразделение,
	|	РасчетПриУвольненииРаботникаОрганизации.Ссылка,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник,
	|	РасчетПриУвольненииРаботникаОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|	РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения,
	//+ СВЭЙ КДЯ 08.01.20 СВФР-005268
	//|	РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения КАК ДатаНачалаСобытия,
	//|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения, МЕСЯЦ), СЕКУНДА, -1) КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	//- СВЭЙ КДЯ 08.01.20 СВФР-005268
	//+ СВЭЙ КДЯ 08.01.20 СВФР-005268
	|	ВЫБОР КОГДА РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения < РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации 
	|		ТОГДА РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации
	|		ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения
	|	КОНЕЦ КАК ДатаНачалаСобытия,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(
	|			ВЫБОР КОГДА РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения < РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации 
	|				ТОГДА РасчетПриУвольненииРаботникаОрганизации.ПериодРегистрации
	|				ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.ДатаУвольнения
	|			КОНЕЦ
	|			, МЕСЯЦ), СЕКУНДА, -1) КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	//- СВЭЙ КДЯ 08.01.20 СВФР-005268
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.ПризнакКомпенсацииОтпуска
	|			ТОГДА ИСТИНА
	|		КОГДА ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.УдержаниеЗаОтпускУменьшаетНалоги
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакКомпенсацииОтпуска,
	|	РасчетПриУвольненииРаботникаОрганизации.ДокументОснование,
	|	РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска,
	|	РасчетПриУвольненииРаботникаОрганизации.ИспользоватьСреднеЧасовойЗаработок,
	|	РасчетПриУвольненииРаботникаОрганизации.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	РасчетПриУвольненииРаботникаОрганизации.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	РасчетПриУвольненииРаботникаОрганизации.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	ИСТИНА КАК Авторасчет,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|		КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	ПараметрыВидаРасчетаВыходноеПособие.ЧислоМесяцев КАК ПериодРасчетаСреднегоЗаработкаВыходноеПособие,
	|	ПараметрыВидаРасчетаСохраняемыйЗаработокНаВремяТрудоустройства.ЧислоМесяцев КАК ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства,
	|	ПараметрыВидаРасчетаКомпенсация.ЧислоМесяцев КАК ПериодРасчетаСреднегоЗаработкаОтпуск,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.ПризнакКомпенсацииОтпуска
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|						ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДни)
	|					ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневка)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|					ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускКалендарныеДни)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускШестидневка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидРасчетаСреднегоЗаработкаОтпуск,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке)
	|	КОНЕЦ КАК СпособРасчетаПоСреднемуДляОтпуска,
	|	ВЫБОР
	|		КОГДА РасчетПриУвольненииРаботникаОрганизации.Сотрудник.Организация = ВЫБОР
	|				КОГДА РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА РасчетПриУвольненииРаботникаОрганизации.Организация
	|				ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация
	|			КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииУдержанияОтпуска КАК ДнейЧасовКомпенсацииУдержанияОтпуска,
	//Аверсон 17.06.2019 КВВ СВФР-004429 (
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииОтпуска1 КАК ДнейЧасовКомпенсацииОтпуска1, 
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииОтпуска2 КАК ДнейЧасовКомпенсацииОтпуска2, 
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииОтпуска3 КАК ДнейЧасовКомпенсацииОтпуска3, 
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовКомпенсацииОтпуска4 КАК ДнейЧасовКомпенсацииОтпуска4,
	|	РасчетПриУвольненииРаботникаОрганизации.ВидРасчетаКомпенсацииОтпуска1 КАК ВидРасчетаКомпенсацииОтпуска1, 
	|	РасчетПриУвольненииРаботникаОрганизации.ВидРасчетаКомпенсацииОтпуска2 КАК ВидРасчетаКомпенсацииОтпуска2, 
	|	РасчетПриУвольненииРаботникаОрганизации.ВидРасчетаКомпенсацииОтпуска3 КАК ВидРасчетаКомпенсацииОтпуска3, 
	|	РасчетПриУвольненииРаботникаОрганизации.ВидРасчетаКомпенсацииОтпуска4 КАК ВидРасчетаКомпенсацииОтпуска4,	
	//Аверсон 17.06.2019 КВВ СВФР-004429 )
	|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовСохраненияСреднегоЗаработка * ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫБОР
	|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|				КОНЕЦ, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ДлительностьРабочейНедели
	|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ДлительностьРабочейНедели
	|				КОНЕЦ / ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|									И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|								ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ВидГрафика
	|							ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ВидГрафика
	|						КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
	|						ТОГДА 6
	|					ИНАЧЕ 5
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ДнейЧасовСохраненияСреднегоЗаработка,";
	
	Если ИспользоватьСреднеЧасовойЗаработок Тогда  // средний часовой заработок    //Аверсон 06.04.2023 КВВ СВФР-010658 (пункт 1)
		Запрос.Текст = Запрос.Текст + "
		|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовВыходногоПособия * ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЫБОР
		|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
		|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
		|				КОНЕЦ, ЛОЖЬ)
		|			ТОГДА ВЫБОР
		|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ДлительностьРабочейНедели
		|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ДлительностьРабочейНедели
		|				КОНЕЦ / ВЫБОР
		|					КОГДА ВЫБОР
		|							КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|									И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|								ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ВидГрафика
		|							ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ВидГрафика
		|						КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
		|						ТОГДА 6
		|					ИНАЧЕ 5
		|				КОНЕЦ
		|		ИНАЧЕ 1
		|	КОНЕЦ";
		//Аверсон 06.04.2023 КВВ СВФР-010658 (пункт 1) (
	Иначе // средний дневной заработок
		Запрос.Текст = Запрос.Текст + "
		|	РасчетПриУвольненииРаботникаОрганизации.ДнейЧасовВыходногоПособия";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 06.04.2023 КВВ СВФР-010658 (пункт 1) )
	
	|КАК ДнейЧасовВыходногоПособия,
	|	РасчетПриУвольненииРаботникаОрганизации.КомпенсВзаменПредупрежденияМес * ВЫБОР
	|	КОГДА ЕСТЬNULL(ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|			КОНЕЦ, ЛОЖЬ)
	|		ТОГДА ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ДлительностьРабочейНедели
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ДлительностьРабочейНедели
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ВЫБОР
	|						КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|								И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ВидГрафика
	|						ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ВидГрафика
	|					КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
	|					ТОГДА 6
	|				ИНАЧЕ 5
	|			КОНЕЦ
	|	ИНАЧЕ 1
	|	КОНЕЦ КАК КомпенсВзаменПредупрежденияМес,
	|	ПараметрыВидаРасчетаКомпенсация.ВидЕжегодногоОтпуска КАК ВидЕжегодногоОтпуска,
	|	РасчетПриУвольненииРаботникаОрганизации.РазмерСреднегоЗаработка,
	|	РасчетПриУвольненииРаботникаОрганизации.РучнойРасчетСреднегоЗаработка,
	|	РасчетПриУвольненииРаботникаОрганизации.РучнойРасчетСреднегоЗаработкаОтпуска,
	|	РасчетПриУвольненииРаботникаОрганизации.РазмерСреднегоЗаработкаОтпуска,
	|	ПараметрыВидаРасчетаВыходноеПособиеПоСокр.ЧислоМесяцев КАК ПериодРасчетаСреднегоЗаработкаВыходноеПособиеПоСокр, //О.Т. 12.09.2014 № 17568
	|	ПараметрыВидаРасчетаКомпенсацияВзамен.ЧислоМесяцев КАК ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен
	
	|ИЗ
	|	Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (РаботникиОрганизацииСрезПоследних.Организация = ВЫБОР
	|				КОГДА РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА РасчетПриУвольненииРаботникаОрганизации.Организация
	|				ИНАЧЕ РасчетПриУвольненииРаботникаОрганизации.Организация.ГоловнаяОрганизация
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсация
	|		ПО (ПараметрыВидаРасчетаКомпенсация.Ссылка = ВЫБОР
	|				КОГДА РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|					ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаКалендарныеДни)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияОтпускаШестидневка)
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций КАК ПараметрыВидаРасчетаУдержание
	|		ПО (ПараметрыВидаРасчетаУдержание.Ссылка = ВЫБОР
	|				КОГДА РасчетПриУвольненииРаботникаОрганизации.ПорядокРасчетаОтпуска = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаОтпуска.ПоКалендарнымДням)
	|					ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускКалендарныеДни)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускШестидневка)
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаВыходноеПособие
	|		ПО (ПараметрыВидаРасчетаВыходноеПособие.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.ВыходноеПособие))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаСохраняемыйЗаработокНаВремяТрудоустройства
	|		ПО (ПараметрыВидаРасчетаСохраняемыйЗаработокНаВремяТрудоустройства.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.СохраняемыйЗаработокНаВремяТрудоустройства))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаВыходноеПособиеПоСокр
	|		ПО (ПараметрыВидаРасчетаВыходноеПособиеПоСокр.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.ВыходноеПособиеПоСокр))//О.Т. 12.09.2014 № 17568
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ПараметрыВидаРасчетаКомпенсацияВзамен
	|			ПО (ПараметрыВидаРасчетаКомпенсацияВзамен.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.КомпенсацияВзаменПредупреждения))//О.Т. Аверсон 20.10.2017 № 1108
	|ГДЕ
	|	РасчетПриУвольненииРаботникаОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();//О.Т. 12.09.2014 № 17568
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части Начисления
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	СпособыРасчетаОтпуска = Новый Массив;
	СпособыРасчетаОтпуска.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням);
	СпособыРасчетаОтпуска.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке);
	Запрос.УстановитьПараметр("СпособыРасчетаОтпуска", СпособыРасчетаОтпуска);
	
	Запрос.УстановитьПараметр("ГрафикРаботы", ВыборкаПоШапкеДокумента.ГрафикРаботы);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ВыборкаПоШапкеДокумента.ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СуммированныйУчетРабочегоВремени", ВыборкаПоШапкеДокумента.СуммированныйУчетРабочегоВремени);
	
	Запрос.УстановитьПараметр("ДатаИзмененийТК2006", ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийТрудовогоКодекса2006());
	//Островская Татьяна 14.01.2013 № 15958
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисление.НомерСтроки,
	|	Начисление.ВидРасчета,
	|	ВЫБОР
	|		КОГДА Начисление.ВидРасчета.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисление.ВидРасчета ССЫЛКА ПланВидовРасчета.УдержанияОрганизаций
	|						ТОГДА Начисление.ВидРасчета.ПериодРасчетаСреднегоЗаработка
	|					ИНАЧЕ Начисление.ВидРасчета.ЧислоМесяцев
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисление.ВидРасчета.СпособРасчета В (&СпособыРасчетаОтпуска)
	|					ТОГДА ВЫБОР
	|							КОГДА Начисление.Ссылка.ДатаУвольнения < &ДатаИзмененийТК2006
	|								ТОГДА 3
	|							ИНАЧЕ 12
	|						КОНЕЦ
	|				ИНАЧЕ 12
	|			КОНЕЦ
	|	КОНЕЦ КАК ЧислоМесяцевРасчета,
	|	ВЫБОР
	|		КОГДА Начисление.ВидРасчета.СпособРасчета В (&СпособыРасчетаОтпуска)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисление.Ссылка.ИспользоватьСреднеЧасовойЗаработок
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|				КОНЕЦ
	|		КОГДА &СуммированныйУчетРабочегоВремени
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	Начисление.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	Начисление.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК Начисления,
	|	Начисление.Размер КАК Показатель1,
	|	НЕОПРЕДЕЛЕНО КАК Показатель2,
	|	НЕОПРЕДЕЛЕНО КАК Показатель3,
	|	НЕОПРЕДЕЛЕНО КАК Показатель4,
	|	НЕОПРЕДЕЛЕНО КАК Показатель5,
	|	НЕОПРЕДЕЛЕНО КАК Показатель6,
	
	//СВЭЙ 06.12.2023 КВВ СВФР-011880 (
	//|	НАЧАЛОПЕРИОДА(Начисление.Ссылка.Дата, ДЕНЬ) КАК БазовыйПериодНачало,
	//|	КОНЕЦПЕРИОДА(Начисление.Ссылка.Дата, ДЕНЬ) КАК БазовыйПериодКонец,
	|ВЫБОР 
	|КОГДА Начисление.Ссылка.ПерерассчитываемыйДокумент = ЗНАЧЕНИЕ(Документ.РасчетПриУвольненииРаботникаОрганизаций.ПустаяСсылка)
	|ТОГДА
	|НАЧАЛОПЕРИОДА(Начисление.Ссылка.Дата, ДЕНЬ) 
	|ИНАЧЕ
	|НАЧАЛОПЕРИОДА(Начисление.Ссылка.ПерерассчитываемыйДокумент.Дата, ДЕНЬ)
	|КОНЕЦ
	|КАК БазовыйПериодНачало,
	
	|ВЫБОР 
	|КОГДА Начисление.Ссылка.ПерерассчитываемыйДокумент = ЗНАЧЕНИЕ(Документ.РасчетПриУвольненииРаботникаОрганизаций.ПустаяСсылка)
	|ТОГДА
	|КОНЕЦПЕРИОДА(Начисление.Ссылка.Дата, ДЕНЬ) 
	|ИНАЧЕ
	|КОНЕЦПЕРИОДА(Начисление.Ссылка.ПерерассчитываемыйДокумент.Дата, ДЕНЬ)
	|КОНЕЦ
	|КАК БазовыйПериодКонец,
	//СВЭЙ 06.12.2023 КВВ СВФР-011880 )
	
	|	НЕОПРЕДЕЛЕНО КАК ЧислоМесяцев,
	|	Начисление.Результат,
	|	Начисление.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Начисление.Сторно,
	|	Начисление.Авторасчет,
	|	Начисление.ОплаченоДнейЧасов,
	|	ВЫБОР
	|		КОГДА Начисление.Сторно
	|			ТОГДА Начисление.Ссылка.ПерерассчитываемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	&ГрафикРаботы КАК ГрафикРаботы,
	|	&ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	Начисление.Ссылка.Сотрудник,
	|	Начисление.ПериодРасчетаСреднегоЗаработкаНачало,
	|	Начисление.ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|		КОГДА Начисление.ВидРасчета ССЫЛКА ПланВидовРасчета.УдержанияОрганизаций
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Удержание,
	|	Начисление.РучнойРасчетСреднегоЗаработка,
	|	Начисление.РазмерСреднегоЗаработка
	|ИЗ
	|	Документ.РасчетПриУвольненииРаботникаОрганизаций.Начисления КАК Начисление
	|ГДЕ
	|	Начисление.Ссылка = &ДокументСсылка";
	//Островская Татьяна 14.01.2013 № 15958
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачислениям()

// Формирует запрос по таблице "РасчетСреднего" документа
//
// Параметры: 
//	Режим	- режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоРасчетСреднего(ВыборкаПоШапкеДокумента,Сч=0) Экспорт 
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",							Ссылка);
	Запрос.УстановитьПараметр("МесяцевВыходноеПособие",					ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие);
	Запрос.УстановитьПараметр("МесяцевСохраняемыйЗаработокНаВремяТрудоустройства", ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства);
	Запрос.УстановитьПараметр("МесяцевКомпенсацияВзамен",					ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен); //О.Т. Аверсон 24.10.2017 № 1108
	
	Запрос.УстановитьПараметр("МесяцевСреднегоДляОтпуска",				ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск);
	Запрос.УстановитьПараметр("ПоСреднемуДляОтпуска",					ВыборкаПоШапкеДокумента.СпособРасчетаПоСреднемуДляОтпуска);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",						НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия));
	Если сч = 1 Тогда //О.Т. Аверсон 20.10.2017 № 1108
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаВыходноеПособие",	ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаДляОтпуска",		ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаСохраняемыйЗаработокНаВремяТрудоустройства", ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаКомпенсацияВзамен",	ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен));
		
		Запрос.УстановитьПараметр("ОкончаниеРасчетногоПериода",				КонецМесяца(ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия) - 1, - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие)));
		
	ИНАЧЕ
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаВыходноеПособие",	ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаВыходноеПособие));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаДляОтпуска",		ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОтпуск));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаСохраняемыйЗаработокНаВремяТрудоустройства", ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаСохраняемыйЗаработокНаВремяТрудоустройства));
		Запрос.УстановитьПараметр("НачалоРасчетногоПериодаКомпенсацияВзамен",	ДобавитьМесяц(НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия), - ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаКомпенсацияВзамен));
		
		Запрос.УстановитьПараметр("ОкончаниеРасчетногоПериода",				НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия) - 1);
	КонецЕсли;	
	ГодовыеПремии = Новый Массив(4);
	ГодовыеПремии[0] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
	//ГодовыеПремии[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
	//ГодовыеПремии[2] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииНеИндексируемые;
	//ГодовыеПремии[3] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииНеИндексируемые;
	Запрос.УстановитьПараметр("ГодовыеПремии", ГодовыеПремии);
	//Островская Татьяна 01.03.2013 № 16286
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОЗаработке.НомерСтроки,
	|	ДанныеОЗаработке.ВидРасчета,
	|	ДанныеОЗаработке.БазовыйПериодНачало,
	|	ДанныеОЗаработке.БазовыйПериодКонец,
	|	ДанныеОЗаработке.ОтработаноПоПятидневке,
	|	ДанныеОЗаработке.НормаПоПятидневке,
	|	ДанныеОЗаработке.ОтработаноДней,
	|	ДанныеОЗаработке.ОтработаноЧасов,
	|	ДанныеОЗаработке.ЧислоМесяцев,
	|	ДанныеОЗаработке.КоэффициентИндексации,
	|	ДанныеОЗаработке.Результат,
	|	&ОкончаниеРасчетногоПериода КАК ДатаОкончанияРасчетногоПериода,
	|	&НачалоРасчетногоПериодаДляОтпуска КАК ДатаНачалаРасчетногоПериода,
	|	&МесяцевСреднегоДляОтпуска КАК ЧислоМесяцевРасчета,
	|	&ПоСреднемуДляОтпуска КАК СпособРасчета,
	|	ДанныеОЗаработке.МесяцВыборки,
	|	ДанныеОЗаработке.Включать
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокаРасчетСреднегоДляОтпуска.НомерСтроки КАК НомерСтроки,
	|		СтрокаРасчетСреднегоДляОтпуска.ВидРасчета КАК ВидРасчета,
	|		СтрокаРасчетСреднегоДляОтпуска.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|		ВЫБОР
	|			КОГДА СтрокаРасчетСреднегоДляОтпуска.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднегоДляОтпуска.БазовыйПериодКонец, ДЕНЬ)
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		КОНЕЦ КАК БазовыйПериодКонец,
	|		СтрокаРасчетСреднегоДляОтпуска.ОтработаноПоПятидневке КАК ОтработаноПоПятидневке,
	|		СтрокаРасчетСреднегоДляОтпуска.НормаПоПятидневке КАК НормаПоПятидневке,
	|		СтрокаРасчетСреднегоДляОтпуска.ОтработаноДней КАК ОтработаноДней,
	|		СтрокаРасчетСреднегоДляОтпуска.ОтработаноЧасов КАК ОтработаноЧасов,
	|		СтрокаРасчетСреднегоДляОтпуска.ЧислоМесяцев КАК ЧислоМесяцев,
	|		СтрокаРасчетСреднегоДляОтпуска.КоэффициентИндексации КАК КоэффициентИндексации,
	|		СтрокаРасчетСреднегоДляОтпуска.Результат КАК Результат,
	|		СтрокаРасчетСреднегоДляОтпуска.МесяцВыборки КАК МесяцВыборки,
	|		СтрокаРасчетСреднегоДляОтпуска.Включать КАК Включать
	|	ИЗ
	|		Документ.РасчетПриУвольненииРаботникаОрганизаций.РасчетСреднегоДляОтпуска КАК СтрокаРасчетСреднегоДляОтпуска
	|	ГДЕ
	|		СтрокаРасчетСреднегоДляОтпуска.Ссылка = &ДокументСсылка
	|		И СтрокаРасчетСреднегоДляОтпуска.Ссылка.ДнейЧасовКомпенсацииУдержанияОтпуска > 0) КАК ДанныеОЗаработке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОЗаработке.НомерСтроки,
	|	ДанныеОЗаработке.ВидРасчета,
	|	ДанныеОЗаработке.БазовыйПериодНачало,
	|	ДанныеОЗаработке.БазовыйПериодКонец,
	|	ДанныеОЗаработке.ОтработаноПоПятидневке,
	|	ДанныеОЗаработке.НормаПоПятидневке,
	|	ДанныеОЗаработке.ОтработаноДней,
	|	ДанныеОЗаработке.ОтработаноЧасов,
	|	ДанныеОЗаработке.ЧислоМесяцев,
	|	ДанныеОЗаработке.КоэффициентИндексации,
	|	ДанныеОЗаработке.Результат,
	|	&ОкончаниеРасчетногоПериода,
	|	Начисления.ДатаНачалаРасчетногоПериода,
	|	Начисления.ЧислоМесяцевРасчета,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку),
	|	ДанныеОЗаработке.МесяцВыборки,
	
	//Аверсон ЕАЕ 08.08.2022 СВФР-009383
	//|	NULL
	|	ИСТИНА
	//Аверсон СВФР-009383
	|ИЗ
	|	(ВЫБРАТЬ
	|		&МесяцевВыходноеПособие КАК ЧислоМесяцевРасчета,
	|		&НачалоРасчетногоПериодаВыходноеПособие КАК ДатаНачалаРасчетногоПериода
	|	ИЗ
	|		Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизаций
	|	ГДЕ
	|		РасчетПриУвольненииРаботникаОрганизаций.Ссылка = &ДокументСсылка
	|		И РасчетПриУвольненииРаботникаОрганизаций.ДнейЧасовВыходногоПособия > 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		&МесяцевСохраняемыйЗаработокНаВремяТрудоустройства,
	|		&НачалоРасчетногоПериодаСохраняемыйЗаработокНаВремяТрудоустройства
	|	ИЗ
	|		Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизаций
	|	ГДЕ
	|		РасчетПриУвольненииРаботникаОрганизаций.Ссылка = &ДокументСсылка
	|		И РасчетПриУвольненииРаботникаОрганизаций.ДнейЧасовСохраненияСреднегоЗаработка > 0
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		&МесяцевКомпенсацияВзамен,
	|		&НачалоРасчетногоПериодаКомпенсацияВзамен
	|	ИЗ
	|		Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизаций
	|	ГДЕ
	|		РасчетПриУвольненииРаботникаОрганизаций.Ссылка = &ДокументСсылка
	|		И РасчетПриУвольненииРаботникаОрганизаций.КомпенсВзаменПредупрежденияМес > 0) КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтрокаРасчетСреднего.НомерСтроки КАК НомерСтроки,
	|			СтрокаРасчетСреднего.ВидРасчета КАК ВидРасчета,
	|			СтрокаРасчетСреднего.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|			ВЫБОР
	|				КОГДА СтрокаРасчетСреднего.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднего.БазовыйПериодКонец, ДЕНЬ)
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			КОНЕЦ КАК БазовыйПериодКонец,
	|			СтрокаРасчетСреднего.ОтработаноПоПятидневке КАК ОтработаноПоПятидневке,
	|			СтрокаРасчетСреднего.НормаПоПятидневке КАК НормаПоПятидневке,
	|			СтрокаРасчетСреднего.ОтработаноДней КАК ОтработаноДней,
	|			СтрокаРасчетСреднего.ОтработаноЧасов КАК ОтработаноЧасов,
	|			СтрокаРасчетСреднего.ЧислоМесяцев КАК ЧислоМесяцев,
	|			СтрокаРасчетСреднего.КоэффициентИндексации КАК КоэффициентИндексации,
	|			СтрокаРасчетСреднего.Результат КАК Результат,
	|			ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку) КАК СпособРасчета,
	|			СтрокаРасчетСреднего.МесяцВыборки КАК МесяцВыборки
	|		ИЗ
	|			Документ.РасчетПриУвольненииРаботникаОрганизаций.РасчетСреднего КАК СтрокаРасчетСреднего
	|		ГДЕ
	|			СтрокаРасчетСреднего.Ссылка = &ДокументСсылка) КАК ДанныеОЗаработке
	|		ПО (&МесяцевВыходноеПособие = &НачалоРасчетногоПериодаВыходноеПособие
	|				ИЛИ НЕ ДанныеОЗаработке.ВидРасчета В (&ГодовыеПремии)
	|					И Начисления.ДатаНачалаРасчетногоПериода <= ДанныеОЗаработке.БазовыйПериодНачало
	|					И &ОкончаниеРасчетногоПериода >= ДанныеОЗаработке.БазовыйПериодКонец
	|				ИЛИ ДанныеОЗаработке.ВидРасчета В (&ГодовыеПремии)
	//Аверсон 11.07.2021 КВВ СВФР-007560 ( (закомментировано. в Оплата по среднему проверки нет)
	//|					И Начисления.ДатаНачалаРасчетногоПериода = ДанныеОЗаработке.БазовыйПериодНачало
	//|					И &ОкончаниеРасчетногоПериода = ДанныеОЗаработке.БазовыйПериодКонец
	//Аверсон 11.07.2021 КВВ СВФР-007560 ) (закомментировано)
	|)";
	//Островская Татьяна 01.03.2013 № 16286
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРасчетСреднего()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется начисление!", Отказ, Заголовок);
	КонецЕсли;
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ДнейЧасовКомпенсацииУдержанияОтпуска <> 0 И НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПорядокРасчетаОтпуска) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не  указан порядок расчета отпуска!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры:
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Расчет среднего"": ";
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета среднего заработка!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала базового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала базового периода!", Отказ, Заголовок);
		// Дата окончания базового периода
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания базового периода!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.БазовыйПериодКонец < ВыборкаПоСтрокамДокумента.БазовыйПериодНачало Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала базового периода не может быть больше даты окончания базового периода!", Отказ, Заголовок);
	КонецЕсли; 
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРасчетСреднего()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры:
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, НаборРасчетСреднего)
	
	СуммаРесурсов = ВыборкаПоСтрокамДокумента.Результат 
	+ ВыборкаПоСтрокамДокумента.ОтработаноДней + ВыборкаПоСтрокамДокумента.ОтработаноЧасов 
	+ ВыборкаПоСтрокамДокумента.ОтработаноПоПятидневке + ВыборкаПоСтрокамДокумента.НормаПоПятидневке;
	
	Если СуммаРесурсов <> 0 Тогда
		
		Движение = НаборРасчетСреднего.Добавить();
		
		СтрокаСвойствИзДокумента = "ПериодРегистрации,Сотрудник,ФизЛицо,Организация,ДатаНачалаСобытия";
		СтрокаСвойствИзСтрокиДокумента = "БазовыйПериодНачало,БазовыйПериодКонец,ВидРасчета,СпособРасчета,Результат," 
		+ "ДатаНачалаРасчетногоПериода,ДатаОкончанияРасчетногоПериода,"
		+ "ОтработаноПоПятидневке,НормаПоПятидневке,ОтработаноДней,ОтработаноЧасов,"
		+ "КоэффициентИндексации,ЧислоМесяцев,МесяцВыборки,Включать"; //Островская Татьяна 22.10.2013 № 16864
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
		
		// Реквизиты
		Движение.ПериодРасчетаСреднегоЗаработка	= ВыборкаПоСтрокамДокумента.ЧислоМесяцевРасчета;
		//О.Т. 12.09.2014 № 17568
		//Если ВыходноеПособиеПоСокр и ДнейЧасовВыходногоПособия > 0 и 
		если Движение.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку Тогда
			Движение.Включать = Истина;			
		КонецЕсли;
		//О.Т. 12.09.2014 № 17568
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРасчетаСреднего()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента						- выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, УчетЗадолженностиПоМесяцам)
	
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ) Тогда
		
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		
		//СВЭЙ 11.03.2024 КВВ СВФР-012584 (
		//Движение.Период						= НачалоМесяца(ПериодРегистрации); //О.Т. 06.08.2014 № 159
		//Движение.ПериодРегистрации			= НачалоМесяца(ПериодПодоходногоНалога);//О.Т. Аверсон 01.06.2017 № 686
		Движение.Период						= НачалоМесяца(ПериодПодоходногоНалога); 
		Движение.ПериодРегистрации			= НачалоМесяца(ПериодРегистрации);
		//СВЭЙ 11.03.2024 КВВ СВФР-012584 )
		
		
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.КодДохода					= ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ;
		//Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета.Подоходный2023) Тогда 
		//	Движение.КодДохода				= Справочники.ДоходыНДФЛ.НайтиПоКоду(СокрЛП(ВыборкаПоСтрокамДокумента.ВидРасчета.Подоходный2023)); 
		//КОнецЕсли;
		
			Если  ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ) Тогда
			Попытка 
				Если (Число(СокрЛП(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ))>501 и Число(СокрЛП(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ))< 900) Тогда  
					Движение.КодВычета 	            = Справочники.ВычетыНДФЛ.НайтиПоКоду(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ);
					Движение.СуммаВычета			= ВыборкаПоСтрокамДокумента.Результат;   
				КонецЕсли;
			Исключение
			КонецПопытки;
		Иначе   
			Движение.КодВычета	 	 		= ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ; 
		КонецЕсли;
		// Ресурсы
		Движение.СуммаДохода				= ВыборкаПоСтрокамДокумента.Результат; 
		
		// Реквизиты
		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ИсчисленоИзЗарплаты		= Истина;
		Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период						= КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;
	
	// Измерения
	Движение.Организация				= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов		= ПериодРегистрации;
	КонецЕсли;
	
	// Ресурсы
	Если ВыборкаПоСтрокамДокумента.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускКалендарныеДни ИЛИ
		ВыборкаПоСтрокамДокумента.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.УдержаниеЗаНеотработанныйОтпускШестидневка Тогда
		
		Движение.СуммаВзаиморасчетов	= -ВыборкаПоСтрокамДокумента.Результат;
		
	Иначе
		Движение.СуммаВзаиморасчетов	= ВыборкаПоСтрокамДокумента.Результат;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоКомпенсации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Движение = Движения.ФактическиеОтпускаОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= ВыборкаПоШапкеДокумента.ДатаУвольнения;
	
	// Измерения
	Движение.Сотрудник				= ВыборкаПоШапкеДокумента.Сотрудник;
	Движение.ВидЕжегодногоОтпуска	= ВыборкаПоШапкеДокумента.ВидЕжегодногоОтпуска;
	
	// Ресурсы
	Движение.Количество				= ВыборкаПоСтрокамДокумента.Показатель1 * ?(ВыборкаПоСтрокамДокумента.Сторно, -1, 1) * ?(ВыборкаПоСтрокамДокумента.Удержание, -1, 1);
	
	// Реквизиты
	Движение.ЭтоКомпенсация			= Истина;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоКомпенсации()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ДатаУвольнения
	Если НЕ ЗначениеЗаполнено(ДатаУвольнения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата увольнения работника!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат
	КонецЕсли; 
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	//Надо позвать проверку заполнения реквизитов шапки
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	
	// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
	Если НЕ Отказ Тогда
		
		УчетнаяПолитикаПоПерсоналуОрганизации  = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");	
		// ведется ли учет задолженности в разрезе периодов возникновения задолженности
		УчетЗадолженностиПоМесяцам				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "УчетЗадолженностиПоМесяцам");
		
		// получим реквизиты табличной части
		ВыборкаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего(ВыборкаПоШапкеДокумента).Выбрать();
		//О.Т. Аверсон 25.10.2017 № 1108
		Если ВыборкаПоРасчетСреднего.количество() = 0 Тогда 
			ВыборкаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего(ВыборкаПоШапкеДокумента,1).Выбрать();
		КонецЕсли;
		//О.Т. Аверсон 25.10.2017 № 1108
		
		Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок);
			Если НЕ Отказ Тогда
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Движения.РасчетСреднегоЗаработка);
			КонецЕсли;
		КонецЦикла;
		
		// перепишем данные из таблицы начислений в набор записей
		ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
		Пока ВыборкаПоНачислениям.Следующий() Цикл 
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
			Если НЕ Отказ Тогда
				Если ВыборкаПоНачислениям.Начисления Тогда
					ПроведениеРасчетов.ДобавитьСтрокуДополнительныхНачислений(Движения.ДополнительныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				Иначе
					ПроведениеРасчетов.ДобавитьСтрокуУдержаний(Движения.УдержанияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				КонецЕсли;
				ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
				//
				//Если ВыборкаПоШапкеДокумента.ВидЕжегодногоОтпуска <> NULL Тогда
				//	ДобавитьСтрокуВДвиженияПоКомпенсации(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для каждого Движение Из Движения.УдержанияРаботниковОрганизаций Цикл
			Движение.ДатаНачалаСобытия = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия;
		КонецЦикла;
		
		// выполним удаление перерасчетов исправленного документа
		Если Не Отказ И ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
			ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПроверкаРасчетаСреднегоЗаработка() Экспорт //Островская Татьяна 30.10.2013 № 16864
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СУММА(РасчетПриУвольненииРаботникаОрганизацийРасчетСреднегоДляОтпуска.Результат) КАК Сумма,
	|	КОЛИЧЕСТВО(РасчетПриУвольненииРаботникаОрганизацийРасчетСреднегоДляОтпуска.Включать) КАК КолМесяцев
	|ИЗ
	|	Документ.РасчетПриУвольненииРаботникаОрганизаций.РасчетСреднегоДляОтпуска КАК РасчетПриУвольненииРаботникаОрганизацийРасчетСреднегоДляОтпуска
	|ГДЕ
	|	РасчетПриУвольненииРаботникаОрганизацийРасчетСреднегоДляОтпуска.Включать
	|	И РасчетПриУвольненииРаботникаОрганизацийРасчетСреднегоДляОтпуска.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СреднемесячнаяЗП = 0; 
	
	мСтрокаН = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', Сотрудник, 0,Организация);//О.Т. Аверсон 16.10.2017 № 1120
	
	Если Результат.Количество() > 0 Тогда
		если не Результат[0].КолМесяцев = 0 Тогда //Островская Татьяна 18.09.2013 № 16778
			СреднемесячнаяЗП = ОбщегоНазначения.ОкруглитьЗначение2016(Результат[0].Сумма / Результат[0].КолМесяцев, ПериодРегистрации);//О.Т. Аверсон 17.03.2016 № 949
			
			Для Каждого ТекСтрока из РасчетСреднегоДляОтпуска Цикл
				
				//проверку на дату приема
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ВложенныйЗапрос.ДатаПриема,
				|	ДОБАВИТЬКДАТЕ(ВложенныйЗапрос.ДатаКалендаря, ГОД, -(&ГодВыборки - ГОД(ВложенныйЗапрос.ДатаПриема))) КАК РабочаяДатаПриема
				|ИЗ
				|	(ВЫБРАТЬ
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
				|		МИНИМУМ(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК ДатаКалендаря
				|	ИЗ
				|		Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
				|			ПО (ДОБАВИТЬКДАТЕ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема, ГОД, &ГодВыборки - ГОД(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема)) >= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
				|				И (НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема, ГОД, &ГодВыборки - ГОД(ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема)), МЕСЯЦ) = НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ))
				|	ГДЕ
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник = &ФизЛицо
				|		И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема) КАК ВложенныйЗапрос";
				
				Запрос.УстановитьПараметр("ФизЛицо", Сотрудник);
				Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
				Запрос.УстановитьПараметр("ГодВыборки", Год(ТекСтрока.МесяцВыборки));
				РезПрием = Запрос.Выполнить().Выбрать();
				ДатаПриема = Дата(1,1,1);
				ДатаРабДняВыборки = Дата(1,1,1);
				Если РезПрием.Следующий() Тогда 
					ДатаПриема = РезПрием.ДатаПриема;
					ДатаРабДняВыборки = РезПрием.РабочаяДатаПриема;
				КонецЕсли;
				
				Если НачалоМесяца(ТекСтрока.МесяцВыборки) = НачалоМесяца(мСтрокаН.Период) Тогда
					Если ДатаПриема > ДатаРабДняВыборки Тогда
						ТекСтрока.Включать = Ложь;
						Сообщить("Месяц выборки " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " исключается из расчета среднего заработка, т.к. работник принят на работу " + Формат(мСтрокаН.Период, "ДЛФ=D"));
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				//проверка на дату вольнения
				мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(КонецМесяца(ТекСтрока.МесяцВыборки), Сотрудник, 1,Организация);//О.Т. Аверсон 16.10.2017 № 1120
				Если ТипЗнч(мСтрока.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
					Если мСтрока.Период < КонецМесяца(ТекСтрока.МесяцВыборки) Тогда
						ТекСтрока.Включать = Ложь;
						Сообщить("Месяц выборки " + Формат(ТекСтрока.МесяцВыборки, "ДЛФ=D") + " исключается из расчета среднего заработка, т.к. работник уволен " + Формат(мСтрока.Период, "ДЛФ=D"));
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				если не Организация.НормаВОтпускахПоГрРасчетов Тогда //О.Т. 09.09.2014 № 17567
					//проверка на больничные листы
					Если ТекСтрока.Включать Тогда 
						//Островская Татьяна 03.12.2013 № 16960
						если ТекСтрока.ОтработаноЧасов < ТекСтрока.НормаЧасов Тогда 
							ТекСтрока.Включать = Ложь;
							Сообщить("Проверьте правильность включения месяцев в расчет!");
						КонецЕсли;					
						//Островская Татьяна 03.12.2013 № 16960
						
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ВыборкаБЛ = СформироватьДанныеПоБЛ(НачалоМесяца(ТекСтрока.МесяцВыборки), КонецМесяца(ТекСтрока.БазовыйПериодКонец));
				//О.Т. 28.08.2014 № 17551
				если Дата < Дата(2014,07,25) Тогда 
					Если ВыборкаБЛ.Количество() > 0 Тогда
						БЛ_80 = Ложь;
						
						ВыборкаБЛ.Выбрать();
						Пока ВыборкаБЛ.Следующий() Цикл
							Если ВыборкаБЛ.Показатель1 = 80 Тогда
								БЛ_80 = Истина;
							КонецЕсли;
						КонецЦикла;
						
						Если БЛ_80 = Ложь Тогда
							ТекСтрока.Включать = Истина;
						Иначе
							Если ТекСтрока.Результат >= СреднемесячнаяЗП Тогда
								ТекСтрока.Включать = Истина;
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если ТекСтрока.Результат >= СреднемесячнаяЗП Тогда
							ТекСтрока.Включать = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//О.Т. 28.08.2014 № 17551
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьДанныеПоБЛ(БазовыйПериодНачало, БазовыйПериодКонец) //Островская Татьяна 30.10.2013 № 16864
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1,
	|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту
	|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачПериод И &КонПериод
	|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	|	И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
	|	
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1";
	
	Запрос.УстановитьПараметр("НачПериод", БазовыйПериодНачало);
	Запрос.УстановитьПараметр("КонПериод", БазовыйПериодКонец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток 		= 86400; // в секундах

