////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//	НазваниеМакета	- строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если Не Проведен Тогда
		//РаботаСДиалогами.ВывестиПредупреждение("Документ можно распечатать только после расчета и проведения!");
		//Возврат Неопределено;
		//О.Т. Аверсон 24.02.2017 № 346
		ТекстВопроса = "Документ можно распечатать только после расчета и проведения! Провести?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Неопределено;
		иначе
			попытка
				ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Возврат Неопределено;
			КонецПопытки;
			
		КонецЕсли;
		//О.Т. Аверсон 24.02.2017 № 346
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат Неопределено;
	КонецЕсли;

	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	ТЗДаты = Новый ТаблицаЗначений;
	ТЗДаты.Колонки.Добавить("ДатаНачала");
	ТЗДаты.Колонки.Добавить("ДатаОкончания");
	ТЗДаты.Колонки.Добавить("ОплачиватьЧасов");
	
	ЭтоЦелосменныйНевыход = СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены;

	Если НесколькоДней Тогда
		Даты.Сортировать("Дата");
		Для Каждого Стр Из Даты Цикл
			Если ЭтоЦелосменныйНевыход Тогда
				Если (Стр.НомерСтроки = 1) Тогда
					НоваяСтр = ТЗДаты.Добавить();
					НоваяСтр.ДатаНачала = Стр.Дата;
				Иначе
					ИндексПредыдущейСтроки = Стр.НомерСтроки - 2;
					ПредыдущаяДата = Стр.Дата - 86400;
					Если Даты[ИндексПредыдущейСтроки].Дата <> ПредыдущаяДата Тогда
						НоваяСтр = ТЗДаты.Добавить();
						НоваяСтр.ДатаНачала = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
				Если Стр.НомерСтроки = Даты.Количество() Тогда
					НоваяСтр.ДатаОкончания = Стр.Дата;
				Иначе
					ИндексСледующейСтроки = Стр.НомерСтроки;
					СледующаяДата = Стр.Дата + 86400;
					Если Даты[ИндексСледующейСтроки].Дата <> СледующаяДата Тогда
						НоваяСтр.ДатаОкончания = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
			Иначе
				НоваяСтр = ТЗДаты.Добавить();
				НоваяСтр.ДатаНачала = Стр.Дата;
				НоваяСтр.ДатаОкончания = Стр.Дата;
				НоваяСтр.ОплачиватьЧасов = Стр.Часы;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтр = ТЗДаты.Добавить();
		НоваяСтр.ДатаНачала = ДатаНачала;
		НоваяСтр.ДатаОкончания = ДатаОкончания;
		НоваяСтр.ОплачиватьЧасов = ОплачиватьЧасов;
	КонецЕсли;
	//Аверсон СВФР-007091
	
	// Получить экземпляр документа на печать
	
	Для Каждого СтрДата Из ТЗДаты Цикл //Аверсон ЕАЕ 09.03.2021 СВФР-007091 цикл по датам
		//Аверсон ЕАЕ 09.03.2021 СВФР-007091
		Если НесколькоДней Тогда
			ДатаНачала = СтрДата.ДатаНачала;
			ДатаОкончания = СтрДата.ДатаОкончания;
			
			Если Не ЭтоЦелосменныйНевыход Тогда
				ОплачиватьЧасов = СтрДата.ОплачиватьЧасов;
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-007091
		
		Если ИмяМакета = "РасчетСреднегоЗаработка" Тогда
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			ВыборкаПоШапкеДокумента.Следующий();
			ТабДокумент = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаНачала, ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработка, "с " + Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy"), ВидРасчета.СпособРасчета,ФлагОплатаПоЧасам,,,,,Начисления);
			//толик
			ТабДокумент.АвтоМасштаб = Истина;
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (расчет среднего заработка)");
			//
		ИначеЕсли ИмяМакета = "СреднедневнаяЗарплата" Тогда
			ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
			ВыборкаПоШапкеДокумента.Следующий();
			ТабДокумент = СреднеДневнаяЗП();
			//толик
			Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (расчет среднего заработка)");
		КонецЕсли;
		
	КонецЦикла; //Аверсон СВФР-007091 конец цикла по датам
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	Если НесколькоДней Тогда
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		ОплачиватьЧасов = 0;
	КонецЕсли;
	//Аверсон СВФР-007091
	
КонецФункции // Печать()

Функция Месяц_Я(_Дата_)
	//Аверсон 15.05.2023 КВВ СВФР-010837 (
	Месяц_Я = нрег(Формат(_Дата_,"ДФ=ММММ")) + "ь";
	Месяц_Я = СтрЗаменить(Месяц_Я,"йь","я");
	Месяц_Я = СтрЗаменить(Месяц_Я,"ьь","я"); 
	Месяц_Я = СтрЗаменить(Месяц_Я,"ь","а"); 
	Возврат Месяц_Я;
	//Аверсон 15.05.2023 КВВ СВФР-010837 )
КонецФункции

Функция ПолучитьОтвественного(ОтветственноеЛицо)
	//Аверсон 15.05.2023 КВВ СВФР-010837 (
	ЗапросОтветственные = Новый Запрос;
	ЗапросОтветственные.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииОтветственныеЛица.Сотрудник
	|ИЗ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
	|ГДЕ
	|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И ОрганизацииОтветственныеЛица.Ссылка = &Ссылка";
	ЗапросОтветственные.УстановитьПараметр("Ссылка",Организация);
	ЗапросОтветственные.УстановитьПараметр("ОтветственноеЛицо",ОтветственноеЛицо);
	Возврат ЗапросОтветственные.Выполнить().Выгрузить();
	//Аверсон 15.05.2023 КВВ СВФР-010837 )
КонецФункции

Функция ТекстЗапросаПоСреднеДневнойЗП()
	 ТекстЗапроса = 	 
	//ПСА 30.09.2021 СВФР-008202 +++
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ОплатаПоСреднемуЗаработкуРасчетСреднего.МесяцВыборки КАК Период,
	//|	ОплатаПоСреднемуЗаработкуРасчетСреднего.Ссылка.Физлицо КАК Физлицо,
	//|	СУММА(ОплатаПоСреднемуЗаработкуРасчетСреднего.Результат) КАК ЗП,
	//|	СУММА(ОплатаПоСреднемуЗаработкуРасчетСреднего.ОтработаноДней) КАК КолДней
	//|ИЗ
	//|	Документ.ОплатаПоСреднемуЗаработку.РасчетСреднего КАК ОплатаПоСреднемуЗаработкуРасчетСреднего
	//|ГДЕ
	//|	ОплатаПоСреднемуЗаработкуРасчетСреднего.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОплатаПоСреднемуЗаработкуРасчетСреднего.Ссылка.Физлицо,
	//|	ОплатаПоСреднемуЗаработкуРасчетСреднего.МесяцВыборки
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Период
	//|ИТОГИ
	//|	СУММА(ЗП),
	//|	СУММА(КолДней)
	//|ПО
	//|	ОБЩИЕ";
	
	 "ВЫБРАТЬ
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.МесяцВыборки КАК МесяцВыборки,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.Ссылка.Физлицо КАК Физлицо,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.Результат * ОплатаПоСреднемуЗаработкуРасчетСреднего.КоэффициентИндексации КАК ЗП,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.ОтработаноДней КАК КолДней,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.НормаПоПятидневке КАК НормаДней,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.ОтработаноПоПятидневке КАК ФактДней,
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.ВидРасчета
	 |ПОМЕСТИТЬ ВтДанные
	 |ИЗ
	 |	Документ.ОплатаПоСреднемуЗаработку.РасчетСреднего КАК ОплатаПоСреднемуЗаработкуРасчетСреднего
	 |ГДЕ
	 |	ОплатаПоСреднемуЗаработкуРасчетСреднего.Ссылка = &Ссылка
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	МесяцВыборки,
	 |	Физлицо
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтДанные.МесяцВыборки КАК МесяцВыборки,
	 |	ВтДанные.Физлицо КАК Физлицо,
	 |	МАКСИМУМ(ВтДанные.КолДней) КАК КолДней
	 |ПОМЕСТИТЬ ВтДни
	 |ИЗ
	 |	ВтДанные КАК ВтДанные
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВтДанные.МесяцВыборки,
	 |	ВтДанные.Физлицо
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	МесяцВыборки,
	 |	Физлицо
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтДанные.МесяцВыборки КАК МесяцВыборки,
	 |	ВтДанные.Физлицо КАК Физлицо,
	 |	СУММА(ВЫБОР
	 |			КОГДА ВтДанные.ВидРасчета = &ГодоваяПремия
	 |				ТОГДА ВЫБОР
	 |						КОГДА ВтДанные.НормаДней = 0
	 |								ИЛИ ВтДанные.ФактДней = 0
	 |								ИЛИ ВтДанные.ФактДней > ВтДанные.НормаДней
	 |							ТОГДА ВтДанные.ЗП
	 |						ИНАЧЕ ВтДанные.ЗП * ВтДанные.ФактДней / ВтДанные.НормаДней
	 |					КОНЕЦ
	 |			ИНАЧЕ ВтДанные.ЗП
	 |		КОНЕЦ) КАК ЗП
	 |ПОМЕСТИТЬ ВТ_ЗП
	 |ИЗ
	 |	ВтДанные КАК ВтДанные
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВтДанные.МесяцВыборки,
	 |	ВтДанные.Физлицо
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	МесяцВыборки,
	 |	Физлицо
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ВтДанные.МесяцВыборки,
	 |	ВтДанные.Физлицо
	 |ПОМЕСТИТЬ ВтМесяца
	 |ИЗ
	 |	ВтДанные КАК ВтДанные
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВтМесяца.МесяцВыборки КАК Период,
	 |	ВтМесяца.Физлицо,
	 |	СУММА(ЕСТЬNULL(ВтДни.КолДней, 0)) КАК КолДней,
	 |	ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(ВТ_ЗП.ЗП, 0))КАК ЧИСЛО(15, 2)) КАК ЗП
	 |ИЗ
	 |	ВтМесяца КАК ВтМесяца
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВтДни КАК ВтДни
	 |		ПО ВтМесяца.МесяцВыборки = ВтДни.МесяцВыборки
	 |			И ВтМесяца.Физлицо = ВтДни.Физлицо
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗП КАК ВТ_ЗП
	 |		ПО ВтМесяца.МесяцВыборки = ВТ_ЗП.МесяцВыборки
	 |			И ВтМесяца.Физлицо = ВТ_ЗП.Физлицо
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВтМесяца.МесяцВыборки,
	 |	ВтМесяца.Физлицо
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Период
	 |ИТОГИ
	 |	СУММА(КолДней),
	 |	СУММА(ЗП)
	 |ПО
	 |	ОБЩИЕ";
	 //+++ПСА 30.09.2021 СВФР-008202
	 
	Возврат ТекстЗапроса;
КонецФункции

Функция СреднеДневнаяЗП()
	мСумма = 0;
	мЗп = 0;
	мНДФЛ = 0;
	мПенс = 0;
    мПрофвз = 0;
    мПрУдер = 0;
	Макет = ПолучитьМакет("Макет7");
	ЗапросИ = Новый Запрос;
	ЗапросИ.Текст = ТекстЗапросаПоСреднеДневнойЗП();
	ЗапросИ.УстановитьПараметр("ГодоваяПремия", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии); //ПСА 30.09.2021 СВФР-008202 

    //О.Т. 26.09.2014 № 235
	ЗапросИ.УстановитьПараметр("Ссылка", Ссылка);


	Результат = ЗапросИ.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
//	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьГруппа1 = Макет.ПолучитьОбласть("Итог");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Макет3"; //О.Т. Аверсон 01.06.2017 № 680
	мСтрокаН = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', Сотрудник, 0);
	мСтрокаК = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(ТекущаяДата(), Сотрудник);
	
	ФразаСклоненнаяДолжность = "";
	УправлениеОтчетами.Просклонять(глСклонение,?(мСтрокаК = Null,"",мСтрокаК.Должность),2,ФразаСклоненнаяДолжность,,ложь);//О.Т. Аверсон 24.02.2017 № 336 ,726
	
	СотрудникСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,Сотрудник.Физлицо.Наименование,3,Сотрудник.Физлицо.Пол,,ложь); //О.Т. Аверсон 24.02.2017 № 336
	РегистрРаботники = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",Сотрудник)); 
	Если Организация.ИНН = "700067572" Тогда
		Попытка
			//ОбластьЗаголовок.Параметры.Год = Формат(Год(КонДата),"ЧГ=0");
			ОбластьЗаголовок.Параметры.Шапка = "Дана гр. " + ВРег(Сотрудник.Наименование)+ " (таб.ном."+Сотрудник.Код+", "+РегистрРаботники.ПодразделениеОрганизации+
			") в том, что он(а) работает в "+Строка(Организация.НаименованиеПолное)+" г.Бобруйск" +
			" и его(её) заработок по месяцам составил:";
		Исключение
			//ОбластьЗаголовок.Параметры.Год = Формат(Год(КонДата),"ЧГ=0");
			ОбластьЗаголовок.Параметры.Шапка = "Дана гр. " + ВРег(Сотрудник.Наименование)+ " (таб.ном."+Сотрудник.Код+", "+РегистрРаботники.ПодразделениеОрганизации+
			") в том, что он(а) работает в организации" +  
			" и его(её) заработок по месяцам составил:";	
		КонецПопытки;
	Иначе
		Попытка
			//ОбластьЗаголовок.Параметры.Год = Формат(Год(КонДата),"ЧГ=0");
			ОбластьЗаголовок.Параметры.Шапка = "Дана гр. " + ВРег(Сотрудник.Наименование)+ " (таб.ном."+Сотрудник.Код+", "+РегистрРаботники.ПодразделениеОрганизации+
			") в том, что он(а) работает в "+Строка(Организация.Наименование)+" г.Минска" +
			" и его(её) заработок по месяцам составил:";
		Исключение
			//ОбластьЗаголовок.Параметры.Год = Формат(Год(КонДата),"ЧГ=0");
			ОбластьЗаголовок.Параметры.Шапка = "Дана гр. " + ВРег(Сотрудник.Наименование)+ " (таб.ном."+Сотрудник.Код+", "+РегистрРаботники.ПодразделениеОрганизации+
			") в том, что он(а) работает в организации" +  
			" и его(её) заработок по месяцам составил:";	
		КонецПопытки; 		
	КонецЕсли;
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	мЗп = 0;
	мКолДней = 0;
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбщийИтог.Следующий() Цикл
		ВыборкаДетали = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДетали.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетали);
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЦикла;
		мЗп = ВыборкаОбщийИтог.ЗП;
		мКолДней = ВыборкаОбщийИтог.КолДней;
		
		ОбластьГруппа1.Параметры.Зп = мЗп;
		ОбластьГруппа1.Параметры.КолДней = мКолДней;
		
		ТабДок.Вывести(ОбластьГруппа1);
	КонецЦикла;                     
	СреднийЗП = ОбщегоНазначения.ОкруглитьЗначение2016(?(ЗначениеЗаполнено(мКолДней),мЗп /мКолДней,0),ПериодРегистрации); 
	ОбластьПодвал.Параметры.СрЗаработок =СреднийЗП; 
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ОбластьПодвал.Параметры.Прописью = РаботаСДиалогами.СформироватьСуммуПрописью(СреднийЗП, Валюта);
	
//	ОбластьПодвал.Параметры.ТекДата = РабочаяДата;
		
	ЗапросОтвЛ = Новый Запрос;
	ЗапросОтвЛ.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо,
	|	ОрганизацииОтветственныеЛица.Сотрудник
	|ИЗ
	|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
	|ГДЕ
	|	ОрганизацииОтветственныеЛица.Ссылка = &Ссылка";
	ЗапросОтвЛ.УстановитьПараметр("Ссылка", Организация);//О.Т. Аверсон 13.06.2017 № 726
	Ответственные = ЗапросОтвЛ.Выполнить().Выбрать();
	Пока Ответственные.Следующий() цикл
		если Ответственные.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель тогда
			Руководитель = Ответственные.Сотрудник;
		ИначеЕсли Ответственные.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер тогда 
			ГлавныйБухгалтер = Ответственные.Сотрудник;
		КонецЕсли;
	КонецЦикла;
	ОбластьПодвал.Параметры.Руководитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(Руководитель);
	ОбластьПодвал.Параметры.ГлавныйБухгалтер = ОбщегоНазначения.ФамилияИнициалыФизЛица(ГлавныйБухгалтер);
	
	
   
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДок.ТолькоПросмотр = Ложь;
	
	возврат ТабДок;
КонецФункции


#КонецЕсли

// Процедура рассчитывает начисления по среднему и заполняет реквизит Результат таблицы начислений
//
// Параметры:
//	РассчитываемыеТаблицы	- структура из элементов, соответствующих табличным частям документа. 
//							  Значение Истина для каждого из элементов структуры означает необходимость расчета 
//							  соответствующей табличной части документа
//	РежимПерерасчета		- булево - признак вызов расчета при перерасчете документа
//
Процедура Рассчитать(РассчитываемыеТаблицы, РежимПерерасчета = Ложь) Экспорт
	
	//Перед вызовом процедуры документ должнен быть записан, движения должны быть удалены 
	//Островская Татьяна 04.12.2013 № 16 средний для ремондиса
	//если Организация.КодАктивацииТранспорта <> "" Тогда
	//	ДатаНачПрошл = Дата("00010101000000");
	//	Начисления.Сортировать("ДатаНачала");
	//	ВремТаблНачисления = Начисления.Выгрузить();
	//	Начисления.Очистить();
	//	для Каждого СтрНач из ВремТаблНачисления Цикл 
	//		если СтрНач.НомерСтроки = 1 Тогда 
	//			Строка = Начисления.Добавить();
	//			ЗаполнитьЗначенияСвойств(Строка,СтрНач);
	//		иначе
	//			если НачалоМесяца(СтрНач.ДатаНачала) = НачалоМесяца(ДатаНачПрошл) Тогда 
	//				Строка.ДатаОкончания =  СтрНач.ДатаОкончания;
	//				Строка.ОплачиватьЧасов = Строка.ОплачиватьЧасов+ СтрНач.ОплачиватьЧасов;
	//			иначе
	//				Строка = Начисления.Добавить();
	//				ЗаполнитьЗначенияСвойств(Строка,СтрНач);
	//			КонецЕсли;
	//		КонецЕсли;
	//		ДатаНачПрошл = Строка.ДатаНачала;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	Начисления.Очистить();
	//ЗначениеОплатаПоЧасам = 0;
	
	ТЗДаты = Новый ТаблицаЗначений;
	ТЗДаты.Колонки.Добавить("ДатаНачала");
	ТЗДаты.Колонки.Добавить("ДатаОкончания");
	ТЗДаты.Колонки.Добавить("ОплачиватьЧасов");
	
	ЭтоЦелосменныйНевыход = СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены;
	
	Если НесколькоДней Тогда
		Даты.Сортировать("Дата");
		Для Каждого Стр Из Даты Цикл
			Если ЭтоЦелосменныйНевыход Тогда
				Если (Стр.НомерСтроки = 1) Тогда
					НоваяСтр = ТЗДаты.Добавить();
					НоваяСтр.ДатаНачала = Стр.Дата;
				Иначе
					ИндексПредыдущейСтроки = Стр.НомерСтроки - 2;
					ПредыдущаяДата = Стр.Дата - 86400;
					Если Даты[ИндексПредыдущейСтроки].Дата <> ПредыдущаяДата Тогда
						НоваяСтр = ТЗДаты.Добавить();
						НоваяСтр.ДатаНачала = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
				Если Стр.НомерСтроки = Даты.Количество() Тогда
					НоваяСтр.ДатаОкончания = Стр.Дата;
				Иначе
					ИндексСледующейСтроки = Стр.НомерСтроки;
					СледующаяДата = Стр.Дата + 86400;
					Если Даты[ИндексСледующейСтроки].Дата <> СледующаяДата Тогда
						НоваяСтр.ДатаОкончания = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
			Иначе
				НоваяСтр = ТЗДаты.Добавить();
				НоваяСтр.ДатаНачала = Стр.Дата;
				НоваяСтр.ОплачиватьЧасов = Стр.Часы;
				НоваяСтр.ДатаОкончания = Стр.Дата;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтр = ТЗДаты.Добавить();
		НоваяСтр.ДатаНачала = ДатаНачала;
		НоваяСтр.ДатаОкончания = ДатаОкончания;
		НоваяСтр.ОплачиватьЧасов = ОплачиватьЧасов;
	КонецЕсли;
	//Аверсон СВФР-007091
	
	Для Каждого СтрД Из ТЗДаты Цикл //Аверсон ЕАЕ 09.03.2021 СВФР-007091 цикл по датам
		//Аверсон ЕАЕ 09.03.2021 СВФР-007091
		Если НесколькоДней Тогда
			ДатаНачала = СтрД.ДатаНачала;
			ДатаОкончания = СтрД.ДатаОкончания;
			
			Если Не ЭтоЦелосменныйНевыход Тогда
				ОплачиватьЧасов = СтрД.ОплачиватьЧасов;
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-007091
		
		// О.Т. 24.11.2014 269
		
		//Аверсон ЕАЕ 09.03.2021 СВФР-007091
		если ФлагОплатаПоЧасам и не ЗначениеЗаполнено(ЗначениеОплатаПоЧасам) Тогда
		//если ФлагОплатаПоЧасам Тогда
		//Аверсон СВФР-007091
		
			ДатаИндивидНач = ДатаНачала;
			ДатаИндивидКон = ДатаОкончания;
			ТаблицаДат = Новый ТаблицаЗначений;
			ТаблицаДат.Колонки.Добавить("ДатаНачала");
			ТаблицаДат.Колонки.Добавить("ДатаОкончания");
			если Месяц(ДатаИндивидНач) <> Месяц(ДатаИндивидКон) Тогда
				Пока НачалоМесяца(ДатаИндивидНач) <= НачалоМесяца(ДатаИндивидКон) Цикл 
					СтрТаблицаДат = ТаблицаДат.Добавить();
					СтрТаблицаДат.ДатаНачала = ДатаИндивидНач;
					если Месяц(ДатаИндивидНач)= Месяц(ДатаИндивидКон) Тогда 
						СтрТаблицаДат.ДатаОкончания = ДатаИндивидКон;
					иначе
						СтрТаблицаДат.ДатаОкончания = КонецМесяца(ДатаИндивидНач);
					КонецЕсли;
					ДатаИндивидНач = НачалоМесяца(ДобавитьМесяц(ДатаИндивидНач,1));
				КонецЦикла;
				
			иначе
				СтрТаблицаДат = ТаблицаДат.Добавить();
				СтрТаблицаДат.ДатаНачала = ДатаИндивидНач;
				СтрТаблицаДат.ДатаОкончания = ДатаИндивидКон;
			КонецЕсли;
			
			НормаВремениПоГрафику = 0;
			для Каждого СтрДата из ТаблицаДат Цикл 
				НормаВремениПоГрафику = ПрочиеПроцедуры.ПолучитьДанныеПоИндивидуальномуЗаИнтервал(СтрДата.ДатаНачала,СтрДата.ДатаОкончания,Сотрудник).КоличествоЧасов;  
				Если не ЗначениеЗаполнено(НормаВремениПоГрафику)  Тогда
					мСтрокаГрафик = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации),
					Новый Структура("Организация, Сотрудник", Сотрудник.Организация, Сотрудник));
					НормаВремениПоГрафику = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(мСтрокаГрафик.ГрафикРаботы, Перечисления.ВидыУчетаВремени.ПоЧасам, СтрДата.ДатаНачала,СтрДата.ДатаОкончания,Организация);//О.Т. 03.06.2015 № 448
				КонецЕсли;
				
				//Аверсон ЕАЕ 10.02.2021 СВФР-007090
				ТЗКолвоДнКом = ПроведениеРасчетов.ПроверитьКомандировкиИОплатуПоСреднему(Организация, Сотрудник, СтрДата.ДатаНачала, СтрДата.ДатаОкончания);
				Если ТЗКолвоДнКом.Количество() > 0 Тогда
					ЧасовКомандировки = ТЗКолвоДнКом.Итог("Часов");
					Если ЧасовКомандировки > НормаВремениПоГрафику Тогда
						РазницаЧасов = ЧасовКомандировки - НормаВремениПоГрафику;
						НормаВремениПоГрафику = НормаВремениПоГрафику + РазницаЧасов;
					КонецЕсли;
				КонецЕсли;
				//Аверсон СВФР-007090
				
				//Аверсон ЕАЕ 12.03.2021 СВФР-007091
				Если НормаВремениПоГрафику = Null Тогда
					НормаВремениПоГрафику = 0;
				КонецЕсли;
				//Аверсон СВФР-007091
				
				//Аверсон ЕАЕ 05.05.2021 СВФР-007556
				//Если Не НесколькоДней Тогда
				//	ЗначениеОплатаПоЧасам = ЗначениеОплатаПоЧасам+НормаВремениПоГрафику;
				//КонецЕсли;
				//Аверсон СВФР-007556
			КонецЦикла;
			
			
		КонецЕсли;  
		Записать();
		// О.Т. 24.11.2014 269
		
		Отказ = Ложь;
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		// позиционируем выборку
		ВыборкаПоШапкеДокумента.Следующий();
		
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		Если ВидРасчета.ПериодРасчетаСреднегоЗаработка = 0 Тогда 
			Сообщить("Не заполнен период расчета среднего заработка");
			Отказ = Истина;
		КонецЕсли;
		
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// Если почасовое отклонение, то записываем движения в регистр ВнутрисменноеВремяРаботниковОрганизаций
		НаборЗаписейРабочееВремя = Движения.ВнутрисменноеВремяРаботниковОрганизаций;
		Если ВыборкаПоШапкеДокумента.ЯвляетсяПочасовымОтклонением И ВыборкаПоШапкеДокумента.ОплачиватьЧасов <> 0 Тогда
			Движение = НаборЗаписейРабочееВремя.Добавить();
			
			// Свойства
			Движение.Период								= ВыборкаПоШапкеДокумента.ДатаНачала;
			
			// Измерения
			Движение.Сотрудник							= ВыборкаПоШапкеДокумента.Сотрудник;
			Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоШапкеДокумента.ВидИспользованияРабочегоВремени;
			
			// Ресурсы
			Движение.Часов								= ВыборкаПоШапкеДокумента.ОплачиватьЧасов;
			НаборЗаписейРабочееВремя.Записать();
		КонецЕсли;
		
		Отказ = Не ПроведениеРасчетов.РассчитатьДокументСреднегоЗаработка(ЭтотОбъект, РассчитываемыеТаблицы, ВыборкаПоШапкеДокумента, РежимПерерасчета,,СтрД.ДатаНачала);  //Аверсон 08.11.2022 КВВ СВФР-009796 (добавлено СтрД.ДатаНачала)
		
		// Удаляем движения для режима интерактивного расчета
		Если Не РежимПерерасчета Тогда
			НаборЗаписейРабочееВремя.Очистить();
			НаборЗаписейРабочееВремя.Записать();
		КонецЕсли;
		
	КонецЦикла; //Аверсон СВФР-007091 конец цикла по датам
	
	//Аверсон 14.07.2023 КВВ СВФР-011110 (
	Если Ссылка.НесколькоДней И ЗначениеЗаполнено(Ссылка.ПерерассчитываемыйДокумент) Тогда
		СтарыеДаты = Ссылка.ПерерассчитываемыйДокумент.Начисления.Выгрузить(); 
		НовыеДаты = Начисления.Выгрузить();   
		Внесено = Ложь;
		Для Каждого СД ИЗ СтарыеДаты Цикл
			ОтборНД = Новый Структура;
			ОтборНД.Вставить("ДатаНачала", СД.ДатаНачала);
			СтрокиНД = НовыеДаты.НайтиСтроки(ОтборНД);   
			Если СтрокиНД.Количество() = 0 Тогда
				НовС = Начисления.Добавить();
				ЗаполнитьЗначенияСвойств(НовС, СД);	 
				НовС.Сторно = Истина;
				НовС.Авторасчет = Ложь;
				Внесено = Истина;
			КонецЕсли;
		КонецЦикла;	   
		Если Внесено Тогда
			Начисления.Сортировать("ДатаНачала,Сторно");
		КонецЕсли;
	КонецЕсли;	
	//Аверсон 14.07.2023 КВВ СВФР-011110 )
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	Если НесколькоДней Тогда
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		ОплачиватьЧасов = 0;
	КонецЕсли;
	//Аверсон СВФР-007091
	
КонецПроцедуры // Рассчитать()

// Выполняет перерасчет по заданному списку физлиц
//
// Параметры:
//	Физлица		- массив - ссылки на физлиц
//
// Возвращаемое значение:
//	Нет.
//
Процедура Перерассчитать(Физлица = Неопределено) Экспорт

	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	// Выполним полный перерасчет документа
	Рассчитать(Новый Структура("Начисления,РасчетСреднего",Истина,Истина), Истина);
	
	// Зафиксируем данные табличных частей после расчета
	Записать();
	
	Движения.НДФЛСведенияОДоходах.Очистить();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Движения.ВнутрисменноеВремяРаботниковОрганизаций.Очистить();
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	ТЗДаты = Новый ТаблицаЗначений;
	ТЗДаты.Колонки.Добавить("ДатаНачала");
	ТЗДаты.Колонки.Добавить("ДатаОкончания");
	ТЗДаты.Колонки.Добавить("ОплачиватьЧасов");
	
	ЭтоЦелосменныйНевыход = СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены;
	
	Если НесколькоДней Тогда
		Даты.Сортировать("Дата");
		Для Каждого Стр Из Даты Цикл
			Если ЭтоЦелосменныйНевыход Тогда
				Если (Стр.НомерСтроки = 1) Тогда
					НоваяСтр = ТЗДаты.Добавить();
					НоваяСтр.ДатаНачала = Стр.Дата;
				Иначе
					ИндексПредыдущейСтроки = Стр.НомерСтроки - 2;
					ПредыдущаяДата = Стр.Дата - 86400;
					Если Даты[ИндексПредыдущейСтроки].Дата <> ПредыдущаяДата Тогда
						НоваяСтр = ТЗДаты.Добавить();
						НоваяСтр.ДатаНачала = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
				Если Стр.НомерСтроки = Даты.Количество() Тогда
					НоваяСтр.ДатаОкончания = Стр.Дата;
				Иначе
					ИндексСледующейСтроки = Стр.НомерСтроки;
					СледующаяДата = Стр.Дата + 86400;
					Если Даты[ИндексСледующейСтроки].Дата <> СледующаяДата Тогда
						НоваяСтр.ДатаОкончания = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
			Иначе
				НоваяСтр = ТЗДаты.Добавить();
				НоваяСтр.ДатаНачала = Стр.Дата;
				НоваяСтр.ДатаОкончания = Стр.Дата;
				НоваяСтр.ОплачиватьЧасов = Стр.Часы;
			КонецЕсли;
		КонецЦикла;
	Иначе
		НоваяСтр = ТЗДаты.Добавить();
		НоваяСтр.ДатаНачала = ДатаНачала;
		НоваяСтр.ДатаОкончания = ДатаОкончания;
		НоваяСтр.ОплачиватьЧасов = ОплачиватьЧасов;
	КонецЕсли;
	//Аверсон СВФР-007091
	
	Для Каждого СтрДата Из ТЗДаты Цикл //Аверсон ЕАЕ 09.03.2021 СВФР-007091 цикл по датам
		
		//Аверсон ЕАЕ 09.03.2021 СВФР-007091
		Если НесколькоДней Тогда
			ДатаНачала = СтрДата.ДатаНачала;
			ДатаОкончания = СтрДата.ДатаОкончания;
			
			Если Не ЭтоЦелосменныйНевыход Тогда
				ОплачиватьЧасов = СтрДата.ОплачиватьЧасов;
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-007091
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		
		// Получение учетной политики по персоналу организации
		// ведется ли учет задолженности в разрезе периодов возникновения задолженности
		УчетЗадолженностиПоМесяцам = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
		
		ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
		Пока ВыборкаПоНачислениям.Следующий() Цикл
			ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
			Если ВыборкаПоНачислениям.ЯвляетсяПочасовымОтклонением Тогда
				ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ВнутрисменноеВремяРаботниковОрганизаций);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Набор Из Движения Цикл
			ТипНабораЗаписей = ТипЗнч(Набор);
			Если ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.НДФЛСведенияОДоходах") 
				Или ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.ВзаиморасчетыСРаботникамиОрганизаций") 
				Или ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.ВнутрисменноеВремяРаботниковОрганизаций") Тогда
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла; //Аверсон СВФР-007091 конец цикла по датам
	
	// Удалим записи перерасчета по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	Если НесколькоДней Тогда
		ДатаНачала = '00010101';
		ДатаОкончания = '00010101';
		ОплачиватьЧасов = 0;
	КонецЕсли;
	//Аверсон СВФР-007091
КонецПроцедуры // Перерассчитать()

// Заполняет документ по перерассчитываемому документу
// ИсходныйДокумент - тип ДокументОбъект.ОплатаПоСреднемуЗаработку
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ПерерассчитываемыйДокумент,,
		"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный,НачислятьМатериальнуюПомощь,МатериальнаяПомощьДокумент,МатериальнаяПомощьВидРасчета"); // кроме указанных
	
КонецПроцедуры // ЗаполнитьПоПерерассчитываемомуДокументу()

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("РасчетСреднегоЗаработка",	"Расчет среднего заработка");
	СтруктураМакетов.Вставить("СреднедневнаяЗарплата",	"Среднедневная зарплата"); //О.Т. Аверсон 03.04.2018 № 1802
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует соответствие в котором находятся действующие графики сотрудника 
// на указанные даты
Функция ПолучитьГрафикРаботыСотрудника(Сотрудник, ДатыПолучения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СписокДат", ДатыПолучения);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботыПоВидамВремени.Месяц КАК ДатаПолучения
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.Месяц В(&СписокДат)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДатаПолучения");
	
КонецФункции // ПолучитьГрафикРаботыСотрудника()

// Выполняет проверку непрерывности интервалов начислений
//
Процедура ПроверитьНепрерывностьЗаписейНачислений(Отказ, Заголовок)
	
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТНачислений = Начисления.Выгрузить();
	ТНачислений.Сортировать("ДатаНачала");
	
	ПредыдущаяДатаОкончания = '00010101';
	СтрокаНеПервая = Ложь;
	Для Каждого Строка ИЗ ТНачислений Цикл
		
		// Пропустим сторно записи и доначисления
		Если Строка.Сторно или Строка.ВидРасчета <> ВидРасчета Тогда
			Продолжить;
		КонецЕсли;
		
		// если встретили не первую строку начислений
		Если СтрокаНеПервая Тогда
			// строка не первая
			Если Строка.ДатаНачала <> ПредыдущаяДатаОкончания + мДлинаСуток Тогда
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
				""" табл. части ""Начисления"": ";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "нарушено требование непрерывности записей начислений!", Отказ, Заголовок);
			КонецЕсли;
			
		Иначе
			СтрокаНеПервая = Истина;
			
		КонецЕсли;
		ПредыдущаяДатаОкончания = Строка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНепрерывностьЗаписейНачислений()

// Формирует записи регистра "ОсновныеНачисленияРаботниковОрганизаций" по данным шапки документа
//
Процедура СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборОсновныеНачисления) Экспорт 
	
	
	Если ВыборкаПоШапкеДокумента.СуммированныйУчетРабочегоВремени Или ВыборкаПоШапкеДокумента.ЯвляетсяПочасовымОтклонением Тогда
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
	Иначе
//толик		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
		ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам;
	КонецЕсли;
	
	ТекущаяДатаНачала = ДатаНачала;
	ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончания);
	МассивДат = Новый Массив;
	Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
		МассивДат.Добавить(НачалоМесяца(ТекущаяДатаНачала));
		ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончания);				
	КонецЦикла;
	МесяцыРасчетаВремениПоТабелю = ПолучитьГрафикРаботыСотрудника(ВыборкаПоШапкеДокумента.Сотрудник, МассивДат);
	
	ТекущаяДатаНачала = ДатаНачала;
	ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончания);
	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
	
	//Аверсон ЕАЕ 12.04.2021
	//Островская Татьяна 11.11.2013 № 16
	//если Организация.КодАктивацииТранспорта <> "" Тогда 
	//	для Каждого СтрСтрокаНач из Начисления Цикл 
	//		// строка движений
	//		Движение = НаборОсновныеНачисления.Добавить();
	//		
	//		// Свойства
	//		Движение.ПериодРегистрации			= ПериодРегистрации;
	//		Движение.ПериодДействияНачало		= СтрСтрокаНач.ДатаНачала;
	//		Движение.ПериодДействияКонец		= КонецДня(СтрСтрокаНач.ДатаОкончания);
	//		Движение.ВидРасчета					= ВидРасчета;
	//		
	//		// Измерения
	//		Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
	//		Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
	//		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	//		
	//		// Реквизиты
	//		Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплаты;
	//		Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
	//		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	//		
	//		Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда
	//			Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
	//		Иначе
	//			Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
	//		КонецЕсли; 
	//		
	//		Движение.ВидУчетаВремени			= ВидУчетаВремени;
	//		Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаНачало;
	//		Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
	//		Движение.ДатаНачалаСобытия			= ?(ЗначениеЗаполнено(ДатаНачалаВыборки),ДобавитьМесяц(НачалоМесяца(ДатаНачалаВыборки),ВидРасчета.ПериодРасчетаСреднегоЗаработка),СтрСтрокаНач.ДатаНачала);
	//		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
	//		Если Движение.РучнойРасчетСреднегоЗаработка тогда
	//			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
	//		КонецЕсли;
	//		Движение.Авторасчет					= Истина;
	//		//Движение.ОплачиватьЧасов = 	СтрСтрокаНач.ОплачиватьЧасов; //Островская Татьяна 04.12.2013 № 16 средний для ремондиса
	//	КонецЦикла;
	//иначе
	//Аверсон	
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			
		// строка движений
		Движение = НаборОсновныеНачисления.Добавить();
		
		// Свойства
		Движение.ПериодРегистрации			= ПериодРегистрации;
		Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
		Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
		Движение.ВидРасчета					= ВидРасчета;
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;

		// Реквизиты
		Движение.Показатель1				= ВыборкаПоШапкеДокумента.ПроцентОплаты;
		Движение.ПодразделениеОрганизации	= ВыборкаПоШапкеДокумента.ПодразделениеОрганизации;
		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		
		//СВЭЙ 29.07.2024 КВВ СВФР-013224 ( 
		ПроверкаИндивидуального = ПрочиеПроцедуры.ПолучитьДанныеПоИндивидуальному(ВыборкаПоШапкеДокумента.ПериодРегистрации,ВыборкаПоШапкеДокумента.Сотрудник);
		//Если МесяцыРасчетаВремениПоТабелю.Найти(НачалоМесяца(ТекущаяДатаНачала)) = Неопределено Тогда   
		Если ПроверкаИндивидуального.КоличествоЧасов = 0 Тогда     // если инд график должно быть по норме инд   18.10.24
			Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		Иначе
			Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.Сотрудник;
		КонецЕсли; 
		
		//Движение.ГрафикРаботы			= ВыборкаПоШапкеДокумента.ГрафикРаботы;
		//СВЭЙ 29.07.2024 КВВ СВФР-013224 )

		
		Движение.ВидУчетаВремени			= ВидУчетаВремени;
		Движение.ПериодРасчетаСреднегоЗаработкаНачало	= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаНачало;
		Движение.ПериодРасчетаСреднегоЗаработкаОкончание= ВыборкаПоШапкеДокумента.ПериодРасчетаСреднегоЗаработкаОкончание;
		Движение.ДатаНачалаСобытия			= ?(ЗначениеЗаполнено(ДатаНачалаВыборки),ДобавитьМесяц(НачалоМесяца(ДатаНачалаВыборки),ВидРасчета.ПериодРасчетаСреднегоЗаработка),ДатаНачала);
		Движение.РучнойРасчетСреднегоЗаработка = ВыборкаПоШапкеДокумента.РучнойРасчетСреднегоЗаработка;
		Если Движение.РучнойРасчетСреднегоЗаработка тогда
			Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
		КонецЕсли;
		Движение.Авторасчет					= Истина;			
		ТекущаяДатаНачала = ТекущаяДатаОкончания + 1;
		
		ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончания);				
		
	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры // СформироватьДвиженияПоНачислениям()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке(ДатаНач = Неопределено, ДатаКон = Неопределено, ОплЧасов = Неопределено) //Аверсон ЕАЕ 11.03.2021 СВФР-007091 параметры

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//Запрос.УстановитьПараметр("ДатаНачала",				ДатаНачала);
	Если ДатаНач = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаНачала",				ДатаНачала);
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала",				ДатаНач);
	КонецЕсли;
	Если ДатаКон = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаОкончания",				ДатаОкончания);
	Иначе
		Запрос.УстановитьПараметр("ДатаОкончания",				ДатаКон);
	КонецЕсли;
	Если ОплЧасов = Неопределено Тогда
		Запрос.УстановитьПараметр("ОплачиватьЧасов",			ОплачиватьЧасов);
	Иначе
		Запрос.УстановитьПараметр("ОплачиватьЧасов",			ОплЧасов);
	КонецЕсли;
	//Аверсон СВФР-007091
	
	Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
//толик - перерасчет 1 01 2009	

	мДатаИзмененияЗП = ПрочиеПроцедуры.ОпределитьДатуИзмененияЗП(Организация);
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//мМесяц = НачалоМесяца(ДатаНачала);
	Если ДатаНач = Неопределено Тогда
		мМесяц = НачалоМесяца(ДатаНачала);
	Иначе
		мМесяц = НачалоМесяца(ДатаНач);
	КонецЕсли;
	//Аверсон СВФР-007091
	
	//Если мМесяц = мДатаИзмененияЗП Тогда
	//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка-1;
	//	КоличествоМесяцевРасчета = 0;
	//	СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
	//ИначеЕсли мМесяц = ДобавитьМесяц(мДатаИзмененияЗП, 1) Тогда
	//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
	//	КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка+1;
	//	СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
	//Иначе
// по ходу не нужно
		ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		СекундыКонцаПериода = -1;
	//КонецЕсли;
	
//проверим был ли принят в расчетном месяце

	мСтрока = РегистрыСведений.РаботникиОрганизаций.СрезПервых('19000101000000',
		Новый Структура("Организация, Сотрудник", Организация, Сотрудник));
	Если мСтрока.Количество() <>  0 Тогда
		//(начало) закомментировано Кухарчуком Д.Я. 13.09.18, Задача СВФР-002436
		//Если НачалоМесяца(мСтрока[0].Период) = НачалоМесяца(мМесяц) Тогда
		//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка-1;
		//	КоличествоМесяцевРасчета = 0;
		//	СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
		//КонецЕсли;
		
		//Если НачалоМесяца(мСтрока[0].Период) = ДобавитьМесяц(НачалоМесяца(мМесяц), -1) Тогда
		//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		//	КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка+1;
		//	СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
		//КонецЕсли;
		//(конец) закомментировано Кухарчуком Д.Я. 13.09.18, Задача СВФР-002436
		
		//(начало) добавлено Кухарчуком Д.Я. 13.09.18, Задача СВФР-002436
		ДатаПриемаНаРаботу = мСтрока[0].Период;
		НачалоМесяцаПриема = НачалоМесяца( ДатаПриемаНаРаботу );
		НачалоПрошлогогоМесяца = ДобавитьМесяц( мМесяц, -1 );
		НачалоПозапрошлогогоМесяца = ДобавитьМесяц( мМесяц, -2 );
		Если НачалоМесяцаПриема = мМесяц Тогда
			ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка-1;
			КоличествоМесяцевРасчета = 0;
			СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
		//+ СВЭЙ КДЯ 26.09.19 СВФР-002436	
		//ИначеЕсли НачалоМесяцаПриема = НачалоПрошлогогоМесяца
		//	 		ИЛИ НачалоМесяцаПриема = НачалоПозапрошлогогоМесяца И ДатаПриемаНаРаботу > НачалоПозапрошлогогоМесяца Тогда
		//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка - 1;
		//	КоличествоМесяцевРасчета = -1;
		//- СВЭЙ КДЯ 26.09.19 СВФР-002436	
		//+ СВЭЙ КДЯ 26.09.19 СВФР-002436	
		ИначеЕсли НачалоМесяцаПриема = НачалоПрошлогогоМесяца Тогда
			ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка - 1;
			КоличествоМесяцевРасчета = -1;
		ИначеЕсли НачалоМесяцаПриема = НачалоПозапрошлогогоМесяца Тогда
			КоличествоМесяцевРасчета = -2;
		//- СВЭЙ КДЯ 26.09.19 СВФР-002436	
		КонецЕсли;
		//(конец) добавлено Кухарчуком Д.Я. 13.09.18, Задача СВФР-002436
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодРСЗ",	ПериодРСЗ);
	Запрос.УстановитьПараметр("КоличествоМесяцевРасчета",	КоличествоМесяцевРасчета);
	Запрос.УстановитьПараметр("СекундыКонцаПериода",	СекундыКонцаПериода);
	
//енд	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатаПоСреднемуЗаработку.Дата,
	|	ОплатаПоСреднемуЗаработку.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднемуЗаработку.Организация
	|		ИНАЧЕ ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОплатаПоСреднемуЗаработку.Организация
	|		ИНАЧЕ ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ОплатаПоСреднемуЗаработку.Организация КАК ОбособленноеПодразделение,
	|	ОплатаПоСреднемуЗаработку.Ссылка,
	|	ОплатаПоСреднемуЗаработку.Сотрудник,
	|	ОплатаПоСреднемуЗаработку.Сотрудник.Физлицо КАК Физлицо,
	|	ОплатаПоСреднемуЗаработку.ПроцентОплаты,
	|	ОплатаПоСреднемуЗаработку.ВидРасчета,
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ОплатаПоСреднемуЗаработку.ДатаНачала,
	//|	ОплатаПоСреднемуЗаработку.ДатаНачала КАК ДатаНачалаСобытия,
	//|	ОплатаПоСреднемуЗаработку.ДатаОкончания,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаНачала КАК ДатаНачалаСобытия,
	|	&ДатаОкончания КАК ДатаОкончания,
	//Аверсон СВФР-007091
	
	|	ОплатаПоСреднемуЗаработку.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	&ПериодРСЗ КАК ПериодРасчетаСреднегоЗаработка,
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ВЫБОР
	//|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	//|		ТОГДА ВЫБОР
	//|		КОГДА ОплатаПоСреднемуЗаработку.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОплатаПоСреднемуЗаработку.ДатаНачала, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	//|	КОНЕЦ иначе ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки Конец КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|	ВЫБОР
	|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
	|		ТОГДА ВЫБОР
	|		КОГДА &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	|	КОНЕЦ иначе ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки Конец КАК ПериодРасчетаСреднегоЗаработкаНачало,
	//Аверсон СВФР-007091
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ВЫБОР
	//|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ВЫБОР
	//|		КОГДА ОплатаПоСреднемуЗаработку.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОплатаПоСреднемуЗаработку.ДатаНачала, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	//|	КОНЕЦ иначе ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки,месяц,&ПериодРСЗ), СЕКУНДА, &СекундыКонцаПериода) конец КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ВЫБОР
	|		КОГДА &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	|	КОНЕЦ иначе ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки,месяц,&ПериодРСЗ), СЕКУНДА, &СекундыКонцаПериода) конец КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	//Аверсон СВФР-007091
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ВЫБОР
	//|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ВЫБОР
	//|		КОГДА ОплатаПоСреднемуЗаработку.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОплатаПоСреднемуЗаработку.ДатаНачала, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	//|	КОНЕЦ иначе ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки Конец КАК ДатаНачалаРасчетногоПериода,
	|	ВЫБОР
	|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ВЫБОР
	|		КОГДА &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	|	КОНЕЦ иначе ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки Конец КАК ДатаНачалаРасчетногоПериода,
	//Аверсон СВФР-007091
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ВЫБОР
	//|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ТОГДА ВЫБОР
	//|		КОГДА ОплатаПоСреднемуЗаработку.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОплатаПоСреднемуЗаработку.ДатаНачала, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	//|	КОНЕЦ иначе ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки,месяц,&ПериодРСЗ), СЕКУНДА, &СекундыКонцаПериода) конец КАК ДатаОкончанияРасчетногоПериода,
	|	ВЫБОР
	|	КОГДА ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ТОГДА ВЫБОР
	|		КОГДА &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	|	КОНЕЦ иначе ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ОплатаПоСреднемуЗаработку.ДатаНачалаВыборки,месяц,&ПериодРСЗ), СЕКУНДА, &СекундыКонцаПериода) конец КАК ДатаОкончанияРасчетногоПериода,
	//Аверсон СВФР-007091
	
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачала
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачала
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачала
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|		КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	ОплатаПоСреднемуЗаработку.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.СпособРегистрацииВремени = ЗНАЧЕНИЕ(Перечисление.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РегистрируютсяПочасовыеОтклонения,
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//|	ОплатаПоСреднемуЗаработку.ОплачиватьЧасов КАК ОплачиватьЧасов,
	|	&ОплачиватьЧасов КАК ОплачиватьЧасов,
	//Аверсон СВФР-007091
	
	|	ОплатаПоСреднемуЗаработку.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	ОплатаПоСреднемуЗаработку.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	ОплатаПоСреднемуЗаработку.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.Сотрудник.Организация = ВЫБОР
	|				КОГДА ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ОплатаПоСреднемуЗаработку.Организация
	|				ИНАЧЕ ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация
	|			КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА ОплатаПоСреднемуЗаработку.Дата < ОплатаПоСреднемуЗаработку.ПериодРегистрации
	|			ТОГДА ОплатаПоСреднемуЗаработку.ПериодРегистрации
	|		КОГДА ОплатаПоСреднемуЗаработку.Дата > КОНЕЦПЕРИОДА(ОплатаПоСреднемуЗаработку.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(ОплатаПоСреднемуЗаработку.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ ОплатаПоСреднемуЗаработку.Дата
	|	КОНЕЦ КАК ПериодРегистрацииДополнительныхНачислений,
	|	ОплатаПоСреднемуЗаработку.РазмерСреднегоЗаработка,
	|	ОплатаПоСреднемуЗаработку.РучнойРасчетСреднегоЗаработка
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачала, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (РаботникиОрганизацииСрезПоследних.Организация = ВЫБОР
	|				КОГДА ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ОплатаПоСреднемуЗаработку.Организация
	|				ИНАЧЕ ОплатаПоСреднемуЗаработку.Организация.ГоловнаяОрганизация
	|			КОНЕЦ)
	|ГДЕ
	|	ОплатаПоСреднемуЗаработку.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части Начисления
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента, ДатаНач = Неопределено, Сторно = Неопределено) //Аверсон ЕАЕ 11.03.2021 СВФР-007091, Аверсон ЕАЕ 03.08.2021 СВФР-007926 параметр Сторно

	Запрос = Новый Запрос;

	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",			СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	
	//Аверсон ЕАЕ 11.03.2021 СВФР-007091
	//Запрос.УстановитьПараметр("ДатаНачала",						ДатаНачала);
	Если ДатаНач = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаНачала",						ДатаНачала);
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала",						ДатаНач);
	КонецЕсли;
	//Аверсон СВФР-007091
	
	Запрос.УстановитьПараметр("Сотрудник",						Сотрудник);
	Запрос.УстановитьПараметр("СуммированныйУчетРабочегоВремени", ВыборкаПоШапкеДокумента.СуммированныйУчетРабочегоВремени);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ГоловнаяОрганизация);
	КодОплатыТрудаПоНДФЛ = Новый Массив;
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.КодДоходаПоУмолчанию);
	//КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код2012);
	Запрос.УстановитьПараметр("КодОплатыТрудаПоНДФЛ", КодОплатыТрудаПоНДФЛ);
	
	//+ СВЭЙ 01.03.19 КДЯ 01.03.19
	//с целью оптимизации запроса, комментим прежний запрос и используем его справочно,
	//в качестве исходной базы для преобразований оптимизации
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	СтрокиНачисления.НомерСтроки,
//	|	СтрокиНачисления.ВидРасчета,
//	|	СтрокиНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
//	|	СтрокиНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
//	|	СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
//	|			ТОГДА СтрокиНачисления.ДатаНачала
//	|		ИНАЧЕ СтрокиНачисления.Ссылка.ПериодРегистрации
//	|	КОНЕЦ КАК МесяцНалоговогоПериода,
//	|	СтрокиНачисления.ДатаНачала,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|	КОНЕЦ КАК ДатаОкончания,
//	|	СтрокиНачисления.ДатаНачала КАК ПериодДействияНачало,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|	КОНЕЦ КАК ПериодДействияКонец,
//	|	СтрокиНачисления.ДатаНачала КАК БазовыйПериодНачало,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
//	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|	КОНЕЦ КАК БазовыйПериодКонец,
//	|	ВЫБОР
//	|		КОГДА &СуммированныйУчетРабочегоВремени
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
//	|		КОГДА СтрокиНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
//	|	КОНЕЦ КАК ВидУчетаВремени,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением,
//	|	СтрокиНачисления.Показатель1,
//	|	СтрокиНачисления.Показатель2,
//	|	СтрокиНачисления.Показатель3,
//	|	СтрокиНачисления.Показатель4,
//	|	СтрокиНачисления.Показатель5,
//	|	СтрокиНачисления.Показатель6,
//	|	СтрокиНачисления.Результат,
//	|	СтрокиНачисления.ДополнительныеДанные,
//	|	СтрокиНачисления.ПодразделениеОрганизации,
//	|	СтрокиНачисления.ОплаченоДнейЧасов,
////толик
//	|	СтрокиНачисления.ОплаченоДней,
////
//	|	СтрокиНачисления.ОтработаноДней,
//	|	СтрокиНачисления.ОтработаноЧасов,
//	|	СтрокиНачисления.ОтработаноДнейПоПятидневке,
//	|	СтрокиНачисления.ОтработаноЧасовПоПятидневке,
//	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
//	|	СтрокиНачисления.НормаДней,
//	|	СтрокиНачисления.НормаЧасов,
//	|	СтрокиНачисления.НормаДнейПоПятидневке,
//	|	СтрокиНачисления.НормаЧасовПоПятидневке,
//	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаНачало,
//	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаОкончание,
//	|	ВЫБОР
//	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
//	|			ТОГДА ВЫБОР
//	|					КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
//	|							И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
//	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
//	|				КОНЕЦ
//	|		ИНАЧЕ СтрокиНачисления.Ссылка.Сотрудник
//	|	КОНЕЦ КАК ГрафикРаботы,
//	|	ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка) КАК ГрафикРаботыНорма,
//	|	ЕСТЬNULL(ВЫБОР
//	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
//	|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
//	|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.СуммированныйУчетРабочегоВремени
//	|		КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
//	|	СтрокиНачисления.ДатаНачалаСобытия,
//	|	СтрокиНачисления.Сторно,
//	|	ВЫБОР
//	|		КОГДА (НЕ СтрокиНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
//	|	ВЫБОР
//	|		КОГДА СтрокиНачисления.Сторно
//	|			ТОГДА СтрокиНачисления.СторнируемыйДокумент
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ КАК СторнируемыйДокумент,
//	|	СтрокиНачисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления,
//	|	СтрокиНачисления.ЧислоМесяцев,
//	|	СтрокиНачисления.Авторасчет,
//	|	СтрокиНачисления.Ссылка.Сотрудник,
//	|	СтрокиНачисления.РучнойРасчетСреднегоЗаработка,
//	|	СтрокиНачисления.РазмерСреднегоЗаработка
//	|ИЗ
//	|	Документ.ОплатаПоСреднемуЗаработку.Начисления КАК СтрокиНачисления
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
//	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
//	|		ИЗ
//	|			Документ.ОплатаПоСреднемуЗаработку.Начисления КАК СтрокиНачисления
//	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
//	|				ПО (РаботникиОрганизации.Период <= СтрокиНачисления.ДатаНачалаСобытия)
//	|					И СтрокиНачисления.Ссылка.Сотрудник = РаботникиОрганизации.Сотрудник
//	|		ГДЕ
//	|			СтрокиНачисления.Ссылка = &ДокументСсылка
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			СтрокиНачисления.НомерСтроки) КАК ПоследниеДаты
//	|		ПО СтрокиНачисления.НомерСтроки = ПоследниеДаты.НомерСтроки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
//	|		ПО (РаботникиОрганизации.Период = ПоследниеДаты.МаксПериод)
//	|			И СтрокиНачисления.Ссылка.Сотрудник = РаботникиОрганизации.Сотрудник
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
//	|		ИЗ
//	|			Документ.ОплатаПоСреднемуЗаработку.Начисления КАК СтрокиНачисления
//	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
//	|				ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СтрокиНачисления.Ссылка.Сотрудник)
//	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаНачала, МЕСЯЦ))
//	|		ГДЕ
//	|			СтрокиНачисления.Ссылка = &ДокументСсылка) КАК ГрафикРаботыПоСотруднику
//	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
//	|ГДЕ
//	|	СтрокиНачисления.Ссылка = &ДокументСсылка";
	//- СВЭЙ 01.03.19 КДЯ 01.03.19
	
	//+ СВЭЙ 01.03.19 КДЯ 01.03.19
	//оптимизация запроса 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	СтрокиНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
	|	СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
	|			ТОГДА СтрокиНачисления.ДатаНачала
	|		ИНАЧЕ СтрокиНачисления.Ссылка.ПериодРегистрации
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	СтрокиНачисления.ДатаНачала,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаОкончания,
	|	СтрокиНачисления.ДатаНачала КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	СтрокиНачисления.ДатаНачала КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	ВЫБОР
	|		КОГДА &СуммированныйУчетРабочегоВремени
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		КОГДА СтрокиНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеОтработанноеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.ДополнительныеДанные,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОплаченоДней,
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.ОтработаноДнейПоПятидневке,
	|	СтрокиНачисления.ОтработаноЧасовПоПятидневке,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.НормаДнейПоПятидневке,
	|	СтрокиНачисления.НормаЧасовПоПятидневке,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаНачало,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка) КАК ГрафикРаботыНорма,
	|	СтрокиНачисления.ДатаНачалаСобытия,
	|	СтрокиНачисления.Сторно,
	|	ВЫБОР
	|		КОГДА (НЕ СтрокиНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сторно
	|			ТОГДА СтрокиНачисления.СторнируемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	СтрокиНачисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления,
	|	СтрокиНачисления.ЧислоМесяцев,
	|	СтрокиНачисления.Авторасчет,
	|	СтрокиНачисления.Ссылка.Сотрудник,
	|	СтрокиНачисления.РучнойРасчетСреднегоЗаработка,
	|	СтрокиНачисления.РазмерСреднегоЗаработка
	|ПОМЕСТИТЬ ВтСтрокиНачисления
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработку.Начисления КАК СтрокиНачисления
	|ГДЕ
	|	СтрокиНачисления.Ссылка = &ДокументСсылка
	
	//Аверсон ЕАЕ 10.03.2021 СВФР-007091
	|И СтрокиНачисления.ДатаНачала = &ДатаНачала
	//Аверсон СВФР-007091
	
	//Аверсон ЕАЕ 03.08.2021 СВФР-007926
	|%УсловиеСторно%
	//Аверсон СВФР-007926
	
	|ИНДЕКСИРОВАТЬ ПО
	|	СтрокиНачисления.Ссылка.Сотрудник	
	|;
	|
	|ВЫБРАТЬ
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ЗачетОтработанногоВремени,
	|	СтрокиНачисления.ЗачетНормыВремени,
	|	СтрокиНачисления.КодДоходаНДФЛ,
	|	СтрокиНачисления.МесяцНалоговогоПериода,
	|	СтрокиНачисления.ДатаНачала,
	|	СтрокиНачисления.ДатаОкончания,
	|	СтрокиНачисления.ПериодДействияНачало,
	|	СтрокиНачисления.ПериодДействияКонец,
	|	СтрокиНачисления.БазовыйПериодНачало,
	|	СтрокиНачисления.БазовыйПериодКонец,
	|	СтрокиНачисления.ВидУчетаВремени,
	|	СтрокиНачисления.ЯвляетсяПочасовымОтклонением,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.ДополнительныеДанные,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	СтрокиНачисления.ОплаченоДней,
	
	////СВЭЙ 11.10.2023 КВВ СВФР-011499 (
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	//|ВЫБОР КОГДА &ПроверкаДнейЧасов = ИСТИНА И СтрокиНачисления.ОтработаноДней = 0 ТОГДА
	//|СтрокиНачисления.ОтработаноДнейПоПятидневке
	//|ИНАЧЕ СтрокиНачисления.ОтработаноДней
	//|КОНЕЦ КАК ОтработаноДней,
	//|ВЫБОР КОГДА &ПроверкаДнейЧасов = ИСТИНА И СтрокиНачисления.ОтработаноЧасов = 0 ТОГДА
	//|СтрокиНачисления.НормаЧасовПоПятидневке
	//|ИНАЧЕ СтрокиНачисления.ОтработаноЧасов
	//|КОНЕЦ КАК ОтработаноЧасов,
	////СВЭЙ 11.10.2023 КВВ СВФР-011499 )
	
	|	СтрокиНачисления.ОтработаноДнейПоПятидневке,
	|	СтрокиНачисления.ОтработаноЧасовПоПятидневке,
	|	СтрокиНачисления.ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.НормаДнейПоПятидневке,
	|	СтрокиНачисления.НормаЧасовПоПятидневке,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаНачало,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|							И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|				КОНЕЦ
	|		ИНАЧЕ СтрокиНачисления.Сотрудник
	|	КОНЕЦ КАК ГрафикРаботы,
	|	СтрокиНачисления.ГрафикРаботыНорма,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|		КОНЕЦ, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	СтрокиНачисления.ДатаНачалаСобытия,
	|	СтрокиНачисления.Сторно,
	|	СтрокиНачисления.ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	СтрокиНачисления.СторнируемыйДокумент,
	|	СтрокиНачисления.ОсновныеНачисления,
	|	СтрокиНачисления.ЧислоМесяцев,
	|	СтрокиНачисления.Авторасчет,
	|	СтрокиНачисления.Сотрудник,
	|	СтрокиНачисления.РучнойРасчетСреднегоЗаработка,
	|	СтрокиНачисления.РазмерСреднегоЗаработка
	|ИЗ
	|	ВтСтрокиНачисления КАК СтрокиНачисления
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВтСтрокиНачисления КАК СтрокиНачисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ПО (РаботникиОрганизации.Период <= СтрокиНачисления.ДатаНачалаСобытия)
	|					И СтрокиНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|		СГРУППИРОВАТЬ ПО
	|			СтрокиНачисления.НомерСтроки) КАК ПоследниеДаты
	|		
	|		ПО СтрокиНачисления.НомерСтроки = ПоследниеДаты.НомерСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО (РаботникиОрганизации.Период = ПоследниеДаты.МаксПериод)
	|			И РаботникиОрганизации.Сотрудник = СтрокиНачисления.Сотрудник
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВтСтрокиНачисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СтрокиНачисления.Сотрудник)
	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаНачала, МЕСЯЦ))
	|			) КАК ГрафикРаботыПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|";
	//- СВЭЙ 01.03.19 КДЯ 01.03.19

	//Аверсон ЕАЕ 03.08.2021 СВФР-007926
	Если Сторно = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСторно%", "");	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСторно%", "И СтрокиНачисления.Сторно = &Сторно");
		Запрос.УстановитьПараметр("Сторно", Сторно);
	КонецЕсли;
	//Аверсон СВФР-007926
	
	//Запрос.УстановитьПараметр("ПроверкаДнейЧасов",ВидРасчета.ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы); //СВЭЙ 11.10.2023 КВВ СВФР-011499
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоНачислениям()

// Формирует запрос по таблице "РасчетСреднего" документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоРасчетСреднего()

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокаРасчетСреднего.НомерСтроки,
	|	СтрокаРасчетСреднего.Ссылка.Сотрудник,
	|	СтрокаРасчетСреднего.Ссылка.Сотрудник.Физлицо КАК Физлицо,
	|	СтрокаРасчетСреднего.ВидРасчета,
	|	СтрокаРасчетСреднего.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокаРасчетСреднего.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднего.БазовыйПериодКонец, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	СтрокаРасчетСреднего.КоэффициентИндексации,
	|	СтрокаРасчетСреднего.Результат,
	|	СтрокаРасчетСреднего.ОтработаноПоПятидневке,
	|	СтрокаРасчетСреднего.НормаПоПятидневке,
	|	СтрокаРасчетСреднего.ОтработаноДней,
	|	СтрокаРасчетСреднего.ОтработаноЧасов,
	|	СтрокаРасчетСреднего.ЧислоМесяцев,
	|	СтрокаРасчетСреднего.МесяцВыборки,
	|	СтрокаРасчетСреднего.РезультатДляПремии //Аверсон 22.09.2020 КВВ СВФР-006593
	|ИЗ
	|	Документ.ОплатаПоСреднемуЗаработку.РасчетСреднего КАК СтрокаРасчетСреднего
	|ГДЕ
	|	СтрокаРасчетСреднего.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРасчетСреднего()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры:
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")

	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется начисление!", Отказ, Заголовок);
	КонецЕсли;

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;

	// ДатаНачала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) Тогда
		Если Не НесколькоДней Тогда //Аверсон ЕАЕ 10.03.2021 СВФР-007091
			ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала оплачиваемого события!", Отказ, Заголовок);
		КонецЕсли;
	ИначеЕсли Не ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения Тогда
		
		// ДатаОкончания
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания оплачиваемого события!", Отказ, Заголовок);
		ИначеЕсли ВыборкаПоШапкеДокумента.ДатаОкончания < ВыборкаПоШапкеДокумента.ДатаНачала Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Дата окончания оплачиваемого события не должна быть меньше даты начала!", Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан вид расчета!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения <> ВыборкаПоШапкеДокумента.ЯвляетсяПочасовымОтклонением Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указанный вид расчета не соответствует способу регистрации времени в документе!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения И ВыборкаПоШапкеДокумента.ЯвляетсяПочасовымОтклонением Тогда
		// ВидИспользованияРабочегоВремени
		Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидИспользованияРабочегоВремени) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан учет времени для вида расчета!", Отказ, Заголовок);
		КонецЕсли;
		
		// ОплачиватьЧасов
		Если ВыборкаПоШапкеДокумента.ОплачиватьЧасов <= 0 Или ВыборкаПоШапкеДокумента.ОплачиватьЧасов > 24 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Количество оплачиваемых часов должно быть положительным и не превышать 24!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;

	// Процент оплаты
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПроцентОплаты) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан процент оплаты!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Начисления"": ";
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала 
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала) и ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала начисления!", Отказ, Заголовок);
		
	ИначеЕсли Не ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения Тогда
		
		// Дата окончания
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			Если ВыборкаПоСтрокамДокумента.ДатаОкончания < ВыборкаПоСтрокамДокумента.ДатаНачала Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания начисления не должна быть меньше даты начала!", Отказ, Заголовок);
			ИначеЕсли ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда
				Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаОкончания) <> НачалоМесяца(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания начисления!", Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЕсли;

	// Дата начала события
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия) и ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала события!", Отказ, Заголовок);
	КонецЕсли;
	
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение организации!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не НесколькоДней Тогда //Аверсон ЕАЕ 10.03.2021 СВФР-007091
		Если НЕ ВыборкаПоСтрокамДокумента.Сторно И ВыборкаПоСтрокамДокумента.ОсновныеНачисления И  (ВыборкаПоСтрокамДокумента.ДатаНачала < ВыборкаПоШапкеДокумента.ДатаНачала ИЛИ ВыборкаПоСтрокамДокумента.ДатаНачала > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания) 
			ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания < ВыборкаПоШапкеДокумента.ДатаНачала ИЛИ ВыборкаПоСтрокамДокумента.ДатаОкончания > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания)) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "период начисления выходит за временные границы оплачиваемого события!", Ложь, Заголовок);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры:
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Расчет среднего"": ";
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета среднего заработка!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала базового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала базового периода!", Отказ, Заголовок);
		
	// Дата окончания базового периода
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания базового периода!", Отказ, Заголовок);
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.БазовыйПериодКонец < ВыборкаПоСтрокамДокумента.БазовыйПериодНачало Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала базового периода не может быть больше даты окончания базового периода!", Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРасчетСреднего()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры:
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, НаборРасчетСреднего)
	
	СуммаРесурсов = ВыборкаПоСтрокамДокумента.Результат 
			+ ВыборкаПоСтрокамДокумента.ОтработаноДней + ВыборкаПоСтрокамДокумента.ОтработаноЧасов 
			+ ВыборкаПоСтрокамДокумента.ОтработаноПоПятидневке + ВыборкаПоСтрокамДокумента.НормаПоПятидневке;
		
	Если СуммаРесурсов <> 0 Тогда
		
		Движение = НаборРасчетСреднего.Добавить();
		
		СтрокаСвойствИзДокумента = "ПериодРегистрации,Сотрудник,ФизЛицо,Организация,ДатаНачалаСобытия,СпособРасчета,"
										+ "ДатаНачалаРасчетногоПериода,ДатаОкончанияРасчетногоПериода,ПериодРасчетаСреднегоЗаработка";
		СтрокаСвойствИзСтрокиДокумента = "БазовыйПериодНачало,БазовыйПериодКонец,ВидРасчета,Результат," 
										+ "ОтработаноПоПятидневке,НормаПоПятидневке,ОтработаноДней,ОтработаноЧасов,"
										+ "КоэффициентИндексации,ЧислоМесяцев,МесяцВыборки,"
										+ "РезультатДляПремии"; //Аверсон 22.09.2020 КВВ СВФР-006593
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРасчетаСреднего()

// По выборке из результатов запроса по шапке документу формируем движения по регистру
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- спозиционированная на определеной строке выборка 
//							  из результата запроса к шапке документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, НаборЗаписей)
	
	Если ВыборкаПоШапкеДокумента.ЯвляетсяПочасовымОтклонением И ВыборкаПоСтрокамДокумента.ОплаченоДнейЧасов <> 0 Тогда
		Движение = НаборЗаписей.Добавить();
		
		// Свойства
		Движение.Период								= ВыборкаПоСтрокамДокумента.ДатаНачала;
		
		// Измерения
		Движение.Сотрудник							= ВыборкаПоШапкеДокумента.Сотрудник;
		Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоШапкеДокумента.ВидИспользованияРабочегоВремени;
		
		// Ресурсы
		Движение.Часов								= ВыборкаПоСтрокамДокумента.ОплаченоДнейЧасов;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРабочегоВремени()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//	ВыборкаПоШапкеДокумента			- выборка из результата запроса по шапке документа
//	ВыборкаПоТЧ						- выборка из результата запроса по т.ч. документа
//	УчетЗадолженностиПоМесяцам		- булево, учетная политика ведения расчетов с работниками 
//										в разрезе периодов образования задолженности
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) Тогда
		
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоТЧ.МесяцНалоговогоПериода;
		
		// Измерения
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ФизЛицо					= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.КодДохода					= ВыборкаПоТЧ.КодДоходаНДФЛ;
		//Если ЗначениеЗаполнено(ВыборкаПоТЧ.ВидРасчета.Подоходный2023) Тогда  
		//	Движение.КодДохода					= Справочники.ДоходыНДФЛ.НайтиПоКоду(ВыборкаПоТЧ.ВидРасчета.Подоходный2023);  		
		//КонецЕсли;
		Движение.ПериодРегистрации			= НачалоМесяца(ПериодРегистрации);
		
		// Ресурсы
		Движение.СуммаДохода				= ВыборкаПоТЧ.Результат; 
		Попытка
			Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) и (Число(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ))>501 и Число(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ))< 900) Тогда 
				Движение.КодВычета 	            = Справочники.ВычетыНДФЛ.НайтиПоКоду(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ));
				Движение.СуммаВычета			= ВыборкаПоТЧ.Результат;
			КонецЕсли;
		Исключение
		Конецпопытки;
		// Реквизиты
		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ИсчисленоИзЗарплаты	= Истина;
		Движение.ПодразделениеОрганизации = ВыборкаПоТЧ.ПодразделениеОрганизации; 
	КонецЕсли;
	
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
	
	// Измерения
	Движение.Организация			= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ФизЛицо				= ВыборкаПоШапкеДокумента.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
	КонецЕсли;
	
	// Ресурсы
	Движение.СуммаВзаиморасчетов	= ВыборкаПоТЧ.Результат;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверим непрерывночть следования записей начислений
	Если Не НесколькоДней Тогда //Аверсон ЕАЕ 09.03.2021 СВФР-007091
		ПроверитьНепрерывностьЗаписейНачислений(Отказ, Заголовок);
	КонецЕсли;
	
	//Аверсон ЕАЕ 09.03.2021 СВФР-007091
	ТЗДаты = Новый ТаблицаЗначений;
	ТЗДаты.Колонки.Добавить("ДатаНачала");
	ТЗДаты.Колонки.Добавить("ДатаОкончания");
	ТЗДаты.Колонки.Добавить("ОплачиватьЧасов");
	
	//Аверсон ЕАЕ 03.08.2021 СВФР-007926
	ТЗДаты.Колонки.Добавить("Сторно");
	//Аверсон СВФР-007926
	
	ЭтоЦелосменныйНевыход = СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены;
	
	Если НесколькоДней Тогда
		ДатыТЗ = Даты.Выгрузить();
		ДатыТЗ.Сортировать("Дата");
		
		н = 0;
		Для Каждого Стр Из ДатыТЗ Цикл
			н = н + 1;
			
			Если ЭтоЦелосменныйНевыход Тогда
				
				Если н = 1 Тогда
					НоваяСтр = ТЗДаты.Добавить();
					НоваяСтр.ДатаНачала = Стр.Дата;
					
					//Аверсон ЕАЕ 03.08.2021 СВФР-007926
					НоваяСтр.Сторно = Неопределено;
					//Аверсон СВФР-007926
					
				Иначе
					ИндексПредыдущейСтроки = н - 2;
					ПредыдущаяДата = Стр.Дата - 86400;
					Если ДатыТЗ[ИндексПредыдущейСтроки].Дата <> ПредыдущаяДата Тогда
						НоваяСтр = ТЗДаты.Добавить();
						НоваяСтр.ДатаНачала = Стр.Дата;
						
						//Аверсон ЕАЕ 03.08.2021 СВФР-007926
						НоваяСтр.Сторно = Неопределено;
						//Аверсон СВФР-007926
						
					КонецЕсли;
				КонецЕсли;
				Если н = ДатыТЗ.Количество() Тогда
					НоваяСтр.ДатаОкончания = Стр.Дата;
				Иначе
					ИндексСледующейСтроки = н;
					СледующаяДата = Стр.Дата + 86400;
					Если ДатыТЗ[ИндексСледующейСтроки].Дата <> СледующаяДата Тогда
						НоваяСтр.ДатаОкончания = Стр.Дата;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				НоваяСтр = ТЗДаты.Добавить();
				НоваяСтр.ДатаНачала = Стр.Дата;
				НоваяСтр.ДатаОкончания = Стр.Дата;
				НоваяСтр.ОплачиватьЧасов = Стр.Часы;
				
				//Аверсон ЕАЕ 03.08.2021 СВФР-007926
				НоваяСтр.Сторно = Неопределено;
				//Аверсон СВФР-007926
			КонецЕсли;
		КонецЦикла;
	Иначе
		//Аверсон ЕАЕ СВФР-007712
		//НоваяСтр = ТЗДаты.Добавить();
		//НоваяСтр.ДатаНачала = ДатаНачала;
		//НоваяСтр.ДатаОкончания = ДатаОкончания;
		//НоваяСтр.ОплачиватьЧасов = ОплачиватьЧасов;
		Для Каждого Стр Из Начисления Цикл
			НоваяСтр = ТЗДаты.Добавить();
			НоваяСтр.ДатаНачала = Стр.ДатаНачала;
			НоваяСтр.ДатаОкончания = Стр.ДатаОкончания;
			НоваяСтр.ОплачиватьЧасов = Стр.ОплаченоДнейЧасов;
			
			//Аверсон ЕАЕ 03.08.2021 СВФР-007926
			НоваяСтр.Сторно = Стр.Сторно;
			//Аверсон СВФР-007926
			
		КонецЦикла;
		//Аверсон СВФР-007712
	КонецЕсли;
	
	НомСтр = 0;
	//Аверсон СВФР-007091
	
	Для Каждого СтрДата Из ТЗДаты Цикл //Аверсон ЕАЕ 09.03.2021 СВФР-007091 цикл по датам
		
		//Аверсон ЕАЕ 09.03.2021 СВФР-007091
		НомСтр = НомСтр + 1;
		//Аверсон СВФР-007091
		
		РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(СтрДата.ДатаНачала, СтрДата.ДатаОкончания, СтрДата.ОплачиватьЧасов); //Аверсон ЕАЕ 11.03.2021 параметры
		
		// Получим реквизиты шапки из запроса
		ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// Получение учетной политики по персоналу организации
			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
			
			// перепишем данные из таблицы начислений в набор записей
			
			//Аверсон ЕАЕ 11.03.2021 СВФР-007091
			//ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
			ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента, СтрДата.ДатаНачала, СтрДата.Сторно).Выбрать(); //Аверсон ЕАЕ 03.08.2021 СВФР-007926 параметр Сторно
			//Аверсон СВФР-007091
			
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					Если Не НачислятьМатериальнуюПомощь Тогда //Аверсон ЕАЕ 16.02.2022 СВФР-008705
						Если ВыборкаПоНачислениям.ОсновныеНачисления Тогда
							//толик					ПроведениеРасчетов.ДобавитьСтрокуОсновныхНачислений(Движения.ОсновныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
							Движение = ПроведениеРасчетов.ДобавитьСтрокуОсновныхНачислений(Движения.ОсновныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
							Движение.ОплаченоДней = ВыборкаПоНачислениям.ОплаченоДней;
							//енд
						Иначе
							ПроведениеРасчетов.ДобавитьСтрокуДополнительныхНачислений(Движения.ДополнительныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
						КонецЕсли;
						ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
					КонецЕсли;
					
					Если ВыборкаПоНачислениям.ЯвляетсяПочасовымОтклонением Тогда
						ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ВнутрисменноеВремяРаботниковОрганизаций);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			// получим реквизиты табличной части
			Если НомСтр = 1 Тогда //Аверсон ЕАЕ 09.03.2021 СВФР-007091
				
				ВыборкаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего().Выбрать();
				Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
					
					// проверим очередную строку табличной части
					ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок);
					
					Если НЕ Отказ Тогда
						ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Движения.РасчетСреднегоЗаработка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли; //Аверсон СВФР-007091
			
			Если НЕ Отказ Тогда
				
				Если НомСтр = ТЗДаты.Количество() Тогда //Аверсон ЕАЕ 09.03.2021 СВФР-007091
					
					// выполним удаление перерасчетов исправленного документа
					Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
						ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
					КонецЕсли;
					
					Для Каждого Набор Из Движения Цикл
						ТипНабораЗаписей = ТипЗнч(Набор);
						Если ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
							Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ДополнительныеНачисленияРаботниковОрганизаций") Тогда
							Набор.Записать();
						КонецЕсли;
					КонецЦикла;
					ПроведениеРасчетов.ОбработатьТаблицуПерерасчетов(Ссылка);
					
				КонецЕсли; //Аверсон СВФР-007091
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; //Аверсон СВФР-007091 конец цикла по датам
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
    Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены Тогда
		ДатаОкончания = ДатаНачала;
	Иначе 
		ОплачиватьЧасов = 0;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400; // в секундах

