Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Функция СформироватьЗапросПоОтветствЛицамПод(ВыбПодразделение, ВыбОтветственноеЛицо)
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ВыбПодразделение);
    Запрос.УстановитьПараметр("ОтветственноеЛицо",ВыбОтветственноеЛицо);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()
 

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокАттестации, ДокументРезультат)
	
	//Аверсон ЕАЕ 24.02.2025 СВФР-015001
	//Климовичи
	сНомер = 0;
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//Аверсон СВФР-015001
	
	Пока ВыборкаСтрокАттестации.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокАттестации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокАттестации.ПодразделениеОрганизации Тогда			
			мНомер = 0;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокАттестации.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			сНомер = сНомер + 1;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			//ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			Если Орг.ИНН = "700103211" И СплошнаяНумерация Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = сНомер;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			КонецЕсли;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если СпособАттестации  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестации;
				ОбластьДетальныхЗаписей.Параметры.РезультатАттестации = ВыборкаСтрокАттестации.РезультатАттестации;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.Примечание;

			ИначеЕсли СпособАттестации  = 2 Тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ВыборкаСтрокАттестации.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
				Пока Результат.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Результат.ФизическоеЛицо.Наименование);
				КонецЦикла;				
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестацииПлановая;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		Иначе
			
			мНомер = мНомер + 1;
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			сНомер = сНомер + 1;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			//ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			Если Орг.ИНН = "700103211" И СплошнаяНумерация Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = сНомер;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			КонецЕсли;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если СпособАттестации  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестации;
				ОбластьДетальныхЗаписей.Параметры.РезультатАттестации = ВыборкаСтрокАттестации.РезультатАттестации;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.Примечание;
			ИначеЕсли СпособАттестации  = 2 Тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ВыборкаСтрокАттестации.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
				Пока Результат.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Результат.ФизическоеЛицо.Наименование);
				КонецЦикла;				
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестацииПлановая;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	Если СпособАттестации  = 1 Тогда 
		мМакет = ПолучитьМакет("МакетАттестации");
	ИначеЕсли СпособАттестации  = 2 Тогда
		мМакет = ПолучитьМакет("МакетПлановойАттестации");
	конецесли;
    ТекПодр = "";
	Запрос = Новый Запрос;
	Если СпособАттестации = 1 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Сотрудник КАК Сотрудник,
		|	АттестацияРаботников.Примечание КАК Примечание

		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АттестацияРаботников КАК АттестацияРаботников
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = АттестацияРаботников.Сотрудник
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	И АттестацияРаботников.ДатаАттестации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	АттестацияРаботников.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Примечание
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";

	ИначеЕсли СпособАттестации = 2 Тогда 
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АттестацияРаботников КАК АттестацияРаботников
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = АттестацияРаботников.Сотрудник
		|ГДЕ
		|	АттестацияРаботников.ДатаАттестацииПлановая МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	АттестацияРаботников.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";

	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если Не ПустаяСтрока(РезультатАттестации) тогда
		Запрос.УстановитьПараметр("РезультатАттестации",      РезультатАттестации);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации","И АттестацияРаботников.РезультатАттестации = &РезультатАттестации");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли

