////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток, мНаборЗаписей;
Перем СоответствиеВалютныеСпособыРасчета;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ДобавитьСтрокиНачисленийПоРаботнику(Сотрудник, ДатаАктуальности = Неопределено,ТЧРаботники = Неопределено) Экспорт
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = Дата
	КонецЕсли;
	
	ЗапросНачисления = Новый Запрос;
	ЗапросНачисления.УстановитьПараметр("Сотрудник", Сотрудник);
	ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
	ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
	
	ЗапросНачисления.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.ВидРасчетаЗавершения
	|		ИНАЧЕ Начисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель1Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель1
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель2Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель2
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель3Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель3
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель4Завершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель4
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд1Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд1
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд2Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд2
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд3Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд3
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА Начисления.ТарифныйРазряд4Завершения
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА Начисления.ТарифныйРазряд4
	|				ИНАЧЕ НЕОПРЕДЕЛЕНО
	|			КОНЕЦ
	|	КОНЕЦ КАК ТарифныйРазряд4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта1Завершения
	|		ИНАЧЕ Начисления.Валюта1
	|	КОНЕЦ КАК Валюта1,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта2Завершения
	|		ИНАЧЕ Начисления.Валюта2
	|	КОНЕЦ КАК Валюта2,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта3Завершения
	|		ИНАЧЕ Начисления.Валюта3
	|	КОНЕЦ КАК Валюта3,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Начисления.Валюта4Завершения
	|		ИНАЧЕ Начисления.Валюта4
	|	КОНЕЦ КАК Валюта4,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодЗавершения <= &Период
	|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ Начисления.Показатель1ВВалютеЗавершения
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
	|					ТОГДА НЕОПРЕДЕЛЕНО
	|				ИНАЧЕ Начисления.Показатель1ВВалюте
	|			КОНЕЦ
	|	КОНЕЦ КАК Показатель1ВВалюте
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|			&Период,
	|			Сотрудник В (&Сотрудник)
	|				И ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
	|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
	|				И Регистратор <> &Регистратор) КАК Начисления
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Начисления.ПериодЗавершения <= &Период
	|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА Начисления.ДействиеЗавершения
	|			ИНАЧЕ Начисления.Действие
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = ЗапросНачисления.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета");
	ТекСтрокаРаботники = Неопределено;
	Пока Выборка.Следующий() Цикл
		//О.Т. 26.01.2015 № 17814
		если ЗначениеЗаполнено(ТЧРаботники) Тогда 
			МассивРаботники = ТЧРаботники.НайтиСтроки(Новый Структура("Сотрудник",Выборка.Сотрудник));
			для Каждого стрРаб из МассивРаботники Цикл 
				ТекСтрокаРаботники = стрРаб;
			КонецЦикла;
		КонецЕсли;
		//О.Т. 26.01.2015 № 17814
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрОсновныеНачисления = ОсновныеНачисления.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрОсновныеНачисления,Выборка);
		//О.Т. 26.01.2015 № 17814
		Округление = Константы.ОкруглениеЧасовойТС.Получить();
		если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
			ЗначениеОкругления = 0;
		ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
			ЗначениеОкругления = 1;
		ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
			ЗначениеОкругления = 2;
		ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
			ЗначениеОкругления = 3;
		ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
			ЗначениеОкругления = 4;
		иначе
			ЗначениеОкругления = 0;
		КонецЕсли;
		мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
		если СтрОсновныеНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой Тогда
			мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Дата,
			Новый Структура("Организация, Сотрудник", Организация, Выборка.Сотрудник)); //О.Т. Аверсон 06.02.2018 № 1547
			Если ЗначениеЗаполнено(мСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),мСтрока.ГрафикРаботы));
				Если ЧасовВГоду.Размер = 0 Тогда 
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
					Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));							
				КонецЕсли;
			иначе      				
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
			КонецЕсли;
			если не ТекСтрокаРаботники = Неопределено Тогда 
				Если мНеобходимоВыделятьКонтракт Тогда
					Тариф = ТекСтрокаРаботники.ТарифныйСПовышениемПоИнструкции;
					ТарифВВалюте = ТекСтрокаРаботники.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
				Иначе
					Тариф = ТекСтрокаРаботники.МесячнаяТарифнаяСтавка;
					ТарифВВалюте = ТекСтрокаРаботники.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				КонецЕсли;
				ЗанимаемыхСтавок = ТекСтрокаРаботники.ЗанимаемыхСтавок;
				Если ЧасовВГоду.Размер <> 0 тогда
					//временное перемещение
					Если ТекСтрокаРаботники.Временно Тогда
						мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(ТекСтрокаРаботники.ДатаНачала - 86400,
						Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, ТекСтрокаРаботники.Сотрудник, Неопределено));
						СтрОсновныеНачисления.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
						СтрОсновныеНачисления.Показатель3 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						СтрОсновныеНачисления.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041
						СтрОсновныеНачисления.Показатель3 = 0;
					КонецЕсли;
					СтрОсновныеНачисления.Показатель2 = ТекСтрокаРаботники.ПроцентПоКонтракту;
					СтрОсновныеНачисления.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрОсновныеНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам и Организация.ИНН = "500052918" Тогда 
			мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Дата,
			Новый Структура("Организация, Сотрудник", Организация, Выборка.Сотрудник)); //О.Т. Аверсон 06.02.2018 № 1547
			Если ЗначениеЗаполнено(мСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),мСтрока.ГрафикРаботы));
				Если ЧасовВГоду.Размер = 0 Тогда 
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
					Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
				КонецЕсли; 
			иначе
				ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
				Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
			КонецЕсли;
			если не ТекСтрокаРаботники = Неопределено Тогда 
				Если мНеобходимоВыделятьКонтракт Тогда
					Тариф = ТекСтрокаРаботники.ТарифныйСПовышениемПоИнструкции;
					ТарифВВалюте = ТекСтрокаРаботники.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
				Иначе
					Тариф = ТекСтрокаРаботники.МесячнаяТарифнаяСтавка;
					ТарифВВалюте = ТекСтрокаРаботники.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				КонецЕсли;
				Если ЧасовВГоду.Размер <> 0 тогда
					//временное перемещение
					Если ТекСтрокаРаботники.Временно Тогда
						мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(ТекСтрокаРаботники.ДатаНачала - 86400,
						Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, ТекСтрокаРаботники.Сотрудник, Неопределено));
						СтрОсновныеНачисления.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
						СтрОсновныеНачисления.Показатель3 = Окр(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						СтрОсновныеНачисления.Показатель1 = Окр(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
						СтрОсновныеНачисления.Показатель1ВВалюте = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041
						СтрОсновныеНачисления.Показатель3 = 0;
					КонецЕсли;
					СтрОсновныеНачисления.Показатель2 = ТекСтрокаРаботники.ПроцентПоКонтракту;
					СтрОсновныеНачисления.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//О.Т. 26.01.2015 № 17814
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьСтрокиНачисленийПоРаботнику()

// простовляет в табличную часть КоэфПовышенияТО данные по Сторуднику
Процедура ДобавитьСтрокиКоэфПовышенияТО(Сотрудники, ДатаАктуальности = Неопределено,КорректКоэфф) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КоэфПовышенияТОСрезПоследних.Сотрудник,
	|	КоэфПовышенияТОСрезПоследних.Коэффициент,
	|	КоэфПовышенияТОСрезПоследних.Размер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие
	|ИЗ
	|	РегистрСведений.КоэфПовышенияТО.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК КоэфПовышенияТОСрезПоследних
	|ГДЕ
	|	КоэфПовышенияТОСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, Коэффициент");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений = КоэфПовышенияТО.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаКоэф = КоэфПовышенияТО.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКоэф,Выборка);  
		
		
		Если Выборка.Коэффициент = Справочники.КоэффициентыПовышения.НайтиПоНаименованию("корр. коэф") Тогда  
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("КоррКоэф", КорректКоэфф);
			Запрос.УстановитьПараметр("Организация", Организация);
			
			Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КорректирующийКоэффициентСрезПоследних.Размер
			|ИЗ
			|	РегистрСведений.КорректирующийКоэффициент.СрезПоследних(
			|			&Дата,
			|			КорректирующийКоэффициент = &КоррКоэф
			|				И Организация = &Организация) КАК КорректирующийКоэффициентСрезПоследних";
			Результ = Запрос.Выполнить().Выбрать();
			Пока Результ.Следующий() Цикл
				СтрокаКоэф.Размер = Результ.Размер;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

//Процедура ДобавитьСтрокиОснвныеНачисления() Экспорт 
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("ДатаНачалаПериода",		ДатаНачалаПериода);
//	Запрос.УстановитьПараметр("ДатаОкончанияПериода",	ДатаОкончанияПериода);
//	Запрос.УстановитьПараметр("Организация",			Организация);
//	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
//	Запрос.УстановитьПараметр("РайонныйКоэффициент",	РайонныйКоэффициент);
//	
//	УсловиеНаДатыРаботы = "";
//	Если ЗначениеЗаполнено(ДатаНачалаПериода) Тогда
//		УсловиеНаДатыРаботы = УсловиеНаДатыРаботы + Символы.ПС + Символы.Таб + "И <имя поля>.ДатаНачала >= &ДатаНачалаПериода";
//	КонецЕсли;
//	Если ЗначениеЗаполнено(ДатаОкончанияПериода) Тогда
//		УсловиеНаДатыРаботы = УсловиеНаДатыРаботы + Символы.ПС + Символы.Таб + "И <имя поля>.ДатаНачала <= &ДатаОкончанияПериода";
//	КонецЕсли;
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
//	|	СотрудникиОрганизаций.Физлицо КАК Физлицо,
//	|	СотрудникиОрганизаций.Должность,
//	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
//	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
//	|	СотрудникиОрганизаций.ДатаНачала КАК ДатаПриема,
//	|	СотрудникиОрганизаций.ДатаОкончания КАК ДатаУвольнения,
//	|	СотрудникиОрганизаций.ИспытательныйСрок,
//	|	СотрудникиОрганизаций.ГрафикРаботы,
//	|	СотрудникиОрганизаций.Физлицо.Наименование КАК ФизлицоНаименование,
//	|	СотрудникиОрганизаций.ВидРасчета КАК ВидРасчета,
//	|	СотрудникиОрганизаций.РасчетнаяТарифнаяСтавка КАК Показатель1,
//	|	NULL КАК Показатель2,
//	|	NULL КАК Показатель3,
//	|	NULL КАК Показатель4,
//	|	СотрудникиОрганизаций.ВалютаТарифнойСтавки КАК Валюта1,
//	|	NULL КАК Валюта2,
//	|	NULL КАК Валюта3,
//	|	NULL КАК Валюта4,
//	|	СотрудникиОрганизаций.ТарифныйРазряд КАК ТарифныйРазряд1,
//	|	NULL КАК ТарифныйРазряд2,
//	|	NULL КАК ТарифныйРазряд3,
//	|	NULL КАК ТарифныйРазряд4,
//	|	СотрудникиОрганизаций.РасчетнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
//	|	СотрудникиОрганизаций.РазрядЕТС,
//	|	СотрудникиОрганизаций.КоэффициентЕТС,
//	|	СотрудникиОрганизаций.ПроцентПовышения КАК ПроцентПоКонтракту,
//	|	СотрудникиОрганизаций.Должность.Категория КАК Категория,
//	|	СотрудникиОрганизаций.ТарифныйСПовышениемПоИнструкции,
//	|	СотрудникиОрганизаций.ИтоговоеПовышениеПоИнструкции,
//	|	СотрудникиОрганизаций.ТарифнаяСтавка,
//	|	СотрудникиОрганизаций.РазмерСтавки1Разряда,
//	|	СотрудникиОрганизаций.ПовышенныйКоэффициентЕТС,
//	|	ВЫБОР
//	|		КОГДА СотрудникиОрганизаций.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК НапомнитьПоЗавершении,
//	|	СотрудникиОрганизаций.ТарифнаяСтавкаПервогоРазряда,
//	|	СотрудникиОрганизаций.УсловияТрудаИзмерение,
//	|	СотрудникиОрганизаций.ВидДеятельностиИзмерение
//	|ИЗ
//	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
//	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|				ТОГДА СотрудникиОрганизаций.Организация
//	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
//	|		КОНЕЦ = &Организация
//	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
//	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
//	|			ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
//	|
//	|ОБЪЕДИНИТЬ 
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СотрудникиОрганизаций.Ссылка,
//	|	СотрудникиОрганизаций.Физлицо,
//	|	СотрудникиОрганизаций.Должность,
//	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
//	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
//	|	СотрудникиОрганизаций.ДатаНачала,
//	|	СотрудникиОрганизаций.ДатаОкончания,
//	|	СотрудникиОрганизаций.ИспытательныйСрок,
//	|	СотрудникиОрганизаций.ГрафикРаботы,
//	|	СотрудникиОрганизаций.Физлицо.Наименование,
//	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.РайонныйКоэффициент),
//	|	ВЫБОР
//	|		КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
//	|				И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
//	|			ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
//	|		ИНАЧЕ &РайонныйКоэффициент
//	|	КОНЕЦ * 100 - 100,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL
//	|ИЗ
//	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
//	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|				ТОГДА СотрудникиОрганизаций.Организация
//	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
//	|		КОНЕЦ = &Организация
//	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
//	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
//	|	И ВЫБОР
//	|			КОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
//	|					И СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент > 1
//	|				ТОГДА СотрудникиОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициент
//	|			ИНАЧЕ &РайонныйКоэффициент
//	|		КОНЕЦ > 1
//	|
//	|ОБЪЕДИНИТЬ 
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Должность,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ПодразделениеОрганизации,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ЗанимаемыхСтавок,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаНачала,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ДатаОкончания,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ИспытательныйСрок,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ГрафикРаботы,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Физлицо.Наименование,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Надбавка,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель1,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель2,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель3,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Показатель4,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта1,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта2,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта3,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.Валюта4,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд1,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд2,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд3,
//	|	СотрудникиОрганизацийПерсональныеНадбавки.ТарифныйРазряд4,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL
//	|ИЗ
//	|	Справочник.СотрудникиОрганизаций.ПерсональныеНадбавки КАК СотрудникиОрганизацийПерсональныеНадбавки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
//	|		ПО СотрудникиОрганизацийПерсональныеНадбавки.Ссылка = РаботникиОрганизаций.Сотрудник
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|				ТОГДА СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Организация
//	|			ИНАЧЕ СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ОбособленноеПодразделение
//	|		КОНЕЦ = &Организация
//	|	И СотрудникиОрганизацийПерсональныеНадбавки.Надбавка <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
//	|	И СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.Актуальность
//	|	И СотрудникиОрганизацийПерсональныеНадбавки.Ссылка.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
//	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизацийПерсональныеНадбавки.Ссылка") + " 
//	|
//	|
//	|ОБЪЕДИНИТЬ 
//	|
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СотрудникиОрганизаций.Ссылка,
//	|	СотрудникиОрганизаций.Физлицо,
//	|	СотрудникиОрганизаций.Должность,
//	|	СотрудникиОрганизаций.ПодразделениеОрганизации,
//	|	СотрудникиОрганизаций.ЗанимаемыхСтавок,
//	|	СотрудникиОрганизаций.ДатаНачала,
//	|	СотрудникиОрганизаций.ДатаОкончания,
//	|	СотрудникиОрганизаций.ИспытательныйСрок,
//	|	СотрудникиОрганизаций.ГрафикРаботы,
//	|	СотрудникиОрганизаций.Физлицо.Наименование,
//	|	СхемыМотивацииРаботников.ВидРасчета,
//	|	СхемыМотивацииРаботников.Показатель1,
//	|	СхемыМотивацииРаботников.Показатель2,
//	|	СхемыМотивацииРаботников.Показатель3,
//	|	СхемыМотивацииРаботников.Показатель4,
//	|	СхемыМотивацииРаботников.Валюта1,
//	|	СхемыМотивацииРаботников.Валюта2,
//	|	СхемыМотивацииРаботников.Валюта3,
//	|	СхемыМотивацииРаботников.Валюта4,
//	|	СхемыМотивацииРаботников.ТарифныйРазряд1,
//	|	СхемыМотивацииРаботников.ТарифныйРазряд2,
//	|	СхемыМотивацииРаботников.ТарифныйРазряд3,
//	|	СхемыМотивацииРаботников.ТарифныйРазряд4,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL,
//	|	NULL
//	|ИЗ
//	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
//	|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СхемыМотивацииРаботников КАК СхемыМотивацииРаботников
//	|		ПО (СхемыМотивацииРаботников.Организация = ВЫБОР
//	|				КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|					ТОГДА СотрудникиОрганизаций.Организация
//	|				ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
//	|			КОНЕЦ)
//	|			И (ВЫБОР
//	|				КОГДА СхемыМотивацииРаботников.Должность <> ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
//	|						И СхемыМотивацииРаботников.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
//	|					ТОГДА СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
//	|							И СхемыМотивацииРаботников.Подразделение = СотрудникиОрганизаций.ПодразделениеОрганизации
//	|				ИНАЧЕ СхемыМотивацииРаботников.Должность = СотрудникиОрганизаций.Должность
//	|			КОНЕЦ)
//	|ГДЕ
//	|	ВЫБОР
//	|			КОГДА СотрудникиОрганизаций.ОбособленноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
//	|				ТОГДА СотрудникиОрганизаций.Организация
//	|			ИНАЧЕ СотрудникиОрганизаций.ОбособленноеПодразделение
//	|		КОНЕЦ = &Организация
//	|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
//	|	И СхемыМотивацииРаботников.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
//	|	И СхемыМотивацииРаботников.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
//	|	И (РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ИЛИ РаботникиОрганизаций.Регистратор = &Ссылка)" + СтрЗаменить(УсловиеНаДатыРаботы,"<имя поля>","СотрудникиОрганизаций") + "
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ФизлицоНаименование,
//	|	Сотрудник,
//	|	ВидРасчета";
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
//		
//		ЗаполнитьЗначенияСвойств(РаботникиОрганизации.Добавить(), Выборка);
//		
//		Пока Выборка.Следующий() Цикл
//			ЗаполнитьЗначенияСвойств(ОсновныеНачисления.Добавить(), Выборка);
//		КонецЦикла;
//		
//	КонецЦикла;
//КонецПроцедуры


// простовляет в табличную часть ПовышенияПоИнструкции данные по Сторуднику
Процедура ДобавитьСтрокиПовышенияПоИнструкции(Сотрудники, ДатаАктуальности = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Дата", ДатаАктуальности);	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПовышенияПоИнструкцииСрезПоследних.Сотрудник,
	|	ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
	|	ПовышенияПоИнструкцииСрезПоследних.Размер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие
	|ИЗ
	|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Дата, Сотрудник В (&Сотрудники)) КАК ПовышенияПоИнструкцииСрезПоследних
	|ГДЕ
	|	ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Сотрудник, Коэффициент");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		МассивНачислений =ПовышенияПоИнструкции.НайтиСтроки(СтруктураПоиска);
		
		Если МассивНачислений.Количество() <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//СВЭЙ 19.02.2024 КВВ СВФР-012329 (
		Если НЕ ЗначениеЗаполнено(Выборка.Коэффициент) И Выборка.Размер = 0 Тогда
			Продолжить;
		КонецЕсли;
		//СВЭЙ 19.02.2024 КВВ СВФР-012329 )
		
		ЗаполнитьЗначенияСвойств(ПовышенияПоИнструкции.Добавить(),Выборка);
	КонецЦикла;	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("Руководитель",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Запрос.УстановитьПараметр("ДатаДокумента",	Дата);
	
	Если Режим = "ПоРеквизитамДокумента" Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	ИзменениеПериодическихРеквизитов.Номер КАК НомерДок,
		|	ИзменениеПериодическихРеквизитов.Дата КАК ДатаДок,
		|	ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитов.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НазваниеОрганизации,
		|	ИзменениеПериодическихРеквизитов.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
		|				ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|			ИНАЧЕ """"
		|		КОНЕЦ, ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование) КАК ФИОРуководителя,
		|	ИзменениеПериодическихРеквизитов.Организация.Префикс,
		|	ИзменениеПериодическихРеквизитов.НомерД
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов КАК ИзменениеПериодическихРеквизитов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаДокумента, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛицСрезПоследних
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &Руководитель)
		|			И ИзменениеПериодическихРеквизитов.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	ИзменениеПериодическихРеквизитов.Ссылка = &ДокументСсылка";
		
	ИначеЕсли Режим = "ПоТабличнойЧастиДокумента" Тогда
		
		Запрос.УстановитьПараметр("РеглВалюта",	Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
		Запрос.УстановитьПараметр("Прием",		Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.ДатаНачала,
		|	Док.ДатаОкончания,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, Док.Сотрудник.Наименование) КАК Работник,
		|	ЕСТЬNULL(Док.Сотрудник.ДатаДоговора, &ПустаяДата) КАК ТрудовойДоговорДата,
		|	ЕСТЬNULL(Док.Сотрудник.НомерДоговора, """") КАК ТрудовойДоговорНомер,
		|	Док.НомерСтроки КАК НомерСтроки,
		|	Док.ПодразделениеОрганизации.Наименование КАК НовоеПодразделение,
		|	Док.Должность.Наименование КАК НоваяДолжность,
		|	ВЫБОР
		|		КОГДА Работники.ПериодЗавершения <= Док.ДатаНачала
		|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Работники.ПодразделениеОрганизацииЗавершенияНаименование
		|		ИНАЧЕ Работники.ПодразделениеОрганизацииНаименование
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА Работники.ПериодЗавершения <= Док.ДатаНачала
		|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Работники.ДолжностьЗавершенияНаименование
		|		ИНАЧЕ Работники.ДолжностьНаименование
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Начисления.Валюта1, &РеглВалюта) = &РеглВалюта
		|			ТОГДА """"
		|		ИНАЧЕ Начисления.Валюта1.Наименование
		|	КОНЕЦ КАК ВалютаТарифнойСтавки,
		|	ЕСТЬNULL(Начисления.Показатель1, 0) КАК ОкладТарифнаяСтавка,
		|	Работники.Сотрудник.Код КАК ТабельныйНомер,
		|	Док.РазрядЕТС
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СписокДат.Сотрудник КАК Сотрудник,
		|			РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|			РаботникиОрганизации.Должность.Наименование КАК ДолжностьНаименование,
		|			РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование КАК ПодразделениеОрганизацииЗавершенияНаименование,
		|			РаботникиОрганизации.ДолжностьЗавершения.Наименование КАК ДолжностьЗавершенияНаименование,
		|			РаботникиОрганизации.ПериодЗавершения КАК ПериодЗавершения
		|		ИЗ
		|			(ВЫБРАТЬ
		|				РаботникиВнутри.Сотрудник КАК Сотрудник,
		|				МАКСИМУМ(РаботникиВнутри.Период) КАК ДатаПоследнегоИзменения
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций КАК РаботникиВнутри
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Док
		|					ПО РаботникиВнутри.Период < Док.ДатаНачала
		|						И РаботникиВнутри.Сотрудник = Док.Сотрудник
		|			ГДЕ
		|				Док.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				РаботникиВнутри.Сотрудник) КАК СписокДат
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|				ПО СписокДат.ДатаПоследнегоИзменения = РаботникиОрганизации.Период
		|					И СписокДат.Сотрудник = РаботникиОрганизации.Сотрудник) КАК Работники
		|		ПО Док.Сотрудник = Работники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.ОсновныеНачисления КАК Начисления
		|		ПО Док.Ссылка = Начисления.Ссылка
		|			И (Начисления.ВидРасчета.ЗачетОтработанногоВремени)
		|			И (Начисления.ВидРасчета.ЗачетНормыВремени)
		|			И Док.Сотрудник = Начисления.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|				&ДатаДокумента,
		|				ФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						КадровоеПеремещениеОрганизацииРаботники.Сотрудник.Физлицо
		|					ИЗ
		|						Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацииРаботники
		|					ГДЕ
		|						КадровоеПеремещениеОрганизацииРаботники.Ссылка = &ДокументСсылка)) КАК ФИОФизЛицСрезПоследних
		|		ПО Док.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|ГДЕ
		|	Док.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросДляПечати()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзменениеПериодическихРеквизитов.Дата,
	|	ИзменениеПериодическихРеквизитов.Организация,
	|	ВЫБОР КОГДА ИзменениеПериодическихРеквизитов.Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА ИзменениеПериодическихРеквизитов.Организация ИНАЧЕ ИзменениеПериодическихРеквизитов.Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация,
	|	ИзменениеПериодическихРеквизитов.Ссылка,
	|	ИзменениеПериодическихРеквизитов.ИндексацияЗаработка
	|ИЗ
	|	Документ.ИзменениеПериодическихРеквизитов КАК ИзменениеПериодическихРеквизитов
	|
	|ГДЕ
	|	ИзменениеПериодическихРеквизитов.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим, ПроверкаШтатногоРасписания, ТЗДатыНачалаРС = Неопределено) //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	
	Запрос = Новый Запрос;
	
	//Аверсон ЕАЕ 17.12.2024 СВФР-014218
	//Гродно
	Если ТЗДатыНачалаРС <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		|ТЗ.Сотрудник,
		|ТЗ.ДатаНачалаРС
		|ПОМЕСТИТЬ ВТДатыНачалаРС
		|ИЗ &ТЗ КАК ТЗ
		|"; 
		Запрос.УстановитьПараметр("ТЗ", ТЗДатыНачалаРС);
		Запрос.Выполнить();
	КонецЕсли;
	//Аверсон СВФР-014218
	
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
	СписокСтруктурныхПодразделений.Добавить(Организация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ПустаяДата",						Дата('00010101'));
	Запрос.УстановитьПараметр("Прием",							Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	// Описание текста запроса:
	// Первая часть запроса  - вид строки запроса "ДанныеДляДвиженийКадров": 
	// 1. Выборка "ТЧРаботникиОрганизации": 
	//		Выбираются строки документа.  
	// 2. Выборка "ДанныеПоРаботникиДоНазначения": 
	//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по регистру РаботникиОрганизации на дату ДатаНачала
	//		для выполнения движений и проверки "Работает ли работник на дату перемещения"
	//		(Использует данные выборки "ДатыПоследнихДвиженийРаботников")
	// 3. Выборка "ПересекающиесяСтроки": 
	//		Среди остальных строк документа ищем строки, имеющие пересекающийся период действия
	//
	// Вторая часть запроса - вид строки запроса "КонфликтныйДокумент" - поиск конфликтных документов: 
	// 1. Выборка "ТЧРаботникиОрганизации":
	//		Выбираются строки документа 
	// 2. Выборка "РаботникиОрганизации":
	//		Для каждой строки ТЧРаботникиОрганизации ищем движения по регистру РаботникиОрганизации за период [ДатаНачала, ДатаОкончания]
	
	//толик - добавил временно
	
	Если ПроверкаШтатногоРасписания Тогда
		
		// определим самую раннюю дату перемещения, чтобы с нее начать расчет остатков штатных единиц
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(КадровоеПеремещениеОрганизацииРаботникиОрганизации.ДатаНачала) КАК ДатаНачала
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацииРаботникиОрганизации
		|ГДЕ
		|	КадровоеПеремещениеОрганизацииРаботникиОрганизации.Ссылка = &ДокументСсылка
		|	И КадровоеПеремещениеОрганизацииРаботникиОрганизации.ДатаНачала <> &ПустаяДата";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаС = ?(ЗначениеЗаполнено(Выборка.ДатаНачала),Выборка.ДатаНачала,Дата)
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала",	ДатаС);
		Запрос.УстановитьПараметр("Приход",		ВидДвиженияНакопления.Приход);
		
		//  Дополнительно используем выборки: 
		// 1. ШтатноеРасписаниеОрганизаций
		//		Для каждой строки ТЧРаботникиОрганизации выполняем срез по регистру ШтатноеРасписаниеОрганизаций на дату ДатаНачала
		//		для проверки наличия ставок в штатном расписании
		//		(Использует данные выборки "ДатыШтатногоРасписания")
		// 2. ЗанятоСтавок
		//		Для каждой строки ТЧРаботникиОрганизации на дату ДатаНачала
		//		подсчитываем количество занятых ставок (с учетом "предшествующих" данных текущего документа)
		//
		//толик		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность КАК Должность,
		|	ТЧРаботникиОрганизации.РазрядЕТС КАК РазрядЕТС,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.Категория КАК Категория,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.Временно КАК Временно,
		|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ВЫБОР
		|		КОГДА НЕ ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение
		|	КОНЕЦ КАК ПрежняяОрганизация,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ПрежняяСтавка,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
		|	КОНЕЦ КАК ПрежнийГрафикРаботы,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Период
		|	КОНЕЦ КАК ДатаПоследнегоДвиженияПоРаботнику,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	NULL КАК КонфликтныйДокумент,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.НомерДоговора ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТрудовойДоговорПрисутствует,
		|	СвободноСтавокНаДатуПриема.ОстатокСтавок КАК ОстатокСтавок,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ПрежнийТарифнаяСтавкаПервогоРазряда,
		|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК ПрежнийУсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|	ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ПрежнийВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 04.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати, //О.Т. Аверсон 13.04.2016 № 1041
		|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004419
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения КАК ЗанимаемыхСтавокЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения КАК ОбособленноеПодразделениеЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения КАК ПодразделениеОрганизацииЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения КАК ДолжностьЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПериодЗавершения КАК ПериодЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ТарифнаяСтавкаПервогоРазряда КАК ТарифнаяСтавкаПервогоРазряда,
		|			ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение,
		|			ДанныеПоРаботникуДоНазначения.ТипРаботника КАК ТипРаботника,
		|			ДанныеПоРаботникуДоНазначения.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|			ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ВидДеятельностиИзмерение
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(Работники.Период) КАК Период,
		|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|					ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		|						И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|			ГДЕ
		|				ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТЧРаботникиОрганизации.НомерСтроки,
		|				ТЧРаботникиОрганизации.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО (ТЧРаботникиОрганизации2.Ссылка = ТЧРаботникиОрганизации.Ссылка)
		|					И ТЧРаботникиОрганизации.НомерСтроки < ТЧРаботникиОрганизации2.НомерСтроки
		|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|		ГДЕ
		|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МаксимальныеПериодыШР.НомерСтроки КАК НомерСтроки,
		|			ЕСТЬNULL(ШтатноеРасписание.КоличествоСтавок, 0) - ЕСТЬNULL(Вакансии.КоличествоСтавок, 0) - ЕСТЬNULL(РанееЗанятоСтавок.КоличествоСтавок, 0) + ЕСТЬNULL(ОсвобождаетсяСтавок.КоличествоСтавок, 0) КАК ОстатокСтавок
		|		ИЗ
		|			(ВЫБРАТЬ
		|				Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|				Работники.Должность КАК Должность,
		|				Работники.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(ШтатноеРасписание.Период) КАК МаксПериод
		|			ИЗ
		|				Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Работники
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						ЕСТЬNULL(ШтатноеРасписание.Период, &ДатаНачала) КАК Период,
		|						Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|						Работники.Должность КАК Должность
		|					ИЗ
		|						Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Работники
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		|							ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		|								И Работники.Должность = ШтатноеРасписание.Должность
		|					ГДЕ
		|						Работники.Ссылка = &ДокументСсылка) КАК ШтатноеРасписание
		|					ПО Работники.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		|						И Работники.Должность = ШтатноеРасписание.Должность
		|						И Работники.ДатаНачала >= ШтатноеРасписание.Период
		|			ГДЕ
		|				Работники.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				Работники.ПодразделениеОрганизации,
		|				Работники.НомерСтроки,
		|				Работники.Должность) КАК МаксимальныеПериодыШР
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписание
		|				ПО МаксимальныеПериодыШР.ПодразделениеОрганизации = ШтатноеРасписание.ПодразделениеОрганизации
		|					И МаксимальныеПериодыШР.Должность = ШтатноеРасписание.Должность
		|					И МаксимальныеПериодыШР.МаксПериод = ШтатноеРасписание.Период
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					Работники.НомерСтроки КАК НомерСтроки,
		|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|					Работники.Должность КАК Должность,
		|					СУММА(ВЫБОР
		|							КОГДА Вакансии.ВидДвижения = &Приход
		|								ТОГДА Вакансии.КоличествоСтавок
		|							ИНАЧЕ -Вакансии.КоличествоСтавок
		|						КОНЕЦ) КАК КоличествоСтавок
		|				ИЗ
		|					Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Работники
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗанятыеШтатныеЕдиницыОрганизаций КАК Вакансии
		|						ПО Работники.ПодразделениеОрганизации = Вакансии.ПодразделениеОрганизации
		|							И Работники.Должность = Вакансии.Должность
		|							И Работники.ДатаНачала >= Вакансии.Период
		|							И (Вакансии.Регистратор <> &ДокументСсылка)
		|				ГДЕ
		|					Работники.Ссылка = &ДокументСсылка
		|				
		|				СГРУППИРОВАТЬ ПО
		|					Работники.ПодразделениеОрганизации,
		|					Работники.Должность,
		|					Работники.НомерСтроки) КАК Вакансии
		|				ПО МаксимальныеПериодыШР.НомерСтроки = Вакансии.НомерСтроки
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СтрокиДокумента.НомерСтроки КАК НомерСтроки,
		|					СУММА(ВЫБОР
		|							КОГДА ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаНачала <= СтрокиДокумента.ДатаНачала
		|								ТОГДА ИзменениеПериодическихРеквизитовРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ - ВЫБОР
		|							КОГДА ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаОкончания < СтрокиДокумента.ДатаНачала
		|									И ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаОкончания <> &ПустаяДата
		|									И НЕ ИзменениеПериодическихРеквизитовРаботникиОрганизации.НапомнитьПоЗавершении
		|								ТОГДА ИзменениеПериодическихРеквизитовРаботникиОрганизации.ЗанимаемыхСтавок
		|							ИНАЧЕ 0
		|						КОНЕЦ) КАК КоличествоСтавок
		|				ИЗ
		|					Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК СтрокиДокумента
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ИзменениеПериодическихРеквизитовРаботникиОрганизации
		|						ПО СтрокиДокумента.Ссылка = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Ссылка
		|							И СтрокиДокумента.НомерСтроки <> ИзменениеПериодическихРеквизитовРаботникиОрганизации.НомерСтроки
		|							И СтрокиДокумента.ПодразделениеОрганизации = ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПодразделениеОрганизации
		|							И СтрокиДокумента.Должность = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Должность
		|				ГДЕ
		|					СтрокиДокумента.Ссылка = &ДокументСсылка
		|				
		|				СГРУППИРОВАТЬ ПО
		|					СтрокиДокумента.НомерСтроки) КАК РанееЗанятоСтавок
		|				ПО МаксимальныеПериодыШР.НомерСтроки = РанееЗанятоСтавок.НомерСтроки
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					Работники.НомерСтроки КАК НомерСтроки,
		|					Работники.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|					Работники.Должность КАК Должность,
		|					ИтогоЗанятоПоДолжности.КоличествоСтавок КАК КоличествоСтавок
		|				ИЗ
		|					Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК Работники
		|						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							СУММА(ВЫБОР
		|									КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		|											И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|										ТОГДА РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения
		|									ИНАЧЕ РаботникиОрганизаций.ЗанимаемыхСтавок
		|								КОНЕЦ) КАК КоличествоСтавок,
		|							ВЫБОР
		|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		|								ИНАЧЕ РаботникиОрганизаций.Должность
		|							КОНЕЦ КАК Должность,
		|							ВЫБОР
		|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		|							КОНЕЦ КАК ПодразделениеОрганизации
		|						ИЗ
		|							(ВЫБРАТЬ
		|								МАКСИМУМ(Работники.Период) КАК Период,
		|								Работники.Сотрудник КАК Сотрудник,
		|								ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала
		|							ИЗ
		|								Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|									ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		|										И (Работники.Регистратор.Проведен)
		|										И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|							ГДЕ
		|								ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|							
		|							СГРУППИРОВАТЬ ПО
		|								Работники.Сотрудник,
		|								ТЧРаботникиОрганизации.ДатаНачала) КАК ПоследниеСтавки
		|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|								ПО ПоследниеСтавки.Период = РаботникиОрганизаций.Период
		|									И ПоследниеСтавки.Сотрудник = РаботникиОрганизаций.Сотрудник
		|						
		|						СГРУППИРОВАТЬ ПО
		|							ВЫБОР
		|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
		|								ИНАЧЕ РаботникиОрганизаций.Должность
		|							КОНЕЦ,
		|							ВЫБОР
		|								КОГДА РаботникиОрганизаций.ПериодЗавершения <= ПоследниеСтавки.ДатаНачала
		|										И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
		|								ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
		|							КОНЕЦ) КАК ИтогоЗанятоПоДолжности
		|						ПО (ИтогоЗанятоПоДолжности.Должность = Работники.Должность)
		|							И (ИтогоЗанятоПоДолжности.ПодразделениеОрганизации = Работники.ПодразделениеОрганизации)
		|				ГДЕ
		|					Работники.Ссылка = &ДокументСсылка) КАК ОсвобождаетсяСтавок
		|				ПО МаксимальныеПериодыШР.НомерСтроки = ОсвобождаетсяСтавок.НомерСтроки) КАК СвободноСтавокНаДатуПриема
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = СвободноСтавокНаДатуПриема.НомерСтроки
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""КонфликтныйДокумент"",
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	Работники.Регистратор,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 04.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ПО (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении
		|					И (Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала И ВЫБОР
		|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = &ПустаяДата
		|							ТОГДА &ПустаяДата
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
		|					КОНЕЦ)
		|				ИЛИ Работники.Период = ТЧРаботникиОрганизации.ДатаНачала)
		|			И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""ДанныеДляДвиженийКадров"" КАК ВидСтрокиЗапроса,
		|	ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|	ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ТЧРаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ТЧРаботникиОрганизации.ДатаНачала КАК ДатаНачала,
		|	ТЧРаботникиОрганизации.ДатаОкончания КАК ДатаОкончания,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ТЧРаботникиОрганизации.Должность КАК Должность,
		|	ТЧРаботникиОрганизации.РазрядЕТС КАК РазрядЕТС,
		|	ТЧРаботникиОрганизации.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ТЧРаботникиОрганизации.Категория КАК Категория,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|	ТЧРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавка,
		|	ТЧРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
		|	ТЧРаботникиОрганизации.НапомнитьПоЗавершении КАК НапомнитьПоЗавершении,
		|	ТЧРаботникиОрганизации.ГрафикРаботы КАК ГрафикРаботы,
		|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец КАК ОрганизацияПодразделения,
		|	ВЫБОР
		|		КОГДА НЕ ТЧРаботникиОрганизации.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПрежнееПодразделение,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение
		|	КОНЕЦ КАК ПрежняяОрганизация,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Должность
		|	КОНЕЦ КАК ПрежняяДолжность,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ПрежняяСтавка,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.ГрафикРаботы
		|	КОНЕЦ КАК ПрежнийГрафикРаботы,
		|	ВЫБОР
		|		КОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения <= ТЧРаботникиОрганизации.ДатаНачала
		|				И ДанныеПоРаботникуДоНазначения.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ДанныеПоРаботникуДоНазначения.ПериодЗавершения
		|		ИНАЧЕ ДанныеПоРаботникуДоНазначения.Период
		|	КОНЕЦ КАК ДатаПоследнегоДвиженияПоРаботнику,
		|	ПересекающиесяСтроки.КонфликтнаяСтрокаНомер,
		|	NULL КАК КонфликтныйДокумент,
		|	ВЫБОР
		|		КОГДА ТЧРаботникиОрганизации.Сотрудник.НомерДоговора ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТрудовойДоговорПрисутствует,
		|	ТЧРаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
		|	ТЧРаботникиОрганизации.УсловияТрудаИзмерение,
		|	ТЧРаботникиОрганизации.ВидДеятельностиИзмерение,
		|	ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК ПрежнийУсловияТрудаИзмерение,
		|	ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ПрежнийВидДеятельностиИзмерение,
		|	ТЧРаботникиОрганизации.Временно КАК Временно,
		|	ТЧРаботникиОрганизации.ДругоеПеремещение КАК ДругоеПеремещение,
		|	ТЧРаботникиОрганизации.ТипРаботника КАК ТипРаботника,
		|	ТЧРаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|	ТЧРаботникиОрганизации.ПовышенныйКоэффициентЕТС,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 04.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	ТЧРаботникиОрганизации.ОкладВВалюте,
		|	ТЧРаботникиОрганизации.Валюта,
		|	ТЧРаботникиОрганизации.СуммаВВалюте,
		|	ТЧРаботникиОрганизации.ОкладСПовышениемВВалюте,
		|	ТЧРаботникиОрганизации.МесячнаяТарифнаяСтавкаВВалюте,
		|	ТЧРаботникиОрганизации.ДляПечати, //О.Т. Аверсон 13.04.2016 № 1041
		|	ТЧРаботникиОрганизации.ИсключитьИзПУ2, //Аверсон 10.06.2019 КВВ СВФР-004419
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыПоследнихДвиженийРаботников.НомерСтроки КАК НомерСтроки,
		|			ДатыПоследнихДвиженийРаботников.Период КАК Период,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ДанныеПоРаботникуДоНазначения.Должность КАК Должность,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботы КАК ГрафикРаботы,
		|			ДанныеПоРаботникуДоНазначения.ЗанимаемыхСтавокЗавершения КАК ЗанимаемыхСтавокЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ОбособленноеПодразделениеЗавершения КАК ОбособленноеПодразделениеЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПодразделениеОрганизацииЗавершения КАК ПодразделениеОрганизацииЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ДолжностьЗавершения КАК ДолжностьЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ГрафикРаботыЗавершения КАК ГрафикРаботыЗавершения,
		|			ДанныеПоРаботникуДоНазначения.ПериодЗавершения КАК ПериодЗавершения,
		|			ДанныеПоРаботникуДоНазначения.УсловияТрудаИзмерение КАК УсловияТрудаИзмерение,
		|			ДанныеПоРаботникуДоНазначения.ТипРаботника КАК ТипРаботника,
		|			ДанныеПоРаботникуДоНазначения.СотрудникЗаменяемый КАК СотрудникЗаменяемый,
		|			ДанныеПоРаботникуДоНазначения.ВидДеятельностиИзмерение КАК ВидДеятельностиИзмерение
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(Работники.Период) КАК Период,
		|				ТЧРаботникиОрганизации.Сотрудник КАК Сотрудник
		|			ИЗ
		|				Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|					ПО (Работники.Период <= ТЧРаботникиОрганизации.ДатаНачала)
		|						И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|			ГДЕ
		|				ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТЧРаботникиОрганизации.НомерСтроки,
		|				ТЧРаботникиОрганизации.Сотрудник) КАК ДатыПоследнихДвиженийРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДанныеПоРаботникуДоНазначения
		|				ПО (ДанныеПоРаботникуДоНазначения.Период = ДатыПоследнихДвиженийРаботников.Период)
		|					И ДатыПоследнихДвиженийРаботников.Сотрудник = ДанныеПоРаботникуДоНазначения.Сотрудник) КАК ДанныеПоРаботникуДоНазначения
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ДанныеПоРаботникуДоНазначения.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТЧРаботникиОрганизации.НомерСтроки КАК НомерСтроки,
		|			МИНИМУМ(ТЧРаботникиОрганизации2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
		|		ИЗ
		|			Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации2
		|				ПО (ТЧРаботникиОрганизации2.Ссылка = ТЧРаботникиОрганизации.Ссылка)
		|					И ТЧРаботникиОрганизации.НомерСтроки < ТЧРаботникиОрганизации2.НомерСтроки
		|					И ТЧРаботникиОрганизации.Сотрудник = ТЧРаботникиОрганизации2.Сотрудник
		|		ГДЕ
		|			ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТЧРаботникиОрганизации.НомерСтроки) КАК ПересекающиесяСтроки
		|		ПО ТЧРаботникиОрганизации.НомерСтроки = ПересекающиесяСтроки.НомерСтроки
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""КонфликтныйДокумент"",
		|	ТЧРаботникиОрганизации.НомерСтроки,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	Работники.Регистратор,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.СдельнаяОплата, //О.Т. Аверсон 15.10.2015 № 638
		|	ТЧРаботникиОрганизации.БезЕТС, //О.Т. Аверсон 04.11.2015 № 679
		|	ТЧРаботникиОрганизации.ауМестоРаботы, //Аверсон 08.12.2021 КВВ СВФР-008463
		|	ТЧРаботникиОрганизации.ВременныйПереводКлимовичи, //СВЭЙ 23.05.2024 КВВ СВФР-012926
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ТЧРаботникиОрганизации.НеНапоминатьОСобытии
		|ИЗ
		|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		|%СоединениеДатаНачалаРС%
		//Аверсон СВФР-014218
		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ПО (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении
		|					И (
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		//|                   Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала
		|                   %УсловиеДатаНачалаРС1%
		//Аверсон СВФР-014218
		
		|                       И ВЫБОР
		|						КОГДА ТЧРаботникиОрганизации.ДатаОкончания = &ПустаяДата
		|							ТОГДА &ПустаяДата
		|						ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
		|					КОНЕЦ)
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		//|				ИЛИ Работники.Период = ТЧРаботникиОрганизации.ДатаНачала)
		|				ИЛИ %УсловиеДатаНачалаРС2%)
		//Аверсон СВФР-014218
		
		|			И ТЧРаботникиОрганизации.Сотрудник = Работники.Сотрудник
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно 
		Если ТЗДатыНачалаРС = Неопределено Тогда 
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ТЧРаботникиОрганизации.ДатаНачала");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ТЧРаботникиОрганизации.ДатаНачала");
		Иначе  
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПолеДатаНачалаРС%", "ЕСТЬNULL(ВТДатыНачалаРС.ДатаНачалаРС, ДатаВремя(1,1,1)) КАК ДатаНачалаРС,");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединениеДатаНачалаРС%", "
			|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыНачалаРС
			|ПО ТЧРаботникиОрганизации.Сотрудник = ВТДатыНачалаРС.Сотрудник");	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС2%", "Работники.Период = ВТДатыНачалаРС.ДатаНачалаРС");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеДатаНачалаРС1%", "Работники.Период МЕЖДУ ВТДатыНачалаРС.ДатаНачалаРС");
		КонецЕсли;
		//Аверсон СВФР-014218
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Формирует запрос по таблице "ОсновныеНачисления" документа
//
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания, ТЗДатыНачалаРС = Неопределено) //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	
	//толик добавил временные перемещения	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧНачисления.Ссылка КАК Ссылка,
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник КАК Сотрудник,
	|	ТЧРаботникиОрганизации.ПодразделениеОрганизации,
	|	ТЧРаботникиОрганизации.Должность,
	|	ТЧРаботникиОрганизации.ЗанимаемыхСтавок,
	|	ТЧРаботникиОрганизации.ГрафикРаботы,
	|	ТЧРаботникиОрганизации.ДатаНачала КАК Период,
	|	ТЧНачисления.Действие КАК Действие,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТЧРаботникиОрганизации.ДатаОкончания, ДЕНЬ, 1)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА ТЧРаботникиОрганизации.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (НЕ ТЧРаботникиОрганизации.НапомнитьПоЗавершении)
	|			ТОГДА ВЫБОР
	|					КОГДА ТЧНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
	|					КОГДА ТЧНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|					ИНАЧЕ ТЧНачисления.Действие
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.ПустаяСсылка)
	|	КОНЕЦ КАК ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|			ТОГДА """"
	|		ИНАЧЕ ТЧНачисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчетаИзмерение,
	|	ТЧНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ВидРасчета.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ВидРасчета.ПроизвольнаяФормулаРасчета КАК ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1 КАК Показатель1,
	|	ТЧНачисления.Валюта1 КАК Валюта1,
	|	ТЧНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
	|	ТЧНачисления.Показатель2 КАК Показатель2,
	|	ТЧНачисления.Валюта2 КАК Валюта2,
	|	ТЧНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
	|	ТЧНачисления.Показатель3 КАК Показатель3,
	|	ТЧНачисления.Валюта3 КАК Валюта3,
	|	ТЧНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
	|	ТЧНачисления.Показатель4 КАК Показатель4,
	|	ТЧНачисления.Валюта4 КАК Валюта4,
	|	ТЧНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
	|	ТЧНачисления.Показатель5 КАК Показатель5,
	|	ТЧНачисления.Валюта5 КАК Валюта5,
	|	ТЧНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
	|	ТЧНачисления.Показатель6 КАК Показатель6,
	|	ТЧНачисления.Валюта6 КАК Валюта6,
	|	ТЧНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
	|	ТЧРаботникиОрганизации.Временно,
	|	ТЧРаботникиОрганизации.ДругоеПеремещение,
	|	ТЧНачисления.Показатель1ВВалюте КАК Показатель1ВВалюте
	|ИЗ
	|	Документ.ИзменениеПериодическихРеквизитов.ОсновныеНачисления КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|		ПО ТЧНачисления.Ссылка = ТЧРаботникиОрганизации.Ссылка
	|			И ТЧНачисления.Сотрудник = ТЧРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ТЧНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	//Аверсон ЕАЕ 17.12.2024 СВФР-014218
	//Гродно 
	ТЗВозврата = Запрос.Выполнить().Выгрузить();
	Если ТЗДатыНачалаРС <> Неопределено Тогда
		ТЗВозврата.Колонки.Добавить("ПериодРС", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		Для Каждого Стр Из ТЗВозврата Цикл
			НужнаяСтр = ТЗДатыНачалаРС.Найти(Стр.Сотрудник, "Сотрудник");
			Если НужнаяСтр <> Неопределено Тогда
				Стр.ПериодРС = НужнаяСтр.ДатаНачалаРС;
			Иначе
				Стр.ПериодРС = Стр.Период;
			КонецЕсли;
		КонецЦикла;
		ТЗВозврата.Колонки.Удалить("Период");
		ТЗВозврата.Колонки.ПериодРС.Заголовок = "Период";
		ТЗВозврата.Колонки.ПериодРС.Имя = "Период";
	КонецЕсли; 
	
	//Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(Запрос.Выполнить().Выгрузить(), ПроверкаШтатногоРасписания,,Ссылка);
	Возврат ПроцедурыУправленияПерсоналом.СформироватьЗапросПоПлановымНачислениям(ТЗВозврата, ПроверкаШтатногоРасписания,,Ссылка);
	//Аверсон СВФР-014218
	
КонецФункции // СформироватьЗапросПоНачисления()

// Формирует запрос по таблице "КоэфПовышенияТО" документа
Функция СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента)
	//толик добавил временно	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Ссылка,
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.НомерСтроки,
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Коэффициент,
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Размер,
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Сотрудник,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаНачала,
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Действие,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.Временно,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДругоеПеремещение,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаОкончания
	|ИЗ
	|	Документ.ИзменениеПериодическихРеквизитов.КоэфПовышенияТО КАК ИзменениеПериодическихРеквизитовКоэфПовышенияТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ИзменениеПериодическихРеквизитовРаботникиОрганизации
	|		ПО ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Ссылка = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Ссылка
	|			И ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Сотрудник = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Ссылка = &ДокументСсылка
	|	И ИзменениеПериодическихРеквизитовКоэфПовышенияТО.Сотрудник <> &ПустойСотрудник";
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента)
	//толик добавил временно	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("ПустойСотрудник", Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Ссылка,
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.НомерСтроки,
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Коэффициент,
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Размер,
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Сотрудник,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаНачала,
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Действие,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.Временно,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДатаОкончания,
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.ДругоеПеремещение
	|ИЗ
	|	Документ.ИзменениеПериодическихРеквизитов.ПовышенияПоИнструкции КАК ИзменениеПериодическихРеквизитовПовышенияПоИнструкции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ИзменениеПериодическихРеквизитовРаботникиОрганизации
	|		ПО ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Ссылка = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Ссылка
	|			И ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Сотрудник = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Сотрудник
	|ГДЕ
	|	ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Ссылка = &ДокументСсылка
	|	И ИзменениеПериодическихРеквизитовПовышенияПоИнструкции.Сотрудник <> &ПустойСотрудник";
	
	Возврат Запрос.Выполнить();
КонецФункции


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники"": ";
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		// Сотрудник
		НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
		Если НетСотрудника Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
		КонецЕсли;
		
		// ДатаНачала
		НетДатыНачала = Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала);
		Если НетДатыНачала Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указазана дата перемещения!", Отказ, Заголовок);
		КонецЕсли;
		
		// Организация сотрудника должна совпадать с организацией в документе
		Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный работник оформлен на другую организацию!", Отказ, Заголовок);
		КонецЕсли;
		
		// Подразделение
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение, куда переводится работник!", Отказ, Заголовок);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
		КонецЕсли;
		
		// Должность
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана должность, на которую переводится работник!", Отказ, Заголовок);
		КонецЕсли;
		
		//О.Т. Аверсон 04.11.2015 № 679
		Если  НЕ ВыборкаПоСтрокамДокумента.БезЕТС и не Организация.НеУчитыватьЕТКС  Тогда
			Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ТарифнаяСтавкаПервогоРазряда) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана тарифная ставка первого разряда!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
		//О.Т. Аверсон 04.11.2015 № 679
		
		// Количество ставок
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано количество занимаемых работником ставок!", Отказ, Заголовок);
		ИначеЕсли Не НетДатыНачала И ПроверкаШтатногоРасписания Тогда
			Если ВыборкаПоСтрокамДокумента.ОстатокСтавок < ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок Тогда
				если не ((Организация.ИНН = "100074549" или Организация.ИНН = "500021638") и ВыборкаПоСтрокамДокумента.СдельнаяОплата) Тогда //О.Т. Аверсон 15.10.2015 № 638
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "в штатном расписании не предусмотрены ставки для перевода работника!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НетСотрудника ИЛИ НетДатыНачала Тогда
			Возврат; // Дальше не проверяем
		КонецЕсли;
		
		// ГрафикРаботы
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы)  Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан рабочий график!", Отказ, Заголовок);
		КонецЕсли;
		
		// ДатаОкончания
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) и ВыборкаПоСтрокамДокумента.ДатаНачала > ВыборкаПоСтрокамДокумента.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала перемещения не может превышать дату окончания!", Отказ, Заголовок);
		КонецЕсли;
		
		// Проверка: ранее работник должен быть принят на работу
		Если ВыборкаПоСтрокамДокумента.ПрежняяСтавка = NULL Тогда
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " еще не принят на работу!";
			Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ПрежняяСтавка = 0 Тогда	
			СтрокаПродолжениеСообщенияОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен (с " + Формат(ВыборкаПоСтрокамДокумента.ДатаПоследнегоДвиженияПоРаботнику, "ДЛФ=DD") + ")!";
			Сообщить(СтрокаНачалаСообщенияОбОшибке + СтрокаПродолжениеСообщенияОбОшибке);
		КонецЕсли;
		
		// Проверка: противоречие другой строке документа
		Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер <> NULL Тогда
			СтрокаСообщениеОбОшибке = "одним документом допускается регистрировать только одно перемещение работника - см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + "!"; 
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.РазрядЕТС)) И РольДоступна("ОТиЗ") Тогда
			ОбщегоНазначения.СообщитьОбОшибке( "Не введен разряд ЕТС!");			
		КонецЕсли;
		
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "КонфликтныйДокумент" Тогда	
		
		// противоречие другим кадровым приказам
		СтрокаСообщениеОбОшибке = "период действия приказа противоречит кадровому приказу " + Символы.ПС + Символы.Таб + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОсновныеНачисления" документа.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// Сотрудник
	НетСотрудника = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник);
	Если НетСотрудника Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран работник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Вид расчета
	НетВР = НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета);
	Если НетВР И ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ, Заголовок);
	Иначе
		
		// Соответствие размера "основного" начисления штатному расписанию
		Если ПроверкаШтатногоРасписания И НЕ ВыборкаПоСтрокамДокумента.РазмерСоответствуетШТР Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "размер основного начисления не соответствует штатному расписанию!", Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
		ИспользуютсяНачисленияВВалюте = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ИспользуютсяНачисленияВВалюте");
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);
	КонецЕсли;
	
	// проверка на существование работника в табличной части "РаботникиОрганизации"
	Если ВыборкаПоСтрокамДокумента.Период = NULL Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "данный работник не введен в приказ - по нему не могут быть введены начисления!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.Период = ВыборкаПоСтрокамДокумента.ДатаДвижения Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "на дату "+ ВыборкаПоСтрокамДокумента.Период + " изменение начисления уже зарегистрировано документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!", Отказ, Заголовок);
	КонецЕсли;
	
	// Двойные строки
	Если Не НетВР и Не НетСотрудника и ВыборкаПоСтрокамДокумента.ДвойнаяСтрока <> NULL Тогда
		Если ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
			СтрокаСообщениеОбОшибке = "основное начисление работника следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
		Иначе
			СтрокаСообщениеОбОшибке = "работнику не может быть назначено одно и тоже начисление дважды (см. строку " + ВыборкаПоСтрокамДокумента.ДвойнаяСтрока + ")!"; 
		КонецЕсли;
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента,    ВыборкаПоСтрокамДокумента, СтруктураПараметров = "", ТЗДатыНачалаРС = Неопределено) //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		// отразим новое место работы
		Движение = Движения.РаботникиОрганизаций.Добавить();
		
		// Свойства
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно
		ДатаПроверки = ВыборкаПоСтрокамДокумента.ДатаНачала;
		
		Если ТЗДатыНачалаРС <> Неопределено Тогда
			НужнаяСтр = ТЗДатыНачалаРС.Найти(ВыборкаПоСтрокамДокумента.Сотрудник, "Сотрудник");
			Если НужнаяСтр <> Неопределено Тогда
				ДатаПроверки = НужнаяСтр.ДатаНачалаРС;	
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-014218
		
		//Аверсон ЕАЕ 16.12.2024 СВФР-014218
		//Гродно
		//Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.Период						= ДатаПроверки;
		//Аверсон СВФР-014218
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ТипРаботника				= ВыборкаПоСтрокамДокумента.ТипРаботника;
		Движение.СотрудникЗаменяемый		= ВыборкаПоСтрокамДокумента.СотрудникЗаменяемый;
		
		// Ресурсы
		//Если НЕ ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 04.11.2015 № 679
		Движение.КоэффициентЕТС				= ВыборкаПоСтрокамДокумента.КоэффициентЕТС; 
		Движение.РазрядЕТС					= ВыборкаПоСтрокамДокумента.РазрядЕТС; 
		Движение.ИтоговоеПовышениеПоИнструкции = ВыборкаПоСтрокамДокумента.ИтоговоеПовышениеПоИнструкции;
		Движение.ПовышенныйКоэффициентЕТС   = ВыборкаПоСтрокамДокумента.ПовышенныйКоэффициентЕТС;
		Движение.ТарифнаяСтавкаПервогоРазряда = ВыборкаПоСтрокамДокумента.ТарифнаяСтавкаПервогоРазряда;
		Движение.БезЕТС				= ВыборкаПоСтрокамДокумента.БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
		//Иначе
		//	Движение.БезЕТС				= ВыборкаПоСтрокамДокумента.БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
		//КонецЕсли;
		
		Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
		Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок;
		Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
		
		Движение.Категория                  = ВыборкаПоСтрокамДокумента.Категория; //РБ
		
		Движение.Временно                   = ВыборкаПоСтрокамДокумента.Временно; //Толик
		Движение.УсловияТрудаИзмерение		= ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение; //РБ
		Движение.ВидДеятельностиИзмерение	= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение; //РБ
		Движение.ИсключитьИзПУ2 			= ВыборкаПоСтрокамДокумента.ИсключитьИзПУ2; //Аверсон 10.06.2019 КВВ СВФР-004419
		
		// Реквизиты
		Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.Перемещение;
		Движение.ОбособленноеПодразделение	= ВыборкаПоСтрокамДокумента.ОрганизацияПодразделения;
		Движение.ОкладВВалюте				= ВыборкаПоСтрокамДокумента.ОкладВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
		Движение.ДляПечати   				= ВыборкаПоСтрокамДокумента.ДляПечати;
		Движение.ауМестоРаботы = ВыборкаПоСтрокамДокумента.ауМестоРаботы; //Аверсон 08.12.2021 КВВ СВФР-008463
		
		//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда 
			Движение.ВременныйПереводКлимовичи = ВыборкаПоСтрокамДокумента.ВременныйПереводКлимовичи;
		КонецЕсли;
		//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
		
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			
			Если НЕ ВыборкаПоСтрокамДокумента.НапомнитьПоЗавершении И НЕ ВыборкаПоСтрокамДокумента.ДругоеПеремещение Тогда
				
				// вернем прежние данные по прежнему месту работы
				//Движение = Движения.РаботникиОрганизаций.Добавить();
				
				//толик
				//изменил с добавлением ещё одной записи в регистр с пометкой временно
				
				мНайдено = Ложь;
				мДата = ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток;
				Пока НЕ мНайдено Цикл
					мРаботникиОрганизаций = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(мДата,
					Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
					Если мРаботникиОрганизаций[0].Временно Тогда
						мДата = мРаботникиОрганизаций[0].Период - мДлинаСуток;
					Иначе
						мНайдено = Истина;
					КонецЕсли
				КонецЦикла;
				
				Движение = Движения.РаботникиОрганизаций.Добавить();
				
				// Свойства
				Движение.Период						= НачалоДня(ВыборкаПоСтрокамДокумента.ДатаОкончания) + мДлинаСуток;
				
				// Измерения
				Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
				Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
				Движение.ТипРаботника				= ВыборкаПоСтрокамДокумента.ТипРаботника;
				Движение.СотрудникЗаменяемый		= ВыборкаПоСтрокамДокумента.СотрудникЗаменяемый;
				
				// Ресурсы
				//Если НЕ мРаботникиОрганизаций[0].БезЕТС Тогда //О.Т. Аверсон 04.11.2015 № 679
				Движение.КоэффициентЕТС				= мРаботникиОрганизаций[0].КоэффициентЕТС; 
				Движение.РазрядЕТС					= мРаботникиОрганизаций[0].РазрядЕТС; 
				Движение.ИтоговоеПовышениеПоИнструкции = мРаботникиОрганизаций[0].ИтоговоеПовышениеПоИнструкции;
				Движение.ПовышенныйКоэффициентЕТС   = мРаботникиОрганизаций[0].ПовышенныйКоэффициентЕТС;
				Движение.ТарифнаяСтавкаПервогоРазряда = мРаботникиОрганизаций[0].ТарифнаяСтавкаПервогоРазряда;
				Движение.БезЕТС				= мРаботникиОрганизаций[0].БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
				//Иначе
				//	Движение.БезЕТС				= мРаботникиОрганизаций[0].БезЕТС; //О.Т. Аверсон 04.11.2015 № 679
				//КонецЕсли;
				
				Движение.ПодразделениеОрганизации	= мРаботникиОрганизаций[0].ПодразделениеОрганизации;
				Движение.Должность					= мРаботникиОрганизаций[0].Должность;
				Движение.ЗанимаемыхСтавок			= мРаботникиОрганизаций[0].ЗанимаемыхСтавок;
				Движение.ГрафикРаботы				= мРаботникиОрганизаций[0].ГрафикРаботы;
				
				Движение.Категория                  = мРаботникиОрганизаций[0].Категория; //РБ
				
				Движение.Временно                   = ВыборкаПоСтрокамДокумента.Временно; //Толик
				Движение.УсловияТрудаИзмерение		= мРаботникиОрганизаций[0].УсловияТрудаИзмерение; //РБ
				Движение.ВидДеятельностиИзмерение	= мРаботникиОрганизаций[0].ВидДеятельностиИзмерение; //РБ
				Движение.ИсключитьИзПУ2 			= ВыборкаПоСтрокамДокумента.ИсключитьИзПУ2; //Аверсон 14.08.2019 КВВ СВФР-004639
				
				// Реквизиты
				Движение.ПричинаИзмененияСостояния	= Перечисления.ПричиныИзмененияСостояния.Перемещение;
				Движение.ОбособленноеПодразделение	= мРаботникиОрганизаций[0].ОбособленноеПодразделение;
				Движение.ОкладВВалюте				= мРаботникиОрганизаций[0].ОкладВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				Движение.ДляПечати   				= мРаботникиОрганизаций[0].ДляПечати;
				Движение.ауМестоРаботы = мРаботникиОрганизаций[0].ауМестоРаботы; //Аверсон 08.12.2021 КВВ СВФР-008463
				
				//СВЭЙ 23.05.2024 КВВ СВФР-012926 (
				Если Организация.ИНН = "700103211" Тогда 
					Движение.ВременныйПереводКлимовичи = мРаботникиОрганизаций[0].ВременныйПереводКлимовичи;
				КонецЕсли;
				//СВЭЙ 23.05.2024 КВВ СВФР-012926 )
				
			Иначе
				Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
					
					Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
					
					// Свойства
					Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
					
					// Измерения
					Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
					Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
					Движение.ДатаИзменения				= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
					Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение;
					
					// Реквизиты
					Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение;
					Движение.Должность					= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
					Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ПрежнийГрафикРаботы;
					Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
					Движение.ЗаниматьСтавку				= Истина;
					Движение.НеНапоминатьОСобытии		= ВыборкаПоСтрокамДокумента.НеНапоминатьОСобытии;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//толик
		//добавли напоминания для кадров при временном перемещении
		Если ВыборкаПоСтрокамДокумента.Временно И Не(ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания)) Тогда
			Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаНачала + мДлинаСуток;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ДатаИзменения				= ВыборкаПоСтрокамДокумента.ДатаНачала + мДлинаСуток;
			Движение.ПланируемоеСобытие			= Перечисления.НамеченныеСобытияПоПерсоналу.Перемещение;
			
			// Реквизиты
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
			Движение.ГрафикРаботы				= ВыборкаПоСтрокамДокумента.ПрежнийГрафикРаботы;
			Движение.ЗанимаемыхСтавок			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
			Движение.ЗаниматьСтавку				= Истина;
			Движение.НеНапоминатьОСобытии		= ВыборкаПоСтрокамДокумента.НеНапоминатьОСобытии;
		КонецЕсли;
		
		//добавил проверку по временным перемещениям
		
		//РБ н
		// Движения по регистру "ТарифныеСтавкиработниковОрганизации"
		Движение = Движения.ТарифныеСтавкиРаботниковОрганизации.Добавить();
		// Свойства
		
		//Аверсон ЕАЕ 17.12.2024 СВФР-014218
		//Гродно
		//Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.Период = ДатаПроверки;
		//Аверсон СВФР-014218
		
		// Измерения
		Движение.Сотрудник                  = ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		Если ВыборкаПоСтрокамДокумента.Временно Тогда
			мТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток,
			Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
			Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			Движение.ПроцентПоКонтракту         = мТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладВВалюте;
			Движение.Валюта	= мТарифныеСтавкиРаботниковОрганизации.Валюта;
			Движение.СуммаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= мТарифныеСтавкиРаботниковОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
			//ИначеЕсли ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 04.11.2015 № 679
			//	Движение.ТарифнаяСтавка  				 = ВыборкаПоСтрокамДокумента.ТарифнаяСтавка;
			//	Движение.Ставка         				 = ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавка;
		иначе
			
			Движение.Ставка          			= ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавка;
			Движение.ПроцентПоКонтракту         = ВыборкаПоСтрокамДокумента.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= ВыборкаПоСтрокамДокумента.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = ВыборкаПоСтрокамДокумента.ТарифныйСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= ВыборкаПоСтрокамДокумента.ОкладВВалюте;
			Движение.Валюта	= ВыборкаПоСтрокамДокумента.Валюта;
			Движение.СуммаВВалюте	= ВыборкаПоСтрокамДокумента.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= ВыборкаПоСтрокамДокумента.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= ВыборкаПоСтрокамДокумента.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= ВыборкаПоСтрокамДокумента.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
		КонецЕсли;
		Если (НЕ ВыборкаПоСтрокамДокумента.Временно) И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания) Тогда
			Движение = Движения.ТарифныеСтавкиРаботниковОрганизации.Добавить();
			// Свойства
			Движение.Период                     = ВыборкаПоСтрокамДокумента.ДатаОкончания;
			// Измерения
			Движение.Сотрудник                  = ВыборкаПоСтрокамДокумента.Сотрудник;
			Движение.Организация   		    	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			мТарифныеСтавкиРаботниковОрганизации = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ВыборкаПоСтрокамДокумента.ДатаНачала - мДлинаСуток,
			Новый Структура("Организация,Сотрудник", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоСтрокамДокумента.Сотрудник));
			
			//Если НЕ ВыборкаПоСтрокамДокумента.БезЕТС Тогда //О.Т. Аверсон 04.11.2015 № 679
			Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			Движение.ПроцентПоКонтракту         = мТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту;
			Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			Движение.ТарифнаяСПовышениемПоИнструкции = мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции;
			//О.Т. Аверсон 12.04.2016 № 1041
			Движение.ОкладВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладВВалюте;
			Движение.Валюта	= мТарифныеСтавкиРаботниковОрганизации.Валюта;
			Движение.СуммаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.СуммаВВалюте;
			Движение.ОкладСПовышениемВВалюте	= мТарифныеСтавкиРаботниковОрганизации.ОкладСПовышениемВВалюте;
			Движение.МесячнаяТарифнаяСтавкаВВалюте	= мТарифныеСтавкиРаботниковОрганизации.МесячнаяТарифнаяСтавкаВВалюте;
			Движение.ДляПечати	= мТарифныеСтавкиРаботниковОрганизации.ДляПечати;
			//О.Т. Аверсон 12.04.2016 № 1041
			
			//Иначе
			//	Движение.Ставка          			= мТарифныеСтавкиРаботниковОрганизации.Ставка;
			//	Движение.ТарифнаяСтавка 			= мТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка;
			//КонецЕсли;
			
		КонецЕсли;				
		
		//РБ к
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

Процедура ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса)
	
	Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период						= ВыборкаСтрокЗапроса.Период;
	
	// Измерения
	Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Если НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение	= ВыборкаСтрокЗапроса.ВидРасчета;
	КонецЕсли;
	
	// Ресурсы	
	Движение.Действие					= ВыборкаСтрокЗапроса.Действие;
	Движение.ВидРасчета					= ВыборкаСтрокЗапроса.ВидРасчета;
	Если ВыборкаСтрокЗапроса.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		Движение.ТарифныйРазряд1		= ВыборкаСтрокЗапроса.ТарифныйРазряд1;
		Движение.Показатель1			= ВыборкаСтрокЗапроса.Показатель1;
		Движение.Показатель1ВВалюте		= ВыборкаСтрокЗапроса.Показатель1ВВалюте;
		Движение.Валюта1				= ВыборкаСтрокЗапроса.Валюта1;
		Движение.ТарифныйРазряд2		= ВыборкаСтрокЗапроса.ТарифныйРазряд2;
		Движение.Показатель2			= ВыборкаСтрокЗапроса.Показатель2;
		Движение.Валюта2				= ВыборкаСтрокЗапроса.Валюта2;
		Движение.ТарифныйРазряд3		= ВыборкаСтрокЗапроса.ТарифныйРазряд3;
		Движение.Показатель3			= ВыборкаСтрокЗапроса.Показатель3;
		Движение.Валюта3				= ВыборкаСтрокЗапроса.Валюта3;		
		Движение.ТарифныйРазряд4		= ВыборкаСтрокЗапроса.ТарифныйРазряд4;
		Движение.Показатель4			= ВыборкаСтрокЗапроса.Показатель4;
		Движение.Валюта4				= ВыборкаСтрокЗапроса.Валюта4;		
	КонецЕсли;
	Движение.Временно                   = ВыборкаСтрокЗапроса.Временно; //Толик
	
	// Движения на дату завершения
	Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) И НЕ ВыборкаСтрокЗапроса.ДругоеПеремещение Тогда
		// Ресурсы
		//толик
		//Движение.ПериодЗавершения			= ВыборкаСтрокЗапроса.ДатаОкончания + мДлинаСуток;
		//Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		//	Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Начать
		//ИначеЕсли ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
		//	Движение.ДействиеЗавершения		= Перечисления.ВидыДействияСНачислением.Прекратить
		//Иначе	
		//	Движение.ДействиеЗавершения		= ВыборкаСтрокЗапроса.Действие;
		//КонецЕсли;
		//Движение.ТарифныйРазряд1Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд1;
		//Движение.Показатель1Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер1;
		//Движение.Валюта1Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта1;
		//Движение.ТарифныйРазряд2Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд2;
		//Движение.Показатель2Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер2;
		//Движение.Валюта2Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта2;
		//Движение.ТарифныйРазряд3Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд3;
		//Движение.Показатель3Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер3;
		//Движение.Валюта3Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта3;
		//Движение.ТарифныйРазряд4Завершения	= ВыборкаСтрокЗапроса.ПрежнийТарифныйРазряд4;
		//Движение.Показатель4Завершения		= ВыборкаСтрокЗапроса.ПрежнийРазмер4;
		//Движение.Валюта4Завершения			= ВыборкаСтрокЗапроса.ПрежняяВалюта4;		
		//
		//
		//Движение.ВидРасчетаЗавершения		= ВыборкаСтрокЗапроса.ПрежнийВидРасчета;
		//му 
		//толик убрал временные перемещения
		мНайдено = Ложь;
		мДата = ВыборкаСтрокЗапроса.Период - мДлинаСуток;
		Пока НЕ мНайдено Цикл
			мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(мДата,
			Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаСтрокЗапроса.Сотрудник, ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено)));
			Если мПлановыеНачисленияРаботниковОрганизаций.Количество() = 0 Тогда
				мПлановыеНачисленияРаботниковОрганизаций.Добавить();
			КонецЕсли;	
			Если мПлановыеНачисленияРаботниковОрганизаций[0].Временно Тогда
				мДата = мПлановыеНачисленияРаботниковОрганизаций[0].Период - мДлинаСуток;
			Иначе
				мНайдено = Истина;
			КонецЕсли
		КонецЦикла;
		//енд 
		Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
		// Свойства
		
		Если НЕ ЗначениеЗаполнено(мПлановыеНачисленияРаботниковОрганизаций[0].ВидРасчета) Тогда
			//контракт если не было ранее прекратить
			Движение.Период			= НачалоДня(ВыборкаСтрокЗапроса.ПериодЗавершения);
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ВидРасчетаИзмерение	= ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено);
			
			// Ресурсы	
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить;
			
			Движение.ВидРасчета		= ВыборкаСтрокЗапроса.ВидРасчета;
		Иначе
			
			Движение.Период			= НачалоДня(ВыборкаСтрокЗапроса.ПериодЗавершения);
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.ВидРасчетаИзмерение	= ?(НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление, ВыборкаСтрокЗапроса.ВидРасчета, Неопределено);
			
			// Ресурсы	
			Если ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
			ИначеЕсли ВыборкаСтрокЗапроса.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
			Иначе	
				Движение.Действие		= ВыборкаСтрокЗапроса.Действие;
			КонецЕсли;
			Движение.ТарифныйРазряд1	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд1;
			Движение.Показатель1		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель1;
			Движение.Показатель1ВВалюте	= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель1ВВалюте;//О.Т. Аверсон 12.04.2016 № 1041
			Движение.Валюта1			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта1;
			Движение.ТарифныйРазряд2	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд2;
			Движение.Показатель2		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель2;
			Движение.Валюта2			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта2;
			Движение.ТарифныйРазряд4	= мПлановыеНачисленияРаботниковОрганизаций[0].ТарифныйРазряд4;
			Движение.Показатель4		= мПлановыеНачисленияРаботниковОрганизаций[0].Показатель4;
			Движение.Валюта4			= мПлановыеНачисленияРаботниковОрганизаций[0].Валюта4;		
			
			Движение.ВидРасчета		= мПлановыеНачисленияРаботниковОрганизаций[0].ВидРасчета;
		КонецЕсли;
		//енд		
	КонецЕсли;
	
	// Движения по регистру "КоэффициентИндексацииЗаработка" - отразим факт индексации заработка
	Если ВыборкаПоШапкеДокумента.ИндексацияЗаработка И ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		
		// определим форму оплаты
		Если ВыборкаСтрокЗапроса.СпособРасчета = ВыборкаСтрокЗапроса.СпособРасчетаЗавершения Тогда
			ФормаОплатыДо = ВыборкаСтрокЗапроса.СпособРасчета;
			ФормаОплатыПосле = ВыборкаСтрокЗапроса.СпособРасчета;
		Иначе
			Если ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням 
				Или ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
				ФормаОплатыДо = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
			ИначеЕсли ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок 
				Или ВыборкаСтрокЗапроса.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
				ФормаОплатыДо = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
			Иначе
				ФормаОплатыДо = ВыборкаСтрокЗапроса.СпособРасчета;
			КонецЕсли;
			Если ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням 
				Или ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам Тогда
				ФормаОплатыПосле = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням
			ИначеЕсли ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок 
				Или ВыборкаСтрокЗапроса.СпособРасчетаЗавершения = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда
				ФормаОплатыПосле = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке
			Иначе
				ФормаОплатыПосле = ВыборкаСтрокЗапроса.СпособРасчетаЗавершения;
			КонецЕсли;
		КонецЕсли;
		
		//Если ФормаОплатыДо <> ФормаОплатыПосле Тогда
		//	ТекстСообщения = "Сотруднику " + Строка(ВыборкаСтрокЗапроса.Сотрудник) + " изменена форма оплаты труда; коэффициент индексации заработка не зарегистрирован! Для регистрации коэффициента индексации можно воспользоваться документом ""Ввод коэффициентов индексации заработка""";
		//	Если ЗначениеЗаполнено(Заголовок) Тогда
		//		ТекстСообщения = Заголовок + Символы.ПС + ТекстСообщения;
		//		Заголовок = "";
		//	КонецЕсли;
		//	ОбщегоНазначения.СообщитьИнформациюПользователю(ТекстСообщения);
		
		Если ВыборкаСтрокЗапроса.Показатель1Завершения > 0 И ВыборкаСтрокЗапроса.Показатель1 > ВыборкаСтрокЗапроса.Показатель1Завершения Тогда
			Движение = Движения.КоэффициентИндексацииЗаработка.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаСтрокЗапроса.Период;
			
			// Измерения
			Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Ресурсы
			Движение.Коэффициент				= ?(ВыборкаСтрокЗапроса.Показатель1Завершения = 0, 0, ВыборкаСтрокЗапроса.Показатель1 / ВыборкаСтрокЗапроса.Показатель1Завершения);
		КонецЕсли;
		// Движения на дату завершения
		Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) Тогда
			
			Если ВыборкаСтрокЗапроса.Показатель1 > 0 И ВыборкаСтрокЗапроса.Показатель1Завершения > ВыборкаСтрокЗапроса.Показатель1 Тогда
				Движение = Движения.КоэффициентИндексацииЗаработка.Добавить();
				
				// Свойства
				Движение.Период						= ВыборкаСтрокЗапроса.ПериодЗавершения;
				
				// Измерения
				Движение.Сотрудник					= ВыборкаСтрокЗапроса.Сотрудник;
				Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
				
				// Ресурсы
				Движение.Коэффициент				= ?(ВыборкаСтрокЗапроса.Показатель1 =0, 0, ВыборкаСтрокЗапроса.Показатель1Завершения / ВыборкаСтрокЗапроса.Показатель1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоНачислениям()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//  СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//                                             накопления по которым надо проводить документ
//  СтруктураПараметров                      - структура параметров проведения.
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента, СтруктураПараметров = "")
	
	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ДанныеДляДвиженийКадров" Тогда
		
		ПрежняяСтавка			= ВыборкаПоСтрокамДокумента.ПрежняяСтавка;
		ПрежнееПодразделение	= ВыборкаПоСтрокамДокумента.ПрежнееПодразделение; 
		ПрежняяДолжность		= ВыборкаПоСтрокамДокумента.ПрежняяДолжность;
		ПрежнийУсловияТруда     = ВыборкаПоСтрокамДокумента.ПрежнийУсловияТрудаИзмерение;
		ПрежнийВидДеятельностиИзмерение = ВыборкаПоСтрокамДокумента.ПрежнийВидДеятельностиИзмерение;
		
		// по прежнему месту работы освободим занимаемые ранее ставки
		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
		
		// Измерения
		Движение.ПодразделениеОрганизации		= ПрежнееПодразделение;
		Движение.Должность						= ПрежняяДолжность;
		Движение.УсловияТрудаИзмерение		    = ПрежнийУсловияТруда;
		Движение.ВидДеятельностиИзмерение		= ПрежнийВидДеятельностиИзмерение;
		
		// Ресурсы
		Движение.КоличествоСтавок				= ПрежняяСтавка; 
		
		// по новому месту работы займем указанные ставки
		Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
		
		// Свойства
		Движение.Период							= ВыборкаПоСтрокамДокумента.ДатаНачала;
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		
		// Измерения
		Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		Движение.Должность						= ВыборкаПоСтрокамДокумента.Должность;
		Движение.УсловияТрудаИзмерение		    = ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение;
		Движение.ВидДеятельностиИзмерение		= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение;
		
		// Ресурсы
		Движение.КоличествоСтавок				= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок; 
		
		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаОкончания)
			и НЕ ВыборкаПоСтрокамДокумента.НапомнитьПоЗавершении
			И НЕ ВыборкаПоСтрокамДокумента.ДругоеПеремещение Тогда
			
			// по прежнему месту работы займем временно освобожденные ставки
			Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
			Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;
			
			// Измерения
			Движение.ПодразделениеОрганизации	= ПрежнееПодразделение;
			Движение.Должность					= ПрежняяДолжность;
			Движение.УсловияТрудаИзмерение		    = ПрежнийУсловияТруда;
			Движение.ВидДеятельностиИзмерение		= ПрежнийВидДеятельностиИзмерение;
			
			// Ресурсы
			Движение.КоличествоСтавок			= ПрежняяСтавка; 
			
			// по новому месту работы освободим временно занимавшиеся ставки
			Движение = Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Добавить();
			
			// Свойства
			Движение.Период						= ВыборкаПоСтрокамДокумента.ДатаОкончания + мДлинаСуток;
			Движение.ВидДвижения				= ВидДвиженияНакопления.Расход;
			
			// Измерения
			Движение.ПодразделениеОрганизации	= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
			Движение.Должность					= ВыборкаПоСтрокамДокумента.Должность;
			Движение.УсловияТрудаИзмерение		    = ВыборкаПоСтрокамДокумента.УсловияТрудаИзмерение;
			Движение.ВидДеятельностиИзмерение		= ВыборкаПоСтрокамДокумента.ВидДеятельностиИзмерение;
			
			// Ресурсы
			Движение.КоличествоСтавок			= ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

Процедура ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам)
	
	Движение = Движения.КоэфПовышенияТО.Добавить();
	
	Движение.Период = ВыборкаПоКоэфициентам.ДатаНачала;
	Движение.Сотрудник = ВыборкаПоКоэфициентам.Сотрудник;
	Движение.Коэффициент = ВыборкаПоКоэфициентам.Коэффициент; 
	
	Движение.Размер = ВыборкаПоКоэфициентам.Размер;
	Движение.Действие = ВыборкаПоКоэфициентам.Действие;
	//толик
	Движение.Временно = ВыборкаПоКоэфициентам.Временно;
	
	Если ЗначениеЗаполнено(ВыборкаПоКоэфициентам.ДатаОкончания) И НЕ ВыборкаПоКоэфициентам.ДругоеПеремещение Тогда
		мНайдено = Ложь;
		мДата = ВыборкаПоКоэфициентам.ДатаНачала - мДлинаСуток;
		Пока НЕ мНайдено Цикл
			мПлановые = РегистрыСведений.КоэфПовышенияТО.СрезПоследних(мДата,
			Новый Структура("Сотрудник, Коэффициент", ВыборкаПоКоэфициентам.Сотрудник, ВыборкаПоКоэфициентам.Коэффициент));
			Если мПлановые.Количество() = 0 Тогда
				мПлановые.Добавить();
			КонецЕсли;	
			Если мПлановые[0].Временно Тогда
				мДата = мПлановые[0].Период - мДлинаСуток;
			Иначе
				мНайдено = Истина;
			КонецЕсли
		КонецЦикла;
		Движение = Движения.КоэфПовышенияТО.Добавить();
		
		Движение.Период = НачалоДня(ВыборкаПоКоэфициентам.ДатаОкончания) + мДлинаСуток;
		Движение.Сотрудник = ВыборкаПоКоэфициентам.Сотрудник;
		Движение.Коэффициент = ВыборкаПоКоэфициентам.Коэффициент; 
		
		Движение.Размер = мПлановые[0].Размер;
		Если ВыборкаПоКоэфициентам.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
		ИначеЕсли ВыборкаПоКоэфициентам.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
			Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
		Иначе	
			Движение.Действие		= ВыборкаПоКоэфициентам.Действие;
		КонецЕсли;
	КонецЕсли;
	//
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДвиженияПоПовышениям(ВыборкаПоПовышениям)
	
	Если НЕ (ВыборкаПоПовышениям.Размер = 0 И НЕ ЗначениеЗаполнено(ВыборкаПоПовышениям.Коэффициент)) Тогда //СВЭЙ 19.02.2024 КВВ СВФР-012329
		
		Движение = Движения.ПовышенияПоИнструкции.Добавить();
		
		Движение.Период = ВыборкаПоПовышениям.ДатаНачала;
		Движение.Сотрудник = ВыборкаПоПовышениям.Сотрудник;
		Движение.Коэффициент = ВыборкаПоПовышениям.Коэффициент; 
		
		Движение.Размер = ВыборкаПоПовышениям.Размер;
		Движение.Действие = ВыборкаПоПовышениям.Действие;
		//толик
		Движение.Временно = ВыборкаПоПовышениям.Временно;
		
		Если ЗначениеЗаполнено(ВыборкаПоПовышениям.ДатаОкончания) И НЕ ВыборкаПоПовышениям.ДругоеПеремещение Тогда
			мНайдено = Ложь;
			мДата = ВыборкаПоПовышениям.ДатаНачала - мДлинаСуток;
			Пока НЕ мНайдено Цикл
				мПлановые = РегистрыСведений.ПовышенияПоИнструкции.СрезПоследних(мДата,
				Новый Структура("Сотрудник, Коэффициент", ВыборкаПоПовышениям.Сотрудник, ВыборкаПоПовышениям.Коэффициент));
				Если мПлановые.Количество() = 0 Тогда
					мПлановые.Добавить();
				КонецЕсли;	
				Если мПлановые[0].Временно Тогда
					мДата = мПлановые[0].Период - мДлинаСуток;
				Иначе
					мНайдено = Истина;
				КонецЕсли
			КонецЦикла;
			Движение = Движения.ПовышенияПоИнструкции.Добавить();
			
			Движение.Период = НачалоДня(ВыборкаПоПовышениям.ДатаОкончания) + мДлинаСуток;
			Движение.Сотрудник = ВыборкаПоПовышениям.Сотрудник;
			Движение.Коэффициент = ВыборкаПоПовышениям.Коэффициент; 
			
			Движение.Размер = мПлановые[0].Размер;
			Если ВыборкаПоПовышениям.Действие = Перечисления.ВидыДействияСНачислением.Прекратить Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Начать
			ИначеЕсли ВыборкаПоПовышениям.Действие = Перечисления.ВидыДействияСНачислением.Начать Тогда
				Движение.Действие		= Перечисления.ВидыДействияСНачислением.Прекратить
			Иначе	
				Движение.Действие		= ВыборкаПоПовышениям.Действие;
			КонецЕсли;
		КонецЕсли;
		//
	КонецЕсли;
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ТОЛИК проверим временные перемещения 
	Для Каждого мСтрока Из РаботникиОрганизации Цикл
		Отказ = ПрочиеПроцедуры.ПроверитьИОтрегулироватьПеремещение(мСтрока.ДатаНачала, мСтрока.Сотрудник, Организация, ЭтотОбъект, мСтрока);
	КонецЦикла;
	Если ЭтотОбъект.Модифицированность() Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	//толик проверка при "не изменять" начисления а в регистре другое значение
	Если РольДоступна("ОТиЗ") Тогда
		ПроверкаНаПравильностьПоказателей();
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда
			
			// Получение учетной политики по персоналу организации
			УчетнаяПолитикаПоПерсоналуОрганизации	= глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");
			//ПроверкаШтатногоРасписания				= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитикаПоПерсоналуОрганизации, Организация, "ПроверкаШтатногоРасписания");
			ПроверкаШтатногоРасписания				= Ложь;
			
			//Аверсон ЕАЕ 16.12.2024 СВФР-014218
			//Гродно
			ТЗДатыНачалаРС = ПолучитьДатыНачалаРС();
			//Аверсон СВФР-014218
			
			// получим реквизиты табличной части
			РезультатЗапросаПоРаботники	= СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента, Режим, Ложь, ТЗДатыНачалаРС); //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
			ВыборкаПоСтрокамДокумента	= РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания);
				
				Если НЕ Отказ Тогда
					//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
					СотрудникОбъект = ВыборкаПоСтрокамДокумента.Сотрудник.ПолучитьОбъект();
					Если ВыборкаПоСтрокамДокумента.ТипРаботника <> СотрудникОбъект.ТипРаботника Тогда
						СотрудникОбъект.ТипРаботника = ВыборкаПоСтрокамДокумента.ТипРаботника;
						Если ВыборкаПоСтрокамДокумента.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
							СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
						Иначе
							СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
						КонецЕсли;	
						СотрудникОбъект.Записать();
					КонецЕсли;
					//заявка №1734
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента,ВыборкаПоСтрокамДокумента);
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента,,ТЗДатыНачалаРС); //Аверсон ЕАЕ 17.12.2024 СВФР-014218 ТЗДатыНачалаРС Гродно
					
				КонецЕсли;
				
			КонецЦикла;
			
			// выполним выборку по табличной части основных начислений
			
			//Аверсон ЕАЕ 17.12.2024 СВФР-014218
			//Гродно
			//ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания).Выбрать();
			ВыборкаПоСтрокамДокумента = СформироватьЗапросПоНачисления(ПроверкаШтатногоРасписания, ТЗДатыНачалаРС).Выбрать();
			//Аверсон СВФР-014218
			
			// обходим строки документа
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверкаШтатногоРасписания);
				Если не Отказ Тогда
					ДобавитьСтрокуВДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
				КонецЕсли;
				
			КонецЦикла;
			
			
			ВыборкаПоКоэфициентам = СформироватьЗапросПоКоэфПовышенияТО(ВыборкаПоШапкеДокумента).Выбрать();
			Пока ВыборкаПоКоэфициентам.Следующий() Цикл
				ДобавитьСтрокуВДвиженияПоКоэффициентам(ВыборкаПоКоэфициентам);
			КонецЦикла;
			
			ВыборкаПоПовышениям  = СформироватьЗапросПоПовышенияПоИнструкции(ВыборкаПоШапкеДокумента).Выбрать();
			Пока ВыборкаПоПовышениям.Следующий() Цикл
				ДобавитьСтрокуВДвиженияПоПовышениям(ВыборкаПоПовышениям);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
	// получить новый номер документа по совокупности кадровых документов
	ПроцедурыУправленияПерсоналом.ПриУстановкеНовогоНомераКадровогоДокумента(СтандартнаяОбработка, ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Префикс, Дата);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Организация) И Организация.ИНН = "700103211" Тогда
		КраткийСоставДокДатаС = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаНачала");
		КраткийСоставДокДатаПо = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(РаботникиОрганизации,"ДатаОкончания");
	КонецЕсли;
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 )
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		ЗаписьРегистрации = ПринадлежностьПоследовательностям.КадровыеПриказыОрганизации.Добавить();
		ЗаписьРегистрации.Период      = Дата;
		ЗаписьРегистрации.Регистратор = Ссылка;
	КонецЕсли;
	//толик
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если РольДоступна("ОК")	Тогда
			ЭтотОбъект.ПользовательОК = ИмяПользователя();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПользовательООТиЗ) Тогда
			Если РольДоступна("ОТиЗ")	Тогда
				ЭтотОбъект.ПользовательООТиЗ = ИмяПользователя();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если РольДоступна("ОК")	Тогда
			ЭтотОбъект.ПользовательОК = "";
		КонецЕсли;
		Если РольДоступна("ОТиЗ")	Тогда
			ЭтотОбъект.ПользовательООТиЗ = "";
		КонецЕсли;
	КонецЕсли;
	//енд
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверим уникальность номера с точки зрения кадровой нумерации
	ПроцедурыУправленияПерсоналом.ПроверкаУникальностиНомераКадровогоДокумента(ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ЕдиныйНумераторКадровыхДокументов"), Номер, Дата, Ссылка);
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.Проведен Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Основание",		Основание);
			Запрос.УстановитьПараметр("Организация",	Организация);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровоеПеремещениеРаботники.Сотрудник,
			|	КадровоеПеремещениеРаботники.ФизЛицо,
			|	КадровоеПеремещениеРаботники.ДатаНачала,
			|	КадровоеПеремещениеРаботники.ДатаОкончания,
			|	КадровоеПеремещениеРаботники.НапомнитьПоЗавершении,
			|	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации,
			|	КадровоеПеремещениеРаботники.НоваяДолжность КАК Должность,
			|	КадровоеПеремещениеРаботники.ЗанимаемыхСтавок,
			|	КадровоеПеремещениеРаботники.ГрафикРаботы
			|ИЗ
			|	Документ.КадровоеПеремещение.Работники КАК КадровоеПеремещениеРаботники
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			|		ПО КадровоеПеремещениеРаботники.НовоеПодразделение = СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение
			|			И (СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация)
			|ГДЕ
			|	КадровоеПеремещениеРаботники.Ссылка = &Основание";
			
			РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если Основание.ВидДоговора <> Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Основание.ОбособленноеПодразделение.Пустая() Тогда
			Организация = Основание.ОбособленноеПодразделение;
		Иначе
			Организация = Основание.Организация;
		КонецЕсли;
		
		НоваяСтрока = РаботникиОрганизации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Основание);
		НоваяСтрока.Сотрудник = Основание;
		НоваяСтрока.ПроцентПоКонтракту = Основание.ПроцентПовышения;
		НоваяСтрока.МесячнаяТарифнаяСтавка = Основание.РасчетнаяТарифнаяСтавка;
		
		ДобавитьСтрокиНачисленийПоРаботнику(Основание);
		
		Если ЗначениеЗаполнено(Основание.ВидРасчета) тогда
			
			НовоеНачисление =  ОсновныеНачисления.Добавить();
			НовоеНачисление.Сотрудник = Основание;
			НовоеНачисление.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
			НовоеНачисление.ВидРасчета = Основание.ВидРасчета;
			Если Основание.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
				ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
				Если ЗначениеЗаполнено(ДнейВГоду) ИЛИ ДнейВГоду.Размер <> 0 тогда
					НовоеНачисление.Показатель1 = ОбщегоНазначения.ОкруглитьПоВалюте(Основание.РасчетнаяТарифнаяСтавка/?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
				Иначе
					Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
				КонецЕсли;
			ИначеЕсли Основание.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке ИЛИ Основание.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок тогда
				Если ЗначениеЗаполнено(НоваяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),НоваяСтрока.ГрафикРаботы));
					Если ЧасовВГоду.Размер = 0 Тогда 
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
					КонецЕсли;  
				иначе  					
					ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ОбщегоНазначения.ПолучитьРабочуюДату(),Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
				КонецЕсли;
				Если ЗначениеЗаполнено(ЧасовВГоду) ИЛИ ЧасовВГоду.Размер <> 0 тогда
					НовоеНачисление.Показатель1 = ОбщегоНазначения.ОкруглитьПоВалюте(Основание.РасчетнаяТарифнаяСтавка/?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
				Иначе
					Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
				КонецЕсли;
			Иначе
				НовоеНачисление.Показатель1	  = Основание.РасчетнаяТарифнаяСтавка;
			КонецЕсли;
		Конецесли;
		
		Если Основание.ПерсональныеНадбавки.Количество() > 0 тогда
			Для каждого СтрокиНадбавка из Основание.ПерсональныеНадбавки цикл
				НовоеНачисление =  ОсновныеНачисления.Добавить();
				НовоеНачисление.Сотрудник = Основание;
				НовоеНачисление.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				НовоеНачисление.ВидРасчета = СтрокиНадбавка.Надбавка;
				НовоеНачисление.Показатель1	  = СтрокиНадбавка.Показатель1;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Строка из Основание.КоэфПовышенияТО Цикл
			НоваяСтрокаКоэф = КоэфПовышенияТО.Добавить();
			НоваяСтрокаКоэф.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
			НоваяСтрокаКоэф.Сотрудник = Основание;
			НоваяСтрокаКоэф.Коэффициент = Строка.Коэффициент;
			НоваяСтрокаКоэф.Размер = Строка.Размер;
		КонецЦикла;
		
		Для Каждого Строка из Основание.ПовышенияПоИнструкции Цикл
			НоваяСтрокаПовышенияПоИнструкции = ПовышенияПоИнструкции.Добавить();
			НоваяСтрокаПовышенияПоИнструкции.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
			НоваяСтрокаПовышенияПоИнструкции.Сотрудник = Основание;
			НоваяСтрокаПовышенияПоИнструкции.Коэффициент = Строка.Коэффициент;
			НоваяСтрокаПовышенияПоИнструкции.Размер = Строка.Размер;
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////
//толик добавил процедуры перерасчета для проведения с других модулей

Процедура ПерерасчетДокумента(ПересчитыватьКонтракт = Истина) Экспорт
	Для Каждого мСтрока Из РаботникиОрганизации Цикл
		ПерерасчетТарифнойСтавкиСДругихМодулей(мСтрока, ПересчитыватьКонтракт);
	КонецЦикла;
Конецпроцедуры

Процедура ПерерасчетТарифнойСтавкиСДругихМодулей(ТекущаяСтрока, ИзмененКонтракт = Ложь,НеСоздаватьОснНач = Ложь,НеМенятьПовышениеЕТСИнстр = Ложь) Экспорт
	
	//+ СВЭЙ КДЯ 26.02.20 СВФР-005566
	
	//Аверсон 11.02.2025 СВФР-014856
	//Если установлен флаг Не пересчитывать табличную часть, начисления все равно заполняем
	//Если НеПересчитыватьТЧ Тогда
	//	Возврат;
	//КонецЕсли;
	//Аверсон СВФР-014856
	
	//- СВЭЙ КДЯ 26.02.20 СВФР-005566
	
	СтрокаКоэф = КоэфПовышенияТО;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) Тогда
		Если ТекущаяСтрока.БезЕТС или (не ТекущаяСтрока.БезЕТС и Организация.НеУчитыватьЕТКС) Тогда //О.Т. Аверсон 04.11.2015 № 679
			Если не НеПересчитыватьТЧ Тогда
				
				//Аверсон ЕАЕ 28.02.2025 СВФР-014856
				УчетнаяПолитикаЗапрос = Новый Запрос; 
				УчетнаяПолитикаЗапрос.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения,
				|   УчетнаяПолитикаПоПерсоналуОрганизаций.ПроверкаШтатногоРасписания
				|ИЗ
				|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
				|ГДЕ
				|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
				УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
				УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
				если УчетнаяПолитика.Количество()>0 Тогда 
					ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					ФлПроверкаШтатногоРасписания = УчетнаяПолитика[0].ПроверкаШтатногоРасписания;
				иначе
					ФлОкладПоКаждомуВиду = Ложь;
					ФлПроверкаШтатногоРасписания = Ложь;
				КонецЕсли; 
				//Аверсон СВФР-014856
				
				//О.Т. Аверсон 04.11.2015 № 679
				ТекущаяСтрока.КоэффициентЕТС = 0;
				ТекущаяСтрока.РазрядЕТС = "";
				ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 0;
				ТекущаяСтрока.РазмерСтавки1Разряда = 0;
				ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда = Справочники.ТарифныеСтавкиПервогоРазряда.ПустаяСсылка();
				ТаблицаКоэфициентов = КоэфПовышенияТО;
				НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
					ТаблицаКоэфициентов.Удалить(СтрокаКоэффициентов);		
				КонецЦикла;
				//О.Т. Аверсон 04.11.2015 № 679
				
				//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
				
				//Аверсон ЕАЕ 11.02.2025 СВФР-014856
				//Тариф		  = Окр(ТекущаяСтрока.ТарифнаяСтавка * ТекущаяСтрока.ЗанимаемыхСтавок,2);//О.Т. Аверсон 09.02.2017 № 294
				Если ФлПроверкаШтатногоРасписания Тогда
					Если ИзменениеТарифнойСтавки и Организация.ИНН = "691159723" Тогда
						ПолучитьСтавкуДолжности(ТекущаяСтрока);
					КонецЕсли;
					//СВФР-016994
					//Если значениезаполнено(ТекущаяСтрока.ГрафикРаботы) и ТекущаяСтрока.ГрафикРаботы.НеполныйРабочийДень Тогда
					//	Тариф		  = ТекущаяСтрока.ТарифЗаОднуСтавку;   						
					//ИНаче
						Тариф		  = Окр(ТекущаяСтрока.ТарифЗаОднуСтавку * ТекущаяСтрока.ЗанимаемыхСтавок, 2);
					//КонецЕсли;//СВФР-016994
					Если КоэффициентИндексацииЗаработка <> 0 и Организация.ИНН = "691159723" Тогда
						Тариф = Окр(ТекущаяСтрока.ТарифнаяСтавка + ТекущаяСтрока.ТарифнаяСтавка* КоэффициентИндексацииЗаработка/100,2);
						Если Тариф - (ТекущаяСтрока.ТарифнаяСтавка + ТекущаяСтрока.ТарифнаяСтавка* КоэффициентИндексацииЗаработка/100) < 0 Тогда
							Тариф = Тариф + 0.01;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Тариф		  = Окр(ТекущаяСтрока.ТарифнаяСтавка * ТекущаяСтрока.ЗанимаемыхСтавок,2);//О.Т. Аверсон 09.02.2017 № 294
				КонецЕсли;
				//Аверсон СВФР-014856
				
				
				//+ СВЭЙ КДЯ 05.02.20 СВФР-005474
				//ТарифВВалюте  = ТекущаяСтрока.СуммаВВалюте * ТекущаяСтрока.ЗанимаемыхСтавок;//О.Т. Аверсон 13.04.2016 № 1041
				//- СВЭЙ КДЯ 05.02.20 СВФР-005474
				
				//+ СВЭЙ КДЯ 05.02.20 СВФР-005474
				ОкруглениеШтат = Константы.ОкруглениеШтатноеРасписание.Получить();
				ТарифВВалюте  = ОбщегоНазначения.ОкруглитьРезультат( ТекущаяСтрока.ОкладСПовышениемВВалюте, ОкруглениеШтат );
				//- СВЭЙ КДЯ 05.02.20 СВФР-005474
				
				//Аверсон ЕАЕ 11.02.2025 СВФР-014856
				//ТарифБезСтавки	= Окр(ТекущаяСтрока.ТарифнаяСтавка,2);//О.Т. Аверсон 16.05.2017 № 641
				Если ФлПроверкаШтатногоРасписания Тогда
					ТарифБезСтавки	= Окр(ТекущаяСтрока.ТарифЗаОднуСтавку, 2);
					Если КоэффициентИндексацииЗаработка <> 0 и Организация.ИНН = "691159723" Тогда
						ТарифБезСтавки = Окр(ТекущаяСтрока.ТарифнаяСтавка + ТекущаяСтрока.ТарифнаяСтавка* КоэффициентИндексацииЗаработка/100,2);
						Если ТарифБезСтавки - (ТекущаяСтрока.ТарифнаяСтавка + ТекущаяСтрока.ТарифнаяСтавка* КоэффициентИндексацииЗаработка/100) < 0 Тогда
							ТарифБезСтавки = ТарифБезСтавки + 0.01;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ТарифБезСтавки	= Окр(ТекущаяСтрока.ТарифнаяСтавка,2);
				КонецЕсли;
				//Аверсон СВФР-014856
				
				
				ТекущаяСтрока.ТарифнаяСтавка = Тариф;
				ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
				//О.Т. Аверсон 14.04.2016 № 1041
				Если не ЗначениеЗаполнено(ТекущаяСтрока.ОкладСПовышениемВВалюте) Тогда 
					ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
				КонецЕсли;
				//О.Т. Аверсон 14.04.2016 № 1041
				ТаблицаПроцентов = ПовышенияПоИнструкции;
				НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
				если не НеМенятьПовышениеЕТСИнстр Тогда
					ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
				КонецЕсли;
				
				//расчет до 01.09.2009
				Если ТекущаяСтрока.ДатаНачала < '20090901000000' Тогда
					если не НеМенятьПовышениеЕТСИнстр Тогда
						мПослеПовышения = 0;
						мДоПовышения = 0;
						ТарифПоИнструкции = 0;
						Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
							Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
								Если СтрокаПроцентов.Коэффициент.Последующий Тогда
									мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
								Иначе
									мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
								КонецЕсли;
								ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					//О.Т. Аверсон 22.09.2016 № 1459
					
					//Аверсон ЕАЕ 11.02.2025 СВФР-014856
					//Перенесено выше
					//УчетнаяПолитикаЗапрос = Новый Запрос; 
					//УчетнаяПолитикаЗапрос.Текст = 
					//"ВЫБРАТЬ
					//|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
					//|ИЗ
					//|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
					//|ГДЕ
					//|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
					//УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
					//УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
					//если УчетнаяПолитика.Количество()>0 Тогда 
					//	ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					//иначе
					//	ФлОкладПоКаждомуВиду = Ложь;
					//КонецЕсли; 
					//Аверсон СВФР-014856
					
					//О.Т. Аверсон 22.09.2016 № 1459
					//СВФР-016994 09.10.25
					//Если значениезаполнено(ТекущаяСтрока.ГрафикРаботы) и ТекущаяСтрока.ГрафикРаботы.НеполныйРабочийДень Тогда
					//	ТарифПоИнструкции = ТарифБезСтавки + ТарифБезСтавки * мДоПовышения/100;
					//Иначе
						если НеМенятьПовышениеЕТСИнстр Тогда
							ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
						ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
						ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
						КонецЕсли;
					//КонецЕсли;
					//СВФР-016994  09.10.25
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата);//О.Т. Аверсон 22.09.2016 № 1459
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
						//ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 06.06.2017 № 695  //тариф заменен на ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 06.06.2017 № 695
					иначе
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки *ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					Если ТекущаяСтрока.ОкладВВалюте Тогда //О.Т. Аверсон 13.04.2016 № 1041
						ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					
					
				Иначе
					если не НеМенятьПовышениеЕТСИнстр Тогда
						мПослеПовышения = 0;
						мДоПовышения = 0;
						ТарифПоИнструкции = 0;
						Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
							Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
								мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
								ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
								ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок*СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					//О.Т. Аверсон 22.09.2016 № 1459
					УчетнаяПолитикаЗапрос = Новый Запрос; 
					УчетнаяПолитикаЗапрос.Текст = 
					"ВЫБРАТЬ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
					|ИЗ
					|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
					|ГДЕ
					|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
					УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
					УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
					если УчетнаяПолитика.Количество()>0 Тогда 
						ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
					иначе
						ФлОкладПоКаждомуВиду = Ложь;
					КонецЕсли; 
					//О.Т. Аверсон 22.09.2016 № 1459
					если НеМенятьПовышениеЕТСИнстр Тогда
						ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
					ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
					ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
						ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
					КонецЕсли;
					ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифПоИнструкции,Дата); //О.Т. Аверсон 22.09.2016 № 1459
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 06.06.2017 № 695
						//ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции  * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 06.06.2017 № 695
					иначе
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки*ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
					Если КоэффициентИндексацииЗаработка <> 0 и Организация.ИНН = "691159723" Тогда
						ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТарифБезСтавки, ТарифБезСтавки + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки*ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки,Дата) ;
					КонецЕсли;
					Если ТекущаяСтрока.ОкладВВалюте Тогда //О.Т. Аверсон 13.04.2016 № 1041
						ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// основное начисление
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидРасчета) Тогда
				ТекущаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
			КонецЕсли;
			
			ВидРасчета = ТекущаяСтрока.ВидРасчета;
			
			РаботникСтрока = ТекущаяСтрока;
			если не НеСоздаватьОснНач Тогда 
				мНайдено = Ложь;
				СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
				Пока СписокВидовРасчета.Следующий() Цикл
					СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СписокВидовРасчета.ВидРасчета));
					Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
						мНайдено = Истина;
						Прервать
					КонецЕсли;
				КонецЦикла;
				
				Если Не мНайдено Тогда
					Строка = ОсновныеНачисления.Добавить();
					Строка.Сотрудник = РаботникСтрока.Сотрудник; 
				Иначе
					Строка = СтрокиОсновныхНачислений[0];	
				КонецЕсли;
				Строка.ВидРасчета = РаботникСтрока.ВидРасчета;
				//Определяем нужно ли выделять контракт
				мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
				
				Если РаботникСтрока.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
					ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
					Если ДнейВГоду.Размер <> 0 тогда
						Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 10.01.2017 № 129
						Строка.Показатель1ВВалюте  = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте / ?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
					КонецЕсли;
				ИначеЕсли ( РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке 
					ИЛИ РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок ) тогда
					
					Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
						Если ЧасовВГоду.Размер = 0 Тогда 
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
						КонецЕсли;
					иначе                  						
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
					КонецЕсли;
					
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
					//О.Т. 03.02.2015 № 17844
					Округление = Константы.ОкруглениеЧасовойТС.Получить();
					если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
						ЗначениеОкругления = 0;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
						ЗначениеОкругления = 1;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
						ЗначениеОкругления = 2;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
						ЗначениеОкругления = 3;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
						ЗначениеОкругления = 4;
					иначе
						ЗначениеОкругления = 0;
					КонецЕсли;
					//О.Т. 03.02.2015 № 17844
					
					Если ЧасовВГоду.Размер <> 0 тогда
						//временное перемещение
						Если РаботникСтрока.Временно Тогда
							мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
							Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
							Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
							//О.Т. 03.02.2015 № 17845
							если РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда 
								Строка.Показатель3 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 10.01.2017 № 129
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041, 129
							иначе
								Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
									Строка.Показатель3 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1); //О.Т. Аверсон 10.01.2017 № 129
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 17.03.2016 № 949 ,129
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 13.04.2016 № 1041
								КонецЕсли;
								
							КонецЕсли;
							//О.Т. 03.02.2015 № 17845
						Иначе
							//О.Т. 03.02.2015 № 17845
							если РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке Тогда 
								//О.Т. Аверсон 03.01.2018  Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
								Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 10.01.2017 № 129
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041,129
							иначе
								Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
									Строка.Показатель1 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1); //О.Т. Аверсон 10.01.2017 № 129
									Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), 1);//О.Т. Аверсон 13.04.2016 № 1041
								иначе
									Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 17.03.2016 № 949,129
									Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), Дата);//О.Т. Аверсон 13.04.2016 № 1041
								КонецЕсли;
							КонецЕсли;
							//О.Т. 03.02.2015 № 17845							
							Строка.Показатель3 = 0;
						КонецЕсли;
						Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
					Иначе
						Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
					КонецЕсли;
					//О.Т. 06.04.2015 № 400
				ИначеЕсли РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам и Организация.ИНН = "500052918" тогда
					Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда  //О.Т. Аверсон 06.02.2018 № 1547
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
						Если ЧасовВГоду.Размер = 0 Тогда 
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
						КонецЕсли;
					иначе                  						
						ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
						Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
					КонецЕсли;
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					//О.Т. 03.02.2015 № 17844
					Округление = Константы.ОкруглениеЧасовойТС.Получить();
					если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
						ЗначениеОкругления = 0;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
						ЗначениеОкругления = 1;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
						ЗначениеОкругления = 2;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
						ЗначениеОкругления = 3;
					ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
						ЗначениеОкругления = 4;
					иначе
						ЗначениеОкругления = 0;
					КонецЕсли;
					//О.Т. 03.02.2015 № 17844
					
					Если ЧасовВГоду.Размер <> 0 тогда
						//временное перемещение
						Если РаботникСтрока.Временно Тогда
							мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
							Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
							Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
							//О.Т. 03.02.2015 № 17845
							Строка.Показатель3 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
							//О.Т. 03.02.2015 № 17845
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							//О.Т. 03.02.2015 № 17845 
							Строка.Показатель1 = Окр(Тариф / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
							//О.Т. 03.02.2015 № 17845			
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 13.04.2016 № 1041
							Строка.Показатель3 = 0;
						КонецЕсли;
						Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
					Иначе
						Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
					КонецЕсли;
					//О.Т. 06.04.2015 № 400
				Иначе
					Если мНеобходимоВыделятьКонтракт Тогда
						Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
						ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
					Иначе
						Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
						ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					КонецЕсли;
					Если РаботникСтрока.Временно Тогда
						мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
						Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
						Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
						Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
							Строка.Показатель3 = Окр(Тариф, 1);
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1); //О.Т. Аверсон 13.04.2016 № 1041
						иначе
							Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата);//О.Т. Аверсон 17.03.2016 № 949
							Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата);
						КонецЕсли;      						
						
					Иначе
						Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
							Строка.Показатель1 = Окр(Тариф, 1);
							Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1);//О.Т. Аверсон 13.04.2016 № 1041
						иначе
							Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф, Дата);//О.Т. Аверсон 17.03.2016 № 949
							Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте, Дата);//О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						Строка.Показатель3 = 0;
					КонецЕсли;
					Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
				КонецЕсли;
				Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
				
				//контракт толик
				Если мНеобходимоВыделятьКонтракт И (не ЗначениеЗаполнено(РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта)) Тогда
					Сообщить("Невозможно рассчитать контракт. Для способа расчета неопределен вид начисления контракт !");
					Возврат;
				КонецЕсли;
				ВидыКонтрактов = ПрочиеПроцедуры.СформироватьСписокНачисленийКонтракта();
				СписокВидовРасчета = Новый СписокЗначений;
				Пока ВидыКонтрактов.Следующий() Цикл
					СписокВидовРасчета.Добавить(ВидыКонтрактов.ВидРасчета);
					СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
					Для Каждого мСтрока Из СтрокиОсновныхНачислений Цикл
						Если мСтрока.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
							ИзмененКонтракт = Истина;
						КонецЕсли;
						ОсновныеНачисления.Удалить(мСтрока);
					КонецЦикла;
				КонецЦикла;
				Если мНеобходимоВыделятьКонтракт Тогда
					
					//Проверим предыдущий контракт
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
					|ИЗ
					|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
					|ГДЕ
					|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ВидРасчетаИзмерение)
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
					|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
					Запрос.УстановитьПараметр("Организация", Организация);                    
					Запрос.УстановитьПараметр("Сотрудник", РаботникСтрока.Сотрудник);
					Запрос.УстановитьПараметр("Период", РаботникСтрока.ДатаНачала - 86400);
					Запрос.УстановитьПараметр("ВидРасчетаИзмерение", СписокВидовРасчета);
					мВыборка = Запрос.Выполнить().Выгрузить();
					Если мВыборка.Количество() <> 0 Тогда
						мПлановыеНачисленияРаботниковОрганизаций = мВыборка[0];
						///////				
						Если РаботникСтрока.Временно Тогда
							Строка = ОсновныеНачисления.Добавить();
							Строка.Сотрудник = РаботникСтрока.Сотрудник; 
							Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
							Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
							Если ИзмененКонтракт Тогда
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
							Иначе
								Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
							КонецЕсли;
						Иначе
							Если мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта Тогда
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Если ИзмененКонтракт Тогда
									Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
								Иначе
									Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
								КонецЕсли;
							Иначе
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
								
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
							КонецЕсли;
						КонецЕсли;
					Иначе
						Строка = ОсновныеНачисления.Добавить();
						Строка.Сотрудник = РаботникСтрока.Сотрудник; 
						Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
						Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
						Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			//Аверсон 19.04.2021 КВВ СВФР-007412 ( убрано из двух мест этой ветки, перенесено в начало ветки
			//О.Т. Аверсон 22.09.2016 № 1459
			УчетнаяПолитикаЗапрос = Новый Запрос; 
			УчетнаяПолитикаЗапрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.ДолжностнойОкладПоКаждомуВидуПовышения
			|ИЗ
			|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
			|ГДЕ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
			УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",Организация);
			УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
			если УчетнаяПолитика.Количество()>0 Тогда 
				ФлОкладПоКаждомуВиду = УчетнаяПолитика[0].ДолжностнойОкладПоКаждомуВидуПовышения;
			иначе
				ФлОкладПоКаждомуВиду = Ложь;
			КонецЕсли; 
			//О.Т. Аверсон 22.09.2016 № 1459
			//Аверсон 19.04.2021 КВВ СВФР-007412 ) убрано из двух мест этой ветки, перенесено в начало ветки
			
			
			//Аверсон 19.04.2021 КВВ СВФР-007412 (
			ОкруглениеШтат = Константы.ОкруглениеШтатноеРасписание.Получить();  
			ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить(); 
			//Аверсон 19.04.2021 КВВ СВФР-007412 )
			
			//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда) Тогда
			//	ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда = ТекущаяСтрока.Категория.ТарифнаяСтавкаПервогоРазряда;
			ТекущаяСтрока.РазмерСтавки1Разряда = ПолучитьРазмерТарифнойСтавки(ТекущаяСтрока.ТарифнаяСтавкаПервогоРазряда, ТекущаяСтрока.ДатаНачала);
			//КонецЕсли;
			
			Если ТекущаяСтрока.РазмерСтавки1Разряда  <> 0 Тогда
				Если не НеПересчитыватьТЧ Тогда
					ТаблицаКоэфициентов = КоэфПовышенияТО;
					НайденыеСтроки = ТаблицаКоэфициентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник)); 
					ТекущаяСтрока.ПовышенныйКоэффициентЕТС = 1;
					
					Для Каждого СтрокаКоэффициентов из НайденыеСтроки Цикл
						Если СтрокаКоэффициентов.Действие <>  Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
							//Если Организация.ИНН = "100074549" Тогда //О.Т. Аверсон 15.01.2016 //О.Т. Аверсон 24.03.2016 № 984 (убрала условие)
							ТекущаяСтрока.ПовышенныйКоэффициентЕТС = ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер;	
							//иначе
							//	Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
							//		ТекущаяСтрока.ПовышенныйКоэффициентЕТС = Окр(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер,2);//О.Т. 07.05.2015 при переносе
							//	иначе
							//		ТекущаяСтрока.ПовышенныйКоэффициентЕТС = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*СтрокаКоэффициентов.Размер,Дата);//О.Т. 07.05.2015 при переносе//О.Т. Аверсон 17.03.2016 № 949
							//	КонецЕсли;
							//КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
					Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.РазрядЕТС) Тогда
						Если РольДоступна("ОТиЗ") Тогда
							ОбщегоНазначения.СообщитьОбОшибке("Не введен разряд ЕТС");
						КонецЕсли;
						ТекущаяСтрока.КоэффициентЕТС = 0;
					КонецЕсли;
					
					Если Организация.ИНН = "100074549" Тогда 
						Коэффициент = Окр(ТекущаяСтрока.ПовышенныйКоэффициентЕТС*ТекущаяСтрока.КоэффициентЕТС,2);
						КоэффициентДляТС = Окр(ТекущаяСтрока.КоэффициентЕТС,2); //О.Т. Аверсон 03.04.2017 № 475  
					иначе
						Коэффициент = ТекущаяСтрока.ПовышенныйКоэффициентЕТС*ТекущаяСтрока.КоэффициентЕТС;
						КоэффициентДляТС = ТекущаяСтрока.КоэффициентЕТС; //О.Т. Аверсон 03.04.2017 № 475  
					КонецЕсли;
					
					СтавкаПервого = ТекущаяСтрока.РазмерСтавки1Разряда;
					//заявка №1787 (база заявок Кристалла) Дмитрук О.Г.
					//Тариф		  = Коэффициент * СтавкаПервого;
					
					//О.Т. Аверсон 16.05.2017 № 641 Убрана проверка на ЗаполнениеТабелейСУчетомСтавки. Во всех случаях использовать Ставку
					Тариф		  = Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок;
					ТарифДляТС	  = КоэффициентДляТС * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок;//О.Т. Аверсон 03.04.2017 № 475
					ТарифВВалюте		  = ТекущаяСтрока.СуммаВВалюте * ТекущаяСтрока.ЗанимаемыхСтавок;//О.Т. Аверсон 13.04.2016 № 1041
					//заявка №1787 
					ТарифБезСтавки  = Окр(Коэффициент * СтавкаПервого,2);//О.Т. Аверсон 16.05.2017 № 641
					
					//Аверсон 19.04.2021 КВВ СВФР-007412 (
					ТарифДробныхСтавок = 0;
					Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
						ТарифДробныхСтавок  = ОбщегоНазначения.ОкруглитьИнтегрированно(Коэффициент * СтавкаПервого * ТекущаяСтрока.ЗанимаемыхСтавок, ОкруглениеШтат, ВалютаРегл, Дата);
					КонецЕсли;
					//Аверсон 19.04.2021 КВВ СВФР-007412 )
					
					ТекущаяСтрока.ТарифнаяСтавка = ТарифДляТС;
					ТекущаяСтрока.СуммаВВалюте = ТарифВВалюте;//О.Т. Аверсон 13.04.2016 № 1041
					//О.Т. Аверсон 14.04.2016 № 1041
					Если не ЗначениеЗаполнено(ТекущаяСтрока.ОкладСПовышениемВВалюте) Тогда 
						ТекущаяСтрока.ОкладСПовышениемВВалюте = ТекущаяСтрока.СуммаВВалюте;
					КонецЕсли;
					//О.Т. Аверсон 14.04.2016 № 1041
					ТаблицаПроцентов = ПовышенияПоИнструкции;
					НайденыеСтроки = ТаблицаПроцентов.НайтиСтроки(Новый Структура("Сотрудник",ТекущаяСтрока.Сотрудник));
					если не НеМенятьПовышениеЕТСИнстр Тогда
						ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции =0;
					КонецЕсли;
					//расчет до 01.09.2009
					Если ТекущаяСтрока.ДатаНачала < '20090901000000' Тогда
						если не НеМенятьПовышениеЕТСИнстр Тогда
							мПослеПовышения = 0;
							мДоПовышения = 0;
							ТарифПоИнструкции = 0;
							Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
								Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
									Если СтрокаПроцентов.Коэффициент.Последующий Тогда
										мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
									Иначе
										мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
									КонецЕсли;
									ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
									ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
												
						если НеМенятьПовышениеЕТСИнстр Тогда
							ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
						ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
						ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
						КонецЕсли;
						
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции,Дата);//О.Т. Аверсон 22.09.2016 № 1459
						Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 06.06.2017 № 695
						иначе
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки*ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
						Если ТекущаяСтрока.ОкладВВалюте Тогда //О.Т. Аверсон 13.04.2016 № 1041
							ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
					Иначе
						если не НеМенятьПовышениеЕТСИнстр Тогда
							мПослеПовышения = 0;
							мДоПовышения = 0;
							ТарифПоИнструкции = 0;
							Для Каждого СтрокаПроцентов из НайденыеСтроки Цикл
								Если СтрокаПроцентов.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить тогда	 
									//Если СтрокаПроцентов.Коэффициент.Последующий Тогда
									//	мПослеПовышения = мПослеПовышения + СтрокаПроцентов.Размер;
									//Иначе
									мДоПовышения = мДоПовышения + СтрокаПроцентов.Размер;
									//КонецЕсли;
									ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции  = ТекущаяСтрока.ИтоговоеПовышениеПоИнструкции + СтрокаПроцентов.Размер;
									
									//Аверсон 19.04.2021 КВВ СВФР-007412 (
									Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 И ФлОкладПоКаждомуВиду Тогда
										ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * СтрокаПроцентов.Размер/100, ОкруглениеШтат, ВалютаРегл, Дата);
									Иначе
										//Аверсон 19.04.2021 КВВ СВФР-007412 )
										ТарифПоИнструкции = ТарифПоИнструкции + ОбщегоНазначения.ОкруглитьЗначение2016(ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок*СтрокаПроцентов.Размер/100,Дата);//О.Т. Аверсон 22.09.2016 № 1459
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						если НеМенятьПовышениеЕТСИнстр Тогда
							ТарифПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции;
						ИначеЕсли не ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок *мДоПовышения/100;
						ИначеЕсли ФлОкладПоКаждомуВиду Тогда //О.Т. Аверсон 22.09.2016 № 1459
							//Аверсон 19.04.2021 КВВ СВФР-007412 (
							Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда
								ТарифПоИнструкции = ТарифДробныхСтавок + ТарифПоИнструкции;
							Иначе    
								//Аверсон 19.04.2021 КВВ СВФР-007412 )
								ТарифПоИнструкции = ТарифБезСтавки * ТекущаяСтрока.ЗанимаемыхСтавок + ТарифПоИнструкции;
							КонецЕсли;
						КонецЕсли;
						ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифПоИнструкции,Дата);
						//ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции*мПослеПовышения/100;
						Если ТекущаяСтрока.ЗанимаемыхСтавок < 1 Тогда 
							//Аверсон 29.03.2021 КВВ СВФР-007391 (
							Если Организация.ИНН = "806000046" Тогда
								ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, Окр(ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + (Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100),3)), Константы.ВалютаРегламентированногоУчета.Получить());
							Иначе
								//Аверсон 29.03.2021 КВВ СВФР-007391 )
								
								//Аверсон 19.04.2021 КВВ СВФР-007412 (
								Если ФлОкладПоКаждомуВиду Тогда
									ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции = ТарифПоИнструкции;
									ТекущаяСтрока.МесячнаяТарифнаяСтавка = ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции
									+ ОбщегоНазначения.ОкруглитьИнтегрированно(ТарифДробныхСтавок * ТекущаяСтрока.ПроцентПоКонтракту / 100,	ОкруглениеШтат, ВалютаРегл, Дата );
								Иначе
									//Аверсон 19.04.2021 КВВ СВФР-007412 )
									ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(Тариф * ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())), Константы.ВалютаРегламентированногоУчета.Получить());//О.Т. Аверсон 06.06.2017 № 695
								КонецЕсли;
							КонецЕсли;
						иначе
							ТекущаяСтрока.МесячнаяТарифнаяСтавка = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции, ТекущаяСтрока.ТарифныйСПовышениемПоИнструкции + ОбщегоНазначения.ОкруглитьПоВалюте(ТарифБезСтавки*ТекущаяСтрока.ПроцентПоКонтракту/100,Константы.ВалютаРегламентированногоУчета.Получить())* ТекущаяСтрока.ЗанимаемыхСтавок), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
						Если ТекущаяСтрока.ОкладВВалюте Тогда //О.Т. Аверсон 13.04.2016 № 1041
							ТекущаяСтрока.МесячнаяТарифнаяСтавкаВВалюте = ОбщегоНазначения.ОкруглитьПоВалюте(?(ТекущаяСтрока.ПроцентПоКонтракту = 0, ТекущаяСтрока.ОкладСПовышениемВВалюте, ТекущаяСтрока.ОкладСПовышениемВВалюте + (ТарифВВалюте*ТекущаяСтрока.ПроцентПоКонтракту/100)), Константы.ВалютаРегламентированногоУчета.Получить());
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				// основное начисление
				Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидРасчета) Тогда
					ТекущаяСтрока.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
				КонецЕсли;
				
				ВидРасчета = ТекущаяСтрока.ВидРасчета;
				
				РаботникСтрока = ТекущаяСтрока;
				
				Если ЗначениеЗаполнено(ТекущаяСтрока.РазрядЕТС) и не НеСоздаватьОснНач тогда
					мНайдено = Ложь;
					СписокВидовРасчета = ПрочиеПроцедуры.СформироватьСписокОсновныхНачислений();
					Пока СписокВидовРасчета.Следующий() Цикл
						СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, СписокВидовРасчета.ВидРасчета));
						Если СтрокиОсновныхНачислений.Количество() <> 0 Тогда
							мНайдено = Истина;
							Прервать
						КонецЕсли;
					КонецЦикла;
					
					Если Не мНайдено Тогда
						Строка = ОсновныеНачисления.Добавить();
						Строка.Сотрудник = РаботникСтрока.Сотрудник; 
					Иначе
						Строка = СтрокиОсновныхНачислений[0];	
					КонецЕсли;
					Строка.ВидРасчета = РаботникСтрока.ВидРасчета;
					//Определяем нужно ли выделять контракт
					мНеобходимоВыделятьКонтракт = ПрочиеПроцедуры.НеобходимоВыделятьКонтракт(Организация);
					
					Если РаботникСтрока.ВидРасчета.СпособРасчета  = Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке тогда
						ДнейВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Дата,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаДней));
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
						Если ДнейВГоду.Размер <> 0 тогда
							Строка.Показатель1	  = ОбщегоНазначения.ОкруглитьПоВалюте(Тариф / ЗанимаемыхСтавок /?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить());
							Строка.Показатель1ВВалюте	  = ОбщегоНазначения.ОкруглитьПоВалюте(ТарифВВалюте / ЗанимаемыхСтавок /?(ДнейВГоду.Размер=0,1,ДнейВГоду.Размер), Константы.ВалютаРегламентированногоУчета.Получить()); //О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							Сообщить("Невозможно рассчитать дневную ставку. Не определен параметр среднемесячного количества рабочих дней");
						КонецЕсли;
					ИначеЕсли ( РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке 
						ИЛИ РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок ) тогда
						
						Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
							Если ЧасовВГоду.Размер = 0 Тогда 
								ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
								Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
							КонецЕсли;
						иначе         							
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
						КонецЕсли;
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						ЗанимаемыхСтавок = РаботникСтрока.ЗанимаемыхСтавок;
						//О.Т. 03.02.2015 № 17844
						Округление = Константы.ОкруглениеЧасовойТС.Получить();
						если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
							ЗначениеОкругления = 0;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
							ЗначениеОкругления = 1;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
							ЗначениеОкругления = 2;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
							ЗначениеОкругления = 3;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
							ЗначениеОкругления = 4;
						иначе
							ЗначениеОкругления = 0;
						КонецЕсли;
						//О.Т. 03.02.2015 № 17844
						Если ЧасовВГоду.Размер <> 0 тогда
							//временное перемещение
							Если РаботникСтрока.Временно Тогда
								мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
								Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
								Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
								Строка.Показатель3 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 14.04.2016 № 1041
							Иначе
								Строка.Показатель1 = Окр(Тариф / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте / ЗанимаемыхСтавок /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 14.04.2016 № 1041
								Строка.Показатель3 = 0;
							КонецЕсли;
							Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
						Иначе
							Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
						КонецЕсли;
						//О.Т. 06.04.2015 № 400
					ИначеЕсли РаботникСтрока.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам и Организация.ИНН = "500052918" тогда
						Если ЗначениеЗаполнено(ТекущаяСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 06.02.2018 № 1547
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория,ГрафикРаботы",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),ТекущаяСтрока.ГрафикРаботы));
							Если ЧасовВГоду.Размер = 0 Тогда 
								ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
								Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));								
							КонецЕсли;
							
						иначе
							ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(Дата,
							Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
						КонецЕсли;
						
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						//О.Т. 03.02.2015 № 17844
						Округление = Константы.ОкруглениеЧасовойТС.Получить();
						если Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
							ЗначениеОкругления = 0;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
							ЗначениеОкругления = 1;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
							ЗначениеОкругления = 2;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
							ЗначениеОкругления = 3;
						ИначеЕсли Округление = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
							ЗначениеОкругления = 4;
						иначе
							ЗначениеОкругления = 0;
						КонецЕсли;
						//О.Т. 03.02.2015 № 17844
						Если ЧасовВГоду.Размер <> 0 тогда
							//временное перемещение
							Если РаботникСтрока.Временно Тогда
								мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
								Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
								Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
								Строка.Показатель3 = Окр(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);//О.Т. Аверсон 14.04.2016 № 1041
							Иначе
								Строка.Показатель1 = Окр(Тариф /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте /?(ЧасовВГоду.Размер=0,1,ЧасовВГоду.Размер), ЗначениеОкругления); //О.Т. Аверсон 14.04.2016 № 1041
								Строка.Показатель3 = 0;
							КонецЕсли;
							Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
						Иначе
							Сообщить("Невозможно рассчитать часовую ставку. Не определен параметр среднемесячного количества рабочих часов");
						КонецЕсли;
						//О.Т. 06.04.2015 № 400
					Иначе
						Если мНеобходимоВыделятьКонтракт Тогда
							Тариф = РаботникСтрока.ТарифныйСПовышениемПоИнструкции;
							ТарифВВалюте = РаботникСтрока.ОкладСПовышениемВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						Иначе
							Тариф = РаботникСтрока.МесячнаяТарифнаяСтавка;
							ТарифВВалюте = РаботникСтрока.МесячнаяТарифнаяСтавкаВВалюте; //О.Т. Аверсон 13.04.2016 № 1041
						КонецЕсли;
						Если РаботникСтрока.Временно Тогда
							мПлановыеНачисленияРаботниковОрганизаций = РегистрыСведений.ПлановыеНачисленияРаботниковОрганизаций.ПолучитьПоследнее(РаботникСтрока.ДатаНачала - 86400,
							Новый Структура("Организация,Сотрудник,ВидРасчетаИзмерение", Организация, РаботникСтрока.Сотрудник, Неопределено));
							Строка.Показатель1 = мПлановыеНачисленияРаботниковОрганизаций.Показатель1;
							Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
								Строка.Показатель3 = Окр(Тариф, 1);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1); //О.Т. Аверсон 14.04.2016 № 1041
							иначе
								Строка.Показатель3 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф , Дата);//О.Т. Аверсон 17.03.2016 № 949
								Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте , Дата);//О.Т. Аверсон 14.04.2016 № 1041
							КонецЕсли;
						Иначе
							Если Дата < Дата(2016,07,01) Тогда //О.Т. Аверсон 26.01.2016
								Строка.Показатель1 = Окр(Тариф, 1);
								Строка.Показатель1ВВалюте = Окр(ТарифВВалюте, 1); //О.Т. Аверсон 14.04.2016 № 1041
							иначе
								Строка.Показатель1 = ОбщегоНазначения.ОкруглитьЗначение2016(Тариф , Дата);//О.Т. Аверсон 17.03.2016 № 949
								Строка.Показатель1ВВалюте = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифВВалюте , Дата);//О.Т. Аверсон 14.04.2016 № 1041
							КонецЕсли;
							Строка.Показатель3 = 0;
						КонецЕсли;
						Строка.Показатель2 = РаботникСтрока.ПроцентПоКонтракту;
					КонецЕсли;
					Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
					
					//контракт толик
					Если мНеобходимоВыделятьКонтракт И (не ЗначениеЗаполнено(РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта)) Тогда
						Сообщить("Невозможно рассчитать контракт. Для способа расчета неопределен вид начисления контракт !");
						Возврат;
					КонецЕсли;
					ВидыКонтрактов = ПрочиеПроцедуры.СформироватьСписокНачисленийКонтракта();
					СписокВидовРасчета = Новый СписокЗначений;
					Пока ВидыКонтрактов.Следующий() Цикл
						СписокВидовРасчета.Добавить(ВидыКонтрактов.ВидРасчета);
						СтрокиОсновныхНачислений = ОсновныеНачисления.НайтиСтроки(Новый Структура ("Сотрудник,ВидРасчета", РаботникСтрока.Сотрудник, ВидыКонтрактов.ВидРасчета));
						Для Каждого мСтрока Из СтрокиОсновныхНачислений Цикл
							Если мСтрока.Действие = Перечисления.ВидыДействияСНачислением.Изменить Тогда
								ИзмененКонтракт = Истина;
							КонецЕсли;
							ОсновныеНачисления.Удалить(мСтрока);
						КонецЦикла;
					КонецЦикла;
					Если мНеобходимоВыделятьКонтракт Тогда
						
						//Проверим предыдущий контракт
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
						|ИЗ
						|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
						|ГДЕ
						|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ВидРасчетаИзмерение)
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
						|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
						Запрос.УстановитьПараметр("Организация", Организация);                    
						Запрос.УстановитьПараметр("Сотрудник", РаботникСтрока.Сотрудник);
						Запрос.УстановитьПараметр("Период", РаботникСтрока.ДатаНачала - 86400);
						Запрос.УстановитьПараметр("ВидРасчетаИзмерение", СписокВидовРасчета);
						мВыборка = Запрос.Выполнить().Выгрузить();
						Если мВыборка.Количество() <> 0 Тогда
							мПлановыеНачисленияРаботниковОрганизаций = мВыборка[0];
							///////				
							Если РаботникСтрока.Временно Тогда
								Строка = ОсновныеНачисления.Добавить();
								Строка.Сотрудник = РаботникСтрока.Сотрудник; 
								Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
								Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
								Если ИзмененКонтракт Тогда
									Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
								Иначе
									Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
								КонецЕсли;
							Иначе
								Если мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта Тогда
									Строка = ОсновныеНачисления.Добавить();
									Строка.Сотрудник = РаботникСтрока.Сотрудник; 
									Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
									Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
									Если ИзмененКонтракт Тогда
										Строка.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
									Иначе
										Строка.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
									КонецЕсли;
								Иначе
									Строка = ОсновныеНачисления.Добавить();
									Строка.Сотрудник = РаботникСтрока.Сотрудник; 
									Строка.ВидРасчета = мПлановыеНачисленияРаботниковОрганизаций.ВидРасчета;
									Строка.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
									
									Строка = ОсновныеНачисления.Добавить();
									Строка.Сотрудник = РаботникСтрока.Сотрудник; 
									Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
									Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
									Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
								КонецЕсли;
							КонецЕсли;
						Иначе
							Строка = ОсновныеНачисления.Добавить();
							Строка.Сотрудник = РаботникСтрока.Сотрудник; 
							Строка.ВидРасчета = РаботникСтрока.ВидРасчета.СпособНачисленияКонтракта;
							Строка.Показатель1 = РаботникСтрока.ПроцентПоКонтракту;
							Строка.Действие = Перечисления.ВидыДействияСНачислением.Начать;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе	Сообщить("В строке "+Строка(ТекущаяСтрока.НомерСтроки)+" для сотрудника "+ТекущаяСтрока.Сотрудник.Наименование+" невозможно рассчитать месячный тариф по ЕТС. Не введен параметр Ставка 1 разряда по Организации");
			КонецЕсли;
		КонецЕсли;
		
	Иначе  Сообщить("В строке "+Строка(ТекущаяСтрока.НомерСтроки)+" для сотрудника "+ТекущаяСтрока.Сотрудник.Наименование+" невозможно рассчитать месячный тариф по ЕТС. Не введен параметр дата начала действия кадрового перемещения");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаНаПравильностьПоказателей()
	Для Каждого СтрокаТабличнойЧасти Из РаботникиОрганизации Цикл
		ДатаАктуальности = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаНачала), СтрокаТабличнойЧасти.ДатаНачала, Дата);
		
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.УстановитьПараметр("Сотрудник", СтрокаТабличнойЧасти.Сотрудник);
		ЗапросНачисления.УстановитьПараметр("Период",  ДатаАктуальности);
		ЗапросНачисления.УстановитьПараметр("Регистратор", Ссылка);
		
		ЗапросНачисления.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.НеИзменять) КАК Действие,
		|	Начисления.Сотрудник,
		|	Начисления.Сотрудник.Физлицо КАК Физлицо,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.ВидРасчетаЗавершения
		|		ИНАЧЕ Начисления.ВидРасчета
		|	КОНЕЦ КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель1Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель1
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель2Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель2
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель3Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель3
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель4Завершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель4
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд1Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд1
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд2Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд2
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд3Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд3
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА Начисления.ТарифныйРазряд4Завершения
		|					ИНАЧЕ НЕОПРЕДЕЛЕНО
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА Начисления.ТарифныйРазряд4
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	КОНЕЦ КАК ТарифныйРазряд4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта1Завершения
		|		ИНАЧЕ Начисления.Валюта1
		|	КОНЕЦ КАК Валюта1,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта2Завершения
		|		ИНАЧЕ Начисления.Валюта2
		|	КОНЕЦ КАК Валюта2,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта3Завершения
		|		ИНАЧЕ Начисления.Валюта3
		|	КОНЕЦ КАК Валюта3,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА Начисления.Валюта4Завершения
		|		ИНАЧЕ Начисления.Валюта4
		|	КОНЕЦ КАК Валюта4,
		|	ВЫБОР
		|		КОГДА Начисления.ПериодЗавершения <= &Период
		|				И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА Начисления.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
		|						ТОГДА НЕОПРЕДЕЛЕНО
		|					ИНАЧЕ Начисления.Показатель1ВВалютеЗавершения
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда
		|					ТОГДА НЕОПРЕДЕЛЕНО
		|				ИНАЧЕ Начисления.Показатель1ВВалюте
		|			КОНЕЦ
		|	КОНЕЦ КАК Показатель1ВВалюте
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			Сотрудник В (&Сотрудник)
		|				И ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций
		|				И Регистратор <> &Регистратор) КАК Начисления
		|ГДЕ
		|	ВЫБОР
		|			КОГДА Начисления.ПериодЗавершения <= &Период
		|					И Начисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА Начисления.ДействиеЗавершения
		|			ИНАЧЕ Начисления.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И Начисления.ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО";//О.Т. Аверсон 14.04.2016 № 1041
		
		Выборка = ЗапросНачисления.Выполнить().Выбрать();
		
		СтруктураПоиска = Новый Структура("Сотрудник, ВидРасчета");
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			МассивНачислений = ОсновныеНачисления.НайтиСтроки(СтруктураПоиска);
			Если МассивНачислений.Количество() <> 0 Тогда
				Если МассивНачислений[0].Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
					Если МассивНачислений[0].Показатель1 <> Выборка.Показатель1 ИЛИ МассивНачислений[0].Показатель2 <> Выборка.Показатель2 ИЛИ МассивНачислений[0].Показатель3 <> Выборка.Показатель3 ИЛИ МассивНачислений[0].Показатель4 <> Выборка.Показатель4 Тогда
						Сообщить("По сотруднику "+Строка(Выборка.Сотрудник)+"не соответствует начисление "+Строка(Выборка.ВидРасчета)+" введено "+ +Строка(МассивНачислений[0].Показатель1)+" "+Строка(МассивНачислений[0].Показатель2)+ " дейструет " +Строка(Выборка.Показатель1)+" "+Строка(Выборка.Показатель2));
					КонецЕсли;
				КонецЕсли;
			Иначе
				Сообщить("По сотруднику "+Строка(Выборка.Сотрудник)+"не введено но дейструет начисление "+Строка(Выборка.ВидРасчета)+" "+Строка(Выборка.Показатель1)+" "+Строка(Выборка.Показатель2));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьРазмерТарифнойСтавки(ТарифнаяСтавка, ДатаНачала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ДатаНачала);
	Запрос.УстановитьПараметр("ТарифнаяСтавка", ТарифнаяСтавка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТарифнаяСтавка = &ТарифнаяСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Размер;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Очистить();
	Движения.ЗанятыеШтатныеЕдиницыОрганизаций.Записать();
	Движения.КоэфПовышенияТО.Очистить();
	Движения.КоэфПовышенияТО.Записать();
	Движения.КоэффициентИндексацииЗаработка.Очистить();
	Движения.КоэффициентИндексацииЗаработка.Записать();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записать();
	Движения.ПовышенияПоИнструкции.Очистить();
	Движения.ПовышенияПоИнструкции.Записать();
	Движения.ТарифныеСтавкиРаботниковОрганизации.Очистить();
	Движения.ТарифныеСтавкиРаботниковОрганизации.Записать();
	
	//Определяем Есть ли документ со ссылкой этого дкумента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.Ссылка КАК Документ
	|ИЗ
	|	Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ИзменениеПериодическихРеквизитовРаботникиОрганизации
	|ГДЕ
	|	ИзменениеПериодическихРеквизитовРаботникиОрганизации.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Документ.Метаданные().Имя = "ИзменениеПериодическихРеквизитов" Тогда
			
			//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
			СотрудникОбъект = Выборка.Сотрудник.ПолучитьОбъект();
			
			мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(Выборка.ДатаНачала - 86400, Выборка.Сотрудник, 1,Организация);//О.Т. Аверсон 16.10.2017 № 1120
			
			Если Выборка.ТипРаботника <> мСтрока.ТипРаботника Тогда
				СотрудникОбъект.ТипРаботника = мСтрока.ТипРаботника;
				Если мСтрока.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
					СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
				Иначе
					СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
				КонецЕсли;	
				СотрудникОбъект.Записать();
			КонецЕсли;
			//заявка №1734
			
			мДокумент = Выборка.Документ.ПолучитьОбъект();
			НайденнаяСтрока = мДокумент.РаботникиОрганизации.Найти(ЭтотОбъект.Ссылка, "Документ");
			Если НайденнаяСтрока = Неопределено Тогда
				ОбщегоНазначения.СообщитьОбОшибке("не найден!");
			Иначе
				НайденнаяСтрока.ДругоеПеремещение = Ложь;
				НайденнаяСтрока.Документ = Null;
				Если мДокумент.Проведен Тогда
					мДокумент.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					мДокумент.Записать();
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	//заявка №1734 (база заявок Кристалла) Дмитрук О.Г.
	Для Каждого ТекСтрока из РаботникиОрганизации Цикл
		СотрудникОбъект = ТекСтрока.Сотрудник.ПолучитьОбъект();
		мСтрока = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике(ТекСтрока.ДатаНачала - 86400, ТекСтрока.Сотрудник, 1,Организация);//О.Т. Аверсон 16.10.2017 № 1120		
		Если ТекСтрока.ТипРаботника <> мСтрока.ТипРаботника Тогда
			СотрудникОбъект.ТипРаботника = мСтрока.ТипРаботника;
			Если мСтрока.ТипРаботника = Перечисления.ТипыРаботников.Постоянный Тогда
				СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
			Иначе
				СотрудникОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
			КонецЕсли;	
			СотрудникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	//заявка №1734
	
КонецПроцедуры

///енд толик
Процедура ПОлучитьСтавкуДолжности(Строка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ОкладНа1Ставку,
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка,
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидТарифнойСтавки,
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета,
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
	|ГДЕ
	|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность = &Должность
	|	И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Период = &Период
	|	И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета = &ВидРасчета
	|	И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту = &ПроцентПоКонтракту";
	Запрос.УстановитьПараметр("Должность", Строка.Должность);                    
	Запрос.УстановитьПараметр("Период", Строка.ДатаНачала);
	Запрос.УстановитьПараметр("ВидРасчета", Строка.Видрасчета);                    
	Запрос.УстановитьПараметр("ПроцентПоКонтракту", Строка.ПроцентПоКонтракту);
	мВыборка = Запрос.Выполнить().Выгрузить();
	Если мВыборка.Количество() = 0 Тогда
		Сообщить("Не найдена должность" + СокрЛП(Строка.Должность)+ " на дату " + Строка.ДатаНачала+ " с видом расчета " + СокрЛП(Строка.Видрасчета));
	Иначе
		Строка.ТарифЗаОднуСтавку = мВыборка[0].ОкладНа1Ставку;
	КонецЕсли;
	
КонецПроцедуры

//Аверсон ЕАЕ 17.12.2024 СВФР-014218
//Гродно
Функция ЕстьЗаписьРСРаботникиОрганизаций(ДатаПроверки, СтруктураИзмерения)
	Есть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Организация,
		|	РаботникиОрганизаций.ТипРаботникаУдалить,
		|	РаботникиОрганизаций.УдалитьСотрудникЗаменяемый
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Период = &Период
		|	И РаботникиОрганизаций.Сотрудник = &Сотрудник
		|	И РаботникиОрганизаций.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", СтруктураИзмерения.Организация);
	Запрос.УстановитьПараметр("Период", ДатаПроверки);
	Запрос.УстановитьПараметр("Сотрудник", СтруктураИзмерения.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Есть = Истина;
	КонецЕсли;
	
	Возврат Есть;
КонецФункции

Функция ПолучитьДатыНачалаРС()  
	Если Организация.КадровоеДвижениеВСекундах Тогда
		ТЗ = РаботникиОрганизации.Выгрузить(,"Сотрудник,ДатаНачала");
		ТЗ.Колонки.Добавить("ДатаНачалаРС", Новый ОписаниеТипов("Дата",, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
		
		Для Каждого Стр Из ТЗ Цикл
			ДатаПроверки = Стр.ДатаНачала;
			
			СтруктураИзмерения = Новый Структура;
			СтруктураИзмерения.Вставить("Сотрудник", Стр.Сотрудник);
			СтруктураИзмерения.Вставить("Организация", Организация);
			
			Пока ЕстьЗаписьРСРаботникиОрганизаций(ДатаПроверки, СтруктураИзмерения) Цикл
				ДатаПроверки = ДатаПроверки + 1;	
			КонецЦикла;
			Стр.ДатаНачалаРС = ДатаПроверки;
		КонецЦикла;
	Иначе
		ТЗ = Неопределено;	
	КонецЕсли;
	
	Возврат ТЗ;
КонецФункции
//Аверсон СВФР-014218

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;

