Перем СписокСтандартныхПараметров Экспорт;

Функция ОткрытьWord(стПараметры, Видимость = Истина) Экспорт
	WordApp = стПараметры.WordApp;
	WordDoc = стПараметры.WordDoc;
	ПутьКФайлу = стПараметры.ПутьКФайлу;
	
	Попытка
		WordApp = Новый COMОбъект("Word.Application");
	Исключение
		Сообщить("Компонента WordApp не установлена на данном компьютере!", СтатусСообщения.Важное);
	КонецПопытки;
	
	
	Если Видимость Тогда
		WordApp.Visible = 1;
	Иначе
		WordApp.Visible = 0;
	КонецЕсли;
	
	Если Прав(ПутьКФайлу, 3) = "dot" Тогда
		WordDoc = WordApp.Documents.Add(ПутьКФайлу);
	ИначеЕсли Прав(ПутьКФайлу, 3) = "doc" Тогда
		WordDoc = WordApp.Documents.Open(ПутьКФайлу);
	Иначе
		Сообщить("не верное расшерение файла");
		Возврат Неопределено;
	КонецЕсли;
	
	стПараметры.WordApp = WordApp;
	стПараметры.WordDoc = WordDoc;
	
	Возврат WordApp;
	
КонецФункции        

Функция вИнициализацияМенеджеров() Экспорт
	Менеджеры = Новый Соответствие;
	
	ИмяТипа = "Справочник";
	Для каждого ОбъектМД Из Метаданные.Справочники Цикл
		Имя = ОбъектМД.Имя;
		Менеджер = Справочники[Имя];
		ТипСсылкиСтрокой = "СправочникСсылка." + Имя;
		ТипСсылки = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ТипСсылки, ОбъектМД", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ТипСсылки, ОбъектМД);
		Менеджеры.Вставить(ОбъектМД, Структура);
	КонецЦикла;
	
	ИмяТипа = "Документ";
	Для каждого ОбъектМД Из Метаданные.Документы Цикл
		Имя = ОбъектМД.Имя;
		Менеджер = Документы[Имя];
		ТипСсылкиСтрокой = "ДокументСсылка." + Имя;
		ТипСсылки = Тип(ТипСсылкиСтрокой);
		Структура = Новый Структура("Имя,ИмяТипа,ТипСсылкиСтрокой,Менеджер,ТипСсылки, ОбъектМД", Имя, ИмяТипа, ТипСсылкиСтрокой, Менеджер, ТипСсылки, ОбъектМД);
		Менеджеры.Вставить(ОбъектМД, Структура);
	КонецЦикла;
	
	Возврат Менеджеры;
	
КонецФункции

Процедура ПечатьВорда(ПечатьСразу = Ложь, СохранитьКопиюНаДиске = Ложь,НомерСтрокиДока=0) Экспорт  //Аверсон 20.02.2020 КВВ СВФР-005452 (НомерСтрокиДока)
	
	Перем ПутиКДанным;
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	ОргСпр = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");  //Аверсон 06.11.2019 КВВ СВФР-005018
	ФИОСклон4 = "";	
	//Островская Татьяна 17.03.2014 № 17
	ЕстьСотрПриемИнстр = Ложь;
	Заполнено = Ложь;                                                     
	//Островская Татьяна 17.03.2014 № 17
	ПутиКДанным = ПолучитьПараметы();
	ПутиКДанным.Колонки.Добавить("ПроизвольныйАлгоритм");
	
	//ПутиКДанным = Параметры.Выгрузить(, "ИмяПараметра,ПроизвольныйАлгоритм");
	ПутиКДанным.Колонки.Добавить("ТабличнаяЧасть");
	ПутиКДанным.Колонки.Добавить("ТабличнаяЧастьИмя");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.НомерПриказаОбОкончанииОтпускаПл как НомерПриказаОбОкончанииОтпускаПл,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаПриказаОбОкончанииОтпускаПл как ДатаПриказаОбОкончанииОтпускаПл,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаНачала как ДатаНачала,
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ДатаОкончания как ДатаОкончания
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
	|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ЗНАЧЕНИЕ(ПланВидоврасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)
	|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник",ОбъектВладелец);
	РезЗапросОтпуск = Запрос.Выполнить().Выгрузить();
	
	ЗапросОтв = Новый Запрос;
	ЗапросОтв.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииОтветственныеЛица.Должность,
	|	ОрганизацииОтветственныеЛица.Сотрудник,
	|	ОрганизацииОтветственныеЛица.Ссылка
	|ИЗ
	|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
	|ГДЕ
	|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)
	|	И ОрганизацииОтветственныеЛица.Ссылка = &Ссылка";
	//ЗапросОтв.УстановитьПараметр("Ссылка",ОбъектВладелец.Организация);
	ЗапросОтв.УстановитьПараметр("Ссылка",?(ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ФизическиеЛица"),ОргСпр,ОбъектВладелец.Организация)); //Аверсон 19.05.2023 КВВ СВФР-010849
	РезОтветственный = ЗапросОтв.Выполнить().Выгрузить();
	
	ЗапросПрием = Новый Запрос;
	ЗапросПрием.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Период,
	|	РаботникиОрганизацийСрезПоследних.Регистратор.Номер КАК НомерДок,
	|	РаботникиОрганизацийСрезПоследних.Регистратор.Дата КАК ДатаДок,
	|	ВложенныйЗапрос.Представление
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КонтактнаяИнформация.Представление КАК Представление,
	|			КонтактнаяИнформация.Объект КАК Объект
	|		ИЗ
	|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ГДЕ
	|			КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица)) КАК ВложенныйЗапрос //Островская Татьяна 27.05.2014 № 17
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ВложенныйЗапрос.Объект
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник
	|	И РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию";
	если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
		ЗапросПрием.УстановитьПараметр("Сотрудник",ОбъектВладелец.Сотрудник);	
	иначе		
		ЗапросПрием.УстановитьПараметр("Сотрудник",ОбъектВладелец);
	КонецЕсли;
	РезПрием = ЗапросПрием.Выполнить().Выгрузить();
	
	//Аверсон 19.05.2023 КВВ СВФР-010849 (
	Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ФизическиеЛица") И ОргСпр.ИНН = "100194961" Тогда
		З_Инфа = Новый Запрос;
		З_Инфа.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|ФЛ.Пол КАК Пол,
		|ФИОФизЛицСрезПоследних.Фамилия,
		|ФИОФизЛицСрезПоследних.Имя,
		|ФИОФизЛицСрезПоследних.Отчество,
		|ФЛ.ДатаРождения КАК ДатаРождения,
		|ФЛ.МестоРождения КАК МестоРождения,
		|ВЫБОР
		|КОГДА ЕСТЬNULL(ГражданствоФизЛицСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.БЕЛАРУСЬ)
		|ТОГДА ""Республика Беларусь""
		|КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяССылка)
		|ТОГДА ""Республика Беларусь""
		|КОГДА ГражданствоФизЛицСрезПоследних.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ЛицоБезГражданства)
		|ТОГДА ""Лицо без гражданства""
		|ИНАЧЕ ""Иностранный гражданин""
		|КОНЕЦ КАК Гражданство,
		|СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение КАК СемейноеПоложение,
		|ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан1 КАК ДокументКемВыдан,
		|ЕСТЬNULL(ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДокументДатаВыдачи,
		|ПаспортныеДанныеФизЛицСрезПоследних.ЛичныйНомер КАК ДокументЛичныйНомер,
		|ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
		|ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|КонтактнаяИнформацияАдрес.Представление КАК АдресПроживания,
		|КонтактнаяИнформацияТелефонДом.Представление КАК ТелефонДомашний,
		|ФЛ.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|ВоинскийУчетСрезПоследних.ГруппаВоинскогоУчета,
		|ВоинскийУчетСрезПоследних.КатегорияЗапаса КАК КатегорияВоинскогоУчета,
		|ВоинскийУчетСрезПоследних.Состав,
		|ВоинскийУчетСрезПоследних.Период,
		|ВоинскийУчетСрезПоследних.Звание,
		|ВоинскийУчетСрезПоследних.ВУС1 как ВУС,
		|ВоинскийУчетСрезПоследних.Годность,
		|ВоинскийУчетСрезПоследних.Военкомат,
		|ВоинскийУчетСрезПоследних.СпецУчет,
		|УченыеСтепениЗванияСрезПоследних.УченаяСтепень,
		|УченыеСтепениЗванияСрезПоследних.УченоеЗвание,
		|КонтактнаяИнформацияТелефонМоб.Представление КАК ТелефонМобильный,
		|КонтактнаяИнформацияТелефонРаб.Представление КАК ТелефонРаб,
		|КонтактнаяИнформацияАдресПрописка.Представление КАК АдресПрописки,
		|ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК Документ
		|ИЗ
		|Справочник.ФизическиеЛица КАК ФЛ
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|ПО (ИСТИНА)
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
		|ПО (ИСТИНА)
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УченыеСтепениЗвания КАК УченыеСтепениЗванияСрезПоследних
		|ПО ФЛ.Ссылка = УченыеСтепениЗванияСрезПоследних.ФизЛицо
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
		|ПО (ИСТИНА)
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК СемейноеПоложениеФизЛицСрезПоследних
		|ПО (ИСТИНА)
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
		|ПО ФЛ.Ссылка = КонтактнаяИнформацияАдрес.Объект
		|И (КонтактнаяИнформацияАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|И (КонтактнаяИнформацияАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонДом
		|ПО ФЛ.Ссылка = КонтактнаяИнформацияТелефонДом.Объект
		|И (КонтактнаяИнформацияТелефонДом.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|И (КонтактнаяИнформацияТелефонДом.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.КонтактнТелефонКандидата))
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(&ДатаАктуальности, Физлицо = &ФизЛицо) КАК ВоинскийУчетСрезПоследних
		|ПО (ИСТИНА)
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонМоб
		|ПО (КонтактнаяИнформацияТелефонМоб.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|И (КонтактнаяИнформацияТелефонМоб.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица))
		|И ФЛ.Ссылка = КонтактнаяИнформацияТелефонМоб.Объект
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефонРаб
		|ПО (КонтактнаяИнформацияТелефонРаб.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|И (КонтактнаяИнформацияТелефонРаб.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСлужебный))
		|И ФЛ.Ссылка = КонтактнаяИнформацияТелефонРаб.Объект
		
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресПрописка
		|ПО ФЛ.Ссылка = КонтактнаяИнформацияАдресПрописка.Объект
		|И (КонтактнаяИнформацияАдресПрописка.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|И (КонтактнаяИнформацияАдресПрописка.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
		|ГДЕ
		|ФЛ.Ссылка = &ФизЛицо";
		З_Инфа.УстановитьПараметр("ДатаАктуальности",НачалоДня(ТекущаяДата()));
		З_Инфа.УстановитьПараметр("ФизЛицо",ОбъектВладелец);
		РезЗ_Инфа = З_Инфа.Выполнить().Выгрузить();
		ТекСтрЗ = РезЗ_Инфа[0];
		
		СоставСемьиЖенаМуж = "";  СоставСемьиДети1 = ""; СоставСемьиДети2 = "";
		СоставСемьиДети3 = "";    СоставСемьиДети4 = ""; СоставСемьиДети5 = "";
		СчДетей = 0;
		ЗапросСоставСемьи = Новый Запрос;
		ЗапросСоставСемьи.Текст =
		"ВЫБРАТЬ
		|ФЛСоставСемьи.Имя,
		|ФЛСоставСемьи.СтепеньРодства,
		|ФЛСоставСемьи.ГодРождения
		|ИЗ Справочник.ФизическиеЛица.СоставСемьи КАК ФЛСоставСемьи
		|ГДЕ
		|ФЛСоставСемьи.Ссылка = &Физлицо";		
		ЗапросСоставСемьи.УстановитьПараметр("Физлицо",	ОбъектВладелец);
		ВыборкаСоставСемьи = ЗапросСоставСемьи.Выполнить().Выбрать();
		Пока ВыборкаСоставСемьи.Следующий() Цикл
			Если Найти(нрег(ВыборкаСоставСемьи.СтепеньРодства),"жена") > 0 ИЛИ Найти(нрег(ВыборкаСоставСемьи.СтепеньРодства),"муж") > 0 ИЛИ Найти(нрег(ВыборкаСоставСемьи.СтепеньРодства),"супруг") > 0 Тогда
				СоставСемьиЖенаМуж = СоставСемьиЖенаМуж + СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");		
			ИначеЕсли Найти(нрег(ВыборкаСоставСемьи.СтепеньРодства),"сын") > 0 ИЛИ Найти(нрег(ВыборкаСоставСемьи.СтепеньРодства),"дочь") > 0 Тогда
				СчДетей = СчДетей + 1;
				Если СчДетей = 1 Тогда
					СоставСемьиДети1 = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");
				ИначеЕсли СчДетей = 2 Тогда
					СоставСемьиДети2 = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");			
				ИначеЕсли СчДетей = 3 Тогда
					СоставСемьиДети3 = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");					
				ИначеЕсли СчДетей = 4 Тогда
					СоставСемьиДети4 = СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");
				Иначе					
					СоставСемьиДети5 = СоставСемьиДети5 + ?(ЗначениеЗаполнено(СоставСемьиДети5),"; ","") + СокрЛП(ВыборкаСоставСемьи.СтепеньРодства) + " - " + СокрЛП(ВыборкаСоставСемьи.Имя) + ", " + Формат(ВыборкаСоставСемьи.ГодРождения, "ДФ=dd.MM.yyyy");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		УрОбр = ""; УчОбр = ""; СпецОбр = ""; КвалОбр = "";
		
		З_Образование = Новый Запрос;
		З_Образование.Текст = "ВЫБРАТЬ
		|ФЛОбразование.УчебноеЗаведение,
		|ФЛОбразование.ВидОбразования,
		|ФЛОбразование.Специальность,
		|ФЛОбразование.Квалификация1 КАК Квалификация,
		|ФЛОбразование.ГодОкончания
		|ИЗ Справочник.ФизическиеЛица.Образование КАК ФЛОбразование
		|ГДЕ
		|ФЛОбразование.Ссылка = &Физлицо
		|И ФЛОбразование.ОсновноеОбразование = ИСТИНА";
		З_Образование.УстановитьПараметр("Физлицо", ОбъектВладелец);
		
		Выборка = З_Образование.Выполнить().Выбрать();
		Пока Выборка.следующий() Цикл
			УрОбр = УрОбр + ?(ЗначениеЗаполнено(УрОбр),"; ","") + СокрЛП(Выборка.ВидОбразования);
			СпецОбр = СпецОбр + ?(ЗначениеЗаполнено(СпецОбр),"; ","") + СокрЛП(Выборка.Специальность);
			КвалОбр = КвалОбр + ?(ЗначениеЗаполнено(КвалОбр),"; ","") + СокрЛП(Выборка.Квалификация);
			УчОбр = УчОбр + ?(ЗначениеЗаполнено(УчОбр),"; ","") + СокрЛП(Выборка.УчебноеЗаведение) + ?(ЗначениеЗаполнено(Выборка.ГодОкончания),", " + СтрЗаменить(СокрЛП(Выборка.ГодОкончания)," ","") + "г.","");
		КонецЦикла;
		
		Фамилия = ТекСтрЗ.Фамилия;
		Имя	= ТекСтрЗ.Имя;
		Отчество = ТекСтрЗ.Отчество;
		ДатаРож = Формат(ТекСтрЗ.ДатаРождения,"ДЛФ=Д");
		//МестоРождения = "";				
		МестоРождения = РегламентированнаяОтчетность.ПредставлениеМестаРождения(ОбъектВладелец.МестоРождения, ОбъектВладелец.МестоРожденияПроизвольныйФормат);
		МестоРождения = СтрЗаменить(МестоРождения, "Населенный пункт: ", "");
		МестоРождения = СтрЗаменить(МестоРождения, " страна:", "");
		//МестоРождения = ТекСтрЗ.МестоРождения;
		ЛичНом = СокрЛП(ТекСтрЗ.СтраховойНомерПФР);
		АдресПрописки = СокрЛП(ТекСтрЗ.АдресПрописки);
		АдресПроживания = СокрЛП(ТекСтрЗ.АдресПроживания);
		ТелДом = СокрЛП(ТекСтрЗ.ТелефонДомашний);
		ТелМоб = СокрЛП(ТекСтрЗ.ТелефонМобильный);
		ТелРаб = СокрЛП(ТекСтрЗ.ТелефонРаб);
		СемПол = СокрЛП(ТекСтрЗ.СемейноеПоложение);  
		
		ВУГр = СокрЛП(ТекСтрЗ.ГруппаВоинскогоУчета);
		ВУВЗ = СокрЛП(ТекСтрЗ.Звание);
		ВУРЗ = "";
		ВУНом = ?(ЗначениеЗаполнено(ТекСтрЗ.ВУС),"№ ВУС" + СокрЛП(Лев(ТекСтрЗ.ВУС,3)) + " код " + СокрЛП(Сред(ТекСтрЗ.ВУС,4)),"");   
		ВУПроф = СокрЛП(ТекСтрЗ.Состав);
		ВУКат = СокрЛП(ТекСтрЗ.КатегорияВоинскогоУчета);
		ВУ1Дата = ?(ЗначениеЗаполнено(ТекСтрЗ.Период),Формат(ТекСтрЗ.Период,"ДЛФ=Д"),"");
		ВУ2Дата = "";
		ВУГод = СокрЛП(ТекСтрЗ.Годность);
		ВУСпецУ = СокрЛП(ТекСтрЗ.СпецУчет);
		
		З_Прием = Новый Запрос;
		З_Прием.Текст = "ВЫБРАТЬ  
		|Сотр.Ссылка КАК Сотрудник                                   
		|ПОМЕСТИТЬ ВтСотр
		|ИЗ Справочник.СотрудникиОрганизаций КАК Сотр
		|ГДЕ Сотр.ФизЛицо = &ФизЛицо
		|И ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
		|;
		|ВЫБРАТЬ
		|МАКСИМУМ(РаботникиОрганизацийСрезПоследних.Период) КАК ДатаПриема,
		|ВтСотр.Сотрудник
		|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследних
		|ЛЕВОЕ СОЕДИНЕНИЕ ВтСотр КАК ВтСотр
		|ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ВтСотр.Сотрудник 
		|ГДЕ
		|РаботникиОрганизацийСрезПоследних.Сотрудник = ВтСотр.Сотрудник
		|И РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию  
		|СГРУППИРОВАТЬ ПО 
		|ВтСотр.Сотрудник";  
		З_Прием.УстановитьПараметр("ФизЛицо",ОбъектВладелец);
		РезЗ_Прием = З_Прием.Выполнить().Выгрузить();
		ДатаПриема = РезЗ_Прием[0].ДатаПриема;   
		ОбъектВладелецСотр = РезЗ_Прием[0].Сотрудник;
		ЛК_Подр = СокрлП(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПриема,Новый Структура("Сотрудник",ОбъектВладелецСотр)).ПодразделениеОрганизации);
		ЛК_Долж = СокрлП(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПриема,Новый Структура("Сотрудник",ОбъектВладелецСотр)).Должность);
	
	КонецЕсли;
	//Аверсон 19.05.2023 КВВ СВФР-010849 )
	
	Для каждого ПутьКДанным Из ПутиКДанным Цикл
		ПутьКДанным.ТабличнаяЧасть = Ложь;
		ТабличныеЧасти = ОбъектВладелец.Метаданные().ТабличныеЧасти;
		Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
			ТабличнаяЧастьИмя = ТабличнаяЧасть.Имя;
			Если Не (Найти(ПутьКДанным.ПроизвольныйАлгоритм, "." + ТабличнаяЧастьИмя + ".") = 0) Тогда
				ПутьКДанным.ТабличнаяЧасть = Истина;
				ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
			иначе
				если ОбъектВладелец[ТабличнаяЧастьИмя].Количество() >0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		//Аверсон 19.05.2023 КВВ СВФР-010849 (
		Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ФизическиеЛица") И ОргСпр.ИНН = "100194961" Тогда
			Если ПутьКДанным.ИмяПараметра = "ЛК_Фам" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = Фамилия;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_Имя" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = Имя;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_Отч" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = Отчество;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ДатаРож" Тогда 				
				ПутьКДанным.ПроизвольныйАлгоритм = ДатаРож;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_МестоРож" Тогда 				
				ПутьКДанным.ПроизвольныйАлгоритм = МестоРождения;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ЛичНом" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ЛичНом;		
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_МЖ" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = АдресПрописки;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_МП" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = АдресПроживания;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ТелДом" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ТелДом;	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ТелМоб" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ТелМоб;	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ТелРаб" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ТелРаб;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_СемПол" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СемПол;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ЖенаМуж" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиЖенаМуж;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_1Дети" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиДети1;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_2Дети" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиДети2;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_3Дети" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиДети3;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_4Дети" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиДети4;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_5Дети" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СоставСемьиДети5;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_УрОбр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = УрОбр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_УчОбр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = УчОбр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_СпецОбр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СпецОбр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_КвалОбр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = КвалОбр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУГр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУГр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУВЗ" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУВЗ;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУРЗ" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУРЗ;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУНом" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУНом;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУПроф" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУПроф;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУКат" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУКат;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУ1Дата" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУ1Дата;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУ2Дата" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУ2Дата;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУГод" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУГод;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ВУСпецУ" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ВУСпецУ;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_Подр" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ЛК_Подр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_Долж" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ЛК_Долж;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ОтветствФорм" Тогда 
				ТекПольз = СокрЛП(глЗначениеПеременной("глТекущийПользователь"));
				ПутьКДанным.ПроизвольныйАлгоритм = ТекПольз;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ЛК_ДатаФорм" Тогда 
				ТекДатаСМин = Формат(ТекущаяДата(),"ДЛФ=ДВ");
				ТекДатаСМин = Лев(ТекДатаСМин,СтрДлина(ТекДатаСМин)-3);
				ПутьКДанным.ПроизвольныйАлгоритм = ТекДатаСМин;
			КонецЕсли;
		Иначе
			//Аверсон 19.05.2023 КВВ СВФР-010849 )
			
			//Островская Татьяна 17.03.2014 № 17
			если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") тогда
				если не Заполнено Тогда 
					ТЧВладелецИнстр = Новый ТаблицаЗначений;
					ТЧВладелецИнстр.Колонки.Добавить("ИнструкторОбучения");
					
					для Каждого стрТЧ из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
						если ЗначениеЗаполнено(стрТЧ.ИнструкторОбучения) Тогда 
							СтрокаТЧВладелецИнстр = ТЧВладелецИнстр.Добавить();
							СтрокаТЧВладелецИнстр.ИнструкторОбучения = стрТЧ.ИнструкторОбучения;
						КонецЕсли;
						Заполнено = Истина;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			//Островская Татьяна 17.03.2014 № 17
			если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
				если ПутьКДанным.ИмяПараметра = "ДатыЗП" Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.ДниВыдачиЗП;
					//Островская Татьяна 22.05.2014 № 17371
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ПринимаетПеремещает" Тогда
					если ОбъектВладелец.Перемещение Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = "переводит";
					иначе
						ПутьКДанным.ПроизвольныйАлгоритм = "принимает";
					КонецЕсли;
					//Островская Татьяна 22.05.2014 № 17371	
				ИначеЕсли ПутьКДанным.ИмяПараметра = "Подразделение" Тогда
					ФразаСклоненная = "";
					ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.подразделениеОрганизации,5,ФразаСклоненная,,ложь);
					ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ПодразделениеИм" Тогда
					
					ФразаСклоненная = "";
					ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.подразделениеОрганизации.Наименование,1,ФразаСклоненная,,ложь);
					ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ПодразделениеРП" Тогда  				
					ФразаСклоненная = "";
					ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.подразделениеОрганизации,2,ФразаСклоненная,,ложь);
					ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;   				
				КонецЕсли;
			КонецЕсли;
			
			//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) (
			СтравитаДолж = ""; СтравитаФИО = "";
			СтравитаПодразделениеИменительный = "";  //Аверсон 12.10.2022 КВВ СВФР-009401 (пункт 2)
			Если ОргСпр.ИНН = "806000046" 
				И (ПутьКДанным.ИмяПараметра = "Рук1" ИЛИ ПутьКДанным.ИмяПараметра = "ДРуков" ИЛИ ПутьКДанным.ИмяПараметра = "СтравитаПодразделениеИменительный") Тогда //Аверсон 12.10.2022 КВВ СВФР-009401 (пункт 2)
				ЗапросПрием = Новый Запрос;
				ЗапросПрием.Текст = "ВЫБРАТЬ
				|МАКСИМУМ(РаботникиОрганизаций.Период) КАК ДатаПриема
				|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				|ГДЕ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
				|И РаботникиОрганизаций.Сотрудник = &Сотрудник";
				ЗапросПрием.УстановитьПараметр("Сотрудник",ОбъектВладелец);
				ТЗДатаПрр = ЗапросПрием.Выполнить().Выгрузить();
				Если ТЗДатаПрр.Количество() > 0 Тогда
					ДатаПрр = ТЗДатаПрр[0].ДатаПриема;				
					ЗапросОтв = Новый Запрос;
					ЗапросОтв.Текст = "ВЫБРАТЬ
					|ОрганизацииОтветственныеЛица.Должность,
					|ОрганизацииОтветственныеЛица.Сотрудник,
					|ОрганизацииОтветственныеЛица.Дата 
					|ИЗ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
					|ГДЕ ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)
					|И ОрганизацииОтветственныеЛица.Ссылка = &Ссылка
					|И ОрганизацииОтветственныеЛица.Дата <= &ДатаПриема
					|УПОРЯДОЧИТЬ ПО 
					|ОрганизацииОтветственныеЛица.Дата УБЫВ";
					ЗапросОтв.УстановитьПараметр("Ссылка",ОбъектВладелец.Организация);
					ЗапросОтв.УстановитьПараметр("ДатаПриема",ДатаПрр);
					ТЗЗапросОтв = ЗапросОтв.Выполнить().Выгрузить();
					Если ТЗЗапросОтв.Количество() > 0 Тогда
						СтравитаДолж = ТЗЗапросОтв[0].Должность.Наименование;
						СтравитаФИО = ТЗЗапросОтв[0].Сотрудник.Наименование;
						СтравитаПодразделениеИменительный = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Сотрудник",ТЗЗапросОтв[0].Сотрудник)).ПодразделениеОрганизации; //Аверсон 12.10.2022 КВВ СВФР-009401 (пункт 2)
					КонецЕсли;
				КонецЕсли;			
			КонецЕсли;
			//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) )
			
			если ПутьКДанным.ИмяПараметра = "ПолноеНаименованиеОрганизации" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.Организация.НаименованиеПолное;
				
				//Аверсон 12.10.2022 КВВ СВФР-009401 (пункт 2) (
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СтравитаПодразделениеИменительный" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(СтравитаПодразделениеИменительный);
				//Аверсон 12.10.2022 КВВ СВФР-009401 (пункт 2) )
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекДата" Тогда 
				ТекДата = Формат(ТекущаяДата(),"ДФ=""дд.ММ.гггг""");
				ПутьКДанным.ПроизвольныйАлгоритм = ТекДата;	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Сотрудник" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.Наименование;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрудникСокр" Тогда //О.Т. Аверсон 10.09.2018 № 2437
				ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.Наименование,3,ОбъектВладелец.Физлицо.Пол,,ложь);
				Сотр = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);   
				ПутьКДанным.ПроизвольныйАлгоритм = Сотр;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрудникСокрСтар"  //О.Т. Аверсон 10.09.2018 № 2437
				ИЛИ ПутьКДанным.ИмяПараметра = "СотрудникСокр2Стар" Тогда //Аверсон 26.07.2023 КВВ СВФР-011174
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФИОФизЛицСрезПоследних.Период,
				|	ФИОФизЛицСрезПоследних.Фамилия,
				|	ФИОФизЛицСрезПоследних.Имя,
				|	ФИОФизЛицСрезПоследних.Отчество
				|ИЗ
				|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
				|ГДЕ
				|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
				
				Запрос.УстановитьПараметр("ФизЛицо", ОбъектВладелец.Физлицо);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ФИО = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФИОФизЛицСрезПоследних.Период,
					|	ФИОФизЛицСрезПоследних.Фамилия,
					|	ФИОФизЛицСрезПоследних.Имя,
					|	ФИОФизЛицСрезПоследних.Отчество
					|ИЗ
					|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период, ) КАК ФИОФизЛицСрезПоследних
					|ГДЕ
					|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
					Запрос.УстановитьПараметр("Период",ВыборкаДетальныеЗаписи.Период-1);
					
					Запрос.УстановитьПараметр("ФизЛицо", ОбъектВладелец.Физлицо);
					
					РезультатЗапроса1 = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл 
						ФИО = ВыборкаДетальныеЗаписи1.Фамилия + " "+ ВыборкаДетальныеЗаписи1.Имя + " "+ВыборкаДетальныеЗаписи1.Отчество;
					КонецЦикла;
					
				КонецЦикла;
				
				
				ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ФИО,2,ОбъектВладелец.Физлицо.Пол,,ложь);
				Сотр = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);   
				ПутьКДанным.ПроизвольныйАлгоритм = Сотр;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СерияТК" Тогда //О.Т. Аверсон 10.09.2018 № 2437
				Серия = ОбъектВладелец.Физлицо.СерияТрудовойКнижки;   
				ПутьКДанным.ПроизвольныйАлгоритм = Серия;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерТК" Тогда //О.Т. Аверсон 10.09.2018 № 2437
				НомерТК = ОбъектВладелец.Физлицо.НомерТрудовойКнижки;   
				ПутьКДанным.ПроизвольныйАлгоритм = НомерТК;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрудникДательный" Тогда	
				ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.Наименование,3,ОбъектВладелец.Физлицо.Пол,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрудникРодительныйСтарое" Тогда	
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФИОФизЛицСрезПоследних.Период,
				|	ФИОФизЛицСрезПоследних.Фамилия,
				|	ФИОФизЛицСрезПоследних.Имя,
				|	ФИОФизЛицСрезПоследних.Отчество
				|ИЗ
				|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
				|ГДЕ
				|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
				
				Запрос.УстановитьПараметр("ФизЛицо", ОбъектВладелец.Физлицо);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ФИО = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ФИОФизЛицСрезПоследних.Период,
					|	ФИОФизЛицСрезПоследних.Фамилия,
					|	ФИОФизЛицСрезПоследних.Имя,
					|	ФИОФизЛицСрезПоследних.Отчество
					|ИЗ
					|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период, ) КАК ФИОФизЛицСрезПоследних
					|ГДЕ
					|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
					Запрос.УстановитьПараметр("Период",ВыборкаДетальныеЗаписи.Период-1);
					
					Запрос.УстановитьПараметр("ФизЛицо", ОбъектВладелец.Физлицо);
					
					РезультатЗапроса1 = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл 
						ФИО = ВыборкаДетальныеЗаписи1.Фамилия + " "+ ВыборкаДетальныеЗаписи1.Имя + " "+ВыборкаДетальныеЗаписи1.Отчество;
					КонецЦикла;
					
				КонецЦикла;
				
				ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ФИО,2,ОбъектВладелец.Физлицо.Пол,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрудникРодительный" Тогда	
				ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.Наименование,2,ОбъектВладелец.Физлицо.Пол,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаИзмененияФамилии" Тогда	
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ФИОФизЛицСрезПоследних.Период
				|ИЗ
				|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
				|ГДЕ
				|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
				
				Запрос.УстановитьПараметр("ФизЛицо", ОбъектВладелец.Физлицо);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Период = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Период = Формат(ВыборкаДетальныеЗаписи.Период,"ДЛФ=Д"); 
				КонецЦикла;
				
				ПутьКДанным.ПроизвольныйАлгоритм = Период;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Рук" Тогда	
				Руководитель = ВосстановитьЗначение("мСотрудникСотр");
				Если Руководитель = Неопределено Тогда 
					Руководитель = "";
				КонецЕсли;
				
				если не ЗначениеЗаполнено(Руководитель) Тогда 
					Руководитель = "";
				иначе
					Руководитель = Руководитель.Наименование;
				КонецЕсли;
				
				ИнициалыРуководитель = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Руководитель);
				
				ПутьКДанным.ПроизвольныйАлгоритм = ИнициалыРуководитель;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Рук1" Тогда	
				Руководитель = ВосстановитьЗначение("мСотрудникСотр");
				Если Руководитель = Неопределено Тогда 
					Руководитель = "";
				КонецЕсли;
				
				если не ЗначениеЗаполнено(Руководитель) Тогда 
					Руководитель = "";
					
					//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) (
					Если ОргСпр.ИНН = "806000046" Тогда
						Руководитель = СтравитаФИО; 					
					КонецЕсли;	
					//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) )
					
				иначе
					Руководитель = Руководитель.Наименование;
				КонецЕсли;
				
				ИнициалыРуководитель = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководитель);
				
				ПутьКДанным.ПроизвольныйАлгоритм = ИнициалыРуководитель;
				
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДРуков" Тогда
				
				ДолжностьРуководитель = ВосстановитьЗначение("мДолжностьСотр");
				Если ДолжностьРуководитель = Неопределено Тогда 
					ДолжностьРуководитель = "";
				КонецЕсли;
				
				если не ЗначениеЗаполнено(ДолжностьРуководитель) Тогда 
					ДолжностьРуководитель = "";
					
					//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) (
					Если ОргСпр.ИНН = "806000046" Тогда
						ДолжностьРуководитель = СтравитаДолж; 					
					КонецЕсли;	
					//Аверсон 01.08.2022 КВВ СВФР-009401 (пункт 2) )
					
				иначе
					ДолжностьРуководитель = ДолжностьРуководитель.Наименование;
				КонецЕсли;
				
				ДолжностьРуководитель = ВРег(Лев(ДолжностьРуководитель,1))+Прав(ДолжностьРуководитель,СтрДлина(ДолжностьРуководитель)-1);
				
				ПутьКДанным.ПроизвольныйАлгоритм = ДолжностьРуководитель;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ОтвПользФИО" Тогда
				С = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
				ФИОСклон = С;
				СотрП = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ФИОСклон);  			
				ПутьКДанным.ПроизвольныйАлгоритм = СотрП;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ОтвПольз" Тогда  
				С = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
				Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",С)).Должность;	
				ДолжностьРуководитель = СокрЛП(Должность);
				ПутьКДанным.ПроизвольныйАлгоритм = ДолжностьРуководитель;	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ПроцПоКонтр" и ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = ""+ОбъектВладелец.ПроцентПоКонтракту+"%.";
			ИначеЕсли ПутьКДанным.ИмяПараметра = "АдресСвойство" и ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗначенияСвойствОбъектов.Объект КАК Объект,
				|	ЗначенияСвойствОбъектов.Значение
				|ИЗ
				|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				|ГДЕ
				|	ЗначенияСвойствОбъектов.Объект = &Объект
				|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
				Запрос.УстановитьПараметр("Объект",ОбъектВладелец.Сотрудник);
				Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Рабочее место (Контракт)"));
				Результат = Запрос.Выполнить().Выбрать();
				Адрес = "";
				Пока Результат.Следующий() Цикл 
					Адрес = Результат.Значение;
				КонецЦикла;
				
				
				ПутьКДанным.ПроизвольныйАлгоритм = Строка(Адрес);
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Должность" Тогда 
				если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец.Сотрудник)).Должность;
				иначе
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).Должность;
				КонецЕсли;
				//ПутьКДанным.ПроизвольныйАлгоритм = "УправлениеОтчетами.Просклонять(глСклонение,Должность.Наименование,4,,,ложь)";
				ФразаСклоненная = "";
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,Должность,4,ФразаСклоненная,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				//О.Т. Аверсон 10.09.2018 № 2437
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностьРодительный" Тогда 
				если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец.Сотрудник)).Должность;
				иначе
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).Должность;
				КонецЕсли;
				//ПутьКДанным.ПроизвольныйАлгоритм = "УправлениеОтчетами.Просклонять(глСклонение,Должность.Наименование,4,,,ложь)";
				ФразаСклоненная = "";
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,Должность,2,ФразаСклоненная,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностьДательный" Тогда 
				если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец.Сотрудник)).Должность;
				иначе
					Должность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).Должность;
				КонецЕсли;
				//ПутьКДанным.ПроизвольныйАлгоритм = "УправлениеОтчетами.Просклонять(глСклонение,Должность.Наименование,4,,,ложь)";
				ФразаСклоненная = "";
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,Должность,3,ФразаСклоненная,,ложь);
				
				//Аверсон 06.11.2019 КВВ СВФР-005018 (
				Если ОргСпр.ИНН = "806000046"  Тогда 
					ФразаСклоненная = ВРЕГ(Лев(ФразаСклоненная,1)) + Сред(ФразаСклоненная,2);
				КонецЕсли;
				//Аверсон 06.11.2019 КВВ СВФР-005018 )  
				
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ПодразделениеРодительный" Тогда 
				если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
					ПодразделениеОрганизации = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец.Сотрудник)).ПодразделениеОрганизации;
				иначе
					ПодразделениеОрганизации = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).ПодразделениеОрганизации;
				КонецЕсли;
				//ПутьКДанным.ПроизвольныйАлгоритм = "УправлениеОтчетами.Просклонять(глСклонение,Должность.Наименование,4,,,ложь)";
				ФразаСклоненная = "";
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,ПодразделениеОрганизации,2,ФразаСклоненная,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				
				//Аверсон 10.07.2022 СВФР-009298 (пункт 1) (
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ПодразделениеИменительный" Тогда 
				если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
					ПодразделениеОрганизации = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец.Сотрудник)).ПодразделениеОрганизации;
				иначе
					ПодразделениеОрганизации = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).ПодразделениеОрганизации;
				КонецЕсли;
				ФразаСклоненная = "";
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.Просклонять(глСклонение,ПодразделениеОрганизации,1,ФразаСклоненная,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ВРЕГ(Лев(ФразаСклоненная,1)) + Сред(ФразаСклоненная,2);
				//Аверсон 10.07.2022 СВФР-009298 (пункт 1) )
				
				
				//О.Т. Аверсон 10.09.2018 № 2437
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностьБезСклонен" Тогда 
				ДолжностьСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).Должность;
				Попытка
					ФразаУдалитьЧисло = Число(Прав(ДолжностьСтрока.Наименование,7));
					ФразаУдалить = Прав(ДолжностьСтрока.Наименование,7);
				Исключение
					ФразаУдалить = "";
				КонецПопытки;
				ДолжностьСтрока = СтрЗаменить(ДолжностьСтрока,ФразаУдалить,"");
				ПутьКДанным.ПроизвольныйАлгоритм =ДолжностьСтрока;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ПодразделениеСклон" Тогда 
				ПодразделениеСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ТекущаяДата(),новый Структура("Сотрудник",ОбъектВладелец )).ПодразделениеОрганизации;
				ФразаСклоненнаяПодразделение = "";
				УправлениеОтчетами.Просклонять(глСклонение,ПодразделениеСтрока.Наименование,2,ФразаСклоненнаяПодразделение,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм =ФразаСклоненнаяПодразделение; 
			ИначеЕсли ПутьКДанным.ИмяПараметра = "День" Тогда    
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = День(РезЗапросОтпуск[0].ДатаПриказаОбОкончанииОтпускаПл);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Месяц" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда   
					ПутьКДанным.ПроизвольныйАлгоритм =  УправлениеОтчетами.CклонятьФИО(глСклонение,Формат(РезЗапросОтпуск[0].ДатаПриказаОбОкончанииОтпускаПл,"ДФ=""ММММ"""),4,,,ложь);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Год" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = Год(РезЗапросОтпуск[0].ДатаПриказаОбОкончанииОтпускаПл);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерПр" Тогда
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = Строка(РезЗапросОтпуск[0].НомерПриказаОбОкончанииОтпускаПл);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДеньНач" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = День(РезЗапросОтпуск[0].ДатаНачала);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "МесяцНач" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда   			
					ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.CклонятьФИО(глСклонение,Формат(РезЗапросОтпуск[0].ДатаНачала,"ДФ=""ММММ"""),4,,,ложь);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ГодНач" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = Год(РезЗапросОтпуск[0].ДатаНачала);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДеньКон" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = День(РезЗапросОтпуск[0].ДатаОкончания);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "МесяцКон" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм =УправлениеОтчетами.CклонятьФИО(глСклонение,Формат(РезЗапросОтпуск[0].ДатаОкончания,"ДФ=""ММММ"""),4,,,ложь);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ГодКон" Тогда 
				если РезЗапросОтпуск.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = Год(РезЗапросОтпуск[0].ДатаОкончания);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДеньТек" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = День(ТекущаяДата());
			ИначеЕсли ПутьКДанным.ИмяПараметра = "МесяцТек" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.CклонятьФИО(глСклонение,Формат(ТекущаяДата(),"ДФ=""ММММ"""),4,,,ложь);
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ГодТек" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = Год(ТекущаяДата());	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностьОтв" Тогда 
				если РезОтветственный.Количество()>0 Тогда 
					Попытка
						ФразаУдалитьЧисло = Число(Прав(РезОтветственный[0].Должность.Наименование,7));
						ФразаУдалить = Прав(РезОтветственный[0].Должность.Наименование,7);
					Исключение
						ФразаУдалить = "";
					КонецПопытки;
					
					ПутьКДанным.ПроизвольныйАлгоритм = СтрЗаменить(РезОтветственный[0].Должность.Наименование,ФразаУдалить,"");
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИООтв" Тогда 
				если РезОтветственный.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РезОтветственный[0].Сотрудник.Наименование);
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Организация" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.Организация.НаименованиеПолное;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ОрганизацияСклонение" Тогда 
				ФразаСклоненная = "";
				УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.Организация.НаименованиеПолное,6,ФразаСклоненная,,ложь);;
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрДатаПрием" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,Формат(РезПрием[0].Период,"ДФ=""дд.ММ.гггг"""),"");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрДатаУв" Тогда 
				ЗапросПрием.Текст = СтрЗаменить(ЗапросПрием.Текст,"Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию","Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций");
				РезПрием = ЗапросПрием.Выполнить().Выгрузить();
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,Формат(РезПрием[0].Период,"ДФ=""дд.ММ.гггг"""),"");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрДатаУвПров" Тогда 
				ЗапросПрием.Текст = СтрЗаменить(ЗапросПрием.Текст,"Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию","Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций");
				РезПрием = ЗапросПрием.Выполнить().Выгрузить();
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,Формат(РезПрием[0].Период,"ДФ=""дд.ММ.гггг"""),"настоящее время");	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрДатаРожд" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = Год(ОбъектВладелец.ФизЛицо.ДатаРождения);
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Адрес" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,РезПрием[0].Представление,"");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерДок" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,Строка(Число(РезПрием[0].НомерДок)),"");
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаДок" Тогда 
				ПутьКДанным.ПроизвольныйАлгоритм = ?(РезПрием.Количество()>0,Формат(РезПрием[0].ДатаДок,"ДФ=""дд.ММ.гггг"""),"");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Окончание" Тогда 
				если ОбъектВладелец.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = "";
				иначе
					ПутьКДанным.ПроизвольныйАлгоритм = "а";
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Окончание1" Тогда 
				если ОбъектВладелец.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = "ий";
				иначе
					ПутьКДанным.ПроизвольныйАлгоритм = "ая";
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДопСведения" Тогда
				//ЗапросОтпуска = Новый Запрос;
				//ЗапросОтпуска.Текст = 
				//"ВЫБРАТЬ
				//|	СостояниеРаботниковОрганизаций.Период,
				//|	СостояниеРаботниковОрганизаций.Состояние,
				//|	СостояниеРаботниковОрганизаций.СостояниеЗавершения,
				//|	РАЗНОСТЬДАТ(СостояниеРаботниковОрганизаций.Период, СостояниеРаботниковОрганизаций.ПериодЗавершения, ДЕНЬ) КАК КоличДней
				//|ИЗ
				//|	РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
				//|ГДЕ
				//|	СостояниеРаботниковОрганизаций.Сотрудник = &Сотрудник
				//|	И СостояниеРаботниковОрганизаций.Организация = &Организация
				//|	И (СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускПоУходуЗаРебенком
				//|			ИЛИ СостояниеРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ОтпускаОрганизаций)
				//|	И СостояниеРаботниковОрганизаций.Период >= &Период";
				//ЗапросОтпуска.УстановитьПараметр("Сотрудник",ОбъектВладелец); 
				//ЗапросОтпуска.УстановитьПараметр("Период",ТекущаяДата()); 
				//ЗапросОтпуска.УстановитьПараметр("Организация",?(РезОтветственный.Количество()>0,РезОтветственный[0].Ссылка,""));
				//РезОтпуска = ЗапросОтпуска.Выполнить().Выбрать();
				//ПутьКДанным.ПроизвольныйАлгоритм = "будет находиться в трудовом отпуске";
				//пока  РезОтпуска.Следующий() Цикл  
				//	Состояние = СтрЗаменить(РезОтпуска.Состояние,"В","в");
				//	если Число(Прав(РезОтпуска.КоличДней,1))=1 Тогда 
				//		ДниКаленд = Строка(РезОтпуска.КоличДней)+" календарный день";
				//	иначеесли Число(Прав(РезОтпуска.КоличДней,1))>1 и Число(Прав(РезОтпуска.КоличДней,1))<5 Тогда 
				//		ДниКаленд = Строка(РезОтпуска.КоличДней)+" календарных дня";
				//	иначе
				//		ДниКаленд = Строка(РезОтпуска.КоличДней)+" календарных дней";
				//	КонецЕсли;  
				//	ПутьКДанным.ПроизвольныйАлгоритм = ПутьКДанным.ПроизвольныйАлгоритм+Состояние+" "+ДниКаленд+" с "+Формат(РезОтпуска.Период,"ДФ=""дд.ММ.гггг""")+" ";
				//КонецЦикла;
				//ПутьКДанным.ПроизвольныйАлгоритм = ПутьКДанным.ПроизвольныйАлгоритм+"с сохранением рабочего места.";
				// Контракт 
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерКонтракта" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.НомерТД;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаКонтракта" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = формат(ОбъектВладелец.Дата,"ДЛФ=ДД");
				
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИОИП" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.CклонятьФИО(глСклонение,ПолучитьФИО(ОбъектВладелец.ФизЛицо),1,,,ложь);
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИОТП" Тогда
				ПолСотрудника = ОбъектВладелец.ФизЛицо.Пол;
				
				ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.CклонятьФИО(глСклонение,ПолучитьФИО(ОбъектВладелец.ФизЛицо),5,ПолСотрудника,,ложь);
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СрокКонтракта" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = ПолучитьРазностьВГодах(ОбъектВладелец.НачалоДоговора,ОбъектВладелец.ОкончаниеДоговора);	
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаНачала" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = формат(ОбъектВладелец.НачалоДоговора,"ДФ=дд.ММ.гггг");	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаОкончания" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = формат(ОбъектВладелец.ОкончаниеДоговора,"ДФ=дд.ММ.гггг");	
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СрокИспытания" Тогда
				если  ОбъектВладелец.ИспытательныйСрок =1 тогда 
					СловоМесяц = " месяц";
				ИначеЕсли ОбъектВладелец.ИспытательныйСрок >2 и ОбъектВладелец.ИспытательныйСрок< 5 Тогда 
					СловоМесяц = " месяца";
				иначе
					СловоМесяц = " месяцев";
				КонецЕсли;
				если ОбъектВладелец.ИспытательныйСрок > 0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = "Срок испытания "+Строка(ОбъектВладелец.ИспытательныйСрок)+СловоМесяц;	
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "УсловиеИспытания" Тогда
				если ОбъектВладелец.ИспытательныйСрок > 0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = "с предварительным испытанием";
				иначе
					ПутьКДанным.ПроизвольныйАлгоритм = "без испытания";
				КонецЕсли;
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностнойОклад" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.ТарифныйСПовышениемПоИнструкции;//О.Т. Аверсон 23.12.2015 № 782
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "Надбавки" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = нрег(ПолучитьНадбавкиПоКонтракту(ОбъектВладелец,,Истина,,Истина));
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДлитОтпуска" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.Отпуска.Итог("КоличествоДней");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ОсновнойОтпуск" Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ВидОтпуска", Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск);
				
				МассивОсновнОтпуск=  ОбъектВладелец.Отпуска.НайтиСтроки(ПараметрыОтбора);
				если МассивОсновнОтпуск.Количество()> 0 Тогда 
					ОсновнОтпуск = МассивОсновнОтпуск[0].КоличествоДней;
				КонецЕсли;
				
				ПутьКДанным.ПроизвольныйАлгоритм = ОсновнОтпуск;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ВредностьОтпуск" Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ВидОтпуска", Справочники.ВидыЕжегодныхОтпусков.ВредныеУсловия);
				
				МассивОсновнОтпуск=  ОбъектВладелец.Отпуска.НайтиСтроки(ПараметрыОтбора);
				ВредностьОтпуск = "";
				если МассивОсновнОтпуск.Количество()> 0 Тогда 
					ВредностьОтпуск = МассивОсновнОтпуск[0].КоличествоДней;
				КонецЕсли;
				
				ПутьКДанным.ПроизвольныйАлгоритм = ВредностьОтпуск;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НаименованиеВредностьОтпуск" Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ВидОтпуска", Справочники.ВидыЕжегодныхОтпусков.ВредныеУсловия);
				
				МассивОсновнОтпуск=  ОбъектВладелец.Отпуска.НайтиСтроки(ПараметрыОтбора);
				ВредностьОтпуск = "";
				если МассивОсновнОтпуск.Количество()> 0 Тогда 
					НаименованиеВредностьОтпуск = МассивОсновнОтпуск[0].ВидОтпуска.Наименование;
				КонецЕсли;
				
				ПутьКДанным.ПроизвольныйАлгоритм = НаименованиеВредностьОтпуск;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрактОтпуск" Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ВидОтпуска", Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт);
				
				МассивОсновнОтпуск=  ОбъектВладелец.Отпуска.НайтиСтроки(ПараметрыОтбора);
				ВредностьОтпуск = "";
				если МассивОсновнОтпуск.Количество()> 0 Тогда 
					КонтрактОтпуск = МассивОсновнОтпуск[0].КоличествоДней;
				КонецЕсли;
				
				ПутьКДанным.ПроизвольныйАлгоритм = КонтрактОтпуск;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НадбавкиЗастаж" Тогда
				первый = Истина;
				КоэффСтажпрошл = "";
				СтажЗапрос = Новый запрос;
				СтажЗапрос.Текст = 
				"ВЫБРАТЬ
				|	ШкалаКоэффициентовСтажа.СтажС КАК СтажС,
				|	ШкалаКоэффициентовСтажа.СтажПо,
				|	ШкалаКоэффициентовСтажа.Величина,
				|	ШкалаКоэффициентовСтажа.КоэффициентСтажа
				|ИЗ
				|	РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
				|
				|УПОРЯДОЧИТЬ ПО
				|	СтажС";
				резстаж = СтажЗапрос.Выполнить().Выбрать();
				ПутьКДанным.ПроизвольныйАлгоритм = "надбавка за непрерывный стаж работы на предприятии " ;
				пока резстаж.Следующий() Цикл 
					если резстаж.КоэффициентСтажа = КоэффСтажпрошл или первый Тогда
						//Островская Татьяна 22.05.2014 № 17371
						если не первый Тогда 
							ПутьКДанным.ПроизвольныйАлгоритм = ПутьКДанным.ПроизвольныйАлгоритм+", ";
						КонецЕсли;
						//Островская Татьяна 22.05.2014 № 17371
						ЕСЛИ не ЗначениеЗаполнено(резстаж.СтажС) и ЗначениеЗаполнено(резстаж.СтажПо) Тогда 
							ПутьКДанным.ПроизвольныйАлгоритм = Строка(ПутьКДанным.ПроизвольныйАлгоритм) + "при стаже работы до " +Строка(резстаж.СтажПо)+ ?(резстаж.СтажПо=1," года"," лет")+ " - "+
							Строка(резстаж.Величина)+"%";
						ИначеЕсли ЗначениеЗаполнено(резстаж.СтажС) и ЗначениеЗаполнено(резстаж.СтажПо) Тогда 
							ПутьКДанным.ПроизвольныйАлгоритм = Строка(ПутьКДанным.ПроизвольныйАлгоритм) + "при стаже работы от " +Строка(резстаж.СтажС)+ ?(резстаж.СтажС=1," года"," лет")+
							" до "+ Строка(резстаж.СтажПо)+ ?(резстаж.СтажПо=1," года"," лет")+" - "+Строка(резстаж.Величина)+"%";
						ИначеЕсли ЗначениеЗаполнено(резстаж.СтажС) и не ЗначениеЗаполнено(резстаж.СтажПо) Тогда 
							ПутьКДанным.ПроизвольныйАлгоритм = Строка(ПутьКДанным.ПроизвольныйАлгоритм) + "при стаже работы от " +Строка(резстаж.СтажС)+ ?(резстаж.СтажС=1," года"," лет")+
							" - "+Строка(резстаж.Величина)+"%";
						КонецЕсли;
						первый = Ложь;
						КоэффСтажпрошл = резстаж.КоэффициентСтажа;
					КонецЕсли;
					
				КонецЦикла;   
				//Островская Татьяна 22.05.2014 № 17371
				если резстаж.Количество()>0 Тогда  
					ПутьКДанным.ПроизвольныйАлгоритм = ПутьКДанным.ПроизвольныйАлгоритм+". "; 
				КонецЕсли;
				//Островская Татьяна 22.05.2014 № 17371
			ИначеЕсли ПутьКДанным.ИмяПараметра = "СерияПаспорта" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм =ПолучитьПаспортныеДанные1(ОбъектВладелец.Физлицо,"ДокументСерия");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерПаспорта" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм =ПолучитьПаспортныеДанные1(ОбъектВладелец.Физлицо,"ДокументНомер");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаВыдачи" Тогда
				ПутьКДанным.ПроизвольныйАлгоритм =Формат(ПолучитьПаспортныеДанные1(ОбъектВладелец.Физлицо,"ДокументДатаВыдачи"),"ДФ=dd.MM.yyyy");
			ИначеЕсли ПутьКДанным.ИмяПараметра = "КемВыдан" Тогда
				
				Значение =ПолучитьПаспортныеДанные1(ОбъектВладелец.Физлицо,"ДокументКемВыдан1");
				ФразаСклоненная="";
				УправлениеОтчетами.Просклонять(глСклонение,Значение.Наименование,5,ФразаСклоненная,,ложь);
				ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
				
				//Аверсон 26.07.2023 КВВ СВФР-011174 (
			ИначеЕсли ПутьКДанным.ИмяПараметра = "КемВыданНеСкл" Тогда
				Значение =ПолучитьПаспортныеДанные1(ОбъектВладелец.Физлицо,"ДокументКемВыдан1");
				ПутьКДанным.ПроизвольныйАлгоритм = Значение.Наименование;	
				//Аверсон 26.07.2023 КВВ СВФР-011174 )
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИОДиректор" или ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
				//Аверсон 11.02.2020 КВВ СВФР-005452 (
				Если ОргСпр.ИНН = "690662297" Тогда
					Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
						мСотрудникПр1 = ВосстановитьЗначение("мСотрудникПр");
						мДолжностьПр1 = СокрЛП(ВосстановитьЗначение("мДолжностьПр"));
						Если ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мДолжностьПр1),ВРЕГ(Лев(мДолжностьПр1,1))+Сред(мДолжностьПр1,2),"");
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мСотрудникПр1),ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(мСотрудникПр1.Наименование),"");
						КонецЕсли;
					ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
						мСотрудникПр1 = ВосстановитьЗначение("мСотрудникУв");
						мДолжностьПр1 = СокрЛП(ВосстановитьЗначение("мДолжностьУв"));
						Если ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мДолжностьПр1),ВРЕГ(Лев(мДолжностьПр1,1))+Сред(мДолжностьПр1,2),"");
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мСотрудникПр1),ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(мСотрудникПр1.Наименование),"");
						КонецЕсли;
					КонецЕсли;
				Иначе
					//Аверсон 11.02.2020 КВВ СВФР-005452 )
					ЗапросОтв = Новый Запрос;
					ЗапросОтв.Текст = 
					"ВЫБРАТЬ
					|	ОрганизацииОтветственныеЛица.Должность,
					|	ОрганизацииОтветственныеЛица.Сотрудник,
					|	ОрганизацииОтветственныеЛица.Ссылка
					|ИЗ
					|	Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
					|ГДЕ
					|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
					|	И ОрганизацииОтветственныеЛица.Ссылка = &Ссылка";
					ЗапросОтв.УстановитьПараметр("Ссылка",ОбъектВладелец.Организация);
					РезДиректор = ЗапросОтв.Выполнить().Выгрузить();
					если РезДиректор.Количество()>0 Тогда 
						если ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
							Попытка
								ФразаУдалитьЧисло = Число(Прав(РезДиректор[0].Должность.Наименование,7));
								ФразаУдалить = Прав(РезДиректор[0].Должность.Наименование,7);
							Исключение
								ФразаУдалить = "";
							КонецПопытки;
							
							ДолжностьПолная = СтрЗаменить(РезДиректор[0].Должность.Наименование,ФразаУдалить,"");
							ФразаСклоненная="";
							УправлениеОтчетами.Просклонять(глСклонение,ДолжностьПолная,2,ФразаСклоненная,,ложь);
							ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненная;
							если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") или
								ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
								ПутьКДанным.ПроизвольныйАлгоритм = ДолжностьПолная;
							КонецЕсли;
						иначе
							ПутьКДанным.ПроизвольныйАлгоритм = УправлениеОтчетами.CклонятьФИО(глСклонение,РезДиректор[0].Сотрудник.Наименование,2,,,ложь);
							если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") или
								ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций")Тогда
								ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РезДиректор[0].Сотрудник.Наименование);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИООтвДир" Тогда	
				если РезДиректор.Количество()>0 Тогда 
					ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РезДиректор[0].Сотрудник.Наименование);
				КонецЕсли;	
				
			ИначеЕсли ПутьКДанным.ИмяПараметра = "ДолжностьДир" Тогда 
				если РезОтветственный.Количество()>0 Тогда 
					Попытка
						ФразаУдалитьЧисло = Число(Прав(РезДиректор[0].Должность.Наименование,7));
						ФразаУдалить = Прав(РезДиректор[0].Должность.Наименование,7);
					Исключение
						ФразаУдалить = "";
					КонецПопытки;
					
					ПутьКДанным.ПроизвольныйАлгоритм = СтрЗаменить(РезДиректор[0].Должность.Наименование,ФразаУдалить,"");
				КонецЕсли;
			КонецЕсли;
			
			если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") или ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда 
				если ПутьКДанным.ИмяПараметра = "НомерПр" Тогда
					ПутьКДанным.ПроизвольныйАлгоритм = Строка(ОбъектВладелец.НомерД);
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаПр" Тогда
					ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""")+?(ОргСпр.ИНН = "690662297","","г"); //Аверсон 04.03.2020 КВВ СВФР-005600
				иначеесли ПутьКДанным.ИмяПараметра = "СотрПриемТД" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование);
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
				иначеесли ПутьКДанным.ИмяПараметра = "Год" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = СтрЗаменить(Год(ОбъектВладелец.Дата)," ","");
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
				иначеесли ПутьКДанным.ИмяПараметра = "СотрПриемИнстр" Тогда 
					//Островская Татьяна 17.03.2014 № 17
					если ТЧВладелецИнстр.Количество()> 0 Тогда 
						
						ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТЧВладелецИнстр[0].ИнструкторОбучения.Наименование);
						ЕстьСотрПриемИнстр = Истина;
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					//Островская Татьяна 17.03.2014 № 17
				КонецЕсли;
				//Аверсон 17.02.2020 КВВ СВФР-005452 (
			ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.КадровоеПеремещениеОрганизаций") Тогда
				Если ОргСпр.ИНН = "690662297" Тогда
					Если ПутьКДанным.ИмяПараметра = "ДатаПр" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерПр" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.НомерПриказа);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрКого" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ИнициалыФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);
						ПутьКДанным.ПроизвольныйАлгоритм = ИнициалыФИО;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрУволКого" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.ЗаменяемыйСотрудник.Наименование,2,ОбъектВладелец.ЗаменяемыйСотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрУвол2Кого" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.ЗаменяемыйСотрудник.Наименование,2,ОбъектВладелец.ЗаменяемыйСотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрФИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ВРЕГ(Лев(ФИОСклон,Найти(ФИОСклон," ")))) + Сред(ФИОСклон,Найти(ФИОСклон," "));
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрКогоФИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрКомуФИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,3,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
						
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрСтарДолж" ИЛИ ПутьКДанным.ИмяПараметра = "СотрСтар2Долж" Тогда	
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
						|	РаботникиОрганизацийСрезПоследних.Должность
						|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата,Регистратор <> &Регисстратор
						|	И Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних";
						Запрос.УстановитьПараметр("Дата", НачалоДня(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаНачала)-1);
						Запрос.УстановитьПараметр("Регисстратор", ОбъектВладелец.Ссылка);
						Запрос.УстановитьПараметр("Сотрудник", ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник);
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						ПодразделениеСт = "";
						ДолжностьСт = "";
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ПодразделениеСт = ВыборкаДетальныеЗаписи.ПодразделениеОрганизации;
							ДолжностьСт = ВыборкаДетальныеЗаписи.Должность;
						КонецЦикла;
						
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ДолжностьСт,2,ФразаСклоненнаяДолжность,,ложь);
						
						ФразаСклоненнаяПодр = "";
						УправлениеОтчетами.Просклонять(глСклонение,ПодразделениеСт,2,ФразаСклоненнаяПодр,,ложь);
						
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяДолжность + " " + ФразаСклоненнаяПодр;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрНовДолж" ИЛИ ПутьКДанным.ИмяПараметра = "Сотр1НовДолж" Тогда 
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,?(ПутьКДанным.ИмяПараметра = "Сотр1НовДолж",2,5),ФразаСклоненнаяДолжность,,ложь);
						
						ФразаСклоненнаяПодр = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,?(ПутьКДанным.ИмяПараметра = "Сотр1НовДолж",2,4),ФразаСклоненнаяПодр,,ложь);
						
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяДолжность + ?(ПутьКДанным.ИмяПараметра = "Сотр1НовДолж"," ",?(ЗначениеЗаполнено(СокрЛП(ФразаСклоненнаяПодр))," в ","")) + ФразаСклоненнаяПодр;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрНовДолж" ИЛИ ПутьКДанным.ИмяПараметра = "Сотр2НовДолж" Тогда 
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,2,ФразаСклоненнаяДолжность,,ложь);
						
						ФразаСклоненнаяПодр = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодр,,ложь);
						
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ФразаСклоненнаяДолжность + " " + ФразаСклоненнаяПодр);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Подр1Куда" ИЛИ ПутьКДанным.ИмяПараметра = "Подр2Куда" ИЛИ 
						ПутьКДанным.ИмяПараметра = "Подр3Куда" ИЛИ ПутьКДанным.ИмяПараметра = "Подр4Куда" ИЛИ ПутьКДанным.ИмяПараметра = "Подр5Куда" Тогда
						ФразаСклоненнаяПодр = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодр,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяПодр;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаПерем" ИЛИ ПутьКДанным.ИмяПараметра = "Дата1Перем" Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаНачала,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаПередачи" Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаНачала,"ДФ=""дд.ММ.гггг""") + " - " + Формат(КонецДня(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаНачала)+1,"ДФ=""дд.ММ.гггг""");
						
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИОДиректор" или ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
						мСотрудникОтп1 = ВосстановитьЗначение("мСотрудникКп");
						мДолжностьОтп1 = СокрЛП(ВосстановитьЗначение("мДолжностьКп"));
						Если ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мДолжностьОтп1),ВРЕГ(Лев(мДолжностьОтп1,1))+Сред(мДолжностьОтп1,2),"");
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мСотрудникОтп1),ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(мСотрудникОтп1.Наименование),"");
						КонецЕсли;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрПриемТД" Тогда   
						ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрПрием2ТД" Тогда   
						ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ОбъектВладелец.ЗаменяемыйСотрудник.Наименование);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ИзменениеПериодическихРеквизитов") Тогда
				Если ОргСпр.ИНН = "690662297" Тогда
					//Изменение ЗП (
					Если ПутьКДанным.ИмяПараметра = "НомерДог" Тогда  
						ТрудДок = ПолучитьТрудовойДоговорСотрудника(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник,ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ДатаНачала);
						ПечТрудДог = "";
						Если ЗначениеЗаполнено(ТрудДок) Тогда
							ПечТрудДог = СокрЛП(ТрудДок.НомерТД);
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ПечТрудДог;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаДог" Тогда
						ТрудДок = ПолучитьТрудовойДоговорСотрудника(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник,ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ДатаНачала);
						ПечТрудДог = "";
						Если ЗначениеЗаполнено(ТрудДок) Тогда
							ПечТрудДог =  Формат(ТрудДок.ДатаТД,"ДФ=""дд.ММ.гггг""");
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ПечТрудДог;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаПр" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаДов" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.Организация.ДатаДоверенности,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерДов" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.Организация.НомерДоверенности);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаДейсС" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ДатаНачала,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Кого1Долж" Тогда 
						ДолжностьРуководитель = ВосстановитьЗначение("мДолжностьИзмПР");
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ДолжностьРуководитель,2,ФразаСклоненнаяДолжность,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяДолжность;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Кого1ФИО" Тогда  
						ФИОРуководитель = ВосстановитьЗначение("мСотрудникИзмПР");
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ФИОРуководитель.Наименование,2,ФИОРуководитель.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Кого2Долж" Тогда 
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Должность,1,ФразаСклоненнаяДолжность,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяДолжность;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Кого2ФИО" Тогда
						//ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник.Наименование,2,ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник.Физлицо.Пол,,ложь);
						ФИОСклон = СокрЛП(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник.Наименование);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ПроцентКонтракт" Тогда
						ПарПредмета = ",,,м,,,,м,0";
						ПрописьюПроц = СокрЛп(НРег(ЧислоПрописью(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ПроцентПоКонтракту,,ПарПредмета)));
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ПроцентПоКонтракту) + " (" + ПрописьюПроц + ")";
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ИзмМТС" Тогда	
						ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
						МТС = ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].МесячнаяТарифнаяСтавка;
						ТС = ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ТарифнаяСтавка;
						
						ПроцентЗаСложНапр = 0;
						Для Каждого СтрТЧ ИЗ ОбъектВладелец.ОсновныеНачисления Цикл
							Если СтрТЧ.Сотрудник <> ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник Тогда
								Продолжить;
							КонецЕсли;
							Если СокрЛП(Нрег(СтрТЧ.ВидРасчета.Наименование)) = "надбавка за сложность и напряженность" Тогда
								ПроцентЗаСложНапр = СтрТЧ.Показатель1;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						МТС_Кон = МТС + Окр((ТС*ПроцентЗаСложНапр)/100,2);
						ЧПК = Нрег(ЧислоПрописью(МТС_Кон,,ПарПредмета));
						ЧПК = Строка(Цел(МТС_Кон)) +" "+ Сред(ЧПК,Найти(ЧПК,"рубл"));
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ИзмТС" Тогда	
						ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
						ЧПК = Нрег(ЧислоПрописью(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ТарифнаяСтавка,,ПарПредмета));
						ЧПК = Строка(Цел(ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].ТарифнаяСтавка)) +" "+ Сред(ЧПК,Найти(ЧПК,"рубл"));
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ЗаСложНапр" Тогда
						ПроцентЗаСложНапр = 0;
						Для Каждого СтрТЧ ИЗ ОбъектВладелец.ОсновныеНачисления Цикл
							Если СтрТЧ.Сотрудник <> ОбъектВладелец[ТабличнаяЧасть.Имя][НомерСтрокиДока].Сотрудник Тогда
								Продолжить;
							КонецЕсли;
							
							Если СокрЛП(Нрег(СтрТЧ.ВидРасчета.Наименование)) = "надбавка за сложность и напряженность" Тогда
								ПроцентЗаСложНапр = СтрТЧ.Показатель1;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						ФорматнаяСтрока = "Л=ru_RU"; 
						ПараметрыПредметаИсчисления = " , , , , , , , , 0"; 
						ПутьКДанным.ПроизвольныйАлгоритм = ?(ПроцентЗаСложНапр = 0,"","- повышение тарифного оклада на " + СокрЛП(ПроцентЗаСложНапр) + " (" + СокрЛП(Нрег(ЧислоПрописью(ПроцентЗаСложНапр, ФорматнаяСтрока, ПараметрыПредметаИсчисления))) + ") % за сложность и напряженность труда.");
					КонецЕсли;
					//Изменение ЗП )
				КонецЕсли;
			ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ТрудовойДоговор") Тогда
				Если ОргСпр.ИНН = "690662297" Тогда
					//Контракты (
					Если ПутьКДанным.ИмяПараметра = "КонтрНомерДог" Тогда  
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.НомерТД);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "Кого1ФИО" Тогда 
						ФИОРуководитель = ВосстановитьЗначение("мСотрудникТудовойДог");
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ФИОРуководитель.Наименование,2,ФИОРуководитель.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаДов" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.Организация.ДатаДоверенности,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "НомерДов" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.Организация.НомерДоверенности);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрДатаДог" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.ДатаТД,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстФизЛицо" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = ОбъектВладелец.Сотрудник.Наименование;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрЧтоДелает" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = ?(ОбъектВладелец.Перемещение,"переводит","принимает");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрКого2ФИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.Сотрудник.Наименование,4,ОбъектВладелец.Сотрудник.Физлицо.Пол,,Ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = ФИОСклон;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрКого2Долж" Тогда 
						ФразаСклоненнаяДолжность = "";
						//Аверсон 02.03.2020 КВВ СВФР-005600 (
						Если ОбъектВладелец.Должность.Категория = Справочники.КатегорииРаботников.РабочиеОсновные ИЛИ
							ОбъектВладелец.Должность.Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда 
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.Должность,5,ФразаСклоненнаяДолжность,,Ложь);
							ПриставкаПоКатегории = "на работу ";  					
						Иначе
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец.Должность,2,ФразаСклоненнаяДолжность,,Ложь);
							ПриставкаПоКатегории = "на должность ";
							ФразаСклоненнаяДолжность = ?(СокрЛП(НРЕГ(ОбъектВладелец.Должность))="администратор магазина",ФразаСклоненнаяДолжность + " магазина",ФразаСклоненнаяДолжность);
						КонецЕсли;
						//Аверсон 02.03.2020 КВВ СВФР-005600 )
						ПутьКДанным.ПроизвольныйАлгоритм = ПриставкаПоКатегории + ФразаСклоненнаяДолжность;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрКого1Долж" Тогда 
						ДолжностьРуководитель = ВосстановитьЗначение("мДолжностьТудовойДог");
						ДолжностьРуководитель = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию(ДолжностьРуководитель,Истина); //Аверсон 02.03.2020 КВВ СВФР-005600
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ДолжностьРуководитель,2,ФразаСклоненнаяДолжность,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = Нрег(ФразаСклоненнаяДолжность);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрСрок" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.СрокДоговора) + " с " + Формат(ОбъектВладелец.НачалоДоговора,"ДФ=""дд.ММ.гггг""") + " по " + Формат(ОбъектВладелец.ОкончаниеДоговора,"ДФ=""дд.ММ.гггг""");
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрИспытСрок" Тогда	
						Мес = "";  СловоМесяц = "";  МесПроп = "";
						Если ЗначениеЗаполнено(ОбъектВладелец.ИспытательныйСрок) Тогда
							Мес = СокрЛП(ОбъектВладелец.ИспытательныйСрок);
							ПарПредмета = ",,,м,,,,м,0";
							МесП = СокрЛп(НРег(ЧислоПрописью(ОбъектВладелец.ИспытательныйСрок,,ПарПредмета)));
							МесПроп = " (" + МесП + ")";
							Если ОбъектВладелец.ИспытательныйСрок = 1 тогда 
								СловоМесяц = " месяц";
							ИначеЕсли ОбъектВладелец.ИспытательныйСрок >2 и ОбъектВладелец.ИспытательныйСрок< 5 Тогда 
								СловоМесяц = " месяца";
							Иначе
								СловоМесяц = " месяцев";
							КонецЕсли;
							//Аверсон 02.03.2020 КВВ СВФР-005600 (
							ПутьКДанным.ПроизвольныйАлгоритм = "Контракт заключается с предварительным испытанием сроком " + Мес + МесПроп + СловоМесяц;
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = "Контракт заключается без предварительного испытания";
							//Аверсон 02.03.2020 КВВ СВФР-005600 )
						КонецЕсли;
						
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрМТС" Тогда	
						ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
						ЧПК = Нрег(ЧислоПрописью(ОбъектВладелец.РасчетнаяТарифнаяСтавка,,ПарПредмета));
						ЧПК = Строка(Цел(ОбъектВладелец.РасчетнаяТарифнаяСтавка)) +" "+ Сред(ЧПК,Найти(ЧПК,"рубл"));
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрМТС1" Тогда	
						ЗаСложНапр = 0;
						Для Каждого СтрПН ИЗ ОбъектВладелец.ПерсональныеНадбавки Цикл
							Если Найти(СокрЛП(Нрег(СтрПН.Надбавка.Наименование)),"надбавка за сложность и напряженность") > 0 Тогда
								ЗаСложНапр = СтрПН.Показатель1;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						ДолжОклад = ОбъектВладелец.РасчетнаяТарифнаяСтавка + Окр(((ОбъектВладелец.ТарифнаяСтавка * ЗаСложНапр)/100),2);
						
						ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
						ЧПК = Нрег(ЧислоПрописью(ДолжОклад,,ПарПредмета));
						ЧПК = Строка(Цел(ДолжОклад)) +" "+ Сред(ЧПК,Найти(ЧПК,"рубл"));
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрТарифОклад" Тогда
						ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,м,2";
						ЧПК = Нрег(ЧислоПрописью(ОбъектВладелец.ТарифнаяСтавка,,ПарПредмета));
						ЧПК = Строка(Цел(ОбъектВладелец.ТарифнаяСтавка)) +" "+ Сред(ЧПК,Найти(ЧПК,"рубл"));
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрПроцентКонтракта" Тогда 
						ЧПК = "";
						Если ОбъектВладелец.ПроцентПоКонтракту <> 0 Тогда
							ПарПредмета = ",,,м,,,,м,0";
							ЧПКП = СокрЛп(НРег(ЧислоПрописью(ОбъектВладелец.ПроцентПоКонтракту,,ПарПредмета)));
							ЧПК = СокрЛП(ОбъектВладелец.ПроцентПоКонтракту) + " (" + ЧПКП + ")";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
						
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрПроцентЗаСложНапр" Тогда 	
						ЗаСложНапр = 0;
						Для Каждого СтрПН ИЗ ОбъектВладелец.ПерсональныеНадбавки Цикл
							Если Найти(СокрЛП(Нрег(СтрПН.Надбавка.Наименование)),"надбавка за сложность и напряженность") > 0 Тогда
								ЗаСложНапр = СтрПН.Показатель1;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						ЧПК = "";
						Если ЗаСложНапр <> 0 Тогда
							ПарПредмета = ",,,м,,,,м,0";
							ЧПКП = СокрЛп(НРег(ЧислоПрописью(ЗаСложНапр,,ПарПредмета)));
							ЧПК = СокрЛП(ЗаСложНапр) + " (" + ЧПКП + ")";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ЧПК;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "КонтрОтп" ИЛИ ПутьКДанным.ИмяПараметра = "КонтрОснОтп" ИЛИ ПутьКДанным.ИмяПараметра = "КонтрДопОтп" Тогда
						КолвоОсн = 0; КолвоКонтр = 0; КолвоВс = 0;
						
						//Аверсон 02.03.2020 КВВ СВФР-005600 (
						Если ОбъектВладелец.Отпуска.Количество() = 0 Тогда // из спр.Должности - закладка Дополнительно - раздел Отпуска
							Для Каждого ТекСтр Из ОбъектВладелец.Должность.Отпуск Цикл
								Если ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт Тогда
									КолвоКонтр = КолвоКонтр + ТекСтр.КоличествоДней;
								ИначеЕсли ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
									КолвоОсн = КолвоОсн + ТекСтр.КоличествоДней;
								КонецЕсли;
							КонецЦикла;
							
						Иначе // из док.Трудовой договор
							//Аверсон 02.03.2020 КВВ СВФР-005600 )
							Для Каждого ТекСтр Из ОбъектВладелец.Отпуска Цикл
								Если ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт Тогда
									КолвоКонтр = КолвоКонтр + ТекСтр.КоличествоДней;
								ИначеЕсли ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
									КолвоОсн = КолвоОсн + ТекСтр.КоличествоДней;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						КолвоВс = КолвоОсн + КолвоКонтр;
						СклонОсн = СклонениеКаледнарныхДней(КолвоОсн);
						ТОсн = СокрЛП(КолвоОсн) + " " +СклонОсн;
						СклонКонтр = СклонениеКаледнарныхДней(КолвоКонтр);
						ТКонтр = СокрЛП(КолвоКонтр)  + " " + СклонКонтр;
						СклонВс = СклонениеКаледнарныхДней(КолвоВс);
						ТВс = СокрЛП(КолвоВс)  + " " + СклонВс;
						ПутьКДанным.ПроизвольныйАлгоритм = ?(ПутьКДанным.ИмяПараметра = "КонтрОтп",ТВс,?(ПутьКДанным.ИмяПараметра = "КонтрОснОтп",ТОсн,ТКонтр));
					КонецЕсли;
					//Контракты )
					
				КонецЕсли;
			ИначеЕсли ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ОтпускаОрганизаций") Тогда
				Если ОргСпр.ИНН = "690662297" И (
					ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины ИЛИ
					ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный ИЛИ
					ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть) Тогда
					Если ПутьКДанным.ИмяПараметра = "НомерПр" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ОбъектВладелец.НомерПриказа);
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ДатаПр" Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""");     
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрКому" ИЛИ ПутьКДанным.ИмяПараметра = "СотрКого" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,?(ПутьКДанным.ИмяПараметра = "СотрКому",3,2),ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ИнициалыФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);
						ПутьКДанным.ПроизвольныйАлгоритм = ИнициалыФИО;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,1,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ИнициалыФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ФИОСклон);
						ПутьКДанным.ПроизвольныйАлгоритм = ИнициалыФИО;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ТипОтп" Тогда
						ТипОтп = ?(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть,"часть трудового отпуска", "трудовой отпуск");
						ПутьКДанным.ПроизвольныйАлгоритм = ТипОтп;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ПериодОтработки" Тогда
						ПериодОтработки = "с " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].РабочийГодС,"ДФ=""дд.ММ.гггг""") + " по " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].РабочийГодПо,"ДФ=""дд.ММ.гггг""");
						ПутьКДанным.ПроизвольныйАлгоритм = ПериодОтработки;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "РасшОтп" Тогда
						КолвоОсн = 0; КолвоКонтр = 0;
						Для Каждого ТекСтр Из ОбъектВладелец.Отпуска Цикл
							Если ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт Тогда
								КолвоКонтр = КолвоКонтр + ТекСтр.КоличествоДней;
							ИначеЕсли ТекСтр.ВидОтпуска = Справочники.ВидыЕжегодныхОтпусков.ОсновнойОтпуск Тогда
								КолвоОсн = КолвоОсн + ТекСтр.КоличествоДней;
							КонецЕсли;
						КонецЦикла;
						//СклонОсн = СклонениеКаледнарныхДней(КолвоОсн);
						//СклонКонтр = СклонениеКаледнарныхДней(КолвоКонтр);
						//СклонОсн = ?(КолвоОсн=1 ИЛИ КолвоОсн=21 ИЛИ КолвоОсн=31 ИЛИ КолвоОсн=41,"календарный день","календарных дней");
						//СклонКонтр = ?(КолвоКонтр=1 ИЛИ КолвоКонтр=21 ИЛИ КолвоКонтр=31 ИЛИ КолвоКонтр=41,"календарный день","календарных дней");
						
						//Аверсон 01.04.2020 КВВ СВФР-005764 (
						СклонОсн = "календарных дней";
						Если КолвоОсн=1 ИЛИ КолвоОсн=21 ИЛИ КолвоОсн=31 ИЛИ КолвоОсн=41 Тогда
							СклонОсн = "календарный день";
						ИначеЕсли НЕ(КолвоОсн=12 ИЛИ КолвоОсн=13 ИЛИ КолвоОсн=14) И 
							(Прав(СокрЛП(КолвоОсн),1)="2" ИЛИ Прав(СокрЛП(КолвоОсн),1)="3" ИЛИ Прав(СокрЛП(КолвоОсн),1)="4") Тогда
							СклонОсн = "календарных дня";
						КонецЕсли;
						
						СклонКонтр = "календарных дней";
						Если КолвоКонтр=1 ИЛИ КолвоКонтр=21 ИЛИ КолвоКонтр=31 ИЛИ КолвоКонтр=41 Тогда
							СклонКонтр = "календарный день";
						ИначеЕсли НЕ(КолвоКонтр=12 ИЛИ КолвоКонтр=13 ИЛИ КолвоКонтр=14) И 
							(Прав(СокрЛП(КолвоКонтр),1)="2" ИЛИ Прав(СокрЛП(КолвоКонтр),1)="3" ИЛИ Прав(СокрЛП(КолвоКонтр),1)="4") Тогда
							СклонКонтр = "календарных дня";
						КонецЕсли;
						//Аверсон 01.04.2020 КВВ СВФР-005764 )
						
						РасшОтп = ?(КолвоОсн=0,"","основной отпуск " + СокрЛП(КолвоОсн) + " " + СклонОсн) + ?(КолвоКонтр=0,"",", дополнительный отпуск – " + СокрЛП(КолвоКонтр) + " " + СклонКонтр + " по контракту");
						ПутьКДанным.ПроизвольныйАлгоритм = РасшОтп;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ПериодОтп" Тогда
						КолДнейОтп = ОбъектВладелец[ТабличнаяЧасть.Имя][0].КоличествоДней;
						//	Склон = СклонениеКаледнарныхДней(КолДнейОтп);
						
						//Аверсон 01.04.2020 КВВ СВФР-005764 (
						Склон = "календарных дней";
						Если КолДнейОтп=1 ИЛИ КолДнейОтп=21 ИЛИ КолДнейОтп=31 ИЛИ КолДнейОтп=41 Тогда
							Склон = "календарный день";
						ИначеЕсли НЕ(КолДнейОтп=12 ИЛИ КолДнейОтп=13 ИЛИ КолДнейОтп=14) И 
							(Прав(СокрЛП(КолДнейОтп),1)="2" ИЛИ Прав(СокрЛП(КолДнейОтп),1)="3" ИЛИ Прав(СокрЛП(КолДнейОтп),1)="4") Тогда
							Склон = "календарных дня";
						КонецЕсли;
						//Аверсон 01.04.2020 КВВ СВФР-005764 )
						
						ПериодОтп = "на " + СокрЛП(КолДнейОтп) + " " + Склон + ?(КолДнейОтп=1," "," с ") + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаНачала,"ДФ=""дд.ММ.гггг""") + ?(КолДнейОтп=1,""," по " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаОкончания,"ДФ=""дд.ММ.гггг"""));
						ПутьКДанным.ПроизвольныйАлгоритм = ПериодОтп;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрФИО" Тогда
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,3,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						ПутьКДанным.ПроизвольныйАлгоритм = СокрЛП(ВРЕГ(Лев(ФИОСклон,Найти(ФИОСклон," ")))) + Сред(ФИОСклон,Найти(ФИОСклон," "));
					ИначеЕсли ПутьКДанным.ИмяПараметра = "ФИОДиректор" или ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
						мСотрудникОтп1 = ВосстановитьЗначение("мСотрудникОтп");
						мДолжностьОтп1 = СокрЛП(ВосстановитьЗначение("мДолжностьОтп"));
						Если ПутьКДанным.ИмяПараметра = "ДолжностьДиректор" Тогда
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мДолжностьОтп1),ВРЕГ(Лев(мДолжностьОтп1,1))+Сред(мДолжностьОтп1,2),"");
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = ?(ЗначениеЗаполнено(мСотрудникОтп1),ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(мСотрудникОтп1.Наименование),"");
						КонецЕсли;
					ИначеЕсли ПутьКДанным.ИмяПараметра = "СотрДолж" Тогда 
						ФразаСклоненнаяДолжность = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,3,ФразаСклоненнаяДолжность,,ложь);
						
						ФразаСклоненнаяПодр = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Подразделение,2,ФразаСклоненнаяПодр,,ложь);
						
						ПутьКДанным.ПроизвольныйАлгоритм = ФразаСклоненнаяДолжность + ?(Число(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Подразделение.Код)=0,""," " + ФразаСклоненнаяПодр);	
					КонецЕсли;
				КонецЕсли;
				//Аверсон 17.02.2020 КВВ СВФР-005452 )
			КонецЕсли;
			если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
				//Аверсон 17.02.2020 КВВ СВФР-005452 (
				ТипУв = 0;
				Если ОбъектВладелец[ТабличнаяЧасть.Имя][0].ОснованиеУвольнения = Справочники.ОснованияУвольненияИзОрганизации.ПоСоглашениюНалог ИЛИ 
					ОбъектВладелец[ТабличнаяЧасть.Имя][0].СтатьяТКРФ = Справочники.ОснованияУвольненияИзОрганизации.ПоСоглашениюНалог ИЛИ 
					Найти(Нрег(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ОснованиеУвольнения),"по соглашению сторон")<>0 Тогда
					ТипУв = 1;
				ИначеЕсли ОбъектВладелец[ТабличнаяЧасть.Имя][0].ОснованиеУвольнения = Справочники.ОснованияУвольненияИзОрганизации.ИстечениеСрокаТрудовогоДоговора ИЛИ 
					ОбъектВладелец[ТабличнаяЧасть.Имя][0].СтатьяТКРФ = Справочники.ОснованияУвольненияИзОрганизации.ИстечениеСрокаТрудовогоДоговора ИЛИ
					Найти(Нрег(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ОснованиеУвольнения),"истечение срока")<>0 Тогда
					ТипУв = 2;
				КонецЕсли;
				//Аверсон 17.02.2020 КВВ СВФР-005452 )
				
				Если ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ1" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						ТЧПрием = ОбъектВладелец.РаботникиОрганизации;
						
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.ФизЛицо.Пол,,ложь);
						Фамилия2 = "";
						Имя1 = "";
						Отчество1 = "";
						сч = 1;
						сч1 = 0;
						пробелы = 0;
						Проб = "";
						
						Для симв = 1 по 300 цикл
							если не пробелы >3 тогда
								Символ = Сред(ФИОСклон,симв,1);
								если не Сред(ФИОСклон,симв,1) = " " и сч = 1 тогда
									Фамилия2 = Строка(Фамилия2 + Символ);
								ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 1 тогда
									Имя1 = Имя1+Символ; 
									если Сред(ФИОСклон,симв,1) = "." тогда
										сч1 = сч1+1;
									КонецЕсли;
								ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 2  тогда
									Отчество1 = Отчество1+Символ; 
									если Сред(ФИОСклон,симв,1) = "." тогда
										сч1 =  сч1+1;
									КонецЕсли;
								ИначеЕсли  Проб = " " и  Сред(ФИОСклон,симв,1) = " " тогда 
									Продолжить;
								ИначеЕсли Сред(ФИОСклон,симв,1) = " " или Сред(ФИОСклон,симв,1) = "."  тогда
									сч = сч+1;
									сч1 = сч1+1;
									
								ИначеЕсли сч1 = 3 тогда
									пробелы = пробелы + 1;
									
									
								КонецЕсли;
							КонецЕсли;
							Проб = Сред(ФИОСклон,симв,1);
						КонецЦикла;
						Имя2 = СтрЗаменить(Имя1, ".","");
						Отчество2 = СтрЗаменить(Отчество1, ".","");
						
						Фамилия  = ВРег( ОбщегоНазначения.ВыделитьСлово(Фамилия2));
						Имя      = ОбщегоНазначения.ВыделитьСлово(Имя2);
						Отчество = ОбщегоНазначения.ВыделитьСлово(Отчество2);
						ФИОСклон = Фамилия +" "+ Имя +" "+ Отчество;
						
						СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник));
						если СведенияОСотруднике.Количество()>0 Тогда
							ФразаСклоненнаяДолжность = "";
							УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.Должность,2,ФразаСклоненнаяДолжность,,ложь);
							ФразаСклоненнаяПодразделение = "";
							УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
						иначе
							ФразаСклоненнаяДолжность = "";
							ФразаСклоненнаяПодразделение = "";
						КонецЕсли;
						КолДнейКомпенсации = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации;
						Склон = СклонениеКаледнарныхДней(КолДнейКомпенсации);
						Если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()=1 Тогда
							НомерПП = "";
						Иначе
							НомерПП = Строка(ОбъектВладелец[ТабличнаяЧасть.Имя][0].НомерСтроки)+". ";
						КонецЕсли;					
						ТекстОсн =НомерПП + ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", "+
						Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаУвольнения,"ДЛФ=Д")+" "+Строка(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ОснованиеУвольнения)+", в соответствии со статьей "+ 
						ОбъектВладелец[ТабличнаяЧасть.Имя][0].СтатьяТКРФ;
						//+?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации)," с выплатой денежной компенсации за "+
						//Строка(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации)+" "+Склон+" неиспользованного трудового отпуска пропорционально отработанному времени с по .","");										
						
						//Аверсон 17.02.2020 КВВ СВФР-005452 (
						Если ОргСпр.ИНН = "690662297" Тогда
							ТекстОсн =НомерПП + ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", "+
							Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаУвольнения,"ДЛФ=Д");
							Если ТипУв = 1 Тогда
								ТекстОсн = ТекстОсн + " по соглашению сторон в соответствии с п.1 ст. 35 Трудового кодекса Республики Беларусь.";
							ИначеЕсли ТипУв = 2 Тогда
								ТекстОсн = ТекстОсн + " по истечению срока контракта в соответствии с п.2 ст. 35 Трудового кодекса Республики Беларусь.";
							КонецЕсли;
						КонецЕсли;		                               
						//Аверсон 17.02.2020 КВВ СВФР-005452 )
						
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					//Аверсон 17.02.2020 КВВ СВФР-005452 (
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ3" Тогда
					Если ОргСпр.ИНН = "690662297" И ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда  
						Если ТипУв = 1 Тогда
							ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь));
							ТекстОсн = "Основание: заявление "+ФИОСклон + ";";
						ИначеЕсли ТипУв = 2 Тогда
							ТекстОсн = "Основание: уведомление;";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ4" Тогда
					Если ОргСпр.ИНН = "690662297" И ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда  
						Если ТипУв = 1 Тогда
							ТекстОсн = "п.1 ст. 35 Трудового кодекса Республики Беларусь;";
						ИначеЕсли ТипУв = 2 Тогда
							ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь));
							ТекстОсн = "заявление "+ФИОСклон + ";";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;	
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ5" Тогда
					Если ОргСпр.ИНН = "690662297" И ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда  
						Если ТипУв = 1 Тогда
							ТекстОсн = "ст. 179 Трудового кодекса Республики Беларусь.";
						ИначеЕсли ТипУв = 2 Тогда
							ТекстОсн = "п.2 ст. 35 Трудового кодекса Республики Беларусь;";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;	
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ6" Тогда
					Если ОргСпр.ИНН = "690662297" И ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда  
						Если ТипУв = 1 Тогда
							ТекстОсн = "";
						ИначеЕсли ТипУв = 2 Тогда
							ТекстОсн = "ст. 179 Трудового кодекса Республики Беларусь.";
						КонецЕсли;
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
					//Аверсон 17.02.2020 КВВ СВФР-005452 )
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧКомп" Тогда
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
						
						СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник));
						если СведенияОСотруднике.Количество()>0 Тогда
							ФразаСклоненнаяДолжность = "";
							УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.Должность,3,ФразаСклоненнаяДолжность,,ложь);
							ФразаСклоненнаяПодразделение = "";
							УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.ПодразделениеОрганизации,3,ФразаСклоненнаяПодразделение,,ложь);
						иначе
							ФразаСклоненнаяДолжность = "";
							ФразаСклоненнаяПодразделение = "";
						КонецЕсли;
						ФразаСклоненнаяПодразделение = ВРег(Лев(ФразаСклоненнаяПодразделение,1))+Прав(ФразаСклоненнаяПодразделение,СтрДлина(ФразаСклоненнаяПодразделение)-1);
						
						КолДнейКомпенсации = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации;
						Склон = СклонениеКаледнарныхДней(КолДнейКомпенсации);
						
						Если ЗначениеЗаполнено(КолДнейКомпенсации) Тогда 
							ПолСотрудника = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ФизЛицо.Пол;
							
							ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение, ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,3,ПолСотрудника,,ложь);
							ИнициалыФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);
							
							ПарПредмета = ",,,м,,,,м,0";
							ПрописьюКалДней = СокрЛп(НРег(ЧислоПрописью(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации,,ПарПредмета)));
							
							ТекстОсн = "Планово-финансовой службе произвести окончательный расчет и выплатить " + ИнициалыФИО+" денежную компенсацию за "+
							Строка(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации)+" ("+ПрописьюКалДней+")"+" "+Склон+ " неиспользованного трудового отпуска.";
							
							//Аверсон 17.02.2020 КВВ СВФР-005452 (
							Если ОргСпр.ИНН = "690662297" Тогда
								ДН = Дата(1,1,1); ДК = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаУвольнения;
								ДнКомп_ = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДнейКомпенсации;
								Для Каждого ТекСтр ИЗ ОбъектВладелец.Отпуска Цикл
									ДН = ?(ДН = Дата(1,1,1),ТекСтр.РабочийГодС,Мин(ТекСтр.РабочийГодС,ДН));
									ДК = Мин(ДК,ТекСтр.РабочийГодПо);
								КонецЦикла;
								ПрописьюКалДней = Нрег(ПолучитьСтруктуруСклонения(ПрописьюКалДней));
								ТекстОсн = "Выплатить компенсацию за неиспользованный трудовой отпуск в количестве " + 
								Строка(ДнКомп_)+" ("+ПрописьюКалДней+")"+" "+?(ДнКомп_=1 ИЛИ ДнКомп_=21 ИЛИ ДнКомп_=31 ИЛИ ДнКомп_=41,"календарного дня","календарных дней") + 
								" за отработанный период с " + Формат(ДН,"ДЛФ=Д") + " по " + Формат(ДК,"ДЛФ=Д") + ".";
							КонецЕсли;
							//Аверсон 17.02.2020 КВВ СВФР-005452 )
						иначе
							ТекстОсн = "";
						КонецЕсли;
						
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
					
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ2" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
						ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь));
						ТекстОсн = "Основание: заявление "+ФИОСклон+ " от "+Формат(ОбъектВладелец.ДатаПриказа,"ДЛФ=Д")+".";
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
						ПутьКДанным.ТабличнаяЧасть = Истина;
						ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					КонецЕсли;	
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ОдинРаботник" Тогда 	
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()=1 Тогда 
						ПутьКДанным.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,ОбъектВладелец.РаботникиОрганизации[0].Сотрудник.Физлицо.Пол,,ложь));
					КонецЕсли;
					
				ИначеЕсли ПутьКДанным.ИмяПараметра = "Окон" Тогда
					если ОбъектВладелец[ТабличнаяЧасть.Имя].количество()>1  Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = "ы";
					ИначеЕсли  ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Женский 
						и ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя].количество()=1 ) Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = "а";
					Иначе
						ПутьКДанным.ПроизвольныйАлгоритм = "";
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда 
				Если ПутьКДанным.ИмяПараметра = "ЕстьСтажировка" Тогда
					для Каждого стрСтажир из ОбъектВладелец.РаботникиОрганизации Цикл 
						если ЗначениеЗаполнено(стрСтажир.ИнструкторОбучения) Тогда 
							ПутьКДанным.ПроизвольныйАлгоритм = "и проведении стажировки ";
						КонецЕсли;
					КонецЦикла;
					если ОбъектВладелец.РаботникиОрганизации.Количество()=1 Тогда
						ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец.РаботникиОрганизации[0].Сотрудник.Наименование,2,ОбъектВладелец.РаботникиОрганизации[0].Сотрудник.Физлицо.Пол,,ложь));
						Если ОргСпр.ИНН = "800009185" и ЗначениеЗаполнено(стрСтажир.ИнструкторОбучения) Тогда                							
							ПутьКДанным.ПроизвольныйАлгоритм = Строка(ПутьКДанным.ПроизвольныйАлгоритм)+Символы.ПС+ФИОСклон;
						Иначе
							ПутьКДанным.ПроизвольныйАлгоритм = Строка(ПутьКДанным.ПроизвольныйАлгоритм) + ФИОСклон;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ01" Тогда
						ЕстьИнструкторОбуч = Ложь;
						Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
							если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
							ЕстьИнструкторОбуч = Истина;
						КонецЕсли;
						
					КонецЦикла;
					
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 и ЕстьИнструкторОбуч Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = "1. ПРИНЯТЬ:";
					иначе
						ПутьКДанным.ПроизвольныйАлгоритм = "ПРИНЯТЬ:";
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ1" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						ТЧПрием = ОбъектВладелец.РаботникиОрганизации;
						ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Физлицо.Пол,,ложь);
						Фамилия2 = "";
						Имя1 = "";
						Отчество1 = "";
						сч = 1;
						сч1 = 0;
						пробелы = 0;
						Проб = "";
						
						Для симв = 1 по 300 цикл
							если не пробелы >3 тогда
								Символ = Сред(ФИОСклон,симв,1);
								если не Сред(ФИОСклон,симв,1) = " " и сч = 1 тогда
									Фамилия2 = Строка(Фамилия2 + Символ);
								ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 1 тогда
									Имя1 = Имя1+Символ; 
									если Сред(ФИОСклон,симв,1) = "." тогда
										сч1 = сч1+1;
									КонецЕсли;
								ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 2  тогда
									Отчество1 = Отчество1+Символ; 
									если Сред(ФИОСклон,симв,1) = "." тогда
										сч1 =  сч1+1;
									КонецЕсли;
								ИначеЕсли  Проб = " " и  Сред(ФИОСклон,симв,1) = " " тогда 
									Продолжить;
								ИначеЕсли Сред(ФИОСклон,симв,1) = " " или Сред(ФИОСклон,симв,1) = "."  тогда
									сч = сч+1;
									сч1 = сч1+1;
									
								ИначеЕсли сч1 = 3 тогда
									пробелы = пробелы + 1;
									
									
								КонецЕсли;
							КонецЕсли;
							Проб = Сред(ФИОСклон,симв,1);
						КонецЦикла;
						Имя2 = СтрЗаменить(Имя1, ".","");
						Отчество2 = СтрЗаменить(Отчество1, ".","");
						Фамилия  = ВРег( ОбщегоНазначения.ВыделитьСлово(Фамилия2));
						Имя      = ОбщегоНазначения.ВыделитьСлово(Имя2);
						Отчество = ОбщегоНазначения.ВыделитьСлово(Отчество2);
						ФИОСклон = Фамилия +" "+ Имя +" "+ Отчество;			
						ФразаСклоненнаяПодразделение = "";
						УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,1,ФразаСклоненнаяПодразделение,,ложь);//О.Т. Аверсон 10.10.2018 для бульбаш склонение
						Если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание) Тогда 
							СрокВГодах = Год(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ОкончаниеДоговора)-Год(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НачалоДоговора); 
							ФразаСрокВГодах = "";
							УправлениеОтчетами.Просклонять(глСклонение,СрокВГодах,1,ФразаСрокВГодах,,ложь);
							
							Испытательный = ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ИспытательныйСрок;
							ФразаИспытательный = "";
							УправлениеОтчетами.Просклонять(глСклонение,Испытательный,1,ФразаИспытательный,,ложь);
							СклонОкончания = СклонениеОкончания(Испытательный);
							если Число(Прав(Испытательный,1)) = 1 Тогда 
								СклонМесяц = "месяц";
							ИначеЕсли Число(Прав(Испытательный,1)) >1 и Число(Прав(Испытательный,1))<5 Тогда 
								СклонМесяц = "месяца";
							иначе
								СклонМесяц = "месяцев";
							КонецЕсли;
							
							если Число(Прав(СрокВГодах,1)) = 1 Тогда 
								СклГод = " год ";
							ИначеЕсли Число(Прав(СрокВГодах,1)) >1 и Число(Прав(СрокВГодах,1))<5 Тогда 
								СклГод = " года ";
							иначе
								СклГод = " лет ";
							КонецЕсли;
							
							
						иначе
							СрокВГодах="";
							Испытательный = "";
						КонецЕсли;
						ЕстьИнструкторОбуч = Ложь;
						Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
							если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
								ЕстьИнструкторОбуч = Истина;
							КонецЕсли;
							
						КонецЦикла;
						Если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()>0 и ЕстьИнструкторОбуч  Тогда
							ОбщаяНумерацияПоПриему = "1. ";
							НомерПодстановки = "1.";
						ИначеЕсли ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()=1 и не ЕстьИнструкторОбуч Тогда   
							ОбщаяНумерацияПоПриему = "";
							НомерПодстановки = "";
						Иначе
							ОбщаяНумерацияПоПриему = "1. ";
							НомерПодстановки = ?(не ЕстьИнструкторОбуч,"","1.");
						КонецЕсли;
						если ОбъектВладелец[ТабличнаяЧасть.Имя][0].Категория = Справочники.КатегорииРаботников.РабочиеОсновные или
							ОбъектВладелец[ТабличнаяЧасть.Имя][0].Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда 
							ФразаСклоненнаяДолжность = "";
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,5,ФразаСклоненнаяДолжность,,ложь);//О.Т. 12.08.2014(изменен падеж на Тв.)
							ПриставкаПоКатегории = " на работу ";  					
						иначе
							ФразаСклоненнаяДолжность = "";
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,2,ФразаСклоненнаяДолжность,,ложь);
							ПриставкаПоКатегории = " на должность ";
						КонецЕсли;
						
						ПарПредмета = ",,,м,,,,м,0";
						СтрокаСрок = "";
						ЧислоСрок = "";
						Если Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"лет")>0 Тогда 
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"лет")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"лет")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"лет")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"года")>0 Тогда 
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"года")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"года")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"года")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"год")>0 Тогда 
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"год")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"год")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"год")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяц")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяц")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяц")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяц")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяца")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяца")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяца")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяца")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяц")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяцев")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяцев")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"месяцев")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дней")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дней")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дней")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дней")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дня")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дня")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дня")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"дня")-2),"");
							
						ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"день")>0 Тогда
							ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"день")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"день")-2),,ПарПредмета)))+")";
							СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.СрокДоговора,"день")-2),"");
							
						КонецЕсли;
						Срок = ЧислоСрок + " " + СтрокаСрок;
						
						
						ПрописьюИспытСрок = ЧислоПрописью(ФразаИспытательный,,ПарПредмета);
						
						ПрописьюИспытСрок = Лев(ПрописьюИспытСрок,СтрДлина(ПрописьюИспытСрок)-1);
						ПрописьюИспытСрок = НРег(Лев(ПрописьюИспытСрок,1))+Прав(ПрописьюИспытСрок,СтрДлина(ПрописьюИспытСрок)-1);
						
						
						если ОбъектВладелец[ТабличнаяЧасть.Имя][0].Категория = Справочники.КатегорииРаботников.РабочиеОсновные или
							ОбъектВладелец[ТабличнаяЧасть.Имя][0].Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда
							//Аверсон 11.02.2020 КВВ СВФР-005452 (
							Если ОргСпр.ИНН = "690662297" Тогда
								Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
									ФразаСклоненнаяПодразделение = "";
									УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,4,ФразаСклоненнаяПодразделение,,ложь);
									ФИОСклон4 = ФИОСклон;
									ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+?(ЗначениеЗаполнено(СокрЛП(ФразаСклоненнаяПодразделение))," в ","")+
									СокрЛП(ФразаСклоненнаяПодразделение)+ ", " +?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание),
									?(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт," по контракту", " по трудовому договору"),"") +
									", сроком на "+Срок+" с "+ Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НачалоДоговора,"ДЛФ=Д") + " по " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ОкончаниеДоговора,"ДЛФ=Д") + ", " + 
									?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ПрописьюИспытСрок+" " + СклонМесяц,"без предварительного испытания") + " и окладом согласно штатному расписанию.";  //Аверсон 22.06.2020 КВВ СВФР-006168 (без предв.испыт.)
								КонецЕсли;
							Иначе
								
								//Аверсон 11.02.2020 КВВ СВФР-005452 )
								ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+" "+ Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаПриема,"ДЛФ=Д")+" "+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+" на "+
								ФразаСклоненнаяПодразделение+" "+
								" по  трудовому контракту "+ 
								" сроком на "+Срок+" "+
								?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ФразаИспытательный+" ("+ПрописьюИспытСрок+") " + СклонМесяц+
								" на условиях коллективной материальной ответственности с окладом согласно штатному расписанию.","");
								
							КонецЕсли;
						иначе
							//Аверсон 11.02.2020 КВВ СВФР-005452 (
							Если ОргСпр.ИНН = "690662297" Тогда
								Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
									ФразаСклоненнаяПодразделение = "";    
									УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,4,ФразаСклоненнаяПодразделение,,ложь);
									ФИОСклон4 = ФИОСклон;
									ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+
									?(ЗначениеЗаполнено(СокрЛП(ФразаСклоненнаяПодразделение))," в ","")+СокрЛП(ФразаСклоненнаяПодразделение)+ 
									?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание),
									?(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт," по контракту", " по трудовому договору"),"") +
									", сроком на "+Срок+" с "+ Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НачалоДоговора,"ДЛФ=Д") + " по " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ОкончаниеДоговора,"ДЛФ=Д") + ", " + 
									?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ПрописьюИспытСрок+" " + СклонМесяц,"без предварительного испытания") + " и окладом согласно штатному расписанию.";  //Аверсон 22.06.2020 КВВ СВФР-006168 (без предв.испыт.)
								КонецЕсли;
							Иначе
								//Аверсон 11.02.2020 КВВ СВФР-005452 )
								
								ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+" "+ Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаПриема,"ДЛФ=Д")+" "+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+" в "+
								ФразаСклоненнаяПодразделение+" "+
								" на условиях заключенного трудового контракта "+ 
								" сроком на "+Срок+" "+
								?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ФразаИспытательный+" ("+ПрописьюИспытСрок+") " + СклонМесяц+
								" с окладом согласно штатному расписанию.","");
							КонецЕсли;
						КонецЕсли;
						Если ОргСпр.ИНН = "800009185" Тогда
							// НомерПодстановки+ОбщаяНумерацияПоПриему+
							ТекстОсн =ФИОСклон+" с "+ Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаПриема,"ДЛФ=Д")+" "+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+" в "+
							ФразаСклоненнаяПодразделение+" "+ " по контракту "+	" сроком на "+Срок+" "+
							?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ФразаИспытательный+" ("+ПрописьюИспытСрок+") " + СклонМесяц+
							", с окладом согласно штатному расписанию.","");
						КонецЕсли;

						
						Если ТипЗнч(ОбщаяНумерацияПоПриему) = Тип("Строка") Тогда 
							ОбщаяНумерацияПоПриему = 2;
						иначе
							ОбщаяНумерацияПоПриему = ОбщаяНумерацияПоПриему+1;
						КонецЕсли;
						
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ2" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						ТЧОтпуска = ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.Отпуска;
						ПараметрыОтбора = Новый Структура;
						//МассивЕжегодн = Справочники.ВидыЕжегодныхОтпусков.Выбрать();
						//пока МассивЕжегодн.Следующий() Цикл 
						//	если Найти(МассивЕжегодн.Наименование, "контракт") >0 Тогда 
						//		ЕжегодныйОтпускЗаКонтракт = МассивЕжегодн.Ссылка;
						//		Прервать;
						//	Иначе 
						//		ЕжегодныйОтпускЗаКонтракт = Справочники.ВидыЕжегодныхОтпусков.ПустаяСсылка();
						//	КонецЕсли;
						//КонецЦикла; 
						
						
						ПараметрыОтбора.Вставить("ВидОтпуска",Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт);
						ТЧОтпуска = ТЧОтпуска.НайтиСтроки(ПараметрыОтбора);
						КолДнейОтпуска = "";
						Склон = "";
						если ТЧОтпуска.Количество()>0 Тогда 
							КолДнейОтпуска = ТЧОтпуска[0].КоличествоДней;
							Склон = СклонениеКаледнарныхДней(КолДнейОтпуска);
						КонецЕсли;
						ПроцентПоКонтракту = ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПроцентПоКонтракту;
						
						ТекстОсн = "Установить в контракте дополнительные меры стимулирования труда: "+?(ПроцентПоКонтракту>0,"повышение  тарифной ставки  на "+ПроцентПоКонтракту+"%","")+
						?(ПроцентПоКонтракту>0 и ЗначениеЗаполнено(КолДнейОтпуска)," и ","")+?(ЗначениеЗаполнено(КолДнейОтпуска),"предоставление дополнительного поощрительного отпуска с сохранением заработной платы продолжительностью "+
						КолДнейОтпуска+" "+Склон,"")+".";
						
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ3" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
						ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь));
						
						ТекстОсн = "Основание: 1. Заявление "+ФИОСклон+" от "+Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""")+?(ОргСпр.ИНН = "690662297",".","г.");
						
						ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ4" Тогда 
					если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
						//Аверсон 11.02.2020 КВВ СВФР-005452 (
						Если ОргСпр.ИНН = "690662297" Тогда
							Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
								ТрДок = "";
								Если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание) Тогда
									ТрДок = "2. " + ?(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт, "Контракт", "Трудовой договор") + " от " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.Дата,"ДФ=""дд.ММ.гггг""")
									+" № "+Строка(СтрЗаменить(?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НомерТД),Число(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НомерТД),0)," ",""))+".";
								КонецЕсли;
								ПутьКДанным.ПроизвольныйАлгоритм = ТрДок;
							КонецЕсли;
						ИначеЕсли ОргСпр.ИНН = "800009185" Тогда
							Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
								ТрДок = "";
								Если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание) Тогда
									ТрДок = "2. " + ?(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ВидТД = Перечисления.ВидыДоговоровСФизЛицами.Контракт, "Контракт", "Трудовой договор") + " от " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.ДатаТД,"ДФ=""дд.ММ.гггг""")
									+" № "+Строка(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НомерТД)+".";
								КонецЕсли;
								ПутьКДанным.ПроизвольныйАлгоритм = ТрДок;
							КонецЕсли;  							
						Иначе
							//Аверсон 11.02.2020 КВВ СВФР-005452 )
							ПутьКДанным.ПроизвольныйАлгоритм = "2. Трудовой контракт от "+Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.Дата,"ДФ=""дд.ММ.гггг""")
							+" № "+Строка(СтрЗаменить(?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НомерТД),ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.НомерТД,0)," ",""))+".";
						КонецЕсли;
					КонецЕсли;
					ПутьКДанным.ТабличнаяЧасть = Истина;
					ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ51" Тогда
					//Аверсон 11.02.2020 КВВ СВФР-005452 (
					Если ОргСпр.ИНН = "690662297" Тогда
						Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
							ФразаСклоненнаяПодразделение = "";    
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
							ФразаСклоненнаяДолжность = "";
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,2,ФразаСклоненнаяДолжность,,ложь);
							
							ТекстОсн =ФИОСклон4+", " +ФразаСклоненнаяДолжность+" "+
							СокрЛП(ФразаСклоненнаяПодразделение)+  " с " + Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ДатаПриема,"ДЛФ=Д");
							
							ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
						КонецЕсли;
					Иначе   
						//Аверсон 11.02.2020 КВВ СВФР-005452 )
						если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
							ЕстьИнструкторОбуч = Ложь;
							Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
								если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
									ЕстьИнструкторОбуч = Истина;
								КонецЕсли;
								
							КонецЦикла;
							
							если ЕстьИнструкторОбуч Тогда
								Если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда 
									ПутьКДанным.ПроизвольныйАлгоритм = "2. ПРОВЕСТИ:";
								иначе
									ПутьКДанным.ПроизвольныйАлгоритм = "ПРОВЕСТИ:";							
								КонецЕсли;
								
							иначе
								ПутьКДанным.ПроизвольныйАлгоритм = "";
								
							КонецЕсли;   					
						КонецЕсли;
						ПутьКДанным.ТабличнаяЧасть = Истина;
						ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ5" Тогда 
					//Аверсон 11.02.2020 КВВ СВФР-005452 (
					Если ОргСпр.ИНН = "690662297" Тогда
						Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
							ФразаСклоненнаяПодразделение = "";    
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
							ТекстОсн =ФразаСклоненнаяПодразделение;
							ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
						КонецЕсли;
					Иначе   
						//Аверсон 11.02.2020 КВВ СВФР-005452 )
						если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
							
							если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения) Тогда 
								ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь);
								ФразаСклоненнаяДолжность = "";
								УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,2,ФразаСклоненнаяДолжность,,ложь);//О.Т. 12.08.2014(изменен падеж на Тв.)
								ФразаСклоненнаяПодразделение = "";
								УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
								
								ФИОСклонИсполнит = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения.Наименование,2,,,ложь);
								СведенияОИнструкторе = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения));
								если СведенияОИнструкторе.Количество()>0 Тогда 
									ФразаСклоненнаяДолжностьИсполнит = "";
									УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.Должность,2,ФразаСклоненнаяДолжностьИсполнит,,ложь);
									ФразаСклоненнаяПодразделениеИсполнит = "";
									УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделениеИсполнит,,ложь);
								иначе
									ФразаСклоненнаяДолжностьИсполнит ="";
									ФразаСклоненнаяПодразделениеИсполнит="";
								КонецЕсли;
								//О.Т. Аверсон 03.02.2017 № 229
								ДниСтажировка = ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность.Стажировка;
								если ДниСтажировка = 1 Тогда 
									СклонРабДни = " рабочий день ";
								ИначеЕсли ДниСтажировка >1 и ДниСтажировка<5 Тогда 
									СклонРабДни = " рабочих дня ";
								иначе
									СклонРабДни = " рабочих дней ";
								КонецЕсли;
								//О.Т. Аверсон 03.02.2017 № 229
								ЕстьИнструкторОбуч = Ложь;
								Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
									если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
										ЕстьИнструкторОбуч = Истина;
									КонецЕсли;
									
								КонецЦикла;
								Если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()>0 и ЕстьИнструкторОбуч  Тогда
									ОбщаяНумерацияПоПриему1 = "1. ";
									НомерПодстановки1 = "2.";
									
								иначеЕсли ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()=1 Тогда   
									ОбщаяНумерацияПоПриему1 = "";
									НомерПодстановки1 = "";
								Иначе
									ОбщаяНумерацияПоПриему1 = "1. ";
									НомерПодстановки1 = ?(не ЕстьИнструкторОбуч,"","2.");
								КонецЕсли;
								
								
								ТекстОсн = НомерПодстановки1+ОбщаяНумерацияПоПриему1 + " Стажировку "+ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", продолжительностью "+Строка(ДниСтажировка)+СклонРабДни+"под руководством "+
								ФразаСклоненнаяДолжностьИсполнит+" "+ ФразаСклоненнаяПодразделениеИсполнит+" "+ФИОСклонИсполнит+".";
								ОбщаяНумерацияПоПриему1 = 2;
								ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн; 
								Если ОргСпр.ИНН = "800009185" Тогда
									// НомерПодстановки1+ОбщаяНумерацияПоПриему1 + 
									ТекстОсн = "Стажировку "+ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", продолжительностью "+Строка(ДниСтажировка)+СклонРабДни+"под руководством "+
									ФразаСклоненнаяДолжностьИсполнит+" того же подразделения "+ФИОСклонИсполнит+".";
									ОбщаяНумерацияПоПриему1 = 2;
									ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
								КонецЕсли;     								
							иначе
								ПутьКДанным.ПроизвольныйАлгоритм="";
							КонецЕсли;
						КонецЕсли;
						ПутьКДанным.ТабличнаяЧасть = Истина;
						ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					КонецЕсли;
					
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ6" Тогда 
					//Аверсон 11.02.2020 КВВ СВФР-005452 (
					Если ОргСпр.ИНН = "690662297" Тогда
						Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
							ФразаСклоненнаяПодразделение = "";    
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,6,ФразаСклоненнаяПодразделение,,ложь);
							ТекстОсн =ФразаСклоненнаяПодразделение;
							ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
						КонецЕсли;
					Иначе   
						//Аверсон 11.02.2020 КВВ СВФР-005452 )
						если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
							если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения) Тогда 
								ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.Наименование,2,,,ложь);
								ФразаСклоненнаяДолжность = "";
								УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].Должность,2,ФразаСклоненнаяДолжность,,ложь);
								ФразаСклоненнаяПодразделение = "";
								УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
								
								ФИОСклонИсполнит = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения.Наименование,2,,,ложь);
								СведенияОИнструкторе = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения));
								если СведенияОИнструкторе.Количество()>0 Тогда 
									ФразаСклоненнаяДолжностьИсполнит = "";
									УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.Должность,2,ФразаСклоненнаяДолжностьИсполнит,,ложь);
									ФразаСклоненнаяПодразделениеИсполнит = "";
									УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделениеИсполнит,,ложь);
								иначе
									ФразаСклоненнаяДолжностьИсполнит ="";
									ФразаСклоненнаяПодразделениеИсполнит="";
								КонецЕсли;
								ТекстОсн = "продолжительность стажировки работающих для рабочих профессий и профессий с повышенной опасностью, утверждённый приказом от 03.01.2022 № 07.";
								//Формат(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.Дата,"ДФ=""дд.ММ.гггг""")+" № "+Строка(Число(ОбъектВладелец[ТабличнаяЧасть.Имя][0].Основание.Номер));
								
								ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
							КонецЕсли;
						КонецЕсли;
						ПутьКДанным.ТабличнаяЧасть = Истина;
						ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;	
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстОсн" Тогда
					//Аверсон 11.02.2020 КВВ СВФР-005452 (
					Если ОргСпр.ИНН = "690662297" Тогда
						Если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
							ФразаСклоненнаяПодразделение = "";    
							УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть.Имя][0].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
							ТекстОсн =ФразаСклоненнаяПодразделение;
							ПутьКДанным.ПроизвольныйАлгоритм = ТекстОсн;
						КонецЕсли;
					Иначе   
						//Аверсон 11.02.2020 КВВ СВФР-005452 )
						если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения) Тогда
							ПутьКДанным.ПроизвольныйАлгоритм = "Основание:";
						иначе
							ПутьКДанным.ПроизвольныйАлгоритм = "";
						КонецЕсли;
						ПутьКДанным.ТабличнаяЧасть = Истина;
						ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;
					КонецЕсли;
				ИначеЕсли ПутьКДанным.ИмяПараметра = "Окон" Тогда
					если ОбъектВладелец[ТабличнаяЧасть.Имя].количество()>1 или ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения) Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = "ы";
					ИначеЕсли  ОбъектВладелец[ТабличнаяЧасть.Имя][0].Сотрудник.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Женский 
						и ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя].количество()=1 ) Тогда
						ПутьКДанным.ПроизвольныйАлгоритм = "а";
					Иначе
						ПутьКДанным.ПроизвольныйАлгоритм = "";
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли; //Аверсон 19.05.2023 КВВ СВФР-010849
	КонецЦикла;
	ИмяФайла = ПолучитьИмяВременногоФайла(?(ТипМакета = "dot", "dot", "doc"));
	РаботаСФайлами.СохранитьФайлНаДиске(МакетWord, ИмяФайла, Ложь, "ДА", Ложь);
	стПараметры = Новый Структура("ПутьКФайлу,WordApp,WordDoc", ИмяФайла);
	WordApp = ОткрытьWord(стПараметры, Ложь);
	Документ = WordApp.ActiveDocument();
	Форма = ПолучитьФорму("ФормаСостоянияПроцесса");
	Форма.Открыть();
	//WordApp.Visible = Истина;
	КолВоВТелеДока = Документ.Fields.count();
	ДокументActiveWindowActivePane = Документ.ActiveWindow.ActivePane;
	ДокументActiveWindowActivePane.View.SeekView = 1;
	ДокументActiveWindowActivePane.Selection.WholeStory();
	ПараметрыКолонтитулов = ДокументActiveWindowActivePane.Selection.Fields;
	КолВоВКолунтитулах = ПараметрыКолонтитулов.count();
	
	КолВо = КолВоВТелеДока + КолВоВКолунтитулах;
	ПараметрПрогресса = Новый Структура;
	ПараметрПрогресса.Вставить("МинимальноеЗначение", 0);
	ПараметрПрогресса.Вставить("МаксимальноеЗначение", КолВо);
	ПараметрПрогресса.Вставить("Значение", 0);
	Оповестить("СостояниеПрогресса", ПараметрПрогресса, );
	
	Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда 
		ТЗРассылка = ВосстановитьЗначение("ТабличноеПолеРеестрСотр");
		Если ТЗРассылка = Неопределено Тогда 
			ТЗРассылка = Новый ТаблицаЗначений;
		КонецЕсли;
		
		КоличествоСотрудников = 1;
		КоличествоРассылок = 0;
		Для Каждого стр из ТЗРассылка Цикл 
			Если стр.Выводить Тогда 
				КоличествоРассылок = КоличествоРассылок + 1;
			КонецЕсли;
		КонецЦикла;
		Если ОбъектВладелец.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда 
			Замена = Документ.Content.Find;
			Замена.Execute("[О]", Ложь, Истина, Ложь, , , Истина, , Ложь, "а");
		иначе
			Замена = Документ.Content.Find;
			Замена.Execute("[О]", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	Для инд = 1 По КолВоВКолунтитулах Цикл
		ПараметрыКолонтитуловitem = ПараметрыКолонтитулов.item(инд);
		Если ПараметрыКолонтитуловitem.Type <> 17 Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = ПараметрыКолонтитуловitem.Result.Text;
		строка = ПутиКДанным.Найти(ИмяПараметра, "ИмяПараметра");
		Если строка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(строка.ПроизвольныйАлгоритм) Тогда
			ПараметрыКолонтитуловitem.Result.Text = строка.ПроизвольныйАлгоритм;
		Иначе
			ПараметрыКолонтитуловitem.Result.Text = " ";
		КонецЕсли;
		ПараметрПрогресса.Значение = ПараметрПрогресса.Значение + 1;
		Оповестить("СостояниеПрогресса", ПараметрПрогресса, );
	КонецЦикла;
	ДокументActiveWindowActivePane.View.SeekView = 0;
	
	
	
	
	ДокументTables = Документ.Tables;
	ДокументTablesCount = ДокументTables.Count;
	ИндТаб = 1;
	
	Если НЕ (ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ФизическиеЛица") И ОргСпр.ИНН = "100194961") Тогда //Аверсон 19.05.2023 КВВ СВФР-010849
		Пока ИндТаб <= ДокументTablesCount Цикл
			ДокументTable = Документ.Tables(ИндТаб);
			ДокументTableRange = ДокументTable.Range;
			ДокументTableRangeFieldsCount = ДокументTableRange.Fields.Count();
			ИндПол = 1;
			ТабличнаяЧасть = "";
			ИндКол = 1;  
			СтрКол = 1;
			
			Попытка
				КопируемаяСтрока = ДокументTable.Rows(ДокументTable.Rows.Count());
				КоличествоКолонок = КопируемаяСтрока.Cells.Count; 
				Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
					ЕСЛИ ИндТаб = 3 Тогда
						Пока СтрКол < КоличествоСотрудников Цикл  //КоличествоРассылок
							ИндКол = 1;
							ДобавленнаяСтрока = ДокументTable.Rows.Add();
							
							Пока ИндКол <= КоличествоКолонок Цикл
								
								Ячейка = ДобавленнаяСтрока.Cells(ИндКол).Range;
								КопируемаяСтрока.Cells(ИндКол).Range.Copy();
								Ячейка.Paste();
								
								ИндКол = ИндКол+1;
							КонецЦикла; 
							СтрКол = СтрКол+1;
						КонецЦикла;
					иначеЕСЛИ ИндТаб = 4 Тогда
						Пока СтрКол < 50-(1+2) Цикл  //КоличествоРассылок
							ИндКол = 1;
							ДобавленнаяСтрока = ДокументTable.Rows.Add();
							
							Пока ИндКол <= КоличествоКолонок Цикл
								
								Ячейка = ДобавленнаяСтрока.Cells(ИндКол).Range;
								КопируемаяСтрока.Cells(ИндКол).Range.Copy();
								Ячейка.Paste();
								
								ИндКол = ИндКол+1;
							КонецЦикла; 
							СтрКол = СтрКол+1;
						КонецЦикла;
						
					ИНАЧЕ 	
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Пока ИндПол <= ДокументTableRangeFieldsCount Цикл
				ДокументTableRangeField = ДокументTableRange.Fields(ИндПол);
				Если ДокументTableRangeField.Type <> 17 Тогда
					ИндПол = ИндПол + 1;
					Продолжить;
				КонецЕсли;
				ИмяПараметра = ДокументTableRangeField.Result.Text;
				строка = ПутиКДанным.Найти(ИмяПараметра, "ИмяПараметра");
				Если строка <> Неопределено Тогда
					Если строка.ТабличнаяЧасть Тогда
						Если ТабличнаяЧасть = "" Тогда
							ТабличнаяЧасть = строка.ТабличнаяЧастьИмя;
						Иначе
							Если ТабличнаяЧасть <> строка.ТабличнаяЧастьИмя Тогда
								Сообщить("В одной таблице не может быть параметров из разных таблиц объекта.");
								WordApp.Quit();
								Возврат;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ИндПол = ИндПол + 1;
			КонецЦикла;
			
			
			
			
			
			Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
				Если ИндТаб = 4 Тогда 
					номСтр = 1;
					Сч = 1;
					КолРассылокСКонца = 50-(1+1) - КоличествоРассылок -1;//-ТЗРаботники.Количество();
					Пока сч <= 50 Цикл 
						Если сч >= КолРассылокСКонца Тогда 
							Замена = Документ.Content.Find;
							Замена.Execute("[Рассылка1]", Ложь, Истина, Ложь, , , Истина, , Ложь, "Реестр рассылки:");
							Для Каждого Стр3 Из ТЗРассылка Цикл //ТЗРассылка
								Если стр3.Выводить Тогда
									Текст = Стр3.Рассылка;
									Замена = Документ.Content.Find;
									Замена.Execute("[Рассылка1]", Ложь, Истина, Ложь, , , Истина, , Ложь, Текст);
									номСтр = номСтр+1;
								КонецЕсли;
							КонецЦикла;  							
						иначе
							Замена = Документ.Content.Find;
							Замена.Execute("[Рассылка1]", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
						КонецЕсли;
						сч = сч+1;
					КонецЦикла;
				КонецЕсли;
				
				//
				
				//
				Если ИндТаб = 3 Тогда
					Стр3 = ОбъектВладелец;
					Текст = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Стр3.ФизЛицо.Наименование);
					Замена = Документ.Content.Find;
					Замена.Execute("[ИнициалыСотрудники]", Ложь, Истина, Ложь, , , Истина, , Ложь, "________________"+Текст);
					Замена = Документ.Content.Find;
					Замена.Execute("[Пробел]", Ложь, Истина, Ложь, , , Истина, , Ложь, "________________");
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
					|	РаботникиОрганизацийСрезПоследних.Должность,
					|	РаботникиОрганизацийСрезПоследних.РазрядЕТС
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(, ) КАК РаботникиОрганизацийСрезПоследних
					|ГДЕ
					|	РаботникиОрганизацийСрезПоследних.Сотрудник = &Сотрудник";
					
					
					Запрос.УстановитьПараметр("Сотрудник", Стр3);
					
					Результат = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = Результат.Выбрать();
					Должность = "";
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Должность = ВыборкаДетальныеЗаписи.Должность.Наименование;
					КонецЦикла;
					
					Замена = Документ.Content.Find;
					Замена.Execute("[Должность]", Ложь, Истина, Ложь, , , Истина, , Ложь, Должность);
					
					Если КоличествоСотрудников < 2 Тогда
						Для з = 1 По 2 - КоличествоСотрудников Цикл
							Текст = "";
							Замена = Документ.Content.Find;
							Замена.Execute("[Должность]", Ложь, Истина, Ложь, , , Истина, , Ложь, Текст);
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
			
			
			
			
			
			
			
			
			Если ТабличнаяЧасть <> "" Тогда
				КопируемаяСтрока = ДокументTable.Rows(ДокументTable.Rows.Count());
				КоличествоКолонок = КопируемаяСтрока.Cells.Count;
				
				//Островская Татьяна 17.03.2014 № 17
				если ИмяПараметра = "СотрПриемИнстр" Тогда 
					КоличествоДобавляемыхСтрок = ТЧВладелецИнстр.Количество();
					если ТЧВладелецИнстр.Количество() = 0 Тогда 
						ДокументTable.Delete();
					КонецЕсли;
				иначе	
					КоличествоДобавляемыхСтрок = ОбъектВладелец[ТабличнаяЧасть].Количество();
				КонецЕсли;
				//Островская Татьяна 17.03.2014 № 17
				КоличествоДобавленныхСтрок = 1;
				Пока КоличествоДобавленныхСтрок < КоличествоДобавляемыхСтрок Цикл
					//Островская Татьяна 17.03.2014 № 17
					если ИмяПараметра = "СотрПриемИнстр" и 
						ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения.Наименование = "" Тогда
						КоличествоДобавленныхСтрок = КоличествоДобавленныхСтрок + 1;
						Продолжить;
					КонецЕсли;
					//Островская Татьяна 17.03.2014 № 17
					ДобавленнаяСтрока = ДокументTable.Rows.Add();
					ИндКол = 1;
					Пока ИндКол <= КоличествоКолонок Цикл
						Ячейка = ДобавленнаяСтрока.Cells(ИндКол).Range;
						КопируемаяСтрока.Cells(ИндКол).Range.Copy();
						Ячейка.Paste();
						КоличествоПолей = Ячейка.Fields.Count;
						ИндПол = 1;
						Пока ИндПол <= КоличествоПолей Цикл
							ЯчейкаFields = Ячейка.Fields(ИндПол);
							Если ЯчейкаFields.Type <> 17 Тогда
								ИндПол = ИндПол + 1;
								Продолжить;
							КонецЕсли;
							ИмяПараметра = ЯчейкаFields.Result.Text;
							строка = ПутиКДанным.Найти(ИмяПараметра, "ИмяПараметра");
							ЕСЛИ  ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
								
								Если ЯчейкаFields.Result.Text = "ТекстСотрТЧ1" Тогда
									Если строка.ТабличнаяЧасть Тогда
										НоваяСтрока = ПутиКДанным.Добавить();
										НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
										ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Физлицо.Пол,,ложь);
										Фамилия2 = "";
										Имя1 = "";
										Отчество1 = "";
										сч = 1;
										сч1 = 0;
										пробелы = 0;
										Проб = "";
										
										Для симв = 1 по 300 цикл
											если не пробелы >3 тогда
												Символ = Сред(ФИОСклон,симв,1);
												если не Сред(ФИОСклон,симв,1) = " " и сч = 1 тогда
													Фамилия2 = Строка(Фамилия2 + Символ);
												ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 1 тогда
													Имя1 = Имя1+Символ; 
													если Сред(ФИОСклон,симв,1) = "." тогда
														сч1 = сч1+1;
													КонецЕсли;
												ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 2  тогда
													Отчество1 = Отчество1+Символ; 
													если Сред(ФИОСклон,симв,1) = "." тогда
														сч1 =  сч1+1;
													КонецЕсли;
												ИначеЕсли  Проб = " " и  Сред(ФИОСклон,симв,1) = " " тогда 
													Продолжить;
												ИначеЕсли Сред(ФИОСклон,симв,1) = " " или Сред(ФИОСклон,симв,1) = "."  тогда
													сч = сч+1;
													сч1 = сч1+1;
													
												ИначеЕсли сч1 = 3 тогда
													пробелы = пробелы + 1;
													
													
												КонецЕсли;
											КонецЕсли;
											Проб = Сред(ФИОСклон,симв,1);
										КонецЦикла;
										Имя2 = СтрЗаменить(Имя1, ".","");
										Отчество2 = СтрЗаменить(Отчество1, ".","");
										
										Фамилия  = ВРег( ОбщегоНазначения.ВыделитьСлово(Фамилия2));
										Имя      = ОбщегоНазначения.ВыделитьСлово(Имя2);
										Отчество = ОбщегоНазначения.ВыделитьСлово(Отчество2);
										ФИОСклон = Фамилия +" "+ Имя +" "+ Отчество;
										ФразаСклоненнаяПодразделение = "";
										УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ПодразделениеОрганизации,4,ФразаСклоненнаяПодразделение,,ложь);
										Если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание) Тогда 
											СрокВГодах = Год(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.ОкончаниеДоговора)-Год(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.НачалоДоговора); 
											ФразаСрокВГодах = "";
											УправлениеОтчетами.Просклонять(глСклонение,СрокВГодах,1,ФразаСрокВГодах,,ложь);
											
											Испытательный = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.ИспытательныйСрок;
											ФразаИспытательный = "";
											УправлениеОтчетами.Просклонять(глСклонение,Испытательный,1,ФразаИспытательный,,ложь);
											СклонОкончания = СклонениеОкончания(Испытательный);
											если Число(Прав(Испытательный,1)) = 1 Тогда 
												СклонМесяц = "месяц";
											ИначеЕсли Число(Прав(Испытательный,1)) >1 и Число(Прав(Испытательный,1))<5 Тогда 
												СклонМесяц = "месяца";
											иначе
												СклонМесяц = "месяцев";
											КонецЕсли;
											
										иначе
											СрокВГодах="";
											Испытательный = "";
										КонецЕсли;
										
										если ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Категория = Справочники.КатегорииРаботников.РабочиеОсновные или
											ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда 
											ФразаСклоненнаяДолжность = "";
											УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Должность,5,ФразаСклоненнаяДолжность,,ложь);//О.Т. 12.08.2014(изменен падеж на Тв.)
											
											ПриставкаПоКатегории = " на работу ";
										иначе
											ФразаСклоненнаяДолжность = "";
											УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Должность,2,ФразаСклоненнаяДолжность,,ложь);
											ПриставкаПоКатегории = " на должность ";
											
										КонецЕсли;
										Если НомерПодстановки = Неопределено Тогда 
											ЕстьИнструкторОбуч = Ложь;
											Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть.Имя] Цикл 
												если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
													ЕстьИнструкторОбуч = Истина;
												КонецЕсли;
												
											КонецЦикла;
											Если ОбъектВладелец[ТабличнаяЧасть].Количество()>0 и ЕстьИнструкторОбуч  Тогда
												ОбщаяНумерацияПоПриему = "1. ";
												НомерПодстановки = "1.";
												
											иначеЕсли ОбъектВладелец[ТабличнаяЧасть].Количество()=1 Тогда   
												ОбщаяНумерацияПоПриему = "";
												НомерПодстановки = "";
											Иначе
												ОбщаяНумерацияПоПриему = "1. ";
												НомерПодстановки = ?(не ЕстьИнструкторОбуч,"","1.");
											КонецЕсли;
										КонецЕсли;
										
										ПарПредмета = ",,,м,,,,м,0";
										СтрокаСрок = "";
										ЧислоСрок = "";
										Если Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"лет")>0 Тогда 
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"лет")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"лет")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"лет")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"года")>0 Тогда 
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"года")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"года")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"года")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"год")>0 Тогда 
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"год")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"год")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"год")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяц")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяц")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяц")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяц")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяца")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяца")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяца")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяца")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяц")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяцев")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяцев")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"месяцев")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дней")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дней")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дней")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дней")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дня")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дня")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дня")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"дня")-2),"");
											
										ИначеЕсли Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"день")>0 Тогда
											ЧислоСрок = Строка(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"день")-2)) + " ("+СокрЛП(НРег(ЧислоПрописью(Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"день")-2),,ПарПредмета)))+")";
											СтрокаСрок = СтрЗаменить(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Лев(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,Найти(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.СрокДоговора,"день")-2),"");
											
										КонецЕсли;
										Срок = ЧислоСрок + " " + СтрокаСрок;
										
										
										ПрописьюИспытСрок = ЧислоПрописью(ФразаИспытательный,,ПарПредмета);
										
										ПрописьюИспытСрок = Лев(ПрописьюИспытСрок,СтрДлина(ПрописьюИспытСрок)-1);
										ПрописьюИспытСрок = НРег(Лев(ПрописьюИспытСрок,1))+Прав(ПрописьюИспытСрок,СтрДлина(ПрописьюИспытСрок)-1);
										
										если ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Категория = Справочники.КатегорииРаботников.РабочиеОсновные или
											ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Категория = Справочники.КатегорииРаботников.РабочиеВспомогательные Тогда
											
											ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+ " "+Формат(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДатаПриема,"ДЛФ=Д")+" "+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+" на "+
											ФразаСклоненнаяПодразделение+" "+
											" по  трудовому контракту "+ 
											" сроком на "+Срок+" "+
											?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ФразаИспытательный+" ("+ПрописьюИспытСрок+") " + СклонМесяц+
											" на условиях коллективной материальной ответственности с окладом согласно штатному расписанию.","");
										иначе
											ТекстОсн =НомерПодстановки+ОбщаяНумерацияПоПриему+ФИОСклон+ " "+Формат(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДатаПриема,"ДЛФ=Д")+" "+ПриставкаПоКатегории +ФразаСклоненнаяДолжность+
											?(ЗначениеЗаполнено(СокрЛП(ФразаСклоненнаяПодразделение))," в ","") + ФразаСклоненнаяПодразделение+" "+
											" на условиях заключенного трудового контракта "+ 
											" сроком на "+Срок+" "+
											?(ЗначениеЗаполнено(Испытательный),"с предварительным испытанием сроком на "+ФразаИспытательный+" ("+ПрописьюИспытСрок+") " + СклонМесяц+
											" с окладом согласно штатному расписанию.","");
											
										КонецЕсли;
										
										
										Если ТипЗнч(ОбщаяНумерацияПоПриему) = Тип("Строка") Тогда 
											ОбщаяНумерацияПоПриему = 2;
										иначе
											ОбщаяНумерацияПоПриему = ОбщаяНумерацияПоПриему+1;
										КонецЕсли;
										
										НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
										//СтрЗаменить(строка.ПроизвольныйАлгоритм, "." + строка.ТабличнаяЧастьИмя + ".", "." + строка.ТабличнаяЧастьИмя + "[" + КоличествоДобавленныхСтрок + "].");
										НоваяСтрока.ТабличнаяЧасть = Ложь;
										ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									КонецЕсли;
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ2" Тогда	
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									ТЧОтпуска = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.Отпуска;
									ПараметрыОтбора = Новый Структура;
									//МассивЕжегодн = Справочники.ВидыЕжегодныхОтпусков.Выбрать();
									//пока МассивЕжегодн.Следующий() Цикл 
									//	если Найти(МассивЕжегодн.Наименование, "контракт") >0 Тогда 
									//		ЕжегодныйОтпускЗаКонтракт = МассивЕжегодн.Ссылка;
									//		Прервать;
									//	Иначе 
									//		ЕжегодныйОтпускЗаКонтракт = Справочники.ВидыЕжегодныхОтпусков.ПустаяСсылка();
									//	КонецЕсли;
									//КонецЦикла; 
									
									
									ПараметрыОтбора.Вставить("ВидОтпуска",Справочники.ВидыЕжегодныхОтпусков.ЗаКонтракт);
									
									ТЧОтпуска= ТЧОтпуска.НайтиСтроки(ПараметрыОтбора);
									КолДнейОтпуска = "";
									Склон = "";
									если ТЧОтпуска.Количество()>0 Тогда 
										КолДнейОтпуска = ТЧОтпуска[0].КоличествоДней;
										Склон = СклонениеКаледнарныхДней(КолДнейОтпуска);
									КонецЕсли;
									ПроцентПоКонтракту = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ПроцентПоКонтракту;
									
									ТекстОсн = "Установить в контракте дополнительные меры стимулирования труда: "+?(ПроцентПоКонтракту>0,"повышение  тарифной ставки  на "+ПроцентПоКонтракту+"%","")+
									?(ПроцентПоКонтракту>0 и ЗначениеЗаполнено(КолДнейОтпуска)," и ","")+?(ЗначениеЗаполнено(КолДнейОтпуска),"предоставление дополнительного поощрительного отпуска с сохранением заработной платы продолжительностью "+
									КолДнейОтпуска+" "+Склон,"")+".";
									НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
									//СтрЗаменить(строка.ПроизвольныйАлгоритм, "." + строка.ТабличнаяЧастьИмя + ".", "." + строка.ТабличнаяЧастьИмя + "[" + КоличествоДобавленныхСтрок + "].");
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ3" Тогда 
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,2,,,ложь));
									
									ТекстОсн = "Основание: 1. Заявление "+ФИОСклон +" от "+Формат(ОбъектВладелец.ДатаПриказа,"ДФ=""дд.ММ.гггг""")+?(ОргСпр.ИНН = "690662297",".","г.");
									НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ4" Тогда 
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									НоваяСтрока.ПроизвольныйАлгоритм = "2. Трудовой контракт от "+Формат(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.Дата,"ДФ=""дд.ММ.гггг""")
									+" № "+Строка(СтрЗаменить(?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.НомерТД),Число(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.НомерТД),"")," ",""))+".";
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
								ИначеЕсли ПутьКДанным.ИмяПараметра = "ТекстСотрТЧ51" Тогда
									если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 0 Тогда
										если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть.Имя][0].ИнструкторОбучения) Тогда
											Если ОбъектВладелец[ТабличнаяЧасть.Имя].Количество()> 1 Тогда 
												ПутьКДанным.ПроизвольныйАлгоритм = "2. ПРОВЕСТИ:";
											иначе
												ПутьКДанным.ПроизвольныйАлгоритм = "ПРОВЕСТИ:";							
											КонецЕсли;
										иначе
											ПутьКДанным.ПроизвольныйАлгоритм = "";
											
										КонецЕсли;   					
									КонецЕсли;
									ПутьКДанным.ТабличнаяЧасть = Истина;
									ПутьКДанным.ТабличнаяЧастьИмя = ТабличнаяЧастьИмя;	
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ5" Тогда 
									если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения) Тогда 
										НоваяСтрока = ПутиКДанным.Добавить();
										НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
										
										ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,2,,,ложь);
										ФразаСклоненнаяДолжность = "";
										УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Должность,5,ФразаСклоненнаяДолжность,,ложь);//О.Т. 12.08.2014(изменен падеж на Тв.)
										ФразаСклоненнаяПодразделение = "";
										УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
										
										ФИОСклонИсполнит = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения.Наименование,2,,,ложь);
										СведенияОИнструкторе = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения));
										если СведенияОИнструкторе.Количество()>0 Тогда 
											ФразаСклоненнаяДолжностьИсполнит = "";
											УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.Должность,2,ФразаСклоненнаяДолжностьИсполнит,,ложь);
											ФразаСклоненнаяПодразделениеИсполнит = "";
											УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделениеИсполнит,,ложь);
										иначе
											ФразаСклоненнаяДолжностьИсполнит ="";
											ФразаСклоненнаяПодразделениеИсполнит="";
										КонецЕсли;
										//О.Т. Аверсон 03.02.2017 № 229
										ДниСтажировка = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Должность.Стажировка;
										если ДниСтажировка = 1 Тогда 
											СклонРабДни = " рабочий день ";
										ИначеЕсли ДниСтажировка >1 и ДниСтажировка<5 Тогда 
											СклонРабДни = " рабочих дня ";
										иначе
											СклонРабДни = " рабочих дней ";
										КонецЕсли;
										//О.Т. Аверсон 03.02.2017 № 229
										
										Если НомерПодстановки1 = Неопределено Тогда 
											ЕстьИнструкторОбуч = Ложь;
											Для Каждого стр из ОбъектВладелец[ТабличнаяЧасть] Цикл 
												если ЗначениеЗаполнено(стр.ИнструкторОбучения) Тогда 							
													ЕстьИнструкторОбуч = Истина;
												КонецЕсли;
												
											КонецЦикла;  
											Если ОбъектВладелец[ТабличнаяЧасть].Количество()>0 и ЕстьИнструкторОбуч  Тогда
												ОбщаяНумерацияПоПриему1 = "1. ";
												НомерПодстановки1 = "2.";
												
											иначеЕсли ОбъектВладелец[ТабличнаяЧасть].Количество()=1 Тогда   
												ОбщаяНумерацияПоПриему1 = "";
												НомерПодстановки1 = "";
											Иначе
												ОбщаяНумерацияПоПриему1 = "1. ";
												НомерПодстановки1 = ?(не ЕстьИнструкторОбуч,"","2.");
											КонецЕсли; 										
										КонецЕсли;
										
										ТекстОсн = НомерПодстановки1+Строка(ОбщаяНумерацияПоПриему1)+?(ТипЗнч(ОбщаяНумерацияПоПриему1) = Тип("Строка"),"",". ")+" Стажировку "+ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", продолжительностью "+Строка(ДниСтажировка)+СклонРабДни+"под руководством "+
										ФразаСклоненнаяДолжностьИсполнит+" "+ ФразаСклоненнаяПодразделениеИсполнит+" "+ФИОСклонИсполнит+".";
										Если ТипЗнч(ОбщаяНумерацияПоПриему1) = Тип("Строка") Тогда 
											ОбщаяНумерацияПоПриему1 = 2;
										иначе
											ОбщаяНумерацияПоПриему1 = ОбщаяНумерацияПоПриему1+1;
										КонецЕсли;
										НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
										
										НоваяСтрока.ТабличнаяЧасть = Ложь;
										ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									иначе
										НоваяСтрока = ПутиКДанным.Добавить();
										НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
										НоваяСтрока.ПроизвольныйАлгоритм = "";
										
										НоваяСтрока.ТабличнаяЧасть = Ложь;
										ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
										
									КонецЕсли;
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ6" Тогда 
									
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,2,,,ложь);
									ФразаСклоненнаяДолжность = "";
									УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Должность,2,ФразаСклоненнаяДолжность,,ложь);
									ФразаСклоненнаяПодразделение = "";
									УправлениеОтчетами.Просклонять(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
									
									ФИОСклонИсполнит = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения.Наименование,2,,,ложь);
									СведенияОИнструкторе = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения));
									если СведенияОИнструкторе.Количество()>0 Тогда 
										ФразаСклоненнаяДолжностьИсполнит = "";
										УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.Должность,2,ФразаСклоненнаяДолжностьИсполнит,,ложь);
										ФразаСклоненнаяПодразделениеИсполнит = "";
										УправлениеОтчетами.Просклонять(глСклонение,СведенияОИнструкторе.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделениеИсполнит,,ложь);
									иначе
										ФразаСклоненнаяДолжностьИсполнит ="";
										ФразаСклоненнаяПодразделениеИсполнит="";
									КонецЕсли;
									если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения) Тогда
										ТекстОсн = "продолжительность стажировки работающих для рабочих профессий и профессий с повышенной опасностью, утверждённый приказом от 16.01.2018 № 29";
										//Формат(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.Дата,"ДФ=""дд.ММ.гггг""")+" № "+Строка(Число(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Основание.Номер));
									иначе
										ТекстОсн = "";
									КонецЕсли;
									
									НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстОсн" Тогда
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									если ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ИнструкторОбучения) Тогда
										НоваяСтрока.ПроизвольныйАлгоритм = "Основание:";
									иначе
										НоваяСтрока.ПроизвольныйАлгоритм = "";
									КонецЕсли;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
									
								ИначеЕсли ЯчейкаFields.Result.Text = "СотрПриемТД" Тогда
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									НоваяСтрока.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование);;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
								ИначеЕсли ЯчейкаFields.Result.Text = "СотрПриемИнстр" Тогда
									если ТЧВладелецИнстр[КоличествоДобавленныхСтрок].ИнструкторОбучения.Наименование <> "" Тогда 										
										НоваяСтрока = ПутиКДанным.Добавить(); 
										НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
										
										//КонецЕсли;
										
										НоваяСтрока.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТЧВладелецИнстр[КоличествоДобавленныхСтрок].ИнструкторОбучения.Наименование);
										НоваяСтрока.ТабличнаяЧасть = Ложь;
										ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
										ЕстьСотрПриемИнстр = Истина;
									КонецЕсли;
									
									
								КонецЕсли;
							КонецЕсли;
							если ТипЗнч(ОбъектВладелец) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда
								Если ЯчейкаFields.Result.Text = "ТекстСотрТЧ1" Тогда 
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									
									ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,4,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Физлицо.Пол,,ложь);
									Фамилия2 = "";
									Имя1 = "";
									Отчество1 = "";
									сч = 1;
									сч1 = 0;
									пробелы = 0;
									Проб = "";
									
									Для симв = 1 по 300 цикл
										если не пробелы >3 тогда
											Символ = Сред(ФИОСклон,симв,1);
											если не Сред(ФИОСклон,симв,1) = " " и сч = 1 тогда
												Фамилия2 = Строка(Фамилия2 + Символ);
											ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 1 тогда
												Имя1 = Имя1+Символ; 
												если Сред(ФИОСклон,симв,1) = "." тогда
													сч1 = сч1+1;
												КонецЕсли;
											ИначеЕсли не Сред(ФИОСклон,симв,1) = " "  и сч1 = 2  тогда
												Отчество1 = Отчество1+Символ; 
												если Сред(ФИОСклон,симв,1) = "." тогда
													сч1 =  сч1+1;
												КонецЕсли;
											ИначеЕсли  Проб = " " и  Сред(ФИОСклон,симв,1) = " " тогда 
												Продолжить;
											ИначеЕсли Сред(ФИОСклон,симв,1) = " " или Сред(ФИОСклон,симв,1) = "."  тогда
												сч = сч+1;
												сч1 = сч1+1;
												
											ИначеЕсли сч1 = 3 тогда
												пробелы = пробелы + 1;
												
												
											КонецЕсли;
										КонецЕсли;
										Проб = Сред(ФИОСклон,симв,1);
									КонецЦикла;
									Имя2 = СтрЗаменить(Имя1, ".","");
									Отчество2 = СтрЗаменить(Отчество1, ".","");
									
									Фамилия  = ВРег( ОбщегоНазначения.ВыделитьСлово(Фамилия2));
									Имя      = ОбщегоНазначения.ВыделитьСлово(Имя2);
									Отчество = ОбщегоНазначения.ВыделитьСлово(Отчество2);
									ФИОСклон = Фамилия +" "+ Имя +" "+ Отчество;
									
									СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник));
									если СведенияОСотруднике.Количество()>0 Тогда
										ФразаСклоненнаяДолжность = "";
										УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.Должность,2,ФразаСклоненнаяДолжность,,ложь);
										ФразаСклоненнаяПодразделение = "";
										УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.ПодразделениеОрганизации,2,ФразаСклоненнаяПодразделение,,ложь);
									иначе
										ФразаСклоненнаяДолжность = "";
										ФразаСклоненнаяПодразделение = "";
									КонецЕсли;
									КолДнейКомпенсации = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации;
									Склон = СклонениеКаледнарныхДней(КолДнейКомпенсации);
									
									ТекстОсн =Строка(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].НомерСтроки)+". "+ФИОСклон+", "+ФразаСклоненнаяДолжность+" "+ФразаСклоненнаяПодразделение+", "+
									Формат(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДатаУвольнения,"ДЛФ=Д")+" "+Строка(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ОснованиеУвольнения)+" в соответствии со статьей "+ 
									ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].СтатьяТКРФ;
									//+?(ЗначениеЗаполнено(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации)," с выплатой денежной компенсации за "+
									//Строка(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации)+" "+Склон+" неиспользованного трудового отпуска пропорционально отработанному времени с по .","");										
									НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧКомп" Тогда
									если ОбъектВладелец[ТабличнаяЧасть].Количество()> 0 Тогда
										НоваяСтрока = ПутиКДанным.Добавить();
										НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
										
										СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(,Новый Структура("Сотрудник", ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник));
										если СведенияОСотруднике.Количество()>0 Тогда
											ФразаСклоненнаяДолжность = "";
											УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.Должность,3,ФразаСклоненнаяДолжность,,ложь);
											ФразаСклоненнаяПодразделение = "";
											УправлениеОтчетами.Просклонять(глСклонение,СведенияОСотруднике.ПодразделениеОрганизации,3,ФразаСклоненнаяПодразделение,,ложь);
										иначе
											ФразаСклоненнаяДолжность = "";
											ФразаСклоненнаяПодразделение = "";
										КонецЕсли;
										ФразаСклоненнаяПодразделение = ВРег(Лев(ФразаСклоненнаяПодразделение,1))+Прав(ФразаСклоненнаяПодразделение,СтрДлина(ФразаСклоненнаяПодразделение)-1);
										
										КолДнейКомпенсации = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации;
										Склон = СклонениеКаледнарныхДней(КолДнейКомпенсации);
										Если ЗначениеЗаполнено(КолДнейКомпенсации) Тогда 
											ПолСотрудника = ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ФизЛицо.Пол;
											
											ФИОСклон = УправлениеОтчетами.CклонятьФИО(глСклонение, ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,3,ПолСотрудника,,ложь);
											ИнициалыФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИОСклон);
											
											ПарПредмета = ",,,м,,,,м,0";
											ПрописьюКалДней = СокрЛп(НРег(ЧислоПрописью(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации,,ПарПредмета)));
											
											ТекстОсн = "Планово-финансовой службе произвести окончательный расчет и выплатить " + ИнициалыФИО+" денежную компенсацию за "+
											Строка(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].ДнейКомпенсации)+" ("+ПрописьюКалДней+")"+" "+Склон+ " неиспользованного трудового отпуска.";
										иначе
											ТекстОсн = "";
										КонецЕсли;
										
										НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
										НоваяСтрока.ТабличнаяЧасть = Ложь;
										ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									КонецЕсли;
									
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ТекстСотрТЧ2" Тогда 
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									ФИОСклон = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,2,,,ложь));
									
									ТекстОсн = "Основание: заявление "+ФИОСклон+ " от "+Формат(ОбъектВладелец.ДатаПриказа,"ДЛФ=Д")+".";
									
									НоваяСтрока.ПроизвольныйАлгоритм = ТекстОсн;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
									
								ИначеЕсли ЯчейкаFields.Result.Text = "ОдинРаботник" Тогда
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									НоваяСтрока.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(УправлениеОтчетами.CклонятьФИО(глСклонение,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование,2,ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.ФизЛицо.Пол,ложь));
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
								ИначеЕсли ЯчейкаFields.Result.Text = "СотрПриемТД" Тогда
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									НоваяСтрока.ПроизвольныйАлгоритм = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ОбъектВладелец[ТабличнаяЧасть][КоличествоДобавленныхСтрок].Сотрудник.Наименование);;
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
								ИначеЕсли ЯчейкаFields.Result.Text = "Год" Тогда
									НоваяСтрока = ПутиКДанным.Добавить();
									НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
									
									НоваяСтрока.ПроизвольныйАлгоритм = СтрЗаменить(Год(ОбъектВладелец.Дата)," ","");
									НоваяСтрока.ТабличнаяЧасть = Ложь;
									ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;	
								КонецЕсли;
							КонецЕсли;
							
							
							//Если строка.ТабличнаяЧасть Тогда
							//	НоваяСтрока = ПутиКДанным.Добавить();
							//	НоваяСтрока.ИмяПараметра = строка.ИмяПараметра + "-" + ИндТаб + "-" + КоличествоДобавленныхСтрок + "-" + ИндПол;
							//	НоваяСтрока.ПроизвольныйАлгоритм = СтрЗаменить(строка.ПроизвольныйАлгоритм, "." + строка.ТабличнаяЧастьИмя + ".", "." + строка.ТабличнаяЧастьИмя + "[" + КоличествоДобавленныхСтрок + "].");
							//	НоваяСтрока.ТабличнаяЧасть = Ложь;
							//	ЯчейкаFields.Result.Text = НоваяСтрока.ИмяПараметра;
							//КонецЕсли;
							ИндПол = ИндПол + 1;
						КонецЦикла;
						ИндКол = ИндКол + 1;
					КонецЦикла;
					КоличествоДобавленныхСтрок = КоличествоДобавленныхСтрок + 1;
				КонецЦикла;
			КонецЕсли;
			ИндТаб = ИндТаб + 1;
		КонецЦикла;
		
	КонецЕсли; //Аверсон 19.05.2023 КВВ СВФР-010849
	
	КоличествоПолей = Документ.Fields.Count;
	ИндПол = 1;
	Пока ИндПол <= КоличествоПолей Цикл
		ДокументField = Документ.Fields(ИндПол);
		Если ДокументField.Type <> 17 Тогда
			ИндПол = ИндПол + 1;
			Продолжить;
		КонецЕсли;
		ДокументFieldResult = ДокументField.Result;
		ИмяПараметра = ДокументFieldResult.Text;
		строка = ПутиКДанным.Найти(ИмяПараметра, "ИмяПараметра");
		Если строка.ТабличнаяЧасть Тогда
			ДокументFieldResult.Text = СтрЗаменить(строка.ПроизвольныйАлгоритм, "." + строка.ТабличнаяЧастьИмя + ".", "." + строка.ТабличнаяЧастьИмя + "[0].");
		ИначеЕсли ЗначениеЗаполнено(строка.ПроизвольныйАлгоритм) Тогда
			ДокументFieldResult.Text = строка.ПроизвольныйАлгоритм;
		Иначе
			ДокументFieldResult.Text = " ";
		КонецЕсли;
		ИндПол = ИндПол + 1;
		ПараметрПрогресса.Значение = ПараметрПрогресса.Значение + 1;
		Оповестить("СостояниеПрогресса", ПараметрПрогресса, );
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПользователей.Значение
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Пользователь = &Пользователь
	|	И НастройкиПользователей.Настройка = &Настройка");
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.АвтоматическийВыводШаблоновНаПечать);
	Выборка = Запрос.Выполнить().Выбрать();
	ПечатьСразу = Ложь;
	Если Выборка.Следующий() Тогда
		Если Выборка.Значение = Истина Тогда
			ПечатьСразу = Истина;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.АвтоматическиСохранятьШаблонВБазу);
	Выборка = Запрос.Выполнить().Выбрать();
	СохранятьВБазу = Ложь;
	Если Выборка.Следующий() Тогда
		Если Выборка.Значение = Истина Тогда
			СохранятьВБазу = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ПечатьСразу Тогда
		Документ.PrintOut();
	КонецЕсли;
	Если СохранятьВБазу Тогда
		ИмяСохраняемогоФайла = КаталогВременныхФайлов() + Наименование + Формат(ТекущаяДата(), "ДФ=ддММггг") + ".doc";
		Документ.SaveAs(ИмяСохраняемогоФайла);
		Документ.Close();
		WordApp.Quit();
		ФайлСсылка = ФЛ_РаботаСФайлами.ДобавитьФайл(ИмяСохраняемогоФайла, ОбъектВладелец.Ссылка);
		Привязки = ПутиКДанным.Найти("СсылкаНаФизЛицо", "ИмяПараметра");
		Если Привязки <> Неопределено Тогда
			Если Привязки.ТабличнаяЧасть Тогда
				КоличествоПовторений = ОбъектВладелец[ТабличнаяЧасть].Количество() - 1;
				Для инд = 0 По КоличествоПовторений Цикл
					Алгоритм = СтрЗаменить(Привязки.ПроизвольныйАлгоритм, "." + Привязки.ТабличнаяЧастьИмя + ".", "." + Привязки.ТабличнаяЧастьИмя + "[" + инд + "].");
					ФЛ_РаботаСФайлами.СоздатьПривязку(ВыполнитьАлгоритмБезПреобразования(Алгоритм), ФайлСсылка);
				КонецЦикла;
			Иначе
				ФЛ_РаботаСФайлами.СоздатьПривязку(ВыполнитьАлгоритмБезПреобразования(строка.ПроизвольныйАлгоритм), ФайлСсылка);
			КонецЕсли;
		КонецЕсли;
		Оповестить("ФЛ_РаботаСФайлами_УстановитьНовыйКонтекст", ОбъектВладелец.Ссылка);
	Иначе
		WordApp.Visible = Истина;
		WordApp.Activate();
	КонецЕсли;
	Форма.Закрыть();
КонецПроцедуры

Функция ПолучитьПараметы() Экспорт
	Перем ИмяФайла;
	ИмяФайла = ПолучитьИмяВременногоФайла("doc");
	ПараметрыТЧ = Новый ТаблицаЗначений;
	ПараметрыТЧ.Колонки.Добавить("ИмяПараметра");
	РаботаСФайлами.СохранитьФайлНаДиске(МакетWord, ИмяФайла, Ложь, "ДА", Ложь);
	стПараметры = Новый Структура("ПутьКФайлу,WordApp,WordDoc", ИмяФайла);
	WordApp = ОткрытьWord(стПараметры, Ложь);
	Документ = WordApp.ActiveDocument();
	КолВоВТелеДока = Документ.Fields.count();
	
	Документ.ActiveWindow.ActivePane.View.SeekView = 1;
	Документ.ActiveWindow.ActivePane.Selection.WholeStory();
	ПараметрыКолонтитулов = Документ.ActiveWindow.ActivePane.Selection.Fields;
	КолВоВКолунтитулах = ПараметрыКолонтитулов.count();
	
	КолВо = КолВоВТелеДока + КолВоВКолунтитулах;
	
	Для инд = 1 По КолВоВКолунтитулах Цикл
		Если ПараметрыКолонтитулов.item(инд).Type <> 17 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра = ПараметрыКолонтитулов.item(инд).Result.Text;
		строка = ПараметрыТЧ.Найти(ИмяПараметра, "ИмяПараметра");
		Если строка = Неопределено Тогда
			НовСтр = ПараметрыТЧ.Добавить();
			НовСтр.ИмяПараметра = ИмяПараметра;
			НовСтр.Значение = "";
		КонецЕсли;
	КонецЦикла;
	Документ.ActiveWindow.ActivePane.View.SeekView = 0;
	Для инд = 1 По КолВоВТелеДока Цикл
		Если Документ.Fields.item(инд).Type <> 17 Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = Документ.Fields.item(инд).Result.Text;
		строка = ПараметрыТЧ.Найти(ИмяПараметра, "ИмяПараметра");
		Если строка = Неопределено Тогда
			НовСтр = ПараметрыТЧ.Добавить();
			НовСтр.ИмяПараметра = ИмяПараметра;
		КонецЕсли;
	КонецЦикла;
	WordApp.Quit(0);
	Возврат ПараметрыТЧ;
КонецФункции

Функция ПолучитьИзСтандартныйНабор(СтандартныйНабор, ПутьКДанным)
	Если ПутьКДанным = "Стандартный_Набор" Тогда
		Возврат ПолучитьИзСтандартногоСписка(СтандартныйНабор);
	Иначе
		Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
			Возврат "";
		КонецЕсли;
		
		Попытка
			Значение = Неопределено;
			Выполнить("Значение = ОбъектВладелец." + ПутьКДанным);
			Возврат Строка(Значение);
		Исключение
			Сообщить("Не обнаружени данные по :" + ОбъектВладелец + "." + ПутьКДанным, СтатусСообщения.Важное);
			Возврат "";
		КонецПопытки;
	КонецЕсли;
КонецФункции

Функция ВыполнитьАлгоритм(ПроизвольныйАлгоритм)
	Попытка
		Значение = Неопределено;
		Выполнить("Значение = Строка(" + ПроизвольныйАлгоритм + ")");
		Возврат Значение;
	Исключение
		Сообщить("Ошибка " + ОписаниеОшибки() + " при попытке выполнить следующий код: " + Символы.ПС + "Значение = " + ПроизвольныйАлгоритм, СтатусСообщения.Важное);
		Возврат "";
	КонецПопытки;
КонецФункции

Функция ВыполнитьАлгоритмБезПреобразования(ПроизвольныйАлгоритм)
	Попытка
		Значение = Неопределено;
		Выполнить("Значение = " + ПроизвольныйАлгоритм);
		Возврат Значение;
	Исключение
		Сообщить("Ошибка " + ОписаниеОшибки() + " при попытке выполнить следующий код: " + Символы.ПС + "Значение = " + ПроизвольныйАлгоритм, СтатусСообщения.Важное);
		Возврат "";
	КонецПопытки;
КонецФункции

Функция ПолучитьФИО(ФизЛицо, Дата = Неопределено)
	Перем Данные;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Данные = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", ФизЛицо));
	Возврат Данные.Фамилия + " " + Данные.Имя + " " + Данные.Отчество;
КонецФункции

Функция ПолучитьФИОСокр(ФизЛицо, Дата = Неопределено)
	Перем Данные;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Данные = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", ФизЛицо));
	Возврат Лев(Данные.Имя, 1) + "." + Лев(Данные.Отчество, 1) + "." + Данные.Фамилия;
КонецФункции

Функция ПолучитьИОФ(ФизЛицо, Дата = Неопределено)
	Перем Данные;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Данные = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", ФизЛицо));
	Возврат Данные.Имя + " " + Данные.Отчество + " " + Данные.Фамилия;
КонецФункции

Функция ПолучитьИОФСокр(ФизЛицо, Дата = Неопределено)
	Перем Данные;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Данные = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", ФизЛицо));
	Возврат Лев(Данные.Имя, 1) + "." + Лев(Данные.Отчество, 1) + "." + Данные.Фамилия;
КонецФункции

Функция ПолучитьФПрописноеИО(ФизЛицо, Дата = Неопределено)
	Перем Данные;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Данные = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", ФизЛицо));
	Возврат ВРег(Данные.Фамилия) + " " + Данные.Имя + " " + Данные.Отчество;
КонецФункции

Функция ПолучитьДолжность(ФизЛицо, Дата = Неопределено)
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СотрудникиОрганизации.Период КАК Период,
	|	СотрудникиОрганизации.Должность
	|ИЗ
	|	РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
	|ГДЕ
	|	СотрудникиОрганизации.Период <= &Дата
	|	И СотрудникиОрганизации.Физлицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	
	
	
	
	
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	выборка = Запрос.Выполнить().выбрать();
	Если выборка.следующий() Тогда
		Возврат выборка.должность;
	Иначе Возврат "";
	КонецЕсли;
КонецФункции

Функция ПолучитьПодразделение(ФизЛицо, Дата = Неопределено)
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СотрудникиОрганизации.Период КАК Период,
	|	СотрудникиОрганизации.ПодразделениеОрганизации
	|ИЗ
	|	РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
	|ГДЕ
	|	СотрудникиОрганизации.Период < &Дата
	|	И СотрудникиОрганизации.Физлицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	
	
	
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Возврат Запрос.Выполнить().Выгрузить()[0].ПодразделениеОрганизации;
КонецФункции

Функция ПолучитьПодразделениеИерархически(Подразделение)
	Результат = Новый Массив;
	Результат.Добавить(Подразделение);
	ПодразделениеТек = Подразделение.Родитель;
	Пока ПодразделениеТек <> Справочники.Подразделения.ПустаяСсылка() Цикл
		Результат.Добавить(ПодразделениеТек);
		ПодразделениеТек = ПодразделениеТек.Родитель;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьДопОтпуск(Ключ, ВидДопОтпуска)
	Перем Строки;
	Строки = ОбъектВладелец.ДополнительныеОтпуска.НайтиСтроки(Новый Структура("Ключ,ВидДополнительногоОтпуска", Ключ, ВидДопОтпуска));
	Если Строки.Количество() Тогда
		Возврат Строки[0].ДнейДоп;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция ДатаПриемаНаРабту(ФизЛицо)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	СотрудникиОрганизации.Период КАК Период
	|ИЗ
	|	РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
	|ГДЕ
	|	СотрудникиОрганизации.Физлицо = &Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Возврат Запрос.Выполнить().Выгрузить()[0].Период;
КонецФункции

Функция ДатыКонтракта(ФизЛицо)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|     КонтрактыИДопСоглашения.Период КАК Период,
	|     КонтрактыИДопСоглашения.ДатаНачала как ДатаНачала,
	|     КонтрактыИДопСоглашения.ДатаОкончания   как ДатаОкончания
	|ИЗ
	|     РегистрСведений.КонтрактыИДопСоглашения КАК КонтрактыИДопСоглашения
	|ГДЕ
	|     КонтрактыИДопСоглашения.ФизЛицо = &Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|     Период УБЫВ");
	
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Возврат "с " + Формат(Запрос.Выполнить().Выгрузить()[0].ДатаНачала, "ДФ=dd.MM.yyyy") + " по  " + Формат(Запрос.Выполнить().Выгрузить()[0].ДатаОкончания, "ДФ=dd.MM.yyyy");
КонецФункции

Функция ПолучитьКонтракт(ФизЛицо, организация, дата)
	запрос = Новый запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА кд.Регистратор ССЫЛКА Документ.Контракт
	|			ТОГДА ""Контракт""
	|		ИНАЧЕ ""Дополнительное соглашение""
	|	КОНЕЦ КАК тип_договора,
	|	ВЫБОР
	|		КОГДА кд.Регистратор ССЫЛКА Документ.Контракт
	|			ТОГДА кд.Регистратор.НомерКонтракта
	|		ИНАЧЕ кд.Регистратор.Номер
	|	КОНЕЦ КАК номер,
	|	кд.Регистратор.Дата КАК дата
	|ИЗ
	|	РегистрСведений.КонтрактыИДопСоглашения.СрезПоследних(&дата, ) КАК кд
	|ГДЕ
	|	кд.ФизЛицо = &физлицо
	|	И кд.Организация = &организация");
	запрос.установитьпараметр("дата", дата);
	запрос.установитьпараметр("физлицо", ФизЛицо);
	запрос.установитьпараметр("организация", организация);
	выборка = запрос.выполнить().выбрать();
	Если выборка.Следующий() Тогда
		Возврат выборка.тип_договора + " от " + Строка(Формат(выборка.дата, "ДФ=дд.ММ.гггг")) + " № " + Строка(выборка.номер);
	Иначе Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДопОтпускаПоКонтракту(Контракт)
	Результат = 0;
	Для каждого Отпуск Из Контракт.ДополнительныеОтпуска Цикл
		Результат = Результат + Отпуск.ДнейДоп;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьНадбавкиПоКонтракту(Контракт, Код=Неопределено, ВидНачисления = Неопределено, Процент = Неопределено, Коэффициент = Неопределено, Сумма = Неопределено)
	Результат = "";
	Для каждого Надбавка Из Контракт.ПерсональныеНадбавки Цикл
		//Если Надбавка.ВидНачисления.Код = Код Тогда
		Если Не (ВидНачисления = Неопределено) Тогда
			Результат = Результат + " " + Надбавка.Надбавка + " ";
			
		КонецЕсли;
		
		//Если Не (Процент = Неопределено) Тогда
		//	Результат = Результат + " " + Надбавка.Процент + "%," + " ";
		
		//КонецЕсли;
		
		Если Не (Коэффициент = Неопределено) Тогда
			Результат = Результат + " " + Надбавка.Показатель1 + " ";
			
		КонецЕсли;
		
		//Если Не (Сумма = Неопределено) Тогда
		//	Результат = Результат + " " + Надбавка.Размер + " ";
		
		//КонецЕсли;
		//КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоставСемьи(ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|     ФизическиеЛицаСоставСемьи.СтепеньРодства,
	|     ФизическиеЛицаСоставСемьи.Имя,
	|     ФизическиеЛицаСоставСемьи.ГодРождения
	|ИЗ
	|     Справочник.ФизическиеЛица.СоставСемьи КАК ФизическиеЛицаСоставСемьи
	|ГДЕ
	|     ФизическиеЛицаСоставСемьи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ссылка);
	СписокДетей = Новый СписокЗначений;
	СписокДетей.Добавить(Справочники.СтепениРодстваФизЛиц.Дочь);
	СписокДетей.Добавить(Справочники.СтепениРодстваФизЛиц.Сын);
	ТекстСоставСемьи = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСоставСемьи = ТекстСоставСемьи + Выборка.СтепеньРодства + ": " + Выборка.Имя + ", " + Формат(Выборка.ГодРождения, "ДФ=dd.MM.yyyy") + Символы.ПС;
		
	КонецЦикла;
	Возврат ТекстСоставСемьи;
КонецФункции

Функция ПолучитьСемейноеПоложение(ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|     Регсемейноеположение.СемейноеПоложение.Наименование как Наименование
	|ИЗ
	|     РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(&дата, ) КАК Регсемейноеположение
	|ГДЕ
	|     Регсемейноеположение.ФизЛицо = &ссылка";
	
	Запрос.УстановитьПараметр("ссылка", ссылка);
	Запрос.УстановитьПараметр("дата", ТекущаяДата());
	СемейноеПоложение = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СемейноеПоложение = Выборка.Наименование;
	Иначе
		СемейноеПоложение = "";
	КонецЕсли;
	Возврат СемейноеПоложение;
КонецФункции

Функция ПолучитьПаспортныеДанные1(ссылка, ВидДанных)
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПаспортныеДанныеФизЛицСрезПоследних." + ВидДанных;
	ТекстЗапроса = ТекстЗапроса + " ИЗ
	|     РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&дата, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|ГДЕ
	|     ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = &ссылка";
	запрос = Новый Запрос(ТекстЗапроса);
	запрос.УстановитьПараметр("ссылка", ссылка);
	запрос.УстановитьПараметр("дата", ТекущаяДата());
	Данные = "";
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Выборка[0];
	Иначе
		Данные = "";
	КонецЕсли;
	Возврат Данные;
КонецФункции

Функция ПолучитьВоинскийУчет(ссылка, ВидДанных)
	ТекстЗапроса = " ВЫБРАТЬ РАЗРЕШЕННЫЕ ВоинскийУчетСрезПоследних." + ВидДанных;
	ТекстЗапроса = ТекстЗапроса + "                            ИЗ
	|     РегистрСведений.ВоинскийУчет.СрезПоследних(&дата, ) КАК ВоинскийУчетСрезПоследних
	|ГДЕ
	|     ВоинскийУчетСрезПоследних.Физлицо = &ссылка";
	запрос = Новый Запрос(ТекстЗапроса);
	запрос.УстановитьПараметр("ссылка", ссылка);
	запрос.УстановитьПараметр("дата", ТекущаяДата());
	Данные = "";
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Данные = Выборка[0];
	Иначе Данные = "";
	КонецЕсли;
	Возврат Данные;
КонецФункции

Функция ПолучитьГражданство(ссылка)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|     ГражданствоФизЛицСрезПоследних.Страна
	|ИЗ
	|     РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&дата, ) КАК ГражданствоФизЛицСрезПоследних
	|ГДЕ
	|     ГражданствоФизЛицСрезПоследних.ФизЛицо = &ссылка");
	Запрос.УстановитьПараметр("ссылка", ссылка);
	Запрос.УстановитьПараметр("дата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		результат = Выборка.Страна;
	Иначе результат = "";
	КонецЕсли;
	Возврат результат;
КонецФункции

Функция ПолучитьКонтакт(ссылка, видконтакта)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|     КонтактнаяИнформация.Представление
	|ИЗ
	|     РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|     КонтактнаяИнформация.Объект = &ссылка
	|     И КонтактнаяИнформация.Вид = &видконтакта");
	Запрос.УстановитьПараметр("ссылка", ссылка);
	Запрос.УстановитьПараметр("видконтакта", видконтакта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		результат = Выборка[0];
	Иначе результат = "";
	КонецЕсли;
	Возврат результат;
КонецФункции

Функция ПолучитьТабНомер(ФизЛицо, Дата = Неопределено)
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|     СотрудникиОрганизацииСрезПоследних.ТабельныйНомер
	|ИЗ
	|     РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Дата, Физлицо = &Физлицо) КАК СотрудникиОрганизацииСрезПоследних");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Возврат Запрос.Выполнить().Выгрузить()[0].ТабельныйНомер;
КонецФункции

Функция ПолучитьДанныеОтпуска(ФизЛицо, ВидРезультата)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетОтпусков.ВидОтпуска,
	|	УчетОтпусков.РабочийГодС,
	|	УчетОтпусков.РабочийГодПо,
	|	УчетОтпусков.ДатаНачала КАК ДатаНачала,
	|	УчетОтпусков.ДатаОкончания,
	|	УчетОтпусков.Регистратор.Дата
	|ИЗ
	|	РегистрНакопления.УчетОтпусков КАК УчетОтпусков
	|ГДЕ
	|	УчетОтпусков.ФизЛицо = &ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала");
	
	Запрос.УстановитьПараметр("ссылка", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	СтрокаВыборки = "";
	ФорматнаяСтрока = "";
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка[ВидРезультата - 1]) = ТипЗнч(ТекущаяДата()) Тогда
			ФорматнаяСтрока = Формат(Выборка[ВидРезультата - 1], "ДФ=dd.MM.yyyy");
		Иначе ФорматнаяСтрока = Выборка[ВидРезультата - 1];
		КонецЕсли;
		СтрокаВыборки = СтрокаВыборки + ФорматнаяСтрока + Символы.ПС;
	КонецЦикла;
	Возврат СтрокаВыборки;
КонецФункции

Функция ПолучитьНазначения(ФизЛицо, ВидРезультата)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизации.Период КАК ДатаНазначения,
	|	СотрудникиОрганизации.ПодразделениеОрганизации КАК подразделение,
	|	СотрудникиОрганизации.Должность,
	|	СотрудникиОрганизации.Разряд,
	|	СотрудникиОрганизации.Регистратор.Дата КАК ДатаДокумента,
	|	СотрудникиОрганизации.Регистратор.Номер КАК НомерДокумента
	|ИЗ
	|	РегистрСведений.СотрудникиОрганизации КАК СотрудникиОрганизации
	|ГДЕ
	|	СотрудникиОрганизации.Физлицо = &ссылка");
	Запрос.УстановитьПараметр("ссылка", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	СтрокаВыборки = "";
	ФорматнаяСтрока = "";
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка[ВидРезультата - 1]) = ТипЗнч(ТекущаяДата()) Тогда
			ФорматнаяСтрока = Формат(Выборка[ВидРезультата - 1], "ДФ=dd.MM.yyyy");
		Иначе ФорматнаяСтрока = Выборка[ВидРезультата - 1];
		КонецЕсли;
		СтрокаВыборки = СтрокаВыборки + ФорматнаяСтрока + Символы.ПС;
	КонецЦикла;
	Возврат СтрокаВыборки;
КонецФункции

Функция ПолучитьОбразование(ссылка)
	запрос = Новый запрос("ВЫБРАТЬ
	|     ФизическиеЛицаОбразование.УчебноеЗаведение,
	|     ФизическиеЛицаОбразование.ГодОкончания
	|ИЗ
	|     Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|ГДЕ
	|     ФизическиеЛицаОбразование.Ссылка = &ссылка");
	запрос.УстановитьПараметр("ссылка", ссылка);
	выборка = запрос.Выполнить().Выбрать();
	результат = "" + Символы.ПС;
	Пока выборка.следующий() Цикл
		результат = результат + "в " + выборка.ГодОкончания + "г. - " + СокрП(выборка.УчебноеЗаведение) + Символы.ПС;
	КонецЦикла;
	Возврат результат;
КонецФункции

Функция ПолучитьСрокКонтракта(ФизЛицо)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрактыИДопСоглашения.Период КАК Период,
	|	КонтрактыИДопСоглашения.ДатаНачала КАК ДатаНачала,
	|	КонтрактыИДопСоглашения.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.КонтрактыИДопСоглашения КАК КонтрактыИДопСоглашения
	|ГДЕ
	|	КонтрактыИДопСоглашения.ФизЛицо = &Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	срок = (Запрос.Выполнить().Выгрузить()[0].ДатаОкончания - Запрос.Выполнить().Выгрузить()[0].ДатаНачала) / (60 * 60 * 24 * 365);
	Если срок = 1 Тогда
		результат = Строка(срок) + " год";
	ИначеЕсли срок > 1 И срок < 5 Тогда
		результат = Строка(срок) + " года";
	ИначеЕсли срок >= 5 Тогда
		результат = Строка(срок) + " лет";
	КонецЕсли;
	Возврат результат;
КонецФункции

Функция ПолучитьРазностьВГодах(Дата1, Дата2)
	срок = Окр((Дата2 - Дата1) / (60 * 60 * 24 * 365),0);//О.Т. Аверсон 14.03.2016 № 949
	Если срок = 1 Тогда
		результат = Строка(срок) + " год";
	ИначеЕсли срок > 1 И срок < 5 Тогда
		результат = Строка(срок) + " года";
	ИначеЕсли срок >= 5 Тогда
		результат = Строка(срок) + " лет";
	КонецЕсли;
	Возврат результат;
КонецФункции

Функция ПолучитьРазностьВГодахЧислом(Дата1, Дата2)
	срок = Окр((Дата2 - Дата1) / (60 * 60 * 24 * 365), 0);//О.Т. Аверсон 14.03.2016 № 949
	Возврат срок;
КонецФункции

Функция ДатыКонтрактаНаДату(ФизЛицо, дата)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтрактыИДопСоглашения.Период КАК Период,
	|	КонтрактыИДопСоглашения.ДатаНачала КАК ДатаНачала,
	|	КонтрактыИДопСоглашения.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.КонтрактыИДопСоглашения.СрезПоследних(&дата, ) КАК КонтрактыИДопСоглашения
	|ГДЕ
	|	КонтрактыИДопСоглашения.ФизЛицо = &Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	Запрос.УстановитьПараметр("дата", дата);
	Возврат "с " + Формат(Запрос.Выполнить().Выгрузить()[0].ДатаНачала, "ДФ=dd.MM.yyyy") + " по  " + Формат(Запрос.Выполнить().Выгрузить()[0].ДатаОкончания, "ДФ=dd.MM.yyyy");
КонецФункции

Функция ПолучитьСписокЯзыков(ссылка)
	результат = "";
	Для каждого строка Из ссылка Цикл
		результат = результат + строка.язык.Наименование + Символы.ПС;
	КонецЦикла;
	Возврат результат;
КонецФункции

Функция ПолучитьПредыдущееФИО(ФизЛицо, типданных = 0)
	запрос = Новый запрос("ВЫБРАТЬ разрешенные ПЕРВЫЕ 1
	|   фиофизлиц.период
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц КАК фиофизлиц
	|ГДЕ
	|	фиофизлиц.Период > &Период
	|	И фиофизлиц.ФизЛицо = &физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	фиофизлиц.Период УБЫВ");
	
	запрос.УстановитьПараметр("физлицо", ФизЛицо);
	запрос.УстановитьПараметр("период", Дата(1, 1, 1));
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() И типданных = 0 Тогда
		запрос.текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	фиофизлиц.Фамилия КАК Фамилия
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц КАК фиофизлиц
		|ГДЕ
		|	фиофизлиц.Период < &Период
		|	И фиофизлиц.ФизЛицо = &физлицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		запрос.УстановитьПараметр("период", выборка.период);
		запрос.УстановитьПараметр("физлицо", ФизЛицо);
		выборка = запрос.выполнить().выбрать();
		Если выборка.Следующий() Тогда
			Возврат выборка.фамилия;
		Иначе Возврат "";
		КонецЕсли;
	Иначе Возврат выборка.период;
	КонецЕсли;
КонецФункции

Функция ПолучитьОрганизацию(ФизЛицо, дата)
	Если дата = Неопределено Тогда
		дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СотрудникиОрганизацииСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Дата, Физлицо = &Физлицо) КАК СотрудникиОрганизацииСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникиОрганизацииСрезПоследних.Период УБЫВ");
	
	Запрос.УстановитьПараметр("Дата", дата);
	Запрос.УстановитьПараметр("Физлицо", ФизЛицо);
	
	выборка = Запрос.Выполнить().выбрать();
	Если выборка.следующий() Тогда
		Возврат выборка.организация;
	Иначе Возврат "";
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьИнфоРебенка(физлицо) Экспорт
	форма = Справочники.ФизическиеЛица.ПолучитьФорму("ФормаВыбораРебенка");
	форма.РежимВыбора = Истина;
	форма.справочникобъект = физлицо.получитьобъект();
	Возврат форма.ОткрытьМодально();
	
	
	
	
КонецФункции

Функция ПолучитьПодписанта(Организация, Номер)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДолжносныеЛица.ФизЛицо
	|ИЗ
	|	РегистрСведений.ДолжносныеЛица КАК ДолжносныеЛица
	|ГДЕ
	|	ДолжносныеЛица.Организация = &Организация
	|	И ДолжносныеЛица.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номер", Номер);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Возврат Результат.Выгрузить()[0].ФизЛицо;
	КонецЕсли;
КонецФункции

Функция ПолучитьДолжностьПодписанта(Организация, Номер)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДолжносныеЛица.Должность
	|ИЗ
	|	РегистрСведений.ДолжносныеЛица КАК ДолжносныеЛица
	|ГДЕ
	|	ДолжносныеЛица.Организация = &Организация
	|	И ДолжносныеЛица.Номер = &Номер");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номер", Номер);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.Должности.ПустаяСсылка();
	Иначе
		Возврат Результат.Выгрузить()[0].Должность;
	КонецЕсли;
КонецФункции

Функция ПолучитьНомерСтрокиТабличнойЧасти(ТабличнаяЧасть, НомерСтроки)
	Возврат ?(ОбъектВладелец[ТабличнаяЧасть].Количество() > 1, "" + НомерСтроки + ". ", "");
КонецФункции

Функция ПолучитьСтаж(ФизЛицо, ВидСтажа)
	Перем ВидСтажаПарам;
	ВидСтажаПарам = Справочники.ВидыСтажа.НайтиПоКоду(ВидСтажа);
	Если ВидСтажаПарам = Справочники.ВидыСтажа.ПустаяСсылка() Тогда
		Возврат "";
	КонецЕсли;
	запрос = Новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МИНИМУМ(ФизическиеЛицаСтажи.ДатаНачала) КАК ДатаНачала
	|ИЗ
	|	Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
	|ГДЕ
	|	ФизическиеЛицаСтажи.Ссылка = &ссылка
	|	И ФизическиеЛицаСтажи.ВидСтажа = &ВидСтажа");
	запрос.УстановитьПараметр("ссылка", ФизЛицо);
	запрос.УстановитьПараметр("ВидСтажа", ВидСтажаПарам);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		Возврат Формат(выборка[0], "ДФ=dd.MM.yyyy");
	Иначе Возврат "";
	КонецЕсли;
КонецФункции

Функция ВыбратьЗначение(Строка, Заголовок = "")
	Форма = ПолучитьФорму("ФормаСлужебная");
	Форма.Заголовок = Заголовок;
	ПолеСписка = Форма.ПолеСписка;
	Строка = СтрЗаменить(Строка, ",", Символы.ПС);
	Для Инд = 1 По СтрЧислоСтрок(Строка) Цикл
		ПолеСписка.Добавить(СтрПолучитьСтроку(Строка, Инд));
	КонецЦикла;
	Возврат Форма.ОткрытьМодально();
КонецФункции

Функция ПолучитьИзСтандартногоСписка(СтандартныйНабор) Экспорт
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Возврат "";
	КонецЕсли;
	Результат = "";
	
	
	Попытка
		Если СтандартныйНабор = "Реквизит..." Тогда
			Результат = "";
		ИначеЕсли СтандартныйНабор = "<Нет>" Тогда
			Результат = "";
			
			
		ИначеЕсли СтандартныйНабор = "Счет организации" Тогда
			
			Результат = СокрЛП(?(ЗначениеЗаполнено(ОбъектВладелец.СчетОрганизации.НомерСчета), ОбъектВладелец.СчетОрганизации.НомерСчета, ОбъектВладелец.СчетОрганизации.IBAN));
			
		ИначеЕсли СтандартныйНабор = "Организация наименование англискои" Тогда
			
			Результат = СокрЛП(ОбъектВладелец.Организация.НаименованиеАНГЛ);
			
		ИначеЕсли СтандартныйНабор = "Сумма целое" Тогда
			
			Результат = Цел(ОбъектВладелец.СуммаДокумента);
			
		ИначеЕсли СтандартныйНабор = "Сумма дробь" Тогда
			
			Дробь = Строка(ОбъектВладелец.СуммаДокумента - Цел(ОбъектВладелец.СуммаДокумента));
			Пока Цел(Дробь) <> Дробь Цикл
				Дробь = Дробь * 10;
			КонецЦикла;
			
			Результат = Дробь;
			
			
		ИначеЕсли СтандартныйНабор = "Код валюты" Тогда
			
			Результат = ?(Строка(ОбъектВладелец.ВалютаДокумента.Наименование) = "грн", "UAH", Строка(ОбъектВладелец.ВалютаДокумента.Наименование));
			
		ИначеЕсли СтандартныйНабор = "Назначение платежа" Тогда
			
			Результат = СокрЛП(СтрЗаменить(ОбъектВладелец.НазначениеПлатежа, Символы.ПС, " "));
			
			
		ИначеЕсли СтандартныйНабор = "Дата день" Тогда
			
			Результат = ?(ЗначениеЗаполнено(ОбъектВладелец.Дата), Формат(ОбъектВладелец.Дата, "ДФ=dd"), Формат(ОбъектВладелец.ДатаВыписки, "ДФ=dd"));
			
		ИначеЕсли СтандартныйНабор = "Дата месяць" Тогда
			
			Результат = ?(ЗначениеЗаполнено(ОбъектВладелец.Дата), Формат(ОбъектВладелец.Дата, "ДФ=MM"), Формат(ОбъектВладелец.ДатаВыписки, "ДФ=MM"));
			
		ИначеЕсли СтандартныйНабор = "Дата год" Тогда
			
			Результат = ?(ЗначениеЗаполнено(ОбъектВладелец.Дата), Формат(ОбъектВладелец.Дата, "ДФ=yyyy"), Формат(ОбъектВладелец.ДатаВыписки, "ДФ=yyyy"));
			
		ИначеЕсли СтандартныйНабор = "Дата выписки день" Тогда
			
			Результат = Формат(ОбъектВладелец.ДатаВыписки, "ДФ=dd");
			
		ИначеЕсли СтандартныйНабор = "Дата выписки месяць" Тогда
			
			Результат = Формат(ОбъектВладелец.ДатаВыписки, "ДФ=MM");
			
		ИначеЕсли СтандартныйНабор = "Дата выписки год" Тогда
			
			Результат = Формат(ОбъектВладелец.ДатаВыписки, "ДФ=yyyy");
			
		ИначеЕсли СтандартныйНабор = "Банк получателя" Тогда
			
			Результат = СокрЛП(ОбъектВладелец.СчетКонтрагента.Банк.Наименование);
			
		ИначеЕсли СтандартныйНабор = "Банк получателя SWIFT" Тогда
			
			Результат = СокрЛП(ОбъектВладелец.СчетКонтрагента.Банк.SWIFT);
			
			
		КонецЕсли;
	Исключение
		Результат = "";
		Сообщить("Неверно задан путь к данным");
	КонецПопытки;
	
	
	Возврат Результат;
КонецФункции

Процедура ПередЗаписью(Отказ)
	Если Не глПередЗаписьюСправочника(ЭтотОбъект) Тогда
		Сообщить("Такой элемент уже есть!!!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

Функция СклонениеОкончания(Фраза)//Островская Татьяна 11.12.2013 
	если фраза = 1 Тогда 
		Возврат 1;
	ИначеЕсли Фраза > 1 и Фраза< 5 Тогда 
		Возврат 2;
	иначе
		Возврат 3;
	КонецЕсли; 
КонецФункции

Функция СклонениеКаледнарныхДней(КолвоОсн)
	//Аверсон 20.02.2020 КВВ СВФР-005452 (
	Если Число(Прав(КолвоОсн,1)) = 1 И КолвоОсн <> 11 Тогда 				
		СклонОсн = "календарный день";
	ИначеЕсли Число(Прав(КолвоОсн,1)) >1 и Число(Прав(КолвоОсн,1))<5 Тогда  
		СклонОсн = "календарных дня";
	иначе                                                                   
		СклонОсн = "календарных дней";
	КонецЕсли;
	Возврат СклонОсн;
	//Аверсон 20.02.2020 КВВ СВФР-005452 )
КонецФункции

Функция ПолучитьСтруктуруСклонения(ЧислоПрописью)
	//Аверсон 20.02.2020 КВВ СВФР-005452 (
	ЧислоПрописью = СокрЛП(ЧислоПрописью);
	
	ПадежРодительный = новый структура;
	ПадежРодительный.Вставить("Один","Одного");
	ПадежРодительный.Вставить("Два","Двух");
	ПадежРодительный.Вставить("Три","Трех");
	ПадежРодительный.Вставить("Четыре","Четырех");
	ПадежРодительный.Вставить("Пять","Пяти");
	ПадежРодительный.Вставить("Шесть","Шести");
	ПадежРодительный.Вставить("Семь","Семи");
	ПадежРодительный.Вставить("Восемь","Восьми");
	ПадежРодительный.Вставить("Девять","Девяти");
	ПадежРодительный.Вставить("Десять","Десяти");
	ПадежРодительный.Вставить("Одиннадцать","Одиннадцати");
	ПадежРодительный.Вставить("Двенадцать","Двенадцати");
	ПадежРодительный.Вставить("Тринадцать","Тринадцати");
	ПадежРодительный.Вставить("Четырнадцать","Четырнадцати");
	ПадежРодительный.Вставить("Пятнадцать","Пятнадцати");
	ПадежРодительный.Вставить("Шестнадцать","Шестнадцати");
	ПадежРодительный.Вставить("Семнадцать","Семнадцати");
	ПадежРодительный.Вставить("Восемнадцать","Восемнадцати");
	ПадежРодительный.Вставить("Девятнадцать","Девятнадцати");
	ПадежРодительный.Вставить("Двадцать","Двадцати");
	ПадежРодительный.Вставить("Тридцать","Тридцати");
	ПадежРодительный.Вставить("Сорок","Сорока");
	ПадежРодительный.Вставить("Пятьдесят","Пятидесяти");
	ПадежРодительный.Вставить("Шестьдесят","Шестидесяти");
	ПадежРодительный.Вставить("Семьдесят","Семидесяти");
	ПадежРодительный.Вставить("Восемьдесят","Восьмидесяти");
	ПадежРодительный.Вставить("Девяносто","Девятоста");
	ПадежРодительный.Вставить("Сто","Ста");
	ПадежРодительный.Вставить("Двести","Двухсот");
	ПадежРодительный.Вставить("Триста","Трехсот");
	ПадежРодительный.Вставить("Четыреста","Четырехсот");
	ПадежРодительный.Вставить("Пятьсот","Пятисот");
	ПадежРодительный.Вставить("Шестьсот","Шестисот");
	ПадежРодительный.Вставить("Семьсот","Семисот");
	ПадежРодительный.Вставить("Восемьсот","Восьмисот");
	ПадежРодительный.Вставить("Девятьсот","Девятисот");
	ПадежРодительный.Вставить("Тысяча","Тысячи");
	ПадежРодительный.Вставить("Одна","Одной");
	ПадежРодительный.Вставить("Две","Двух");
	ПадежРодительный.Вставить("Тысяч","Тысяч");
	ПадежРодительный.Вставить("Тысячи","Тысяч");
	
	
	МассивСлов = новый массив;
	готово = ложь;
	ПервоеСлово = Истина;
	НовоеСлово = "";
	Перваябуква = "";
	Вырезка= "";
	ВернутьОшибка = ЧислоПрописью;
	Пока НЕ Готово Цикл
		НайденноеЗначение = "";
		НайденныйПробел = Найти(ЧислоПрописью," ");
		Если НайденныйПробел = 0 Тогда
			Если ПервоеСлово Тогда
				Если ПадежРодительный.Свойство(ЧислоПрописью, НайденноеЗначение) Тогда
					Возврат НайденноеЗначение;
				Иначе
					Возврат ВернутьОшибка;
				КонецЕсли;
			Иначе
				Вырезка = СокрЛП(ЧислоПрописью);
				Перваябуква = Врег(ЛЕВ(Вырезка,1));
				ЧислоПрописью = Перваябуква + Прав(Вырезка,СтрДлина(Вырезка)-1);
				
				Если ПадежРодительный.Свойство(ЧислоПрописью, НайденноеЗначение) Тогда
					НайденноеЗначение = НРЕГ(НайденноеЗначение);
					НовоеСлово = НовоеСлово + НайденноеЗначение + " ";
					Возврат сОКРлп(НовоеСлово);
				Иначе
					Возврат ВернутьОшибка;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Вырезка = СокрЛП(ЛЕВ(ЧислоПрописью,НайденныйПробел));
			Перваябуква = Врег(ЛЕВ(Вырезка,1));
			Вырезка = Перваябуква + Прав(Вырезка,СтрДлина(Вырезка)-1);
			Если ПадежРодительный.Свойство(Вырезка, НайденноеЗначение) Тогда
				Если ПервоеСлово Тогда
					НовоеСлово = НовоеСлово + НайденноеЗначение + " ";
					первоеСлово = Ложь;
					ЧислоПрописью = СокрЛП(Прав(ЧислоПрописью,СтрДлина(ЧислоПрописью)-НайденныйПробел));
				Иначе
					НовоеСлово = НовоеСлово + НРЕГ(НайденноеЗначение) + " ";
					ЧислоПрописью = СокрЛП(Прав(ЧислоПрописью,СтрДлина(ЧислоПрописью)-НайденныйПробел));
					
				КонецЕсли;
			Иначе
				Возврат ВернутьОшибка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	//Аверсон 20.02.2020 КВВ СВФР-005452 )	
КонецФункции

Функция ПолучитьТрудовойДоговорСотрудника(Сотр,ДатаДок)
	//Аверсон 22.02.2020 КВВ СВФР-005452 (
	ДокДог = Документы.ТрудовойДоговор.ПустаяСсылка();
	З = Новый Запрос;
	З.Текст = 
	"ВЫБРАТЬ
	|ТрудовыеДоговораСрезПоследних.Регистратор
	|ИЗ РегистрСведений.ТрудовыеДоговора.СрезПоследних(&ДатаДок, ) КАК ТрудовыеДоговораСрезПоследних
	|ГДЕ ТрудовыеДоговораСрезПоследних.Сотрудник = &Сотр";
	З.УстановитьПараметр("Сотр",Сотр);
	З.УстановитьПараметр("ДатаДок",ДатаДок);
	РезЗ = З.Выполнить().Выбрать();
	Пока РезЗ.Следующий() Цикл
		ДокДог = РезЗ.Регистратор;
	КонецЦикла;
	Возврат ДокДог;
	//Аверсон 22.02.2020 КВВ СВФР-005452 )
КонецФункции

СписокСтандартныхПараметров = Новый СписокЗначений;
СписокСтандартныхПараметров.Добавить("<Нет>");
СписокСтандартныхПараметров.Добавить("Реквизит...");
СписокСтандартныхПараметров.Добавить("Счет организации");
СписокСтандартныхПараметров.Добавить("Организация наименование англискои");
СписокСтандартныхПараметров.Добавить("Сумма целое");
СписокСтандартныхПараметров.Добавить("Сумма дробь");
СписокСтандартныхПараметров.Добавить("Код валюты");
СписокСтандартныхПараметров.Добавить("Назначение платежа");
СписокСтандартныхПараметров.Добавить("Дата день");




