Функция СокращенныеЧасыВДате(Сотрудник,ДатаПроверки) Экспорт
	ТЗДат = СокращенныеЧасыВМесяце(НачалоМесяца(ДатаПроверки));
	Строки = ТЗДат.НайтиСтроки(Новый Структура("Сотрудник, Период", Сотрудник, ДатаПроверки));
	Если  Строки.Количество()>0 Тогда
		Возврат Строки[0].КоличествоЧасов;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции

Функция СокращенныеЧасыВМесяце(Месяц) Экспорт
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ  Сотрудник, Период,
	|СокращенныеДни.КоличествоЧасов
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ НачалоПериода(СокращенныеДни.Период, Месяц) = &Период";
	З.УстановитьПараметр("Период",Месяц);
	Возврат  З.Выполнить().Выгрузить();
КонецФункции	

Функция ПроверкаСокращенныхДнейВМесяце(Сотрудник,Месяц) Экспорт
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|СокращенныеДни.Регистратор
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ СокращенныеДни.Сотрудник = &Сотрудник
	|И СокращенныеДни.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период,МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период,МЕСЯЦ)";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("Период",Месяц);
	РезЗ = З.Выполнить().Выгрузить();
	ЕстьСокращ = ?(РезЗ.Количество()=0,Ложь,Истина);
	Возврат ЕстьСокращ;
КонецФункции

Функция ПроверкаСокращенныхДнейВПериод(Сотрудник,Период) Экспорт
	//СВЭЙ 29.09.2023 КВВ СВФР-011538 (
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ 
	|СокращенныеДни.Регистратор
	|ИЗ РегистрСведений.СокращенныеДниРаботниковОрганизации КАК СокращенныеДни
	|ГДЕ СокращенныеДни.Сотрудник = &Сотрудник
	|И НАЧАЛОПЕРИОДА(СокращенныеДни.Период,ДЕНЬ)= &Период";
	З.УстановитьПараметр("Сотрудник",Сотрудник);
	З.УстановитьПараметр("Период",Период);
	РезЗ = З.Выполнить().Выгрузить();
	ЕстьСокращ = ?(РезЗ.Количество()=0,Ложь,Истина);
	Возврат ЕстьСокращ;
	//СВЭЙ 29.09.2023 КВВ СВФР-011538 )
КонецФункции

Функция ПолучитьГрафикиПоСотрудникам(Сотрудник, ПериодРегистрации) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Месяц,
	|	ГрафикиРаботыПоВидамВремени.План,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение КАК ОснЗначение,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК ДопЗначение,
	|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
	|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
	|	ГрафикиРаботыПоВидамВремени.ВидВремени КАК ВидВремени
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.План 
	|	И ГрафикиРаботыПоВидамВремени.Месяц = &Месяц
	|	И ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение <> 0
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени <> &ВидУчетаВремени";
	
	Запрос.УстановитьПараметр("ГрафикРаботы", Сотрудник);
	
	Запрос.УстановитьПараметр("Месяц",ПериодРегистрации);
	Запрос.УстановитьПараметр("ВидУчетаВремени",Перечисления.ВидыУчетаВремени.ПоДням);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
КонецФункции

Функция ВидДняКалендаря(Дата) Экспорт
	ВидДня = Неопределено;
	запросПраздники = Новый Запрос;
	запросПраздники.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.Год,
	|	РегламентированныйПроизводственныйКалендарь.Пятидневка,
	|	РегламентированныйПроизводственныйКалендарь.Шестидневка,
	|	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря";
	запросПраздники.УстановитьПараметр("ДатаКалендаря",Дата);
	РезПраздники = запросПраздники.Выполнить().Выбрать();
	Если РезПраздники.Следующий() Тогда
		Возврат  РезПраздники.ВидДня;
	КонецЕсли;
КонецФункции	

Функция ПолучитьСтавкуСотрудника(Период, Сотрудник) Экспорт
	Возврат РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период,Новый Структура("Сотрудник",Сотрудник)).ЗанимаемыхСтавок;//О.Т. Аверсон 06.12.2017 № 1322
КонецФункции

//Функция СтавкиСотрудников(Период) Экспорт
//	Возврат РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Период,Новый Структура("Сотрудник",Сотрудник)).ЗанимаемыхСтавок;//О.Т. Аверсон 06.12.2017 № 1322
//	
//КонецФункции


Функция ПолучитьНормуПоГрафику(парамНачало, парамКонец, Сотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК НормаЧасов,
	|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК НормаДней,
	|	ГрафикиРаботыПоВидамВремени.Дата
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &парамНачало И &парамКонец
	|	И ГрафикиРаботыПоВидамВремени.План
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботыПоВидамВремени.Дата";
	
	Запрос.УстановитьПараметр("парамНачало", парамНачало);
	Запрос.УстановитьПараметр("парамКонец", парамКонец);
	//мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(парамНачало),
	//	Новый Структура("Организация, Сотрудник", Справочники.Организации.НайтиПоКоду("000000001"), Сотрудник));
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецДня(парамКонец),// О.Т. 21.11.2014 293
	Новый Структура("Организация, Сотрудник", Сотрудник.Организация, Сотрудник));
	Запрос.УстановитьПараметр("Сотрудник", мСтрока.ГрафикРаботы);
	мРезультат = Запрос.Выполнить().Выгрузить();
	Возврат мРезультат;
	
КонецФункции

