Перем мМакет, ПараметрыНормыЧасов, ТаблицаПовышений, ТаблицаНадбавок, мНомер;
Перем ФондЗПИтог, СтавокИтог, ТарифнаяСтавкаИтог, ТарифнаяСтавкаРазрядИтог, СтавкаИтог, ЗаСложностьИтог;
Перем ФондЗПИтогПоПредпр, СтавокИтогПоПредпр, ТарифнаяСтавкаИтогПоПредпр, ТарифнаяСтавкаРазрядИтогПоПредпр, СтавкаИтогПоПредпр, ЗаСложностьИтогПоПредпр;
Перем ТекПодр, ТЗ_ТаблицаПовышенийОр, ТЗ_ТарифныеСтавки;
Перем СтавкаПервогоОсновная, СреднКолЧасов;
Перем ТЗ_ПоПредприятию, ТЗ_ПоПодразделению, ТаблицаВакантно, ТЗ_Декретницы;

#Если Клиент Тогда

//функция выводит свободные штатные единицы
//
Функция СформироватьЗапросПоВакантно(СписокВидовРасчета)
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|    ВакантныеСтавки.ПодразделениеОрганизации,
	|    ВакантныеСтавки.Должность,
	|    ВакантныеСтавки.Свободно,
	|    ВакантныеСтавки.ЗанимаемыхСтавокПоШтатному,
	|    ВакантныеСтавки.ЗанимаемыхСтавокФакт,
	|    МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда) КАК РазмерСтавки1Разряда,
	|    ВакантныеСтавки.РазрядЕТС,
	|    ВакантныеСтавки.КоэффициентЕТС,
	|    ВакантныеСтавки.ПовышенныйКоэффициентЕТС
	|ИЗ
	|    (ВЫБРАТЬ
	|        ШтатноеРасписание.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|        ШтатноеРасписание.Должность КАК Должность,
	|        СУММА(ШтатноеРасписание.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавокПоШтатному,
	|        СУММА(РаботникиФакт.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавокФакт,
	|        СУММА(ШтатноеРасписание.ЗанимаемыхСтавок - ЕСТЬNULL(РаботникиФакт.ЗанимаемыхСтавок, 0)) КАК Свободно,
	|        ШтатноеРасписание.РазрядЕТС КАК РазрядЕТС,
	|        ШтатноеРасписание.КоэффициентЕТС КАК КоэффициентЕТС,
	|        ШтатноеРасписание.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС
	|    ИЗ
	|        (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Должность,
	|            СУММА(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС КАК РазрядЕТС,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС КАК КоэффициентЕТС,
	|            ВЫБОР 
	|				КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС = 0 
	|					ТОГДА 1
	|					ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС 
	|				КОНЕЦ КАК ПовышенныйКоэффициентЕТС
	|        ИЗ
	|            РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
	|        ГДЕ
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
	|            И НЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
	|        
	|        СГРУППИРОВАТЬ ПО
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
	|            ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС) КАК ШтатноеРасписание
	|            ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|                СУММА(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
	|                РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|                РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	|                РаботникиОрганизацийСрезПоследних.РазрядЕТС КАК РазрядЕТС,
	|                РаботникиОрганизацийСрезПоследних.КоэффициентЕТС КАК КоэффициентЕТС,
	|                ВЫБОР 
	|				      КОГДА РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС = 0 
	|				    	ТОГДА 1
	|				    	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС 
	|				      КОНЕЦ КАК ПовышенныйКоэффициентЕТС
    |            ИЗ
	|                РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	|            ГДЕ
	|                РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
	|                И (НЕ РаботникиОрганизацийСрезПоследних.Сотрудник В
	|                            (ВЫБРАТЬ
	|                                РаботникиОрганизаций.Сотрудник
	|                            ИЗ
	|                                РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|                                    ПО
	|                                        РаботникиОрганизаций.Организация = СостояниеРаботниковОрганизаций.Организация
	|                                            И РаботникиОрганизаций.Сотрудник = СостояниеРаботниковОрганизаций.Сотрудник
	|                            ГДЕ
	|                                СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
	|                                И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения))
	|            
	|            СГРУППИРОВАТЬ ПО
	|                РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
	|                РаботникиОрганизацийСрезПоследних.Должность,
	|                 РаботникиОрганизацийСрезПоследних.РазрядЕТС,
	|                РаботникиОрганизацийСрезПоследних.КоэффициентЕТС,
	|                РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС) КАК РаботникиФакт
	|            ПО ШтатноеРасписание.ПодразделениеОрганизации = РаботникиФакт.ПодразделениеОрганизации
	|                И ШтатноеРасписание.Должность = РаботникиФакт.Должность
	|                И ШтатноеРасписание.РазрядЕТС = РаботникиФакт.РазрядЕТС
	|                И ШтатноеРасписание.КоэффициентЕТС = РаботникиФакт.КоэффициентЕТС
	|                И ШтатноеРасписание.ПовышенныйКоэффициентЕТС = РаботникиФакт.ПовышенныйКоэффициентЕТС
	|    
	|    СГРУППИРОВАТЬ ПО
	|        ШтатноеРасписание.ПодразделениеОрганизации,
	|        ШтатноеРасписание.Должность,
	|        ШтатноеРасписание.РазрядЕТС,
	|        ШтатноеРасписание.КоэффициентЕТС,
	|        ШтатноеРасписание.ПовышенныйКоэффициентЕТС) КАК ВакантныеСтавки
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
	|        ПО ВакантныеСтавки.ПодразделениеОрганизации = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации
	|            И (ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор.Организация = &Организация)
	|            И ВакантныеСтавки.Должность = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность
	|            И ВакантныеСтавки.РазрядЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС
	|            И ВакантныеСтавки.КоэффициентЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС
	|            И ВакантныеСтавки.ПовышенныйКоэффициентЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС
	|ГДЕ
	|    ВакантныеСтавки.Свободно > 0
	|
	|СГРУППИРОВАТЬ ПО
	|    ВакантныеСтавки.РазрядЕТС,
	|    ВакантныеСтавки.ПодразделениеОрганизации,
	|    ВакантныеСтавки.Должность,
	|    ВакантныеСтавки.Свободно,
	|    ВакантныеСтавки.ЗанимаемыхСтавокПоШтатному,
	|    ВакантныеСтавки.ЗанимаемыхСтавокФакт,
	|    ВакантныеСтавки.КоэффициентЕТС,
	|    ВакантныеСтавки.ПовышенныйКоэффициентЕТС";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ДатаАктуальности);
	Запрос.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация","ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции

//запрос по декретницам
//
Функция СформироватьЗапросПоДекретницам()
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РаботникиОрганизаций.Сотрудник,
	               |	РаботникиОрганизаций.Должность,
	               |	РаботникиОрганизаций.РазрядЕТС,
	               |	РаботникиОрганизаций.КоэффициентЕТС,
	               |	РаботникиОрганизаций.ПовышенныйКоэффициентЕТС,
	               |	РаботникиОрганизаций.ЗанимаемыхСтавок,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ПроцентПоКонтракту,
	               |	РаботникиОрганизаций.ПодразделениеОрганизации,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции
	               |ИЗ
	               |	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	               |		ПО РаботникиОрганизаций.Организация = СостояниеРаботниковОрганизаций.Организация
	               |			И РаботникиОрганизаций.Сотрудник = СостояниеРаботниковОрганизаций.Сотрудник
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
	               |		ПО РаботникиОрганизаций.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	               |		ПО РаботникиОрганизаций.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	               |ГДЕ
	               |	СостояниеРаботниковОрганизаций.Состояние В(&Состояние)
	               |	И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения
	               |	И РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация
	               |	И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
	               |	И ПлановыеНачисленияРаботниковОрганизаций.Организация = &Организация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаботникиОрганизаций.Сотрудник,
	               |	РаботникиОрганизаций.Должность,
	               |	РаботникиОрганизаций.РазрядЕТС,
	               |	РаботникиОрганизаций.КоэффициентЕТС,
	               |	РаботникиОрганизаций.ПовышенныйКоэффициентЕТС,
	               |	РаботникиОрганизаций.ЗанимаемыхСтавок,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ПроцентПоКонтракту,
	               |	РаботникиОрганизаций.ПодразделениеОрганизации,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка,
	               |	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ДатаАктуальности);
	СписокВидовРасчета = Новый СписокЗначений;
	СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	СписокВидовРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата);
	Запрос.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И РаботникиОрганизаций.ПодразделениеОрганизации.Владелец = &Организация","И РаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
КонецФункции

Процедура ЗаполнимВременнуюТаблицу(ВременнаяТЗ, ВыборкаСтрок, ТаблицаВакантно)
	
	Пока ВыборкаСтрок.Следующий() Цикл 
		
		НоваяСтрока = ВременнаяТЗ.Добавить();
		НоваяСтрока.Подразделение          = ВыборкаСтрок.ПодразделениеОрганизации;
		НоваяСтрока.ПриоритетПодразделение = ВыборкаСтрок.ПодразделениеОрганизацииПриоритет;
		Если ЗначениеЗаполнено(ВыборкаСтрок.Должность) Тогда
			НоваяСтрока.Должность              = ВыборкаСтрок.Должность;
			НоваяСтрока.ПриоритетДолжность     = ВыборкаСтрок.ДолжностьПриоритет;
			НоваяСтрока.РазмерСтавки1Разряда   = ВыборкаСтрок.РазмерСтавки1Разряда;
			НоваяСтрока.РазрядЕТС              = СокрЛП(ВыборкаСтрок.РазрядЕТС);
			НоваяСтрока.ЗанимаемыхСтавок       = ВыборкаСтрок.ЗанимаемыхСтавок;
			НоваяСтрока.КоэффициентЕТС         = ВыборкаСтрок.КоэффициентЕТС;
			НоваяСтрока.ПовышенныйКоэффициентЕТС = ВыборкаСтрок.ПовышенныйКоэффициентЕТС;
			Если Факт Тогда
				ПараметрыСтавки = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
				Новый Структура("Организация, ТарифнаяСтавка", ВыборкаСтрок.ПодразделениеОрганизации.Владелец, ВыборкаСтрок.РазмерСтавки1Разряда));
				СтавкаПервого = ПараметрыСтавки.Размер;
			Иначе	
				СтавкаПервого = ВыборкаСтрок.РазмерСтавки1Разряда;
			КонецЕсли;
			мТарифнаяСтавкаРазряд = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаСтрок.КоэффициентЕТС * СтавкаПервого * ВыборкаСтрок.ЗанимаемыхСтавок,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			НоваяСтрока.ТарифнаяСтавкаРазряд   = мТарифнаяСтавкаРазряд;
			НоваяСтрока.ПроцентПоКонтракту     = ВыборкаСтрок.ПроцентПоКонтракту;
			НоваяСтрока.Ставка                 = ВыборкаСтрок.Ставка;
			НоваяСтрока.ФондЗП                 = ВыборкаСтрок.Ставка;
			НоваяСтрока.Сотрудник              = ВыборкаСтрок.Сотрудник;
			Если (РольДоступна("ОК")) и Факт Тогда
				НоваяСтрока.СотрудникЗаменяемый = ВыборкаСтрок.СотрудникЗаменяемый;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	//добавим вакантные ставки
	ВременнаяТЗ.Колонки.Добавить("Декретница", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	Для Каждого ТекСтрокаВакантно Из ТаблицаВакантно Цикл
		
		ЗанимаемыхСтавокДекрет = 0;
		
		РазрядЕТС = СокрЛП(ТекСтрокаВакантно.РазрядЕТС);
		Пока СтрДлина(РазрядЕТС) < 4 Цикл
			РазрядЕТС = РазрядЕТС + " "; 
		КонецЦикла;
		
		НайтиСтроки = ТЗ_Декретницы.НайтиСтроки(Новый Структура("ПодразделениеОрганизации, Должность, РазрядЕТС", ТекСтрокаВакантно.ПодразделениеОрганизации, ТекСтрокаВакантно.Должность, РазрядЕТС));
		Если НайтиСтроки = Неопределено Тогда	
		Иначе
			Для Каждого ТекСтрокаД Из НайтиСтроки Цикл
				НоваяСтрока = ВременнаяТЗ.Добавить();
				НоваяСтрока.Подразделение          = ТекСтрокаВакантно.ПодразделениеОрганизации;
				НоваяСтрока.ПриоритетПодразделение = ТекСтрокаВакантно.ПодразделениеОрганизации.Приоритет;
				НоваяСтрока.Должность              = ТекСтрокаВакантно.Должность;
				НоваяСтрока.ПриоритетДолжность     = ТекСтрокаВакантно.Должность.Приоритет;
				НоваяСтрока.РазмерСтавки1Разряда   = ТекСтрокаВакантно.РазмерСтавки1Разряда;
				НоваяСтрока.РазрядЕТС              = СокрЛП(ТекСтрокаВакантно.РазрядЕТС);
				НоваяСтрока.ЗанимаемыхСтавок       = ТекСтрокаД.ЗанимаемыхСтавок;
				НоваяСтрока.КоэффициентЕТС         = ТекСтрокаВакантно.КоэффициентЕТС;	
				
				ПроцентПовышенияИтог = 0;
				Для Каждого СтрТЗ из ТЗ_ТаблицаПовышенийОр Цикл
					ПроцентПровышения = "";
					НайденнаяСтр = ТаблицаПовышений.НайтиСтроки(Новый Структура("Сотрудник, Коэффициент", ТекСтрокаД.Сотрудник, СтрТЗ.Коэффициент));
					Если НайденнаяСтр.Количество() = 0 Тогда
					Иначе
						ПроцентПовышенияИтог = ПроцентПовышенияИтог + НайденнаяСтр[0].Размер;
					КонецЕсли;
				КонецЦикла;	
				мТарифнаяСтавкаРазряд = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаВакантно.КоэффициентЕТС * ТекСтрокаВакантно.РазмерСтавки1Разряда * ТекСтрокаД.ПовышенныйКоэффициентЕТС * ТекСтрокаД.ЗанимаемыхСтавок,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
				
				НоваяСтрока.Ставка                 = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавкаРазряд * (1 + (ПроцентПовышенияИтог + ТекСтрокаД.ПроцентПоКонтракту) / 100 ),ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
				НоваяСтрока.ПроцентПоКонтракту     = ТекСтрокаД.ПроцентПоКонтракту;
				НоваяСтрока.Декретница             = ТекСтрокаД.Сотрудник;
				НоваяСтрока.ПовышенныйКоэффициентЕТС = ТекСтрокаД.ПовышенныйКоэффициентЕТС;
                НоваяСтрока.ФондЗП                 = НоваяСтрока.Ставка;

				ЗанимаемыхСтавокДекрет = ЗанимаемыхСтавокДекрет + ТекСтрокаД.ЗанимаемыхСтавок;
			КонецЦикла;
		КонецЕсли;
		
		Если ТекСтрокаВакантно.Свободно - ЗанимаемыхСтавокДекрет = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ВременнаяТЗ.Добавить();
		НоваяСтрока.Подразделение          = ТекСтрокаВакантно.ПодразделениеОрганизации;
		НоваяСтрока.ПриоритетПодразделение = ТекСтрокаВакантно.ПодразделениеОрганизации.Приоритет;
		НоваяСтрока.Должность              = ТекСтрокаВакантно.Должность;
		НоваяСтрока.ПриоритетДолжность     = ТекСтрокаВакантно.Должность.Приоритет;
		НоваяСтрока.РазмерСтавки1Разряда   = ТекСтрокаВакантно.РазмерСтавки1Разряда;
		НоваяСтрока.РазрядЕТС              = ТекСтрокаВакантно.РазрядЕТС;
		НоваяСтрока.ЗанимаемыхСтавок       = ТекСтрокаВакантно.Свободно - ЗанимаемыхСтавокДекрет;
		НоваяСтрока.КоэффициентЕТС         = ТекСтрокаВакантно.КоэффициентЕТС;
		НоваяСтрока.ПовышенныйКоэффициентЕТС = ТекСтрокаВакантно.ПовышенныйКоэффициентЕТС;
		
		мТарифнаяСтавкаРазряд = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаВакантно.КоэффициентЕТС * ТекСтрокаВакантно.РазмерСтавки1Разряда * ?(ТекСтрокаВакантно.ПовышенныйКоэффициентЕТС = 0, 1, ТекСтрокаВакантно.ПовышенныйКоэффициентЕТС) * ТекСтрокаВакантно.Свободно,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
		
		НоваяСтрока.Ставка                 = мТарифнаяСтавкаРазряд;
		НоваяСтрока.ФондЗП                 = мТарифнаяСтавкаРазряд;
		
	КонецЦикла;	
	
	ВременнаяТЗ.Сортировать("ПриоритетПодразделение,Подразделение,ПриоритетДолжность,Должность");
КонецПроцедуры

	
Процедура ВывестиСтрокиПодразделения(ВременнаяТЗ, ДокументРезультат)
	
	Для Каждого ТекСтрокаТЗ Из ВременнаяТЗ Цикл 
		
		Если (ЗначениеЗаполнено(ТекПодр)) и (ТекПодр <> ТекСтрокаТЗ.Подразделение) Тогда
			Если ФондЗПИтог <> 0 или СтавокИтог <> 0 или ТарифнаяСтавкаИтог <> 0 или СтавкаИтог <> 0 или ЗаСложностьИтог <> 0 Тогда 
				
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область1");
				ОбластьДетальныхЗаписей.Параметры.СтавокИтог = СтавокИтог;
				ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавкаРазрядИтог = Формат(ТарифнаяСтавкаРазрядИтог, "ЧДЦ=2");				
				ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавкаИтог = Формат(ТарифнаяСтавкаИтог, "ЧДЦ=2");
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область2");
				Для н = 1 По ТЗ_ТаблицаПовышенийОр.Количество() Цикл
					ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
				КонецЦикла;
				
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область3");
				ОбластьДетальныхЗаписей.Параметры.СтавкаИтог = Формат(СтавкаИтог, "ЧДЦ=2");
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
				
				Если ВидРасчета.Количество() > 0 Тогда
					ТЗ_ПоПодразделению.Свернуть("ВидРасчета", "Сумма");
					Для Каждого ТекСтрока из ТЗ_ПоПодразделению Цикл
						ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область4");
						ОбластьДетальныхЗаписей.Параметры.ЗаСложностьИтог = Формат(ТекСтрока.Сумма, "ЧДЦ=2");
						ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
					КонецЦикла;
				КонецЕсли;
				
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область5");
				ОбластьДетальныхЗаписей.Параметры.ФондЗПИтог = Формат(ФондЗПИтог, "ЧДЦ=2");				
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
				
				Если (РольДоступна("ОК")) и Факт Тогда
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого|Область6");
					ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
				КонецЕсли;	
				
				ФондЗПИтог = 0;
				СтавокИтог = 0;
				ТарифнаяСтавкаИтог = 0;
				СтавкаИтог = 0;
				ЗаСложностьИтог = 0;
				ТарифнаяСтавкаРазрядИтог = 0;
				
				ТЗ_ПоПодразделению = Новый ТаблицаЗначений;
				ТЗ_ПоПодразделению.Колонки.Добавить("ВидРасчета");
				ТЗ_ПоПодразделению.Колонки.Добавить("Сумма");
			КонецЕсли;
		КонецЕсли;
		
		Если ТекПодр <> ТекСтрокаТЗ.Подразделение Тогда
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область1");
			ПодразделениеОрганизацииКод = СокрЛП(ТекСтрокаТЗ.Подразделение.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ТекСтрокаТЗ.Подразделение.Наименование;				
			
			НайденнаяСтр = ТЗ_ТарифныеСтавки.НайтиСтроки(Новый Структура("ПодразделениеОрганизации", ТекСтрокаТЗ.Подразделение));
			
			Если НайденнаяСтр.Количество() = 0 Тогда
			Иначе
				ТС = НайденнаяСтр[0].РазмерСтавки1Разряда;
				Если Факт Тогда
					ПараметрыСтавкиНеОсн = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
					Новый Структура("Организация, ТарифнаяСтавка", ТекСтрокаТЗ.Подразделение.Владелец, ТС));
					СтавкаПервогоНеОсн = ПараметрыСтавкиНеОсн.Размер;
				Иначе 	
					СтавкаПервогоНеОсн = ТС;
				Конецесли;
				стрТС = "";
				Если СтавкаПервогоНеОсн <> СтавкаПервогоОсновная Тогда
					стрТС = "Тарифная ставка первого разряда - " + Формат(СтавкаПервогоНеОсн, "ЧДЦ=2") + " руб.";
				КонецЕсли;
				ОбластьДетальныхЗаписей.Параметры.стрТС = стрТС;				
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область2");
			Для Каждого стрТЗ из ТЗ_ТаблицаПовышенийОр Цикл
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			КонецЦикла;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область3");
			ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			
			Если ВидРасчета.Количество() > 0 Тогда
				Для Каждого ТекСтрока из ВидРасчета Цикл
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область4");
					ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
				КонецЦикла;		
			КонецЕсли;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область5");
			ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			
			Если (РольДоступна("ОК")) и Факт Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1|Область6");
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			КонецЕсли;	
			
		КонецЕсли;
		
		ТекПодр = ТекСтрокаТЗ.Подразделение;
		
		Если ЗначениеЗаполнено(ТекСтрокаТЗ.Должность) Тогда
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область1");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			
			ОбластьДетальныхЗаписей.Параметры.СотрудникНаименование = ?(НЕ ЗначениеЗаполнено(ТекСтрокаТЗ.Декретница), ТекСтрокаТЗ.Сотрудник, ТекСтрокаТЗ.Декретница);				
			
			Если Факт Тогда
				Если ТипЗнч(ТекСтрокаТЗ.РазмерСтавки1Разряда) = Тип("СправочникСсылка.ТарифныеСтавкиПервогоРазряда") Тогда
					ПараметрыСтавки = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
					Новый Структура("Организация, ТарифнаяСтавка", ТекСтрокаТЗ.Подразделение.Владелец, ТекСтрокаТЗ.РазмерСтавки1Разряда));
					СтавкаПервого = ПараметрыСтавки.Размер;
				Иначе
					СтавкаПервого = ТекСтрокаТЗ.РазмерСтавки1Разряда;
				КонецЕсли;
			Иначе
				СтавкаПервого = ТекСтрокаТЗ.РазмерСтавки1Разряда;
			КонецЕсли;
			
			мТарифнаяСтавкаРазряд = ТекСтрокаТЗ.КоэффициентЕТС * СтавкаПервого * ТекСтрокаТЗ.ЗанимаемыхСтавок;
			
			ОбластьДетальныхЗаписей.Параметры.Должность = ТекСтрокаТЗ.Должность;
			мСтрокаТЧ = ТаблицаНадбавок.НайтиСтроки(Новый Структура("Сотрудник, ВидРасчета", ТекСтрокаТЗ.Сотрудник, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаКлассность));
			Если мСтрокаТЧ.Количество() <> 0 Тогда
				Класс = мСтрокаТЧ[0].Показатель;
				Если Класс = 25 Тогда
					ОбластьДетальныхЗаписей.Параметры.РазрядЕТС = "1 класс";
				ИначеЕсли  Класс = 10 Тогда
					ОбластьДетальныхЗаписей.Параметры.РазрядЕТС = "2 класс";
				КонецЕСли;
			Иначе
				Если ТекСтрокаТЗ.Должность.СтрокаЕТС.Наименование = "Водители" Тогда
					ОбластьДетальныхЗаписей.Параметры.РазрядЕТС = "3 класс";
				Иначе
					ОбластьДетальныхЗаписей.Параметры.РазрядЕТС = ТекСтрокаТЗ.РазрядЕТС;
				КонецЕсли;
			КонецЕсли;			
			ОбластьДетальныхЗаписей.Параметры.ЗанимаемыхСтавок = ТекСтрокаТЗ.ЗанимаемыхСтавок;
			ОбластьДетальныхЗаписей.Параметры.КоэффициентЕТС = ТекСтрокаТЗ.КоэффициентЕТС;
			ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавкаРазряд = Формат(мТарифнаяСтавкаРазряд, "ЧДЦ=2");
			ОбластьДетальныхЗаписей.Параметры.ПовышенныйКоэффициентЕТС = ТекСтрокаТЗ.ПовышенныйКоэффициентЕТС;
			мТарифнаяСтавкаСПовышенныйКоэффициентЕТС = ОбщегоНазначения.ОкруглитьЗначение2016(мТарифнаяСтавкаРазряд * ?(ТекСтрокаТЗ.ПовышенныйКоэффициентЕТС <> 0, ТекСтрокаТЗ.ПовышенныйКоэффициентЕТС, 1),ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
			ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавка = Формат(мТарифнаяСтавкаСПовышенныйКоэффициентЕТС, "ЧДЦ=2");
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область2");
			Для Каждого СтрТЗ из ТЗ_ТаблицаПовышенийОр Цикл
				ПроцентПровышения = "";
				НайденнаяСтр = ТаблицаПовышений.НайтиСтроки(Новый Структура("Сотрудник, Коэффициент", ?(НЕ ЗначениеЗаполнено(ТекСтрокаТЗ.Декретница), ТекСтрокаТЗ.Сотрудник, ТекСтрокаТЗ.Декретница), СтрТЗ.Коэффициент));
				Если НайденнаяСтр.Количество() = 0 Тогда
				Иначе
					Попытка
						ПроцентПровышения = НайденнаяСтр[0].Размер;
					Исключение
					Конецпопытки;
				КонецЕсли;
				ОбластьДетальныхЗаписей.Параметры.ПроцентПровышения = ПроцентПровышения;
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			КонецЦикла;				
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область3");
			ОбластьДетальныхЗаписей.Параметры.ПроцентПоКонтракту = ТекСтрокаТЗ.ПроцентПоКонтракту;
			ОбластьДетальныхЗаписей.Параметры.Ставка = Формат(ТекСтрокаТЗ.Ставка, "ЧДЦ=2");
			Если ПараметрыНормыЧасов.Размер <> 0 Тогда
				Если ДатаАктуальности < Дата(2016,07,1) Тогда //О.Т. Аверсон 21.03.2016 № 949
					ОбластьДетальныхЗаписей.Параметры.СтавкаЧасовая = Окр(ТекСтрокаТЗ.Ставка / ТекСтрокаТЗ.ЗанимаемыхСтавок / ПараметрыНормыЧасов.Размер,1);
				иначе

					//Аверсон 24.11.2022 КВВ СВФР-009879 (
					НормаЧас = ПараметрыНормыЧасов.Размер;
					Если Организация.ИНН = "100194961" Тогда
						ГрафикСотр = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаАктуальности,Новый Структура("Сотрудник",ТекСтрокаТЗ.Сотрудник)).ГрафикРаботы;
						Если ЗначениеЗаполнено(ГрафикСотр) Тогда
							СреднеГодоваяНормаПоГрафику = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,Новый Структура("Организация,ВидПараметра,ГрафикРаботы,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов,ГрафикСотр, Справочники.КатегорииРаботников.ПустаяСсылка())).Размер;
							Если ЗначениеЗаполнено(СреднеГодоваяНормаПоГрафику) Тогда
								НормаЧас = СреднеГодоваяНормаПоГрафику;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//_СтавкаЧасовая = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаТЗ.Ставка / ТекСтрокаТЗ.ЗанимаемыхСтавок / ПараметрыНормыЧасов.Размер,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949		
					_СтавкаЧасовая = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаТЗ.Ставка / ТекСтрокаТЗ.ЗанимаемыхСтавок / НормаЧас,ДатаАктуальности);
					//Аверсон 24.11.2022 КВВ СВФР-009879 )
					
					ЗнОкр = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаАктуальности,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; 

					
					ОбластьДетальныхЗаписей.Параметры.СтавкаЧасовая = Формат(_СтавкаЧасовая,"ЧДЦ=" + СокрЛП(ЗнОкр));
				КонецЕсли;
			КонецЕсли;
			ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			
			Надб1 = 0;
			СуммаНадб1 = 0; СуммаНадбПоСотруднику = 0;
			Если ВидРасчета.Количество() > 0 Тогда
				Для Каждого ТекСтрока из ВидРасчета Цикл
					ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область4");
					мСтрокаТЧ = ТаблицаНадбавок.НайтиСтроки(Новый Структура("Сотрудник, ВидРасчета", ?(НЕ ЗначениеЗаполнено(ТекСтрокаТЗ.Декретница), ТекСтрокаТЗ.Сотрудник, ТекСтрокаТЗ.Декретница), ТекСтрока.Значение));
					Если мСтрокаТЧ.Количество() <> 0 Тогда
						Надб1 = мСтрокаТЧ[0].Показатель;
						Если ТекСтрока.Значение.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность Тогда
							СуммаНадб1 = ОбщегоНазначения.ОкруглитьЗначение2016(СтавкаПервогоОсновная * мСтрокаТЧ[0].Показатель / 100 * СреднКолЧасов,ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
						Иначе
							СуммаНадб1 = ОбщегоНазначения.ОкруглитьЗначение2016(ТекСтрокаТЗ.Ставка * мСтрокаТЧ[0].Показатель / 100, ДатаАктуальности);//О.Т. Аверсон 21.03.2016 № 949
						КонецЕСли;
					Иначе
						Надб1 = 0;
						СуммаНадб1 = 0;
					КонецЕсли;
					ОбластьДетальныхЗаписей.Параметры.Надб1 = Надб1;
					ОбластьДетальныхЗаписей.Параметры.СуммаНадб1 = Формат(СуммаНадб1, "ЧДЦ=2");
					
					СуммаНадбПоСотруднику = СуммаНадбПоСотруднику + СуммаНадб1;
					ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
					
					НоваяСтрока = ТЗ_ПоПредприятию.Добавить();
					НоваяСтрока.ВидРасчета = ТекСтрока.Значение;
					НоваяСтрока.Сумма = СуммаНадб1;
					
					НоваяСтрока = ТЗ_ПоПодразделению.Добавить();
					НоваяСтрока.ВидРасчета = ТекСтрока.Значение;
					НоваяСтрока.Сумма = СуммаНадб1;
					
				КонецЦикла;		
			КонецЕсли;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область5");
			ФондЗП = ТекСтрокаТЗ.Ставка + СуммаНадбПоСотруднику;
			ОбластьДетальныхЗаписей.Параметры.ФондЗП = Формат(ФондЗП, "ЧДЦ=2");						
			ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			
			Если (РольДоступна("ОК")) и Факт Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка|Область6");
				ОбластьДетальныхЗаписей.Параметры.СотрудникЗаменяемый = ТекСтрокаТЗ.СотрудникЗаменяемый;
				ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			КонецЕсли;	
			
			//подсчитываем итоги
			СтавокИтог = СтавокИтог + ТекСтрокаТЗ.ЗанимаемыхСтавок;
			ТарифнаяСтавкаИтог = ТарифнаяСтавкаИтог + мТарифнаяСтавкаСПовышенныйКоэффициентЕТС;
			ТарифнаяСтавкаРазрядИтог = ТарифнаяСтавкаРазрядИтог + мТарифнаяСтавкаРазряд;			
			СтавкаИтог = СтавкаИтог + ТекСтрокаТЗ.Ставка;
			ФондЗПИтог = ФондЗПИтог + ФондЗП;
			
			СтавокИтогПоПредпр = СтавокИтогПоПредпр + ТекСтрокаТЗ.ЗанимаемыхСтавок;
			ТарифнаяСтавкаИтогПоПредпр = ТарифнаяСтавкаИтогПоПредпр + мТарифнаяСтавкаСПовышенныйКоэффициентЕТС;
			СтавкаИтогПоПредпр = СтавкаИтогПоПредпр + ТекСтрокаТЗ.Ставка;
			ФондЗПИтогПоПредпр = ФондЗПИтогПоПредпр + ФондЗП;
			ТарифнаяСтавкаРазрядИтогПоПредпр = ТарифнаяСтавкаРазрядИтогПоПредпр + мТарифнаяСтавкаРазряд;
		КонецЕсли;
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
    ФондЗПИтог = 0; СтавокИтог = 0; ТарифнаяСтавкаИтог = 0; ТарифнаяСтавкаРазрядИтог = 0; СтавкаИтог = 0; ЗаСложностьИтог = 0;
	ФондЗПИтогПоПредпр = 0; СтавокИтогПоПредпр = 0; ТарифнаяСтавкаИтогПоПредпр = 0; ТарифнаяСтавкаРазрядИтогПоПредпр = 0; СтавкаИтогПоПредпр = 0; ЗаСложностьИтогПоПредпр = 0;
	ТекПодр = "";
	
	ТЗ_ПоПредприятию = Новый ТаблицаЗначений;
	ТЗ_ПоПредприятию.Колонки.Добавить("ВидРасчета");
	ТЗ_ПоПредприятию.Колонки.Добавить("Сумма");

	ТЗ_ПоПодразделению = Новый ТаблицаЗначений;
	ТЗ_ПоПодразделению.Колонки.Добавить("ВидРасчета");
	ТЗ_ПоПодразделению.Колонки.Добавить("Сумма");

	РуководительФИО =""; ДолжностьРуководитель = "";
	СпрОрганизации = Организация.ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; 
	Для Каждого НоваяСтр из ТЗ Цикл
		Если ДатаАктуальности >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ДолжностьРуководитель = СокрЛП(НоваяСтр.Должность.Наименование);
				РуководительНашли = 1;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Запрос = Новый Запрос;
	Если Факт Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	РаботникиОрганизации.Должность.Приоритет КАК ДолжностьПриоритет,
			|	РаботникиОрганизации.Должность КАК Должность,
			|	РаботникиОрганизации.РазрядЕТС,
			|	РаботникиОрганизации.КоэффициентЕТС,
			|	РаботникиОрганизации.Категория,
			|	ТарифныеСтавкиРаботниковОрганизации.Ставка КАК Ставка,
			|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
			|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции КАК ТарифнаяСПовышениемПоИнструкции,
	        |	РаботникиОрганизации.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,					
			|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
			|	РаботникиОрганизации.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,	
			|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
			|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
			|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда КАК РазмерСтавки1Разряда,			
			|	РаботникиОрганизации.Сотрудник КАК СотрудникНаименование,
			|	РаботникиОрганизации.СотрудникЗаменяемый КАК СотрудникЗаменяемый
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизации
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизации
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета КАК ВидРасчета,
			|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор КАК Ссылка
			|			ИЗ
			|				РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, (НЕ временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|			ГДЕ
			|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
			|				И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО) КАК ВидТС
			|			ПО ТарифныеСтавкиРаботниковОрганизации.Сотрудник = ВидТС.Сотрудник
			|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
			|ГДЕ
			|	(НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL )
			|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
			|	И (НЕ ВидТС.ВидРасчета В(&ВидРасчета))
			|	И ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|		КОНЕЦ <> 0
			|	И (НЕ РаботникиОрганизации.Сотрудник В
			|				(ВЫБРАТЬ
			|					СостояниеРаботниковОрганизаций.Сотрудник
			|				ИЗ
			|					РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
			|				ГДЕ
			|					СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
			|					И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И СостояниеРаботниковОрганизаций.ПериодЗавершения))
			|	И РаботникиОрганизации.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)";
			
			Если Не ФлагВнешниеСовместители Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизации.ПодразделениеОрганизации,
			|	РаботникиОрганизации.Должность.Приоритет,
			|	РаботникиОрганизации.Должность,
			|	РаботникиОрганизации.Сотрудник,
			|	РаботникиОрганизации.РазрядЕТС,
			|	РаботникиОрганизации.КоэффициентЕТС,
			|	РаботникиОрганизации.Категория,
			|	ТарифныеСтавкиРаботниковОрганизации.Ставка,
			|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
			|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка,
			|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции,
			|	РаботникиОрганизации.ПодразделениеОрганизации.Код,			
			|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование,
			|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,
			|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|	КОНЕЦ,
			|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
			|	РаботникиОрганизации.СотрудникЗаменяемый

			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеОрганизацииПриоритет Возр,
			|	ДолжностьПриоритет Возр,
			|	Должность,
			|	Сотрудник
			|ИТОГИ
			|	СУММА(ТарифнаяСПовышениемПоИнструкции)
			|ПО
			|	ПодразделениеОрганизации ИЕРАРХИЯ";
	Иначе
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Сотрудник КАК СотрудникНаименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Приоритет КАК ДолжностьПриоритет,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Должность,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Категория,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,	
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК ПодразделениеОрганизацииПриоритет,	
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка КАК ТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка КАК Ставка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции КАК ТарифныйСПовышениемПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КодСтроки КАК Сотрудник,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда КАК РазмерСтавки1Разряда,		
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор КАК Документ
		|ИЗ
		|	РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
		|ГДЕ
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
		|	И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|	И (НЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Приоритет,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Сотрудник,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Категория,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Код,		
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КодСтроки,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда,		
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизацииПриоритет Возр,		
		|	ДолжностьПриоритет Возр,
		|	Должность,
		|	СотрудникНаименование
		|ИТОГИ
		|	СУММА(ТарифныйСПовышениемПоИнструкции)
		|ПО
		|	ПодразделениеОрганизации ИЕРАРХИЯ";
	КонецЕсли;			
 
	Запрос.УстановитьПараметр("Период",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);   
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	
	СписокВидовОклад = Новый СписокЗначений;
	СписокВидовОклад.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокВидовОклад.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	Запрос.УстановитьПараметр("ВидРасчета", СписокВидовОклад);
	
	Если Не Подразделение.Пустая() Тогда
    	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)")
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапросаНов = Запрос.Выполнить().Выбрать();
	ТЗ_Сотрудник = Новый ТаблицаЗначений;
	ТЗ_Сотрудник = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТЗ_Сотрудник.Свернуть("Сотрудник","");
	
	//соберем данные ТС 1 разряда по Подразделениям
	ТЗ_ТарифныеСтавки = Новый ТаблицаЗначений;
	ТЗ_ТарифныеСтавки.Колонки.Добавить("ПодразделениеОрганизации");
	ТЗ_ТарифныеСтавки.Колонки.Добавить("РазмерСтавки1Разряда");
	Пока РезультатЗапросаНов.Следующий() Цикл 
		Если Не ПустаяСтрока(РезультатЗапросаНов.РазмерСтавки1Разряда) Тогда
			НовСтр = ТЗ_ТарифныеСтавки.Добавить();
			НовСтр.ПодразделениеОрганизации = РезультатЗапросаНов.ПодразделениеОрганизации;
			НовСтр.РазмерСтавки1Разряда = РезультатЗапросаНов.РазмерСтавки1Разряда;
		КонецЕсли;
	КонецЦикла;
	ТЗ_ТарифныеСтавки.Свернуть("ПодразделениеОрганизации, РазмерСтавки1Разряда","");
	
	ЗапросП = Новый Запрос;
	Если Факт Тогда
		ЗапросП.Текст =
			"ВЫБРАТЬ
			|	КоэфПовышенияТОСрезПоследних.Сотрудник,
			|	КоэфПовышенияТОСрезПоследних.Коэффициент,
			|	КоэфПовышенияТОСрезПоследних.Размер
			|ИЗ
			|	РегистрСведений.КоэфПовышенияТО.СрезПоследних(&Период, (НЕ Временно)) КАК КоэфПовышенияТОСрезПоследних
			|ГДЕ
			|	КоэфПовышенияТОСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПовышенияПоИнструкцииСрезПоследних.Сотрудник,
			|	ПовышенияПоИнструкцииСрезПоследних.Коэффициент,
			|	ПовышенияПоИнструкцииСрезПоследних.Размер
			|ИЗ
			|	РегистрСведений.ПовышенияПоИнструкции.СрезПоследних(&Период, (НЕ Временно)) КАК ПовышенияПоИнструкцииСрезПоследних
			|ГДЕ
			|	ПовышенияПоИнструкцииСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И ПовышенияПоИнструкцииСрезПоследних.Размер <> 0";

	Иначе
		ЗапросП.Текст =
			"ВЫБРАТЬ
			|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Коэффициент,
			|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Размер,
			|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.КодСтроки КАК Сотрудник
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.КоэфПовышенияТО КАК ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО
			|ГДЕ
			|	ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Ссылка В(&Документ)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Коэффициент,
			|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер,
			|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.КодСтроки
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции
			|ГДЕ
			|	ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Ссылка В(&Документ)
			|	И ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер <> 0";

		ЗапросП.УстановитьПараметр("Документ",	РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ"));
	КонецЕсли;
	ЗапросП.УстановитьПараметр("Период",	ДатаАктуальности);
	ЗапросП.УстановитьПараметр("КодСтрокиСотрудник",	ТЗ_Сотрудник);
	
	ТаблицаПовышений = ЗапросП.Выполнить().Выгрузить();
	
	ТЗ_ТаблицаПовышений = Новый ТаблицаЗначений;
	ТЗ_ТаблицаПовышений = ЗапросП.Выполнить().Выгрузить();
	ТЗ_ТаблицаПовышенийОр = Новый ТаблицаЗначений;
	ТЗ_ТаблицаПовышенийОр.Колонки.Добавить("Коэффициент");

	Для Каждого СтрТЗ из ТЗ_ТаблицаПовышений Цикл
		Если СтрТЗ.Коэффициент = Справочники.КоэффициентыПовышения.КоэфПоТехнолВидамРабот Тогда
			Продолжить;
		КонецЕсли;		
		НайденнаяСтр = ТЗ_Сотрудник.Найти(СтрТЗ.Сотрудник,"Сотрудник");
		Если НайденнаяСтр = Неопределено Тогда
		Иначе
			СтрТЗОр = ТЗ_ТаблицаПовышенийОр.Добавить();
			СтрТЗОр.Коэффициент = СтрТЗ.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_Декретницы = Новый ТаблицаЗначений;
	ТЗ_Декретницы = СформироватьЗапросПоДекретницам().Выгрузить();
	Для Каждого СтрТЗ ИЗ ТЗ_Декретницы Цикл
		НайденнаяСтр = ТЗ_ТаблицаПовышений.Найти(СтрТЗ.Сотрудник,"Сотрудник");
		Если НайденнаяСтр = Неопределено Тогда
		Иначе
			СтрТЗОр = ТЗ_ТаблицаПовышенийОр.Добавить();
			СтрТЗОр.Коэффициент = НайденнаяСтр.Коэффициент;
		КонецЕсли;
	КонецЦикла;

	ТЗ_ТаблицаПовышенийОр.Свернуть("Коэффициент","");
	
	Если Факт Тогда
		ЗапросП = Новый Запрос;
		ЗапросП.Текст =
			"ВЫБРАТЬ
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1, 0) = 0
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1
			|	КОНЕЦ КАК Показатель
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|ГДЕ
			|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
			|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В (&ВидРасчета)";
			
		ЗапросП.УстановитьПараметр("Период",	ДатаАктуальности);
		ЗапросП.УстановитьПараметр("Организация",		Организация);   
		ЗапросП.УстановитьПараметр("ВидРасчета", ?(ЗначениеЗаполнено(ВидРасчета), ВидРасчета, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаКлассность));   
	Иначе
		ЗапросП.Текст =
			"ВЫБРАТЬ
			|	ПлановоеШтатноеРасписаниеОрганизацийНадбавки.КодСтроки КАК Сотрудник,
			|   ПлановоеШтатноеРасписаниеОрганизацийНадбавки.ВидНадбавки КАК ВидРасчета,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель1, 0) = 0
			|			ТОГДА ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель2
			|		ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Показатель1            
			|	КОНЕЦ КАК Показатель
			|ИЗ
			|	Документ.ПлановоеШтатноеРасписаниеОрганизаций.Надбавки КАК ПлановоеШтатноеРасписаниеОрганизацийНадбавки
			|ГДЕ
			|	ПлановоеШтатноеРасписаниеОрганизацийНадбавки.Ссылка В(&Документ)";
		ЗапросП.УстановитьПараметр("Документ",	РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ"));
	КонецЕсли;
    ТаблицаНадбавок = ЗапросП.Выполнить().Выгрузить();
	
	//Аверсон ЕАЕ 08.07.2025 СВФР-016154
	//ТаблицаВакантно = СформироватьЗапросПоВакантно(СписокВидовОклад).Выгрузить();
	ТаблицаВакантно = СформироватьЗапросПоВакантноКАКВИТР(СписокВидовОклад).Выгрузить();
	//Аверсон СВФР-016154
	
	ВременнаяТЗ = Новый ТаблицаЗначений;
	ВременнаяТЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ВременнаяТЗ.Колонки.Добавить("ПриоритетПодразделение", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.ДолжностиОрганизаций"));
	ВременнаяТЗ.Колонки.Добавить("ПриоритетДолжность", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("РазмерСтавки1Разряда");
	ВременнаяТЗ.Колонки.Добавить("РазрядЕТС", Новый ОписаниеТипов("Строка"));
	ВременнаяТЗ.Колонки.Добавить("ПовышенныйКоэффициентЕТС", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ЗанимаемыхСтавок", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("КоэффициентЕТС", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ТарифнаяСтавкаРазряд", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("ПроцентПоКонтракту");
	ВременнаяТЗ.Колонки.Добавить("Ставка");
	ВременнаяТЗ.Колонки.Добавить("ФондЗП", Новый ОписаниеТипов("Число"));
	ВременнаяТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	Если (РольДоступна("ОК")) и Факт Тогда
		ВременнаяТЗ.Колонки.Добавить("СотрудникЗаменяемый", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	КонецЕсли;

	ЗаполнимВременнуюТаблицу(ВременнаяТЗ, РезультатЗапроса.Выбрать(), ТаблицаВакантно);

	////////////////////////////////////////////////////////
    ДокументРезультат.Очистить();
	
 	ПараметрыНормыЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
			Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));

	Область = мМакет.ПолучитьОбласть("Заголовок|Область1");
	Область.Параметры.Организация = Организация;	
	СреднКолЧасов = ПараметрыНормыЧасов.Размер;
	Область.Параметры.СреднКолЧасов = СреднКолЧасов;	
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("Заголовок|Область2");	
	н = 0; 
	Для Каждого стрТЗ из ТЗ_ТаблицаПовышенийОр Цикл
		ДокументРезультат.Присоединить(Область);
		н = н + 1;
	КонецЦикла;
	
	Область = мМакет.ПолучитьОбласть("Заголовок|Область3");
	ДокументРезультат.Присоединить(Область);
	
	Если ВидРасчета.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ВидРасчета Цикл
			Область = мМакет.ПолучитьОбласть("Заголовок|Область4");
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
	КонецЕсли;
	
	Область = мМакет.ПолучитьОбласть("Заголовок|Область5");
	Область.Параметры.ДолжностьРуководитель = ДолжностьРуководитель;
	Область.Параметры.РуководительФИО = РуководительФИО;
	Область.Параметры.Организация = Организация;
	Область.Параметры.Количество = ВременнаяТЗ.Итог("ЗанимаемыхСтавок");
	Область.Параметры.ДатаУтверждения = Формат(Год(ДатаАктуальности),"ЧГ=0");
	Область.Параметры.Организация = Организация;	

	Запрос.УстановитьПараметр("ТарифнаяСтавка", Справочники.ТарифныеСтавкиПервогоРазряда.Основная);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Размер,
	|	ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних.Период КАК ПериодТС	
	|ИЗ
	|	РегистрСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТарифнаяСтавка = &ТарифнаяСтавка) КАК ТарифныеСтавкиПервогоРазрядаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//Область.Параметры.ПериодТС = Формат(Выборка.ПериодТС,"ДЛФ=DD");
		Область.Параметры.ТС = Выборка.Размер;
		СтавкаПервогоОсновная = Выборка.Размер;
	КонецЕсли;
	
	//заявка №1863 (база заявок Кристалла) Дмитрук О.Г.
	Область.Параметры.ПериодТС = Формат(ДатаВвода,"ДЛФ=DD");
	//заявка №1863
	ДокументРезультат.Присоединить(Область);
	
	Если (РольДоступна("ОК")) и Факт Тогда
		Область = мМакет.ПолучитьОбласть("Заголовок|Область6");
		ДокументРезультат.Присоединить(Область);
	КонецЕсли;	

	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб        = Истина;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка|Область1");
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("Шапка|Область2");
	н = 0;
	Для Каждого стрТЗ из ТЗ_ТаблицаПовышенийОр Цикл
		н = н + 1;

		Область.Параметры.н = 9 + н;		
		Область.Параметры.ПовышениеНаименование = СокрЛП(стрТЗ.Коэффициент.Наименование);
		ДокументРезультат.Присоединить(Область);
		
	КонецЦикла;
	
	Область = мМакет.ПолучитьОбласть("Шапка|Область3");
	м = 9 + н + 1;
	Область.Параметры.м = м;
	м1 = м + 1;
	Область.Параметры.м1 = м1;
	м2 = м + 2;
	Область.Параметры.м2 = м2;
	ДокументРезультат.Присоединить(Область);

	х = 2;
	Если ВидРасчета.Количество() > 0 Тогда
		Для Каждого ТекСтрока Из ВидРасчета Цикл
			Область = мМакет.ПолучитьОбласть("Шапка|Область4");
			Область.Параметры.Доплаты = ТекСтрока.Значение.Наименование;
			м3 = м + х;
			Область.Параметры.м3 = м3;
			м4 = м + х + 1;
			Область.Параметры.м4 = м4;
			ДокументРезультат.Присоединить(Область);
			х = х + 1;
		КонецЦикла;
	Иначе
		м3 = м2;
	КонецЕСли;

    Область = мМакет.ПолучитьОбласть("Шапка|Область5");	
	м5 = м3 + 1;
	Область.Параметры.м5 = м5;
    ДокументРезультат.Присоединить(Область);

	Если (РольДоступна("ОК")) и Факт Тогда
		Область = мМакет.ПолучитьОбласть("Шапка|Область6");
		Область.Параметры.м6 = м5 + 1;
		ДокументРезультат.Присоединить(Область);
	КонецЕсли;	

	мНомер = 0;
	ВывестиСтрокиПодразделения(ВременнаяТЗ, ДокументРезультат);
	
	Область = мМакет.ПолучитьОбласть("Итого|Область1");
	Область.Параметры.СтавокИтог = СтавокИтог;
	Область.Параметры.ТарифнаяСтавкаИтог = Формат(ТарифнаяСтавкаИтог, "ЧДЦ=2");
	Область.Параметры.ТарифнаяСтавкаРазрядИтог = Формат(ТарифнаяСтавкаразрядИтог, "ЧДЦ=2");	
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("Итого|Область2");
	Для н = 1 По ТЗ_ТаблицаПовышенийОр.Количество() Цикл
		ДокументРезультат.Присоединить(Область);
	КонецЦикла;
	
	Область = мМакет.ПолучитьОбласть("Итого|Область3");
	Область.Параметры.СтавкаИтог = Формат(СтавкаИтог, "ЧДЦ=2");
	ДокументРезультат.Присоединить(Область);
	
	Если ВидРасчета.Количество() > 0 Тогда
		ТЗ_ПоПодразделению.Свернуть("ВидРасчета", "Сумма");
		Для Каждого ТекСтрока Из ТЗ_ПоПодразделению Цикл
			Область = мМакет.ПолучитьОбласть("Итого|Область4");
			Область.Параметры.ЗаСложностьИтог = Формат(ТекСтрока.Сумма, "ЧДЦ=2");
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
	КонецЕсли;
	
 	Область = мМакет.ПолучитьОбласть("Итого|Область5");
	Область.Параметры.ФондЗПИтог = Формат(ФондЗПИтог, "ЧДЦ=2");
	ДокументРезультат.Присоединить(Область);

	Если (РольДоступна("ОК")) и Факт Тогда
		Область = мМакет.ПолучитьОбласть("Итого|Область6");
		ДокументРезультат.Присоединить(Область);
	КонецЕсли;	

	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область1");
	Область.Параметры.СтавокИтогПоПредпр = СтавокИтогПоПредпр;
	Область.Параметры.ТарифнаяСтавкаИтогПоПредпр = Формат(ТарифнаяСтавкаИтогПоПредпр, "ЧДЦ=2");
	Область.Параметры.ТарифнаяСтавкаРазрядИтогПоПредпр = Формат(ТарифнаяСтавкаРазрядИтогПоПредпр, "ЧДЦ=2");
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область2");
	Для н = 1 По ТЗ_ТаблицаПовышенийОр.Количество() Цикл
		ДокументРезультат.Присоединить(Область);
	КонецЦикла;
	
	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область3");
	Область.Параметры.СтавкаИтогПоПредпр = Формат(СтавкаИтогПоПредпр, "ЧДЦ=2");
	ДокументРезультат.Присоединить(Область);
	
	Если ВидРасчета.Количество() > 0 Тогда
		ТЗ_ПоПредприятию.Свернуть("ВидРасчета", "Сумма");
		Для Каждого ТекСтрока Из ТЗ_ПоПредприятию Цикл
			Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область4");
			Область.Параметры.ЗаСложностьИтогПоПредпр = Формат(ТекСтрока.Сумма, "ЧДЦ=2");
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
	КонецЕсли;

	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область5");
	Область.Параметры.ФондЗПИтогПоПредпр = Формат(ФондЗПИтогПоПредпр, "ЧДЦ=2");
	ДокументРезультат.Присоединить(Область);

	Если (РольДоступна("ОК")) и Факт Тогда
		Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию|Область6");
		ДокументРезультат.Присоединить(Область);
	КонецЕсли;	

	Область = мМакет.ПолучитьОбласть("Подписи|Область1");
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("Подписи|Область2");
	Для н = 1 По ТЗ_ТаблицаПовышенийОр.Количество() Цикл
		ДокументРезультат.Присоединить(Область);
	КонецЦикла;
	
	Область = мМакет.ПолучитьОбласть("Подписи|Область3");
	ВыборкаРезультат = ПрочиеПроцедуры.СформироватьЗапросПоОтветственнымЛицамОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.НачальникУправленияЭкономики, ДатаАктуальности).Выбрать();
	Если ВыборкаРезультат.Следующий() Тогда
		Область.Параметры.ГлавныйЭкономист = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаРезультат.Сотрудник.Наименование);
	Иначе
		Область.Параметры.ГлавныйЭкономист = "";
	КонецЕсли;
	ВыборкаРезультат = ПрочиеПроцедуры.СформироватьЗапросПоОтветственнымЛицамОрганизации(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ДатаАктуальности).Выбрать();
	Если ВыборкаРезультат.Следующий() Тогда
		Область.Параметры.ГлавныйБухгалтер = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ВыборкаРезультат.Сотрудник.Наименование);
	Иначе
		Область.Параметры.ГлавныйБухгалтер = "";
	КонецЕсли;
	ДокументРезультат.Присоединить(Область);
	
	Если ВидРасчета.Количество() > 0 Тогда
		ТЗ_ПоПредприятию.Свернуть("ВидРасчета", "Сумма");
		Для Каждого ТекСтрока Из ТЗ_ПоПредприятию Цикл
			Область = мМакет.ПолучитьОбласть("Подписи|Область4");
			//Область.Параметры.ЗаСложностьИтогПоПредпр = ТекСтрока.Сумма;
			ДокументРезультат.Присоединить(Область);
		КонецЦикла;
	КонецЕсли;

	Область = мМакет.ПолучитьОбласть("Подписи|Область5");
	ДокументРезультат.Присоединить(Область);

	Если (РольДоступна("ОК")) и Факт Тогда
		Область = мМакет.ПолучитьОбласть("Подписи|Область6");
		ДокументРезультат.Присоединить(Область);
	КонецЕсли;	

КонецПроцедуры

//Аверсон ЕАЕ 08.07.2025 СВФР-016154
//функция выводит свободные штатные единицы
	Функция СформироватьЗапросПоВакантноКАКВИТР(СписокВидовРасчета)
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Период", ДатаАктуальности);
		Запрос.УстановитьПараметр("ВидРасчета", СписокВидовРасчета);
		ТекстЗапроса =  
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВакантныеСтавки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВакантныеСтавки.Должность КАК Должность,
		|	ВакантныеСтавки.Свободно КАК Свободно,
		|	ВакантныеСтавки.ЗанимаемыхСтавокПоШтатному КАК ЗанимаемыхСтавокПоШтатному,
		|	ВакантныеСтавки.ЗанимаемыхСтавокФакт КАК ЗанимаемыхСтавокФакт,
		|	МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазмерСтавки1Разряда) КАК РазмерСтавки1Разряда,
		|	ВакантныеСтавки.РазрядЕТС КАК РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ВакантныеСтавки.ГрафикРаботы КАК ГрафикРаботы,", "") + "
		
		|	ВакантныеСтавки.КоэффициентЕТС КАК КоэффициентЕТС,
		|	ВакантныеСтавки.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок 
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка 
		|КОНЕЦ 
		|	КОНЕЦ КАК ТарифнаяСтавка,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 3))
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 3)) 
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции 
		|КОНЕЦ 
		|	КОНЕЦ КАК ТарифныйСПовышениемПоИнструкции,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2)) //- 0.005
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2)) 
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка 
		|КОНЕЦ 
		|	КОНЕЦ КАК МесячнаяТарифнаяСтавка,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции КАК ИтоговоеПовышениеПоИнструкции,
		
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТВакантные
		|ИЗ
		|	(ВЫБРАТЬ //О.Т. Аверсон 08.05.2018 № дополнит группировка 1915
		|			ВложенныйЗапрос.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ВложенныйЗапрос.Должность КАК Должность,
		|			СУММА(ВложенныйЗапрос.ЗанимаемыхСтавокПоШтатному) КАК ЗанимаемыхСтавокПоШтатному,
		|			СУММА(ВложенныйЗапрос.ЗанимаемыхСтавокФакт) КАК ЗанимаемыхСтавокФакт,
		|			ВложенныйЗапрос.РазрядЕТС КАК РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ВложенныйЗапрос.ГрафикРаботы КАК ГрафикРаботы,", "") + "
		
		|			ВложенныйЗапрос.КоэффициентЕТС КАК КоэффициентЕТС,
		|			ВложенныйЗапрос.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
		|			ВложенныйЗапрос.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|			СУММА(ВложенныйЗапрос.ЗанимаемыхСтавокПоШтатному - ЕСТЬNULL(ВложенныйЗапрос.ЗанимаемыхСтавокФакт, 0)) КАК Свободно
		
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ШтатноеРасписание.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|				ШтатноеРасписание.Должность КАК Должность,
		|				ШтатноеРасписание.ЗанимаемыхСтавок КАК ЗанимаемыхСтавокПоШтатному,
		|				СУММА(РаботникиФакт.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавокФакт,
		|				ШтатноеРасписание.РазрядЕТС КАК РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ШтатноеРасписание.ГрафикРаботы КАК ГрафикРаботы,", "") + "
		
		|				ШтатноеРасписание.КоэффициентЕТС КАК КоэффициентЕТС,
		|				ШтатноеРасписание.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
		|				ШтатноеРасписание.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка
		
		|			ИЗ
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Должность,
		|					СУММА(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС КАК РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,", "") + "
		
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС КАК КоэффициентЕТС,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
		|					ВЫБОР
		|						КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0
		|								И ВЫБОР
		|									КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|										ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|									ИНАЧЕ ИСТИНА
		|								КОНЕЦ
		|							ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка 
		|КОНЕЦ 
		|					КОНЕЦ КАК МесячнаяТарифнаяСтавка,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|					ВЫБОР
		|						КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0
		|							ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка
		|					КОНЕЦ КАК МесячнаяТарифнаяСтавка1
		|				ИЗ
		|					РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизаций.Период) КАК Период,
		|							ПлановоеШтатноеРасписаниеОрганизаций.Должность КАК Должность,
		|							ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|						ИЗ
		|							РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
		|						ГДЕ
		|							ПлановоеШтатноеРасписаниеОрганизаций.Период <= &Период
		|						
		|						СГРУППИРОВАТЬ ПО
		|							ПлановоеШтатноеРасписаниеОрганизаций.Должность,
		|							ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации) КАК ВложенныйЗапрос
		|						ПО ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Период = ВложенныйЗапрос.Период
		|							И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВложенныйЗапрос.Должность
		|							И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВложенныйЗапрос.ПодразделениеОрганизации
		|				ГДЕ
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
		|					И НЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчета)
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ГрафикРаботы,", "") + "
		
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,
		|					ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|					ВЫБОР
		|						КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0
		|								И ВЫБОР
		|									КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|										ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|									ИНАЧЕ ИСТИНА
		|								КОНЕЦ
		|							ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка 
		|КОНЕЦ 
		|					КОНЕЦ,
		|					ВЫБОР
		|						КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0
		|							ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка
		|					КОНЕЦ) КАК ШтатноеРасписание
		|					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|						РаботникиОрганизацийСрезПоследних.Сотрудник, //Аверсон 24.03.2023 КВВ СВФР-010593
		|						СУММА(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок) КАК ЗанимаемыхСтавок,
		|						РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|						РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
		|						РаботникиОрганизацийСрезПоследних.РазрядЕТС КАК РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " РаботникиОрганизацийСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,", "") + "
		
		|						РаботникиОрганизацийСрезПоследних.КоэффициентЕТС КАК КоэффициентЕТС,
		|						РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС КАК ПовышенныйКоэффициентЕТС,
		|						ВЫБОР
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
		|								ТОГДА ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
		|								ТОГДА ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
		|								ТОГДА ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|						КОНЕЦ КАК ПроцентПоКонтракту,";
		
		Если Организация.ИНН = "101542412" Тогда //Минск-Новости
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ КАК МесячнаяТарифнаяСтавка,
			|
			
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ 
			|+ 0.01 КАК МесячнаяТарифнаяСтавкаПЛЮС_0_01,
			
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА
			|ВЫРАЗИТЬ(
			|(ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции КАК ЧИСЛО(15, 2)) +
			|ВЫРАЗИТЬ(ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)) ) // КАК К5,
			|/РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ КАК МесячнаяТарифнаяСтавка2,
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(
			|(
			|ИзменениеПериодическихРеквизитовРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции 
			|+
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))  //КАК К7
			|* РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|КАК ЧИСЛО(15, 2))  
			|* ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100
			|КАК ЧИСЛО(15, 2))
			|)  КАК ЧИСЛО(15, 2))
			|/РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ КАК МесячнаяТарифнаяСтавка3,
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов       
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ  
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ КАК МесячнаяТарифнаяСтавка1";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|						ВЫБОР
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027"" //О.Т. Аверсон 01.02.2018 № 1651 новое условие ИНН
			|											ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027"" //О.Т. Аверсон 01.02.2018 № 1651 новое условие ИНН
			|											ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027"" //О.Т. Аверсон 01.02.2018 № 1651 новое условие ИНН
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027"" //О.Т. Аверсон 01.02.2018 № 1651 новое условие ИНН
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка 
			|КОНЕЦ 
			|									КОНЕЦ
			|						КОНЕЦ КАК МесячнаяТарифнаяСтавка,
			|						ВЫБОР
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|									КОНЕЦ
			|						КОНЕЦ КАК МесячнаяТарифнаяСтавка1";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|					ИЗ
		|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы
		|							ПО РаботникиОрганизацийСрезПоследних.Регистратор = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Ссылка
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Сотрудник
		|								И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ПодразделениеОрганизации
		|								И РаботникиОрганизацийСрезПоследних.Должность = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Должность
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
		|							ПО РаботникиОрганизацийСрезПоследних.Регистратор = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
		|								И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПодразделениеОрганизации
		|								И РаботникиОрганизацийСрезПоследних.Должность = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Должность
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПериодическихРеквизитов.РаботникиОрганизации КАК ИзменениеПериодическихРеквизитовРаботникиОрганизации
		|							ПО РаботникиОрганизацийСрезПоследних.Регистратор = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Ссылка
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Сотрудник
		|								И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПодразделениеОрганизации
		|								И РаботникиОрганизацийСрезПоследних.Должность = ИзменениеПериодическихРеквизитовРаботникиОрганизации.Должность
		|							ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещениеОрганизаций.РаботникиОрганизации КАК КадровоеПеремещениеОрганизацийРаботникиОрганизации
		|							ПО РаботникиОрганизацийСрезПоследних.Регистратор = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Ссылка
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Сотрудник
		|								И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПодразделениеОрганизации
		|								И РаботникиОрганизацийСрезПоследних.Должность = КадровоеПеремещениеОрганизацийРаботникиОрганизации.Должность
		|							ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								МАКСИМУМ(ТарифныеСтавкиРаботниковОрганизации.Период) КАК Период,
		|								ТарифныеСтавкиРаботниковОрганизации.Регистратор КАК Регистратор,
		|								ТарифныеСтавкиРаботниковОрганизации.Сотрудник КАК Сотрудник,
		|								ТарифныеСтавкиРаботниковОрганизации.Ставка КАК Ставка,
		|								ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту КАК ПроцентПоКонтракту,
		|								ТарифныеСтавкиРаботниковОрганизации.Организация КАК Организация
		|							ИЗ
		|								РегистрСведений.ТарифныеСтавкиРаботниковОрганизации КАК ТарифныеСтавкиРаботниковОрганизации
		|							ГДЕ
		|								ТарифныеСтавкиРаботниковОрганизации.Период <= &Период
		|							
		|							СГРУППИРОВАТЬ ПО
		|								ТарифныеСтавкиРаботниковОрганизации.Сотрудник,
		|								ТарифныеСтавкиРаботниковОрганизации.Регистратор,
		|								ТарифныеСтавкиРаботниковОрганизации.Организация,
		|								ТарифныеСтавкиРаботниковОрганизации.Ставка,
		|								ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту) КАК ТарифныеСтавкиРаботниковОрганизации
		|							ПО РаботникиОрганизацийСрезПоследних.Регистратор = ТарифныеСтавкиРаботниковОрганизации.Регистратор
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
		|								И (ТарифныеСтавкиРаботниковОрганизации.Период <= РаботникиОрганизацийСрезПоследних.Период)
		|							ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|								ОтпускаОрганизацийРаботникиОрганизации.ОсвобождатьСтавку КАК ОсвобождатьСтавку,
		|								СостояниеРаботниковОрганизаций.Регистратор КАК Регистратор,
		|								СостояниеРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		|								СостояниеРаботниковОрганизаций.Организация КАК Организация
		|							ИЗ
		|								РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускаОрганизаций.РаботникиОрганизации КАК ОтпускаОрганизацийРаботникиОрганизации
		|									ПО СостояниеРаботниковОрганизаций.Регистратор = ОтпускаОрганизацийРаботникиОрганизации.Ссылка
		|										И СостояниеРаботниковОрганизаций.НомерСтроки = ОтпускаОрганизацийРаботникиОрганизации.НомерСтроки
		|										И СостояниеРаботниковОрганизаций.Сотрудник = ОтпускаОрганизацийРаботникиОрганизации.Сотрудник
		|							ГДЕ
		|								СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам)
		|								И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И ДобавитьКДате(СостояниеРаботниковОрганизаций.ПериодЗавершения,День,-1)) КАК СостояниеРаботников //О.Т. Аверсон 15.05.2019 № 4345(-1)
		|							ПО РаботникиОрганизацийСрезПоследних.Организация = СостояниеРаботников.Организация
		|								И РаботникиОрганизацийСрезПоследних.Сотрудник = СостояниеРаботников.Сотрудник
		|					ГДЕ
		|						РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
		|						И НЕ РаботникиОрганизацийСрезПоследних.Сотрудник В
		|									(ВЫБРАТЬ
		|										РаботникиОрганизаций.Сотрудник
		|									ИЗ
		|										РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|											ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|											ПО
		|												РаботникиОрганизаций.Организация = СостояниеРаботниковОрганизаций.Организация
		|													И РаботникиОрганизаций.Сотрудник = СостояниеРаботниковОрганизаций.Сотрудник
		|									ГДЕ
		|										СостояниеРаботниковОрганизаций.Состояние В (&Состояние)
		|										И &Период МЕЖДУ СостояниеРаботниковОрганизаций.Период И ДобавитьКДате(СостояниеРаботниковОрганизаций.ПериодЗавершения,День,-1))//О.Т. Аверсон 15.05.2019 № 4345 (-1)
		|						И НЕ РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
		|						И ВЫБОР
		|								КОГДА СостояниеРаботников.ОсвобождатьСтавку
		|									ТОГДА ЛОЖЬ
		|								ИНАЧЕ ИСТИНА
		|							КОНЕЦ
		|					
		|					СГРУППИРОВАТЬ ПО
		|						РаботникиОрганизацийСрезПоследних.Сотрудник, //Аверсон 24.03.2023 КВВ СВФР-010593
		|						РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|						РаботникиОрганизацийСрезПоследних.Должность,
		|						РаботникиОрганизацийСрезПоследних.РазрядЕТС,
		|" + ?(Организация.ИНН = "101542412", " РаботникиОрганизацийСрезПоследних.ГрафикРаботы,", "") + "
		|						РаботникиОрганизацийСрезПоследних.КоэффициентЕТС,
		|						РаботникиОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС,";
		
		Если Организация.ИНН = "101542412" Тогда //Минск-Новости
			ТекстЗапроса = ТекстЗапроса + "
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ,// КАК МесячнаяТарифнаяСтавка
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ 
			|+ 0.01,// КАК МесячнаяТарифнаяСтавкаПЛЮС_0_01,
			
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА
			|ВЫРАЗИТЬ(
			|(ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции КАК ЧИСЛО(15, 2)) +
			|ВЫРАЗИТЬ(ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)) ) // КАК К5,
			|/РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ,// КАК МесячнаяТарифнаяСтавка2,
			
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ                                      
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(
			|(
			|ИзменениеПериодическихРеквизитовРаботникиОрганизации.ТарифныйСПовышениемПоИнструкции 
			|+
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(
			|ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))  //КАК К7
			|* РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|КАК ЧИСЛО(15, 2))  
			|* ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100
			|КАК ЧИСЛО(15, 2))
			|)  КАК ЧИСЛО(15, 2))
			|/РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
			|КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ , //КАК МесячнаяТарифнаяСтавка3,
			|
			|ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.РазмерСтавки1Разряда * ПриемНаРаботуВОрганизациюРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов       
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(ИзменениеПериодическихРеквизитовРаботникиОрганизации.РазмерСтавки1Разряда * ИзменениеПериодическихРеквизитовРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * ИзменениеПериодическихРеквизитовРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|ТОГДА ВЫБОР
			|КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|ТОГДА (ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПовышенныйКоэффициентЕТС КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ИтоговоеПовышениеПоИнструкции / 100 КАК ЧИСЛО(15, 2))) +
			|(ВЫРАЗИТЬ((ВЫРАЗИТЬ(КадровоеПеремещениеОрганизацийРаботникиОрганизации.РазмерСтавки1Разряда * КадровоеПеремещениеОрганизацийРаботникиОрганизации.КоэффициентЕТС КАК ЧИСЛО(15, 2))) * КадровоеПеремещениеОрганизацийРаботникиОрганизации.ПроцентПоКонтракту / 100 КАК ЧИСЛО(15, 2)))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|КОНЕЦ
			|КОНЕЦ,"; 
			
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|						ВЫБОР
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
			|											ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
			|											ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка 
			|КОНЕЦ 
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|												И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			| ИНАЧЕ 
			|ВЫБОР КОГДА ЕСТЬNULL(РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
			|ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка 
			|КОНЕЦ 
			|									КОНЕЦ
			|						КОНЕЦ,
			|						ВЫБОР
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ПриемНаРаботуВОрганизациюРаботникиОрганизации.МесячнаяТарифнаяСтавка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|									КОНЕЦ
			|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
			|								ТОГДА ВЫБОР
			|										КОГДА РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
			|											ТОГДА ВЫРАЗИТЬ(ТарифныеСтавкиРаботниковОрганизации.Ставка / РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 2))
			|										ИНАЧЕ ТарифныеСтавкиРаботниковОрганизации.Ставка
			|									КОНЕЦ
			|						КОНЕЦ,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|						ВЫБОР
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций
		|								ТОГДА ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|								ТОГДА ПриемНаРаботуВОрганизациюРаботникиОрганизации.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ИзменениеПериодическихРеквизитов
		|								ТОГДА ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|							КОГДА РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.КадровоеПеремещениеОрганизаций
		|								ТОГДА ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту
		|						КОНЕЦ) КАК РаботникиФакт
		|					ПО ШтатноеРасписание.ПодразделениеОрганизации = РаботникиФакт.ПодразделениеОрганизации
		|						И ШтатноеРасписание.Должность = РаботникиФакт.Должность
		|						И (ВЫБОР
		|								КОГДА ШтатноеРасписание.РазрядЕТС = ""0""
		|									ТОГДА """"
		|								ИНАЧЕ ШтатноеРасписание.РазрядЕТС
		|							КОНЕЦ = РаботникиФакт.РазрядЕТС
		|							ИЛИ ШтатноеРасписание.РазрядЕТС = РаботникиФакт.РазрядЕТС)
		
		|" + ?(Организация.ИНН = "101542412", " И ШтатноеРасписание.ГрафикРаботы = РаботникиФакт.ГрафикРаботы", "") + "
		
		|						И ШтатноеРасписание.КоэффициентЕТС = РаботникиФакт.КоэффициентЕТС
		|						И ШтатноеРасписание.ПовышенныйКоэффициентЕТС = РаботникиФакт.ПовышенныйКоэффициентЕТС
		|						И ШтатноеРасписание.ПроцентПоКонтракту = РаботникиФакт.ПроцентПоКонтракту
		|						И ";
		Если Факт Тогда
			ТекстЗапроса = ТекстЗапроса + "	
			|(";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|(ШтатноеРасписание.МесячнаяТарифнаяСтавка = РаботникиФакт.МесячнаяТарифнаяСтавка";
		
		Если Организация.ИНН = "101542412" Тогда  //Минск-Новости
			ТекстЗапроса = ТекстЗапроса + "
			|							ИЛИ ШтатноеРасписание.МесячнаяТарифнаяСтавка = РаботникиФакт.МесячнаяТарифнаяСтавкаПЛЮС_0_01  //Аверсон 28.06.2023 КВВ СВФР-010981
			|							ИЛИ ШтатноеРасписание.МесячнаяТарифнаяСтавка = РаботникиФакт.МесячнаяТарифнаяСтавка2
			|							ИЛИ ШтатноеРасписание.МесячнаяТарифнаяСтавка = РаботникиФакт.МесячнаяТарифнаяСтавка3";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|								ИЛИ ШтатноеРасписание.МесячнаяТарифнаяСтавка = РаботникиФакт.МесячнаяТарифнаяСтавка1)";
		
		Если Факт Тогда
			ТекстЗапроса = ТекстЗапроса + "	
			|ИЛИ
			| (
			|ВЫРАЗИТЬ(ШтатноеРасписание.МесячнаяТарифнаяСтавка КАК ЧИСЛО(15, 1)) = ВЫРАЗИТЬ(РаботникиФакт.МесячнаяТарифнаяСтавка КАК ЧИСЛО(15, 1))
			| )
			
			|ИЛИ
			| (
			|ВЫРАЗИТЬ(ШтатноеРасписание.МесячнаяТарифнаяСтавка КАК ЧИСЛО(15, 0)) = ВЫРАЗИТЬ(РаботникиФакт.МесячнаяТарифнаяСтавка КАК ЧИСЛО(15, 0))
			| )			
			
			| ) ";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|			ГДЕ
		|				ШтатноеРасписание.ЗанимаемыхСтавок - ЕСТЬNULL(РаботникиФакт.ЗанимаемыхСтавок, 0) <> 0
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ШтатноеРасписание.ПодразделениеОрганизации,
		|				ШтатноеРасписание.Должность,
		|				ШтатноеРасписание.РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ШтатноеРасписание.ГрафикРаботы,", "") + "
		
		|				ШтатноеРасписание.КоэффициентЕТС,
		|				ШтатноеРасписание.ПовышенныйКоэффициентЕТС,
		|				ШтатноеРасписание.МесячнаяТарифнаяСтавка,
		|				ШтатноеРасписание.ЗанимаемыхСтавок) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.ПодразделениеОрганизации,
		|			ВложенныйЗапрос.Должность,
		|			ВложенныйЗапрос.РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ВложенныйЗапрос.ГрафикРаботы,", "") + "
		
		|			ВложенныйЗапрос.КоэффициентЕТС,
		|			ВложенныйЗапрос.ПовышенныйКоэффициентЕТС,
		|			ВложенныйЗапрос.МесячнаяТарифнаяСтавка) КАК ВакантныеСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций.СрезПоследних(&Период, ) КАК ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				МАКСИМУМ(ПлановоеШтатноеРасписаниеОрганизаций.Период) КАК Период,
		|				ПлановоеШтатноеРасписаниеОрганизаций.Должность КАК Должность,
		|				ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		|			ИЗ
		|				РегистрСведений.ПлановоеШтатноеРасписаниеОрганизаций КАК ПлановоеШтатноеРасписаниеОрганизаций
		|			ГДЕ
		|				ПлановоеШтатноеРасписаниеОрганизаций.Период <= &Период
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПлановоеШтатноеРасписаниеОрганизаций.Должность,
		|				ПлановоеШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации) КАК ВложенныйЗапрос
		|			ПО ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = ВложенныйЗапрос.ПодразделениеОрганизации
		|				И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность = ВложенныйЗапрос.Должность
		|				И ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Период = ВложенныйЗапрос.Период
		|		ПО ВакантныеСтавки.ПодразделениеОрганизации = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации
		|			И (ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор.Организация = &Организация)
		|			И ВакантныеСтавки.Должность = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Должность
		|			И ВакантныеСтавки.РазрядЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.РазрядЕТС
		
		|" + ?(Организация.ИНН = "101542412", " И ВакантныеСтавки.ГрафикРаботы = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ГрафикРаботы", "") + "
		
		|			И ВакантныеСтавки.КоэффициентЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.КоэффициентЕТС
		|			И ВакантныеСтавки.ПовышенныйКоэффициентЕТС = ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПовышенныйКоэффициентЕТС
		|			И (ВакантныеСтавки.МесячнаяТарифнаяСтавка = ВЫБОР
		|				КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|					ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2)) //- 0.005
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2))
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка 
		|КОНЕЦ 
		|			КОНЕЦ)
		
		|" + ?(Организация.ИНН = "101542412", "", " ГДЕ ВакантныеСтавки.Свободно > 0") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ВакантныеСтавки.РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ВакантныеСтавки.ГрафикРаботы,", "") + "
		
		|	ВакантныеСтавки.ПодразделениеОрганизации,
		|	ВакантныеСтавки.Должность,
		|	ВакантныеСтавки.Свободно,
		|	ВакантныеСтавки.ЗанимаемыхСтавокПоШтатному,
		|	ВакантныеСтавки.ЗанимаемыхСтавокФакт,
		|	ВакантныеСтавки.КоэффициентЕТС,
		|	ВакантныеСтавки.ПовышенныйКоэффициентЕТС,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ИтоговоеПовышениеПоИнструкции,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПроцентПоКонтракту,
		|	ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.Регистратор,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифнаяСтавка 
		|КОНЕЦ 
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2)) //- 0.005
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок  КАК ЧИСЛО(15, 2))
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.МесячнаяТарифнаяСтавка 
		|КОНЕЦ 
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0 и ВЫБОР
		|			КОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок < 1
		|				ТОГДА ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец.ИНН <> ""190288027""
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ //О.Т. Аверсон 27.02.2018 № 1651(условие на ИНН)
		|			ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 3))
		| ИНАЧЕ 
		|ВЫБОР КОГДА ЕСТЬNULL(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок, 0) > 0 
		|ТОГДА ВЫРАЗИТЬ(ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции / ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЧИСЛО(15, 3))
		|ИНАЧЕ ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ТарифныйСПовышениемПоИнструкции 
		|КОНЕЦ 
		|	КОНЕЦ";
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация","ПлановоеШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТВакантные.ПодразделениеОрганизации,
		|	ВТВакантные.Должность,
		|	ВТВакантные.МесячнаяТарифнаяСтавка,
		|	ВТВакантные.Регистратор,
		|	ВТВакантные.Свободно,
		|	ВТВакантные.ЗанимаемыхСтавокПоШтатному,
		|	ВТВакантные.ЗанимаемыхСтавокФакт,
		|	ВТВакантные.РазмерСтавки1Разряда,
		|	ВТВакантные.РазрядЕТС,
		
		|" + ?(Организация.ИНН = "101542412", " ВТВакантные.ГрафикРаботы,", "") + "
		
		|	ВТВакантные.КоэффициентЕТС,
		|	ВТВакантные.ПовышенныйКоэффициентЕТС,
		|	ВТВакантные.ТарифнаяСтавка,
		|	ВТВакантные.ТарифныйСПовышениемПоИнструкции,
		|	ВТВакантные.ПроцентПоКонтракту,
		|	ВТВакантные.ИтоговоеПовышениеПоИнструкции
		|ИЗ
		|	ВТВакантные КАК ВТВакантные" ;
		
		
		Запрос.Текст = ТекстЗапроса;
		Результ = Запрос.Выполнить();
		
		ТекстЗапроса1 = "ВЫБРАТЬ
		|	ВТВакантные.ПодразделениеОрганизации,
		|	ВТВакантные.Должность,
		|	ВТВакантные.МесячнаяТарифнаяСтавка,
		|	ВТВакантные.Регистратор,
		|	ВложенныйЗапрос.Коэффициент,
		|	ВложенныйЗапрос.Размер КАК РазмерПовышения
		|ИЗ
		|	ВТВакантные КАК ВТВакантные
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Коэффициент КАК Коэффициент,
		|			ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Размер КАК Размер,
		|			ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.КодСтроки КАК Сотрудник,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Должность КАК Должность,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка КАК МесячнаяТарифнаяСтавка,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ПлановоеШтатноеРасписаниеОрганизаций.КоэфПовышенияТО КАК ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы
		|				ПО ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.КодСтроки = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.КодСтроки
		|				И ПлановоеШтатноеРасписаниеОрганизацийКоэфПовышенияТО.Ссылка = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Ссылка //Аверсон 05.05.2023 КВВ СВФР-010808
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Коэффициент,
		|			ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер,
		|			ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.КодСтроки,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.ПодразделениеОрганизации,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Должность,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.МесячнаяТарифнаяСтавка,
		|			ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Ссылка
		|		ИЗ
		|			Документ.ПлановоеШтатноеРасписаниеОрганизаций.ПовышенияПоИнструкции КАК ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлановоеШтатноеРасписаниеОрганизаций.ШтатныеЕдиницы КАК ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы
		|				ПО ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.КодСтроки = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.КодСтроки
		|				И ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Ссылка = ПлановоеШтатноеРасписаниеОрганизацийШтатныеЕдиницы.Ссылка //Аверсон 05.05.2023 КВВ СВФР-010808
		|		ГДЕ
		|			ПлановоеШтатноеРасписаниеОрганизацийПовышенияПоИнструкции.Размер <> 0) КАК ВложенныйЗапрос
		|		ПО ВТВакантные.ПодразделениеОрганизации = ВложенныйЗапрос.ПодразделениеОрганизации
		|			И ВТВакантные.Должность = ВложенныйЗапрос.Должность
		|			И ВТВакантные.МесячнаяТарифнаяСтавка = ВложенныйЗапрос.МесячнаяТарифнаяСтавка
		|			И ВТВакантные.Регистратор = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	ВложенныйЗапрос.Размер > 0";
		
		Запрос.Текст = ТекстЗапроса1;
		ТаблицаВакантноКоэф = Запрос.Выполнить().Выгрузить();
		
		Возврат Результ;
	КонецФункции
//Аверсон СВФР-016154

мМакет = ПолучитьМакет("МакетРабочие");

#КонецЕсли

