////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит соответствие доходов и положенных по ним вычетов
Перем мСоответствиеДоходовИВычетов;
Перем СЗОблагаемыеВРВместо; //Аверсон 31.01.2022 КВВ СВФР-008667

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда
	
	// Заполняет показатели
	//
Функция ЗаполнитьПоказатели(ТекущийСотрудник) Экспорт 
		
		Если ТекущийСотрудник = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТЗНачисления					= ОсновныеНачисления.Выгрузить(,"Сотрудник,ВидРасчета");
		ТЗДополнительныеНачисления		= ДополнительныеНачисления.Выгрузить(,"Сотрудник,ВидРасчета");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Начисления",ТЗНачисления);
		Запрос.УстановитьПараметр("ДополнительныеНачисления",ТЗДополнительныеНачисления);
		Запрос.УстановитьПараметр("ПарамДата",НачалоМесяца(ПериодРегистрации));
		
		// получим временную таблицу с сотрудниками и видами расчетов
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.ВидРасчета,
		|	Начисления.Сотрудник
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	&Начисления КАК Начисления";
		
		Запрос.Выполнить();
		
		ВТНачисления = "ВТНачисления";
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеНачисления.ВидРасчета,
		|	ДополнительныеНачисления.Сотрудник
		|ПОМЕСТИТЬ ВТДополнительныеНачисления
		|ИЗ
		|	&ДополнительныеНачисления КАК ДополнительныеНачисления";
		
		Запрос.Выполнить();
		
		ВТДополнительныеНачисления = "ВТДополнительныеНачисления";
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Показатель.ВидПоказателя КАК ВидПоказателя,
		|	ВложенныйЗапрос.Показатель,
		|	ВложенныйЗапрос.Сотрудник
		|ИЗ (
		|
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Показатели.Показатель.ВидПоказателя КАК ВидПоказателя,
		|		Показатели.Показатель,
		|		Начисления.Сотрудник
		|	ИЗ
		|		ВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
		|			ПО Показатели.Ссылка = Начисления.ВидРасчета
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|			И Не Показатели.Показатель.Предопределенный
		|	ГДЕ
		|		НЕ (Показатели.Показатель ЕСТЬ NULL)
		|		И НЕ (Начисления.Сотрудник ЕСТЬ NULL)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Показатели.Показатель.ВидПоказателя КАК ВидПоказателя,
		|		Показатели.Показатель,
		|		ДополнительныеНачисления.Сотрудник
		|	ИЗ
		|		ВТДополнительныеНачисления КАК ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели
		|			ПО Показатели.Ссылка = ДополнительныеНачисления.ВидРасчета
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется)
		|			И Показатели.Показатель.ВозможностьИзменения <> ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ПустаяСсылка)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная)
		|			И Показатели.Показатель.ТипПоказателя <> ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
		|			И Не Показатели.Показатель.Предопределенный) КАК ВложенныйЗапрос
		|ГДЕ
		|	НЕ (ВложенныйЗапрос.Показатель ЕСТЬ NULL)
		|	И НЕ (ВложенныйЗапрос.Сотрудник ЕСТЬ NULL)";
		
		
		ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
		ТаблицаЗапроса.Свернуть("ВидПоказателя,Показатель,Сотрудник");
		Показатели = ТаблицаЗапроса.ВыгрузитьКолонку("Показатель");
		Сотрудники = ТаблицаЗапроса.ВыгрузитьКолонку("Сотрудник");
		
		Если ЗначениеЗаполнено(ТаблицаЗапроса) Тогда
			
			ФормаВводаПоказателей = РегистрыСведений.ЗначенияПоказателейСхемМотивации.ПолучитьФорму("ФормаВводаЗначенийПоказателей");
			ФормаВводаПоказателей.Организация		= Справочники.Организации.ПустаяСсылка();
			ФормаВводаПоказателей.ПериодДействия	= НачалоМесяца(ПериодРегистрации);
			
			ФормаВводаПоказателей.Организация = Организация;
			ФормаВводаПоказателей.ФормаАвтозаполнение(ТаблицаЗапроса, Сотрудники, Показатели, , Ложь);
			ФормаВводаПоказателей.мСотрудникДляОткрытия = ТекущийСотрудник;
			ФормаВводаПоказателей.Открыть();
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецФункции //ЗаполнитьПоказатели
	
#КонецЕсли

Процедура Автозаполнение(ВременнаяТаблица = Неопределено, Реквизиты = Неопределено, ОсновноеНачисление = Истина,ДанныеСтроки = Неопределено) Экспорт
	
	Если ВременнаяТаблица = НеОпределено Тогда
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ВременнаяТаблица", ВременнаяТаблица);
	Запрос.УстановитьПараметр("ПарамВидРасчета",Реквизиты.ВидРасчета);
	Запрос.УстановитьПараметр("ПарамПериодРегистрации",ПериодРегистрации);
	Запрос.УстановитьПараметр("ПарамСотрудники",ВременнаяТаблица.ВыгрузитьКолонку("Сотрудник"));
	Запрос.УстановитьПараметр("ПарамОрганизация",Организация);
	Запрос.УстановитьПараметр("ПарамДатаНачала",Реквизиты.ДатаНачала);
	Запрос.УстановитьПараметр("ПарамДатаОкончания",Реквизиты.ДатаОкончания);
	Если Не ОсновноеНачисление Тогда
		Запрос.УстановитьПараметр("ПарамКодВычета",Реквизиты.КодВычета);
	КонецЕсли;
	Запрос.УстановитьПараметр("парамВалютаРегламентУчета" , Константы.ВалютаРегламентированногоУчета.Получить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.ПодразделениеОрганизации КАК Подразделение
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	&ВременнаяТаблица КАК ВременнаяТаблица
	|ИНДЕКСИРОВАТЬ ПО Сотрудник";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.Подразделение КАК Подразделение,
	|	НачисленияОрганизацийПоказатели.Показатель,
	|	НачисленияОрганизацийПоказатели.НомерСтроки
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	ПланВидовРасчета." + ?(ОсновноеНачисление,"ОсновныеНачисленияОрганизаций.Показатели", "ДополнительныеНачисленияОрганизаций.Показатели") + " КАК НачисленияОрганизацийПоказатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВременнаяТаблица
	|		ПО Истина
	|ГДЕ
	|	НачисленияОрганизацийПоказатели.Ссылка = &ПарамВидРасчета";
	
	
	Запрос.Выполнить();
	
	// таблица ВТЗначенияПоказателей
	// 
	// Поля:
	//   Сотрудник
	//   Показатель - введенный пользователем показатель
	//   Значение - значение показателя
	//
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияПоказателейСхемМотивации.Сотрудник КАК Сотрудник,
	|	Работники.ПодразделениеОрганизации КАК Подразделение,
	|	ЗначенияПоказателейСхемМотивации.Показатель КАК Показатель,
	|	ВЫБОР
	|		КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗначенияПоказателейСхемМотивации.Валюта В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|						ТОГДА
	|							ЗначенияПоказателейСхемМотивации.Значение
	|					ИНАЧЕ ЗначенияПоказателейСхемМотивации.Значение * ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
	|				КОНЕЦ
	|	ИНАЧЕ 
	|			ЗначенияПоказателейСхемМотивации.Значение
	|	КОНЕЦ 
	|			КАК Значение
	|ПОМЕСТИТЬ ВТЗначенияПоказателей
	|ИЗ
	|		(ВЫБРАТЬ
	|			Ежемесячно.Организация,
	|			Ежемесячно.Подразделение КАК Подразделение,
	|			Ежемесячно.Показатель КАК Показатель,
	|			Ежемесячно.Валюта КАК Валюта,
	|			Ежемесячно.Значение КАК Значение,
	|			Ежемесячно.Сотрудник КАК Сотрудник
	|		ИЗ
	|			РегистрСведений.ЗначенияПоказателейСхемМотивации КАК Ежемесячно
	|		ГДЕ
	|			Ежемесячно.Значение ЕСТЬ НЕ NULL 
	|			И Ежемесячно.Организация = &парамОрганизация
	|			И Ежемесячно.ПериодДействия >= &ПарамДатаНачала
	|			И Ежемесячно.ПериодДействия <= &ПарамДатаОкончания
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Организация,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Подразделение,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Показатель,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Валюта,
	|			ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних.Значение,
	|			NULL
	|		ИЗ
	|			РегистрСведений.ПериодическиеЗначенияПоказателейСхемМотивации.СрезПоследних(&ПарамДатаОкончания, Организация = &парамОрганизация) КАК ПериодическиеЗначенияПоказателейСхемМотивацииСрезПоследних) КАК ЗначенияПоказателейСхемМотивации
	
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ПарамДатаОкончания,
	|				Организация = &парамОрганизация
	|					И Сотрудник В (&ПарамСотрудники)) КАК Работники
	|		ПО (ВЫБОР
	|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
	|						ИЛИ ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя ЕСТЬ NULL 
	|					ТОГДА Работники.Сотрудник = ЗначенияПоказателейСхемМотивации.Сотрудник
	|				КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
	|					ТОГДА Работники.ПодразделениеОрганизации = ЗначенияПоказателейСхемМотивации.Подразделение
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
	|		ПО (Валюты.Период = &ПарамДатаОкончания)
	|			И ЗначенияПоказателейСхемМотивации.Валюта = Валюты.Валюта
	|ГДЕ
	|	ЗначенияПоказателейСхемМотивации.Показатель В(ВЫБРАТЬ Показатель Из ВТПоказатели)
	|	И ЗначенияПоказателейСхемМотивации.Организация = &парамОрганизация
	|	И ЗначенияПоказателейСхемМотивации.Значение ЕСТЬ НЕ NULL 
	|	И ВЫБОР
	|			КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный)
	|					ИЛИ ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя ЕСТЬ NULL 
	|				ТОГДА ЗначенияПоказателейСхемМотивации.Сотрудник В (&ПарамСотрудники)
	|			КОГДА ЗначенияПоказателейСхемМотивации.Показатель.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению)
	|				ТОГДА Работники.ПодразделениеОрганизации = ЗначенияПоказателейСхемМотивации.Подразделение
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель";
	Запрос.Выполнить();
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеНачисленияОрганизацийПоказатели.Показатель,
	|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка.ЗачетОтработанногоВремени,
	|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка,
	|	ОсновныеНачисленияОрганизацийПоказатели.НомерСтроки,
	|	ОсновныеНачисленияОрганизацийПоказатели.Ссылка.СпособРасчета
	|ПОМЕСТИТЬ ВТПоказателиИзПВР
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
	|ГДЕ
	|	ОсновныеНачисленияОрганизацийПоказатели.Показатель В (ВЫБРАТЬ Показатель Из ВТПоказатели)
	|				И (ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете)
	|					ИЛИ ОсновныеНачисленияОрганизацийПоказатели.Показатель.ВозможностьИзменения = ЗНАЧЕНИЕ(Перечисление.ИзменениеПоказателейСхемМотивации.НеИзменяется))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ИСТИНА,
	|	ОсновныеНачисленияОрганизаций.Ссылка,
	|	NULL,
	|	ОсновныеНачисленияОрганизаций.СпособРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияОрганизаций.Ссылка.ЗачетОтработанногоВремени 
	|	ИЛИ ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
	|	ИЛИ ОсновныеНачисленияОрганизаций.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
	|	
	|";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Работники.Сотрудник КАК Сотрудник,
	|	Работники.ПодразделениеОрганизации КАК Подразделение,
	|	Начисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	Показатели1.Показатель КАК ППоказатель1,
	|	Показатели2.Показатель КАК ППоказатель2,
	|	Показатели3.Показатель КАК ППоказатель3,
	|	Показатели4.Показатель КАК ППоказатель4,
	|	Показатели5.Показатель КАК ППоказатель5,
	|	Показатели6.Показатель КАК ППоказатель6,
	|	ВЫБОР
	|		КОГДА Показатели1.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|			ТОГДА ВЫБОР
	|					КОГДА Начисления.Валюта1 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|						ТОГДА Начисления.Показатель1
	|					ИНАЧЕ Начисления.Показатель1 * ЕСТЬNULL(Валюты1.Курс / Валюты1.Кратность, 0)
	|				КОНЕЦ
	|		КОГДА Показатели1.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|			ТОГДА ТарифныеРазряды1.Размер
	|		ИНАЧЕ Начисления.Показатель1
	|	КОНЕЦ КАК Показатель1,
	|	ВЫБОР КОГДА Показатели2.Показатель ЕСТЬ НЕ NULL ТОГДА
	|		ВЫБОР
	|			КОГДА Показатели2.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|				ТОГДА ВЫБОР
	|						КОГДА Начисления.Валюта2 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|							ТОГДА Начисления.Показатель2
	|						ИНАЧЕ Начисления.Показатель2 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
	|					КОНЕЦ
	|			КОГДА Показатели2.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|				ТОГДА ТарифныеРазряды2.Размер
	|			ИНАЧЕ Начисления.Показатель2
	|		КОНЕЦ
	|	КОНЕЦ КАК Показатель2,
	|	ВЫБОР КОГДА Показатели3.Показатель ЕСТЬ НЕ NULL ТОГДА
	|		ВЫБОР
	|			КОГДА Показатели3.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|				ТОГДА ВЫБОР
	|						КОГДА Начисления.Валюта3 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|							ТОГДА Начисления.Показатель3
	|						ИНАЧЕ Начисления.Показатель3 * ЕСТЬNULL(Валюты2.Курс / Валюты2.Кратность, 0)
	|					КОНЕЦ
	|			КОГДА Показатели3.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|				ТОГДА ТарифныеРазряды3.Размер
	|			ИНАЧЕ Начисления.Показатель3
	|		КОНЕЦ
	|	КОНЕЦ КАК Показатель3,
	|	ВЫБОР КОГДА Показатели4.Показатель ЕСТЬ НЕ NULL ТОГДА
	|		ВЫБОР
	|			КОГДА Показатели4.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|				ТОГДА ВЫБОР
	|						КОГДА Начисления.Валюта4 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|							ТОГДА Начисления.Показатель4
	|						ИНАЧЕ Начисления.Показатель4 * ЕСТЬNULL(Валюты4.Курс / Валюты4.Кратность, 0)
	|					КОНЕЦ
	|			КОГДА Показатели4.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|				ТОГДА ТарифныеРазряды4.Размер
	|			ИНАЧЕ Начисления.Показатель4
	|		КОНЕЦ
	|	КОНЕЦ КАК Показатель4,
	|	ВЫБОР КОГДА Показатели5.Показатель ЕСТЬ НЕ NULL ТОГДА
	|		ВЫБОР
	|			КОГДА Показатели5.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|				ТОГДА ВЫБОР
	|						КОГДА Начисления.Валюта5 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|							ТОГДА Начисления.Показатель5
	|						ИНАЧЕ Начисления.Показатель5 * ЕСТЬNULL(Валюты5.Курс / Валюты5.Кратность, 0)
	|					КОНЕЦ
	|			КОГДА Показатели5.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|				ТОГДА ТарифныеРазряды5.Размер
	|			ИНАЧЕ Начисления.Показатель5
	|		КОНЕЦ
	|	КОНЕЦ КАК Показатель5,
	|	ВЫБОР КОГДА Показатели6.Показатель ЕСТЬ НЕ NULL ТОГДА
	|		ВЫБОР
	|			КОГДА Показатели6.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.Денежный)
	|				ТОГДА ВЫБОР
	|						КОГДА Начисления.Валюта6 В (&парамВалютаРегламентУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|							ТОГДА Начисления.Показатель6
	|						ИНАЧЕ Начисления.Показатель6 * ЕСТЬNULL(Валюты6.Курс / Валюты6.Кратность, 0)
	|					КОНЕЦ
	|			КОГДА Показатели6.Показатель.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейСхемМотивации.ТарифныйРазряд)
	|				ТОГДА ТарифныеРазряды6.Размер
	|			ИНАЧЕ Начисления.Показатель6
	|		КОНЕЦ
	|	КОНЕЦ КАК Показатель6
	|ПОМЕСТИТЬ ВТПлановыеНачисления
	|ИЗ 
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|				&ПарамПериодРегистрации,
	|				Организация = &ПарамОрганизация
	|					И Сотрудник В (&ПарамСотрудники) И (ВидРасчета В (ВЫБРАТЬ Ссылка Из ВТПоказателиИзПВР))) КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ПарамДатаОкончания,
	|				Организация = &парамОрганизация
	|					И Сотрудник В (&ПарамСотрудники)) КАК Работники
	|		ПО (Работники.Сотрудник = Начисления.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты1
	|		ПО (Валюты1.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта1 = Валюты1.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты2
	|		ПО (Валюты2.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта2 = Валюты2.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты3
	|		ПО (Валюты3.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта3 = Валюты3.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты4
	|		ПО (Валюты4.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта4 = Валюты4.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты5
	|		ПО (Валюты5.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта5 = Валюты5.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты6
	|		ПО (Валюты6.Период = &ПарамДатаОкончания)
	|			И Начисления.Валюта6 = Валюты6.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды1
	|		ПО Начисления.ТарифныйРазряд1 = ТарифныеРазряды1.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды2
	|		ПО Начисления.ТарифныйРазряд2 = ТарифныеРазряды2.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды3
	|		ПО Начисления.ТарифныйРазряд3 = ТарифныеРазряды3.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды4
	|		ПО Начисления.ТарифныйРазряд4 = ТарифныеРазряды4.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды5
	|		ПО Начисления.ТарифныйРазряд5 = ТарифныеРазряды5.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ПарамДатаОкончания, ) КАК ТарифныеРазряды6
	|		ПО Начисления.ТарифныйРазряд6 = ТарифныеРазряды6.ТарифныйРазряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели1
	|			ПО Показатели1.Ссылка = Начисления.ВидРасчета
	|			И Показатели1.НомерСтроки = 1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели2
	|			ПО Показатели2.Ссылка = Начисления.ВидРасчета
	|			И Показатели2.НомерСтроки = 2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели3
	|			ПО Показатели3.Ссылка = Начисления.ВидРасчета
	|			И Показатели3.НомерСтроки = 3
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели4
	|			ПО Показатели4.Ссылка = Начисления.ВидРасчета
	|			И Показатели4.НомерСтроки = 4
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели5
	|			ПО Показатели5.Ссылка = Начисления.ВидРасчета
	|			И Показатели5.НомерСтроки = 5
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиИзПВР КАК Показатели6
	|			ПО Показатели6.Ссылка = Начисления.ВидРасчета
	|			И Показатели6.НомерСтроки = 6
	|ГДЕ
	|	Начисления.Показатель1 <> 0 ИЛИ Начисления.Показатель2 <> 0 ИЛИ Начисления.Показатель3 <> 0 ИЛИ Начисления.Показатель4 <> 0 ИЛИ Начисления.Показатель5 <> 0 ИЛИ Начисления.Показатель6 <> 0 ";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ПарамВидРасчета КАК ВидРасчета,
	|	&ПарамДатаНачала КАК ДатаНачала,
	|	&ПарамДатаОкончания КАК ДатаОкончания,
	|	&ПарамДатаНачала КАК ДатаНачалаСобытия,
	|	ИСТИНА КАК Авторасчет,";
	Если Не ОсновноеНачисление Тогда
		Запрос.Текст = Запрос.Текст + "
		|	&ПарамКодВычета КАК КодВычета,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	Показатели.Сотрудник,
	|	Показатели.Подразделение КАК ПодразделениеОрганизации,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 1
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель1,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 2
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель2,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 3
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель3,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 4
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель4,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 5
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель5,
	|	СУММА(ВЫБОР
	|			КОГДА Показатели.НомерСтроки = 6
	|				ТОГДА ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя
	|		КОНЕЦ) КАК Показатель6
	|ИЗ
	|	ВТПоказатели КАК Показатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник КАК Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ПлановыеНачисления.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|			ПлановыеНачисления.СпособРасчета КАК СпособРасчета,
	|			ПлановыеНачисления.ППоказатель1 КАК Показатель,
	|			ПлановыеНачисления.Показатель1 КАК ЗначениеПоказателя
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ПлановыеНачисления.ППоказатель2,
	|			ПлановыеНачисления.Показатель2
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ПлановыеНачисления.ППоказатель3,
	|			ПлановыеНачисления.Показатель3
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ПлановыеНачисления.ППоказатель4,
	|			ПлановыеНачисления.Показатель4
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ПлановыеНачисления.ППоказатель5,
	|			ПлановыеНачисления.Показатель5
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ПлановыеНачисления.Сотрудник,
	|			ПлановыеНачисления.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ПлановыеНачисления.ППоказатель6,
	|			ПлановыеНачисления.Показатель6
	|		ИЗ
	|			ВТПлановыеНачисления КАК ПлановыеНачисления
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ЗначенияПоказателей.Сотрудник,
	|			ЗначенияПоказателей.Подразделение КАК Подразделение,
	|			ЛОЖЬ,
	|			NULL,
	|			ЗначенияПоказателей.Показатель,
	|			ЗначенияПоказателей.Значение
	|		ИЗ
	|			ВТЗначенияПоказателей КАК ЗначенияПоказателей) КАК ЗначенияПлановыхИФактическихПоказателей
	|		ПО (ЗначенияПлановыхИФактическихПоказателей.Показатель = Показатели.Показатель И ЗначенияПлановыхИФактическихПоказателей.ЗначениеПоказателя <> 0
	|				ИЛИ Показатели.Показатель.ТарифнаяСтавка
	|					И ЗначенияПлановыхИФактическихПоказателей.ЗачетОтработанногоВремени
	|				ИЛИ Показатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная)
	|					И ЗначенияПлановыхИФактическихПоказателей.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
	|				ИЛИ Показатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаДневная)
	|					И ЗначенияПлановыхИФактическихПоказателей.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
	|				ИЛИ Показатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая)
	|					И ЗначенияПлановыхИФактическихПоказателей.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок)))	
	|			И (Показатели.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Индивидуальный) И Показатели.Сотрудник = ЗначенияПлановыхИФактическихПоказателей.Сотрудник
	|			ИЛИ Показатели.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.ПоПодразделению) И Показатели.Подразделение = ЗначенияПлановыхИФактическихПоказателей.Подразделение
	|			ИЛИ Показатели.Показатель.ВидПоказателя = Значение(Перечисление.ВидыПоказателейСхемМотивации.Общий))
	|ГДЕ Показатели.Сотрудник ЕСТЬ НЕ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Показатели.Сотрудник,
	|	Показатели.Подразделение";
	
	Если ДанныеСтроки = Неопределено Тогда 
		
		//Аверсон ЕАЕ 18.12.2025 СВФР-017588
		//Если сотрудник работает например по часовой тарифной ставке, а среди показателей начисления месячная - возьмем значение из РС Тарифные ставки
		Если Организация.ИНН = "700103211" Тогда
			ТЗРезультат = Запрос.Выполнить().Выгрузить();
			Для Каждого Стр Из ТЗРезультат Цикл
				ВР = Стр.ВидРасчета;
				Если ЗначениеЗаполнено(ВР) Тогда
					Сп = ВР.СпособРасчета;
					Если Сп = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
						Для н = 1 По 6 Цикл
							НаимПоказателя = "Показатель" + СокрЛП(н);
							Если ЗначениеЗаполнено(Стр[НаимПоказателя]) Тогда
								ПоказателиВР = ВР.Показатели;
								НужнаяСтрПоказатель = ПоказателиВР.Найти(н, "НомерСтроки");
								Если НужнаяСтрПоказатель <> Неопределено Тогда
									Если НужнаяСтрПоказатель.Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная Тогда
										Стр[НаимПоказателя] = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Дата, Новый Структура("Сотрудник", Стр.Сотрудник)).Ставка;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ОсновноеНачисление Тогда
				ОсновныеНачисления.Загрузить(ТЗРезультат);
			Иначе
				ДополнительныеНачисления.Загрузить(ТЗРезультат);
			КонецЕсли;
		Иначе
		//Аверсон СВФР-017588
			
			Если ОсновноеНачисление Тогда
				ОсновныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
			Иначе
				ДополнительныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
			КонецЕсли;
		КонецЕсли;
	иначе
		
		//Аверсон ЕАЕ 18.12.2025 СВФР-017588
		//Если сотрудник работает например по часовой тарифной ставке, а среди показателей начисления месячная - возьмем значение из РС Тарифные ставки
		Если Организация.ИНН = "700103211" Тогда
			ТЗРезультат = Запрос.Выполнить().Выгрузить();
			Для Каждого Стр Из ТЗРезультат Цикл
				ВР = Стр.ВидРасчета;
				Если ЗначениеЗаполнено(ВР) Тогда
					Сп = ВР.СпособРасчета;
					Если Сп = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
						Для н = 1 По 6 Цикл
							НаимПоказателя = "Показатель" + СокрЛП(н);
							Если ЗначениеЗаполнено(Стр[НаимПоказателя]) Тогда
								ПоказателиВР = ВР.Показатели;
								НужнаяСтрПоказатель = ПоказателиВР.Найти(н, "НомерСтроки");
								Если НужнаяСтрПоказатель <> Неопределено Тогда
									Если НужнаяСтрПоказатель.Показатель = Справочники.ПоказателиСхемМотивации.ТарифнаяСтавкаМесячная Тогда
										Стр[НаимПоказателя] = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(Дата, Новый Структура("Сотрудник", Стр.Сотрудник)).Ставка;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ТЗРезультат.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТЗРезультат[0]);	
			КонецЕсли;
		Иначе
			//Аверсон СВФР-017588
			
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда 
				ЗаполнитьЗначенияСвойств(ДанныеСтроки,Результат);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //Автозаполнение

// Выполняет расчет основных и дополнительных записей начислений
//
Процедура РассчитатьНачисления(ТекФизЛицо = Неопределено) Экспорт
	
	СЗОблагаемыеВРВместо = Новый СписокЗначений;  //Аверсон 31.01.2022 КВВ СВФР-008667
	
	Отказ = Ложь;
	
	// Перечитаем объект и соберем данные для заполнения наборов записей регистров
	НачатьТранзакцию();
	Прочитать();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
	ВыборкаПоДопНачислениям = СформироватьЗапросПоДопНачисления().Выбрать();
	ЗафиксироватьТранзакцию();
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	
	// создадим наборы записей для выполнения движений
	НаборОсновныеНачисления = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборОсновныеНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	НаборДопНачисления = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборДопНачисления.Отбор.Регистратор.Значение = Ссылка;
	
	// Если почасовое отклонение, то записываем движения в регистр ВнутрисменноеВремяРаботниковОрганизаций
	НаборЗаписейРабочееВремя = РегистрыНакопления.ВнутрисменноеВремяРаботниковОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписейРабочееВремя.Отбор.Регистратор.Значение = Ссылка;
	
	// получим реквизиты табличной части
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, НаборОсновныеНачисления);
			Если ВыборкаПоНачислениям.СторнируемыйДокумент <> ВыборкаПоШапкеДокумента.ПерерассчитываемыйДокумент Тогда
				ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, НаборЗаписейРабочееВремя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыборкаПоДопНачислениям.Количество() > 0 Тогда
		//мСоответствиеДоходовИВычетов = ПроведениеРасчетов.ПолучитьСоответствиеДоходовИВычетов();
		Пока ВыборкаПоДопНачислениям.Следующий() Цикл
			ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоДопНачислениям, Отказ, Заголовок);
			Если НЕ Отказ Тогда
				// Заполним записи в наборах записей регистров
				ДобавитьСтрокуДопНачислений(ВыборкаПоДопНачислениям, ВыборкаПоШапкеДокумента, НаборДопНачисления);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейРабочееВремя.Записать();
	
	// Получим дополнительные записи, имеющие признак сторно, которые необходимо добавить 
	// в текущий набор для того, чтобы в результате сохранения получился максимальный 
	// фактический период действия
	ТаблицаСторноЗаписей = ПроведениеРасчетов.ПолучитьТаблицуСторноЗаписей(НаборОсновныеНачисления.ПолучитьДополнение());
	Для каждого СтрокаСторно Из ТаблицаСторноЗаписей Цикл
		// Заполним записи в наборе записей регистра
		// и в табличной части
		ДобавитьСтрокуСторно(НаборОсновныеНачисления, ОсновныеНачисления, СтрокаСторно);
	КонецЦикла;
	
	// перед тем как начать расчет, сформированные движения надо записать - 
	// по ним чуть позже будем получать дополнительные данные для расчетов
	
	// рассчитываем записи
	// при этом передаем не только набор записей регистра расчета, но и набор записей регисра 
	// накопления со сведениями об отработанном времени
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", НаборОсновныеНачисления, Неопределено, , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОсновныеНачисления);
	// запишем результат расчета для расчета доп. начислений
	НаборОсновныеНачисления.Записать(Истина, Истина);
 
	ПроведениеРасчетов.РассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", НаборДопНачисления, Неопределено, , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ДополнительныеНачисления,,,,,,,ТекФизЛицо);//О.Т. 11.09.2014 № 17594
	
	//ПроведениеРасчетов.СкорректироватьНормируемыеВычетыПоНДФЛ(ЭтотОбъект);	
	
	// Удаляем движения
	НаборОсновныеНачисления.Очистить();
	НаборОсновныеНачисления.Записать();
	
	НаборДопНачисления.Очистить();
	НаборДопНачисления.Записать();
	
	НаборЗаписейРабочееВремя.Очистить();
	НаборЗаписейРабочееВремя.Записать();
	
КонецПроцедуры // РассчитатьНачисления()

// Выполняет расчет вычетов по НДФЛ согласно ст. 217 и 221 НК РФ
//
Процедура РассчитатьВычеты() Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	Отказ = Ложь;
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = СформироватьЗапросПоДопНачисления();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоДопНачислениям = РезультатЗапроса.Выбрать();
	
	//Аверсон ЕАЕ 04.10.2021 СВФР-008218 (нет такой функции)
	//мСоответствиеДоходовИВычетов = ПроведениеРасчетов.ПолучитьСоответствиеДоходовИВычетов();
	//Аверсон СВФР-008218
	
	Пока ВыборкаПоДопНачислениям.Следующий() Цикл
		ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоДопНачислениям, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамОрганизация",					ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамРегистратор",					Ссылка);
	Запрос.УстановитьПараметр("парамПериодРегистрации",				НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаНалоговогоПериода",	КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоГода",					НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода",						КонецГода(ПериодРегистрации));
	
	// прочитаем т.ч. документа и добавим в каждую строку Физлицо сотрудника и КодДоходаНДФЛ начисления
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Работники.НомерСтроки,
	|	Работники.Сотрудник,
	|	Работники.Сотрудник.Физлицо КАК Физлицо,
	|	Работники.ВидРасчета,
	|	Работники.ВидРасчета.КодДоходаНДФЛ КАК КодДохода,
	|	Работники.ДатаНачала,
	|	Работники.ДатаОкончания,
	|	Работники.Показатель1,
	|	Работники.Показатель2,
	|	Работники.Показатель3,
	|	Работники.Показатель4,
	|	Работники.Показатель5,
	|	Работники.Показатель6,
	|	Работники.Результат,
	|	Работники.ПодразделениеОрганизации,
	|	Работники.Сторно,
	|	Работники.КодВычета,
	|	Работники.СуммаВычета,
	|	Работники.Авторасчет,
	|	Работники.ОплаченоДнейЧасов,
	|	Работники.СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТРаботники
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Работники
	|ГДЕ
	|	Работники.Ссылка = &парамРегистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	КодДохода";
	Запрос.Выполнить();
	
	// рассчитаем нормативный вычет по авторским вознаграждениям по ст. 221 НК РФ
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияРаботников.Сотрудник,
	|	НачисленияРаботников.Физлицо,
	|	НачисленияРаботников.Авторасчет,
	|	НачисленияРаботников.ВидРасчета,
	|	НачисленияРаботников.ДатаНачала,
	|	НачисленияРаботников.ДатаОкончания,
	|	НачисленияРаботников.Показатель1,
	|	НачисленияРаботников.Показатель2,
	|	НачисленияРаботников.Показатель3,
	|	НачисленияРаботников.Показатель4,
	|	НачисленияРаботников.Показатель5,
	|	НачисленияРаботников.Показатель6,
	|	НачисленияРаботников.Результат,
	|	НачисленияРаботников.ОплаченоДнейЧасов,
	|	НачисленияРаботников.ПодразделениеОрганизации,
	|	НачисленияРаботников.Сторно,
	|	НачисленияРаботников.СторнируемыйДокумент,
	|	НачисленияРаботников.КодВычета,
	|	ВЫБОР
	|		КОГДА НачисленияРаботников.Авторасчет
	|				И НачисленияРаботников.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код405)
	|				И НеРезиденты.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА НачисленияРаботников.Результат * СведенияОСкидках.НормативЗатрат / 100
	|		ИНАЧЕ НачисленияРаботников.СуммаВычета
	|	КОНЕЦ КАК СуммаВычета
	|ИЗ
	|	ВТРаботники КАК НачисленияРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛВычетыПоДоходам.СрезПоследних(&парамНачалоГода, ) КАК СведенияОСкидках
	|		ПО НачисленияРаботников.КодДохода = СведенияОСкидках.КодДохода
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
	|		ИЗ
	|			РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|					&парамКонецГода,
	|					Физлицо В
	|						(ВЫБРАТЬ
	|							Работники.Физлицо
	|						ИЗ
	|							ВТРаботники КАК Работники)) КАК ГражданствоФизЛицСрезПоследних
	|		ГДЕ
	|			ГражданствоФизЛицСрезПоследних.НеЯвляетсяНалоговымРезидентомРФ) КАК НеРезиденты
	|		ПО НачисленияРаботников.Физлицо = НеРезиденты.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияРаботников.НомерСтроки";
	
	ДополнительныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ДоходыП28Ст217 = Новый Массив;
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2761);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2720);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2730);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2740);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2760);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2770);
	ДоходыП28Ст217.Добавить(Справочники.ДоходыНДФЛ.Код2790);
	Запрос.УстановитьПараметр("ДоходыП28Ст217", ДоходыП28Ст217);
	
	// получим "еще неизрасходованные" размеры вычета, предусмотренного общей суммой на налоговый период
	// п. 28 ст. 217 НК РФ
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияРаботников.Физлицо КАК Физлицо,
	|	НачисленияРаботников.КодВычета КАК КодВычета,
	|	ВЫБОР
	|		КОГДА СведенияОСкидках.ГодовойВычет ЕСТЬ NULL 
	|			ТОГДА 0
	|		КОГДА СведенияОСкидках.ГодовойВычет > ЕСТЬNULL(НДФЛОбороты.СуммаВычетаОборот, 0)
	|			ТОГДА СведенияОСкидках.ГодовойВычет - ЕСТЬNULL(НДФЛОбороты.СуммаВычетаОборот, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВычета
	|ИЗ
	|	ВТРаботники КАК НачисленияРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛСведенияОДоходах.Обороты(
	|				&парамНачалоГода,
	|				&парамКонецМесяцаНалоговогоПериода,
	|				,
	|				ПериодРегистрации <= &парамПериодРегистрации
	|					И Организация = &парамОрганизация
	|					И КодДохода В (&ДоходыП28Ст217)
	|					И Физлицо В
	|						(ВЫБРАТЬ
	|							Работники.Физлицо
	|						ИЗ
	|							ВТРаботники КАК Работники
	|						ГДЕ
	|							Работники.КодДохода В (&ДоходыП28Ст217))) КАК НДФЛОбороты
	|		ПО НачисленияРаботников.КодДохода = НДФЛОбороты.КодДохода
	|			И НачисленияРаботников.Физлицо = НДФЛОбороты.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛВычетыПоДоходам.СрезПоследних(&парамНачалоГода, ) КАК СведенияОСкидках
	|		ПО НачисленияРаботников.КодДохода = СведенияОСкидках.КодДохода
	|ГДЕ
	|	НачисленияРаботников.КодДохода В(&ДоходыП28Ст217)
	|	И НачисленияРаботников.Авторасчет
	|	И (НЕ НачисленияРаботников.Сторно)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Физлицо,
	|	КодВычета";
	ТаблицаВычетов = Запрос.Выполнить().Выгрузить();
	ТаблицаВычетов.Индексы.Добавить("Физлицо,КодВычета");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияРаботников.Физлицо КАК Физлицо,
	|	НачисленияРаботников.КодВычета КАК КодВычета,
	|	НачисленияРаботников.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТРаботники КАК НачисленияРаботников
	|ГДЕ
	|	НачисленияРаботников.КодДохода В(&ДоходыП28Ст217)
	|	И НачисленияРаботников.Авторасчет
	|	И (НЕ НачисленияРаботников.Сторно)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Физлицо,
	|	КодВычета,
	|	НомерСтроки";
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураПоиска = Новый Структура("Физлицо,КодВычета");
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ДополнительныеНачисления.Найти(Выборка.НомерСтроки,"НомерСтроки");
		Если СтрокаТЧ <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,Выборка);
			СтрокаВычета = ТаблицаВычетов.НайтиСтроки(СтруктураПоиска)[0];
			Если СтрокаВычета.СуммаВычета = 0 Тогда
				СтрокаТЧ.СуммаВычета = 0
			ИначеЕсли СтрокаТЧ.Результат > 0 Тогда
				СтрокаТЧ.СуммаВычета = Мин(СтрокаТЧ.Результат, СтрокаВычета.СуммаВычета);
				СтрокаВычета.СуммаВычета = Макс(0, СтрокаВычета.СуммаВычета - СтрокаТЧ.СуммаВычета);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // РассчитатьВычеты()

// Выполняет перерасчет по заданному списку физлиц
// Если передан пустой список физлиц - перерасчет не проводится
// Если в качестве списка физлиц передан не массив, а Неопределено - перерасчет по всем физлицам 
// регистратора по которым требуется перерасчет
//
// Параметры
// 	Физлица - список значений - ссылки на физлиц
// Возвращаемое значение
//  Нет
//
Процедура Перерассчитать(Физлица = Неопределено) Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	Если Не ПроведениеРасчетов.НеобходимостьПерерасчета(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// получим список перерассчитываемых физлиц
	ФизлицаСписок = Новый СписокЗначений;
	Если Физлица = Неопределено Тогда
		// таблица ФизлицаДляПерерасчета
		// Список физлиц по которым необходимо выполнить перерасчет
		// Поля:
		//		ФизЛицо
		// Описание:
		// Получает список неповторяющихся физлиц по которым есть записи
		// перерасчета в одной из таблиц перерасчета - по основным или дополнительным начислениям
		//
		ФизлицаДляПерерасчетаТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Перерасчет.ФизЛицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		Перерасчет.ФизЛицо
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
		|	
		|	ГДЕ
		|		Перерасчет.ОбъектПерерасчета = &парамРегистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Перерасчет.ФизЛицо
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
		|	
		|	ГДЕ
		|		Перерасчет.ОбъектПерерасчета = &парамРегистратор) КАК Перерасчет";
		
		Запрос = Новый Запрос(ФизлицаДляПерерасчетаТекст);
		Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
		ФизлицаСписок.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо"));
		
	Иначе
		ФизлицаСписок = Физлица;
		
	КонецЕсли;
	
	// если не перерассчитываем никого - возврат
	Если ФизлицаСписок.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// читаем все данные в одной транзакции
	НачатьТранзакцию();
	Прочитать();
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// прочитать движения
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Прочитать();
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Прочитать();
	Движения.НДФЛСведенияОДоходах.Прочитать();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Прочитать();
	ЗафиксироватьТранзакцию();
	
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	////////////////////////////////////////////////////////////////////////
	// Основные, дополнительные начисления и сведения о доходах НДФЛ
	
	// сначала удалим сведения о доходах НДФЛ по перерассчитываемым физлицам
	НДФЛСведенияОДоходах = Движения.НДФЛСведенияОДоходах;
	ПоследнееДвижение = НДФЛСведенияОДоходах.Количество()-1;
	Для Сч = 0 По ПоследнееДвижение Цикл
		// удалим записи по всем физлицам полученного списка
		// обходим в обратном порядке
		Если ФизлицаСписок.НайтиПоЗначению(НДФЛСведенияОДоходах[ПоследнееДвижение - Сч].Физлицо) <> Неопределено Тогда
			НДФЛСведенияОДоходах.Удалить(ПоследнееДвижение - Сч);
		КонецЕсли;
	КонецЦикла;
	
	// перерассчитываем записи начислений
	// при этом передаем не только набор записей регистра расчета, но и набор записей регистра 
	// накопления со сведениями об отработанном времени
	// а также таблицу значений в которую будет заполнять движения для НДФЛСведенияОДоходах
	ДвиженияНДФЛСведенияОДоходах = Движения.НДФЛСведенияОДоходах.Выгрузить();// фактически - создаем структуру таблицы значений
	
	ПроведениеРасчетов.ПереРассчитатьЗаписиРегистраРасчета("ОсновныеНачисленияРаботниковОрганизаций", Движения.ОсновныеНачисленияРаботниковОрганизаций, Физлица, ДвиженияНДФЛСведенияОДоходах, , ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОсновныеНачисления);
	// запишем без выполнения пересчета фактического периода действия
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записать(Истина, Истина);
	
	ПроведениеРасчетов.ПереРассчитатьЗаписиРегистраРасчета("ДополнительныеНачисленияРаботниковОрганизаций", Движения.ДополнительныеНачисленияРаботниковОрганизаций, Физлица, ДвиженияНДФЛСведенияОДоходах,, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ДополнительныеНачисления);
	// запишем набор
	Движения.ДополнительныеНачисленияРаботниковОрганизаций.Записать(Истина, Истина);
	
	// запишем движения по доходам НДФЛ, которые формируются при ПереРассчитатьЗаписиРегистраРасчета
	ПроведениеРасчетов.СвернутьДвиженияНДФЛСведенияОДоходах(ДвиженияНДФЛСведенияОДоходах);
	Движения.НДФЛСведенияОДоходах.Загрузить(ДвиженияНДФЛСведенияОДоходах);
	Движения.НДФЛСведенияОДоходах.Записать();
	
	// записываем документ перед вызовом СформироватьВзаиморасчетыСРаботниками
	Записать();
	
	////////////////////////////////////////////////////////////////////////
	// взаиморасчеты с работниками
	
	// сначала удалим сведения о взаиморасчетах с работниками
	ВзаиморасчетыСРаботникамиОрганизаций = Движения.ВзаиморасчетыСРаботникамиОрганизаций;
	ПоследнееДвижение = ВзаиморасчетыСРаботникамиОрганизаций.Количество()-1;
	Для Сч = 0 По ПоследнееДвижение Цикл
		// удалим записи по всем физлицам полученного списка
		// обходим в обратном порядке
		Если ФизлицаСписок.НайтиПоЗначению(ВзаиморасчетыСРаботникамиОрганизаций[ПоследнееДвижение - Сч].Физлицо) <> Неопределено Тогда
			ВзаиморасчетыСРаботникамиОрганизаций.Удалить(ПоследнееДвижение - Сч);
		КонецЕсли;
	КонецЦикла;
	
	// ведется ли учет задолженности в разрезе периодов возникновения задолженности
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	// теперь сформируем начисления к выплате по начислениям документа для перерассчитываемых работников
	СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, Движения.ВзаиморасчетыСРаботникамиОрганизаций, УчетЗадолженностиПоМесяцам, Истина, Физлица);
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записать();
	
	////////////////////////////////////////////////////////////////////////
	// Удалим записи перерасчета по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	
КонецПроцедуры // Перерассчитать()

// Заполняет документ по перерассчитываемому документу
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Знач Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
	"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПерерассчитываемыйДокумент", ПерерассчитываемыйДокумент);
	
	Если Сотрудники = "ПоДаннымПерерасчета" Тогда
		
		Исправления = ПроведениеРасчетов.ПолучитьДокументИсправление(ПерерассчитываемыйДокумент, "КритерийОтбора"); 
		Запрос.УстановитьПараметр("Исправления", Исправления);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудникиИсправлений
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Начисления
		|ГДЕ
		|	Начисления.Ссылка В(&Исправления)
		|	И Начисления.СторнируемыйДокумент = &ПерерассчитываемыйДокумент
		|	И Начисления.Сторно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Начисления.Сотрудник
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
		|ГДЕ
		|	Начисления.Ссылка В(&Исправления)
		|	И Начисления.СторнируемыйДокумент = &ПерерассчитываемыйДокумент
		|	И Начисления.Сторно
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Сотрудник
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &ПерерассчитываемыйДокумент
		|	И (НЕ СотрудникиОрганизаций.Сотрудник В
		|				(ВЫБРАТЬ
		|					Начисления.Сотрудник
		|				ИЗ
		|					ВТСотрудникиИсправлений КАК Начисления))
		|	И СотрудникиОрганизаций.Физлицо В
		|			(ВЫБРАТЬ
		|				Перерасчет.ФизЛицо
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
		|			ГДЕ
		|				Перерасчет.ОбъектПерерасчета = &ПерерассчитываемыйДокумент)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СотрудникиОрганизаций.Сотрудник
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Ссылка = &ПерерассчитываемыйДокумент
		|	И (НЕ СотрудникиОрганизаций.Сотрудник В
		|				(ВЫБРАТЬ
		|					Начисления.Сотрудник
		|				ИЗ
		|					ВТСотрудникиИсправлений КАК Начисления))
		|	И СотрудникиОрганизаций.Физлицо В
		|			(ВЫБРАТЬ
		|				Перерасчет.ФизЛицо
		|			ИЗ
		|				РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
		|			ГДЕ
		|				Перерасчет.ОбъектПерерасчета = &ПерерассчитываемыйДокумент)";
		Сотрудники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("ПоВсемСотрудникам", Сотрудники = Неопределено);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.Показатель1,
	|	Начисления.Показатель2,
	|	Начисления.Показатель3,
	|	Начисления.Показатель4,
	|	Начисления.Показатель5,
	|	Начисления.Показатель6,
	|	Начисления.ПодразделениеОрганизации,
	|	-Начисления.Результат - ЕСТЬNULL(СУММА(СторноНачисления.Результат), 0) КАК Результат,
	|	-Начисления.ОтработаноДней - ЕСТЬNULL(СУММА(СторноНачисления.ОтработаноДней), 0) КАК ОтработаноДней,
	|	-Начисления.ОтработаноЧасов - ЕСТЬNULL(СУММА(СторноНачисления.ОтработаноЧасов), 0) КАК ОтработаноЧасов,
	|	-Начисления.ОтработаноДнейПоПятидневке - ЕСТЬNULL(СУММА(СторноНачисления.ОтработаноДнейПоПятидневке), 0) КАК ОтработаноДнейПоПятидневке,
	|	-Начисления.НормаДней - ЕСТЬNULL(СУММА(СторноНачисления.НормаДней), 0) КАК НормаДней,
	|	-Начисления.НормаЧасов - ЕСТЬNULL(СУММА(СторноНачисления.НормаЧасов), 0) КАК НормаЧасов,
	|	-Начисления.НормаДнейПоПятидневке - ЕСТЬNULL(СУММА(СторноНачисления.НормаДнейПоПятидневке), 0) КАК НормаДнейПоПятидневке,
	|	-Начисления.ОплаченоДнейЧасов - ЕСТЬNULL(СУММА(СторноНачисления.ОплаченоДнейЧасов), 0) КАК ОплаченоДнейЧасов,
	|	-Начисления.ОтработаноЧасовПоПятидневке - ЕСТЬNULL(СУММА(СторноНачисления.ОтработаноЧасовПоПятидневке), 0) КАК ОтработаноЧасовПоПятидневке,
	|	-Начисления.НормаЧасовПоПятидневке - ЕСТЬNULL(СУММА(СторноНачисления.НормаЧасовПоПятидневке), 0) КАК НормаЧасовПоПятидневке,
	|	Начисления.ДатаНачалаСобытия,
	|	Начисления.ОплачиватьЧасов,
	|	ИСТИНА КАК Сторно,
	|	ЛОЖЬ КАК Авторасчет,
	|	Начисления.Ссылка КАК СторнируемыйДокумент,
	|	Начисления.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК СторноНачисления
	|		ПО Начисления.Сотрудник = СторноНачисления.Сотрудник
	|			И Начисления.ВидРасчета = СторноНачисления.ВидРасчета
	|			И (СторноНачисления.ПериодДействияНачало МЕЖДУ Начисления.ДатаНачала И Начисления.ДатаОкончания)
	|			И (СторноНачисления.ПериодДействияКонец МЕЖДУ Начисления.ДатаНачала И Начисления.ДатаОкончания)
	|			И (СторноНачисления.ПериодРегистрации > Начисления.Ссылка.ПериодРегистрации)
	|			И (СторноНачисления.ПериодРегистрации < &ПериодРегистрации)
	|			И (СторноНачисления.СторнируемыйДокумент = Начисления.Ссылка)
	|			И (СторноНачисления.Сторно)
	|ГДЕ
	|	Начисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ Начисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ Начисления.Сотрудник В (&Сотрудники))
	|	И Начисления.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.Показатель1,
	|	Начисления.Показатель2,
	|	Начисления.Показатель3,
	|	Начисления.Показатель4,
	|	Начисления.Показатель5,
	|	Начисления.Показатель6,
	|	Начисления.ПодразделениеОрганизации,
	|	Начисления.ДатаНачалаСобытия,
	|	Начисления.ОплачиватьЧасов,
	|	Начисления.НомерСтроки,
	|	Начисления.Результат,
	|	Начисления.ОтработаноДней,
	|	Начисления.ОтработаноЧасов,
	|	Начисления.ОтработаноДнейПоПятидневке,
	|	Начисления.НормаДней,
	|	Начисления.НормаЧасов,
	|	Начисления.НормаДнейПоПятидневке,
	|	Начисления.ОплаченоДнейЧасов,
	|	Начисления.ОтработаноЧасовПоПятидневке,
	|	Начисления.НормаЧасовПоПятидневке,
	|	Начисления.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.Показатель1,
	|	Начисления.Показатель2,
	|	Начисления.Показатель3,
	|	Начисления.Показатель4,
	|	Начисления.Показатель5,
	|	Начисления.Показатель6,
	|	Начисления.ПодразделениеОрганизации,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Начисления.ДатаНачалаСобытия,
	|	Начисления.ОплачиватьЧасов,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	NULL,
	|	Начисления.НомерСтроки
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ Начисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ Начисления.Сотрудник В (&Сотрудники))
	|	И Начисления.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сторно УБЫВ,
	|	НомерСтроки";
	
	ОсновныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// выполним запрос к ДополнительныеНачисления
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо КАК Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.Показатель1,
	|	Начисления.Показатель2,
	|	Начисления.Показатель3,
	|	Начисления.Показатель4,
	|	Начисления.Показатель5,
	|	Начисления.Показатель6,
	|	Начисления.ПодразделениеОрганизации,
	|	-Начисления.Результат КАК Результат,
	|	-Начисления.ОплаченоДнейЧасов КАК ОплаченоДнейЧасов,
	|	Начисления.КодВычета,
	|	 -Начисления.СуммаВычета КАК СуммаВычета,
	
	//Аверсон ЕАЕ 08.01.2024 СВФР-012093
	|   -Начисления.ПределФСЗН КАК ПределФСЗН,
	//Аверсон СВФР-012093
	
	|	ИСТИНА КАК Сторно,
	|	ЛОЖЬ КАК Авторасчет,
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ДокументОснование,
	|	Начисления.Ссылка КАК СторнируемыйДокумент
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ Начисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ Начисления.Сотрудник В (&Сотрудники))
	|	И Начисления.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Начисления.Сотрудник,
	|	Начисления.Сотрудник.Физлицо,
	|	Начисления.ВидРасчета,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.Показатель1,
	|	Начисления.Показатель2,
	|	Начисления.Показатель3,
	|	Начисления.Показатель4,
	|	Начисления.Показатель5,
	|	Начисления.Показатель6,
	|	Начисления.ПодразделениеОрганизации,
	|	0,
	|	0,
	|	Начисления.КодВычета,
	|	0,
	
	//Аверсон ЕАЕ 08.01.2024 СВФР-012093
	|   0,
	//Аверсон СВФР-012093
	
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	Начисления.НомерСтроки,
	|	Начисления.ДокументОснование,
	|	NULL
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &ПерерассчитываемыйДокумент
	|	И (НЕ Начисления.Сторно)
	|	И (&ПоВсемСотрудникам
	|			ИЛИ Начисления.Сотрудник В (&Сотрудники))
	|	И Начисления.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сторно УБЫВ,
	|	НомерСтроки";
	
	ДополнительныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьПоПерерассчитываемомуДокументу()

// ПСА 28-09-2020 СВФР-006549 +++ 
Процедура КорректировкаЗаполненияПериодаОсновныеНачисления(ПериодНачала, ПериодОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.НомерСтроки,
		|	ОсновныеНачисления.Сотрудник,
		|	ОсновныеНачисления.Физлицо,
		|	ОсновныеНачисления.ВидРасчета,
		|	ОсновныеНачисления.ДатаНачала,
		|	ОсновныеНачисления.ДатаОкончания,
		|	ОсновныеНачисления.Показатель1,
		|	ОсновныеНачисления.Показатель2,
		|	ОсновныеНачисления.Показатель3,
		|	ОсновныеНачисления.Показатель4,
		|	ОсновныеНачисления.Результат,
		|	ОсновныеНачисления.ПодразделениеОрганизации,
		|	ОсновныеНачисления.ОтработаноДней,
		|	ОсновныеНачисления.ОтработаноЧасов,
		|	ОсновныеНачисления.ОтработаноДнейПоПятидневке,
		|	ОсновныеНачисления.НормаДней,
		|	ОсновныеНачисления.НормаЧасов,
		|	ОсновныеНачисления.НормаДнейПоПятидневке,
		|	ОсновныеНачисления.ДатаНачалаСобытия,
		|	ОсновныеНачисления.Сторно,
		|	ОсновныеНачисления.Авторасчет,
		|	ОсновныеНачисления.ОплачиватьЧасов,
		|	ОсновныеНачисления.ОплаченоДнейЧасов,
		|	ОсновныеНачисления.ОтработаноЧасовПоПятидневке,
		|	ОсновныеНачисления.НормаЧасовПоПятидневке,
		|	ОсновныеНачисления.СторнируемыйДокумент,
		|	ОсновныеНачисления.Показатель5,
		|	ОсновныеНачисления.Показатель6,
		|	ОсновныеНачисления.ОплаченоДней,
		|	ОсновныеНачисления.РублиЧ,
		|	ОсновныеНачисления.Курс,
		|	ОсновныеНачисления.ДатаКурса,
		|	ОсновныеНачисления.ВалютнаяСумма,
		|	ОсновныеНачисления.Автомобиль
		|ПОМЕСТИТЬ Вт_Данные
		|ИЗ
		|	&ОсновныеНачисления КАК ОсновныеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.ПричинаИзмененияСостояния
		|ПОМЕСТИТЬ Вт_Периоды
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	РаботникиОрганизаций.Организация = &Организация
		|	И РаботникиОрганизаций.Период МЕЖДУ &ПериодНачала И &ПериодОкончания
		|	И РаботникиОрганизаций.ПричинаИзмененияСостояния В(&МассивПричинаИзмененияСостояния)
		|	И РаботникиОрганизаций.Сотрудник В
		|			(ВЫБРАТЬ
		|				Вт_Данные.Сотрудник
		|			ИЗ
		|				Вт_Данные КАК Вт_Данные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(Вт_Периоды.Период) КАК Период,
		|	Вт_Периоды.Сотрудник
		|ПОМЕСТИТЬ Вт_Прием
		|ИЗ
		|	Вт_Периоды КАК Вт_Периоды
		|ГДЕ
		|	Вт_Периоды.ПричинаИзмененияСостояния = &ПричинаИзмененияСостояния_Прием
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Периоды.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(Вт_Периоды.Период) КАК Период,
		|	Вт_Периоды.Сотрудник
		|ПОМЕСТИТЬ Вт_Увольнение
		|ИЗ
		|	Вт_Периоды КАК Вт_Периоды
		|ГДЕ
		|	Вт_Периоды.ПричинаИзмененияСостояния = &ПричинаИзмененияСостояния_Увольнение
		|
		|СГРУППИРОВАТЬ ПО
		|	Вт_Периоды.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вт_Данные.НомерСтроки,
		|	Вт_Данные.Сотрудник,
		|	Вт_Данные.Физлицо,
		|	Вт_Данные.ВидРасчета,
		|	ВЫБОР
		|		КОГДА Вт_Прием.Период ЕСТЬ NULL
		|			ТОГДА Вт_Данные.ДатаНачала
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Вт_Данные.ДатаНачала < Вт_Прием.Период
		|					ТОГДА Вт_Прием.Период
		|				ИНАЧЕ Вт_Данные.ДатаНачала
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА Вт_Увольнение.Период ЕСТЬ NULL
		|			ТОГДА Вт_Данные.ДатаОкончания
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Вт_Данные.ДатаОкончания > Вт_Увольнение.Период
		|					ТОГДА Вт_Увольнение.Период
		|				ИНАЧЕ Вт_Данные.ДатаОкончания
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаОкончания,
		|	Вт_Данные.Показатель1,
		|	Вт_Данные.Показатель2,
		|	Вт_Данные.Показатель3,
		|	Вт_Данные.Показатель4,
		|	Вт_Данные.Результат,
		|	Вт_Данные.ПодразделениеОрганизации,
		|	Вт_Данные.ОтработаноДней,
		|	Вт_Данные.ОтработаноЧасов,
		|	Вт_Данные.ОтработаноДнейПоПятидневке,
		|	Вт_Данные.НормаДней,
		|	Вт_Данные.НормаЧасов,
		|	Вт_Данные.НормаДнейПоПятидневке,
		
		//Аверсон 23.09.2021 КВВ СВФР-008180 (
		//|	Вт_Данные.ДатаНачалаСобытия,
		|	ВЫБОР
		|		КОГДА Вт_Прием.Период ЕСТЬ NULL
		|			ТОГДА Вт_Данные.ДатаНачала
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Вт_Данные.ДатаНачала < Вт_Прием.Период
		|					ТОГДА Вт_Прием.Период
		|				ИНАЧЕ Вт_Данные.ДатаНачала
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаНачалаСобытия,
		//Аверсон 23.09.2021 КВВ СВФР-008180 )
		
		|	Вт_Данные.Сторно,
		|	Вт_Данные.Авторасчет,
		|	Вт_Данные.ОплачиватьЧасов,
		|	Вт_Данные.ОплаченоДнейЧасов,
		|	Вт_Данные.ОтработаноЧасовПоПятидневке,
		|	Вт_Данные.НормаЧасовПоПятидневке,
		|	Вт_Данные.СторнируемыйДокумент,
		|	Вт_Данные.Показатель5,
		|	Вт_Данные.Показатель6,
		|	Вт_Данные.ОплаченоДней,
		|	Вт_Данные.РублиЧ,
		|	Вт_Данные.Курс,
		|	Вт_Данные.ДатаКурса,
		|	Вт_Данные.ВалютнаяСумма,
		|	Вт_Данные.Автомобиль
		|ИЗ
		|	Вт_Данные КАК Вт_Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Прием КАК Вт_Прием
		|		ПО Вт_Данные.Сотрудник = Вт_Прием.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Увольнение КАК Вт_Увольнение
		|		ПО Вт_Данные.Сотрудник = Вт_Увольнение.Сотрудник";
	
	МассивПричинаИзмененияСостояния = Новый Массив();
	МассивПричинаИзмененияСостояния.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	МассивПричинаИзмененияСостояния.Добавить(Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("МассивПричинаИзмененияСостояния", МассивПричинаИзмененияСостояния);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодНачала", ПериодНачала);
	Запрос.УстановитьПараметр("ПериодОкончания", ПериодОкончания);
	Запрос.УстановитьПараметр("ПричинаИзмененияСостояния_Прием", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	Запрос.УстановитьПараметр("ПричинаИзмененияСостояния_Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ОсновныеНачисления", ОсновныеНачисления.Выгрузить());

	
	РезультатЗапроса = Запрос.Выполнить();
	ОсновныеНачисления.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	
//+++ ПСА 28-09-2020 СВФР-006549  

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Добавляет строку сторно начислений в движения и табличную часть документа
//
Процедура ДобавитьСтрокуСторно(Движения, ТабличнаяЧасть, Строка)
	
	// новая запись движений
	Движение = Движения.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение,Строка,"БазовыйПериодНачало,БазовыйПериодКонец,ВидРасчета,Сотрудник,Физлицо,Организация," + 
	"ГрафикРаботы,ГрафикРаботыНорма,ВидУчетаВремени,Показатель1,Показатель2,Показатель3,Показатель4,Показатель5,Показатель6,ПодразделениеОрганизации,ОбособленноеПодразделение," + 
	"ПериодРасчетаСреднегоЗаработкаНачало,ПериодРасчетаСреднегоЗаработкаОкончание,СторнируемыйДокумент,ДатаНачалаСобытия");
	// Свойства
	Движение.ПериодРегистрации				= Строка.ПериодРегистрацииСторно;
	Движение.ПериодДействияНачало			= Строка.ПериодДействияНачалоСторно;
	Движение.ПериодДействияКонец			= Строка.ПериодДействияКонецСторно;
	Движение.Сторно							= Истина;
	Движение.Авторасчет						= Истина;
	
	// новая строка табличной части сторно начисления
	СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,Строка,"ВидРасчета,Сотрудник,Физлицо,ПодразделениеОрганизации,ДатаНачалаСобытия," + 
	"Показатель1,Показатель2,Показатель3,Показатель4,Показатель5,Показатель6,СторнируемыйДокумент,Авторасчет");
	// Свойства
	
	СтрокаТабличнойЧасти.ДатаНачала						= Строка.ПериодДействияНачалоСторно;
	СтрокаТабличнойЧасти.ДатаОкончания					= Строка.ПериодДействияКонецСторно;
	СтрокаТабличнойЧасти.Сторно							= Истина;
	
КонецПроцедуры // ДобавитьСтрокуСторно()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамРегистрацияДляЧастиСмены", Перечисления.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.Дата,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.ПериодРегистрации,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.Организация,
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 15
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.ПодразделениеОрганизации,
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 15
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	ВЫБОР
	|		КОГДА РегистрацияРазовыхНачисленийРаботниковОрганизации.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА РегистрацияРазовыхНачисленийРаботниковОрганизации.Организация
	|		ИНАЧЕ РегистрацияРазовыхНачисленийРаботниковОрганизации.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.Организация КАК ОбособленноеПодразделение,
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.Ссылка,
	|	ВЫБОР
	|		КОГДА РегистрацияРазовыхНачисленийРаботниковОрганизации.СпособРегистрацииВремени = &парамРегистрацияДляЧастиСмены
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РегистрируютсяПочасовыеОтклонения
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций КАК РегистрацияРазовыхНачисленийРаботниковОрганизации
	|ГДЕ
	|	РегистрацияРазовыхНачисленийРаботниковОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "Начисления" документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ГоловнаяОрганизация);
	МассивВидовВремени = Новый СписокЗначений;
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("ПочасовоеНачисление",МассивВидовВремени);
	//О.Т. Аверсон 12.06.2017 № 594
	Запрос.УстановитьПараметр("СпособРасчетаМПЕПО",Перечисления.СпособыРасчетаОплатыТруда.МПЕПО);
	Запрос.УстановитьПараметр("ДатаПриказа",ДатаПриказа);
	//О.Т. Аверсон 12.06.2017 № 594
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиДокумента.Ссылка,
	|	СтрокиДокумента.НомерСтроки,
	|	СтрокиДокумента.Сотрудник КАК Сотрудник,
	|	СтрокиДокумента.Физлицо,
	|	СтрокиДокумента.ВидРасчета,
	|	НАЧАЛОПЕРИОДА(СтрокиДокумента.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
	|	СтрокиДокумента.ДатаНачала,
	|	СтрокиДокумента.ДатаОкончания,
	|	СтрокиДокумента.Показатель1,
	|	СтрокиДокумента.Показатель2,
	|	СтрокиДокумента.Показатель3,
	|	СтрокиДокумента.Показатель4,
	|	СтрокиДокумента.Показатель5,
	|	СтрокиДокумента.Показатель6,
	|	СтрокиДокумента.Результат,
	|	СтрокиДокумента.ПодразделениеОрганизации,
	|	СтрокиДокумента.ОтработаноДней,
	|	СтрокиДокумента.ОтработаноЧасов,
	|	СтрокиДокумента.ОтработаноДнейПоПятидневке,
	|	СтрокиДокумента.НормаДней,
	|	СтрокиДокумента.НормаЧасов,
	|	СтрокиДокумента.НормаДнейПоПятидневке,
	|	СтрокиДокумента.ДатаНачалаСобытия,
	|	СтрокиДокумента.Сторно,
	|	СтрокиДокумента.Авторасчет,
	|	СтрокиДокумента.ОплачиватьЧасов,
	|	СтрокиДокумента.ОплаченоДнейЧасов,
	|	СтрокиДокумента.ОплаченоДней,
	|	СтрокиДокумента.ОтработаноЧасовПоПятидневке,
	|	СтрокиДокумента.НормаЧасовПоПятидневке,
	|	СтрокиДокумента.СторнируемыйДокумент,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.Сторно
	|				И СтрокиДокумента.СторнируемыйДокумент = СтрокиДокумента.Ссылка.ПерерассчитываемыйДокумент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтрокаИсправления,
	|	СтрокиДокумента.РублиЧ
	|ПОМЕСТИТЬ ВТСтрокиНачислений
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК СтрокиДокумента
	|ГДЕ
	|	СтрокиДокумента.Ссылка = &ДокументСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ПериодДействия";
	Запрос.Выполнить();
	
	// ВТГрафикиСотрудников
	//		таблица содержит номера строк документа с данными о графике указанного
	//		в этой строке сотрудника из рег-ра сведений РаботникиОрганизации
	// 
	//	Поля:
	//		НомерСтроки
	//      ГрафикРаботы
	//      ГрафикПолногоРабочегоВремени
	//      СуммированныйУчетРабочегоВремени
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоследниеДаты.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|	КОНЕЦ КАК ГрафикПолногоРабочегоВремени,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= ПоследниеДаты.ДатаНачалаСобытия
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|	КОНЕЦ КАК СуммированныйУчетРабочегоВремени
	|ПОМЕСТИТЬ ВТГрафикиСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
	|		СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|		СтрокиНачисления.Сотрудник КАК Сотрудник,
	|		СтрокиНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия
	|	ИЗ
	|		ВТСтрокиНачислений КАК СтрокиНачисления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|			ПО СтрокиНачисления.ДатаНачалаСобытия >= РаботникиОрганизации.Период
	|				И СтрокиНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиНачисления.НомерСтроки,
	|		СтрокиНачисления.Сотрудник,
	|		СтрокиНачисления.ДатаНачалаСобытия) КАК ПоследниеДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО ПоследниеДаты.МаксПериод = РаботникиОрганизации.Период
	|			И ПоследниеДаты.Сотрудник = РаботникиОрганизации.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	// ВТДанныеИндивидуальныхГрафиковИТабелей
	//		таблица содержит номера строк документа с сотрудниками, для которых введены 
	//		подробные документы использования времени: инд.графики и табели
	// 
	//	Поля:
	//		НомерСтроки
	//      План
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|	ГрафикиРаботыПоВидамВремени.План КАК План
	|ПОМЕСТИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	|ИЗ
	|	ВТСтрокиНачислений КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СтрокиНачисления.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СтрокиНачисления.ПериодДействия = ГрафикиРаботыПоВидамВремени.Месяц
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	План";
	Запрос.Выполнить();
	
	// СводныеИндивидуальныеГрафикиРаботы
	//		таблица содержит номера строк документа с сотрудниками, для которых введены сводные 
	//		данные об их графике
	// 
	//	Поля:
	//		НомерСтроки
	// 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокРаботников.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТСводныеИндивидуальныеГрафикиРаботы
	|ИЗ
	|	ВТСтрокиНачислений КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|		ПО СписокРаботников.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	|			И СписокРаботников.ПериодДействия = СводныеИндивидуальныеГрафики.Месяц
	|ГДЕ
	|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Сотрудник,
	|	ТЧНачисления.Сотрудник.Наименование,
	|	ТЧНачисления.Сотрудник.Физлицо КАК Физлицо,
	|	Выбор когда ТЧНачисления.ВидРасчета.СпособРасчета = &СпособРасчетаМПЕПО тогда НАЧАЛОПЕРИОДА(&ДатаПриказа,Месяц) иначе ТЧНачисления.ДатаНачала конец КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Выбор когда ТЧНачисления.ВидРасчета.СпособРасчета = &СпособРасчетаМПЕПО тогда КОНЕЦПЕРИОДА(&ДатаПриказа,Месяц) иначе КОНЕЦПЕРИОДА(ТЧНачисления.ДатаОкончания, ДЕНЬ) конец
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.ПериодДействияБазовый
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ Выбор когда ТЧНачисления.ВидРасчета.СпособРасчета = &СпособРасчетаМПЕПО тогда НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПриказа, МЕСЯЦ, -1), МЕСЯЦ) иначе НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ТЧНачисления.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ) конец
	|	КОНЕЦ КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.ПериодДействияБазовый
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТЧНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА Выбор когда ТЧНачисления.ВидРасчета.СпособРасчета = &СпособРасчетаМПЕПО тогда КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаПриказа, МЕСЯЦ, -1), МЕСЯЦ) иначе КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ТЧНачисления.ДатаОкончания, МЕСЯЦ, -1), МЕСЯЦ)конец
	|				ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	ТЧНачисления.ВидРасчета КАК ВидРасчета,
	|	ТЧНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ТЧНачисления.ВидРасчета.ВидВремени КАК ВидВремени,
	|	ТЧНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
	|	ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	ТЧНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	ТЧНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидИспользованияРабочегоВремени,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка)КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	ТЧНачисления.Показатель1,
	|	ТЧНачисления.Показатель2,
	|	ТЧНачисления.Показатель3,
	|	ТЧНачисления.Показатель4,
	|	ТЧНачисления.Показатель5,
	|	ТЧНачисления.Показатель6,
	|	ТЧНачисления.Результат,
	|	ТЧНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА ГрафикРаботыПоСотруднику.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикРаботы
	|		ИНАЧЕ ТЧНачисления.Сотрудник
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	// если введен табель, но нет индивидуального графика, то норму времени надо считать по данным ""общего графика""
	|		КОГДА ТабелиУчетаВремениПоСотруднику.НомерСтроки ЕСТЬ НЕ NULL
	|				И ИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ NULL
	|				И СводныеИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ NULL 
	|			ТОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикРаботы
	// если у работника сокращенное рабочее время, а норма времени определяется по полному графику
	// и введен индивидуальный график, то норму времени надо считать по-прежнему по данным ""общего графика""
	|		КОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|				И (ИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL
	|					ИЛИ СводныеИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL )
	|			ТОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикПолногоРабочегоВремени
	//О.Т. Аверсон 17.07.2018 № 2218
	// если у работника не сокращенное рабочее время и введен индивидуальный график
	|		КОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикПолногоРабочегоВремени = ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|				И (ИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL 
	|					ИЛИ СводныеИндивидуальныеГрафикиРаботы.НомерСтроки ЕСТЬ НЕ NULL )
	|			ТОГДА ДанныеПоРаботникуНаДатуНачисления.ГрафикПолногоРабочегоВремени
	//О.Т. Аверсон 17.07.2018 № 2218
	|		иначе ДанныеПоРаботникуНаДатуНачисления.ГрафикРаботы //О.Т. Аверсон 01.11.2017 № 1189
	|	КОНЕЦ КАК ГрафикРаботыНорма,
	|	ЕСТЬNULL(ДанныеПоРаботникуНаДатуНачисления.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	ТЧНачисления.НормаДней,
	|	ТЧНачисления.НормаЧасов,
	|	ТЧНачисления.НормаДнейПоПятидневке,
	|	ТЧНачисления.ОплаченоДнейЧасов,
	//толик
	|	ТЧНачисления.ОплаченоДней,
	//
	|	ТЧНачисления.ОтработаноДней,
	|	ТЧНачисления.ОтработаноЧасов,
	|	ТЧНачисления.ОтработаноДнейПоПятидневке,
	|	ТЧНачисления.ОтработаноЧасовПоПятидневке,
	|	ТЧНачисления.НормаЧасовПоПятидневке,
	|	ТЧНачисления.Сторно,
	|	ТЧНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ТЧНачисления.ОплачиватьЧасов КАК ОплачиватьЧасов,
	|	ТЧНачисления.СтрокаИсправления,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА (НЕ ТЧНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ТЧНачисления.Авторасчет,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.ВидРасчета.ВидВремени В (&ПочасовоеНачисление)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяПочасовымОтклонением,
	|	ВЫБОР
	|		КОГДА ТЧНачисления.Сторно
	|			ТОГДА ТЧНачисления.СторнируемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	ТЧНачисления.РублиЧ
	|ИЗ
	|	ВТСтрокиНачислений КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиСотрудников КАК ДанныеПоРаботникуНаДатуНачисления
	|		ПО ТЧНачисления.НомерСтроки = ДанныеПоРаботникуНаДатуНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК ТЧНачисления) КАК ГрафикРаботыПоСотруднику
	|		ПО ТЧНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК ТЧНачисления
	|		ГДЕ
	|			(НЕ ТЧНачисления.План)) КАК ТабелиУчетаВремениПоСотруднику
	|		ПО ТЧНачисления.НомерСтроки = ТабелиУчетаВремениПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			ВТДанныеИндивидуальныхГрафиковИТабелей КАК ТЧНачисления
	|		ГДЕ
	|			ТЧНачисления.План) КАК ИндивидуальныеГрафикиРаботы
	|		ПО ТЧНачисления.НомерСтроки = ИндивидуальныеГрафикиРаботы.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСводныеИндивидуальныеГрафикиРаботы КАК СводныеИндивидуальныеГрафикиРаботы
	|		ПО ТЧНачисления.НомерСтроки = СводныеИндивидуальныеГрафикиРаботы.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

// Формирует запрос по таблице "ДополнительныеНачисления" документа
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоДопНачисления()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",				Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("НачалоПериодаРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериодаРегистрации",	КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаРегистрации",			?(Дата > КонецМесяца(ПериодРегистрации),КонецМесяца(ПериодРегистрации),?(Дата < ПериодРегистрации,ПериодРегистрации,Дата)));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	|	СтрокиНачисления.КодВычета,
	|	СтрокиНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.Сторно,
	|	СтрокиНачисления.Сотрудник,
	|	СтрокиНачисления.РублиЧ,
	|	СтрокиНачисления.Сотрудник.Физлицо КАК Физлицо,
	|	СтрокиНачисления.ДатаНачала КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	СтрокиНачисления.ВидРасчета.ЧислоМесяцев КАК ЧислоМесяцев,
	|	СтрокиНачисления.Авторасчет,
	|	0 КАК СкидкаПриНалогообложении,
	|	СтрокиНачисления.СуммаВычета,
	|	ВЫБОР
	|		КОГДА ДанныеПоРаботникуДоРегистрации.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ВЫБОР
	|					КОГДА ДОБАВИТЬКДАТЕ(ДанныеПоРаботникуДоРегистрации.Период, ДЕНЬ, -1) < &НачалоПериодаРегистрации
	|						ТОГДА &ДатаРегистрации
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ДанныеПоРаботникуДоРегистрации.Период, ДЕНЬ, -1)
	|				КОНЕЦ
	|		КОГДА ДанныеПоРаботникуДоРегистрации.ПериодЗавершения <= &ДатаРегистрации
	|				И ДанныеПоРаботникуДоРегистрации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И ДанныеПоРаботникуДоРегистрации.ПричинаИзмененияСостоянияЗавершения = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			ТОГДА ВЫБОР
	|					КОГДА ДОБАВИТЬКДАТЕ(ДанныеПоРаботникуДоРегистрации.ПериодЗавершения, ДЕНЬ, -1) < &НачалоПериодаРегистрации
	|						ТОГДА &ДатаРегистрации
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ДанныеПоРаботникуДоРегистрации.ПериодЗавершения, ДЕНЬ, -1)
	|				КОНЕЦ
	|		КОГДА ДанныеПоРаботникуПослеРегистрации.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|			ТОГДА ВЫБОР
	|					КОГДА ДанныеПоРаботникуПослеРегистрации.Период > &КонецПериодаРегистрации
	|						ТОГДА &ДатаРегистрации
	|					ИНАЧЕ ДанныеПоРаботникуПослеРегистрации.Период
	|				КОНЕЦ
	|		ИНАЧЕ &ДатаРегистрации
	|	КОНЕЦ КАК ДатаРегистрации,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сторно
	|			ТОГДА СтрокиНачисления.СторнируемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	СтрокиНачисления.ДокументОснование,
	|	СтрокиНачисления.ПределФСЗН  //Аверсон 16.07.2022 КВВ СВФР-009304
	|ИЗ
	|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Начисления.Сотрудник
	|					ИЗ
	|						Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
	|					ГДЕ
	|						Начисления.Ссылка = &ДокументСсылка)) КАК ДанныеПоРаботникуДоРегистрации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ДанныеПоРаботникуДоРегистрации.Сотрудник КАК Сотрудник,
	|				МАКСИМУМ(ДанныеПоРаботникуДоРегистрации.Период) КАК Период
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|						&ДатаРегистрации,
	|						Сотрудник В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								Начисления.Сотрудник
	|							ИЗ
	|								Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
	|							ГДЕ
	|								Начисления.Ссылка = &ДокументСсылка)) КАК ДанныеПоРаботникуДоРегистрации
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДанныеПоРаботникуДоРегистрации.Сотрудник) КАК ВложенныйЗапрос
	|			ПО (ВложенныйЗапрос.Сотрудник = ДанныеПоРаботникуДоРегистрации.Сотрудник)
	|				И (ВложенныйЗапрос.Период = ДанныеПоРаботникуДоРегистрации.Период)
	|		ПО СтрокиНачисления.Сотрудник = ДанныеПоРаботникуДоРегистрации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПервых(
	|				&ДатаРегистрации,
	|				Сотрудник В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Начисления.Сотрудник
	|					ИЗ
	|						Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Начисления
	|					ГДЕ
	|						Начисления.Ссылка = &ДокументСсылка)) КАК ДанныеПоРаботникуПослеРегистрации
	|		ПО СтрокиНачисления.Сотрудник = ДанныеПоРаботникуПослеРегистрации.Сотрудник
	|ГДЕ
	|	СтрокиНачисления.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняются начисления!", Отказ, Заголовок);
	КонецЕсли;
	
	//  ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан месяц, в котором выполняются начисления!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОсновныеНачисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Начисления"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не задан Сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	ИначеЕсли Не ВыборкаПоСтрокамДокумента.СтрокаИсправления Тогда
		Если ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения <> ВыборкаПоСтрокамДокумента.ЯвляетсяПочасовымОтклонением Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный вид расчета не соответствует способу регистрации времени в документе!", Отказ, Заголовок);
			Отказ = Ложь; //Островская Татьяна 04.03.2014 № 17171
		КонецЕсли;
	КонецЕсли;
	
	// Дата начала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала начисления!", Отказ, Заголовок);
		
	ИначеЕсли Не ВыборкаПоСтрокамДокумента.ЯвляетсяПочасовымОтклонением Тогда
		// Дата окончания
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияКонец) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания начисления!", Отказ, Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ПериодДействияКонец < ВыборкаПоСтрокамДокумента.ПериодДействияНачало Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания начисления не должна быть меньше даты начала!", Отказ, Заголовок);
				
			Иначе
				Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ПериодДействияКонец) <> НачалоМесяца(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Дата начала события
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала события!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.РегистрируютсяПочасовыеОтклонения И ВыборкаПоСтрокамДокумента.ЯвляетсяПочасовымОтклонением Тогда
		
		// ВидИспользованияРабочегоВремени
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидИспользованияРабочегоВремени) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан учет времени для вида расчета!", Отказ, Заголовок);
		КонецЕсли;
		
		// ОплачиватьЧасов
		Если ВыборкаПоСтрокамДокумента.ОплачиватьЧасов <= 0 Или ВыборкаПоСтрокамДокумента.ОплачиватьЧасов > 24 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "количество оплачиваемых часов должно быть положительным и не превышать 24!", Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
		// Подразделение
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение организации!", Отказ, Заголовок);
		ИначеЕсли ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
		КонецЕсли;
		
		// График работы
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ГрафикРаботы) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "по состоянию на " + Формат(ВыборкаПоСтрокамДокумента.ПериодДействияНачало,"ДЛФ=DD") + " не задан рабочий график работника, либо он еще не принят на работу!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + " указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ДополнительныеНачисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры:
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок = "",ПроверкаНаСуммуВычета = Ложь)// О.Т. 29.10.2014 240
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Доп. начисления"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не задан сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
		//Аверсон-софт, Островская Татьяна 21.03.2012 №15092	
	ИначеЕсли ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом
		или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы
		или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП //О.Т. Аверсон 04.11.2016 № 1501
		Или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СевернаяНадбавка
		Или ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом Тогда
		
		// Дата начала
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала базового периода начисления!", Отказ, Заголовок);
		КонецЕсли;
		// Дата окончания
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания базового периода начисления!", Отказ, Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка на сумму вычета
	
	//Аверсон ЕАЕ 04.10.2021 СВФР-008218 (значение мСоответствиеДоходовИВычетов не определено, в общем модуле ПроведениеРасчетов нет функции для определения)
	//Если ВыборкаПоСтрокамДокумента.СуммаВычета <> 0 И Не ПроведениеРасчетов.ВычетСоответствуетДоходу(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ, ВыборкаПоСтрокамДокумента.КодВычета, мСоответствиеДоходовИВычетов) Тогда
	Если ВыборкаПоСтрокамДокумента.СуммаВычета <> 0 И Не ПроведениеРасчетов.ВычетСоответствуетДоходу(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ, ВыборкаПоСтрокамДокумента.КодВычета) Тогда
	//Аверсон СВФР-008218	
		
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный код вычета не предусмотрен для кода дохода (" + ?(ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ), СокрЛП(ВыборкаПоСтрокамДокумента.КодДоходаНДФЛ), "не указан") + "), с которым будет зарегистрировано в учете по НДФЛ начисление """ + ?(ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета), ВыборкаПоСтрокамДокумента.ВидРасчета, "<не указано>") + """!", Отказ, Заголовок);
	КонецЕсли;
	//О.Т. 09.10.2014 № 240
	Если ВыборкаПоСтрокамДокумента.Результат < ВыборкаПоСтрокамДокумента.СуммаВычета и ПроверкаНаСуммуВычета Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Сумма вычета по сотруднику "+ ВыборкаПоСтрокамДокумента.Сотрудник.Наименование +" превышает начисление!", , Заголовок);
	КонецЕсли;
	//О.Т. 09.10.2014 № 240
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры: 
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей)
	
	Движение = НаборЗаписей.Добавить();
	
	// Свойства
	Если ВыборкаПоСтрокамДокумента.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.МПЕПО Тогда 
		Движение.ПериодРегистрации				= ДатаПриказа;
	иначе
		Движение.ПериодРегистрации				= ПериодРегистрации;
	КонецЕсли;
	Движение.ПериодДействияНачало			= ВыборкаПоСтрокамДокумента.ПериодДействияНачало;
	Движение.ПериодДействияКонец			= ВыборкаПоСтрокамДокумента.ПериодДействияКонец;
	Движение.БазовыйПериодНачало			= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
	Движение.БазовыйПериодКонец				= ВыборкаПоСтрокамДокумента.БазовыйПериодКонец;
	Движение.ВидРасчета						= ВыборкаПоСтрокамДокумента.ВидРасчета;
	Движение.Сторно							= ВыборкаПоСтрокамДокумента.Сторно;
	
	// Измерения
	Движение.Сотрудник						= ВыборкаПоСтрокамДокумента.Сотрудник;
	Движение.ФизЛицо						= ВыборкаПоСтрокамДокумента.ФизЛицо;
	Движение.Организация					= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	
	// Ресурсы
	Движение.Результат						= ВыборкаПоСтрокамДокумента.Результат;
	// ресурсы по отработанному времени
	Если ВыборкаПоСтрокамДокумента.ЗачетОтработанногоВремени Тогда
		Движение.ОтработаноДней				= ВыборкаПоСтрокамДокумента.ОтработаноДней;
		Движение.ОтработаноЧасов			= ВыборкаПоСтрокамДокумента.ОтработаноЧасов;
		Движение.ОтработаноДнейПоПятидневке	= ВыборкаПоСтрокамДокумента.ОтработаноДнейПоПятидневке;
		Движение.ОтработаноЧасовПоПятидневке= ВыборкаПоСтрокамДокумента.ОтработаноЧасовПоПятидневке;
	КонецЕсли;
	// ресурсы по норме времени
	Если ВыборкаПоСтрокамДокумента.ЗачетНормыВремени Тогда
		Движение.НормаДней					= ВыборкаПоСтрокамДокумента.НормаДней;
		Движение.НормаЧасов					= ВыборкаПоСтрокамДокумента.НормаЧасов;
		Движение.НормаДнейПоПятидневке		= ВыборкаПоСтрокамДокумента.НормаДнейПоПятидневке;
		Движение.НормаЧасовПоПятидневке		= ВыборкаПоСтрокамДокумента.НормаЧасовПоПятидневке;
	КонецЕсли;
	Движение.ОплаченоДнейЧасов				= ВыборкаПоСтрокамДокумента.ОплаченоДнейЧасов;
	//толик
	Движение.ОплаченоДней					= ВыборкаПоСтрокамДокумента.ОплаченоДней;
	
	// Реквизиты
	Движение.ГрафикРаботы					= ВыборкаПоСтрокамДокумента.ГрафикРаботы;
	Движение.ГрафикРаботыНорма				= ВыборкаПоСтрокамДокумента.ГрафикРаботыНорма;
	Движение.Показатель1					= ВыборкаПоСтрокамДокумента.Показатель1;
	Движение.Показатель2					= ВыборкаПоСтрокамДокумента.Показатель2;
	Движение.Показатель3					= ВыборкаПоСтрокамДокумента.Показатель3;
	Движение.Показатель4					= ВыборкаПоСтрокамДокумента.Показатель4;	
	Движение.Показатель5					= ВыборкаПоСтрокамДокумента.Показатель5;
	Движение.Показатель6					= ВыборкаПоСтрокамДокумента.Показатель6;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияРаботниковОрганизации.ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|			&парамНачало,
	|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
	|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
	|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
	|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|	И ВЫБОР
	|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
	|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
	|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
	|					КОНЕЦ
	|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
	|		КОНЕЦ = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням)";
	
	Запрос.УстановитьПараметр("парамНачало", ПериодРегистрации);
	Запрос.УстановитьПараметр("Сотрудник", ВыборкаПоСтрокамДокумента.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВидРасчета1 = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидРасчета1 = ВыборкаДетальныеЗаписи.ВидРасчета;
	КонецЦикла;

	
	Движение.ВидУчетаВремени				= ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВыборкаПоСтрокамДокумента.СпособРасчета, ВыборкаПоСтрокамДокумента.ВидВремени, ВыборкаПоСтрокамДокумента.СуммированныйУчетРабочегоВремени,,ВидРасчета1);
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 14
	//Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 14
	//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 14
	Движение.ПодразделениеОрганизации		= ?( ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации),
												ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации,
												ВыборкаПоШапкеДокумента.ПодразделениеОрганизации
												);
	//- СВЭЙ КДЯ 10.03.20 СВФР-005656 14
	Движение.ОбособленноеПодразделение		= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ДатаНачалаСобытия				= ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия;
	Движение.ВариантОбработкиЗаписиПриОтраженииВРеглУчете = ВыборкаПоСтрокамДокумента.ВариантОбработкиЗаписиПриОтраженииВРеглУчете;
	Движение.СторнируемыйДокумент			= ВыборкаПоСтрокамДокумента.СторнируемыйДокумент;
	Движение.Авторасчет						= ВыборкаПоСтрокамДокумента.Авторасчет;
	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры:
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка
//								  из результата запроса к ТЧ документа,
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуДопНачислений(ВыборкаПоСтрокамДокумента, ВыборкаПоШапкеДокумента, НаборЗаписей, РасчетЛьготаПоФСЗН500Код = Ложь, НаборЗаписейЛьготаФСЗН = Ложь) //Аверсон 09.03.2022 КВВ СВФР-008806 (РасчетЛьготаПоФСЗН500Код)  //Аверсон 16.07.2022 КВВ СВФР-009304 (НаборЗаписейЛьготаФСЗН)
	
	//Аверсон 31.01.2022 КВВ СВФР-008667 (
	КолвоЦиклов = 1;
	Разница = 0;
	РезВР = ВыборкаПоСтрокамДокумента.Результат;
	ВР = ВыборкаПоСтрокамДокумента.ВидРасчета;
	НовыйОблагаемыйВР = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПустаяСсылка();
	Если РасчетЛьготаПоФСЗН500Код //Аверсон 09.03.2022 КВВ СВФР-008806
		И (ВыборкаПоСтрокамДокумента.ВидРасчета.ЛьготаПоФСЗН500Код И ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета.ОблагаемыйВРЛьготаПоФСЗН500Код))
		И (РезВР <> ВыборкаПоСтрокамДокумента.СуммаВычета) Тогда
		НовыйОблагаемыйВР = ВыборкаПоСтрокамДокумента.ВидРасчета.ОблагаемыйВРЛьготаПоФСЗН500Код;
		Если ВыборкаПоСтрокамДокумента.ВидРасчета.ОтдельныйУчетЛьготы = Ложь Тогда //Аверсон 16.07.2022 КВВ СВФР-009304
			Если ВыборкаПоСтрокамДокумента.СуммаВычета = 0 Тогда
				СЗОблагаемыеВРВместо.Добавить(ВР);
				ВР = НовыйОблагаемыйВР; 
			ИначеЕсли РезВР > ВыборкаПоСтрокамДокумента.СуммаВычета Тогда 
				СЗОблагаемыеВРВместо.Добавить(ВР);
				Разница = РезВР - ВыборкаПоСтрокамДокумента.СуммаВычета; 
				РезВР = ВыборкаПоСтрокамДокумента.СуммаВычета;
				КолвоЦиклов = 2;
			КонецЕсли;
			//Аверсон 16.07.2022 КВВ СВФР-009304 (
		Иначе  //ВыборкаПоСтрокамДокумента.ВидРасчета.ОтдельныйУчетЛьготы = ИСТИНА 
			Если ВыборкаПоСтрокамДокумента.ПределФСЗН = 0 Тогда
				ВР = НовыйОблагаемыйВР;
			Иначе
				Разница = РезВР - ВыборкаПоСтрокамДокумента.ПределФСЗН; 
				РезВР = ВыборкаПоСтрокамДокумента.ПределФСЗН;
				
				КолвоЦиклов = 2;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 16.07.2022 КВВ СВФР-009304 )

	КонецЕсли;
	
	Для А = 1 По КолвоЦиклов Цикл
		Если А = 2 Тогда
			РезВР = Разница;
			ВР = НовыйОблагаемыйВР;
		КонецЕсли;
		//Аверсон 31.01.2022 КВВ СВФР-008667 )
		
		Движение = НаборЗаписей.Добавить();
		
		// Свойства
		Движение.ПериодРегистрации			= ВыборкаПоСтрокамДокумента.ДатаРегистрации;
		Движение.БазовыйПериодНачало		= ВыборкаПоСтрокамДокумента.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец			= ВыборкаПоСтрокамДокумента.БазовыйПериодКонец;
		Движение.ВидРасчета					= ВР;//ВыборкаПоСтрокамДокумента.ВидРасчета;   //Аверсон 31.01.2022 КВВ СВФР-008667
		Движение.Сторно						= ВыборкаПоСтрокамДокумента.Сторно;
		
		// Измерения
		Движение.Сотрудник					= ВыборкаПоСтрокамДокумента.Сотрудник;
		Движение.ФизЛицо					= ВыборкаПоСтрокамДокумента.ФизЛицо;
		Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		
		// Ресурсы
		Движение.Результат					= РезВР;//ВыборкаПоСтрокамДокумента.Результат;  //Аверсон 31.01.2022 КВВ СВФР-008667
		Движение.ОплаченоДнейЧасов			= ВыборкаПоСтрокамДокумента.ОплаченоДнейЧасов;
		
		// Реквизиты
		Движение.Показатель1				= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2				= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3				= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4				= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5				= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6				= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.ЧислоМесяцев				= ВыборкаПоСтрокамДокумента.ЧислоМесяцев;
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 14
		//Движение.ПодразделениеОрганизации		= ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 14
		//+ СВЭЙ КДЯ 10.03.20 СВФР-005656 14
		Движение.ПодразделениеОрганизации		= ?( ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации),
		ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации,
		ВыборкаПоШапкеДокумента.ПодразделениеОрганизации
		);
		//- СВЭЙ КДЯ 10.03.20 СВФР-005656 14
		Движение.ДокументОснование			= ВыборкаПоСтрокамДокумента.ДокументОснование;
		Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.СторнируемыйДокумент		= ВыборкаПоСтрокамДокумента.СторнируемыйДокумент;
		Движение.СкидкаПриНалогообложении	= ВыборкаПоСтрокамДокумента.СкидкаПриНалогообложении;
		Движение.Авторасчет					= ВыборкаПоСтрокамДокумента.Авторасчет;
		
		//Аверсон 16.07.2022 КВВ СВФР-009304 (            
		Если НаборЗаписейЛьготаФСЗН <> Ложь И ВыборкаПоСтрокамДокумента.ПределФСЗН <> 0 И А = 1 Тогда
			
			//Аверсон 18.07.2022 КВВ СВФР-009304 (
			
			//Аверсон ЕАЕ 10.10.2024 СВФР-013638
			//ПериодДляЗаписи = ВыборкаПоСтрокамДокумента.ДатаРегистрации;			
			//Если ЗначениеЗаполнено(РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ВыборкаПоСтрокамДокумента.ДатаРегистрации),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))) Тогда
			//	Если РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ВыборкаПоСтрокамДокумента.ДатаРегистрации),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))[0].Период = ПериодДляЗаписи Тогда
			//		Для Б = 1 По 60 Цикл
			//			ДатаПроверки = РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ВыборкаПоСтрокамДокумента.ДатаРегистрации+Б),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))[0].Период;
			//			Если ДатаПроверки = ПериодДляЗаписи Тогда
			//				ПериодДляЗаписи = ПериодДляЗаписи + Б;
			//				Прервать;
			//			ИначеЕсли ДатаПроверки > ПериодДляЗаписи Тогда
			//				ПериодДляЗаписи = ДатаПроверки + Б;
			//			КонецЕсли;
			//		КонецЦикла;
			//	КонецЕсли;
			//КонецЕсли;
			
			ДатаРегистрацииНачалоДня = НачалоДня(ВыборкаПоСтрокамДокумента.ДатаРегистрации);
			ПериодДляЗаписи = ДатаРегистрацииНачалоДня;
			Если ЗначениеЗаполнено(РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ДатаРегистрацииНачалоДня),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))) Тогда
				Если РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ДатаРегистрацииНачалоДня),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))[0].Период = ПериодДляЗаписи Тогда
					ДатаПроверки = РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ПериодДляЗаписи),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))[0].Период;
					Пока ПериодДляЗаписи = ДатаПроверки Цикл
						ПериодДляЗаписи = ПериодДляЗаписи + 1;
						ДатаПроверки = РегистрыСведений.ЛьготаФСЗН.СрезПоследних((ПериодДляЗаписи),Новый Структура("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник))[0].Период;
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли; 
			//Аверсон СВФР-013638
			
			//Аверсон 18.07.2022 КВВ СВФР-009304 )
			
			ДвижениеЛьготаФСЗН = НаборЗаписейЛьготаФСЗН.Добавить();
			ДвижениеЛьготаФСЗН.Сотрудник = ВыборкаПоСтрокамДокумента.Сотрудник;
			ДвижениеЛьготаФСЗН.Организация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			ДвижениеЛьготаФСЗН.Сумма = ВыборкаПоСтрокамДокумента.ПределФСЗН;
			//ДвижениеЛьготаФСЗН.Период = ВыборкаПоСтрокамДокумента.ДатаРегистрации;
			ДвижениеЛьготаФСЗН.Период = ПериодДляЗаписи; //Аверсон 18.07.2022 КВВ СВФР-009304

		КонецЕсли;
		//Аверсон 16.07.2022 КВВ СВФР-009304 )

	КонецЦикла; //Аверсон 31.01.2022 КВВ СВФР-008667
КонецПроцедуры // ДобавитьСтрокуДопНачислений

// По выборке из результатов запроса по документу формируем движения по регистру
//
// Параметры: 
//	ВыборкаПоШапкеДокумента				- спозиционированная на определеной строке выборка 
//										  из результата запроса к документу 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, НаборЗаписей)
	
	Если ВыборкаПоНачислениям.ЯвляетсяПочасовымОтклонением Тогда
		Движение = НаборЗаписей.Добавить();
		
		// Свойства
		Движение.Период = ВыборкаПоНачислениям.ПериодДействияНачало;
		
		// Измерения
		Движение.Сотрудник							= ВыборкаПоНачислениям.Сотрудник;
		Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоНачислениям.ВидИспользованияРабочегоВремени;
		
		// Ресурсы
		Движение.Часов								= ВыборкаПоНачислениям.ОплачиватьЧасов;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРабочегоВремени()

// получает доходы НДФЛ по табличным частям с доходами
// Параметры:
//		ВыборкаПоШапкеДокумента - спозиционированная выборка по шапке документа
//		
Процедура СформироватьДоходыПоКодамНДФЛ(ВыборкаПоШапкеДокумента, НаборЗаписей)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка",			Ссылка);
	Запрос.УстановитьПараметр("ДатаНалоговогоПериода", КонецГода(ПериодРегистрации));
	КодОплатыТрудаПоНДФЛ = Новый Массив;
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.КодДоходаПоУмолчанию);
	КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код12117); //О.Т. Аверсон 06.01.2017 № 142

	//КодОплатыТрудаПоНДФЛ.Добавить(Справочники.ДоходыНДФЛ.Код2012);
	Запрос.УстановитьПараметр("КодОплатыТрудаПоНДФЛ", КодОплатыТрудаПоНДФЛ);
	Запрос.УстановитьПараметр("СЗОблагаемыеВРВместо",СЗОблагаемыеВРВместо); //Аверсон 31.01.2022 КВВ СВФР-008667
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доходы.Физлицо,
	|	Доходы.КодДохода,
	|	Доходы.ВидРасчета,
	|	Доходы.Период,
	|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода,
	|	Доходы.КодВычета,
	|	СУММА(Доходы.СуммаВычета) КАК СуммаВычета,
	|	Доходы.ПодразделениеОрганизации,
	//Аверсон 31.01.2022 КВВ СВФР-008667 (
	|	Доходы.КодДоходаНовогоВР,
	|	СУММА(Доходы.СуммаПоНовомуВР) КАК СуммаПоНовомуВР
	//Аверсон 31.01.2022 КВВ СВФР-008667 )
	|ИЗ
	|	(ВЫБРАТЬ
	|		Основные.Сотрудник.Физлицо КАК Физлицо,
	|		Основные.ВидРасчета.КодДоходаНДФЛ КАК КодДохода,
	|		Основные.ВидРасчета,
	
	//Аверсон 07.04.2023 КВВ СВФР-010666 (
	//|		ВЫБОР
	//|			КОГДА Основные.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
	//|				ТОГДА Основные.ДатаНачала
	//|			ИНАЧЕ Основные.Ссылка.ПериодРегистрации
	//|		КОНЕЦ КАК Период,
	|Основные.ДатаНачала КАК Период,
	//Аверсон 07.04.2023 КВВ СВФР-010666 )
	
	|		Основные.Результат КАК СуммаДохода,
	|		NULL КАК КодВычета,
	|		0 КАК СуммаВычета,
	|		Основные.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	//Аверсон 31.01.2022 КВВ СВФР-008667 (
	|		NULL КАК КодДоходаНовогоВР,
	|		0 КАК СуммаПоНовомуВР
	//Аверсон 31.01.2022 КВВ СВФР-008667 )
	|	ИЗ
	|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Основные
	|	ГДЕ
	|		Основные.Ссылка = &парамСсылка
	|		И Основные.ВидРасчета.КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.ПустаяСсылка)
	|		И Основные.Результат <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Дополнительные.Сотрудник.Физлицо,";
	Если СЗОблагаемыеВРВместо.Количество() = 0 Тогда //Аверсон 31.01.2022 КВВ СВФР-008667
		Запрос.Текст = Запрос.Текст + "
		|		Дополнительные.ВидРасчета.КодДоходаНДФЛ,";
		//Аверсон 31.01.2022 КВВ СВФР-008667 (
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|ВЫБОР КОГДА Дополнительные.ВидРасчета В (&СЗОблагаемыеВРВместо) 
		|И (Дополнительные.СуммаВычета <> Дополнительные.Результат)
		|ТОГДА
		|ВЫБОР КОГДА Дополнительные.СуммаВычета = 0
		|ТОГДА Дополнительные.ВидРасчета.ОблагаемыйВРЛьготаПоФСЗН500Код.КодДоходаНДФЛ
		|ИНАЧЕ Дополнительные.ВидРасчета.КодДоходаНДФЛ
		|КОНЕЦ
		|ИНАЧЕ Дополнительные.ВидРасчета.КодДоходаНДФЛ
		|КОНЕЦ
		|,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 31.01.2022 КВВ СВФР-008667 )
	
	//Аверсон 07.04.2023 КВВ СВФР-010666 (
	//|		ВЫБОР
	//|			КОГДА Дополнительные.ВидРасчета.КодДоходаНДФЛ В (&КодОплатыТрудаПоНДФЛ)
	//|				ТОГДА Дополнительные.ДатаНачала
	//|			ИНАЧЕ Дополнительные.Ссылка.ПериодРегистрации
	//|		КОНЕЦ,";
	|Дополнительные.ВидРасчета,
	|Дополнительные.ДатаНачала,";
	//Аверсон 07.04.2023 КВВ СВФР-010666 )
	
	Если СЗОблагаемыеВРВместо.Количество() = 0 Тогда //Аверсон 31.01.2022 КВВ СВФР-008667
		Запрос.Текст = Запрос.Текст + "
		|		Дополнительные.Результат,";
		//Аверсон 31.01.2022 КВВ СВФР-008667 (
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|ВЫБОР КОГДА Дополнительные.ВидРасчета В (&СЗОблагаемыеВРВместо)  
		|И (Дополнительные.СуммаВычета <> Дополнительные.Результат)
		|ТОГДА
		|ВЫБОР КОГДА Дополнительные.СуммаВычета = 0
		|ТОГДА Дополнительные.Результат
		|ИНАЧЕ Дополнительные.СуммаВычета
		|КОНЕЦ
		|ИНАЧЕ Дополнительные.Результат
		|КОНЕЦ
		|,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 31.01.2022 КВВ СВФР-008667 )

	|		Дополнительные.КодВычета,
	|		Дополнительные.СуммаВычета,
	|		Дополнительные.ПодразделениеОрганизации,";
	
	//Аверсон 31.01.2022 КВВ СВФР-008667 (
	Если СЗОблагаемыеВРВместо.Количество() = 0 Тогда 
		Запрос.Текст = Запрос.Текст + "
	|		NULL, //КАК КодДоходаНовогоВР,
	|		0"; //КАК СуммаПоНовомуВР
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|ВЫБОР КОГДА Дополнительные.ВидРасчета В (&СЗОблагаемыеВРВместо)  
		|И (Дополнительные.СуммаВычета <> Дополнительные.Результат)
		|ТОГДА
		|ВЫБОР КОГДА Дополнительные.СуммаВычета = 0
		|ТОГДА NULL
		|ИНАЧЕ Дополнительные.ВидРасчета.ОблагаемыйВРЛьготаПоФСЗН500Код.КодДоходаНДФЛ
		|КОНЕЦ
		|ИНАЧЕ NULL
		|КОНЕЦ
		|,//КАК КодДоходаНовогоВР
		|ВЫБОР КОГДА Дополнительные.ВидРасчета В (&СЗОблагаемыеВРВместо)  
		|И (Дополнительные.СуммаВычета <> Дополнительные.Результат)
		|ТОГДА
		|ВЫБОР КОГДА Дополнительные.СуммаВычета = 0
		|ТОГДА 0
		|ИНАЧЕ Дополнительные.Результат - Дополнительные.СуммаВычета
		|КОНЕЦ
		|ИНАЧЕ 0
		|КОНЕЦ
		|//КАК СуммаПоНовомуВР
		|";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	//Аверсон 31.01.2022 КВВ СВФР-008667 )

	|	ИЗ
	|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Дополнительные
	|	ГДЕ
	|		Дополнительные.Ссылка = &парамСсылка
	|		И Дополнительные.ВидРасчета.КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.ПустаяСсылка)
	|		И Дополнительные.Результат <> 0) КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Физлицо,
	|	Доходы.КодДохода,
	|	Доходы.ВидРасчета,
	|	Доходы.Период,
	|	Доходы.КодВычета,
	|	Доходы.ПодразделениеОрганизации,
	//Аверсон 31.01.2022 КВВ СВФР-008667 (
	|	Доходы.КодДоходаНовогоВР,
	|	Доходы.СуммаПоНовомуВР
	//Аверсон 31.01.2022 КВВ СВФР-008667 )
	|"; 
	
	ДоходыПоКодам = Запрос.Выполнить().Выбрать();
	// сформируем движения НДФЛСведенияОДоходах
	Пока ДоходыПоКодам.Следующий() Цикл
		
		//Аверсон 31.01.2022 КВВ СВФР-008667 (
		КолвоЦиклов = 1;
		Разница = 0;
		РезВычета = ДоходыПоКодам.СуммаВычета;
		РезВР = ДоходыПоКодам.СуммаДохода;
		КодДохода = ДоходыПоКодам.КодДохода;
		КодДоходаНовогоВР = "";
		Если ЗначениеЗаполнено(ДоходыПоКодам.КодДоходаНовогоВР) Тогда
				КолвоЦиклов = 2;
			 КодДоходаНовогоВР = ДоходыПоКодам.КодДоходаНовогоВР;
			 Разница = ДоходыПоКодам.СуммаПоНовомуВР; 
		КонецЕсли;
		
		Для А = 1 По КолвоЦиклов Цикл
			Если А = 2 Тогда
				РезВР = Разница;
				РезВычета = 0;
				КодДохода = КодДоходаНовогоВР;
			КонецЕсли;
			//Аверсон 31.01.2022 КВВ СВФР-008667 )
			
			Движение = НаборЗаписей.Добавить();
			
			// свойства
			Движение.Период						= ДоходыПоКодам.Период;
			
			// измерения 
			Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			Движение.Физлицо					= ДоходыПоКодам.Физлицо;
			Движение.КодДохода					= КодДохода; //ДоходыПоКодам.КодДохода; //Аверсон 31.01.2022 КВВ СВФР-008667
			//Если ЗначениеЗаполнено(ДоходыПоКодам.ВидРасчета.Подоходный2023) Тогда
			//	Движение.КодДохода				= Справочники.ДоходыНДФЛ.НайтиПоКоду(СокрЛП(ДоходыПоКодам.ВидРасчета.Подоходный2023));  	
			//КонецЕсли;

			Движение.ПериодРегистрации			= НачалоМесяца(ПериодРегистрации);
			
			// ресурсы
			Движение.СуммаДохода				= РезВР; //ДоходыПоКодам.СуммаДохода;  //Аверсон 31.01.2022 КВВ СВФР-008667
			Движение.СуммаВычета				= РезВычета; //ДоходыПоКодам.СуммаВычета; //Аверсон 31.01.2022 КВВ СВФР-008667
			Если  ЗначениеЗаполнено(ДоходыПоКодам.КодДохода) и (Число(СокрЛП(ДоходыПоКодам.КодДохода))>502 и Число(СокрЛП(ДоходыПоКодам.КодДохода))< 900) Тогда //если вычет если и сумма, берем его, все кроме 500 и 502 пишем вычет равный начислению
				Движение.КодВычета 	            = Справочники.ВычетыНДФЛ.НайтиПоКоду(СокрЛП(ДоходыПоКодам.КодДохода));  
				Движение.СуммаВычета			= РезВР;   //если код больше 500 всегда вычет
			Иначе 
				Движение.КодВычета					= ДоходыПоКодам.КодВычета;
			КонецЕсли;
			// реквизиты
			Движение.ОбособленноеПодразделение	= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
			
			Движение.ИсчисленоИзЗарплаты		= Истина;
			Движение.ПодразделениеОрганизации	= ДоходыПоКодам.ПодразделениеОрганизации;
		КонецЦикла; //Аверсон 31.01.2022 КВВ СВФР-008667
	КонецЦикла;
КонецПроцедуры // СформироватьДоходыПоКодамНДФЛ()

// Вычисляет разницу между начислениями и удержаниями работника и формирует
// движения по взаиморасчетам с работниками
//
// Параметры:
//	ВыборкаПоШапкеДокумента	- спозиционированная выборка по шапке документа
//	НаборЗаписей			- набор записей 
//	Перерасчет				- признак проведения перерасчетов, по умолчанию - Ложь
//	Физлица					- список физлиц, по которым производится расчет, по умолчанию - отсутствует
//
// Возвращаемое значение:
//	Нет.
//	
Процедура СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, НаборЗаписей, УчетЗадолженностиПоМесяцам, Перерасчет = Ложь, Физлица = Неопределено)
	
	Если Перерасчет Тогда
		Если Физлица = Неопределено Тогда
			// таблица ФизлицаДляПерерасчета
			// Список физлиц по которым необходимо выполнить перерасчет
			// Поля:
			//		ФизЛицо
			// Описание:
			// Получает список неповторяющихся физлиц по которым есть записи
			// перерасчета в одной из таблиц перерасчета - по основным или дополнительным начислениям
			//
			ФизлицаДляПерерасчетаТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Перерасчет.ФизЛицо
			|ИЗ
			|	(ВЫБРАТЬ
			|		Перерасчет.ФизЛицо
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
			|	
			|	ГДЕ
			|		Перерасчет.ОбъектПерерасчета = &парамСсылка
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Перерасчет.ФизЛицо
			|	ИЗ
			|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
			|	
			|	ГДЕ
			|		Перерасчет.ОбъектПерерасчета = &парамСсылка) КАК Перерасчет";
			
			// НачисленияРаботников
			//	Поля:
			//		Физлицо
			//		СуммаДохода - сумма "к выплате" - увличение состояния взаиморасчета с работником
			//
			
			НачисленияРаботниковТекст = 
			"ВЫБРАТЬ
			|	Доходы.Физлицо,
			|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основные.Сотрудник.Физлицо КАК Физлицо,
			|		Основные.Результат КАК СуммаДохода
			|	ИЗ
			|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Основные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляПерерасчетаТекст + ") КАК ФизлицаДляПерерасчета
			|			ПО ФизлицаДляПерерасчета.ФизЛицо = Основные.Сотрудник.Физлицо
			|	
			|	ГДЕ
			|		Основные.Ссылка = &парамСсылка И
			|		(Основные.Результат <> 0)
			|		И (НЕ Основные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Дополнительные.Сотрудник.Физлицо,
			|		Дополнительные.Результат
			|	ИЗ
			|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Дополнительные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + ФизлицаДляПерерасчетаТекст + ") КАК ФизлицаДляПерерасчета
			|			ПО ФизлицаДляПерерасчета.ФизЛицо = Дополнительные.Сотрудник.Физлицо
			|	
			|	ГДЕ
			|		Дополнительные.Ссылка = &парамСсылка И
			|		(Дополнительные.Результат <> 0)
			|		И (НЕ Дополнительные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)) КАК Доходы
			|	
			|СГРУППИРОВАТЬ ПО
			|	Доходы.Физлицо";
			
			Запрос = Новый Запрос(НачисленияРаботниковТекст);
		Иначе
			
			НачисленияРаботниковТекст = 
			"ВЫБРАТЬ
			|	Доходы.Физлицо,
			|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основные.Сотрудник.Физлицо КАК Физлицо,
			|		Основные.Результат КАК СуммаДохода
			|	ИЗ
			|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Основные
			|	ГДЕ
			|		Основные.Физлицо В(&парамФизлица)
			|		И Основные.Ссылка = &парамСсылка
			|		И Основные.Результат <> 0
			|		И (НЕ Основные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		Дополнительные.Сотрудник.Физлицо,
			|		Дополнительные.Результат
			|	ИЗ
			|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Дополнительные
			|	ГДЕ
			|		Дополнительные.Физлицо В(&парамФизлица)
			|		И Дополнительные.Ссылка = &парамСсылка
			|		И Дополнительные.Результат <> 0
			|		И (НЕ Дополнительные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)) КАК Доходы
			|
			|СГРУППИРОВАТЬ ПО
			|	Доходы.Физлицо";
			
			Запрос = Новый Запрос(НачисленияРаботниковТекст);
			Запрос.УстановитьПараметр("парамФизлица", Физлица);
			
		КонецЕсли;
	Иначе
		НачисленияРаботниковТекст = 
		"ВЫБРАТЬ
		|	Доходы.Физлицо,
		|	СУММА(Доходы.СуммаДохода) КАК СуммаДохода
		|ИЗ
		|	(ВЫБРАТЬ
		|		Основные.Сотрудник.Физлицо КАК Физлицо,
		|		Основные.Результат КАК СуммаДохода
		|	ИЗ
		|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК Основные
		|	ГДЕ
		|		Основные.Ссылка = &парамСсылка
		|		И Основные.Результат <> 0
		|		И (НЕ Основные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Дополнительные.Сотрудник.Физлицо,
		|		Дополнительные.Результат
		|	ИЗ
		|		Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Дополнительные
		|	ГДЕ
		|		Дополнительные.Ссылка = &парамСсылка
		|		И Дополнительные.Результат <> 0
		|		И (НЕ Дополнительные.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме)) КАК Доходы
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Физлицо";
		
		Запрос = Новый Запрос(НачисленияРаботниковТекст);
		
	КонецЕсли;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка" , Ссылка);
	
	Доходы = Запрос.Выполнить().Выбрать();
	// сформируем движения ВзаиморасчетыСРаботникамиОрганизаций
	Пока Доходы.Следующий() Цикл
		Движение = НаборЗаписей.Добавить();
		
		// свойства
		Движение.Период					= КонецМесяца(ПериодРегистрации);
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		
		// измерения 
		Движение.Физлицо				= Доходы.Физлицо;
		Движение.Организация			= Организация;
		Если УчетЗадолженностиПоМесяцам Тогда
			Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
		КонецЕсли;
		
		// ресурсы
		Движение.СуммаВзаиморасчетов	= Доходы.СуммаДохода;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьВзаиморасчетыСРаботниками()

Процедура СформироватьВыплатыПенсионерам(ВыборкаПоШапкеДокумента, НаборЗаписей)
	//СВЭЙ 19.04.2024 КВВ СВФР-012860 (
	НачисленияРаботниковТекст = 
	"ВЫБРАТЬ *,
	|ВЫБОР
	|КОГДА РаботникиОрганизацийУвольнение.Период ЕСТЬ NULL
	|ТОГДА ДатаВремя(1,1,1)
	|ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РаботникиОрганизацийУвольнение.Период, ДЕНЬ), СЕКУНДА, -1), ДЕНЬ)
	|КОНЕЦ КАК ДатаУвольнения 
	|
	|ИЗ Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК Дополнительные
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнение
	|ПО Дополнительные.Сотрудник = РаботникиОрганизацийУвольнение.Сотрудник
	|И РаботникиОрганизацийУвольнение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|ГДЕ
	|Дополнительные.Ссылка = &парамСсылка
	|И Дополнительные.Результат <> 0";
	
	Запрос = Новый Запрос(НачисленияРаботниковТекст);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамСсылка" , Ссылка);
	
	Доходы = Запрос.Выполнить().Выбрать();
	// сформируем движения ВыплатыПенсионерам
	Пока Доходы.Следующий() Цикл
		
		Если Доходы.ДатаУвольнения = Дата(1,1,1,0,0,0) Тогда
			Сообщить(СокрЛП(Доходы.Сотрудник) + " (тн " + СтрЗаменить(Сокрлп(Доходы.Сотрудник.Код)," ","") + ") не уволен, в регистр ""Выплаты пенсионерам"" данные не попадут!");
			Продолжить;
		Иначе 
			Если НачалоДня(Доходы.ДатаНачала) >= НачалоДня(Доходы.ДатаУвольнения) Тогда
			Иначе
				Сообщить(СокрЛП(Доходы.Сотрудник) + " (тн " + СтрЗаменить(Сокрлп(Доходы.Сотрудник.Код)," ","") + ") уволен " + Формат(Доходы.ДатаУвольнения,"ДЛФ=Д") + ", период указан неверно, в регистр ""Выплаты пенсионерам"" данные не попадут!");
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		Движение = НаборЗаписей.Добавить();
		
		// свойства
		Движение.Период	= КонецМесяца(ПериодРегистрации);
		
		// измерения 
		Движение.Сотрудник = Доходы.Сотрудник;
		Движение.Организация = Организация;
		Движение.ПодразделениеОрганизации = Доходы.ПодразделениеОрганизации;
		Движение.ДатаНачала = Доходы.ДатаНачала;
		Движение.ДатаОкончания = Доходы.ДатаОкончания; 
		Движение.ВидРасчета = Доходы.ВидРасчета;
		Движение.КодПН = Доходы.ВидРасчета.КодДоходаНДФЛ; 
		Движение.КодДохода = Доходы.ВидРасчета.Подоходный2023;
		// ресурсы
		Движение.Сумма	= Доходы.Результат;
		
	КонецЦикла;
	//СВЭЙ 19.04.2024 КВВ СВФР-012860 )	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено;
	// О.Т. 29.10.2014 240
	Для Каждого стрДоп из ДополнительныеНачисления Цикл 
		стрДоп.СуммаВычета = 0;
	КонецЦикла;
	// О.Т. 29.10.2014 240
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СЗОблагаемыеВРВместо = Новый СписокЗначений;  //Аверсон 31.01.2022 КВВ СВФР-008667  
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// Получение учетной политики по персоналу организации
			// ведется ли учет задолженности в разрезе периодов возникновения задолженности
			УчетЗадолженностиПоМесяцам = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
			
			////////////////////////////////////////////////////////////////////////
			// основные Начисления
			
			Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоНачисления(ВыборкаПоШапкеДокумента).Выбрать();
			
			Пока ВыборкаПоНачислениям.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоНачислениям, ВыборкаПоШапкеДокумента, Движения.ОсновныеНачисленияРаботниковОрганизаций);
					ДобавитьСтрокуРабочегоВремени(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Движения.ВнутрисменноеВремяРаботниковОрганизаций);
					Если не Организация.ИНН = "190288027" Тогда //О.Т. Аверсон 25.10.2017
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетОтОбратного
						|ИЗ
						|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
						|ГДЕ
						|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
						
						Запрос.УстановитьПараметр("Организация", Организация);
						
						РезультатЗапроса = Запрос.Выполнить().Выбрать();
						Пока РезультатЗапроса.Следующий() Цикл
							Если РезультатЗапроса.РасчетОтОбратного Тогда 
								// Регистр по сотрудникам
								Если ЗначениеЗаполнено(ВыборкаПоНачислениям.РублиЧ) Тогда  //О.Т. Аверсон 10.04.2017 № 503
									Движение = Движения.СуммыПоСотрудникам.Добавить();
									// Свойства
									Движение.Период						= ПериодРегистрации;			
									// Измерения
									Движение.Сотрудник					= ВыборкаПоНачислениям.Сотрудник;
									Движение.ФизЛицо					= ВыборкаПоНачислениям.ФизЛицо;
									
									Движение.Организация				= Организация;			
									// Ресурсы
									Движение.РублиЧ					= ВыборкаПоНачислениям.РублиЧ;
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
										
				КонецЕсли;
			КонецЦикла;
			
			////////////////////////////////////////////////////////////////////////
			// дополнительные Начисления
			
			РезультатЗапроса = СформироватьЗапросПоДопНачисления();
			Если Не РезультатЗапроса.Пустой() Тогда
				
				// получим реквизиты табличной части
				ВыборкаПоДопНачислениям = РезультатЗапроса.Выбрать();
				
				// Устанавливаем соответствие доходов и положенных по ним вычетов для целей исчисления НДФЛ
				//мСоответствиеДоходовИВычетов = ПроведениеРасчетов.ПолучитьСоответствиеДоходовИВычетов();
				
								
				Пока ВыборкаПоДопНачислениям.Следующий() Цикл 
					
					// проверим очередную строку табличной части
					ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоДопНачислениям, Отказ, Заголовок,Истина); // О.Т. 29.10.2014 240
					Если не Организация.ИНН = "190288027" Тогда //О.Т. Аверсон 25.10.2017
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетОтОбратного
						|ИЗ
						|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
						|ГДЕ
						|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
						
						Запрос.УстановитьПараметр("Организация", Организация);
						
						РезультатЗапроса = Запрос.Выполнить().Выбрать();
						Пока РезультатЗапроса.Следующий() Цикл
							Если РезультатЗапроса.РасчетОтОбратного Тогда 
								// Регистр по сотрудникам
								Если ЗначениеЗаполнено(ВыборкаПоДопНачислениям.РублиЧ) Тогда  //О.Т. Аверсон 10.04.2017 № 503
									Движение = Движения.СуммыПоСотрудникам.Добавить();
									// Свойства
									Движение.Период						= ПериодРегистрации;			
									// Измерения
									Движение.Сотрудник					= ВыборкаПоДопНачислениям.Сотрудник;
									Движение.ФизЛицо					= ВыборкаПоДопНачислениям.ФизЛицо;
									
									Движение.Организация				= Организация;			
									// Ресурсы
									Движение.РублиЧ					= ВыборкаПоДопНачислениям.РублиЧ;
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					//О.Т. Аверсон 26.03.2019 № 4137
					//Проверка на видРасчета по договорам подряда
					Если ВыборкаПоДопНачислениям.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой Тогда 
						Сообщить("В строке "+ВыборкаПоДопНачислениям.НомерСтроки+" Договор-подряда должен начисляться документом начисление заработной платы, свод начислений будет неверным!");
					КонецЕсли;
					//О.Т. Аверсон 26.03.2019 № 4137
					
					Если НЕ Отказ Тогда
						
						//СВЭЙ 19.04.2024 КВВ СВФР-012860 (
						Если ВыборкаПоДопНачислениям <> Неопределено
							И ТипЗнч(ВыборкаПоДопНачислениям.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисленияОрганизаций") 
							И ВыборкаПоДопНачислениям.ВидРасчета.ФлагВыплатыПенсионерам Тогда
							//СформироватьВыплатыПенсионерам(ВыборкаПоШапкеДокумента,Движения.ВыплатыПенсионерам);
						Иначе
							//СВЭЙ 19.04.2024 КВВ СВФР-012860 )
							
							// Заполним записи в наборах записей регистров
							ДобавитьСтрокуДопНачислений(ВыборкаПоДопНачислениям, ВыборкаПоШапкеДокумента, Движения.ДополнительныеНачисленияРаботниковОрганизаций, Истина, Движения.ЛьготаФСЗН); //Аверсон 09.03.2022 КВВ СВФР-008806 (РасчетЛьготаПоФСЗН500Код = Истина) //Аверсон 16.07.2022 КВВ СВФР-009304 (Движения.ЛьготаФСЗН)
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			////////////////////////////////////////////////////////////////////////
			// доходы НДФЛ
			
			// сформируем доходы НДФЛ по начислениям документа
			СформироватьДоходыПоКодамНДФЛ(ВыборкаПоШапкеДокумента, Движения.НДФЛСведенияОДоходах);
			
			////////////////////////////////////////////////////////////////////////
			
			//СВЭЙ 19.04.2024 КВВ СВФР-012860 (
			Если ВыборкаПоДопНачислениям <> Неопределено
				И ТипЗнч(ВыборкаПоДопНачислениям.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисленияОрганизаций") 
				И ВыборкаПоДопНачислениям.ВидРасчета.ФлагВыплатыПенсионерам Тогда
				СформироватьВыплатыПенсионерам(ВыборкаПоШапкеДокумента,Движения.ВыплатыПенсионерам);
			Иначе
				//СВЭЙ 19.04.2024 КВВ СВФР-012860 )
				
				// взаиморасчеты с работниками
				// сформируем начисления к выплате по начислениям документа
				СформироватьВзаиморасчетыСРаботниками(ВыборкаПоШапкеДокумента, Движения.ВзаиморасчетыСРаботникамиОрганизаций, УчетЗадолженностиПоМесяцам);
			КонецЕсли;
			
			// выполним удаление перерасчетов исправленного документа
			Если Не Отказ И ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
				ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(ОсновныеНачисления, ДополнительныеНачисления);
	
	Если СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены Тогда
		ОсновныеНачисления.ЗагрузитьКолонку(ОсновныеНачисления.ВыгрузитьКолонку("ДатаНачала"),"ДатаОкончания")
	Иначе 
		Для каждого СтрокаТЧ Из ОсновныеНачисления Цикл
			СтрокаТЧ.ОплачиватьЧасов = 0
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Печать","Печать");
	Результат.Вставить("ПечатьВидРасчета","Печать с видом расчета");
	Возврат Результат;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь,Страница = Неопределено) Экспорт //О.Т. Аверсон 15.11.2016 № 23
	
	ТабДок = Новый ТабличныйДокумент;
	 
	Макет = Документы.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПолучитьМакет("Макет");
	// Заголовок 
	Если ИмяМакета = "Печать" Тогда
		Область = Макет.ПолучитьОбласть("Заголовок");  
		ОбластьОсновныеНачисления = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	иначе
		Область = Макет.ПолучитьОбласть("Заголовок1");  
		ОбластьОсновныеНачисления = Макет.ПолучитьОбласть("Строка1");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал1");
	КонецЕсли;
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
	Область.Параметры.Дата = Формат(Дата,"ДЛФ=Д");
	Область.Параметры.Номер = Номер;
	Область.Параметры.ПериодРегистрации = Формат(ПериодРегистрации,"ДФ=""ММММ гггг""");
	ТабДок.Вывести(Область);
	РезультатИтог = 0; 
	
	Если Строка(Страница) = "Начисления" Тогда	
		
		Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
			ОбластьОсновныеНачисления.Параметры.Заполнить(ТекСтрокаОсновныеНачисления);
			ОбластьОсновныеНачисления.Параметры.ТН = ТекСтрокаОсновныеНачисления.Сотрудник.Код;
			ТабДок.Вывести(ОбластьОсновныеНачисления);
			РезультатИтог = РезультатИтог + ТекСтрокаОсновныеНачисления.Результат;
		КонецЦикла;
	иначе
		Для Каждого ТекСтрокаОсновныеНачисления Из ДополнительныеНачисления Цикл
			ОбластьОсновныеНачисления.Параметры.Заполнить(ТекСтрокаОсновныеНачисления);
			ОбластьОсновныеНачисления.Параметры.ТН = ТекСтрокаОсновныеНачисления.Сотрудник.Код;
			ТабДок.Вывести(ОбластьОсновныеНачисления);
			РезультатИтог = РезультатИтог + ТекСтрокаОсновныеНачисления.Результат;
		КонецЦикла;
	КонецЕсли;
	ОбластьПодвал.Параметры.РезультатИтог = РезультатИтог;
	ТабДок.Вывести(ОбластьПодвал);

	ТабДок.Вывести(ОбластьПодпись);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();

КонецПроцедуры
//ПСА 04.03.2021 СВФР-007268+++
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияРазовыхУдержанийРаботниковОрганизаций") Тогда
		Массив = Новый Массив;
		Массив.Добавить(Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"));
		Массив.Добавить(Тип("ПланВидовРасчетаСсылка.ДополнительныеНачисленияОрганизаций"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);        
		ВыбранноеНачисление = ОписаниеТипов.ПривестиЗначение();    
		ВвестиЗначение(ВыбранноеНачисление,, ОписаниеТипов);
		ДокОснование = ДанныеЗаполнения.Ссылка;
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект,ДокОснование);
		Начисление = ВыбранноеНачисление;
		ДатаНачала1 = ДокОснование.ДатаНачала1;
		ДатаОкончания1 = ДокОснование.ДатаОкончания1;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Сотрудник,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Физлицо,
		|	&Начисление КАК ВидРасчета,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.ДатаНачала,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.ДатаОкончания,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Показатель1,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Результат,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Сторно,
		|	Истина КАК Авторасчет,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Показатель2,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Показатель3,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Показатель4,
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.ПодразделениеОрганизации
		|ИЗ
		|	Документ.РегистрацияРазовыхУдержанийРаботниковОрганизаций.Удержания КАК РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания
		|ГДЕ
		|	РегистрацияРазовыхУдержанийРаботниковОрганизацийУдержания.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокОснование);
		Запрос.УстановитьПараметр("Начисление", Начисление);
		
		Если ТипЗнч(Начисление) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			ОсновныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
		Иначе
			ДополнительныеНачисления.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//+++ПСА 04.03.2021 СВФР-007268

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ