Функция Печать(КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	Возврат ПечатьТабДокум();
КонецФункции

Функция ПолучитьПланВр(ПровСотрудн,ПровДень)
	Перем ЧасыРаб;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботыПоВидамВремени.Дата,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеПолное,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНормаПолное
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|	И ГрафикиРаботыПоВидамВремени.Дата = &Дата
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = &ВидУчетаВремени";
	
	Запрос.УстановитьПараметр("ВидУчетаВремени", Перечисления.ВидыУчетаВремени.ПоЧасам);	
	Запрос.УстановитьПараметр("ГрафикРаботы", РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПровДень,Новый Структура("Сотрудник",ПровСотрудн)).ГрафикРаботы);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ПровДень));
	ЧасыРаб=0;
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЧасыРаб=ВыборкаДетальныеЗаписи.ОсновноеЗначение;		
	КонецЦикла;	    
	Возврат ЧасыРаб;
КонецФункции	

Функция ПечатьТабДокум()	
	ТабДокумент = Новый ТабличныйДокумент;	
	
	МакетО = ПолучитьМакет("ПараметрыНеявокДни");	
	МакетЧ = ПолучитьМакет("ПараметрыНеявокЧасы");
	МакетБ = ПолучитьМакет("ПараметрыБукв");
	
	//Дни
	ПостроительОтчета  = Новый ПостроительОтчета;                                    
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(МакетО.Область(1,1,МакетО.ВысотаТаблицы,МакетО.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	ТзНастройки = ПостроительОтчета.Результат.Выгрузить();
	
	//Часы
	ПостроительОтчета  = Новый ПостроительОтчета;                                    
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(МакетЧ.Область(1,1,МакетЧ.ВысотаТаблицы,МакетЧ.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	ТзНастройкиЧасы = ПостроительОтчета.Результат.Выгрузить(); 
	
	//Буквы
	ПостроительОтчета  = Новый ПостроительОтчета;                                    
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(МакетБ.Область(1,1,МакетБ.ВысотаТаблицы,МакетБ.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	ТзНастройкиБукв = ПостроительОтчета.Результат.Выгрузить(); 	
	
	
	ТзВывод=Новый ТаблицаЗначений;
	ТзВыводЧасы=Новый ТаблицаЗначений;
	ТзИтогДни=Новый ТаблицаЗначений;
	ТзИтогЧас=Новый ТаблицаЗначений;	
	
	Для Сч=0 По ТзНастройки.Колонки.Количество()-1 Цикл
		ТзВывод.Колонки.Добавить(ТзНастройки.Колонки[Сч].Заголовок, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	КонецЦикла; 
	ТзИтогДни=ТзВывод.Скопировать();
	
	Для Сч=0 По ТзНастройкиЧасы.Колонки.Количество()-1 Цикл
		ТзВыводЧасы.Колонки.Добавить(ТзНастройкиЧасы.Колонки[Сч].Заголовок, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	КонецЦикла; 
	ТзИтогЧас=ТзВыводЧасы.Скопировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени31,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени31,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени31,
	
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов1) КАК ПервыйЧасов1,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов2) КАК ПервыйЧасов2,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов3) КАК ПервыйЧасов3,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов4) КАК ПервыйЧасов4,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов5) КАК ПервыйЧасов5,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов6) КАК ПервыйЧасов6,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов7) КАК ПервыйЧасов7,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов8) КАК ПервыйЧасов8,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов9) КАК ПервыйЧасов9,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов10) КАК ПервыйЧасов10,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов11) КАК ПервыйЧасов11,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов12) КАК ПервыйЧасов12,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов13) КАК ПервыйЧасов13,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов14) КАК ПервыйЧасов14,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов15) КАК ПервыйЧасов15,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов16) КАК ПервыйЧасов16,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов17) КАК ПервыйЧасов17,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов18) КАК ПервыйЧасов18,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов19) КАК ПервыйЧасов19,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов20) КАК ПервыйЧасов20,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов21) КАК ПервыйЧасов21,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов22) КАК ПервыйЧасов22,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов23) КАК ПервыйЧасов23,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов24) КАК ПервыйЧасов24,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов25) КАК ПервыйЧасов25,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов26) КАК ПервыйЧасов26,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов27) КАК ПервыйЧасов27,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов28) КАК ПервыйЧасов28,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов29) КАК ПервыйЧасов29,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов30) КАК ПервыйЧасов30,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйЧасов31) КАК ПервыйЧасов31,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов1) КАК ВторойЧасов1,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов2) КАК ВторойЧасов2,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов3) КАК ВторойЧасов3,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов4) КАК ВторойЧасов4,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов5) КАК ВторойЧасов5,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов6) КАК ВторойЧасов6,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов7) КАК ВторойЧасов7,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов8) КАК ВторойЧасов8,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов9) КАК ВторойЧасов9,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов10) КАК ВторойЧасов10,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов11) КАК ВторойЧасов11,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов12) КАК ВторойЧасов12,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов13) КАК ВторойЧасов13,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов14) КАК ВторойЧасов14,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов15) КАК ВторойЧасов15,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов16) КАК ВторойЧасов16,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов17) КАК ВторойЧасов17,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов18) КАК ВторойЧасов18,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов19) КАК ВторойЧасов19,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов20) КАК ВторойЧасов20,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов21) КАК ВторойЧасов21,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов22) КАК ВторойЧасов22,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов23) КАК ВторойЧасов23,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов24) КАК ВторойЧасов24,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов25) КАК ВторойЧасов25,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов26) КАК ВторойЧасов26,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов27) КАК ВторойЧасов27,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов28) КАК ВторойЧасов28,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов29) КАК ВторойЧасов29,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов30) КАК ВторойЧасов30,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойЧасов31) КАК ВторойЧасов31,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов1) КАК ТретийЧасов1,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов2) КАК ТретийЧасов2,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов3) КАК ТретийЧасов3,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов4) КАК ТретийЧасов4,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов5) КАК ТретийЧасов5,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов6) КАК ТретийЧасов6,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов7) КАК ТретийЧасов7,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов8) КАК ТретийЧасов8,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов9) КАК ТретийЧасов9,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов10) КАК ТретийЧасов10,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов11) КАК ТретийЧасов11,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов12) КАК ТретийЧасов12,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов13) КАК ТретийЧасов13,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов14) КАК ТретийЧасов14,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов15) КАК ТретийЧасов15,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов16) КАК ТретийЧасов16,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов17) КАК ТретийЧасов17,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов18) КАК ТретийЧасов18,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов19) КАК ТретийЧасов19,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов20) КАК ТретийЧасов20,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов21) КАК ТретийЧасов21,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов22) КАК ТретийЧасов22,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов23) КАК ТретийЧасов23,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов24) КАК ТретийЧасов24,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов25) КАК ТретийЧасов25,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов26) КАК ТретийЧасов26,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов27) КАК ТретийЧасов27,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов28) КАК ТретийЧасов28,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов29) КАК ТретийЧасов29,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов30) КАК ТретийЧасов30,
	|	СУММА(ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийЧасов31) КАК ТретийЧасов31
	
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремениОрганизации.ОтработанноеВремя КАК ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя
	|ГДЕ ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка = &Докум
	//|ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.ПериодРегистрации МЕЖДУ &Нач И &Кон
	//|И ВЫБОР
	//|  КОГДА &Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//|  ТОГДА ИСТИНА
	//|  ИНАЧЕ ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)
	//|		ИЛИ ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.ПодразделениеОрганизации В (&СписокПодразделенийРодителей)
	//|  КОНЕЦ
	//|И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.Организация = &Организация
	//|И ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Сотрудник,
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.НомерСтроки,
	|   ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.Ссылка.ПодразделениеОрганизации,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени31,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ПервыйВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ВторойВидВремени31,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени1,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени2,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени3,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени4,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени5,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени6,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени7,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени8,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени9,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени10,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени11,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени12,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени13,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени14,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени15,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени16,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени17,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени18,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени19,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени20,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени21,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени22,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени23,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени24,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени25,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени26,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени27,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени28,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени29,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени30,
	|	ТабельУчетаРабочегоВремениОрганизацииОтработанноеВремя.ТретийВидВремени31
	
	|УПОРЯДОЧИТЬ ПО
	|НомерСтроки
	
	|"; 		
	
	//Запрос.УстановитьПараметр("Нач", ПериодС);
	//Запрос.УстановитьПараметр("Кон", ПериодПо);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Докум", ДокумСсылка);
	
	СписокПодразделенийРодителей = Новый Массив;
	ПодразделениеРодитель = Подразделение.Родитель;
	Если Не ПодразделениеРодитель.Пустая() Тогда
		СписокПодразделенийРодителей.Добавить(ПодразделениеРодитель);
		ПодразделениеРодительРодитель = ПодразделениеРодитель.Родитель;
		Если Не ПодразделениеРодительРодитель.Пустая() Тогда
			СписокПодразделенийРодителей.Добавить(ПодразделениеРодительРодитель);
			ПодразделениеРодительРодительРодитель = ПодразделениеРодительРодитель.Родитель;
			Если Не ПодразделениеРодительРодительРодитель.Пустая() Тогда
				СписокПодразделенийРодителей.Добавить(ПодразделениеРодительРодительРодитель);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокПодразделенийРодителей", СписокПодразделенийРодителей);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	РезультатНомерСтроки = Результат.Скопировать(,"Сотрудник,НомерСтроки");
	
	Если Результат.Количество() = 0 Тогда
		Сообщить("Нет данных для формирования табеля.");
		Возврат ТабДокумент;
	КонецЕсли;
	
	//ТЗСотрудников = Результат.Скопировать();
	
	//Периоды работы
	СписокСотрудников = Результат.ВыгрузитьКолонку("Сотрудник");
	ЗапросПериоды = Новый Запрос;
	ЗапросПериоды.Текст = "ВЫБРАТЬ
	|	ТЗ.Сотрудник,
	|	ТЗ.НомерСтроки
	|ПОМЕСТИТЬ ВТТЗ
	|ИЗ &ТЗ КАК ТЗ
	|;
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизацийСрез.Сотрудник,
	|	&Нач КАК Период,
	|	РаботникиОрганизацийСрез.Должность,
	|	РаботникиОрганизацийСрез.ПодразделениеОрганизации
	|ПОМЕСТИТЬ ВТРаботникиОрганизаций
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Нач, Сотрудник В (&СписокСотрудников) И Организация = &Организация) КАК РаботникиОрганизацийСрез
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации
	|ВЫБРАТЬ
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)
	|	И РаботникиОрганизаций.Период МЕЖДУ &Нач И &Кон
	|	И РаботникиОрганизаций.Организация = &Организация
	|;
	|////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо КАК ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код КАК ТабНом,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|   ВТРаботникиОрганизаций.Период КАК ДатаНач,
	|   МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(РаботникиОрганизацийБольше.Период,СЕКУНДА,-1),&Кон)) КАК ДатаКон
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ ВТРаботникиОрганизаций
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизаций КАК РаботникиОрганизацийБольше
	|ПО ВТРаботникиОрганизаций.Сотрудник = РаботникиОрганизацийБольше.Сотрудник
	|	И ВТРаботникиОрганизаций.Период < РаботникиОрганизацийБольше.Период
	//|%УсловиеПодразделение%
	|СГРУППИРОВАТЬ ПО
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|	ВТРаботникиОрганизаций.Период
	|;
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериоды.Сотрудник,
	|	ВТПериоды.ФизЛицо,
	|	ВТПериоды.ТабНом,
	|	ВТПериоды.Должность,
	|	ВТПериоды.ПодразделениеОрганизации,
	|	ВТПериоды.ДатаНач,
	|	ВТПериоды.ДатаКон,
	|   ВТТЗ.НомерСтроки
	|ИЗ ВТПериоды
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТТЗ
	|ПО ВТПериоды.Сотрудник = ВТТЗ.Сотрудник
	|ГДЕ ВТПериоды.ДатаНач <> ВТПериоды.ДатаКон
	|УПОРЯДОЧИТЬ ПО
	//|ВТПериоды.Сотрудник.Наименование,
	|ВТТЗ.НомерСтроки,
	|ДатаНач
	|";
	ЗапросПериоды.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросПериоды.УстановитьПараметр("Организация", Организация);
	ЗапросПериоды.УстановитьПараметр("Нач", ПериодС);
	ЗапросПериоды.УстановитьПараметр("Кон", ПериодПо);
	ЗапросПериоды.УстановитьПараметр("ТЗ", РезультатНомерСтроки);
	
	//Если ЗначениеЗаполнено(Подразделение) Тогда
	//	ЗапросПериоды.Текст = СтрЗаменить(ЗапросПериоды.Текст, "%УсловиеПодразделение%", "ГДЕ ВТРаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
	//	ЗапросПериоды.УстановитьПараметр("Подразделение", Подразделение);
	//	//ЗапросПериоды.УстановитьПараметр("СписокПодразделенийРодителей", СписокПодразделенийРодителей);
	//Иначе
	//	ЗапросПериоды.Текст = СтрЗаменить(ЗапросПериоды.Текст, "%УсловиеПодразделение%", "");	
	//КонецЕсли;
	
	ТЗПериоды = ЗапросПериоды.Выполнить().Выгрузить();
	
	//////////////////////////////////////////////////////////////////
	ЗапросПериодыРеальнойРаботыВПодразделении = Новый Запрос;
	ЗапросПериодыРеальнойРаботыВПодразделении.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизацийСрез.Сотрудник,
	|	&Нач КАК Период,
	|	РаботникиОрганизацийСрез.Должность,
	|	РаботникиОрганизацийСрез.ПодразделениеОрганизации
	|ПОМЕСТИТЬ ВТРаботникиОрганизаций
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Нач, Сотрудник В (&СписокСотрудников) И Организация = &Организация) КАК РаботникиОрганизацийСрез
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ПодразделениеОрганизации
	|ВЫБРАТЬ
	|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ РаботникиОрганизаций.Сотрудник В (&СписокСотрудников)
	|И РаботникиОрганизаций.Период МЕЖДУ &Нач И &Кон
	|И РаботникиОрганизаций.Организация = &Организация
	|;
	|////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо КАК ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код КАК ТабНом,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|   ВТРаботникиОрганизаций.Период КАК ДатаНач,
	|   МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(РаботникиОрганизацийБольше.Период,СЕКУНДА,-1),&Кон)) КАК ДатаКон
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ ВТРаботникиОрганизаций
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботникиОрганизаций КАК РаботникиОрганизацийБольше
	|ПО ВТРаботникиОрганизаций.Сотрудник = РаботникиОрганизацийБольше.Сотрудник
	|	И ВТРаботникиОрганизаций.Период < РаботникиОрганизацийБольше.Период
	|%УсловиеПодразделение%
	|СГРУППИРОВАТЬ ПО
	|	ВТРаботникиОрганизаций.Сотрудник,
	|	ВТРаботникиОрганизаций.Сотрудник.ФизЛицо,
	|	ВТРаботникиОрганизаций.Сотрудник.Код,
	|	ВТРаботникиОрганизаций.Должность,
	|	ВТРаботникиОрганизаций.ПодразделениеОрганизации,
	|	ВТРаботникиОрганизаций.Период
	|;
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПериоды.Сотрудник,
	|	ВТПериоды.ФизЛицо,
	|	ВТПериоды.ТабНом,
	|	ВТПериоды.Должность,
	|	ВТПериоды.ПодразделениеОрганизации,
	|	ВТПериоды.ДатаНач,
	|	ВТПериоды.ДатаКон
	//|   ВТТЗ.НомерСтроки
	|ИЗ ВТПериоды
	|ГДЕ ВТПериоды.ДатаНач <> ВТПериоды.ДатаКон
	//|УПОРЯДОЧИТЬ ПО
	//|ВТПериоды.Сотрудник.Наименование,
	//|ВТТЗ.НомерСтроки,
	//|ДатаНач
	|";
	ЗапросПериодыРеальнойРаботыВПодразделении.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	ЗапросПериодыРеальнойРаботыВПодразделении.УстановитьПараметр("Организация", Организация);
	ЗапросПериодыРеальнойРаботыВПодразделении.УстановитьПараметр("Нач", ПериодС);
	ЗапросПериодыРеальнойРаботыВПодразделении.УстановитьПараметр("Кон", ПериодПо);
	//ЗапросПериоды.УстановитьПараметр("ТЗ", РезультатНомерСтроки);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗапросПериодыРеальнойРаботыВПодразделении.Текст = СтрЗаменить(ЗапросПериодыРеальнойРаботыВПодразделении.Текст, "%УсловиеПодразделение%", "ГДЕ ВТРаботникиОрганизаций.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)");
		ЗапросПериодыРеальнойРаботыВПодразделении.УстановитьПараметр("Подразделение", Подразделение);
		//ЗапросПериоды.УстановитьПараметр("СписокПодразделенийРодителей", СписокПодразделенийРодителей);
	Иначе
		ЗапросПериодыРеальнойРаботыВПодразделении.Текст = СтрЗаменить(ЗапросПериодыРеальнойРаботыВПодразделении.Текст, "%УсловиеПодразделение%", "");	
	КонецЕсли;
	
	ТЗПериодыРеальнойРаботыВПодразделении = ЗапросПериодыРеальнойРаботыВПодразделении.Выполнить().Выгрузить();
	//////////////////////////////////////////////////////////////////
	
	СписокСотрудниковПодразделение = ТЗПериоды.ВыгрузитьКолонку("Сотрудник");
	////////////////
	
	//Удалим лишнее
	РезультатПоПодразделению = Результат.Скопировать();
	РезультатПоПодразделению.Очистить();
	Для Каждого Стр Из Результат Цикл
		Если СписокСотрудниковПодразделение.Найти(Стр.Сотрудник) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтр = РезультатПоПодразделению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,Стр);
	КонецЦикла;
	ТЗСотрудников = РезультатПоПодразделению.Скопировать();
	////////////////
	
	//Преобразуем ТЗСотрудников (если должность одна - свернем в одну строку)
	//ДеньОкончаниеПериода = День(ПериодПо);
	ДеньОкончаниеПериода = День(КонецМесяца(ПериодПо));
	
	ТЗСотрудниковИтог = ТЗСотрудников.Скопировать();
	ТЗСотрудниковИтог.Очистить();
	ТЗСотрудниковИтог.Колонки.Добавить("Должность");
	Для Каждого Пер Из ТЗПериоды Цикл
		
		//Если Пер.ДатаНач = Пер.ДатаКон Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ПерНачалоДень = День(Пер.ДатаНач);
		ПерКонецДень = День(Пер.ДатаКон);
		
		СтруктураСотрудник = Новый Структура;
		СтруктураСотрудник.Вставить("Сотрудник", Пер.Сотрудник);
		НужныеСтрокиСотрудник = ТЗСотрудников.НайтиСтроки(СтруктураСотрудник);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник", Пер.Сотрудник);
		СтруктураОтбора.Вставить("ПодразделениеОрганизации", Пер.ПодразделениеОрганизации);
		СтруктураОтбора.Вставить("Должность", Пер.Должность);
		
		НужныеСтроки = ТЗСотрудниковИтог.НайтиСтроки(СтруктураОтбора);
		Если НужныеСтроки.Количество() = 0 Тогда
			НужнаяСтрока = ТЗСотрудниковИтог.Добавить();
			НужнаяСтрока.Сотрудник = Пер.Сотрудник;
			НужнаяСтрока.Должность = Пер.Должность;
			НужнаяСтрока.ПодразделениеОрганизации = Пер.ПодразделениеОрганизации;
		Иначе
			НужнаяСтрока = НужныеСтроки[0];
		КонецЕсли;
		Для д = 1 По ДеньОкончаниеПериода Цикл
			Если НЕ (д >= ПерНачалоДень И д <= ПерКонецДень) Тогда
				Продолжить;
			КонецЕсли;
			
			НаименованиеКолонкиПервыйВидВремени = "ПервыйВидВремени" + СокрЛП(д);
			НаименованиеКолонкиВторойВидВремени = "ВторойВидВремени" + СокрЛП(д);
			НаименованиеКолонкиТретийВидВремени = "ТретийВидВремени" + СокрЛП(д);
			НаименованиеКолонкиПервыйЧасов = "ПервыйЧасов" + СокрЛП(д);
			НаименованиеКолонкиВторойЧасов = "ВторойЧасов" + СокрЛП(д);
			НаименованиеКолонкиТретийЧасов = "ТретийЧасов" + СокрЛП(д);
			
			Для Каждого Сотр Из НужныеСтрокиСотрудник Цикл
				Если ЗначениеЗаполнено(Сотр[НаименованиеКолонкиПервыйВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиПервыйВидВремени] = Сотр[НаименованиеКолонкиПервыйВидВремени];
					НужнаяСтрока[НаименованиеКолонкиПервыйЧасов] = Сотр[НаименованиеКолонкиПервыйЧасов];
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НужнаяСтрока[НаименованиеКолонкиПервыйВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиПервыйВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
					НужнаяСтрока[НаименованиеКолонкиПервыйЧасов] = 0;
				КонецЕсли;
				Если ЗначениеЗаполнено(Сотр[НаименованиеКолонкиВторойВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиВторойВидВремени] = Сотр[НаименованиеКолонкиВторойВидВремени];
					НужнаяСтрока[НаименованиеКолонкиВторойЧасов] = Сотр[НаименованиеКолонкиВторойЧасов];
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НужнаяСтрока[НаименованиеКолонкиВторойВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиВторойВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
					НужнаяСтрока[НаименованиеКолонкиВторойЧасов] = 0;
				КонецЕсли;
				Если ЗначениеЗаполнено(Сотр[НаименованиеКолонкиТретийВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиТретийВидВремени] = Сотр[НаименованиеКолонкиТретийВидВремени];
					НужнаяСтрока[НаименованиеКолонкиТретийЧасов] = Сотр[НаименованиеКолонкиТретийЧасов];
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НужнаяСтрока[НаименованиеКолонкиТретийВидВремени]) Тогда
					НужнаяСтрока[НаименованиеКолонкиТретийВидВремени] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();
					НужнаяСтрока[НаименованиеКолонкиТретийЧасов] = 0;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	////////////////
	
	Для Каждого СтрИтог Из ТЗСотрудниковИтог Цикл
		Для н = 1 По ДеньОкончаниеПериода Цикл
			ИмяВид1Проверка = "ПервыйВидВремени" + Строка(н);
			ИмяВид2Проверка = "ВторойВидВремени" + Строка(н);
			ИмяВид3Проверка = "ТретийВидВремени" + Строка(н);
			ИмяЧасов1Проверка = "ПервыйЧасов" + Строка(н);
			ИмяЧасов2Проверка = "ВторойЧасов" + Строка(н);
			ИмяЧасов3Проверка = "ТретийЧасов" + Строка(н);
			Если СтрИтог[ИмяВид1Проверка] = Неопределено Тогда
				СтрИтог[ИмяВид1Проверка] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();	
			КонецЕсли;
			Если СтрИтог[ИмяВид2Проверка] = Неопределено Тогда
				СтрИтог[ИмяВид2Проверка] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();	
			КонецЕсли;
			Если СтрИтог[ИмяВид3Проверка] = Неопределено Тогда
				СтрИтог[ИмяВид3Проверка] = Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка();	
			КонецЕсли;
			Если СтрИтог[ИмяЧасов1Проверка] = Неопределено Тогда
				СтрИтог[ИмяЧасов1Проверка] = 0;	
			КонецЕсли;
			Если СтрИтог[ИмяЧасов2Проверка] = Неопределено Тогда
				СтрИтог[ИмяЧасов2Проверка] = 0;	
			КонецЕсли;
			Если СтрИтог[ИмяЧасов3Проверка] = Неопределено Тогда
				СтрИтог[ИмяЧасов3Проверка] = 0;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТранспонТаб = Новый ТаблицаЗначений;
	ТранспонТаб.Колонки.Добавить("ЗначениеГруп"); 		
	
	Для Каждого Колонка Из РезультатПоПодразделению.Колонки Цикл
		Если Найти(Колонка.Имя, "ВидВремени") = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Строка Из РезультатПоПодразделению Цикл
			Если 
				Строка(Строка[Колонка.Имя])="" Тогда 
				Продолжить; 
			КонецЕсли;
			НоваяСтрока = ТранспонТаб.Добавить();
			НоваяСтрока.ЗначениеГруп = Строка[Колонка.Имя];				
		КонецЦикла;
	КонецЦикла;
	//обязательно добавляем расчет выходных дней
	НоваяСтрока = ТранспонТаб.Добавить();
	НоваяСтрока.ЗначениеГруп=Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
	//обязательно добавляем расчет выходных дней
	ТранспонТаб.Свернуть("ЗначениеГруп");
	ТранспонТаб.Колонки.Добавить("ПредставлениеСтр",Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(300)));
	
	//ФОРМИРОВАНИЕ ПЕЧАТНОЙ ФОРМЫ		
	МакетТ = ПолучитьМакет("МакетТабля");		
	
	ОблЗаглТ = МакетТ.ПолучитьОбласть("ЗагТабл|НачЧасть");
	ОблЗаглТЧ = МакетТ.ПолучитьОбласть("ЗагТабл|Число");
	ОбластьДни = МакетТ.ПолучитьОбласть("ЗагТабл|Дни");
	ОблЗаглРД = МакетТ.ПолучитьОбласть("ЗагТабл|РД");
	Обл1РД = МакетТ.ПолучитьОбласть("Итого|РД");
	
	ОбластьСтр = МакетТ.ПолучитьОбласть("СтрокаСотр|НачЧасть");
	ОбластьЧис = МакетТ.ПолучитьОбласть("СтрокаСотр|Число");
	ОблСотрДни = МакетТ.ПолучитьОбласть("СтрокаСотр|Дни"); 		
	ОблСотрЧас = МакетТ.ПолучитьОбласть("СтрокаСотр|Часы"); 		
	ОблСотрРД = МакетТ.ПолучитьОбласть("СтрокаСотр|РД"); 		
	
	ОблИтогОбщ = МакетТ.ПолучитьОбласть("Итого|НачЧасть"); 		
	ОблИтогЧис = МакетТ.ПолучитьОбласть("Итого|Число"); 		
	ОблИД = МакетТ.ПолучитьОбласть("Итого|Дни"); 		
	ОблИЧ = МакетТ.ПолучитьОбласть("Итого|Часы");
	ОбЗнач = МакетТ.ПолучитьОбласть("Обозначения");
	
	//Заголовок полностью
	Область = МакетТ.ПолучитьОбласть("Шапка|НачЧасть");
	Область.Параметры.НаименОрган = Организация;
	
	СклонениеПодразделения = СклонениеПредставленийОбъектовСервер.СклоненияИзРегистра(Подразделение);
	Если СклонениеПодразделения <> Неопределено Тогда
		Область.Параметры.НаименОтдел = СклонениеПодразделения.Получить(Перечисления.Падеж.Именительный);
	КонецЕсли;
	Область.Параметры.месТаб = НРег(РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодС));
	ТабДокумент.Вывести(Область);
	
	//Шапка таблицы (ФИО/Должность)
	ТабДокумент.Вывести(ОблЗаглТ);
	
	ОбластьПодписи = МакетТ.ПолучитьОбласть("Подписи");			
	
	//Заголовок номеров дней всего месяца
	//ДеньОкончаниеПериода = День(ПериодПо);
	Для СтрС = 1 По ДеньОкончаниеПериода Цикл
		ОблЗаглТЧ.Параметры.НД = СтрС;
		ТабДокумент.Присоединить(ОблЗаглТЧ);	
	КонецЦикла;
	
	Если ДеньОкончаниеПериода > 10 Тогда  
		ОбластьОБД = ТабДокумент.Область(5,1,5,ДеньОкончаниеПериода); //Организация
		ОбластьОБД.Объединить();         			
		ОбластьОБД = ТабДокумент.Область(9,1,9,ДеньОкончаниеПериода); //Подразделение
		ОбластьОБД.Объединить();         			
	КонецЕсли;
	
	//вывод разделителя после чисел	
	Если ФлПредставления = Истина Тогда	
		ОбластьОБД = ТабДокумент.Присоединить(ОблЗаглРД);		
		ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх,ОбластьОБД.Лево+1,ОбластьОБД.Низ-1,ОбластьОБД.Право+ТранспонТаб.Количество());		
		ОбластьОБД.Объединить();         
	КонецЕсли;
	
	//вывод ЗАГОЛОВКА всех дней	
	Для Каждого Строка Из ТранспонТаб Цикл
		Строка.ПредставлениеСтр = Строка.ЗначениеГруп.ПолноеНаименование;
		ОбластьДни.Параметры.ДЧ = СокрЛП("Дни");			
		ОбластьДни.Параметры.Вявка = СокрЛП(Строка.ЗначениеГруп);			
		Если ФлПредставления = Истина Тогда
			ТабДокумент.Присоединить(ОбластьДни);		
		КонецЕсли;
	КонецЦикла;	
	
	//вывод разделителя 	
	ОбластьОБД = ТабДокумент.Присоединить(ОблЗаглРД);
	ПерваяКолонкаДни = ОбластьОБД.Лево;
	
	Присоединили = 0;
	
	//вывод заголовока дней как в образце
	Для Сч = 4 По ТзНастройки.Колонки.Количество()-1 Цикл
		//*****если иные виды отсутствия то вывести какие именно
		Если ТзНастройки.Колонки[Сч].Имя = "Иных_видов_отсутствия" Тогда 
			Для Каждого Строка Из ТранспонТаб Цикл //НайденнаяСтрока.Иных_видов_отсутствия		
				НайденнаяСтрока = ТзНастройки.Найти(Строка.ПредставлениеСтр, "ВидПредставление"); 				
				Если НайденнаяСтрока <> Неопределено Тогда
					Если НайденнаяСтрока.Иных_видов_отсутствия = "Да" Тогда
						//*******иные виды отсутствия будут развёрнуты
						Строка.ПредставлениеСтр = Строка.ЗначениеГруп.ПолноеНаименование;
						ОбластьДни.Параметры.ДЧ = СокрЛП("Дни");			
						//ОбластьДни.Параметры.Вявка = СокрЛП(Строка.ЗначениеГруп);
						ОбластьДни.Параметры.Вявка = СокрЛП(НайденнаяСтрока.ВидОтсутствия);
						
						ТабДокумент.Присоединить(ОбластьДни);
						
						Присоединили = Присоединили + 1;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			ОбластьДни.Параметры.ДЧ = СокрЛП("Дни");	
			ОбластьДни.Параметры.Вявка = СтрЗаменить(СокрЛП(ТзНастройки.Колонки[Сч].Имя),"_"," ");
			ТабДокумент.Присоединить(ОбластьДни);
			
			Присоединили = Присоединили + 1;
			
		КонецЕсли;		
	КонецЦикла;
	
	//Объединим шапку Дни
	ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх, ПерваяКолонкаДни + 1, ОбластьОБД.Низ - 1,ПерваяКолонкаДни + Присоединили);		
	ОбластьОБД.Объединить();
	
	//вывод разделителя 		
	ОбластьОБД = ТабДокумент.Присоединить(ОблЗаглРД);
	ПерваяКолонкаЧасы = ОбластьОБД.Лево;
	
	Если ФлПредставления = Истина Тогда
		ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх,ОбластьОБД.Лево + 1,ОбластьОБД.Низ - 1,ОбластьОБД.Право + ТзНастройкиЧасы.Колонки.Количество());			
	Иначе	
		ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх,ОбластьОБД.Лево + 1,ОбластьОБД.Низ - 1,ОбластьОБД.Право + ТзНастройкиЧасы.Колонки.Количество() - 4);		
	КонецЕсли;
	
	//Заголовок тип Часы
	Для Каждого Строка Из ТранспонТаб Цикл
		ОбластьДни.Параметры.ДЧ = СокрЛП("Часы");				
		ОбластьДни.Параметры.Вявка = СокрЛП(Строка.ЗначениеГруп);
		Если ФлПредставления = Истина Тогда
			ТабДокумент.Присоединить(ОбластьДни);
		КонецЕсли;
	КонецЦикла;
	
	//вывод разделителя 
	Если ФлПредставления = Истина Тогда
		ОбластьОБД = ТабДокумент.Присоединить(ОблЗаглРД);		
		ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх, ОбластьОБД.Лево + 1, ОбластьОБД.Низ - 1, ОбластьОБД.Право + ТранспонТаб.Количество() - 4);		
		ОбластьОБД.Объединить(); 		
	КонецЕсли;
	
	//Заголовок как в образце
	Присоединили = 0;
	Для Сч = 4 По ТзНастройкиЧасы.Колонки.Количество() - 1 Цикл
		ОбластьДни.Параметры.Вявка = СтрЗаменить(СокрЛП(ТзНастройкиЧасы.Колонки[Сч].Имя),"_"," ");
		ТабДокумент.Присоединить(ОбластьДни);
		
		Присоединили = Присоединили + 1;
	КонецЦикла;
	
	//Объединим шапку Часы
	ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх, ПерваяКолонкаЧасы + 1, ОбластьОБД.Низ, ПерваяКолонкаЧасы + Присоединили);		
	ОбластьОБД.Объединить();
	
	//вывод разделителя 
	ТабДокумент.Присоединить(ОблЗаглРД);	
	//вывод разделителя 
	
	ТранспонТаб.Колонки.Добавить("ИтогДни",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3)));
	ТранспонТаб.Колонки.Добавить("ИтогЧасы",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 3))); 
	
	ТранспонТабИтоги = ТранспонТаб.Скопировать();
	//ТранспонТабИтоги.Очистить();
	
	н = 0;
	
	ТЗСотрудникДолжностьПодразделение = ТЗПериоды.Скопировать();
	ТЗСотрудникДолжностьПодразделение.Свернуть("Сотрудник,ФизЛицо,ТабНом,ПодразделениеОрганизации,Должность");
	Для Каждого СтрСотр Из ТЗСотрудникДолжностьПодразделение Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник",СтрСотр.Сотрудник);
		СтруктураОтбора.Вставить("ПодразделениеОрганизации",СтрСотр.ПодразделениеОрганизации);
		СтруктураОтбора.Вставить("Должность",СтрСотр.Должность);
		НужныеПериоды = ТЗПериоды.НайтиСтроки(СтруктураОтбора);
		
		НужныеПериодыРаботыВПодразделении = ТЗПериодыРеальнойРаботыВПодразделении.НайтиСтроки(СтруктураОтбора);
		
		н = н + 1;
		ОбластьСтр.Параметры.ПП = СокрЛП(н);
		ОбластьСтр.Параметры.ФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(СтрСотр.ФизЛицо);
		ОбластьСтр.Параметры.ДолжностьСотр = НРЕГ(СтрСотр.Должность);
		ОбластьСтр.Параметры.ТабН = СтрСотр.ТабНом;		
		ТабДокумент.Вывести(ОбластьСтр);	
		
		//Для Каждого Пер Из НужныеПериоды Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Сотрудник", СтрСотр.Сотрудник);
		СтруктураОтбора.Вставить("ПодразделениеОрганизации", СтрСотр.ПодразделениеОрганизации); //???
		СтруктураОтбора.Вставить("Должность", СтрСотр.Должность); //???
		
		//НужныеСотрудники = ТЗСотрудников.НайтиСтроки(СтруктураОтбора);
		
		НужныеСотрудники = ТЗСотрудниковИтог.НайтиСтроки(СтруктураОтбора);
		
		Если НужныеСотрудники.Количество() > 0 Тогда
			Для Каждого С Из ТранспонТаб Цикл
				С.ИтогДни = 0;
				С.ИтогЧасы = 0;
			КонецЦикла;
			
			//н = н + 1;
			//ОбластьСтр.Параметры.ПП = СокрЛП(н);
			//ОбластьСтр.Параметры.ФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Пер.ФизЛицо);
			////ОбластьСтр.Параметры.ДолжностьСотр = НРЕГ(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодПо,Новый Структура("Сотрудник",СтрС.Сотрудник)).Должность);
			//ОбластьСтр.Параметры.ДолжностьСотр = НРЕГ(Пер.Должность);
			//ОбластьСтр.Параметры.ТабН = Пер.ТабНом;		
			//ТабДокумент.Вывести(ОбластьСтр);	
		КонецЕсли;
		
		//Для Каждого СтрС из ТЗСотрудников Цикл
		Для Каждого СтрС из НужныеСотрудники Цикл
			
			
			//Здесь надо исключить неподходящую строку (в которой за текущий период нет ни одного вида времени)
			ЕстьДанные = Ложь;
			Для Каждого Пер Из НужныеПериоды Цикл
				Для д = День(Пер.ДатаНач) ПО День(Пер.ДатаКон) Цикл
					ИмяВид1Проверка = "ПервыйВидВремени" + Строка(д);
					ИмяВид2Проверка = "ВторойВидВремени" + Строка(д);
					ИмяВид3Проверка = "ТретийВидВремени" + Строка(д);
					Если ЗначениеЗаполнено(СтрС[ИмяВид1Проверка]) ИЛИ ЗначениеЗаполнено(СтрС[ИмяВид2Проверка]) ИЛИ ЗначениеЗаполнено(СтрС[ИмяВид3Проверка]) Тогда
						ЕстьДанные = Истина;
						Прервать;
					КонецЕсли;
					Если ЕстьДанные Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если Не ЕстьДанные Тогда
				Продолжить;
			КонецЕсли;
			//Для Каждого С Из ТранспонТаб Цикл
			//	С.ИтогДни = 0;
			//	С.ИтогЧасы = 0;
			//КонецЦикла;
			//
			//н = н + 1;
			//ОбластьСтр.Параметры.ПП = СокрЛП(н);
			//ОбластьСтр.Параметры.ФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(СтрС.Сотрудник.ФизЛицо);
			////ОбластьСтр.Параметры.ДолжностьСотр = НРЕГ(РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодПо,Новый Структура("Сотрудник",СтрС.Сотрудник)).Должность);
			//ОбластьСтр.Параметры.ДолжностьСотр = НРЕГ(Пер.Должность);
			//ОбластьСтр.Параметры.ТабН = СтрС.Сотрудник.Код;		
			//ТабДокумент.Вывести(ОбластьСтр);	
			
			
			//цикл по дням   			
			Для Сч = 1 По ДеньОкончаниеПериода Цикл 				
				ДатаПроверки = Дата(Год(ПериодС), Месяц(ПериодС), Сч);
				
				РаботалВПодразделении = Ложь;
				Для Каждого Пер Из НужныеПериодыРаботыВПодразделении Цикл
					Если ДатаПроверки >= Пер.ДатаНач И ДатаПроверки <= Пер.ДатаКон Тогда
						РаботалВПодразделении = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				ЕстьДанныеДата = Ложь;
				Для Каждого Пер Из НужныеПериоды Цикл
					Если ДатаПроверки >= Пер.ДатаНач И ДатаПроверки <= Пер.ДатаКон Тогда
						//ОбластьЧис.Параметры.ПарамСтр = "";
						//ТабДокумент.Присоединить(ОбластьЧис);
						//Продолжить;
						ЕстьДанныеДата = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЕстьДанныеДата Тогда
					ОбластьЧис.Параметры.ПарамСтр = "";
					ТабДокумент.Присоединить(ОбластьЧис);
					Продолжить;
				КонецЕсли;
				
				ОблЗаглТЧ.Параметры.НД = Сч;			
				ИмяРек1 = "ПервыйЧасов" + Строка(Сч); ИмяВид1 = "ПервыйВидВремени" + Строка(Сч);				
				ИмяРек2 = "ВторойЧасов" + Строка(Сч); ИмяВид2 = "ВторойВидВремени" + Строка(Сч);				
				ИмяРек3 = "ТретийЧасов" + Строка(Сч); ИмяВид3 = "ТретийВидВремени" + Строка(Сч);				
				
				Если СтрС[ИмяВид1]=Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() И
					СтрС[ИмяВид2]=Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() И
					СтрС[ИмяВид3]=Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка() И 
					РаботалВПодразделении
					Тогда
					СтрС[ИмяВид1]=Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни;
				КонецЕсли;	
				
				//Проверка командировки в выходной
				ЕстьКомандировкаВВыходной = Ложь;
				Если СтрС[ИмяВид1] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка ИЛИ 
					СтрС[ИмяВид2] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка ИЛИ 
					СтрС[ИмяВид3] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка Тогда
					ЭтоВыходной = ПроверкаВыходногоДня(Пер.Сотрудник, ДатаПроверки);
					Если ЭтоВыходной Тогда
						ЕстьКомандировкаВВыходной = Истина;
					КонецЕсли;
				КонецЕсли;
				//////////////////////////////////
				
				Для Каждого Строка Из ТранспонТаб Цикл
					
					
					Если Строка.ЗначениеГруп = СтрС[ИмяВид1] Тогда 
						Строка.ИтогДни = Строка.ИтогДни + 1;
						Если НЕ (СтрС[ИмяВид1] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка И ЕстьКомандировкаВВыходной) Тогда
							Строка.ИтогЧасы = Строка.ИтогЧасы + СтрС[ИмяРек1];
						КонецЕсли;
					КонецЕсли;	
					
					Если Строка.ЗначениеГруп = СтрС[ИмяВид2] Тогда 
						Строка.ИтогДни = Строка.ИтогДни + 1;
						Если НЕ (СтрС[ИмяВид2] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка И ЕстьКомандировкаВВыходной) Тогда
							Строка.ИтогЧасы = Строка.ИтогЧасы + СтрС[ИмяРек2];
						КонецЕсли;
					КонецЕсли;	
					
					Если Строка.ЗначениеГруп = СтрС[ИмяВид3] Тогда 
						Строка.ИтогДни = Строка.ИтогДни + 1;
						Если НЕ (СтрС[ИмяВид3] = Справочники.КлассификаторИспользованияРабочегоВремени.Командировка И ЕстьКомандировкаВВыходной) Тогда
							Строка.ИтогЧасы = Строка.ИтогЧасы + СтрС[ИмяРек3];
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;					
				
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид1].ПолноеНаименование, "ВидПредставление");
				ПредВид1=НайденнаяСтрока.Выводимая_буква+" ";
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид2].ПолноеНаименование, "ВидПредставление");
				ПредВид2=НайденнаяСтрока.Выводимая_буква+" ";
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид3].ПолноеНаименование, "ВидПредставление");
				ПредВид3=НайденнаяСтрока.Выводимая_буква+" ";
				
				Если НЕ СтрС[ИмяРек1]=0 Тогда ПредЧас1=Строка(СтрС[ИмяРек1])+" "; Иначе ПредЧас1=""; КонецЕсли;				
				Если НЕ СтрС[ИмяРек2]=0 Тогда ПредЧас2=Строка(СтрС[ИмяРек2])+" "; Иначе ПредЧас2=""; КонецЕсли;				
				Если НЕ СтрС[ИмяРек3]=0 Тогда ПредЧас3=Строка(СтрС[ИмяРек3])+" "; Иначе ПредЧас3=""; КонецЕсли;					
				
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид1].ПолноеНаименование, "ВидПредставление");
				Если НайденнаяСтрока.Показывать_время="Нет" Тогда ПредЧас1=""; КонецЕсли;
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид2].ПолноеНаименование, "ВидПредставление");
				Если НайденнаяСтрока.Показывать_время="Нет" Тогда ПредЧас2=""; КонецЕсли;
				НайденнаяСтрока = ТзНастройкиБукв.Найти(СтрС[ИмяВид3].ПолноеНаименование, "ВидПредставление");
				Если НайденнаяСтрока.Показывать_время="Нет" Тогда ПредЧас3=""; КонецЕсли;
				
				ОбластьЧис.Параметры.ПарамСтр = СокрЛП(ПредВид3+ПредЧас3+ПредВид2+ПредЧас2+ПредВид1+ПредЧас1);	
				
				ТабДокумент.Присоединить(ОбластьЧис);	
			КонецЦикла;	
			//вывод разделителя после строки сотрудника
			ТабДокумент.Присоединить(ОблСотрРД);
			//вывод разделителя после строки сотрудника
			ТзВывод.Очистить();
			
			//вывод итогов как есть
			Для Каждого Строка Из ТранспонТаб Цикл
				ОблСотрДни.Параметры.КолДней=Строка.ИтогДни;	
				Если ФлПредставления=Истина Тогда
					ТабДокумент.Присоединить(ОблСотрДни);				
				КонецЕсли;
				НайденнаяСтрока = ТзНастройки.Найти(Строка.ПредставлениеСтр, "ВидПредставление"); 		
				
				Если НайденнаяСтрока<>Неопределено Тогда				
					СтрВ=ТзВывод.Добавить(); 
					Для Сч=1 По ТзНастройки.Колонки.Количество()-1 Цикл
						Если НайденнаяСтрока[Сч]="Да" Тогда 
							СтрВ[Сч]=Число(Строка.ИтогДни);								
							СтлВ=ТзИтогДни.Добавить();
							СтлВ[Сч]=СтрВ[Сч];							
						КонецЕсли;
					КонецЦикла;	
					
					Если НайденнаяСтрока.Иных_видов_отсутствия="Да"	Тогда
						СтлВ=ТзИтогДни.Добавить();
						СтлВ=Строка.ИтогДни;							
					КонецЕсли;	
				КонецЕсли;								
			КонецЦикла;			
			//*********************РАЗБИРАТЬ ЗДЕСЬ
			ТранспонТаб1=ТранспонТаб.Скопировать();
			//*********************
			//вывод необычных итогов по дням			
			Для Сч=4 По ТзНастройки.Колонки.Количество()-1 Цикл				
				
				//************ВЫВОД
				Если ТзНастройки.Колонки[Сч].Имя="Иных_видов_отсутствия" Тогда 
					Для Каждого Строка Из ТранспонТаб Цикл //НайденнаяСтрока.Иных_видов_отсутствия		
						НайденнаяСтрока = ТзНастройки.Найти(Строка.ПредставлениеСтр, "ВидПредставление"); 				
						Если НайденнаяСтрока<>Неопределено Тогда
							Если НайденнаяСтрока.Иных_видов_отсутствия="Да" Тогда
								ОблСотрДни.Параметры.КолДней=Строка.ИтогДни;
								
								//Здесь будем подсчитывать итоги
								НужнаяСтрИтоги = ТранспонТабИтоги.Найти(Строка.ПредставлениеСтр,"ПредставлениеСтр");
								НужнаяСтрИтоги.ИтогДни = НужнаяСтрИтоги.ИтогДни + Строка.ИтогДни;
								
								Строка.ИтогДни=0;
								ТабДокумент.Присоединить(ОблСотрДни);
								
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;	
				Иначе	
					ОблСотрДни.Параметры.КолДней=Строка(ТзВывод.Итог(ТзВывод.Колонки[Сч].Имя));
					Если ОблСотрДни.Параметры.КолДней="0" Тогда ОблСотрДни.Параметры.КолДней=""; КонецЕсли;										
					ТабДокумент.Присоединить(ОблСотрДни);					
				КонецЕсли; 				
			КонецЦикла;			
			//вывод разделителя 
			ТабДокумент.Присоединить(ОблСотрРД);
			
			//вывод итогов по часам как есть
			ТзВыводЧасы.Очистить();
			Для Каждого Строка Из ТранспонТаб Цикл
				ОблСотрЧас.Параметры.КолЧасов=Строка.ИтогЧасы;	
				
				НайденнаяСтрока = ТзНастройкиЧасы.Найти(Строка.ПредставлениеСтр); 
				Если НайденнаяСтрока<>Неопределено Тогда				
					СтрВ=ТзВыводЧасы.Добавить(); //ОСТАНОВИЛСЯ ЗДЕСЬ В РАЗБОРЕ
					Для Сч=1 По ТзНастройкиЧасы.Колонки.Количество()-1 Цикл
						Если НайденнаяСтрока[Сч]="Да" Тогда 
							СтрВ[Сч]=Число(Строка.ИтогЧасы);
							СтлВ=ТзИтогЧас.Добавить();
							СтлВ[Сч]=СтрВ[Сч];							
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;				
				Строка.ИтогЧасы=0;							
			КонецЦикла;			
			
			//вывод необычных итогов по часам
			Для Сч=4 По ТзНастройкиЧасы.Колонки.Количество() - 1 Цикл				
				ОблСотрЧас.Параметры.КолЧасов = Строка(ТзВыводЧасы.Итог(ТзВыводЧасы.Колонки[Сч].Имя));
				Если ОблСотрЧас.Параметры.КолЧасов = "0" Тогда ОблСотрЧас.Параметры.КолЧасов = ""; КонецЕсли;
				ТабДокумент.Присоединить(ОблСотрЧас);	
			КонецЦикла;	
			//вывод разделителя 			
			ТабДокумент.Присоединить(ОблСотрРД);						
		КонецЦикла;	
		//КонецЦикла;
	КонецЦикла;
	ОбластьОБД = ТабДокумент.Вывести(ОблИтогОбщ);
	ОбластьОБД = ТабДокумент.Область(ОбластьОБД.Верх,ОбластьОБД.Лево,ОбластьОБД.Низ,ОбластьОБД.Право+ДеньОкончаниеПериода);		
	ОбластьОБД.Объединить(); 			
	
	Для СтрС=1 ПО ДеньОкончаниеПериода Цикл
		ТабДокумент.Присоединить(ОблИтогЧис);	
	КонецЦикла;
	ТабДокумент.Присоединить(Обл1РД);
	
	
	//вывод необычных итогов по дням
	Для Сч = 4 По ТзИтогДни.Колонки.Количество()-1 Цикл
		//************ВЫВОД
		Если ТзНастройки.Колонки[Сч].Имя = "Иных_видов_отсутствия" Тогда 
			Для Каждого Строка Из ТранспонТаб1 Цикл 		
				НайденнаяСтрока = ТзНастройки.Найти(Строка.ПредставлениеСтр, "ВидПредставление"); 				
				Если НайденнаяСтрока <> Неопределено Тогда
					Если НайденнаяСтрока.Иных_видов_отсутствия="Да" Тогда
						//
						//ОблИД.Параметры.ИтДни = Строка.ИтогДни;	
						НужнаяСтрокаИтоги = ТранспонТабИтоги.Найти(Строка.ПредставлениеСтр,"ПредставлениеСтр");
						ОблИД.Параметры.ИтДни = НужнаяСтрокаИтоги.ИтогДни;
						//
						Если ОблИД.Параметры.ИтДни = "0" Тогда ОблИД.Параметры.ИтДни = ""; КонецЕсли;
						
						ТабДокумент.Присоединить(ОблИД);		
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		Иначе	
			ОблИД.Параметры.ИтДни=Строка(ТзИтогДни.Итог(ТзИтогДни.Колонки[Сч].Имя));
			
			Если ОблИД.Параметры.ИтДни = "0" Тогда ОблИД.Параметры.ИтДни = ""; КонецЕсли;
			
			ТабДокумент.Присоединить(ОблИД);							
		КонецЕсли;	
	КонецЦикла;	
	//вывод жирного разделителя
	ТабДокумент.Присоединить(Обл1РД);
	
	Для Сч = 4 По ТзИтогЧас.Колонки.Количество() - 1 Цикл	
		ОблИЧ.Параметры.ИтЧас = Строка(ТзИтогЧас.Итог(ТзИтогЧас.Колонки[Сч].Имя));
		
		Если ОблИЧ.Параметры.ИтЧас = "0" Тогда ОблИЧ.Параметры.ИтЧас = ""; КонецЕсли;
		
		ТабДокумент.Присоединить(ОблИЧ);	
	КонецЦикла;	
	//вывод жирного разделителя
	ТабДокумент.Присоединить(Обл1РД);
	//вывод используемых обозначений	
	
	Для Каждого Строка Из ТранспонТаб Цикл 
		Если Строка.ЗначениеГруп.БуквенныйКод="Я" Тогда 
			Продолжить;
		КонецЕсли;
		ОбЗнач.Параметры.ОбозНевых=Строка.ЗначениеГруп.БуквенныйКод+" - "+НРЕГ(Строка.ЗначениеГруп.ПолноеНаименование)+"; "+ОбЗнач.Параметры.ОбозНевых;
	КонецЦикла;		
	ОбластьОБД=ТабДокумент.Вывести(ОбЗнач);		
	Если ДеньОкончаниеПериода>10 Тогда  
		ОбластьОБД=ТабДокумент.Область(ОбластьОБД.Верх,1,ОбластьОБД.Низ,48);		
		ОбластьОБД.Объединить();   
	КонецЕсли;	
	
	//******************************
	Если ЗначениеЗаполнено(Табельщик) Тогда
		ОбластьПодписи.Параметры.ОтвТаб = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Табельщик.ФизЛицо);
		ТабельщикДолжность = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодПо, Новый Структура("Сотрудник", Табельщик)).Должность;
		ОбластьПодписи.Параметры.ТабельщикДолжность = СокрЛП(ТабельщикДолжность);
	КонецЕсли;
	Если ЗначениеЗаполнено(РуководительСтруктурногоПодразделения) Тогда
		ОбластьПодписи.Параметры.Рук = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РуководительСтруктурногоПодразделения.ФизЛицо);
	КонецЕсли;
	Если ЗначениеЗаполнено(РаботникКадровойСлужбы) Тогда
		ОбластьПодписи.Параметры.РабКадр = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РаботникКадровойСлужбы.ФизЛицо);
	КонецЕсли;
	
	ОбластьПодписи.Параметры.ТекДата = Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm:ss'");
	ТабДокумент.Присоединить(ОбластьПодписи);
	ТабДокумент.ПолеСправа = 0; // отступ справа 
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ФиксацияСверху = 13;
	ТабДокумент.ФиксацияСлева = 12;	
	
	ТабДокумент.Показать("Табель");
КонецФункции	

Функция ПроверкаВыходногоДня(Сотр, ДатаПроверки)
	ЭтоВыходной = Истина;
	ГрафикСотрудника = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаПроверки, Новый Структура("Сотрудник", Сотр)).ГрафикРаботы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Дата,
	|	ГрафикиРаботыПоВидамВремени.ВидВремени
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.Дата = &Дата
	|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы
	|   И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|   И ГрафикиРаботыПоВидамВремени.ВидВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаДни)
	|   И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение > 0
	|	И ГрафикиРаботыПоВидамВремени.План";
	
	Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикСотрудника);
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЭтоВыходной = Ложь;
	КонецЕсли;
	
	Возврат ЭтоВыходной;
КонецФункции

НастройкаПериода = Новый НастройкаПериода;
