Перем мМакет, ПараметрыНормыЧасов, ВыборкаВид, Начисления;

#Если Клиент Тогда

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокШтРасписания, ДокументРезультат)

	Пока ВыборкаСтрокШтРасписания.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокШтРасписания.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокШтРасписания.Сотрудник) Тогда
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСтрокШтРасписания);
			
//			ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавка = ?(ПараметрыНормыЧасов.Размер = 0, 0, ВыборкаСтрокШтРасписания.ТарифнаяСтавка / ПараметрыНормыЧасов.Размер);
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
		Иначе
			мОИтог = 0;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьВ = мМакет.ПолучитьОбласть("СтрокаПовышения");
			ОбластьИ = мМакет.ПолучитьОбласть("СтрокаПовышенияИ");
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаСтрокШтРасписания);
			
			мпок = РегистрыСведений.ПроцентыПрогрессивки.ПолучитьПоследнее(ДатаАктуальности,
					Новый Структура("ПодразделениеОрганизации, Должность", ВыборкаСтрокШтРасписания.ПодразделениеОрганизации, ВыборкаСтрокШтРасписания.Должность)).Размер;
			мСумма = ВыборкаСтрокШтРасписания.ТарифнаяСПовышениемПоИнструкции * мпок / 100;
			ОбластьДетальныхЗаписей.Параметры.Показатель = мпок;
			Если ВыборкаСтрокШтРасписания.ВидТС Тогда
				ОбластьДетальныхЗаписей.Параметры.СуммаП = мСумма;
				мОИтог = мОИтог + мСумма;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.СуммаП = ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
				мОИтог = мОИтог + ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
			КонецЕсли;
					
			Если НЕ ВыборкаСтрокШтРасписания.ВидТС Тогда
				мТС = ?(ПараметрыНормыЧасов.Размер = 0, 0, ВыборкаСтрокШтРасписания.ТарифнаяСтавка / ПараметрыНормыЧасов.Размер);
				ОбластьДетальныхЗаписей.Параметры.ТарифнаяСтавка = мТС;
				ОбластьДетальныхЗаписей.Параметры.Сумма = мТС*Часов;
				мОИтог = мОИтог + мТС*Часов;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.Сумма = ВыборкаСтрокШтРасписания.ТарифнаяСтавка;
				мОИтог = мОИтог + ВыборкаСтрокШтРасписания.ТарифнаяСтавка;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			ВыборкаВид.Сбросить();
			
			Пока ВыборкаВид.Следующий() Цикл
				мСтрока = Начисления.НайтиСтроки(Новый Структура("Сотрудник, ВидРасчета", ВыборкаСтрокШтРасписания.Сотрудник, ВыборкаВид.ВидРасчета));
				Если мСтрока.Количество() > 0 Тогда 
					Попытка
						Если ВыборкаВид.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки Тогда
							ОбластьВ.Параметры.Показатель = мСтрока[0].Показатель2;
							мСумма = мСтрока[0].ТС * мСтрока[0].Показатель1 / 100;
							Если ВыборкаСтрокШтРасписания.ВидТС Тогда
								ОбластьВ.Параметры.Сумма = мСумма;
								мОИтог = мОИтог + мСумма;
							Иначе
								ОбластьВ.Параметры.Сумма = ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
								мОИтог = мОИтог + ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
							КонецЕсли
						ИначеЕсли ВыборкаВид.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиБезКонтракта Тогда
							ОбластьВ.Параметры.Показатель = мСтрока[0].Показатель1;
							мСумма = мСтрока[0].ТСБезКонтракта * мСтрока[0].Показатель1 / 100;
							Если ВыборкаСтрокШтРасписания.ВидТС Тогда
								ОбластьВ.Параметры.Сумма = мСумма;
								мОИтог = мОИтог + мСумма;
							Иначе
								ОбластьВ.Параметры.Сумма = ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
								мОИтог = мОИтог + ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
							КонецЕсли;
						ИначеЕсли ВыборкаВид.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиПоИнструкции Тогда //О.Т. Аверсон 04.04.2016 № 981
							ОбластьВ.Параметры.Показатель = мСтрока[0].Показатель1;
							мСумма = мСтрока[0].ТарифнаяСПовышениемПоИнструкции * мСтрока[0].Показатель1 / 100;
							Если ВыборкаСтрокШтРасписания.ВидТС Тогда
								ОбластьВ.Параметры.Сумма = мСумма;
								мОИтог = мОИтог + мСумма;
							Иначе
								ОбластьВ.Параметры.Сумма = ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
								мОИтог = мОИтог + ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
							КонецЕсли;

						ИначеЕсли ВыборкаВид.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность Тогда
							ОбластьВ.Параметры.Показатель = мСтрока[0].Показатель1;
							мТС1Разряда = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
									Новый Структура("Организация,ВидПараметра,Категория",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ, Справочники.КатегорииРаботников.ПустаяСсылка())).Размер;
							мСумма = мТС1Разряда * Часов * мСтрока[0].Показатель1/100;
							ОбластьВ.Параметры.Сумма = мСумма;
							мОИтог = мОИтог + мСумма;
						ИначеЕсли ВыборкаВид.ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентомОтТС Тогда
							мПоказатель1=0;
							НайденнаяСтрока = ВыборкаСтрокШтРасписания.Сотрудник.Физлицо.Стажи.Найти(ВыборкаВид.ВидРасчета.ВидСтажа, "ВидСтажа");
							Если НЕ (НайденнаяСтрока = Неопределено) Тогда
					    		мВыслуга = (ДатаАктуальности - НайденнаяСтрока.ДатаОтсчета)/86400/365.33;
								мВСтаж = РегистрыСведений.ШкалаКоэффициентовСтажа.Выбрать(Новый Структура("КоэффициентСтажа", ВыборкаВид.ВидРасчета.КоэффициентСтажа));
								Пока мВСтаж.Следующий() Цикл
									//Островская Татьяна 24.07.2013 № 16643
									если Организация.ИНН = "100765738" Тогда 
										Месяцы = 12;
									иначе
										Месяцы = 1;
									КонецЕсли;
									Если (мВыслуга >= мВСтаж.СтажС*Месяцы) И (мВыслуга < мВСтаж.СтажПо*Месяцы) Тогда
										мПоказатель1 = мВСтаж.Величина;
									КонецЕсли;
									//Островская Татьяна 24.07.2013 № 16643
								КонецЦикла;
							КонецЕсли;
							ОбластьВ.Параметры.Показатель = мПоказатель1;
							мСумма = мСтрока[0].ТС * мПоказатель1 / 100;
							Если ВыборкаСтрокШтРасписания.ВидТС Тогда
								ОбластьВ.Параметры.Сумма = мСумма;
								мОИтог = мОИтог + мСумма;
							Иначе
								ОбластьВ.Параметры.Сумма = ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
								мОИтог = мОИтог + ?(ПараметрыНормыЧасов.Размер = 0, 0, мСумма / ПараметрыНормыЧасов.Размер)*Часов;
							КонецЕсли;
						Иначе
							ОбластьВ.Параметры.Показатель = 0;
							ОбластьВ.Параметры.Сумма = 0;
						КонецЕсли;
					Исключение
						ОбластьВ.Параметры.Показатель = 0;
						ОбластьВ.Параметры.Сумма = 0;
					КонецПопытки;
				Иначе
					ОбластьВ.Параметры.Показатель = 0;
					ОбластьВ.Параметры.Сумма = 0;
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьВ);
			КонецЦикла;
			ОбластьИ.Параметры.Сумма = мОИтог;
			ДокументРезультат.Присоединить(ОбластьИ);
			
		КонецЕсли;
		
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 
	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ КАК ЗанимаемыхСтавок,
		|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность КАК Должность,
		|	РаботникиОрганизации.РазрядЕТС,
		|	РаботникиОрганизации.КоэффициентЕТС,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции КАК ТарифнаяСтавка,
		|	РаботникиОрганизации.Должность.Код,
		|	ВЫБОР
		|		КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В (&ВидРасчета)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВидТС,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|				&Период,
		|				ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО
		|					И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ПО РаботникиОрганизации.Сотрудник = ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизации
		|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
		|ГДЕ
		|	(НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL )
		|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
		|	И ВЫБОР
		|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|		КОНЕЦ <> 0
		|	И (НЕ РаботникиОрганизации.Сотрудник В
		|				(ВЫБРАТЬ
		|					СостояниеРаботниковОрганизаций.Сотрудник
		|				ИЗ
		|					РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
		|				ГДЕ
		|					СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|					И СостояниеРаботниковОрганизаций.ПериодЗавершения >= &Период))
		|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
		|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизации.ПодразделениеОрганизации,
		|	РаботникиОрганизации.Должность,
		|	РаботникиОрганизации.Сотрудник,
		|	РаботникиОрганизации.РазрядЕТС,
		|	РаботникиОрганизации.КоэффициентЕТС,
		|	РаботникиОрганизации.Должность.Код,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции,
		|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В (&ВидРасчета)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизацииНаименование,
		|	Должность,
		|	Сотрудник
		|ИТОГИ
		|	СУММА(ЗанимаемыхСтавок),
		|	СУММА(ТарифнаяСтавка)
		|ПО
		|	ОБЩИЕ,
		|	ПодразделениеОрганизации ИЕРАРХИЯ";
 
	Запрос.УстановитьПараметр("Период",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);   
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	СписокВидовОклад = Новый СписокЗначений;
	СписокВидовОклад.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокВидовОклад.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	Запрос.УстановитьПараметр("ВидРасчета", СписокВидовОклад);
	
	Если Не Подразделение.Пустая() Тогда
    	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)")
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	ЗапросВид = Новый Запрос;
	ЗапросВид.УстановитьПараметр("Период",	ДатаАктуальности);
	ЗапросВид.УстановитьПараметр("Организация",		Организация);   
	ЗапросВид.УстановитьПараметр("СписокСотрудников",      СписокСотрудников);
	СпособРасчета = Новый СписокЗначений;
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиБезКонтракта);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиПоИнструкции);//О.Т. Аверсон 04.04.2016 № 981
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентомОтТС);
	ЗапросВид.УстановитьПараметр("СпособРасчета",      СпособРасчета);
	
	ЗапросВид.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО
		|				И Организация = &Организация
		|				И Сотрудник В (&СписокСотрудников)
		|				И ВидРасчета.СпособРасчета В (&СпособРасчета)
		|				И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|ГДЕ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие <> ЗНАЧЕНИЕ(перечисление.ВидыДействияСНачислением.Прекратить)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета";
	ВыборкаВид = ЗапросВид.Выполнить().Выбрать();
	
//начисления	
	ЗапросНач = Новый Запрос;
	ЗапросНач.УстановитьПараметр("Период",	ДатаАктуальности);
	ЗапросНач.УстановитьПараметр("Организация",		Организация);   
	ЗапросНач.УстановитьПараметр("СписокСотрудников",      СписокСотрудников);
	СпособРасчета = Новый СписокЗначений;
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавки);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиБезКонтракта);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПроцентОтТарифнойСтавкиПоИнструкции);//О.Т. Аверсон 04.04.2016 № 981
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаВредность);
	СпособРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентомОтТС);
	ЗапросНач.УстановитьПараметр("СпособРасчета",      СпособРасчета);
	
	ЗапросНач.Текст = 
		"ВЫБРАТЬ
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка КАК ТСБезКонтракта,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка КАК ТС,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель1) КАК Показатель1,
		|	СУММА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Показатель2) КАК Показатель2,
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&Период,
		|			ВидРасчетаИзмерение <> НЕОПРЕДЕЛЕНО
		|				И Организация = &Организация
		|				И Сотрудник В (&СписокСотрудников)
		|				И ВидРасчета.СпособРасчета В (&СпособРасчета)
		|				И (НЕ Временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизацииСрезПоследних
		|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Сотрудник
		|			И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Организация
		|			И (ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <= &Период
		|						И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения
		|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Действие
		|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.Ставка,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСПовышениемПоИнструкции,
		|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник,
		|	ТарифныеСтавкиРаботниковОрганизацииСрезПоследних.ТарифнаяСтавка";
		
	Начисления = ЗапросНач.Выполнить().Выгрузить();

	
	ПараметрыНормыЧасов = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
			Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
	ДокументРезультат.Очистить();
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Область = мМакет.ПолучитьОбласть("Заголовок");
//	Область.Параметры.Организация = Организация;
	Область.Параметры.Размер = ПараметрыНормыЧасов.Размер;
	ДокументРезультат.Вывести(Область);
	Область = мМакет.ПолучитьОбласть("Шапка");
	ОбластьВ = мМакет.ПолучитьОбласть("ШПовышения");
	ОбластьИ = мМакет.ПолучитьОбласть("ШПовышенияИ");
	
	ДокументРезультат.Вывести(Область);
	
	Пока ВыборкаВид.Следующий() Цикл
		ОбластьВ.Параметры.Повышение = ВыборкаВид.ВидРасчета;
		ДокументРезультат.Присоединить(ОбластьВ);
	КонецЦикла;
	ДокументРезультат.Присоединить(ОбластьИ);
	
	ВыборкаИтог = РезультатЗапроса.Выбрать();
	
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("Макет");

#КонецЕсли

