
Процедура ОбработкаПроведения(Отказ, Режим)
	 
	// регистр ВзаиморасчетыСРаботникамиОрганизаций Приход
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записывать = Истина;
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Физлицо = ТекСтрокаНачисления.Физлицо;
		Движение.Организация = Организация;
		Движение.ПериодВзаиморасчетов = ПериодРегистрации;
		Движение.СуммаВзаиморасчетов = ТекСтрокаНачисления.Сумма;
	КонецЦикла;

	Если ЗначениеЗаполнено(ВидРасчета) Тогда 
		// регистр НДФЛСведенияОДоходах 
		Движения.НДФЛСведенияОДоходах.Записывать = Истина;
		Движения.НДФЛСведенияОДоходах.Очистить();
		Для Каждого ТекСтрокаНачисления Из Начисления Цикл
			Движение = Движения.НДФЛСведенияОДоходах.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = ТекСтрокаНачисления.Физлицо;
			Движение.КодДохода = ВидРасчета.КодДоходаНДФЛ;
			Движение.КодВычета = ВидРасчета.КодДоходаНДФЛ.КодВычета;
			Движение.ПериодРегистрации = ПериодРегистрации;
			Движение.СуммаДохода = ТекСтрокаНачисления.Сумма;
			Движение.СуммаВычета = ТекСтрокаНачисления.СуммаВычета;
			Движение.ОбособленноеПодразделение = Организация;
			СведенияПоСотруднику = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ТекСтрокаНачисления.Сотрудник));
			Движение.ПодразделениеОрганизации = СведенияПоСотруднику.ПодразделениеОрганизации;
		КонецЦикла;
		Если ТипЗнч(ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда 
			// регистр ОсновныеНачисленияРаботниковОрганизаций
			Движения.ОсновныеНачисленияРаботниковОрганизаций.Записывать = Истина;
			Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
			Для Каждого ТекСтрокаНачисления Из Начисления Цикл
				Движение = Движения.ОсновныеНачисленияРаботниковОрганизаций.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = ВидРасчета;
				Движение.ПериодДействияНачало = ПериодРегистрации;
				Движение.ПериодДействияКонец = ПериодРегистрации;
				Движение.ПериодРегистрации = ПериодРегистрации;
				Движение.БазовыйПериодНачало = ПериодРегистрации;
				Движение.БазовыйПериодКонец = ПериодРегистрации;
				Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
				Движение.ФизЛицо = ТекСтрокаНачисления.Физлицо;
				Движение.Организация = Организация;
				Движение.Результат = ТекСтрокаНачисления.Сумма;
				Движение.ОтработаноДней = ТекСтрокаНачисления.ДнейКДоплате;
				Движение.НормаДнейПоПятидневке = ТекСтрокаНачисления.ДнейКДоплатеРаб;
				Движение.ОплаченоДней = ТекСтрокаНачисления.ДнейКДоплате;
				Движение.ГрафикРаботы = ТекСтрокаНачисления.Сотрудник;
				Движение.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
				СведенияПоСотруднику = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ТекСтрокаНачисления.Сотрудник));
				Движение.ПодразделениеОрганизации = СведенияПоСотруднику.ПодразделениеОрганизации;
				Движение.ОбособленноеПодразделение = Организация;
				Движение.Авторасчет = Истина;
				Движение.Категория = СведенияПоСотруднику.Должность.Категория;
				Движение.Должность = СведенияПоСотруднику.Должность;
			КонецЦикла;
		иначе
			
			// регистр ДополнительныеНачисленияРаботниковОрганизаций
			Движения.ДополнительныеНачисленияРаботниковОрганизаций.Записывать = Истина;
			Движения.ДополнительныеНачисленияРаботниковОрганизаций.Очистить();
			Для Каждого ТекСтрокаНачисления Из Начисления Цикл
				Движение = Движения.ДополнительныеНачисленияРаботниковОрганизаций.Добавить();
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = ВидРасчета;
				Движение.ПериодРегистрации = ПериодРегистрации;
				Движение.БазовыйПериодНачало = ПериодРегистрации;
				Движение.БазовыйПериодКонец = ПериодРегистрации;
				Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
				Движение.ФизЛицо = ТекСтрокаНачисления.Физлицо;
				Движение.Организация = Организация;
				Движение.Результат = ТекСтрокаНачисления.Сумма;
				Движение.ОплаченоДнейЧасов = ТекСтрокаНачисления.ДнейКДоплате;
				СведенияПоСотруднику = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ТекСтрокаНачисления.Сотрудник));
				Движение.ПодразделениеОрганизации = СведенияПоСотруднику.ПодразделениеОрганизации;
				Движение.ГрафикРаботы = ТекСтрокаНачисления.Сотрудник;
				Движение.ОбособленноеПодразделение = Организация;
				Движение.Авторасчет = Истина;
				Движение.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням;
				Движение.Категория = СведенияПоСотруднику.Должность.Категория;
				Движение.Должность = СведенияПоСотруднику.Должность;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
