
#Если Клиент Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
	Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
		ДокументРезультат.Очистить();
		
		//Параметры документа
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ДокументРезультат.ПолеСлева			 = 0;
		ДокументРезультат.ПолеСправа		 = 0;
		ДокументРезультат.Защита             = Ложь;
		ДокументРезультат.ТолькоПросмотр     = Истина;
		ДокументРезультат.АвтоМасштаб		 = Истина;
		
		Если  ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОПериодеРаботы Тогда
			СформироватьСправкаОПериодеРаботы(ДокументРезультат);
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОМестеРаботы Тогда
			СформироватьСправкаОМестеРаботы(ДокументРезультат);	
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОНахожденииВОтпускеПоУходу Тогда
			СформироватьСправкаОНахожденииВОтпускеПоУходу(ДокументРезультат);	
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОРазмереЗаработнойПлаты Тогда
			СформироватьСправкаОРазмереЗаработнойПлаты(ДокументРезультат);
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОРазмереПособияИПериодеВыплаты Тогда
			СформироватьСправкаОРазмереПособияИПериодеВыплаты(ДокументРезультат);
			//Аверсон 22.06.2021 СВФР-007692
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОПериодеПособияПоБеремнностиИРодам Тогда
			СформироватьСправкаОПериодеПособияПоБеремнностиИРодам(ДокументРезультат);
			//Аверсон 26.07.2021 СВФР-007768
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОВыходеДоИстеченияСрокаПоУходуИПрекращенияВыплатыПособия Тогда
			СформироватьСправкаОВыходеДоИстеченияСрокаПоУходуИПрекращенияВыплатыПособия(ДокументРезультат);
			
			//Аверсон ЕАЕ 26.08.2021 СВФР-007765
		ИначеЕсли ФормаСправки = Перечисления.ФормыТиповыхСправок.СправкаОбАлиментах Тогда
			СформироватьСправкаОбАлиментах(ДокументРезультат);
			//Аверсон СВФР-007765
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура СформироватьСправкаОРазмереПособияИПериодеВыплаты(ДокументРезультат)
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(АдресПроживания.Представление, АдресПрописки.Представление) КАК Адрес,
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период, ФизЛицо = &Сотрудник) КАК ФИОФизЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПрописки
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = АдресПрописки.Объект
		|			И (АдресПрописки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПроживания
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = АдресПроживания.Объект
		|			И (АдресПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))";
		
		
		ВыборкаАдрес = Запрос.Выполнить().Выбрать();	
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
		Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
		
		
		СписокПособий = Новый Массив();
		
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности);
		
		Запрос.УстановитьПараметр("СписокПособий",СписокПособий);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ПособияИзФСЗН.Результат) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ПособияИзФСЗН.ПериодДействияКонец < НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|	КОНЕЦ КАК Месяц,
		|	ПособияИзФСЗН.ВидРасчета КАК ВидРасчета
		|ИЗ                                         
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ПособияИзФСЗН
		|ГДЕ
		|	ПособияИзФСЗН.ФизЛицо = &Сотрудник
		|	И ПособияИзФСЗН.ВидРасчета.Наименование ПОДОБНО ""%Пособие%""
		|	И НЕ ПособияИзФСЗН.ВидРасчета.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ПособияИзФСЗН.ПериодДействияКонец < НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|				ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ, -1), МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|		КОНЕЦ МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И ПособияИзФСЗН.Результат <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ПособияИзФСЗН.ПериодДействияКонец < НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПособияИзФСЗН.ПериодРегистрации, МЕСЯЦ)
		|	КОНЕЦ,
		|	ПособияИзФСЗН.ВидРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидРасчета,
		|	Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДФЛСведенияОДоходах.Результат КАК СуммаДохода,
		|	НДФЛСведенияОДоходах.ВидРасчета КАК ВидПособияДополнительныеНачисления
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК НДФЛСведенияОДоходах
		|ГДЕ
		|	НДФЛСведенияОДоходах.Результат <> 0
		|	И ВЫБОР
		|			КОГДА НДФЛСведенияОДоходах.БазовыйПериодНачало <> ДАТАВРЕМЯ(1, 1, 1)
		|					И НДФЛСведенияОДоходах.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НДФЛСведенияОДоходах.БазовыйПериодНачало >= &ПериодНачало
		|						И НДФЛСведенияОДоходах.БазовыйПериодКонец <= &ПериодКонец
		|			ИНАЧЕ НДФЛСведенияОДоходах.ПериодРегистрации МЕЖДУ &ПериодНачало И &ПериодКонец
		|		КОНЕЦ
		|	И НДФЛСведенияОДоходах.ВидРасчета В(&СписокПособий)
		|	И НДФЛСведенияОДоходах.ФизЛицо = &Сотрудник";
		
		Результат = Запрос.ВыполнитьПакет();
		
		Макет = ПолучитьМакет("СправкаОРазмереПособияИПериодеВыплаты");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОРазмереПособияИПериодеВыплаты";//О.Т. Аверсон 01.06.2017 № 680
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьАдресат = Макет.ПолучитьОбласть("Адресат");
		ОбластьАдресат2 = Макет.ПолучитьОбласть("Адресат2"); //Аверсон 01.02.2023 КВВ СВФР-010241
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		СчетчикПособий = 0; //Аверсон 11.10.2019 КВВ СВФР-004911 
		ИтогоГод1 =0;
		ИтогоГод2 =0;	
		Выборка = Результат[0].Выбрать();
		ВидРасчетаПрошл = "";
		СуммаИтог = 0;
		Пока Выборка.Следующий() Цикл
			Если не ВидРасчетаПрошл = Выборка.ВидРасчета Тогда 
				Если ВидРасчетаПрошл <> "" Тогда
					
					ОбластьАдресат.Параметры.итог1 = ИтогоГод1;
					ОбластьАдресат.Параметры.итог2 = ИтогоГод2;
					ОбластьАдресат.Параметры.Год1 = Формат(ПериодНачало,"ДФ=гггг");
					ОбластьАдресат.Параметры.Год2 = Формат(ПериодКонец,"ДФ=гггг");
					ОбластьАдресат.Параметры.СуммаИтог = ИтогоГод1+ИтогоГод2;
					
					Если ОбластьАдресат.Параметры.Год1 = ОбластьАдресат.Параметры.Год2 Тогда
						ОбластьАдресат.Параметры.Год2 ="";	
					КонецЕсли;
					
					//Аверсон 11.10.2019 КВВ СВФР-004911 (
					СчетчикПособий = СчетчикПособий + 1;
					Если СчетчикПособий > 1 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					//Аверсон 11.10.2019 КВВ СВФР-004911 )
					
					ДокументРезультат.Вывести(ОбластьШапка);
					ДокументРезультат.Вывести(ОбластьАдресат);
					
					//Аверсон 01.02.2023 КВВ СВФР-010241 (
					ДокументРезультат.Вывести(ОбластьАдресат2);
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					//Аверсон 01.02.2023 КВВ СВФР-010241 )
					
					ДокументРезультат.Вывести(ОбластьПодвал);
					
					ОбластьАдресат.Параметры.Доход1 = "";
					ОбластьАдресат.Параметры.Доход2 = "";  				
					ОбластьАдресат.Параметры.Доход3 = "";
					ОбластьАдресат.Параметры.Доход4 = "";
					ОбластьАдресат.Параметры.Доход5 = "";
					ОбластьАдресат.Параметры.Доход6 = "";
					ОбластьАдресат.Параметры.Доход7 = "";
					ОбластьАдресат.Параметры.Доход8 = "";
					ОбластьАдресат.Параметры.Доход9 = "";
					ОбластьАдресат.Параметры.Доход10 = "";
					ОбластьАдресат.Параметры.Доход11 = "";
					ОбластьАдресат.Параметры.Доход12 = "";
					ОбластьАдресат.Параметры.Доход13 = "";
					ОбластьАдресат.Параметры.Доход14 = "";
					ОбластьАдресат.Параметры.Доход15 = "";
					ОбластьАдресат.Параметры.Доход16 = "";
					ОбластьАдресат.Параметры.Доход17 = "";
					ОбластьАдресат.Параметры.Доход18 = "";
					ОбластьАдресат.Параметры.Доход19 = "";
					ОбластьАдресат.Параметры.Доход20 = "";
					ОбластьАдресат.Параметры.Доход21 = "";
					ОбластьАдресат.Параметры.Доход22 = "";
					ОбластьАдресат.Параметры.Доход23 = "";
					ОбластьАдресат.Параметры.Доход24 = "";
					
				КонецЕсли;
				ИтогоГод1 =0;
				ИтогоГод2 =0;
				
				ОбластьАдресат.Параметры.МестоВыдачи = МестоВыдачи;
				ОбластьАдресат.Параметры.Дата = Формат(Период,"ДФ=dd.MM.yyyy");
				ОбластьАдресат.Параметры.Номер = Номер;
				ОбластьАдресат.Параметры.ПериодНачало = Формат(ПериодНачало,"ДФ='dd ММММ yyyy'") +" г.";
				ОбластьАдресат.Параметры.ПериодКонец = Формат(ПериодКонец,"ДФ='dd ММММ yyyy'") +" г.[2]";
				
				Если ВыборкаАдрес.Следующий() Тогда
					ОбластьАдресат.Параметры.Адресат = ВыборкаАдрес.ФИО;
					ОбластьАдресат.Параметры.Адрес = ВыборкаАдрес.Адрес; 	
				КонецЕсли;
				//Аверсон 11.10.2019 КВВ СВФР-004911 (
				ОбластьПодвал.Параметры.НаименованиеПособия = Выборка.ВидРасчета.Наименование; 
				ДП = ""; МП = ""; ГП = "";
				ЗапросОкончПособия = Новый Запрос;
				ЗапросОкончПособия.Текст = 
				"ВЫБРАТЬ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета,
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, ) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|ГДЕ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник = &Сотрудник
				|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = &ВидРасчета
				|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)";
				ЗапросОкончПособия.УстановитьПараметр("Сотрудник", Сотрудник);
				ЗапросОкончПособия.УстановитьПараметр("Период", периодконец);
				ЗапросОкончПособия.УстановитьПараметр("ВидРасчета",	Выборка.ВидРасчета);
				РезОкончПособия = ЗапросОкончПособия.Выполнить().Выбрать();
				Если РезОкончПособия.Следующий() Тогда
					ДатаОкончПособия = РезОкончПособия.ПериодЗавершения-1;
					Если ЗначениеЗаполнено(ДатаОкончПособия) Тогда
						Если (НачалоДня(ДатаОкончПособия)>=НачалоДня(ПериодНачало)) И (НачалоДня(ДатаОкончПособия)<=НачалоДня(ПериодКонец)) Тогда
							ДП = Лев(ДатаОкончПособия,2);//Формат(ДатаОкончПособия, "ДФ=ММ");
							МП = нрег(Формат(ДатаОкончПособия, "ДФ=ММММ"));
							МП = ?(Прав(МП,1)="т",МП+"а",СтрЗаменить(МП,"ь","я"));
							ГП = Формат(ДатаОкончПособия, "ДФ=гггг");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;

				
				ОбластьПодвал.Параметры.ДП = ДП;
				ОбластьПодвал.Параметры.МП = МП;
				ОбластьПодвал.Параметры.ГП = ГП;
				//Аверсон 11.10.2019 КВВ СВФР-004911 )
				
				ОбластьПодвал.Параметры.ДатаВыдачи = Формат(Период,"ДФ='dd ММММ yyyy'") +" г.";
				//О.Т. Аверсон 04.01.2017 № 130
				Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
					Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
						ГлавБух = стрОтветств.Сотрудник;
						ДолжностьГлавБух = стрОтветств.Должность;
					КонецЕсли;
					Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
						Руководит = стрОтветств.Сотрудник;
						ДолжностьРуководит = стрОтветств.Должность;
					КонецЕсли;
				КонецЦикла;
				ОбластьПодвал.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
				ОбластьПодвал.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
				ОбластьПодвал.Параметры.ФИОГлБухгалтера = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ГлавБух);
				ОбластьПодвал.Параметры.ДолжностьБухгалтера = ДолжностьГлавБух;
				
				//О.Т. Аверсон 04.01.2017 № 130
				
				Год1 = Год(ПериодНачало);
				Год2 = Год(ПериодКонец);
				
				ВыборкаНДФЛСведенияОДоходах = Результат[1].Выбрать();
				
				Пока ВыборкаНДФЛСведенияОДоходах.Следующий() Цикл 
					
					Если ВыборкаНДФЛСведенияОДоходах.ВидПособияДополнительныеНачисления = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности Тогда
						ОбластьАдресат.Параметры.ПособиеДо12Недель = ВыборкаНДФЛСведенияОДоходах.СуммаДохода;	
					ИначеЕсли ВыборкаНДФЛСведенияОДоходах.ВидПособияДополнительныеНачисления = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка 
						ИЛИ ВыборкаНДФЛСведенияОДоходах.ВидПособияДополнительныеНачисления = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей 
						ИЛИ ВыборкаНДФЛСведенияОДоходах.ВидПособияДополнительныеНачисления = ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка Тогда
						ОбластьАдресат.Параметры.ПособиеПриРождении = ВыборкаНДФЛСведенияОДоходах.СуммаДохода;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			
			Если Год1 = Год(Выборка.Месяц) Тогда
				ОбластьАдресат.Параметры["Доход"+Месяц(Выборка.Месяц)] = Выборка.Сумма;
				ИтогоГод1 = ИтогоГод1 +  Выборка.Сумма;
			Иначе
				ОбластьАдресат.Параметры["Доход"+(Месяц(Выборка.Месяц)+12)] = Выборка.Сумма;
				ИтогоГод2 = ИтогоГод2 +  Выборка.Сумма;
			КонецЕсли;
			ВидРасчетаПрошл = Выборка.ВидРасчета;
		КонецЦикла;
		
		ОбластьАдресат.Параметры.итог1 = ИтогоГод1;
		ОбластьАдресат.Параметры.итог2 = ИтогоГод2;
		ОбластьАдресат.Параметры.Год1 = Формат(ПериодНачало,"ДФ=гггг");
		ОбластьАдресат.Параметры.Год2 = Формат(ПериодКонец,"ДФ=гггг");
		ОбластьАдресат.Параметры.СуммаИтог = ИтогоГод1+ИтогоГод2;
		
		Если ОбластьАдресат.Параметры.Год1 = ОбластьАдресат.Параметры.Год2 Тогда
			ОбластьАдресат.Параметры.Год2 ="";	
		КонецЕсли;  
		
		//Аверсон 11.10.2019 КВВ СВФР-004911 (
		СчетчикПособий = СчетчикПособий + 1;
		Если СчетчикПособий > 1 Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если СчетчикПособий > 1 Тогда
			Сообщить("На форму выведено " + Строка(СчетчикПособий) + " " + ?(СчетчикПособий<5,"справки","справок") + " в одном окне");
		КонецЕсли;
		//Аверсон 11.10.2019 КВВ СВФР-004911 )
		
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьАдресат);
		
		//Аверсон 01.02.2023 КВВ СВФР-010241 (
		ДокументРезультат.Вывести(ОбластьАдресат2);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		//Аверсон 01.02.2023 КВВ СВФР-010241 )
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
	КонецПроцедуры
	
	Процедура СформироватьСправкаОПериодеРаботы(ДокументРезультат) 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
		Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийПрием.Период КАК ДатаПриема,
		|	РаботникиОрганизацийПрием.Должность,
		|	ДОБАВИТЬКДАТЕ(РаботникиОрганизацийУвольнение.Период, ДЕНЬ, -1) КАК ДатаУвольнения,
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
		|	ПОДСТРОКА(ФИОРуководителя.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОРуководителя.Отчество, 1, 1) + ФИОРуководителя.Фамилия КАК ФИОРуководителя,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	РаботникиОрганизацийПрием.Регистратор.Дата КАК ДатаПриемаДокумента,
		|	РаботникиОрганизацийПрием.Регистратор.Номер КАК НомерПриказаПриемаОсн,";
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	РаботникиОрганизацийПрием.Регистратор.ДатаПриказа КАК ДатаПриемаДокументаПр,
			|	РаботникиОрганизацийПрием.Регистратор.НомерД КАК НомерПриказаПриемаОснПр,
			|	РаботникиОрганизацийУвольнение.Регистратор.Дата КАК ДатаУвольненияДокументаПр,
			|	РаботникиОрганизацийУвольнение.Регистратор.НомерД КАК НомерПриказаУвольненияОснПр,";
		КонецЕсли;
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		Запрос.Текст = Запрос.Текст + "
		|	РаботникиОрганизацийУвольнение.Регистратор.Дата КАК ДатаУвольненияДокумента,
		|	РаботникиОрганизацийУвольнение.Регистратор.Номер КАК НомерПриказаУвольненияОсн,
		|	РаботникиОрганизацийПрием.Организация.НаименованиеПолное КАК Организация,
		|	РаботникиОрганизацийПрием.ПодразделениеОрганизации.Наименование КАК Подразделение
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&ДатаАктуальности,
		|			Сотрудник = &Сотрудник
		|				И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РаботникиОрганизацийПрием
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО РаботникиОрганизацийПрием.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				Сотрудник = &Сотрудник
		|					И ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийУвольнение
		|		ПО РаботникиОрганизацийПрием.Сотрудник = РаботникиОрганизацийУвольнение.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОРуководителя
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОРуководителя.ФизЛицо
		|		ПО (ИСТИНА)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Макет = ПолучитьМакет("СправкаОПериодеРаботы");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОПериодеРаботы"; //О.Т. Аверсон 01.06.2017 № 680
		
		Область = Макет.ПолучитьОбласть("Справка");
		
		Если Выборка.Следующий() Тогда
			Область.Параметры.ОргПодр = СокрЛП(Выборка.Организация) + ", " + СокрЛП(Выборка.Подразделение); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.Заполнить(Выборка);
			//Должнность = Выборка.Должность;
			//УниверсальныеМеханизмы.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Должнность, 2,Перечисления.ПолФизическихЛиц.Мужской , Должнность);
			//Область.Параметры.Должность = Должнность;
			Область.Параметры.Период = Период;
			Область.Параметры.Номер = Номер;
			Область.Параметры.МестоВыдачи = МестоВыдачи;
			Область.Параметры.Адресат = Адресат.НаименованиеПолное;
			
			Область.Параметры.НомерПриказаПриема = СокрЛП(?(Организация.ИНН = "700103211",Выборка.НомерПриказаПриемаОснПр,Выборка.НомерПриказаПриемаОсн)); //СВЭЙ 24.05.2024 КВВ СВФР-012926
			
			ДатаПриемаСотр = ?(Организация.ИНН = "700103211",Выборка.ДатаПриемаДокументаПр,Выборка.ДатаПриемаДокумента); //СВЭЙ 24.05.2024 КВВ СВФР-012926 
			
			Область.Параметры.ДеньПриема = День(ДатаПриемаСотр);
			МесяцПриема = Формат(ДатаПриемаСотр,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцПриема, 4, МесяцПриема);
			Область.Параметры.МесяцПриема = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаПриемаСотр),МесяцПриема); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодПриема =  Формат(ДатаПриемаСотр,"ДФ=гггг");
			Если ЗначениеЗаполнено(Выборка.ДатаУвольненияДокумента) тогда
				ДатаУвСотр = ?(Организация.ИНН = "700103211",Выборка.ДатаУвольненияДокументаПр,Выборка.ДатаУвольненияДокумента); //СВЭЙ 24.05.2024 КВВ СВФР-012926 
				
				Область.Параметры.ДеньУвольнения = День(ДатаУвСотр);
				МесяцУвольнения  = Формат(ДатаУвСотр,"ДФ=MMММ");
				ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцУвольнения, 4, МесяцУвольнения);
				Область.Параметры.МесяцУвольнения = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаУвСотр),МесяцУвольнения); //СВЭЙ 12.06.2024 КВВ СВФР-012926
				Область.Параметры.ГодУвольнения =  Формат(ДатаУвСотр,"ДФ=гггг");
				
				Область.Параметры.НомерПриказаУвольнения = СокрЛП(?(Организация.ИНН = "700103211",Выборка.НомерПриказаУвольненияОснПр,Выборка.НомерПриказаУвольненияОсн)); //СВЭЙ 24.05.2024 КВВ СВФР-012926
			КонецЕсли;
			Область.Параметры.ДеньВыдачи = День(Период);
			Месяц  = Формат(Период,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Месяц, 4,Месяц);
			Область.Параметры.МесяцВыдачи = ?(Организация.ИНН = "700103211",Месяц_Я(Период),Месяц); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодВыдачи =  Формат(Период,"ДФ=гггг");
			//О.Т. Аверсон 04.01.2017 № 130
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			Область.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
			//О.Т. Аверсон 04.01.2017 № 130
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
	КонецПроцедуры
	
	Процедура СформироватьСправкаОМестеРаботы(ДокументРезультат) 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
		Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Должность,
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
		|	ПОДСТРОКА(ФИОРуководителя.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОРуководителя.Отчество, 1, 1) + ""."" + ФИОРуководителя.Фамилия КАК ФИОРуководителя,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	РаботникиОрганизаций.Организация.НаименованиеПолное КАК Организация
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО РаботникиОрганизаций.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОРуководителя
		|			ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОРуководителя.ФизЛицо
		|		ПО (ИСТИНА)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Макет = ПолучитьМакет("СправкаОМестеРаботы");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОМестеРаботы"; //О.Т. Аверсон 01.06.2017 № 680
		
		Область = Макет.ПолучитьОбласть("Справка");
		
		Если Выборка.Следующий() Тогда
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.Номер = Номер;
			Область.Параметры.Период = Период;
			Область.Параметры.МестоВыдачи = МестоВыдачи;
			Область.Параметры.Адресат = Адресат.НаименованиеПолное;
			Область.Параметры.ДеньВыдачи = День(Период);
			Месяц  = Формат(Период,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Месяц, 4, Месяц);
			Область.Параметры.МесяцВыдачи = ?(Организация.ИНН = "700103211",Месяц_Я(Период),Месяц); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодВыдачи =  Формат(Период,"ДФ=гггг");
			
			//О.Т. Аверсон 04.01.2017 № 130
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			Область.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
			
			//О.Т. Аверсон 04.01.2017 № 130
			
			
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
	КонецПроцедуры
	
	Процедура СформироватьСправкаОНахожденииВОтпускеПоУходу(ДокументРезультат) 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
		Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
		//|	ПОДСТРОКА(ФИОРуководителя.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОРуководителя.Отчество, 1, 1) + ФИОРуководителя.Фамилия КАК ФИОРуковолителя,
		//|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК ДолжностьРуководителя,
		|	СостояниеРаботниковОрганизацийСрезПоследних.Период,
		|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор.Номер КАК НомерПриказа,
		|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор.Дата КАК ДатаПриказа,";
		
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 (
		Если Организация.ИНН = "700103211" Тогда
			Запрос.Текст = Запрос.Текст + "
			|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор.НомерПриказаОбОкончанииОтпускаПл КАК НомерПриказаПр,
			|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор.ДатаПриказаОбОкончанииОтпускаПл КАК ДатаПриказаПр,";
		КонецЕсли;
		//СВЭЙ 24.05.2024 КВВ СВФР-012926 )
		
		Запрос.Текст = Запрос.Текст + "
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	РаботникиОрганизацийСрезПоследних.Организация.НаименованиеПолное КАК Организация
		|ИЗ
		//|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		//|			&ДатаАктуальности,
		//|			СтруктурнаяЕдиница = &Организация
		//|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОРуководителя
		//|		ПО ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОРуководителя.ФизЛицо,
		|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(
		|			&ДатаАктуальности,
		|			Сотрудник = &Сотрудник
		|				И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)) КАК СостояниеРаботниковОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				Сотрудник = &Сотрудник
		|					И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
		|		ПО СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Макет = ПолучитьМакет("СправкаОНахожденииВОтпускеПоУходу");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОНахожденииВОтпускеПоУходу";//О.Т. Аверсон 01.06.2017 № 680
		
		Область = Макет.ПолучитьОбласть("Справка");
		
		Если Выборка.Следующий() Тогда
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.Номер = Номер;
			Область.Параметры.Период = Период;
			Область.Параметры.МестоВыдачи = МестоВыдачи;
			Область.Параметры.Адресат = Адресат.НаименованиеПолное;
			Область.Параметры.ДеньВыдачи = День(Период);
			Месяц  = Формат(Период,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Месяц, 4, Месяц);
			Область.Параметры.МесяцВыдачи = ?(Организация.ИНН = "700103211",Месяц_Я(Период),Месяц); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодВыдачи =  Формат(Период,"ДФ=гггг");
			
			ДатаПриказаСотр = ?(Организация.ИНН = "700103211",Выборка.ДатаПриказаПр,Выборка.ДатаПриказа); //СВЭЙ 24.05.2024 КВВ СВФР-012926 
			
			Область.Параметры.ДеньПриказа = День(ДатаПриказаСотр);
			МесяцПриказа  = Формат(ДатаПриказаСотр,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцПриказа, 4, МесяцПриказа);
			Область.Параметры.МесяцПриказа = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаПриказаСотр),МесяцПриказа); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодПриказа =  Формат(ДатаПриказаСотр,"ДФ=гггг");
			Область.Параметры.НомерПриказа = ?(Организация.ИНН = "700103211",Выборка.НомерПриказаПр,Выборка.НомерПриказа);  //СВЭЙ 24.05.2024 КВВ СВФР-012926
			
			Область.Параметры.ДеньОтпуска = День(Выборка.Период);
			МесяцОтпуска  = Формат(Выборка.Период,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцОтпуска, 4, МесяцОтпуска);
			Область.Параметры.МесяцОтпуска = ?(Организация.ИНН = "700103211",Месяц_Я(Выборка.Период),МесяцОтпуска); //СВЭЙ 12.06.2024 КВВ СВФР-012926
			Область.Параметры.ГодОтпуска =  Формат(Выборка.Период,"ДФ=гггг");
			
			//О.Т. Аверсон 04.01.2017 № 130
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			Область.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
			
			//О.Т. Аверсон 04.01.2017 № 130
			
			
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
	КонецПроцедуры
	
	Процедура СформироватьСправкаОРазмереЗаработнойПлаты(ДокументРезультат) 
		
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоГода",  		НачалоМесяца(ПериодНачало));
		Запрос.УстановитьПараметр("Физлицо",			Сотрудник.ФизЛицо);
		Запрос.УстановитьПараметр("Сотрудник",			Сотрудник);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		//вкл дохды в натур форме
		Запрос.УстановитьПараметр("ВключатьДоходыВНатуральнойФорме",ВключатьДоходыВНатуральнойФорме);
		//ПСА 26.05.2021 СВФР-007623+++
		СписокПособий = Новый Массив();
		
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииРебенка);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриРожденииВторогоИПоследующихДетей);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриУсыновленииРебенка);
		СписокПособий.Добавить(ПланыВидовРасчета.ДополнительныеНачисленияОрганизаций.ПриПостановкеНаУчетВРанниеСрокиБеременности);
		
		Запрос.УстановитьПараметр("СписокПособий",СписокПособий);
		//+++ПСА 26.05.2021 СВФР-007623
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ФизическиеЛица.Наименование) КАК ФИО,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1), ФизическиеЛица.Наименование) КАК ФИОСокр,
		|	РаботникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизацииСрезПоследних.Организация,
		|	РаботникиОрганизацииСрезПоследних.Должность,
		|	РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо.Пол КАК Пол
		|ПОМЕСТИТЬ ВТДанныеПОРаботнику
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				Сотрудник = &Сотрудник
		|					И Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
		|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
		|			КОНЕЦ = &Организация)
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Физлицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВТПериоды
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоГода И &ДатаАктуальности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия, МЕСЯЦ) КАК Месяц,
		|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачалоГода И &ДатаАктуальности
		|	И ВЫБОР
		|			КОГДА НЕ &ВключатьДоходыВНатуральнойФорме
		|				ТОГДА НЕ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//ПСА 26.05.2021 СВФР-007623+++
		|	И НЕ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.Наименование ПОДОБНО ""%Пособие%""
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия, МЕСЯЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ),
		|	СУММА(ДополнительныеНачисленияРаботниковОрганизаций.Результат)
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоГода И &ДатаАктуальности
		|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.ПереходящийОстаток)
		|	И ВЫБОР
		|			КОГДА НЕ &ВключатьДоходыВНатуральнойФорме
		|				ТОГДА НЕ ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.ЯвляетсяДоходомВНатуральнойФорме
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		//ПСА 26.05.2021 СВФР-007623+++
		|	И Не ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета В(&СписокПособий)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПОРаботнику.ФИО КАК ФИО,
		|	ДанныеПОРаботнику.ФИОСокр КАК ФИОСокр,
		|	ДанныеПОРаботнику.Должность КАК Должность,
		|	ПОДСТРОКА(ФИОРуководителя.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОРуководителя.Отчество, 1, 1) + ""."" + ФИОРуководителя.Фамилия КАК ФИОРуководителя,
		|	ПОДСТРОКА(ФИОГлБухгалтера.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОГлБухгалтера.Отчество, 1, 1) + ""."" + ФИОГлБухгалтера.Фамилия КАК ФИОГлБухгалтера,
		|	ДанныеПОРаботнику.Пол,
		|	ДанныеПОРаботнику.Организация.НаименованиеПолное КАК Организация
		|ИЗ
		|	ВТДанныеПОРаботнику КАК ДанныеПОРаботнику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОРуководителя
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОРуководителя.ФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)) КАК ОтветственныеЛицаОрганизацийСрезПоследних1
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОГлБухгалтера
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних1.ФизическоеЛицо = ФИОГлБухгалтера.ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Периоды.Месяц КАК Месяц,
		|	СУММА(ЕСТЬNULL(Начисления.Результат, 0)) КАК Результат
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК Начисления
		|		ПО Периоды.Месяц = Начисления.Месяц
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.Месяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц
		|ИТОГИ
		|	СУММА(Результат)
		|ПО
		|	ОБЩИЕ";
		
		Результат = Запрос.ВыполнитьПакет();
		
		ВыборкаДанныеРаботника = Результат[3].Выбрать();
		ВыборкаДанныеЗаработка = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Макет = ПолучитьМакет("СправкаОРазмереЗаработнойПлаты");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОРазмереЗаработнойПлаты";//О.Т. Аверсон 01.06.2017 № 680
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаСправки");
		ОбластьТаблица = Макет.ПолучитьОбласть("ТаблицаСправки");
		ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалСправки");
		
		Если ВыборкаДанныеРаботника.Следующий() Тогда
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДанныеРаботника);
			ГлавБух = "";
			ДолжностьГлавБух = "";
			Руководит = "";
			ДолжностьРуководит = "";
			
			
			ФИОСокр = ВыборкаДанныеРаботника.ФИОСокр;
			ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"), ФИОСокр, 2,ВыборкаДанныеРаботника.Пол , ФИОСокр);
			ОбластьШапка.Параметры.ФИОСокр = ФИОСокр; 
			ОбластьШапка.Параметры.Период = Период;
			ОбластьШапка.Параметры.Номер = Номер;
			ОбластьШапка.Параметры.МестоВыдачи = МестоВыдачи;
			ДокументРезультат.Вывести(ОбластьШапка);
			
			ПредыдущийГод = "";
			Пока ВыборкаДанныеЗаработка.Следующий() Цикл
				
				ОбластьПодвал.Параметры.СуммаЦифрамиПрописью = Формат(ВыборкаДанныеЗаработка.Результат,"ЧРГ=' '; ЧГ=3,0") + " " + РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДанныеЗаработка.Результат,Константы.ВалютаРегламентированногоУчета.Получить());
				ВыборкаЗаработокПоМесяцам = ВыборкаДанныеЗаработка.Выбрать();
				Пока ВыборкаЗаработокПоМесяцам.Следующий() Цикл
					Если ПредыдущийГод <> ГОД(ВыборкаЗаработокПоМесяцам.Месяц) И ПредыдущийГод <> "" Тогда
						ДокументРезультат.Вывести(ОбластьТаблица);	
						ОбластьТаблица.Параметры.Год	 =  Формат(ВыборкаЗаработокПоМесяцам.Месяц,"ДФ=гггг");
						Для Индекс = 1 по 12 Цикл
							ОбластьТаблица.Параметры["Доход"+Индекс] = "";
							ОбластьТаблица.Параметры["Дни"+Индекс] = "";//Аверсон 28.12.2021 КВВ СВФР-008541
						КонецЦикла
					КонецЕсли;
					
					НомерМесяца = Формат(ВыборкаЗаработокПоМесяцам.Месяц,"ДФ=M");
					ОбластьТаблица.Параметры["Доход"+НомерМесяца] = ВыборкаЗаработокПоМесяцам.Результат;
					ОбластьТаблица.Параметры["Дни"+НомерМесяца] = ПроведениеРасчетов.ПолучитьКалендарныеДниБезОтпускаБольничного(Сотрудник,ВыборкаЗаработокПоМесяцам.Месяц, Ложь,,,""); //Аверсон 28.12.2021 КВВ СВФР-008541
					ПредыдущийГод = ГОД(ВыборкаЗаработокПоМесяцам.Месяц);
					ОбластьТаблица.Параметры.Год	 =  Формат(ВыборкаЗаработокПоМесяцам.Месяц,"ДФ=гггг");
					
					
				КонецЦикла;
			КонецЦикла;
			ДокументРезультат.Вывести(ОбластьТаблица);	
			
			ОбластьПодвал.Параметры.Заполнить(ВыборкаДанныеРаботника);
			//ОбластьПодвал.Параметры.ДеньВыдачи = День(Период);
			Месяц  = Формат(Период,"ДФ=MMММ");
			ПроцедурыУправленияПерсоналом.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), Месяц, 4, Месяц);
			//ОбластьПодвал.Параметры.МесяцВыдачи = Месяц;
			//ОбластьПодвал.Параметры.ГодВыдачи =  Формат(Период,"ДФ=гггг");
			//О.Т. Аверсон 04.01.2017 № 130
			
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			ОбластьПодвал.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			ОбластьПодвал.Параметры.ФИОГлБухгалтера = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ГлавБух);
			
			//О.Т. Аверсон 04.01.2017 № 130
			ДокументРезультат.Вывести(ОбластьПодвал);	
			
		КонецЕсли;
		
	КонецПроцедуры
	
	//Аверсон 22.06.2021 СВФР-007692
	Процедура СформироватьСправкаОПериодеПособияПоБеремнностиИРодам(ДокументРезультат) 
		Запрос = Новый Запрос;        // 17518
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(АдресПроживания.Представление, АдресПроживания.Представление) КАК Адрес,
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период, ФизЛицо = &Сотрудник) КАК ФИОФизЛицСрезПоследних
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПроживания
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = АдресПроживания.Объект
		|			И (АдресПроживания.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))";

		ВыборкаАдрес = Запрос.Выполнить().Выбрать();
		//17518
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
		Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ПричинаНетрудоспособности", Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам);
		Запрос.УстановитьПараметр("ПустаяДата", ДАТА(1,1,1));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
		|	РаботникиОрганизацийСрезПоследних.Организация.НаименованиеПолное КАК Организация,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала, &ПустаяДата) = &ПустаяДата
		|			ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
		|		ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НачислениеПоБольничномуЛистуПродолжение.ДатаОкончания, &ПустаяДата) = &ПустаяДата
		|			ТОГДА НачислениеПоБольничномуЛисту.ДатаОкончания
		|		ИНАЧЕ НачислениеПоБольничномуЛистуПродолжение.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
		|		ПО НачислениеПоБольничномуЛисту.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО НачислениеПоБольничномуЛисту.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛистуПродолжение
		|		ПО НачислениеПоБольничномуЛисту.Ссылка = НачислениеПоБольничномуЛистуПродолжение.ПервичныйБольничныйЛист
		|			И (НачислениеПоБольничномуЛистуПродолжение.ПричинаНетрудоспособности = &ПричинаНетрудоспособности)
		|ГДЕ
		|	НачислениеПоБольничномуЛисту.Сотрудник = &Сотрудник
		|	И НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности = &ПричинаНетрудоспособности
		|	И (НачислениеПоБольничномуЛисту.ДатаНачала МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|			ИЛИ НачислениеПоБольничномуЛисту.ДатаОкончания МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|	И НачислениеПоБольничномуЛисту.Проведен
		|	И НачислениеПоБольничномуЛисту.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончания УБЫВ";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Макет = ПолучитьМакет("СправкаОПериодеПособияПоБеремнностиИРодам");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОПериодеПособияПоБеремнностиИРодам";	
		Область = Макет.ПолучитьОбласть("Справка");
		
		Если Выборка.Следующий() Тогда
			//17518
			Если ВыборкаАдрес.Следующий() Тогда     					
					Область.Параметры.Адрес = ВыборкаАдрес.Адрес; 	
			КонецЕсли;
			//17518
			Область.Параметры.Заполнить(Выборка);
			Область.Параметры.Номер = Номер;
			Область.Параметры.Период = Период;
			Область.Параметры.МестоВыдачи = МестоВыдачи;
			Область.Параметры.Адресат = Адресат.НаименованиеПолное;
			
			ДатаНачала = Выборка.ДатаНачала;
			ДатаОкончания = Выборка.ДатаОкончания;
			
			Область.Параметры.ДатаНачалоПериода = День(ДатаНачала);
			МесяцНачала  = Формат(ДатаНачала,"ДФ=MMММ");
			УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцНачала, 4, МесяцНачала);
			Область.Параметры.МесяцНачалоПериода = МесяцНачала;
			Область.Параметры.ГодНачалоПериода = Формат(ДатаНачала,"ДФ=гггг");
			Область.Параметры.ДатаКонецПериода = День(ДатаОкончания);
			МесяцОкончания  = Формат(ДатаОкончания,"ДФ=MMММ");
			УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцОкончания, 4, МесяцОкончания);
			Область.Параметры.МесяцКонецПериода = МесяцОкончания;
			Область.Параметры.ГодКонецПЕриода = Формат(ДатаОкончания,"ДФ=гггг");
			
			
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			Область.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			Область.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
			Область.Параметры.ФИОГлБухгалтера = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ГлавБух);
			Область.Параметры.ДолжностьБухгалтера = ДолжностьГлавБух;
			
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
	КонецПроцедуры
	
	
	//Аверсон 26.07.2021 СВФР-007768
	Процедура СформироватьСправкаОВыходеДоИстеченияСрокаПоУходуИПрекращенияВыплатыПособия(ДокументРезультат) 
		СпособыРасчета = Новый Массив;
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаВторогоИПоследующихДо3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРабМатериОдиночкеДо3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРаботающейМатериДо3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРабМатериНадб40До3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеМатериОдиночкеДо3Лет);
		СпособыРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40);
		
		//Пособие на второго и последующих до 3 лет,
		//Пособие на ребенка не работающей матери-одиночке до 3 лет, 
		//Пособие на ребенка не работающей матери до 3 лет, 
		//Пособие на ребенка не работающей матери надбавкой 40% до 3 лет, 
		//Пособие на ребенка до 3 лет, 
		//Пособие матери-одиночке до 3 лет,
		//Пособие на ребенка до 3 лет ребенок инвалид 
		//
		ВидыРасчета= Справочники.ГруппыРасчетов.ДетскиеПособия.Основные.ВыгрузитьКолонку("ВидРасчета");            
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияОрганизаций.Ссылка
		|ИЗ
		|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияОрганизаций.СпособРасчета В(&СпособыРасчета)
		|	И ОсновныеНачисленияОрганизаций.Ссылка В(&ВидыРасчета)";
		
		Запрос.УстановитьПараметр("СпособыРасчета", СпособыРасчета);
		Запрос.УстановитьПараметр("ВидыРасчета", ВидыРасчета);
		
		ДетскиеПособия = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Запрос = Новый Запрос;
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
		Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ПериодКонец));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
		|	РаботникиОрганизацийСрезПоследних.Организация.НаименованиеПолное КАК Организация,
		|	СостояниеРаботниковОрганизацийСрезПоследних.Регистратор КАК Документ,
		|	РаботникиОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК СостояниеРаботниковОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
		|		ПО СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|ГДЕ
		|	СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И СостояниеРаботниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Макет = ПолучитьМакет("СправкаОВыходеДоИстеченияСрока");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОВыходеДоИстеченияСрока";	
		Область = Макет.ПолучитьОбласть("Справка");
		
		Если Выборка.Следующий() Тогда
			ОтпускПоУходуЗаРебенком = Выборка.Документ;
			Если НЕ ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт = ДАТА(1,1,1) и  ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт < ОтпускПоУходуЗаРебенком.ДатаОкончания Тогда
				
				Область.Параметры.Заполнить(Выборка);
				Область.Параметры.Номер = Номер;
				Область.Параметры.Период = Период;
				Область.Параметры.МестоВыдачи = МестоВыдачи;
				Область.Параметры.Адресат = Адресат.НаименованиеПолное;
				
				ДатаПО = КонецДня(ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт) + 1;
				Область.Параметры.ДеньПо = День(ДатаПО);
				МесяцНачала  = Формат(ДатаПО,"ДФ=MMММ");
				УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцНачала, 4, МесяцНачала);
				Область.Параметры.МесяцПо = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаПО),МесяцНачала); //СВЭЙ 12.06.2024 КВВ СВФР-012926
				Область.Параметры.ГодПо = Формат(ДатаПО,"ДФ=гггг");
				
				Область.Параметры.ДеньВыдачи = День(Период);
				МесяцНачала  = Формат(Период,"ДФ=MMММ");
				УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцНачала, 4, МесяцНачала);
				Область.Параметры.МесяцВыдачи = ?(Организация.ИНН = "700103211",Месяц_Я(Период),МесяцНачала); //СВЭЙ 12.06.2024 КВВ СВФР-012926
				Область.Параметры.ГодВыдачи = Формат(Период,"ДФ=гггг");
				
				ДатаПриказа = ОтпускПоУходуЗаРебенком.ДатаПриказаОбОкончанииОтпуска; 
				Область.Параметры.ДеньПриказа = День(ДатаПриказа);
				МесяцНачала  = Формат(ДатаПриказа,"ДФ=MMММ");
				УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцНачала, 4, МесяцНачала);
				Область.Параметры.МесяцПриказа = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаПриказа),МесяцНачала); //СВЭЙ 12.06.2024 КВВ СВФР-012926
				Область.Параметры.ГодПриказа = Формат(ДатаПриказа,"ДФ=гггг");
				
				Область.Параметры.НомерПриказа = СокрЛП(ОтпускПоУходуЗаРебенком.НомерПриказаОбОкончанииОтпуска);
				
				ЗапросПособия = Новый Запрос;
				ЗапросПособия.Текст = 
				"ВЫБРАТЬ
				|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ), ДЕНЬ, -1)) КАК ПериодЗавершения
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&ДатаАктуальности,
				|			Сотрудник = &Сотрудник
				|				И Организация = &Организация) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|ГДЕ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение В(&ДетскиеПособия)
				|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ДействиеЗавершения = &ДействиеЗавершения";
				
				ЗапросПособия.УстановитьПараметр("ДетскиеПособия", ДетскиеПособия);
				ЗапросПособия.УстановитьПараметр("Организация", Организация);
				ЗапросПособия.УстановитьПараметр("ДатаАктуальности",	КонецДня(Период));
				ЗапросПособия.УстановитьПараметр("Сотрудник", Сотрудник);
				ЗапросПособия.УстановитьПараметр("ДействиеЗавершения", Перечисления.ВидыДействияСНачислением.Прекратить);
				
				РезультатЗапроса = ЗапросПособия.Выполнить().Выбрать();
				Если РезультатЗапроса.Следующий() Тогда
					Если РезультатЗапроса.ПериодЗавершения <> NULL и РезультатЗапроса.ПериодЗавершения <> ДАТА(1,1,1) Тогда
						Если НачалоДня(РезультатЗапроса.ПериодЗавершения) <= НачалоДня(ОтпускПоУходуЗаРебенком.ДатаОкончанияФакт) Тогда
							ДатаПособия = РезультатЗапроса.ПериодЗавершения;
							Область.Параметры.ДеньПособия = День(ДатаПособия);
							МесяцНачала  = Формат(ДатаПособия,"ДФ=MMММ");
							УправлениеОтчетами.Просклонять(глЗначениеПеременной("глКомпонентаСклоненияФИО"), МесяцНачала, 4, МесяцНачала);
							Область.Параметры.МесяцПособия = ?(Организация.ИНН = "700103211",Месяц_Я(ДатаПособия),МесяцНачала); //СВЭЙ 12.06.2024 КВВ СВФР-012926
							Область.Параметры.ГодПособия = Формат(ДатаПособия,"ДФ=гггг");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
					Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
						Руководит = стрОтветств.Сотрудник;
						ДолжностьРуководит = стрОтветств.Должность;
					КонецЕсли;
				КонецЦикла;
				Область.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
				Область.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
				
			КонецЕсли;
		КонецЕсли;
		ДокументРезультат.Вывести(Область);
		
	КонецПроцедуры
	
	//Аверсон ЕАЕ 26.08.2021 СВФР-007765
	Процедура СформироватьСправкаОбАлиментах(ДокументРезультат)
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Дата актуальности установим на последний день года. 
		Запрос.УстановитьПараметр("ДатаАктуальности",	КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода",  	ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода",  		ПериодКонец);
		Запрос.УстановитьПараметр("Физлицо",			Сотрудник.ФизЛицо);
		Запрос.УстановитьПараметр("Сотрудник",			Сотрудник);
		Запрос.УстановитьПараметр("Организация",		Организация);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("ИсполнительныйЛист", ИсполнительныйЛист);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ФизическиеЛица.Наименование) КАК ФИО,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1), ФизическиеЛица.Наименование) КАК ФИОСокр,
		|	РаботникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизацииСрезПоследних.Организация,
		|	РаботникиОрганизацииСрезПоследних.Должность,
		|	РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо.Пол КАК Пол
		|ПОМЕСТИТЬ ВТДанныеПОРаботнику
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				Сотрудник = &Сотрудник
		|					И Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
		|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
		|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
		|			КОНЕЦ = &Организация)
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Физлицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц
		|ПОМЕСТИТЬ ВТПериоды
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК Месяц,
		|	СУММА(УдержанияРаботниковОрганизаций.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТУдержания
		|ИЗ
		|	РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
		|ГДЕ
		|	УдержанияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|	И УдержанияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоПериода И &КонецПериода";
		
		//Аверсон 19.01.2022 КВВ СВФР-008621 (
		//|	И УдержанияРаботниковОрганизаций.ДокументОснование = &ИсполнительныйЛист
		Если ЗначениеЗаполнено(ИсполнительныйЛист) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И УдержанияРаботниковОрганизаций.ДокументОснование = &ИсполнительныйЛист";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|И НЕ УдержанияРаботниковОрганизаций.ДокументОснование.Ссылка  ЕСТЬ NULL
		|И ТИПЗНАЧЕНИЯ(УдержанияРаботниковОрганизаций.ДокументОснование) = ТИП(Документ.ИсполнительныйЛист) 
		|И НЕ УдержанияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПочтовыйСбор)
		//Аверсон 19.01.2022 КВВ СВФР-008621 )
		
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(УдержанияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПОРаботнику.ФИО КАК ФИО,
		|	ДанныеПОРаботнику.ФИОСокр КАК ФИОСокр,
		|	ДанныеПОРаботнику.Должность КАК Должность,
		|	ПОДСТРОКА(ФИОРуководителя.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОРуководителя.Отчество, 1, 1) + ""."" + ФИОРуководителя.Фамилия КАК ФИОРуководителя,
		|	ПОДСТРОКА(ФИОГлБухгалтера.Имя, 1, 1) + ""."" + ПОДСТРОКА(ФИОГлБухгалтера.Отчество, 1, 1) + ""."" + ФИОГлБухгалтера.Фамилия КАК ФИОГлБухгалтера,
		|	ДанныеПОРаботнику.Пол,
		|	ДанныеПОРаботнику.Организация.НаименованиеПолное КАК Организация
		|ИЗ
		|	ВТДанныеПОРаботнику КАК ДанныеПОРаботнику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОРуководителя
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо = ФИОРуководителя.ФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаАктуальности,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)) КАК ОтветственныеЛицаОрганизацийСрезПоследних1
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОГлБухгалтера
		|		ПО (ОтветственныеЛицаОрганизацийСрезПоследних1.ФизическоеЛицо = ФИОГлБухгалтера.ФизЛицо)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Периоды.Месяц КАК Месяц,
		|	СУММА(ЕСТЬNULL(Удержания.Результат, 0)) КАК Результат
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержания КАК Удержания
		|		ПО Периоды.Месяц = Удержания.Месяц
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.Месяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц
		|ИТОГИ
		|	СУММА(Результат)
		|ПО
		|	ОБЩИЕ";
		
		Результат = Запрос.ВыполнитьПакет();
		
		ВыборкаДанныеРаботника = Результат[3].Выбрать();
		ВыборкаДанныеУдержаний = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Макет = ПолучитьМакет("СправкаОбАлиментах");
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОбАлиментах";
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		//Данные исполнительного листа
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИсполнительныйЛист.ВидИсполнительногоДокумента,
		|	ИсполнительныйЛист.РеквизитыИсполнительногоДокумента,
		|	ИсполнительныйЛист.Размер,
		|	ИсполнительныйЛист.ПроцентПрожиточногоМинимума,
		|	ИсполнительныйЛист.ДатаРожденияРебенка,
		|	ИсполнительныйЛист.Имя,
		|	ИсполнительныйЛист.ДатаДействия
		|ИЗ
		|	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
		|ГДЕ
		|	ИсполнительныйЛист.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ИсполнительныйЛист);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДанныеИсполнительногоЛиста = РезультатЗапроса.Выбрать();
		//
		
		Если ВыборкаДанныеРаботника.Следующий() Тогда
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДанныеРаботника);
			ГлавБух = "";
			ДолжностьГлавБух = "";
			Руководит = "";
			ДолжностьРуководит = "";
			
			ОбластьШапка.Параметры.Период = Период;
			ОбластьШапка.Параметры.Номер = Номер;
			ОбластьШапка.Параметры.МестоВыдачи = МестоВыдачи;
			ОбластьШапка.Параметры.Адресат = СокрЛП(Адресат);
			Если ВыборкаДанныеИсполнительногоЛиста.Следующий() Тогда
				ОбластьШапка.Параметры.ИсполнительныйЛист = СокрЛП(ВыборкаДанныеИсполнительногоЛиста.ВидИсполнительногоДокумента) + " " + СокрЛП(ВыборкаДанныеИсполнительногоЛиста.РеквизитыИсполнительногоДокумента);
				ОбластьШапка.Параметры.Дети = СокрЛП(ВыборкаДанныеИсполнительногоЛиста.Имя) + " " + Формат(ВыборкаДанныеИсполнительногоЛиста.ДатаРожденияРебенка, "ДФ=dd.MM.yyyy");
				ОбластьШапка.Параметры.Размер = ВыборкаДанныеИсполнительногоЛиста.Размер;
				ОбластьШапка.Параметры.ПроцентПрожиточногоМинимума = ВыборкаДанныеИсполнительногоЛиста.ПроцентПрожиточногоМинимума;
				ОбластьШапка.Параметры.ДатаДействия = Формат(ВыборкаДанныеИсполнительногоЛиста.ДатаДействия, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			
			ОбластьШапка.Параметры.СЧисло = Формат(День(ПериодНачало),  "ЧЦ=2; ЧВН=");
			ОбластьШапка.Параметры.СМесяц = Формат(Месяц(ПериодНачало), "ЧЦ=2; ЧВН=");
			ОбластьШапка.Параметры.СГод = Прав(СокрЛП(Год(ПериодНачало)),2);
			
			ОбластьШапка.Параметры.ПоЧисло = Формат(День(ПериодКонец),  "ЧЦ=2; ЧВН=");
			ОбластьШапка.Параметры.ПоМесяц = Формат(Месяц(ПериодКонец), "ЧЦ=2; ЧВН=");
			ОбластьШапка.Параметры.ПоГод = Прав(СокрЛП(Год(ПериодКонец)),2);
			
			//ДокументРезультат.Вывести(ОбластьШапка);
			Пока ВыборкаДанныеУдержаний.Следующий() Цикл
				ОбластьШапка.Параметры.СуммаВыплаченоПрописью = Формат(ВыборкаДанныеУдержаний.Результат,"ЧРГ=' '; ЧГ=3,0") + " " + РаботаСДиалогами.СформироватьСуммуПрописью(ВыборкаДанныеУдержаний.Результат,Константы.ВалютаРегламентированногоУчета.Получить());
				ДокументРезультат.Вывести(ОбластьШапка);
				
				ВыборкаУдержанияПоМесяцам = ВыборкаДанныеУдержаний.Выбрать();
				Пока ВыборкаУдержанияПоМесяцам.Следующий() Цикл
					
					НомерМесяца = Формат(ВыборкаУдержанияПоМесяцам.Месяц,"ДФ=M");
					ОбластьСтрока.Параметры.ГодМесяц = СокрЛП(Год(ВыборкаУдержанияПоМесяцам.Месяц)) + "/ " + НомерМесяца;
					ОбластьСтрока.Параметры.СуммаКВыплате = ВыборкаУдержанияПоМесяцам.Результат;
					ОбластьСтрока.Параметры.СуммаВыплачено = ВыборкаУдержанияПоМесяцам.Результат;
					
					ДокументРезультат.Вывести(ОбластьСтрока);
				КонецЦикла;
			КонецЦикла; 
			
			ОбластьПодвал.Параметры.Заполнить(ВыборкаДанныеРаботника);
			
			ОбластьПодвал.Параметры.НаЧисло = Формат(День(Период),  "ЧЦ=2; ЧВН=");
			ОбластьПодвал.Параметры.НаМесяц = Формат(Месяц(Период), "ЧЦ=2; ЧВН=");
			ОбластьПодвал.Параметры.НаГод =  Прав(СокрЛП(Год(Период)),2);
			
			Для Каждого стрОтветств из Организация.ОтветственныеЛица Цикл 
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
					ГлавБух = стрОтветств.Сотрудник;
					ДолжностьГлавБух = стрОтветств.Должность;
				КонецЕсли;
				Если стрОтветств.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель Тогда 
					Руководит = стрОтветств.Сотрудник;
					ДолжностьРуководит = стрОтветств.Должность;
				КонецЕсли;
			КонецЦикла;
			ОбластьПодвал.Параметры.ФИОРуководителя = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Руководит);
			ОбластьПодвал.Параметры.ФИОГлБухгалтера = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ГлавБух);
			ОбластьПодвал.Параметры.ДолжностьРуководителя = ДолжностьРуководит;
			ОбластьПодвал.Параметры.ДолжностьГлБухгалтера = ДолжностьГлавБух;
			
			ДокументРезультат.Вывести(ОбластьПодвал);	
			ДокументРезультат.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецПроцедуры
	//Аверсон СВФР-007765
	
	Функция Месяц_Я(_Дата_)
		//СВЭЙ 12.06.2024 КВВ СВФР-012926 (  
		Если НЕ ЗначениеЗаполнено(_Дата_) Тогда
			Месяц_Я = "";
		Иначе
			Месяц_Я = нрег(Формат(_Дата_,"ДФ=ММММ")) + "ь";
			Месяц_Я = СтрЗаменить(Месяц_Я,"йь","я");
			Месяц_Я = СтрЗаменить(Месяц_Я,"ьь","я"); 
			Месяц_Я = СтрЗаменить(Месяц_Я,"ь","а"); 
		КонецЕсли;
		Возврат Месяц_Я;
		//СВЭЙ 12.06.2024 КВВ СВФР-012926 )
	КонецФункции
#КонецЕсли

