
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//+ СВЭЙ КДЯ 15.10.19 СВФР-004591
	ТЗ_УточненияСпособаОтраженияПоВидамРасчета =
			УточненияСпособаОтраженияПоВидамРасчета.Выгрузить();
	ТЗ_УточненияСпособаОтраженияПоВидамРасчета.Колонки.Добавить( "КоличествоДублей" );
	ТЗ_УточненияСпособаОтраженияПоВидамРасчета.ЗаполнитьЗначения( 1, "КоличествоДублей" );
	ТЗ_УточненияСпособаОтраженияПоВидамРасчета.Свернуть( "ВидРасчета", "КоличествоДублей" );
	Для каждого Стр Из ТЗ_УточненияСпособаОтраженияПоВидамРасчета Цикл
		Если Стр.КоличествоДублей > 1 Тогда
			Отказ = Истина;
			Сообщить( "По виду расчета """ + СокрЛП( Стр.ВидРасчета ) 
				+ """ заполнено " + Стр.КоличествоДублей + " строк (" 
				+ " по каждому виду расчета может быть заполнено не более одной строки ) !", 
				СтатусСообщения.ОченьВажное ); 
		КонецЕсли; 
	КонецЦикла; 
	//- СВЭЙ КДЯ 15.10.19 СВФР-004591
КонецПроцедуры
