Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокАттестации, ДокументРезультат)
	
	Пока ВыборкаСтрокАттестации.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокАттестации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокАттестации.ПодразделениеОрганизации Тогда	
			
			Если НЕ СплошнаяНумерация Тогда //СВЭЙ 21.05.2024 КВВ СВФР-012926
				мНомер = 0;
			КонецЕсли;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-014999
			//Климовичи
			//ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
			Если Орг.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа2");	
			Иначе
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			КонецЕсли;
			//ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			//Аверсон СВФР-014999
			
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокАттестации.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если ТипОтчета  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеПоощрения;
			ИначеЕсли ТипОтчета  = 2 Тогда
				Если Не СнятиеВзыскания Тогда
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеВзыскания;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = "";
					ОбластьДетальныхЗаписей.Параметры.Тип = "";
					ОбластьДетальныхЗаписей.Параметры.Примечание = "";					
				КонецЕсли;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		Иначе
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если ТипОтчета  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипПоощрения;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеПоощрения;
			ИначеЕсли ТипОтчета  = 2 Тогда
				Если Не СнятиеВзыскания Тогда
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = ВыборкаСтрокАттестации.ТекстВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Тип = ВыборкаСтрокАттестации.ТипВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.ПримечаниеВзыскания;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.НомерПриказа = ВыборкаСтрокАттестации.НомерПриказаСнятияВзыскания;
					ОбластьДетальныхЗаписей.Параметры.Текст = "";
					ОбластьДетальныхЗаписей.Параметры.Тип = "";
					ОбластьДетальныхЗаписей.Параметры.Примечание = "";					
				КонецЕсли;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	мМакет = ПолучитьМакет("Макет");
	ТекПодр = "";
	Запрос = Новый Запрос;
	Если ТипОтчета = 1 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ФизическиеЛицаПоощрения.ДатаПоощрения,
		|	ФизическиеЛицаПоощрения.НомерПриказаПоощрения,
		|	ФизическиеЛицаПоощрения.ТекстПоощрения,
		|	ФизическиеЛицаПоощрения.ТипПоощрения,
		|	ФизическиеЛицаПоощрения.ПримечаниеПоощрения,
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник
		|ИЗ
		|	Справочник.ФизическиеЛица.Поощрения КАК ФизическиеЛицаПоощрения
		
		//Аверсон ЕАЕ 04.11.2025 СВФР-017068
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
		|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
		|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
		|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
		|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
		//Аверсон СВФР-017068
		
		|		ПО ФизическиеЛицаПоощрения.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
		|ГДЕ
		//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|	ФизическиеЛицаПоощрения.ДатаПоощрения >= &ДатаНачала
		|	И ФизическиеЛицаПоощрения.ДатаПоощрения <= &ДатаОкончания
		|	//1 И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник,
		|	ФизическиеЛицаПоощрения.ДатаПоощрения,
		|	ФизическиеЛицаПоощрения.НомерПриказаПоощрения,
		|	ФизическиеЛицаПоощрения.ТекстПоощрения,
		|	ФизическиеЛицаПоощрения.ТипПоощрения,
		|	ФизическиеЛицаПоощрения.ПримечаниеПоощрения,
		|	РаботникиОрганизацийСрезПоследних.Должность
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";
		
	ИначеЕсли ТипОтчета = 2 Тогда 
		Если Не СнятиеВзыскания Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ФизическиеЛицаВзыскания.ДатаВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаВзыскания,
			|	ФизическиеЛицаВзыскания.ТекстВзыскания,
			|	ФизическиеЛицаВзыскания.ТипВзыскания,
			|	ФизическиеЛицаВзыскания.ПримечаниеВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник
			|ИЗ
			|	Справочник.ФизическиеЛица.Взыскания КАК ФизическиеЛицаВзыскания
			
			//Аверсон ЕАЕ 04.11.2025 СВФР-017068
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
			|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
			|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
			|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
			|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
			//Аверсон СВФР-017068
			
			|		ПО ФизическиеЛицаВзыскания.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			|ГДЕ
			//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
			|	ФизическиеЛицаВзыскания.ДатаВзыскания >= &ДатаНачала
			|	И ФизическиеЛицаВзыскания.ДатаВзыскания <= &ДатаОкончания
			|	//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания
			|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
			|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
			
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник,
			|	ФизическиеЛицаВзыскания.ДатаВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаВзыскания,
			|	ФизическиеЛицаВзыскания.ТекстВзыскания,
			|	ФизическиеЛицаВзыскания.ТипВзыскания,
			|	ФизическиеЛицаВзыскания.ПримечаниеВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Должность
			
			|УПОРЯДОЧИТЬ ПО
			|Приоритет Возр,
			|Сотрудник";
			
		Иначе
			// заявка №1577 (база заявок Кристалл) Дмитрук О.Г.
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаСнятияВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник
			|ИЗ
			|	Справочник.ФизическиеЛица.Взыскания КАК ФизическиеЛицаВзыскания
			
			//Аверсон ЕАЕ 04.11.2025 СВФР-017068
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|                              	РСРаботникиОрганизацийСрезПоследних.Сотрудник,
			|                              	РСРаботникиОрганизацийСрезПоследних.Должность,
			|                              	РСРаботникиОрганизацийСрезПоследних.Организация,
			|                              	РСРаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|                              ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РСРаботникиОрганизацийСрезПоследних 
			|                              ГДЕ РСРаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
			//Аверсон СВФР-017068
			
			|		ПО ФизическиеЛицаВзыскания.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			|ГДЕ
			//|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания >= &ДатаНачала
			|	И ФизическиеЛицаВзыскания.ДатаСнятияВзыскания <= &ДатаОкончания
			|	//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания
			|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
			|	//И РаботникиОрганизацийСрезПоследних.Категория = &Категория //СВЭЙ 21.05.2024 КВВ СВФР-012926
			
			|СГРУППИРОВАТЬ ПО
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник,
			|	ФизическиеЛицаВзыскания.ДатаСнятияВзыскания,
			|	ФизическиеЛицаВзыскания.НомерПриказаСнятияВзыскания,
			|	РаботникиОрганизацийСрезПоследних.Должность
			
			|УПОРЯДОЧИТЬ ПО
			|Приоритет Возр,
			|Сотрудник";
			
			// заявка №1577

		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ТипОтчета = 1 Тогда
		Если Не ПустаяСтрока(ТипПоощрения) тогда
			Запрос.УстановитьПараметр("ТипПоощрения",      ТипПоощрения);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения","И ФизическиеЛицаПоощрения.ТипПоощрения = &ТипПоощрения");
		КонецЕсли;
	ИначеЕсли ТипОтчета = 2 Тогда
		Если Не ПустаяСтрока(ТипВзыскания) тогда
			Запрос.УстановитьПараметр("ТипВзыскания",      ТипВзыскания);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания","И ФизическиеЛицаВзыскания.ТипВзыскания = &ТипВзыскания");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;

	//СВЭЙ 21.05.2024 КВВ СВФР-012926 (
	Если ЗначениеЗаполнено(Категория) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И РаботникиОрганизацийСрезПоследних.Категория = &Категория","И РаботникиОрганизацийСрезПоследних.Категория = &Категория");
		 Запрос.УстановитьПараметр("Категория", Категория);
	КонецЕсли;
	//СВЭЙ 21.05.2024 КВВ СВФР-012926 )
	
	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;
	Область.Параметры.НаименованиеОтчета = ?(ТипОтчета = 1, "Отчет о поощрениях", "Отчет о взысканиях");
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли

