


#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Настройка периода
Перем НП Экспорт;    
Перем ДатаЗаполнения;
Перем НомерДокумента;
Перем ОтветственноеЛицо;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

//  Процедура заполняет фильтр по переданным значениям
//  	Организация, ОтборОрганизации, ВидСравненияОрганизации
// 		Подразделение, ОтборПодразделения, ВидСравненияПодразделения,
//		Работник, ОтборРаботника, ВидСравненияРаботника,
//		ПериодРегистрации
Процедура УстановитьФильтр(ФильтрСоответствия) Экспорт
	
	Если ФильтрСоответствия["Организация"] <> Неопределено Тогда
		Организация = ФильтрСоответствия["Организация"];
	КонецЕсли;
	
	Если ФильтрСоответствия["Подразделение"] <> Неопределено Тогда
		Подразделение = ФильтрСоответствия["Подразделение"];
	КонецЕсли;
	
	Если ФильтрСоответствия["Работник"] <> Неопределено Тогда
		Работник = ФильтрСоответствия["Работник"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ОтборОрганизации"] <> Неопределено Тогда
		ОтборОрганизации = ФильтрСоответствия["ОтборОрганизации"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ОтборПодразделения"] <> Неопределено Тогда
		ОтборПодразделения = ФильтрСоответствия["ОтборПодразделения"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ОтборРаботника"] <> Неопределено Тогда
		ОтборРаботника = ФильтрСоответствия["ОтборРаботника"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ВидСравненияОрганизации"] <> Неопределено Тогда
		ВидСравненияОрганизации = ФильтрСоответствия["ВидСравненияОрганизации"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ВидСравненияПодразделения"] <> Неопределено Тогда
		ВидСравненияПодразделения = ФильтрСоответствия["ВидСравненияПодразделения"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ВидСравненияРаботника"] <> Неопределено Тогда
		ВидСравненияРаботника = ФильтрСоответствия["ВидСравненияРаботника"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ПериодРегистрации"] <> Неопределено Тогда
		ДатаНач = ФильтрСоответствия["ПериодРегистрации"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ДатаЗаполнения"] <> Неопределено Тогда
		ДатаЗаполнения = ФильтрСоответствия["ДатаЗаполнения"];
	КонецЕсли;
	
	Если ФильтрСоответствия["НомерДокумента"] <> Неопределено Тогда
		НомерДокумента = ФильтрСоответствия["НомерДокумента"];
	КонецЕсли;
	
	Если ФильтрСоответствия["ОтветственноеЛицо"] <> Неопределено Тогда
		ОтветственноеЛицо = ФильтрСоответствия["ОтветственноеЛицо"];
	КонецЕсли;
КонецПроцедуры // УстановитьФильтр()


// Процедура Формирует отчет Т-13 по данным регистров
// и заполняет табличный документ - ДокументРезильтат
Процедура СформироватьОтчет(ДокументРезультат, Режим, ВозвращаемоеСообщениеОбОшибке = Неопределено, Очищать = Истина,БезВредности = Ложь) Экспорт
	
	Если Не ПроцедурыУправленияПерсоналом.РегламентированныйКалендарьЗаполнен(НачалоМесяца(ДатаНач),КонецМесяца(ДатаНач),Истина) Тогда
		Если Режим = "Табель" Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
//толик	
	Если Очищать Тогда
		ДокументРезультат.Очистить();
	КонецЕсли;
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева = 0;
	ДокументРезультат.ПолеСправа = 0;
	
	ЗапросТабель = Новый Запрос();
	
	ЗапросТабель.УстановитьПараметр("НачалоПериода", ДатаНач);
	ЗапросТабель.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаНач));
	
	ЗапросТабель.УстановитьПараметр("Явка", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	ЗапросТабель.УстановитьПараметр("Выходной", Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни);
	ЗапросТабель.УстановитьПараметр("ПоНочнымЧасам", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	ЗапросТабель.УстановитьПараметр("НочныеЧасы", Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы);
	ЗапросТабель.УстановитьПараметр("ОтработаноСверхНормы", Перечисления.ВидыВремени.ОтработанноеСверхНормы);
	ЗапросТабель.УстановитьПараметр("ПоВечернимЧасам", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросТабель.УстановитьПараметр("ВечерниеЧасы", Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы);
	ЗапросТабель.УстановитьПараметр("ПоЧасам", Перечисления.ВидыУчетаВремени.ПоЧасам);
	ЗапросТабель.УстановитьПараметр("ПриемНаРаботу", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	ЗапросТабель.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ЗапросТабель.УстановитьПараметр("ПоДням", Перечисления.ВидыУчетаВремени.ПоДням);
	ЗапросТабель.УстановитьПараметр("Работает", Перечисления.СостоянияРаботникаОрганизации.Работает);
	ЗапросТабель.УстановитьПараметр("ВидВремениПустаяСсылка", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	ЗапросТабель.УстановитьПараметр("Ответственный", Ответственный.ФизЛицо);
	
	// условия на измерения регистра
	УсловиеПоРаботникам	= "";
	УсловиеНаОрганизации = "";
	
	Если ОтборРаботника Тогда
		
		ЗапросТабель.УстановитьПараметр("РаботникиОрганизации", Работник);
		
		Если ВидСравненияРаботника = ВидСравнения.Равно Тогда
			ВидСравненияРаботник = "=" 
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеРавно Тогда
			ВидСравненияРаботник = "<>"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСписке Тогда
			ВидСравненияРаботник = "В"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеВСписке Тогда
			ВидСравненияРаботник = "НЕ В"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСпискеПоИерархии ИЛИ
			ВидСравненияРаботника = ВидСравнения.ВИерархии Тогда
			ВидСравненияРаботник = "В ИЕРАРХИИ"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеВСпискеПоИерархии ИЛИ
			ВидСравненияРаботника = ВидСравнения.НеВИерархии Тогда
			ВидСравненияРаботник = "НЕ В ИЕРАРХИИ"
		КонецЕсли;
		
		Если ВидСравненияРаботник = "=" ИЛИ ВидСравненияРаботник = "<>" Тогда
			УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + " &РаботникиОрганизации";
		Иначе
			УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + "(&РаботникиОрганизации)";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтборОрганизации Тогда
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			ЗапросТабель.УстановитьПараметр("Организация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА Организации.Ссылка
			|		ИНАЧЕ Организации.ГоловнаяОрганизация
			|	КОНЕЦ КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В(&Организация)");
			
			Запрос.УстановитьПараметр("Организация", Организация);
			ЗапросТабель.УстановитьПараметр("Организация", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;
			
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияДляОрганизации = "=" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияДляОрганизации = "<>"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияДляОрганизации = "В"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеВСписке Тогда
			ВидСравненияДляОрганизации = "НЕ В"
		КонецЕсли;
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно ИЛИ ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			УсловиеНаОрганизации = " Организация " + ВидСравненияДляОрганизации + " &Организация";
		Иначе
			УсловиеНаОрганизации = " Организация " + ВидСравненияДляОрганизации + " (&Организация)";
		КонецЕсли;
	КонецЕсли;
	
	// условия на ресурсы регистра
	УсловиеВЗапрос = "";
	Если ОтборОрганизации Тогда
        ЗапросТабель.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияДляОрганизации = "=" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияДляОрганизации = "<>"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияДляОрганизации = "В"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеВСписке Тогда
			ВидСравненияДляОрганизации = "НЕ В"
		КонецЕсли;
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно ИЛИ ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			УсловиеНаОбособленноеПодразделение = " ВЫБОР
												|		КОГДА ПериодЗавершения <= &КонецПериода
												|				И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
												|			ТОГДА ОбособленноеПодразделениеЗавершения
												|		ИНАЧЕ ОбособленноеПодразделение
												|	КОНЕЦ " + ВидСравненияДляОрганизации + " &ОбособленноеПодразделение";
		Иначе
			УсловиеНаОбособленноеПодразделение = " ВЫБОР
												|		КОГДА ПериодЗавершения <= &КонецПериода
												|				И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
												|			ТОГДА ОбособленноеПодразделениеЗавершения
												|		ИНАЧЕ ОбособленноеПодразделение
												|	КОНЕЦ " + ВидСравненияДляОрганизации + " (&ОбособленноеПодразделение)";
		КонецЕсли;
		УсловиеВЗапрос = УсловиеВЗапрос + " И " + УсловиеНаОбособленноеПодразделение;
	КонецЕсли;
	
	УсловиеПодразделение = "";
	Если ОтборПодразделения Тогда
		ЗапросТабель.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
		
		Если ВидСравненияПодразделения = ВидСравнения.Равно Тогда
			ВидСравненияДляПодразделения = "=" 
		ИначеЕсли ВидСравненияПодразделения = ВидСравнения.НеРавно Тогда
			ВидСравненияДляПодразделения = "<>"
		ИначеЕсли ВидСравненияПодразделения = ВидСравнения.ВСписке Тогда
			ВидСравненияДляПодразделения = "В"
		ИначеЕсли ВидСравненияПодразделения = ВидСравнения.НеВСписке Тогда
			ВидСравненияДляПодразделения = "НЕ В"
		ИначеЕсли ВидСравненияПодразделения = ВидСравнения.ВСпискеПоИерархии ИЛИ
			ВидСравненияПодразделения = ВидСравнения.ВИерархии Тогда
			ВидСравненияДляПодразделения = "В ИЕРАРХИИ"
		ИначеЕсли ВидСравненияПодразделения = ВидСравнения.НеВСпискеПоИерархии ИЛИ
			ВидСравненияПодразделения = ВидСравнения.НеВИерархии Тогда
			ВидСравненияДляПодразделения = "НЕ В ИЕРАРХИИ"
		КонецЕсли;
		
		Если ВидСравненияПодразделения = ВидСравнения.Равно ИЛИ ВидСравненияПодразделения = ВидСравнения.НеРавно Тогда
			УсловиеПодразделение = " ВЫБОР
									|		КОГДА ПериодЗавершения <= &КонецПериода
									|				И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
									|			ТОГДА ПодразделениеОрганизацииЗавершения
									|		ИНАЧЕ ПодразделениеОрганизации
									|	КОНЕЦ " + ВидСравненияДляПодразделения + " &ПодразделениеОрганизации";
		Иначе
			УсловиеПодразделение = " ВЫБОР
									|		КОГДА ПериодЗавершения <= &КонецПериода
									|				И ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
									|			ТОГДА ПодразделениеОрганизацииЗавершения
									|		ИНАЧЕ ПодразделениеОрганизации
									|	КОНЕЦ " + ВидСравненияДляПодразделения + " (&ПодразделениеОрганизации)";
		КонецЕсли;
		
		УсловиеВЗапрос = УсловиеВЗапрос + " И " + УсловиеПодразделение;
	КонецЕсли;
	
	Если ГруппироватьПодразделения Тогда
		ПорядокГруппировки = " ПодразделениеОрганизации, ";
	Иначе
		ПорядокГруппировки = " ";
	КонецЕсли;
	
	Макет = ПолучитьМакет("Т13");
	
	ОбластьДанныхШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьДанныхКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
	ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьДанныхПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьДанныхШапка.Параметры.ДатаНач     = ДатаНач;
	ОбластьДанныхШапка.Параметры.ДатаКон     = КонецМесяца(ДатаНач);
	
	//заполним ответсвенных в документе
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,
						  |	Руководитель.Должность КАК ДолжностьРуководителя,
						  |	ФИОКадровика.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровика.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровика.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОКадровика,
						  |	РуководительКадровойСлужбы.Должность КАК ДолжностьКадровика,
						  |	Ответственноый.ФИООтветственного,
						  |	Ответственноый.ДолжностьОтветственного
						  |ИЗ
						  |	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
						  |			&ДатаСреза,
						  |			СтруктурнаяЕдиница = &Подразделение
						  |				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководителя
						  |		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо
						  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
						  |				&ДатаСреза,
						  |				СтруктурнаяЕдиница = &Организация
						  |					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбы
						  |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадровика
						  |			ПО РуководительКадровойСлужбы.ФизическоеЛицо = ФИОКадровика.ФизЛицо
						  |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
						  |				МАКСИМУМ(ВЫБОР
						  |						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &ДатаСреза
						  |								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						  |							ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
						  |						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
						  |					КОНЕЦ) КАК ДолжностьОтветственного,
						  |				МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
						  |			ИЗ
						  |				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник.Физлицо = &ФизЛицо) КАК РаботникиОрганизацийСрезПоследних
						  |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛицСрезПоследних
						  |					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственноый
						  |			ПО (ИСТИНА)
						  |		ПО (ИСТИНА)");
	
	Запрос.УстановитьПараметр("ДатаСреза",         КонецМесяца(ДатаНач));
	Если Подразделение <> Неопределено тогда
		Запрос.УстановитьПараметр("Подразделение",     Организация);
	Иначе
		Запрос.УстановитьПараметр("Подразделение",     Подразделение);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация",       Организация);
	Если ОтветственноеЛицо <> Неопределено тогда           
		Запрос.УстановитьПараметр("ФизЛицо", ОтветственноеЛицо.ФизЛицо);
	Иначе
		Запрос.УстановитьПараметр("ФизЛицо", Неопределено);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		ОбластьДанныхПодвал.Параметры.Заполнить(Выборка);
	КонецЕсли;
	
	ПараметровВстроке = ОбластьДанныхСтрока.Параметры.Количество();
	
	Если Режим = "Табель" Тогда
		
		ЗапросТабель.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Запрос сотрудников
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	РаботникиОрганизаций.Сотрудник,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
		|		КОГДА ФИОФизЛицСрезПоследних.Имя = """"
		|			ТОГДА """"
		|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
		|			ТОГДА """"
		|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|	КОНЕЦ, РаботникиОрганизаций.Сотрудник.Физлицо.Наименование) КАК СотрудникНаименование,
		|	ДолжностиРаботников.ОбособленноеПодразделение КАК Организация,
		|	ДолжностиРаботников.ПодразделениеОрганизации,
		|	ДолжностиРаботников.Должность
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|		РаботникиОрганизацийСрезПоследних.Организация КАК Организация
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	
		|	ОБЪЕДИНИТЬ 
		|	
		|	ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник,
		|		РаботникиОрганизаций.Организация
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период > &НачалоПериода
		|		И РаботникиОрганизаций.Период < &КонецПериода
		|		" + ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации), "", " И " + УсловиеНаОрганизации), " И " + УсловиеПоРаботникам) + "
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&КонецПериода,
		|		ФизЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				СотрудникиОрганизаций.Физлицо
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ГДЕ
		|				ИСТИНА" + ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации)," И " + СтрЗаменить(УсловиеПоРаботникам,"Сотрудник","Ссылка")) + ")) КАК ФИОФизЛицСрезПоследних
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = РаботникиОрганизаций.Сотрудник.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") Как ДолжностиРаботников
		|		ПО ДолжностиРаботников.Сотрудник = РаботникиОрганизаций.Сотрудник
		|ГДЕ
		|	ИСТИНА" + УсловиеВЗапрос + "
		|ИНДЕКСИРОВАТЬ ПО
		|	РаботникиОрганизаций.Сотрудник";
		
		ЗапросТабель.Выполнить();
		
		// Запрос дат периода
		Если РабочаяДата < НачалоМесяца(ДатаНач) Тогда
			// формируем пустую таблицу
			ВозвращаемоеСообщениеОбОшибке = "Отчет можно формировать только за текущий или предыдущий периоды!";
			Возврат;
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ
			|	ДатаТабеля
			|	
			|ПОМЕСТИТЬ ВТДатыТабеля 
			|	ИЗ (
			|	ВЫБРАТЬ
			|	ДАТАВРЕМЯ(" + Формат(Год(ДатаНач), "ЧГ=4") + ", " + Месяц(ДатаНач) + " , 1) КАК ДатаТабеля
			|	";           
			Для НомерДня = 2 По День(Мин(РабочаяДата, КонецМесяца(ДатаНач))) Цикл
				ТекстЗапроса = ТекстЗапроса + 
				"ОБЪЕДИНИТЬ ВСЕ
				|ВЫБРАТЬ
				|  ДАТАВРЕМЯ(" + Формат(Год(ДатаНач), "ЧГ=4")+ ", " + Месяц(ДатаНач) + " ," + НомерДня + ")
				|	";
			КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
		КонецЕсли;
		ЗапросТабель.Текст = ТекстЗапроса;
		ЗапросТабель.Выполнить();
		
		// Запрос Сотрудник, ДатыПериода
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ
		|	Сотрудник,
		|	СотрудникНаименование,
		|	Организация,
		|	ПодразделениеОрганизации,
		|	Должность,
		|	ВТДатыТабеля.ДатаТабеля КАК ДатаТабеля
		|ПОМЕСТИТЬ ВТСотрудникДата
		|	ИЗ ВТСотрудники КАК Сотрудники
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыТабеля
		|	ПО ИСТИНА 
		|ИНДЕКСИРОВАТЬ ПО
		|	СотрудникНаименование,
		|	ВТДатыТабеля.ДатаТабеля ";
		
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФактическийПериодДействия.Сотрудник КАК Сотрудник,
		|	ФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
		|	ФактическийПериодДействия.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидВремени,
		|	ФактическийПериодДействия.ВидРасчета.ВидВремени КАК ПеречислениеВидВремени,
		|	ФактическийПериодДействия.ГрафикРаботы КАК ГрафикРаботы,
		|	ФактическийПериодДействия.ПериодДействияНачало,
		|	ФактическийПериодДействия.ПериодРегистрации,
		|	ФактическийПериодДействия.Сторно,
		|	ФактическийПериодДействия.ПериодДействияКонец,
		|	ФактическийПериодДействия.ОтработаноЧасов
		|ПОМЕСТИТЬ ВТОсновныеНачисления
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|			ПериодДействия = &НачалоПериода
		|				И Сотрудник В
		|					(ВЫБРАТЬ
		|						Сотрудники.Сотрудник
		|					ИЗ
		|						ВТСотрудники КАК Сотрудники)
		|				И ((НЕ ВидРасчета.ВидВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы), ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ЧасовоеНеотработанное)))
		|					ИЛИ ВидУчетаВремени В (ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам), ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоВечернимЧасам)))) КАК ФактическийПериодДействия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ВидРасчета,
		|	ГрафикРаботы";

		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ
		|	ВТДатыТабеля.ДатаТабеля,
		|	Начисления.Сотрудник,
		|	Начисления.ВидРасчета,
		|	Начисления.ВидВремени,
		|	Начисления.ПеречислениеВидВремени,
		|	Начисления.ГрафикРаботы,
		|	ВЫБОР КОГДА Начисления.ПеречислениеВидВремени = &ОтработаноСверхНормы ТОГДА
		|		ВЫБОР КОГДА ВТДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало ТОГДА
		|			Начисления.ОтработаноЧасов
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ
		|	ИНАЧЕ
		|		NULL
		|	КОНЕЦ КАК ОтработаноЧасов
		|	
		|ПОМЕСТИТЬ ВТОтфильтрованныеОсновныеНачисления
		|ИЗ
		|	ВТДатыТабеля
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТОсновныеНачисления КАК Начисления
		|ПО
		|	ВТДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец
		|	И НЕ Начисления.Сторно
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ВТОсновныеНачисления КАК СторноНачисления
		|ПО
		|	ВТДатыТабеля.ДатаТабеля МЕЖДУ СторноНачисления.ПериодДействияНачало И СторноНачисления.ПериодДействияКонец
		|	И СторноНачисления.Сторно
		|	И СторноНачисления.Сотрудник = Начисления.Сотрудник
		|	И СторноНачисления.ВидРасчета = Начисления.ВидРасчета
		|	И СторноНачисления.ГрафикРаботы = Начисления.ГрафикРаботы
		|	И СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации
		|ГДЕ СторноНачисления.Сотрудник Есть NULL";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ
		|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
		|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
		|	РабочееВремяРаботниковОрганизаций.Период КАК ДатаТабеля
		|	ПОМЕСТИТЬ ВТРабочеВремя
		|	ИЗ
		|	(ВЫБРАТЬ
		|		РабочееВремяРаботниковОрганизаций.Сотрудник,
		|		РабочееВремяРаботниковОрганизаций.Часов,
		|		РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочеговремени,
		|		РабочееВремяРаботниковОрганизаций.Период
		|	ИЗ
		|		РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
		|	ГДЕ
		|		(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
		|		И (НЕ РабочееВремяРаботниковОрганизаций.СводнаяЗапись)
		|		И НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ) = &НачалоПериода
		|	И ВЫБОР
		|			КОГДА &ФлагПоТабелю
		|				ТОГДА РабочееВремяРаботниковОрганизаций.Регистратор ССЫЛКА Документ.ТабельУчетаРабочегоВремениОрганизации
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ

		|	ОБЪЕДИНИТЬ
		|		
		|	ВЫБРАТЬ
		|		ОсновныеНачисления.Сотрудник,
		|		ОсновныеНачисления.ОтработаноЧасов,
		|		ОсновныеНачисления.ВидВремени,
		|		ОсновныеНачисления.ДатаТабеля
		|	ИЗ 
		|		ВТОтфильтрованныеОсновныеНачисления КАК ОсновныеНачисления
		|	ГДЕ
		|		ОсновныеНачисления.ПеречислениеВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
		|	) КАК РабочееВремяРаботниковОрганизаций
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
		|	ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ВТСотрудники.Сотрудник
		|	
		|	СГРУППИРОВАТЬ ПО
		|	РабочееВремяРаботниковОрганизаций.Сотрудник,
		|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
		|	РабочееВремяРаботниковОрганизаций.Период
		|	
		|	ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	ДатаТабеля	";
		УчетнаяПолитикаЗапрос = Новый Запрос;//О.Т. 23.12.2014 № 
		УчетнаяПолитикаЗапрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.ОтработанноеВремяТолькоПоТабелю
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		УчетнаяПолитикаЗапрос.УстановитьПараметр("Организация",УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация"));
		УчетнаяПолитика = УчетнаяПолитикаЗапрос.Выполнить().Выгрузить();
		если УчетнаяПолитика.Количество()>0 Тогда 
			Запрос.УстановитьПараметр("ФлагПоТабелю",УчетнаяПолитика[0].ОтработанноеВремяТолькоПоТабелю);
		иначе
			Запрос.УстановитьПараметр("ФлагПоТабелю",Ложь);
		КонецЕсли;
		
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = "ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.Период,
		|	Работники.ГрафикРаботы,
		|	Работники.ПериодЗавершения,
		|	Работники.ГрафикРаботыЗавершения
		|	ПОМЕСТИТЬ ВТГрафикиРаботниковСрез
		|	ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)" + ?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации) + ") КАК Работники
		|	
		|	ИНДЕКСИРОВАТЬ ПО 
		|	Сотрудник,
		|	Период";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = "ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	&НачалоПериода КАК Период,
		|	ВЫБОР КОГДА Работники.ПериодЗавершения <= &НачалоПериода И Работники.ПериодЗавершения  <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ТОГДА Работники.ГрафикРаботыЗавершения ИНАЧЕ Работники.ГрафикРаботы КОНЕЦ КАК ГрафикРаботы
		|	ПОМЕСТИТЬ ВТГрафикиРаботников
		|	ИЗ
		|	ВТГрафикиРаботниковСрез КАК Работники
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	Работники.Сотрудник КАК Сотрудник,
		|	Работники.ПериодЗавершения КАК Период,
		|	Работники.ГрафикРаботыЗавершения КАК ГрафикРаботы
		|	ИЗ
		|	ВТГрафикиРаботниковСрез КАК Работники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПроверка
		|		ПО РаботникиОрганизацийПроверка.Сотрудник = Работники.Сотрудник
		|			И РаботникиОрганизацийПроверка.Период <= Работники.ПериодЗавершения
		|			И РаботникиОрганизацийПроверка.Период > Работники.Период
		|	
		|	ГДЕ Работники.ПериодЗавершения >= &НачалоПериода 
		|	И Работники.ПериодЗавершения <= &КонецПериода 
		|	И РаботникиОрганизацийПроверка.Сотрудник ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.Период,
		|	РаботникиОрганизаций.ГрафикРаботы
		|	ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
		|	ПО РаботникиОрганизаций.Сотрудник = ВТСотрудники.Сотрудник
		|	ГДЕ
		|	РаботникиОрганизаций.Период > &НачалоПериода
		|	И РаботникиОрганизаций.Период <= &КонецПериода
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	РаботникиОрганизаций.Сотрудник,
		|	РаботникиОрганизаций.ПериодЗавершения,
		|	РаботникиОрганизаций.ГрафикРаботыЗавершения
		|	ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
		|		ПО РаботникиОрганизаций.Сотрудник = ВТСотрудники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПроверка
		|		ПО РаботникиОрганизацийПроверка.Сотрудник = РаботникиОрганизаций.Сотрудник
		|			И РаботникиОрганизацийПроверка.Период <= РаботникиОрганизаций.ПериодЗавершения
		|			И РаботникиОрганизацийПроверка.Период > РаботникиОрганизаций.Период
		|	ГДЕ
		|	РаботникиОрганизаций.Период > &НачалоПериода
		|	И РаботникиОрганизаций.Период <= &КонецПериода
		|	И РаботникиОрганизаций.ПериодЗавершения <= &КонецПериода 
		|	И РаботникиОрганизаций.ПериодЗавершения > &НачалоПериода
		|	И РаботникиОрганизацийПроверка.Сотрудник ЕСТЬ NULL 
		|	
		|	ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Период	";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = "ВЫБРАТЬ 
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	Дата,
		|	ОсновноеЗначение,
		|	ВидУчетаВремени,
		|	План
		|	
		|	ПОМЕСТИТЬ ВТГрафикиРаботыПоВидамВремени
		|	ИЗ
		|		РегистрСведений.ГрафикиРаботыПоВидамВремени Как ГрафикиРаботыПоВидамВремени
		|	ГДЕ
		|		(ГрафикиРаботыПоВидамВремени.ГрафикРаботы В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)
		|		ИЛИ ГрафикиРаботыПоВидамВремени.ГрафикРаботы В (ВЫБРАТЬ РАЗЛИЧНЫЕ ГрафикРаботы Из ВТГрафикиРаботников))	
		|		И (Месяц = &НачалоПериода) И ВидУчетаВремени <> &ПоДням
		|	ИНДЕКСИРОВАТЬ ПО
		|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
		|	ГрафикиРаботыПоВидамВремени.Дата,
		|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени,
		|	ГрафикиРаботыПоВидамВремени.План";
		ЗапросТабель.Выполнить();
		
		
		ЗапросТабель.Текст = "ВЫБРАТЬ 
		|	Основной.Сотрудник,
		|	Основной.ГрафикРаботы,
		|	Основной.Период КАК ПериодНачало,
		|	ВЫБОР КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL ТОГДА &КонецПериода ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(Вспомогательный.Период), СЕКУНДА, -1) КОНЕЦ КАК ПериодКонец
		|	
		|	ПОМЕСТИТЬ ВТГрафикиПериодами
		|	
		|	ИЗ ВТГрафикиРаботников КАК Основной
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботников КАК Вспомогательный
		|	ПО Вспомогательный.Сотрудник = Основной.Сотрудник
		|	И Вспомогательный.Период > Основной.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|	Основной.Сотрудник,
		|	Основной.ГрафикРаботы,
		|	Основной.Период
		|	
		|	ИНДЕКСИРОВАТЬ ПО
		|	Основной.Сотрудник,
		|	Основной.Период ";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = "ВЫБРАТЬ
		|	СостояниеРаботников.Сотрудник КАК Сотрудник,
		|	СостояниеРаботников.Период КАК Период,
		|	СостояниеРаботников.Состояние,
		|	СостояниеРаботников.ПериодЗавершения,
		|	СостояниеРаботников.СостояниеЗавершения
		|	ПОМЕСТИТЬ ВТСостояниеРаботниковСрез
		|	ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&НачалоПериода, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники) " + ?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации) + ") КАК СостояниеРаботников
		|	
		|	ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник,
		|	Период";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = "ВЫБРАТЬ
		|	СостояниеРаботников.Сотрудник КАК Сотрудник,
		|	&НачалоПериода КАК Период,
		|	ВЫБОР КОГДА СостояниеРаботников.ПериодЗавершения <= &НачалоПериода И СостояниеРаботников.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) ТОГДА СостояниеРаботников.СостояниеЗавершения ИНАЧЕ СостояниеРаботников.Состояние КОНЕЦ КАК Состояние
		|	ПОМЕСТИТЬ ВТСостояниеРаботников
		|	ИЗ
		|	ВТСостояниеРаботниковСрез КАК СостояниеРаботников
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|	СостояниеРаботников.Сотрудник,
		|	СостояниеРаботников.ПериодЗавершения,
		|	СостояниеРаботников.СостояниеЗавершения
		|	ИЗ
		|	ВТСостояниеРаботниковСрез КАК СостояниеРаботников
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковПроверка
		|		ПО СостояниеРаботниковПроверка.Сотрудник = СостояниеРаботников.Сотрудник
		|			И СостояниеРаботниковПроверка.Период <= СостояниеРаботников.ПериодЗавершения
		|				И СостояниеРаботниковПроверка.Период > СостояниеРаботников.Период
		|	
		|	ГДЕ СостояниеРаботников.ПериодЗавершения >= &НачалоПериода 
		|		И СостояниеРаботников.ПериодЗавершения <= &КонецПериода 
		|		И СостояниеРаботниковПроверка.Сотрудник ЕСТЬ NULL 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СостояниеРаботников.Сотрудник,
		|		СостояниеРаботников.Период,
		|		СостояниеРаботников.Состояние
		|	ИЗ
		|		РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
		|		ПО СостояниеРаботников.Сотрудник = ВТСотрудники.Сотрудник
		|	ГДЕ
		|		СостояниеРаботников.Период > &НачалоПериода
		|		И СостояниеРаботников.Период <= &КонецПериода
		|		
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СостояниеРаботников.Сотрудник,
		|		СостояниеРаботников.ПериодЗавершения,
		|		СостояниеРаботников.СостояниеЗавершения
		|	ИЗ
		|		РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
		|			ПО СостояниеРаботников.Сотрудник = ВТСотрудники.Сотрудник
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК СостояниеРаботниковПроверка
		|			ПО СостояниеРаботниковПроверка.Сотрудник = СостояниеРаботников.Сотрудник
		|				И СостояниеРаботниковПроверка.Период <= СостояниеРаботников.ПериодЗавершения
		|				И СостояниеРаботниковПроверка.Период > СостояниеРаботников.Период
		|	ГДЕ
		|		СостояниеРаботников.Период > &НачалоПериода
		|		И СостояниеРаботников.Период <= &КонецПериода
		|		И СостояниеРаботников.ПериодЗавершения <= &КонецПериода 
		|		И СостояниеРаботников.ПериодЗавершения > &НачалоПериода
		|		И СостояниеРаботниковПроверка.Сотрудник ЕСТЬ NULL 
		|		
		|	ИНДЕКСИРОВАТЬ ПО
		|		Сотрудник,
		|		Период	";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ 
		|		Основной.Сотрудник,
		|		ВЫБОР 
		|		 	КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Заболевание)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Командировка)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)		
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебный)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускУчебныйНеоплачиваемый)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)		
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ВынужденныйПрогул)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ГосударственныеОбязанности)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Прогулы)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
		|			КОГДА Основной.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Простой)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Простой)
		|		КОНЕЦ
		|		КАК ВидВремени,
		|		Основной.Период КАК ПериодНачало,
		|		ВЫБОР КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL ТОГДА &КонецПериода ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(Вспомогательный.Период), СЕКУНДА, -1) КОНЕЦ КАК ПериодКонец
		|	
		|	ПОМЕСТИТЬ ВТСостояниеСотрудников
		|	
		|	ИЗ ВТСостояниеРаботников КАК Основной
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеРаботников КАК Вспомогательный
		|		ПО Вспомогательный.Сотрудник = Основной.Сотрудник
		|		И Вспомогательный.Период > Основной.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Основной.Сотрудник,
		|		Основной.Состояние,
		|		Основной.Период
		|	
		|	ИНДЕКСИРОВАТЬ ПО
		|		Основной.Сотрудник,
		|		Основной.Период ";
		ЗапросТабель.Выполнить();
		
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ
		|		НеотфильтрованноеВремя.Организация Как Организация,
		|		ВЫРАЗИТЬ(НеотфильтрованноеВремя.Организация.НаименованиеПолное КАК СТРОКА(300)) Как ИмяОрганизации,
		|		НеотфильтрованноеВремя.Организация.КодПоОКПО Как КодПоОКПО,
		|		НеотфильтрованноеВремя.ПодразделениеОрганизации Как ПодразделениеОрганизации,
		|		НеотфильтрованноеВремя.ПодразделениеОрганизации.Наименование Как ИмяПодразделения,
		|		НеотфильтрованноеВремя.Должность.Наименование Как Должность,
		|		НеотфильтрованноеВремя.Сотрудник,
		|		НеотфильтрованноеВремя.Сотрудник.Код КАК ТабельныйНомер,
		|		НеотфильтрованноеВремя.СотрудникНаименование,
		|		НеотфильтрованноеВремя.ДатаТабеля,
		|		НеотфильтрованноеВремя.ВидВремени,
		|		Выбор Когда НеотфильтрованноеВремя.ВидВремени.РабочееВремя Тогда
		|			ЕстьNULL(НеотфильтрованноеВремя.Часов, 0)
		|		Иначе 0 Конец Как Часов,
		|		Выбор Когда НЕ НеотфильтрованноеВремя.ВидВремени.РабочееВремя Тогда
		|			ЕстьNULL(НеотфильтрованноеВремя.Часов, 0)
		|		Иначе 0 Конец Как НеотработаноЧасов,
		|		Выбор 
		|			Когда НеотфильтрованноеВремя.ВидВремени = &Явка ИЛИ НеотфильтрованноеВремя.ВидВремени.РабочееВремя Тогда 1
		|			Когда НеотфильтрованноеВремя.ВидВремени = &ВечерниеЧасы Тогда 2
		|			Когда НеотфильтрованноеВремя.ВидВремени = &НочныеЧасы Тогда 3
		|			Когда НеотфильтрованноеВремя.ВидВремени = &Выходной Тогда 5
		|			Иначе 4
		|		Конец КАК ПолеСортировки,
		|		НеотфильтрованноеВремя.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени,
		|		Руководитель.Должность КАК ДолжностьРуководителя,
		|		ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,		
		|		ЕСТЬNULL(РуководительКадровойСлужбыПодразделения.Должность, РуководительКадровойСлужбыОрганизации.Должность) КАК ДолжностьКадровика,
		|		ВЫБОР КОГДА ФИОКадровикаПодразделения.Фамилия ЕСТЬ NULL 
		|		ТОГДА ФИОКадровикаОрганизации.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Отчество КАК СТРОКА(1))) + "".""
		|		ИНАЧЕ ФИОКадровикаПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Отчество КАК СТРОКА(1))) + "".""
		|		КОНЕЦ КАК ФИОКадровика,
		|		Ответственный.ФИООтветственного КАК ФИООтветственного,
		|		Ответственный.ДолжностьОтветственного КАК ДолжностьОтветственного, 
		|		ЕстьNULL(НеотфильтрованноеВремя.ВнутрисменныеОтклоненияЧасов, 0) КАК ВнутрисменныеОтклоненияЧасов
		|		ИЗ (
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|		ВТСотрудникДата.Организация Как Организация,
		|		ВТСотрудникДата.ПодразделениеОрганизации Как ПодразделениеОрганизации,
		|		ВТСотрудникДата.Должность,
		|		ВТСотрудникДата.Сотрудник Как Сотрудник,
		|		ВТСотрудникДата.СотрудникНаименование Как СотрудникНаименование,
		|		ВТСотрудникДата.ДатаТабеля КАК ДатаТабеля,
		|		ВЫБОР 
		|			КОГДА НЕ ВТРабочеВремя.ВидВремени ЕСТЬ NULL ТОГДА ВТРабочеВремя.ВидВремени
		|			КОГДА (НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL ) ТОГДА 
		|				ВЫБОР 
		|					КОГДА ВТОсновныеНачисления.ВидВремени В (&НочныеЧасы, &ВечерниеЧасы) 
		|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
		|						   NULL
		|					КОГДА НЕ ВТОсновныеНачисления.ПеречислениеВидВремени В (Значение(Перечисление.ВидыВремени.ЦелодневноеНеотработанное), Значение(Перечисление.ВидыВремени.ОтработанноеСверхНормы))
		|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
		|		   				   &Выходной
		|					ИНАЧЕ  ВТОсновныеНачисления.ВидВремени
		|				КОНЕЦ
		|			КОГДА НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL ТОГДА 
		|				ВЫБОР 
		|					КОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 
		|						ИЛИ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ ВТСостояниеСотрудников.ВидВремени
		|				КОНЕЦ
		|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
		|				ВЫБОР
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ &Явка
		|				КОНЕЦ
		|			КОГДА НЕ ГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
		|				ВЫБОР
		|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
		|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
		|					КОГДА ГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ &Явка
		|				КОНЕЦ
		|			ИНАЧЕ &Выходной
		|		КОНЕЦ КАК ВидВремени,
		|		ВЫБОР 
		|			КОГДА НЕ ВТОсновныеНачисления.ОтработаноЧасов ЕСТЬ NULL ТОГДА ВТОсновныеНачисления.ОтработаноЧасов
		|			КОГДА НЕ ВТРабочеВремя.Часов ЕСТЬ NULL ТОГДА ВТРабочеВремя.Часов
		|			КОГДА НЕ ГрафикПоОсновнымНачислениям.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоОсновнымНачислениям.ОсновноеЗначение
		|			КОГДА НЕ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение ЕСТЬ NULL ТОГДА ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение
		|			КОГДА НЕ ГрафикПоСостояниюСотрудников.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение
		|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение ЕСТЬ NULL ТОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение
		|			КОГДА НЕ ГрафикПоРаботникам.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоРаботникам.ОсновноеЗначение
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Часов,
		|		ВнутрисменныеОтклонения.ВидИспользованияРабочегоВремени КАК ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени,
		|		ВнутрисменныеОтклонения.Часов КАК ВнутрисменныеОтклоненияЧасов
		|	ИЗ ВТСотрудникДата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочеВремя
		|		ПО ВТРабочеВремя.Сотрудник = ВТСотрудникДата.Сотрудник
		|		И ВТРабочеВремя.ДатаТабеля = ВТСотрудникДата.ДатаТабеля
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиПериодами
		|		ПО ВТГрафикиПериодами.Сотрудник = ВТСотрудникДата.Сотрудник
		|		И ВТСотрудникДата.ДатаТабеля >= ВТГрафикиПериодами.ПериодНачало
		|		И ВТСотрудникДата.ДатаТабеля <= ВТГрафикиПериодами.ПериодКонец
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВнутрисменноеВремяРаботниковОрганизаций Как ВнутрисменныеОтклонения
		|		ПО ВнутрисменныеОтклонения.Сотрудник = ВТСотрудникДата.Сотрудник
		|		И ВнутрисменныеОтклонения.Период = ВТСотрудникДата.ДатаТабеля
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтфильтрованныеОсновныеНачисления Как ВТОсновныеНачисления
		|		ПО ВТСотрудникДата.Сотрудник = ВТОсновныеНачисления.Сотрудник
		|			И ВТСотрудникДата.ДатаТабеля = ВТОсновныеНачисления.ДатаТабеля
		|			И ВТОсновныеНачисления.ПеречислениеВидвремени <> ЗНАЧЕНИЕ(Перечисление.ВидыВремени.ОтработанноеСверхНормы)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоОсновнымНачислениям
		|		ПО ГрафикПоОсновнымНачислениям.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
		|		И ГрафикПоОсновнымНачислениям.Дата =  ВТСотрудникДата.ДатаТабеля
		|		И ВЫБОР 
		|			КОГДА ВТОсновныеНачисления.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
		|			КОГДА ВТОсновныеНачисления.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
		|			ИНАЧЕ &ПоЧасам 
		|		КОНЕЦ = ГрафикПоОсновнымНачислениям.ВидУчетаВремени
		|		И НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеСотрудников
		|		ПО ВТСотрудникДата.Сотрудник = ВТСостояниеСотрудников.Сотрудник
		|		И ВТСотрудникДата.ДатаТабеля >= ВТСостояниеСотрудников.ПериодНачало
		|		И ВТСотрудникДата.ДатаТабеля <= ВТСостояниеСотрудников.ПериодКонец
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныйГрафикПоСостояниюСотрудников
		|		ПО ИндивидуальныйГрафикПоСостояниюСотрудников.ГрафикРаботы = ВТСотрудникДата.Сотрудник
		|		И ИндивидуальныйГрафикПоСостояниюСотрудников.Дата =  ВТСотрудникДата.ДатаТабеля
		|		И ВЫБОР 
		|			КОГДА ВТСостояниеСотрудников.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
		|			КОГДА ВТСостояниеСотрудников.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
		|			ИНАЧЕ &ПоЧасам 
		|		КОНЕЦ = ИндивидуальныйГрафикПоСостояниюСотрудников.ВидУчетаВремени
		|		И НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL
		|		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоСостояниюСотрудников
		|		ПО ГрафикПоСостояниюСотрудников.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
		|		И ГрафикПоСостояниюСотрудников.Дата =  ВТСотрудникДата.ДатаТабеля
		|		И ВЫБОР
		|			КОГДА ВТСостояниеСотрудников.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
		|			КОГДА ВТСостояниеСотрудников.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
		|			ИНАЧЕ &ПоЧасам 
		|		КОНЕЦ = ГрафикПоСостояниюСотрудников.ВидУчетаВремени
		|		И НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL 
		|	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПриемы
		|		ПО РаботникиОрганизацийПриемы.Сотрудник = ВТСотрудникДата.Сотрудник
		|		И РаботникиОрганизацийПриемы.ПричинаИзмененияСостояния = &ПриемНаРаботу
		|		И РаботникиОрганизацийПриемы.Период <= ВТСотрудникДата.ДатаТабеля
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
		|		ПО РаботникиОрганизацийУвольнения.Сотрудник = ВТСотрудникДата.Сотрудник
		|		И РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныйГрафикПоРаботникам
		|		ПО ИндивидуальныйГрафикПоРаботникам.ГрафикРаботы = ВТСотрудникДата.Сотрудник
		|		И ИндивидуальныйГрафикПоРаботникам.Дата =  ВТСотрудникДата.ДатаТабеля
		|		И ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени <> &ПоДням
		|		И не((ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени В (&ПоВечернимЧасам,&ПоНочнымЧасам))
		|			И  (ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоРаботникам
		|		ПО ГрафикПоРаботникам.ГрафикРаботы = ВТГрафикиПериодами.ГрафикРаботы
		|		И ГрафикПоРаботникам.Дата =  ВТСотрудникДата.ДатаТабеля
		|		И ГрафикПоРаботникам.ВидУчетаВремени <> &ПоДням
		|		И ((ГрафикПоРаботникам.ВидУчетаВремени = ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени)
		|			ИЛИ (ИндивидуальныйГрафикПоРаботникам.ГрафикРаботы ЕСТЬ NULL))
		|		И не((ГрафикПоРаботникам.ВидУчетаВремени В (&ПоВечернимЧасам,&ПоНочнымЧасам))
		|			И  (ГрафикПоРаботникам.ОсновноеЗначение = 0))
		|	
		|	ГДЕ (РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL
		|	ИЛИ РаботникиОрганизацийУвольнения.Период > ВТСотрудникДата.ДатаТабеля)
		|	И   не
		|	(НЕ ВЫБОР 
		|			КОГДА НЕ ВТРабочеВремя.ВидВремени ЕСТЬ NULL ТОГДА ВТРабочеВремя.ВидВремени
		|			КОГДА НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL ТОГДА 
		|				ВЫБОР 
		|					КОГДА ВТОсновныеНачисления.ВидВремени В (&НочныеЧасы, &ВечерниеЧасы) 
		|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
		|						   NULL
		|					КОГДА ВТОсновныеНачисления.ПеречислениеВидВремени <> Значение(Перечисление.ВидыВремени.ЦелодневноеНеотработанное)
		|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
		|		   				   &Выходной
		|					ИНАЧЕ  ВТОсновныеНачисления.ВидВремени
		|				КОНЕЦ	
		|			КОГДА НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL ТОГДА 
		|				ВЫБОР 
		|					КОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 
		|						ИЛИ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ ВТСостояниеСотрудников.ВидВремени
		|				КОНЕЦ
		|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
		|				ВЫБОР
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
		|					КОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ &Явка
		|				КОНЕЦ
		|			КОГДА НЕ ГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
		|				ВЫБОР
		|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
		|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
		|					КОГДА ГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
		|					ИНАЧЕ &Явка
		|				КОНЕЦ
		|			ИНАЧЕ &Выходной
		|		КОНЕЦ В ( &Явка, &НочныеЧасы, &ВечерниеЧасы) 
		|		И
		|		ГрафикПоРаботникам.ВидУчетаВремени В (&ПоНочнымЧасам, &ПоВечернимЧасам) )
		|	) КАК НеотфильтрованноеВремя
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОРуководителя
		|		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо";
		Если ГруппироватьПодразделения тогда
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО НеотфильтрованноеВремя.ПодразделениеОрганизации = Руководитель.СтруктурнаяЕдиница";
		Иначе
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО НеотфильтрованноеВремя.Организация = Руководитель.СтруктурнаяЕдиница";
		КонецЕсли;
		ЗапросТабель.Текст = ЗапросТабель.Текст + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаОрганизации
		|		ПО РуководительКадровойСлужбыОрганизации.ФизическоеЛицо = ФИОКадровикаОрганизации.ФизЛицо
		|	ПО НеотфильтрованноеВремя.Организация = РуководительКадровойСлужбыОрганизации.СтруктурнаяЕдиница
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаПодразделения
		|		ПО РуководительКадровойСлужбыПодразделения.ФизическоеЛицо = ФИОКадровикаПодразделения.ФизЛицо
		|	ПО НеотфильтрованноеВремя.ПодразделениеОрганизации = РуководительКадровойСлужбыПодразделения.СтруктурнаяЕдиница "+?(НЕ ГруппироватьПодразделения, " И ЛОЖЬ", "")+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
		|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
		|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
		|					КОНЕЦ) КАК ДолжностьОтветственного,
		|					МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
		|				ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, Сотрудник.Физлицо = &Ответственный) КАК РаботникиОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственный
		|	ПО ИСТИНА
		|	ГДЕ НЕ НеотфильтрованноеВремя.ВидВремени Есть NULL
		|УПОРЯДОЧИТЬ ПО
		|	Организация, ПодразделениеОрганизации, СотрудникНаименование, Сотрудник, Должность, ДатаТабеля, ПолеСортировки";
		РезультатЗапроса = ЗапросТабель.Выполнить();
		ВыборкаПоРаботнику = РезультатЗапроса.Выбрать();
		
		СоответствиеЦелодневныхНевыходов = Новый Соответствие;
		СоответствиеЦелодневныхНевыходовЧасы = Новый Соответствие;
		
		// Выводим информационное сообщение, если табель формируется "вперед"
		Если РабочаяДата < КонецМесяца(ДатаНач) Тогда
			ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
			ОбработкаКомментариев.УдалитьСообщения();
			ОбработкаКомментариев.ДобавитьСообщение("Формирование табеля за неоконченный месяц", Перечисления.ВидыСообщений.Раздел);
			ОбработкаКомментариев.ДобавитьСообщение("При формировании табеля за будущий или текущий месяц, выводятся данные только до рабочей даты (" + Формат(РабочаяДата, "ДЛФ=ДД") + "). Изменить рабочую дату можно в меню ""Сервис/Параметры.""", Перечисления.ВидыСообщений.Информация);
			ОбработкаКомментариев.ПоказатьСообщения();
		КонецЕсли;
		
		Если ГруппироватьПодразделения Тогда
			
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ПодразделениеОрганизации") Цикл
					Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					НомерПП = 0;
					ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
					ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
					ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
					
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
							
							НомерПП = НомерПП + 1;
							
							ДниПерваяПоловина  = 0;
							ЧасыПерваяПоловина = 0;
							ДниВтораяПоловина  = 0;
							ЧасыВтораяПоловина = 0;
							
							Для Сч = 1 По ПараметровВстроке Цикл
								ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
							КонецЦикла;
							СоответствиеЦелодневныхНевыходов.Очистить();
							СоответствиеЦелодневныхНевыходовЧасы.Очистить();
							
							ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
							ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
							ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
							//ОбластьДанныхПодвал.
							
							
							Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ДатаТабеля") Цикл
								
								СимволДня = ""; ОтработаноЧасовЗаДень = 0;
								ОтработаноЧасовЗаДеньСтр = "";
								НомерДня = Строка(День(ВыборкаПоРаботнику.ДатаТабеля));
								ПерваяПоловина = День(ВыборкаПоРаботнику.ДатаТабеля) <= 15;
								УчитыватьВыходнойДень = Истина;
								
								Пока ВыборкаПоРаботнику.Следующий() Цикл
									Если  ВыборкаПоРаботнику.ВидВремени = ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени Тогда
										ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов;
										Продолжить;
									КонецЕсли;
									
									Если ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
										УчитыватьВыходнойДень = Ложь;
									ИначеЕсли ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни И НЕ УчитыватьВыходнойДень Тогда
										Продолжить;
									КонецЕсли;
									
									БуквенныйКод = ВыборкаПоРаботнику.ВидВремени.БуквенныйКод;
									СимволДня = СимволДня + "/" + БуквенныйКод;
									// Обработка внутрисменных отклонений
									Если ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени <> NULL 
										И ВыборкаПоРаботнику.ВидВремени.РабочееВремя
										И НЕ(ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы
										ИЛИ ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда
										
										ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.Часов;
										ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень - ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов;
										БуквенныйКод = ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени.БуквенныйКод;
										СимволДня = СимволДня + "/" + БуквенныйКод;
										ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов - ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов) + "/" + Строка(ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов);
										
										Если СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод) = Неопределено Тогда
											СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод, 0);
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов);
										Иначе
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод,  ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов + СоответствиеЦелодневныхНевыходовЧасы.Получить(БуквенныйКод));
										КонецЕсли;
										
									ИначеЕсли НЕ(ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы
										ИЛИ ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) 
										И ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
										
										ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.Часов;
										ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
									ИначеЕсли ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
										ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
									КонецЕсли;
									
									Если (НЕ ВыборкаПоРаботнику.ВидВремени.РабочееВремя)
										И (ВыборкаПоРаботнику.ВидВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)Тогда
										Если  СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод) = Неопределено Тогда
											СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1);
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов);
										Иначе
											СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1 + СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод));
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов + СоответствиеЦелодневныхНевыходовЧасы.Получить(БуквенныйКод));
										КонецЕсли;
									КонецЕсли;
									
								КонецЦикла;	
								СимволДня = Сред(СимволДня, 2);
								ОтработаноЧасовЗаДеньСтр = Сред(ОтработаноЧасовЗаДеньСтр, 2);
								ОбластьДанныхСтрока.Параметры["Символ"+НомерДня] = СимволДня;
								ОбластьДанныхСтрока.Параметры["ДополнительноеЗначение"+НомерДня] = Формат(ОтработаноЧасовЗаДеньСтр);
								
								Если ОтработаноЧасовЗаДень <> 0 Тогда
									Если ПерваяПоловина Тогда
										ДниПерваяПоловина = ДниПерваяПоловина + 1;
										ЧасыПерваяПоловина = ЧасыПерваяПоловина + ОтработаноЧасовЗаДень
									Иначе
										ДниВтораяПоловина = ДниВтораяПоловина + 1;
										ЧасыВтораяПоловина = ЧасыВтораяПоловина + ОтработаноЧасовЗаДень
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
							//	заполняем раздел "Отработано за"
							ОбластьДанныхСтрока.Параметры.ДниПерваяПоловина  = ДниПерваяПоловина;
							ОбластьДанныхСтрока.Параметры.ЧасыПерваяПоловина = ЧасыПерваяПоловина;
							ОбластьДанныхСтрока.Параметры.ДниВтораяПоловина  = ДниВтораяПоловина;
							ОбластьДанныхСтрока.Параметры.ЧасыВтораяПоловина = ЧасыВтораяПоловина;
							ОбластьДанныхСтрока.Параметры.ДниЗаМесяц  = ДниПерваяПоловина + ДниВтораяПоловина;
							ОбластьДанныхСтрока.Параметры.ЧасыЗаМесяц = ЧасыПерваяПоловина + ЧасыВтораяПоловина;
							
							// заполняем раздел "Неявки по причинам"
							СчНеявок = 0;
							Для каждого Элемент Из СоответствиеЦелодневныхНевыходов Цикл
								Если (Элемент.Значение > 0) ИЛИ СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ) > 0 Тогда
									СчНеявок = СчНеявок + 1;
									ОбластьДанныхСтрока.Параметры["НеявкаКод" + Строка(СчНеявок)] = Элемент.Ключ;
									КоличествоЧасов = Строка(СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ));
									Если КоличествоЧасов <> 0 Тогда
										ОбластьДанныхСтрока.Параметры["НеявкаДниЧасы" + Строка(СчНеявок)] = Формат(Элемент.Значение) + "(" + КоличествоЧасов + ")";
									Иначе
										ОбластьДанныхСтрока.Параметры["НеявкаДниЧасы" + Строка(СчНеявок)] = Формат(Элемент.Значение);
									КонецЕсли;
								КонецЕсли;
							КонецЦикла; 
							
							// Проверим, уместится ли строка на странице или надо открывать новую страницу
							Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
							КонецЕсли;
							
							ДокументРезультат.Вывести(ОбластьДанныхСтрока);
							
						КонецЦикла;
					КонецЦикла;
					Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
						ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
						ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				КонецЦикла;
				
			КонецЦикла;	
			
		Иначе
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				НомерПП = 0;
				ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
				ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
				ОбластьДанныхШапка.Параметры.ИмяПодразделения = "";
				ОбластьДанныхШапка.Параметры.ДатаЗаполнения = ДатаЗаполнения;
				ОбластьДанныхШапка.Параметры.НомерДокумента = НомерДокумента;
				ДокументРезультат.Вывести(ОбластьДанныхШапка);
				ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
						
						НомерПП = НомерПП + 1;
						
						ДниПерваяПоловина  = 0;
						ЧасыПерваяПоловина = 0;
						ДниВтораяПоловина  = 0;
						ЧасыВтораяПоловина = 0;
						
						Для Сч = 1 По ПараметровВстроке Цикл
							ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
						КонецЦикла;
						СоответствиеЦелодневныхНевыходов.Очистить();
						СоответствиеЦелодневныхНевыходовЧасы.Очистить();
						
						ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
						ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
						ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
						ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
						
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ДатаТабеля") Цикл
							
							СимволДня = ""; ОтработаноЧасовЗаДень = 0;
							ОтработаноЧасовЗаДеньСтр = "";
							НомерДня = Строка(День(ВыборкаПоРаботнику.ДатаТабеля));
							ПерваяПоловина = День(ВыборкаПоРаботнику.ДатаТабеля) <= 15;
							УчитыватьВыходнойДень = Истина;
							
							Пока ВыборкаПоРаботнику.Следующий() Цикл
								Если  ВыборкаПоРаботнику.ВидВремени = ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени Тогда
									ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов;
									Продолжить;
								КонецЕсли;
								
								Если ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
									УчитыватьВыходнойДень = Ложь;
								ИначеЕсли ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни И НЕ УчитыватьВыходнойДень Тогда
									Продолжить;
								КонецЕсли;
								
								БуквенныйКод = ВыборкаПоРаботнику.ВидВремени.БуквенныйКод;
								СимволДня = СимволДня + "/" + БуквенныйКод;
								// Обработка внутрисменных отклонений
								Если ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени <> NULL 
									И ВыборкаПоРаботнику.ВидВремени.РабочееВремя
									И НЕ(ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы
									ИЛИ ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) Тогда
									
									ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.Часов;
									ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень - ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов;
									БуквенныйКод = ВыборкаПоРаботнику.ВнутрисменныеОтклоненияВидИспользованияРабочегоВремени.БуквенныйКод;
									СимволДня = СимволДня + "/" + БуквенныйКод;
									ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов - ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов) + "/" + Строка(ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов);
																			
									Если СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод) = Неопределено Тогда
										СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод, 0);
										СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов);
									Иначе
										СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод,  ВыборкаПоРаботнику.ВнутрисменныеОтклоненияЧасов + СоответствиеЦелодневныхНевыходовЧасы.Получить(БуквенныйКод));
									КонецЕсли;
									
								ИначеЕсли НЕ(ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаВечерниеЧасы
									ИЛИ ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы) 
									И ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
									
									ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.Часов;
									ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
								ИначеЕсли ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
									ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
								КонецЕсли;
								
								Если (НЕ ВыборкаПоРаботнику.ВидВремени.РабочееВремя)
									И (ВыборкаПоРаботнику.ВидВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)Тогда
									Если  СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод) = Неопределено Тогда
										СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1);
										СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов);
									Иначе
										СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1 + СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод));
										СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов + СоответствиеЦелодневныхНевыходовЧасы.Получить(БуквенныйКод));
									КонецЕсли;
								КонецЕсли;
								
							КонецЦикла;	
							СимволДня = Сред(СимволДня, 2);
							ОтработаноЧасовЗаДеньСтр = Сред(ОтработаноЧасовЗаДеньСтр, 2);
							ОбластьДанныхСтрока.Параметры["Символ"+НомерДня] = СимволДня;
							ОбластьДанныхСтрока.Параметры["ДополнительноеЗначение"+НомерДня] = Формат(ОтработаноЧасовЗаДеньСтр);
							
							Если ОтработаноЧасовЗаДень <> 0 Тогда
								Если ПерваяПоловина Тогда
									ДниПерваяПоловина = ДниПерваяПоловина + 1;
									ЧасыПерваяПоловина = ЧасыПерваяПоловина + ОтработаноЧасовЗаДень
								Иначе
									ДниВтораяПоловина = ДниВтораяПоловина + 1;
									ЧасыВтораяПоловина = ЧасыВтораяПоловина + ОтработаноЧасовЗаДень
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						//	заполняем раздел "Отработано за"
						ОбластьДанныхСтрока.Параметры.ДниПерваяПоловина  = ДниПерваяПоловина;
						ОбластьДанныхСтрока.Параметры.ЧасыПерваяПоловина = ЧасыПерваяПоловина;
						ОбластьДанныхСтрока.Параметры.ДниВтораяПоловина  = ДниВтораяПоловина;
						ОбластьДанныхСтрока.Параметры.ЧасыВтораяПоловина = ЧасыВтораяПоловина;
						ОбластьДанныхСтрока.Параметры.ДниЗаМесяц  = ДниПерваяПоловина + ДниВтораяПоловина;
						ОбластьДанныхСтрока.Параметры.ЧасыЗаМесяц = ЧасыПерваяПоловина + ЧасыВтораяПоловина;
						
						// заполняем раздел "Неявки по причинам"
						СчНеявок = 0;
						Для каждого Элемент Из СоответствиеЦелодневныхНевыходов Цикл
							Если (Элемент.Значение > 0) ИЛИ СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ) > 0 Тогда
								СчНеявок = СчНеявок + 1;
								ОбластьДанныхСтрока.Параметры["НеявкаКод" + Строка(СчНеявок)] = Элемент.Ключ;
								КоличествоЧасов = Строка(СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ));
								Если КоличествоЧасов <> 0 Тогда
									ОбластьДанныхСтрока.Параметры["НеявкаДниЧасы" + Строка(СчНеявок)] = формат(Элемент.Значение) + "(" + КоличествоЧасов + ")";
								Иначе
									ОбластьДанныхСтрока.Параметры["НеявкаДниЧасы" + Строка(СчНеявок)] = формат(Элемент.Значение);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла; 
						
						// Проверим, уместится ли строка на странице или надо открывать новую страницу
						Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						КонецЕсли;
						
						ДокументРезультат.Вывести(ОбластьДанныхСтрока);
						
					КонецЦикла;
				КонецЦикла;
				Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
					ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
					ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
				КонецЕсли;
				ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				
			КонецЦикла;
		КонецЕсли;
		
//толик		
	ИначеЕсли Режим = "График" Тогда
		Макет = ПолучитьМакет("График");
		
		ОбластьДанныхШапка 		= Макет.ПолучитьОбласть("Шапка");
		ОбластьДанныхКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
		ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("Строка");
		ОбластьДанныхПодвал		= Макет.ПолучитьОбласть("Подвал");
		
		ОбластьДанныхШапка.Параметры.ДатаНач     = ДатаНач;
		ОбластьДанныхШапка.Параметры.ДатаКон     = КонецМесяца(ДатаНач);
		
		//заполним ответсвенных в документе
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,
		|	Руководитель.Должность КАК ДолжностьРуководителя,
		|	ФИОКадровика.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровика.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровика.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОКадровика,
		|	РуководительКадровойСлужбы.Должность КАК ДолжностьКадровика,
		|	Ответственноый.ФИООтветственного,
		|	Ответственноый.ДолжностьОтветственного
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&ДатаСреза,
		|			СтруктурнаяЕдиница = &Подразделение
		|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководителя
		|		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|				&ДатаСреза,
		|				СтруктурнаяЕдиница = &Организация
		|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадровика
		|			ПО РуководительКадровойСлужбы.ФизическоеЛицо = ФИОКадровика.ФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &ДатаСреза
		|								И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
		|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
		|					КОНЕЦ) КАК ДолжностьОтветственного,
		|				МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
		|			ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСреза, Сотрудник.Физлицо = &ФизЛицо) КАК РаботникиОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛицСрезПоследних
		|					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственноый
		|			ПО (ИСТИНА)
		|		ПО (ИСТИНА)");
		
		Запрос.УстановитьПараметр("ДатаСреза",         КонецМесяца(ДатаНач));
		Если Подразделение <> Неопределено тогда
			Запрос.УстановитьПараметр("Подразделение",     Организация);
		Иначе
			Запрос.УстановитьПараметр("Подразделение",     Подразделение);
		КонецЕсли;
		Запрос.УстановитьПараметр("Организация",       Организация);
		Если ОтветственноеЛицо <> Неопределено тогда           
			Запрос.УстановитьПараметр("ФизЛицо", ОтветственноеЛицо.ФизЛицо);
		Иначе
			Запрос.УстановитьПараметр("ФизЛицо", Неопределено);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			ОбластьДанныхПодвал.Параметры.Заполнить(Выборка);
		КонецЕсли;
		
		ПараметровВстроке = ОбластьДанныхСтрока.Параметры.Количество();
		
		// Запрос сотрудников
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Имя = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|		КОНЕЦ, РаботникиОрганизаций.Сотрудник.Физлицо.Наименование) КАК СотрудникНаименование,
		|	ДолжностиРаботников.ОбособленноеПодразделение КАК Организация,
		|	ПОДСТРОКА(ДолжностиРаботников.ОбособленноеПодразделение.НаименованиеПолное, 1, 250) КАК ИмяОрганизации,
		|	ДолжностиРаботников.ОбособленноеПодразделение.КодПоОКПО КАК КодПоОКПО,
		|	ДолжностиРаботников.Должность.Наименование КАК Должность,
		|	Руководитель.Должность КАК ДолжностьРуководителя,
		|	ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,		
		|	ЕСТЬNULL(РуководительКадровойСлужбыПодразделения.Должность, РуководительКадровойСлужбыОрганизации.Должность) КАК ДолжностьКадровика,
		|	ВЫБОР КОГДА ФИОКадровикаПодразделения.Фамилия ЕСТЬ NULL 
		|	ТОГДА ФИОКадровикаОрганизации.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Отчество КАК СТРОКА(1))) + "".""
		|	ИНАЧЕ ФИОКадровикаПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Отчество КАК СТРОКА(1))) + "".""
		|	КОНЕЦ КАК ФИОКадровика,
		|	Ответственный.ФИООтветственного КАК ФИООтветственного,
		|	Ответственный.ДолжностьОтветственного КАК ДолжностьОтветственного, 
		|	ДолжностиРаботников.ПодразделениеОрганизации,
		|	ДолжностиРаботников.ПодразделениеОрганизации.Наименование КАК ИмяПодразделения
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизаций.Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период > &НачалоПериода
		|		И РаботникиОрганизаций.Период < &КонецПериода
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&КонецПериода,
		|		ФизЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				СотрудникиОрганизаций.Физлицо
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ГДЕ
		|				ИСТИНА" + ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации)," И " + СтрЗаменить(УсловиеПоРаботникам,"Сотрудник","Ссылка")) + ")) КАК ФИОФизЛицСрезПоследних
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК ДолжностиРаботников
		|		ПО ДолжностиРаботников.Сотрудник = РаботникиОрганизаций.Сотрудник
		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОРуководителя
		|		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо";
		Если ГруппироватьПодразделения тогда
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ПодразделениеОрганизации = Руководитель.СтруктурнаяЕдиница";
		Иначе
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ОбособленноеПодразделение = Руководитель.СтруктурнаяЕдиница";
		КонецЕсли;
		ЗапросТабель.Текст = ЗапросТабель.Текст + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаОрганизации
		|		ПО РуководительКадровойСлужбыОрганизации.ФизическоеЛицо = ФИОКадровикаОрганизации.ФизЛицо
		|	ПО ДолжностиРаботников.ОбособленноеПодразделение = РуководительКадровойСлужбыОрганизации.СтруктурнаяЕдиница
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаПодразделения
		|		ПО РуководительКадровойСлужбыПодразделения.ФизическоеЛицо = ФИОКадровикаПодразделения.ФизЛицо
		|	ПО ДолжностиРаботников.ПодразделениеОрганизации = РуководительКадровойСлужбыПодразделения.СтруктурнаяЕдиница "+?(НЕ ГруппироватьПодразделения, " И ЛОЖЬ", "")+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
		|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
		|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
		|					КОНЕЦ) КАК ДолжностьОтветственного,
		|					МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
		|				ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, Сотрудник.Физлицо = &Ответственный) КАК РаботникиОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственный
		|	ПО ИСТИНА
		
		|ГДЕ
		|	ИСТИНА" + УсловиеВЗапрос + "
		|	
		|УПОРЯДОЧИТЬ ПО
		|	Организация, " + ПорядокГруппировки + " СотрудникНаименование, Сотрудник";
		
		ВыборкаПоРаботнику = ЗапросТабель.Выполнить().Выбрать();
		
		Если ГруппироватьПодразделения Тогда
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ПодразделениеОрганизации") Цикл
					
					Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					НомерПП = 0;
					ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
					ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
					ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
					
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
							
							НомерПП = НомерПП + 1;
							
							ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
							ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
							ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
							
							Для мС = 1 По День(КонецМесяца(ДатаНач)) Цикл
								мДата = Дата(Год(ДатаНач), Месяц(ДатаНач), мС, 0, 0, 0);
								мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
										Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
											ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
								ОбластьДанныхСтрока.Параметры["ДополнительноеЗначение"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
							КонецЦикла;
							
							// Проверим, уместится ли строка на странице или надо открывать новую страницу
							Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
							КонецЕсли;
							ДокументРезультат.Вывести(ОбластьДанныхСтрока);
							
						КонецЦикла; 
					КонецЦикла; 
					Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
						ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
						ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьДанныхПодвал);
					
				КонецЦикла; 
			КонецЦикла; 
		Иначе
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				НомерПП = 0;
				ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
				ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
				ОбластьДанныхШапка.Параметры.ИмяПодразделения = "";
				ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
				ДокументРезультат.Вывести(ОбластьДанныхШапка);
				ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
						
						НомерПП = НомерПП + 1;
						
						ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
						ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
						ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
						Для мС = 1 По День(КонецМесяца(ДатаНач)) Цикл
							мДата = Дата(Год(ДатаНач), Месяц(ДатаНач), мС, 0, 0, 0);
							мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
								Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
									ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							ОбластьДанныхСтрока.Параметры["ДополнительноеЗначение"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
						КонецЦикла;
						
						// Проверим, уместится ли строка на странице или надо открывать новую страницу
						Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						КонецЕсли;
						ДокументРезультат.Вывести(ОбластьДанныхСтрока);
						
					КонецЦикла; 
				КонецЦикла; 
				Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
					ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
					ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
				КонецЕсли;
				ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				
			КонецЦикла; 
		КонецЕсли;
		
		Если ДокументРезультат.ВысотаТаблицы = 0 Тогда
			
			Если ОтборОрганизации и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(Организация.НаименованиеПолное);
				ОбластьДанныхШапка.Параметры.КодПоОКПО = Организация.КодПоОКПО;
			КонецЕсли;
			Если ОтборПодразделения и ТипЗнч(Организация) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				ОбластьДанныхШапка.Параметры.ИмяПодразделения = Подразделение.Наименование;
			КонецЕсли;
			
			ОбластьДанныхСтрока.Параметры.Работник = " " + Символы.ПС + " ";
			ВыводимыеОбласти = Новый Массив();
			ВыводимыеОбласти.Добавить(ОбластьДанныхСтрока);
			ВыводимыеОбласти.Добавить(ОбластьДанныхПодвал);
			ДокументРезультат.Вывести(ОбластьДанныхШапка);
			ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
			Для Сч = 1 По ПараметровВстроке Цикл
				ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
			КонецЦикла;
			Пока ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти) Цикл
				ДокументРезультат.Вывести(ОбластьДанныхСтрока);
			КонецЦикла;
			ДокументРезультат.Вывести(ОбластьДанныхПодвал);
		КонецЕсли;
		
	ИначеЕсли Режим = "ГрафикНовыйТ" или Режим = "ГрафикНовыйНТ" или Режим = "ГрафикНовыйИ" или Режим = "ГрафикНовыйНИ" Тогда
		Если Режим = "ГрафикНовыйТ" или Режим = "ГрафикНовыйНТ" Тогда 
			СпособСортировки = "ТабельныйНомер";
		иначе
			СпособСортировки = "Наименование";
		КонецЕсли;
		Если Режим = "ГрафикНовыйТ" или Режим = "ГрафикНовыйИ" Тогда 
			Режим = "ГрафикНовый";			
		иначе
			Режим = "ГрафикНовыйН";
		КонецЕсли;		
		
		Макет = ПолучитьМакет("МакетГрафик");
  
		ОбластьДанныхЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		
		ОбластьДанныхШапка 		= Макет.ПолучитьОбласть("Шапка|ДниЧасть1");
		ОбластьДанныхШапка2 		= Макет.ПолучитьОбласть("Шапка|ДниЧасть2");
		//О.Т. Аверсон 25.05.2017 № 671
		ОбластьДанныхШапка3 		= Макет.ПолучитьОбласть("Шапка|ДниЧасть3");
		ОбластьДанныхШапкаВр 		= Макет.ПолучитьОбласть("Шапка|ДниЧастьВредность");
		//О.Т. Аверсон 25.05.2017 № 671
		ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
		если Режим = "ГрафикНовыйН" Тогда
			ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть1");
			ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть2");
			//О.Т. Аверсон 25.05.2017 № 671
			ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть3");
			ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧастьВредность");
			//О.Т. Аверсон 25.05.2017 № 671
			ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
		иначе
			ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть1");
			ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть2");
			//О.Т. Аверсон 25.05.2017 № 671
			ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть3");
			ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧастьВредность");
			//О.Т. Аверсон 25.05.2017 № 671
			ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
			
		КонецЕсли;
		ОбластьДанныхИтог		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧасть1");
		ОбластьДанныхИтог2		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧасть2");
		//О.Т. Аверсон 25.05.2017 № 671
		ОбластьДанныхИтог3		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧасть3");
		ОбластьДанныхИтогВр		= Макет.ПолучитьОбласть("ИтогСтрока|ДниЧастьВредность");
		//О.Т. Аверсон 25.05.2017 № 671
		ОбластьДанныхИтогДоп	= Макет.ПолучитьОбласть("ИтогСтрока|ДниПлав");
		
		ОбластьДанныхПодвал		= Макет.ПолучитьОбласть("Подвал");
		
		ОбластьДанныхЗаголовок.Параметры.Период    = Формат(ДатаНач,"ДФ=""дд.ММ.гггг""");
		ОбластьДанныхЗаголовок.Параметры.Год    =  Формат(ДатаНач,"ДФ=гггг");
		//заполним ответсвенных в документе
		если ЗначениеЗаполнено(Подразделение) Тогда 
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ФИОРукПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРукПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРукПодразделения.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРукПодразделения,
			|	РуководительПодразделения.Должность,
			|	ФИОКадры.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадры.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадры.Отчество КАК СТРОКА(1))) + ""."" КАК СотрудникКадры,
			|	ОрганизацииОтветственныеЛица.Должность КАК ДолжностьКадры,
			|	ФИОРуководитель.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководитель.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководитель.Отчество КАК СТРОКА(1))) + ""."" КАК Руководитель,
			|	ОтветственныеЛицаРуководитель.Должность КАК ДолжностьДиректор
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
			|				&ДатаСреза,
			|				СтруктурнаяЕдиница = &Подразделение1
			|					И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения)) КАК РуководительПодразделения
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРукПодразделения
			|			ПО РуководительПодразделения.ФизическоеЛицо = ФИОРукПодразделения.ФизЛицо
			|		ПО ПодразделенияОрганизаций.Ссылка = РуководительПодразделения.СтруктурнаяЕдиница
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОтветственныеЛицаРуководитель
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководитель
			|				ПО ОтветственныеЛицаРуководитель.Сотрудник.Физлицо = ФИОРуководитель.ФизЛицо
			|			ПО Организации.Ссылка = ОтветственныеЛицаРуководитель.Ссылка
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации1
			|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадры
			|					ПО ОрганизацииОтветственныеЛица.Сотрудник.Физлицо = ФИОКадры.ФизЛицо
			|				ПО Организации1.Ссылка = ОрганизацииОтветственныеЛица.Ссылка
			|			ПО Организации.Ссылка = Организации1.Ссылка
			|		ПО ПодразделенияОрганизаций.Владелец = Организации.Ссылка
			|ГДЕ
			|	ПодразделенияОрганизаций.Ссылка = &Подразделение1
			|	И ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.СпециалистКадровойСлужбы)
			|	И Организации.Ссылка = &Организация
			|	И ОтветственныеЛицаРуководитель.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)");
		иначе
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ФИОКадры.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадры.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадры.Отчество КАК СТРОКА(1))) + ""."" КАК СотрудникКадры,
			|	ОрганизацииОтветственныеЛица.Должность КАК ДолжностьКадры,
			|	ФИОРуководитель.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководитель.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководитель.Отчество КАК СТРОКА(1))) + ""."" КАК Руководитель,
			|	ОтветственныеЛицаРуководитель.Должность КАК ДолжностьДиректор
			|ИЗ
			|	Справочник.Организации КАК Организации
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОтветственныеЛицаРуководитель
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОРуководитель
			|			ПО ОтветственныеЛицаРуководитель.Сотрудник.Физлицо = ФИОРуководитель.ФизЛицо
			|		ПО Организации.Ссылка = ОтветственныеЛицаРуководитель.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации1
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ОтветственныеЛица КАК ОрганизацииОтветственныеЛица
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОКадры
			|				ПО ОрганизацииОтветственныеЛица.Сотрудник.Физлицо = ФИОКадры.ФизЛицо
			|			ПО Организации1.Ссылка = ОрганизацииОтветственныеЛица.Ссылка
			|		ПО Организации.Ссылка = Организации1.Ссылка
			|ГДЕ
			|	ОрганизацииОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.СпециалистКадровойСлужбы)
			|	И Организации.Ссылка = &Организация
			|	И ОтветственныеЛицаРуководитель.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)");
		КонецЕсли;

		
		Запрос.УстановитьПараметр("ДатаСреза",         КонецМесяца(ДатаНач));
		Если Подразделение <> Неопределено тогда
			Запрос.УстановитьПараметр("Подразделение",     Организация);
		Иначе
			Запрос.УстановитьПараметр("Подразделение",     Подразделение);
		КонецЕсли;
		Запрос.УстановитьПараметр("Подразделение1",     Подразделение);
		Запрос.УстановитьПараметр("Организация",       Организация);
		Если ОтветственноеЛицо <> Неопределено тогда           
			Запрос.УстановитьПараметр("ФизЛицо", ОтветственноеЛицо.ФизЛицо);
		Иначе
			Запрос.УстановитьПараметр("ФизЛицо", Неопределено);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			ОбластьДанныхПодвал.Параметры.Заполнить(Выборка);
			ОбластьДанныхЗаголовок.Параметры.Заполнить(Выборка);
		КонецЕсли;
		
		ПараметровВстроке = ОбластьДанныхСтрока.Параметры.Количество();
		
		ЗапросТабель.УстановитьПараметр("РаботникиОрганизации", Работник);
		
		если УсловиеПоРаботникам = "" Тогда 
			Если ВидСравненияРаботника = ВидСравнения.Равно Тогда
				ВидСравненияРаботник = "=" 
			ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеРавно Тогда
				ВидСравненияРаботник = "<>"
			ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСписке Тогда
				ВидСравненияРаботник = "В"
			ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеВСписке Тогда
				ВидСравненияРаботник = "НЕ В"
			ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСпискеПоИерархии ИЛИ
				ВидСравненияРаботника = ВидСравнения.ВИерархии Тогда
				ВидСравненияРаботник = "В ИЕРАРХИИ"
			ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеВСпискеПоИерархии ИЛИ
				ВидСравненияРаботника = ВидСравнения.НеВИерархии Тогда
				ВидСравненияРаботник = "НЕ В ИЕРАРХИИ"
			КонецЕсли;
			
			Если ВидСравненияРаботник = "=" ИЛИ ВидСравненияРаботник = "<>" Тогда
				УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + " &РаботникиОрганизации";
			Иначе
				УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + "(&РаботникиОрганизации)";
			КонецЕсли;
		КонецЕсли;

		// Запрос сотрудников
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Имя = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|		КОНЕЦ, РаботникиОрганизаций.Сотрудник.Физлицо.Наименование) КАК СотрудникНаименование,
		|	ДолжностиРаботников.ОбособленноеПодразделение КАК Организация,
		|	ПОДСТРОКА(ДолжностиРаботников.ОбособленноеПодразделение.НаименованиеПолное, 1, 250) КАК ИмяОрганизации,
		|	ДолжностиРаботников.ОбособленноеПодразделение.КодПоОКПО КАК КодПоОКПО,
		|	ДолжностиРаботников.Должность.Наименование КАК Должность,
		|	Руководитель.Должность КАК ДолжностьРуководителя,
		|	ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,		
		|	ЕСТЬNULL(РуководительКадровойСлужбыПодразделения.Должность, РуководительКадровойСлужбыОрганизации.Должность) КАК ДолжностьКадровика,
		|	ВЫБОР КОГДА ФИОКадровикаПодразделения.Фамилия ЕСТЬ NULL 
		|	ТОГДА ФИОКадровикаОрганизации.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Отчество КАК СТРОКА(1))) + "".""
		|	ИНАЧЕ ФИОКадровикаПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Отчество КАК СТРОКА(1))) + "".""
		|	КОНЕЦ КАК ФИОКадровика,
		|	Ответственный.ФИООтветственного КАК ФИООтветственного,
		|	Ответственный.ДолжностьОтветственного КАК ДолжностьОтветственного, 
		|	ДолжностиРаботников.ПодразделениеОрганизации,
		|	ДолжностиРаботников.ПодразделениеОрганизации.Наименование КАК ИмяПодразделения
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизаций.Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период > &НачалоПериода
		|		И РаботникиОрганизаций.Период < &КонецПериода
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&КонецПериода,
		|		ФизЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				СотрудникиОрганизаций.Физлицо
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ГДЕ
		|				ИСТИНА" + ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации)," И " + СтрЗаменить(УсловиеПоРаботникам,"Сотрудник","Ссылка")) + ")) КАК ФИОФизЛицСрезПоследних
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК ДолжностиРаботников
		|		ПО ДолжностиРаботников.Сотрудник = РаботникиОрганизаций.Сотрудник
		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОРуководителя
		|		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо";
		Если ГруппироватьПодразделения тогда
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ПодразделениеОрганизации = Руководитель.СтруктурнаяЕдиница";
		Иначе
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ОбособленноеПодразделение = Руководитель.СтруктурнаяЕдиница";
		КонецЕсли;
		Если СпособСортировки = "Наименование" Тогда 
			СортировкаИзФормы = " СотрудникНаименование, Сотрудник";
		иначе
			СортировкаИзФормы = " ТабельныйНомер";
		КонецЕсли;
		
		ЗапросТабель.Текст = ЗапросТабель.Текст + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаОрганизации
		|		ПО РуководительКадровойСлужбыОрганизации.ФизическоеЛицо = ФИОКадровикаОрганизации.ФизЛицо
		|	ПО ДолжностиРаботников.ОбособленноеПодразделение = РуководительКадровойСлужбыОрганизации.СтруктурнаяЕдиница
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаПодразделения
		|		ПО РуководительКадровойСлужбыПодразделения.ФизическоеЛицо = ФИОКадровикаПодразделения.ФизЛицо
		|	ПО ДолжностиРаботников.ПодразделениеОрганизации = РуководительКадровойСлужбыПодразделения.СтруктурнаяЕдиница "+?(НЕ ГруппироватьПодразделения, " И ЛОЖЬ", "")+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
		|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
		|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
		|					КОНЕЦ) КАК ДолжностьОтветственного,
		|					МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
		|				ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, Сотрудник.Физлицо = &Ответственный) КАК РаботникиОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственный
		|	ПО ИСТИНА
		
		|ГДЕ
		|	ИСТИНА" + УсловиеВЗапрос + "
		|	
		|УПОРЯДОЧИТЬ ПО
		|	Организация, " + ПорядокГруппировки + СортировкаИзФормы + "";
		
				
		ВыборкаПоРаботнику = ЗапросТабель.Выполнить().Выбрать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		|	РегламентированныйПроизводственныйКалендарь.ВидДня
		|ИЗ
		|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|ГДЕ
		|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаКалендаря И &ДатаКалендаря1
		|	И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
		|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье)
		|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник))";
		
		Запрос.УстановитьПараметр("ДатаКалендаря", НачалоМесяца(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКалендаря1", КонецМесяца(ДатаНач));

		Результат = Запрос.Выполнить();
		
		ВидПоКалендарю = Результат.Выгрузить();
		для Каждого СтрДата из ВидПоКалендарю Цикл 
			День = День(СтрДата.ДатаКалендаря);
			если День >= 29 и День <= День(КонецМесяца(ДатаНач)) Тогда 
				ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
				ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
			ИначеЕсли День <= День(КонецМесяца(ДатаНач)) Тогда 
				ОбластьД = ОбластьДанныхШапка.Область(2,День+3,2,День+3); 
				ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;
			
		КонецЦикла;
		СтокаВыведена = Ложь;

		
		
		Если ГруппироватьПодразделения Тогда
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ПодразделениеОрганизации") Цикл
					
					Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					НомерПП = 0;
					ОбластьДанныхЗаголовок.Параметры.Заполнить(ВыборкаПоРаботнику);
					ОбластьДанныхЗаголовок.Параметры.Организация = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
					ОбластьДанныхЗаголовок.Параметры.Подразделение = СОКРЛП(Подразделение);
					ОбластьДанныхЗаголовок.Параметры.Год    =  Формат(ДатаНач,"ДФ=гггг");
					ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
					ДокументРезультат.Вывести(ОбластьДанныхЗаголовок);
					
					ДниДобавить = День(КонецМесяца(ДатаНач))-28;
					ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
					ОбластьД.Объединить();
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
						ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
						для Каждого СтрДата из ВидПоКалендарю Цикл 
							
							День = День(СтрДата.ДатаКалендаря); 
							если День = стр Тогда 
								ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
								ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
							КонецЕсли;
						КонецЦикла;
						
						ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
						ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
					КонецЦикла;
					ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
					//О.Т. Аверсон 25.05.2017 № 671
					Если не БезВредности Тогда 
						ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
					КонецЕсли;
					ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
					//О.Т. Аверсон 25.05.2017 № 671
					СчДни = 0;
					ИтогВыходные = 0;
					ИтогНочные = 0;
					ИтогДней = 0;
					ИтогЧасов = 0;
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
							КолПраздничные = 0;
							КолНочные = 0;
							КолДеньОтраб = 0;
							КолЧасОтраб = 0;
							если Режим = "ГрафикНовыйН" Тогда
								ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть1");
								ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть2");
								//О.Т. Аверсон 25.05.2017 № 671
								ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть3");
								ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧастьВредность");
								//О.Т. Аверсон 25.05.2017 № 671
								ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
							иначе
								ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть1");
								ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть2");
								//О.Т. Аверсон 25.05.2017 № 671
								ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть3");
								ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧастьВредность");
								//О.Т. Аверсон 25.05.2017 № 671

								ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
								
							КонецЕсли; 
							
							НомерПП = НомерПП + 1;
							
							ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
							ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
							ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
							
							Для мС = 1 По День(КонецМесяца(ДатаНач)) Цикл
								мДата = Дата(Год(ДатаНач), Месяц(ДатаНач), мС, 0, 0, 0); 
								если мС >= 29 Тогда
									если Режим = "ГрафикНовыйН" Тогда
										ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
									иначе
										ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
									КонецЕсли;
								КонецЕсли;

								мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
								Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
								ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
								
								если мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда 
									если мС >= 29 Тогда
										ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1);	
									Иначе 
										ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3);
									КонецЕсли;
									ОбластьД.Объединить();
									ОбластьД.ЦветФона = WebЦвета.Серый;
									если мС >= 29 Тогда
										ОбластьДанныхСтрокаДоп.Параметры["Я"] = "В";	
									Иначе 
										ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = "В";
									КонецЕсли;

									КолПраздничные = КолПраздничные +1;
									//Продолжить;
									
								КонецЕсли;
								если не мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда
									если мС >= 29 Тогда
										ОбластьДанныхСтрокаДоп.Параметры["Я"] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;	
									Иначе 
										ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
									КонецЕсли;
									КолДеньОтраб = КолДеньОтраб + 1;
									КолЧасОтраб = КолЧасОтраб + мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
									если Режим = "ГрафикНовыйН" Тогда
										мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
										Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
										ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоНочнымЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
										если мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда 
											если мС >= 29 Тогда
												ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1);	
											Иначе 
												ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3);
											КонецЕсли;
											ОбластьД.Объединить();
											Продолжить; 		
										КонецЕсли;
										если мС >= 29 Тогда
											ОбластьДанныхСтрокаДоп.Параметры["Н"] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;	
										Иначе 
											ОбластьДанныхСтрока.Параметры["Н"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
										КонецЕсли;
										КолНочные = КолНочные + мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
									КонецЕсли;
								КонецЕсли;
								если мС >= 28 Тогда
									если не СтокаВыведена Тогда 
										СтокаВыведена = Истина;
										ДокументРезультат.Вывести(ОбластьДанныхСтрока);
									КонецЕсли;
									
								КонецЕсли;
								если мС >= 29 Тогда
									ДокументРезультат.Присоединить(ОбластьДанныхСтрокаДоп);
								КонецЕсли;
							КонецЦикла;
							
							// Проверим, уместится ли строка на странице или надо открывать новую страницу
							//Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
							//	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							//	СчДни = СчДни + 2;
							//	ДокументРезультат.Вывести(ОбластьДанныхШапка);
							//КонецЕсли;
							СтокаВыведена = Ложь;
							
							ОбластьДанныхСтрока2.Параметры.Вых = ?(КолПраздничные=0,"0",КолПраздничные);
							ОбластьДанныхСтрока2.Параметры.Ночные = ?(КолНочные=0,"0",КолНочные);
							ОбластьДанныхСтрокаВр.Параметры.Вредность = ?(КолЧасОтраб=0,"0",КолЧасОтраб);
							ОбластьДанныхСтрока3.Параметры.ИтогоЧасов = ?(КолЧасОтраб=0,"0",КолЧасОтраб);
							ОбластьДанныхСтрока3.Параметры.ИтогоДней = ?(КолДеньОтраб=0,"0",КолДеньОтраб);
							
							СчДни = СчДни + 1;
							ИтогВыходные = ИтогВыходные + КолПраздничные;
							ИтогНочные = ИтогНочные + КолНочные;
							ИтогДней = ИтогДней + КолДеньОтраб;
							ИтогЧасов = ИтогЧасов + КолЧасОтраб;
							ДокументРезультат.Присоединить(ОбластьДанныхСтрока2);
							//О.Т. Аверсон 25.05.2017 № 671
							Если не БезВредности Тогда 
								ДокументРезультат.Присоединить(ОбластьДанныхСтрокаВр);
							КонецЕсли;
							ДокументРезультат.Присоединить(ОбластьДанныхСтрока3);
							//О.Т. Аверсон 25.05.2017 № 671
							
							Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								СчДни = СчДни + 2;
								ДниДобавить = День(КонецМесяца(ДатаНач))-28;
								ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
								ОбластьД.Объединить();
								ДокументРезультат.Вывести(ОбластьДанныхШапка);
								для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
									ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
									для Каждого СтрДата из ВидПоКалендарю Цикл 
										
										День = День(СтрДата.ДатаКалендаря); 
										если День = стр Тогда 
											ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
											ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
										КонецЕсли;
									КонецЦикла;
									
									ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
									ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
								КонецЦикла;
								ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
								//О.Т. Аверсон 25.05.2017 № 671
								Если не БезВредности Тогда 
									ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
								КонецЕсли;
								ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
								//О.Т. Аверсон 25.05.2017 № 671

							КонецЕсли;
							
						КонецЦикла; 
					КонецЦикла; 
					Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
						ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
						ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДниДобавить = День(КонецМесяца(ДатаНач))-28;
						ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
						ОбластьД.Объединить();
						ДокументРезультат.Вывести(ОбластьДанныхШапка);
						для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
							ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
							для Каждого СтрДата из ВидПоКалендарю Цикл 
								
								День = День(СтрДата.ДатаКалендаря); 
								если День = стр Тогда 
									ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
									ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
								КонецЕсли;
							КонецЦикла;
							
							ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
							ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
						КонецЦикла;
						ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
						//О.Т. Аверсон 25.05.2017 № 671
						Если не БезВредности Тогда 
							ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
						КонецЕсли;
						ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
						//О.Т. Аверсон 25.05.2017 № 671

						
						ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
					КонецЕсли;
					ОбластьДанныхИтог2.Параметры.ИтогВых = ?(ИтогВыходные=0,"0",ИтогВыходные);
					ОбластьДанныхИтог2.Параметры.ИтогНочные = ?(ИтогНочные=0,"0",ИтогНочные);
					ОбластьДанныхИтогВр.Параметры.ИтогВредность = ?(ИтогЧасов=0,"0",ИтогЧасов);
					ОбластьДанныхИтог3.Параметры.ИтогИтогоДней = ?(ИтогДней=0,"0",ИтогДней);
					ОбластьДанныхИтог3.Параметры.ИтогИтогоЧасов = ?(ИтогЧасов=0,"0",ИтогЧасов);
					ДокументРезультат.Вывести(ОбластьДанныхИтог);
					для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
						ОбластьДанныхИтогДоп	= Макет.ПолучитьОбласть("ИтогСтрока|ДниПлав");
						ДокументРезультат.Присоединить(ОбластьДанныхИтогДоп);
					КонецЦикла;
					
					ДокументРезультат.Присоединить(ОбластьДанныхИтог2);
					//О.Т. Аверсон 25.05.2017 № 671
					Если не БезВредности Тогда 
						ДокументРезультат.Присоединить(ОбластьДанныхИтогВр);
					КонецЕсли;
					ДокументРезультат.Присоединить(ОбластьДанныхИтог3);
					//О.Т. Аверсон 25.05.2017 № 671
					ДокументРезультат.Вывести(ОбластьДанныхПодвал);
					
				КонецЦикла; 
			КонецЦикла; 
		Иначе
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				НомерПП = 0;
				ОбластьДанныхЗаголовок.Параметры.Заполнить(ВыборкаПоРаботнику);
				ОбластьДанныхЗаголовок.Параметры.Организация = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
				ОбластьДанныхЗаголовок.Параметры.Подразделение = СОКРЛП(Подразделение);
				ОбластьДанныхЗаголовок.Параметры.Год    =  Формат(ДатаНач,"ДФ=гггг");
				ОбластьДанныхЗаголовок.Параметры.Заполнить(ВыборкаПоРаботнику);  
				ДокументРезультат.Вывести(ОбластьДанныхЗаголовок);
				
				ДниДобавить = День(КонецМесяца(ДатаНач))-28;
				ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
				ОбластьД.Объединить();
				ДокументРезультат.Вывести(ОбластьДанныхШапка);
				для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
					ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
					для Каждого СтрДата из ВидПоКалендарю Цикл 
						
						День = День(СтрДата.ДатаКалендаря); 
						если День = стр Тогда 
							ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
							ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
						КонецЕсли;
					КонецЦикла;
					
					ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
					ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
				КонецЦикла;
				ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
				//О.Т. Аверсон 25.05.2017 № 671
				Если не БезВредности Тогда 
					ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
				//О.Т. Аверсон 25.05.2017 № 671

				
				СчДни = 0;
				ИтогВыходные = 0;
				ИтогНочные = 0;
				ИтогДней = 0;
				ИтогЧасов = 0;
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
						КолПраздничные = 0;
						КолНочные = 0;
						КолДеньОтраб = 0;
						КолЧасОтраб = 0;
						если Режим = "ГрафикНовыйН" Тогда
							ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть1");
							ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть2");
							//О.Т. Аверсон 25.05.2017 № 671
							ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧасть3");
							ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаСНочными|ДниЧастьВредность");
							//О.Т. Аверсон 25.05.2017 № 671
							ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
						иначе
							ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть1");
							ОбластьДанныхСтрока2		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть2");
							//О.Т. Аверсон 25.05.2017 № 671
							ОбластьДанныхСтрока3		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧасть3");
							ОбластьДанныхСтрокаВр		= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниЧастьВредность");
							//О.Т. Аверсон 25.05.2017 № 671

							ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
							
						КонецЕсли; 
						НомерПП = НомерПП + 1;

                        ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
						ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
						ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
						
						
						Для мС = 1 По День(КонецМесяца(ДатаНач)) Цикл
							мДата = Дата(Год(ДатаНач), Месяц(ДатаНач), мС, 0, 0, 0); 
							если мС >= 29 Тогда
								если Режим = "ГрафикНовыйН" Тогда
									ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаСНочными|ДниПлав");
								иначе
									ОбластьДанныхСтрокаДоп	= Макет.ПолучитьОбласть("СтрокаБезНочных|ДниПлав");
								КонецЕсли;
							КонецЕсли;
							
							мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
							Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
							ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
							
							если мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда 
								если мС >= 29 Тогда
									ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1);	
								Иначе 
									ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3);
								КонецЕсли;
								ОбластьД.Объединить();
								ОбластьД.ЦветФона = WebЦвета.Серый;
								если мС >= 29 Тогда
									ОбластьДанныхСтрокаДоп.Параметры["Я"] = "В";	
								Иначе 
									ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = "В";
								КонецЕсли;
								КолПраздничные = КолПраздничные +1;
								//Продолжить;
							КонецЕсли;
							если не мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда
								если мС >= 29 Тогда
									ОбластьДанныхСтрокаДоп.Параметры["Я"] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;	
								Иначе 
									ОбластьДанныхСтрока.Параметры["Я"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
								КонецЕсли;
								КолДеньОтраб = КолДеньОтраб+1;
								КолЧасОтраб = КолЧасОтраб + мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
								если Режим = "ГрафикНовыйН" Тогда
									мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
									Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
									ВыборкаПоРаботнику.Сотрудник, НачалоМесяца(мДата), Истина, Перечисления.ВидыУчетаВремени.ПоНочнымЧасам, мДата, Справочники.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы));
									если мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение = 0 Тогда 
										если мС >= 29 Тогда
											ОбластьД = ОбластьДанныхСтрокаДоп.Область(1,1,2,1);	
										Иначе 
											ОбластьД = ОбластьДанныхСтрока.Область(1,мС+3,2,мС+3);
										КонецЕсли; 
										ОбластьД.Объединить();
										//Продолжить; 
									иначе
										
										если мС >= 29 Тогда
											ОбластьДанныхСтрокаДоп.Параметры["Н"] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;	
										Иначе 
											ОбластьДанныхСтрока.Параметры["Н"+СокрЛП(Строка(мС))] = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;
										КонецЕсли; 
										   
									КонецЕсли;
								КолНочные = КолНочные + мСтрокаРегистраГрафикСотрудника.ОсновноеЗначение;	
								КонецЕсли;
							КонецЕсли;
							если мС >= 28 Тогда
								если не СтокаВыведена Тогда 
									СтокаВыведена = Истина;
									ДокументРезультат.Вывести(ОбластьДанныхСтрока);
								КонецЕсли;
								
							КонецЕсли;
							если мС >= 29 Тогда
								ДокументРезультат.Присоединить(ОбластьДанныхСтрокаДоп);
							КонецЕсли;
						КонецЦикла;
						СтокаВыведена = Ложь;
						
						// Проверим, уместится ли строка на странице или надо открывать новую страницу
						ОбластьДанныхСтрока2.Параметры.Вых = ?(КолПраздничные=0,"0",КолПраздничные);
						ОбластьДанныхСтрока2.Параметры.Ночные = ?(КолНочные=0,"0",КолНочные);
						ОбластьДанныхСтрокаВр.Параметры.Вредность = ?(КолЧасОтраб=0,"0",КолЧасОтраб);
						ОбластьДанныхСтрока3.Параметры.ИтогоЧасов = ?(КолЧасОтраб=0,"0",КолЧасОтраб);
						ОбластьДанныхСтрока3.Параметры.ИтогоДней = ?(КолДеньОтраб=0,"0",КолДеньОтраб);
						
						ДокументРезультат.Присоединить(ОбластьДанныхСтрока2);
						//О.Т. Аверсон 25.05.2017 № 671
						Если не БезВредности Тогда 
							ДокументРезультат.Присоединить(ОбластьДанныхСтрокаВр);
						КонецЕсли;
						ДокументРезультат.Присоединить(ОбластьДанныхСтрока3);
						//О.Т. Аверсон 25.05.2017 № 671
						Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							СчДни = СчДни + 2;
							ДниДобавить = День(КонецМесяца(ДатаНач))-28;
							ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
							ОбластьД.Объединить();
							ДокументРезультат.Вывести(ОбластьДанныхШапка);
							для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
								ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
								для Каждого СтрДата из ВидПоКалендарю Цикл 
									
									День = День(СтрДата.ДатаКалендаря); 
									если День = стр Тогда 
										ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
										ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
									КонецЕсли;
								КонецЦикла;
								
								ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
								ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
							КонецЦикла;
							ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
							//О.Т. Аверсон 25.05.2017 № 671
							Если не БезВредности Тогда 
								ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
							КонецЕсли;
							ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
							//О.Т. Аверсон 25.05.2017 № 671

						КонецЕсли;
						
						СчДни = СчДни + 1;	
						ИтогВыходные = ИтогВыходные + КолПраздничные;
						ИтогНочные = ИтогНочные + КолНочные;
						ИтогДней = ИтогДней + КолДеньОтраб;
						ИтогЧасов = ИтогЧасов + КолЧасОтраб;
					КонецЦикла; 
				КонецЦикла; 
				Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
					ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
					ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДниДобавить = День(КонецМесяца(ДатаНач))-28;
					ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
					ОбластьД.Объединить();
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
						ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
						для Каждого СтрДата из ВидПоКалендарю Цикл 
							
							День = День(СтрДата.ДатаКалендаря); 
							если День = стр Тогда 
								ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
								ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
							КонецЕсли;
						КонецЦикла;
						
						ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
						ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
					КонецЦикла;
					ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
					//О.Т. Аверсон 25.05.2017 № 671
					Если не БезВредности Тогда 
						ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
					КонецЕсли;
					ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
					//О.Т. Аверсон 25.05.2017 № 671

					
					ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
				КонецЕсли;
				ОбластьДанныхИтог2.Параметры.ИтогВых = ?(ИтогВыходные=0,"0",ИтогВыходные);
				ОбластьДанныхИтог2.Параметры.ИтогНочные = ?(ИтогНочные=0,"0",ИтогНочные);
				ОбластьДанныхИтогВр.Параметры.ИтогВредность = ?(ИтогЧасов=0,"0",ИтогЧасов);
				ОбластьДанныхИтог3.Параметры.ИтогИтогоДней =?(ИтогДней=0,"0",ИтогДней);
				ОбластьДанныхИтог3.Параметры.ИтогИтогоЧасов = ?(ИтогЧасов=0,"0",ИтогЧасов);
				ДокументРезультат.Вывести(ОбластьДанныхИтог);
				для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
					ОбластьДанныхИтогДоп	= Макет.ПолучитьОбласть("ИтогСтрока|ДниПлав");
					ДокументРезультат.Присоединить(ОбластьДанныхИтогДоп);
				КонецЦикла;
				ДокументРезультат.Присоединить(ОбластьДанныхИтог2);
				//О.Т. Аверсон 25.05.2017 № 671
				Если не БезВредности Тогда 
					ДокументРезультат.Присоединить(ОбластьДанныхИтогВр);
				КонецЕсли;
				ДокументРезультат.Присоединить(ОбластьДанныхИтог3);
				//О.Т. Аверсон 25.05.2017 № 671
				ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				
			КонецЦикла; 
		КонецЕсли;
		
		Если ДокументРезультат.ВысотаТаблицы = 0 Тогда
			
			Если ОтборОрганизации и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				ОбластьДанныхЗаголовок.Параметры.Организация = СОКРЛП(Организация.НаименованиеПолное);
				//ОбластьДанныхШапка.Параметры.КодПоОКПО = Организация.КодПоОКПО;
			КонецЕсли;
			Если ОтборПодразделения и ТипЗнч(Организация) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				ОбластьДанныхЗаголовок.Параметры.Подразделение = Подразделение.Наименование;
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьДанныхЗаголовок);

			ДниДобавить = День(КонецМесяца(ДатаНач))-28;
			ОбластьД = ОбластьДанныхШапка.Область(1,4,1,31+ДниДобавить);
			ОбластьД.Объединить();
			ДокументРезультат.Вывести(ОбластьДанныхШапка);
			для стр = 29 по День(КонецМесяца(ДатаНач)) Цикл
				ОбластьДанныхШапкаДоп 		= Макет.ПолучитьОбласть("Шапка|ДниПлав");
				для Каждого СтрДата из ВидПоКалендарю Цикл 
					
					День = День(СтрДата.ДатаКалендаря); 
					если День = стр Тогда 
						ОбластьД = ОбластьДанныхШапкаДоп.Область(2,День-28,2,День-28); 
						ОбластьД.ЦветФона = WebЦвета.СветлоСерый;
					КонецЕсли;
				КонецЦикла;
				
				ОбластьДанныхШапкаДоп.Параметры.ДеньШапка = Строка(стр);
				ДокументРезультат.Присоединить(ОбластьДанныхШапкаДоп);
			КонецЦикла;
			ДокументРезультат.Присоединить(ОбластьДанныхШапка2);
			//О.Т. Аверсон 25.05.2017 № 671
			Если не БезВредности Тогда 
				ДокументРезультат.Присоединить(ОбластьДанныхШапкаВр);
			КонецЕсли;
			ДокументРезультат.Присоединить(ОбластьДанныхШапка3);
			//О.Т. Аверсон 25.05.2017 № 671
			
			
			ОбластьДанныхСтрока.Параметры.Работник = " " + Символы.ПС + " ";
			ВыводимыеОбласти = Новый Массив();
			ВыводимыеОбласти.Добавить(ОбластьДанныхСтрока);
			ВыводимыеОбласти.Добавить(ОбластьДанныхПодвал);
			//ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
			//Для Сч = 1 По ПараметровВстроке Цикл
			//	ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
			//КонецЦикла;
			//Пока ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти) Цикл
			//	ДокументРезультат.Вывести(ОбластьДанныхСтрока);
			//КонецЦикла;
			ДокументРезультат.Вывести(ОбластьДанныхПодвал);
		КонецЕсли;
        ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
//енд		
	ИначеЕсли Режим = "Бланк" Тогда 
		
		// Запрос сотрудников
		ЗапросТабель.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|	РаботникиОрганизаций.Сотрудник.Код КАК ТабельныйНомер,
		|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Имя = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
		|				ТОГДА """"
		|			ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
		|		КОНЕЦ, РаботникиОрганизаций.Сотрудник.Физлицо.Наименование) КАК СотрудникНаименование,
		|	ДолжностиРаботников.ОбособленноеПодразделение КАК Организация,
		|	ПОДСТРОКА(ДолжностиРаботников.ОбособленноеПодразделение.НаименованиеПолное, 1, 250) КАК ИмяОрганизации,
		|	ДолжностиРаботников.ОбособленноеПодразделение.КодПоОКПО КАК КодПоОКПО,
		|	ДолжностиРаботников.Должность.Наименование КАК Должность,
		|	Руководитель.Должность КАК ДолжностьРуководителя,
		|	ФИОРуководителя.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОРуководителя.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОРуководителя.Отчество КАК СТРОКА(1))) + ""."" КАК ФИОРуководителя,		
		|	ЕСТЬNULL(РуководительКадровойСлужбыПодразделения.Должность, РуководительКадровойСлужбыОрганизации.Должность) КАК ДолжностьКадровика,
		|	ВЫБОР КОГДА ФИОКадровикаПодразделения.Фамилия ЕСТЬ NULL 
		|	ТОГДА ФИОКадровикаОрганизации.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаОрганизации.Отчество КАК СТРОКА(1))) + "".""
		|	ИНАЧЕ ФИОКадровикаПодразделения.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОКадровикаПодразделения.Отчество КАК СТРОКА(1))) + "".""
		|	КОНЕЦ КАК ФИОКадровика,
		|	Ответственный.ФИООтветственного КАК ФИООтветственного,
		|	Ответственный.ДолжностьОтветственного КАК ДолжностьОтветственного, 
		|	ДолжностиРаботников.ПодразделениеОрганизации,
		|	ДолжностиРаботников.ПодразделениеОрганизации.Наименование КАК ИмяПодразделения
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РаботникиОрганизаций.Сотрудник
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период > &НачалоПериода
		|		И РаботникиОрганизаций.Период < &КонецПериода
		|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|		&КонецПериода,
		|		ФизЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				СотрудникиОрганизаций.Физлицо
		|			ИЗ
		|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|			ГДЕ
		|				ИСТИНА" + ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации)," И " + СтрЗаменить(УсловиеПоРаботникам,"Сотрудник","Ссылка")) + ")) КАК ФИОФизЛицСрезПоследних
		|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК ДолжностиРаботников
		|		ПО ДолжностиРаботников.Сотрудник = РаботникиОрганизаций.Сотрудник
		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК Руководитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОРуководителя
		|		ПО Руководитель.ФизическоеЛицо = ФИОРуководителя.ФизЛицо";
		Если ГруппироватьПодразделения тогда
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ПодразделениеОрганизации = Руководитель.СтруктурнаяЕдиница";
		Иначе
			ЗапросТабель.Текст = ЗапросТабель.Текст + "
			|	ПО ДолжностиРаботников.ОбособленноеПодразделение = Руководитель.СтруктурнаяЕдиница";
		КонецЕсли;
		ЗапросТабель.Текст = ЗапросТабель.Текст + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаОрганизации
		|		ПО РуководительКадровойСлужбыОрганизации.ФизическоеЛицо = ФИОКадровикаОрганизации.ФизЛицо
		|	ПО ДолжностиРаботников.ОбособленноеПодразделение = РуководительКадровойСлужбыОрганизации.СтруктурнаяЕдиница
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&КонецПериода, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы)) КАК РуководительКадровойСлужбыПодразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОКадровикаПодразделения
		|		ПО РуководительКадровойСлужбыПодразделения.ФизическоеЛицо = ФИОКадровикаПодразделения.ФизЛицо
		|	ПО ДолжностиРаботников.ПодразделениеОрганизации = РуководительКадровойСлужбыПодразделения.СтруктурнаяЕдиница "+?(НЕ ГруппироватьПодразделения, " И ЛОЖЬ", "")+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		МАКСИМУМ(ВЫБОР
		|					КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
		|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацийСрезПоследних.ДолжностьЗавершения
		|						ИНАЧЕ РаботникиОрганизацийСрезПоследних.Должность
		|					КОНЕЦ) КАК ДолжностьОтветственного,
		|					МАКСИМУМ(ФИОФизЛицСрезПоследних.Фамилия + "" "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Имя КАК СТРОКА(1))) + "". "" + (ВЫРАЗИТЬ(ФИОФизЛицСрезПоследних.Отчество КАК СТРОКА(1))) + ""."") КАК ФИООтветственного
		|				ИЗ
		|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, Сотрудник.Физлицо = &Ответственный) КАК РаботникиОрганизацийСрезПоследних
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецПериода, ) КАК ФИОФизЛицСрезПоследних
		|					ПО РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо) КАК Ответственный
		|	ПО ИСТИНА
		
		|ГДЕ
		|	ИСТИНА" + УсловиеВЗапрос + "
		|	
		|УПОРЯДОЧИТЬ ПО
		|	Организация, " + ПорядокГруппировки + " СотрудникНаименование, Сотрудник";
		
		ВыборкаПоРаботнику = ЗапросТабель.Выполнить().Выбрать();
		
		Если ГруппироватьПодразделения Тогда
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ПодразделениеОрганизации") Цикл
					
					Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					НомерПП = 0;
					ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
					ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
					ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
					
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
							
							НомерПП = НомерПП + 1;
							
							ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
							ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
							ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
							
							// Проверим, уместится ли строка на странице или надо открывать новую страницу
							Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
							КонецЕсли;
							ДокументРезультат.Вывести(ОбластьДанныхСтрока);
							
						КонецЦикла; 
					КонецЦикла; 
					Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
						ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
						ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьДанныхПодвал);
					
				КонецЦикла; 
			КонецЦикла; 
		Иначе
			Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				НомерПП = 0;
				ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
				ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(ВыборкаПоРаботнику.ИмяОрганизации);
				ОбластьДанныхШапка.Параметры.ИмяПодразделения = "";
				ОбластьДанныхПодвал.Параметры.Заполнить(ВыборкаПоРаботнику);
				ДокументРезультат.Вывести(ОбластьДанныхШапка);
				ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
						
						НомерПП = НомерПП + 1;
						
						ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
						ОбластьДанныхСтрока.Параметры.Работник = СокрП(ВыборкаПоРаботнику.СотрудникНаименование) + ", " + Символы.ПС + ВыборкаПоРаботнику.Должность;
						ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
						
						// Проверим, уместится ли строка на странице или надо открывать новую страницу
						Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						КонецЕсли;
						ДокументРезультат.Вывести(ОбластьДанныхСтрока);
						
					КонецЦикла; 
				КонецЦикла; 
				Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
					ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
					ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
				КонецЕсли;
				ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				
			КонецЦикла; 
		КонецЕсли;
		
		Если ДокументРезультат.ВысотаТаблицы = 0 Тогда
			
			Если ОтборОрганизации и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				ОбластьДанныхШапка.Параметры.ИмяОрганизации = СОКРЛП(Организация.НаименованиеПолное);
				ОбластьДанныхШапка.Параметры.КодПоОКПО = Организация.КодПоОКПО;
			КонецЕсли;
			Если ОтборПодразделения и ТипЗнч(Организация) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				ОбластьДанныхШапка.Параметры.ИмяПодразделения = Подразделение.Наименование;
			КонецЕсли;
			
			ОбластьДанныхСтрока.Параметры.Работник = " " + Символы.ПС + " ";
			ВыводимыеОбласти = Новый Массив();
			ВыводимыеОбласти.Добавить(ОбластьДанныхСтрока);
			ВыводимыеОбласти.Добавить(ОбластьДанныхПодвал);
			ДокументРезультат.Вывести(ОбластьДанныхШапка);
			ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
			Для Сч = 1 По ПараметровВстроке Цикл
				ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
			КонецЦикла;
			Пока ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти) Цикл
				ДокументРезультат.Вывести(ОбластьДанныхСтрока);
			КонецЦикла;
			ДокументРезультат.Вывести(ОбластьДанныхПодвал);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;


#КонецЕсли

