#Если Клиент Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ПЕРЕМЕННЫЕ МОДУЛЯ
	
	Перем НП Экспорт; // Настройка периода
	
	Перем мНазваниеОтчета Экспорт; // название отчета
	
	Перем мСтруктураДляОтбораПоКатегориям Экспорт; // содержит связь отборов текста запроса Построителя и значений категорий
	
	Перем ПоказыватьЗаголовок Экспорт;
	
	Перем мСтруктураПредставлениеПолей Экспорт; // структура представлений полей
	
	Перем мДокументРезультат Экспорт;
	
	Перем мВыбранныйПоказатель Экспорт; // выбранный показатель для расшифровки
	
	// Процедура удаляет выброное поле из постротиеля отчетов
	//
	Процедура УдалитьВыбранноеПоле(Поле)
		
		ПолеВыбора=ПостроительОтчета.ВыбранныеПоля.Найти(Поле);		
		ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеВыбора);		
		
	КонецПроцедуры
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА
	
	// Процедура получает заголовок отчета
	//
	Процедура ПолучитьНазваниеОтчета() Экспорт 
		
		Если СокрЛП(ИмяЯчейки) = "" Тогда 
			// это не расшифровка, установим название отеча (у расшифровок свое название)
			Если ВыводитьБазу Тогда
				мНазваниеОтчета = "Анализ начисленных налогов и взносов (налоговая база)";
			Иначе
				мНазваниеОтчета = "Анализ начисленных налогов и взносов (исчисленные налоги)";
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры
	
	// Процедура установки начальных настроек отчета с использованием текста запроса
	//
	Процедура ЗаполнитьНачальныеНастройки(ЕстьПодразделение = Истина,ЕстьРаботник = Истина,ЕстьВидРасчета = Истина,ЕстьОрганизация = Истина) Экспорт
		
		ЭтоНеРасшифрофка = НЕ ЗначениеЗаполнено(ИмяЯчейки);
		
		Если ВыводитьБазу Тогда
			ЗаполнитьБазовыеНастройки(ЭтоНеРасшифрофка, ЕстьПодразделение,ЕстьРаботник,ЕстьВидРасчета,ЕстьОрганизация);
		Иначе
			ЗаполнитьНалоговыеНастройки(ЭтоНеРасшифрофка, ЕстьПодразделение,ЕстьРаботник,ЕстьОрганизация);
		КонецЕсли;
		
		мСтруктураПредставлениеПолей = Новый Структура;
		мСтруктураПредставлениеПолей.Вставить("ВидРасчета",					"Вид расчета");
		мСтруктураПредставлениеПолей.Вставить("Работник",					"Работник");
		мСтруктураПредставлениеПолей.Вставить("Организация",				"Организация");
		мСтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации",	"Подразделение организации");//Островская Татьяна 08.01.2014 № 17020
		мСтруктураПредставлениеПолей.Вставить("ФСЗН",						"Отчисления в ФСЗН");
		мСтруктураПредставлениеПолей.Вставить("БазаФСЗН",					"База для отчислений в ФСЗН");
		мСтруктураПредставлениеПолей.Вставить("БазаНДФЛ",				 	"База для подоходного налога");
		мСтруктураПредставлениеПолей.Вставить("НДФЛ",				 		"Подоходный налог");
		мСтруктураПредставлениеПолей.Вставить("СТРАХ",						"Отчисления в Белгосстрах");
		мСтруктураПредставлениеПолей.Вставить("БазаСТРАХ",					"База для отчислений в Белгосстрах");
		мСтруктураПредставлениеПолей.Вставить("ПенсионныйФонд",				"Отчисления в пенсионный фонд");
		мСтруктураПредставлениеПолей.Вставить("ТФОМС",						"ТФОМС");
		мСтруктураПредставлениеПолей.Вставить("ТФОМС",						"ТФОМС");
		мСтруктураПредставлениеПолей.Вставить("ПФРСтрах",					"ПФР страховая часть");	
		мСтруктураПредставлениеПолей.Вставить("ПФРНак",   					"ПФР накопительная часть");	
		мСтруктураПредставлениеПолей.Вставить("ФСС_НС",					 	"ФСС от НС и ПЗ");	
		мСтруктураПредставлениеПолей.Вставить("РасходыЗаСчетФСС",		 	"Расходы за счет ФСС");				
		мСтруктураПредставлениеПолей.Вставить("ПФРСтраховая",				"ПФР страховая часть");	
		мСтруктураПредставлениеПолей.Вставить("ПФРНакопительная",			"ПФР накопительная часть");	
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФБ",		"Льгота Федеральный бюджет");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФСС",		"Льгота ФСС");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФОМС",		"Льгота ФОМС");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФБСумма",	"Примененная льгота ФОМС");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФСССумма",	"Примененная льгота ФСС");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаФФОМССумма","Примененная льгота ФФОМC");
		мСтруктураПредставлениеПолей.Вставить("ПримененнаяЛьготаТФОМССумма","Примененная льгота ТФОМC");	
		мСтруктураПредставлениеПолей.Вставить("ОблагаетсяВсего",			"Начислено всего");
		мСтруктураПредставлениеПолей.Вставить("ЗаСчетПрибыли",				"Выплаты за счет прибыли");		
		мСтруктураПредставлениеПолей.Вставить("П000210001003",				"ФБ до 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210001004",				"ФСС до 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210001005",				"ОМС до 280 000 руб.");
		
		мСтруктураПредставлениеПолей.Вставить("П000210002203",				"ФБ сумма, превышающая 280 000 руб.");	
		мСтруктураПредставлениеПолей.Вставить("П000210002204",				"ФСС сумма, превышающая 280 000 руб.");	
		мСтруктураПредставлениеПолей.Вставить("П000210002205",				"ОМС сумма, превышающая 280 000 руб.");	
		
		мСтруктураПредставлениеПолей.Вставить("П000210003203",				"ФБ  сумма, превышающая 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210003204",				"ФСС  сумма, превышающая 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210003205",				"ОМС сумма, превышающая 600 0000 руб.");	
		
		мСтруктураПредставлениеПолей.Вставить("П000210001006",				"ФБ Численность физических лиц (чел.) До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210001007",				"ФСС Численность физических лиц (чел.) До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210001008",				"ОМС Численность физических лиц (чел.) До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210002106",				"ФБ Численность физических лиц (чел.) 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210002107",				"ФСС Численность физических лиц (чел.) 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210002108",				"ОМС Численность физических лиц (чел.) 280 000 руб.");
		
		мСтруктураПредставлениеПолей.Вставить("П000210003106",				"ФБ Численность физических лиц (чел.) Сумма, превышающая 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210003107",				"ФСС Численность физических лиц (чел.) Сумма, превышающая 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000210003108",				"ОМС Численность физических лиц (чел.) Сумма, превышающая 600 000 руб.");	
		
		мСтруктураПредставлениеПолей.Вставить("ПФРСтрах1",					"База взносов в ПФР. Для лиц  1966 года рождения и старше");
		мСтруктураПредставлениеПолей.Вставить("ПФРСтрах2",					"База взносов в ПФР. Для лиц 1967 года рождения и моложе");
		мСтруктураПредставлениеПолей.Вставить("ПФРНак1",					"База взносов в ПФР (накопительная часть). Для лиц  1966 года рождения и старше");
		мСтруктураПредставлениеПолей.Вставить("ПФРНак2",					"База взносов в ПФР (накопительная часть). Для лиц 1967 года рождения и моложе");
		
		мСтруктураПредставлениеПолей.Вставить("ПФРСтрах",					"База взносов в ПФР");
		мСтруктураПредставлениеПолей.Вставить("ПФРНеЕНВД",					"База взносов в ПФР, в части застрахованных лиц, ОСН");
		
		мСтруктураПредставлениеПолей.Вставить("ПФРВзносыВсего1",			"Начислено взносов в ПФР. Для лиц  1966 года рождения и старше");
		мСтруктураПредставлениеПолей.Вставить("ПФРВзносыВсего2",			"Начислено взносов в ПФР. Для лиц 1967 года рождения и моложе");	
		мСтруктураПредставлениеПолей.Вставить("ПФРВзносыВсего",				"Начислено взносов в ПФР");	
		мСтруктураПредставлениеПолей.Вставить("ЛьготаПоВзносамВПФР",		"Начислено взносов в ПФР, в части ОСН");	
		
		мСтруктураПредставлениеПолей.Вставить("ПФРСтраховая1",				"Начислено взносов в ПФР (страховая часть). Для лиц 1966 года рождения и старше");
		мСтруктураПредставлениеПолей.Вставить("ПФРСтраховая2",				"Начислено взносов в ПФР (страховая часть). Для лиц 1967 года рождения и моложе");		
		мСтруктураПредставлениеПолей.Вставить("ПФРСтраховаяНеЕНВД",			"Начислено взносов в ПФР (страховая часть), в части ОСН");
		
		мСтруктураПредставлениеПолей.Вставить("ПФРНакопительная1",			"Начислено взносов в ПФР (накопительная часть). Для лиц 1966 года рождения и старше");			
		мСтруктураПредставлениеПолей.Вставить("ПФРНакопительная2",			"Начислено взносов в ПФР (накопительная часть). Для лиц 1967 года рождения и моложе");			
		мСтруктураПредставлениеПолей.Вставить("ПФРНакопительнаяНеЕНВД",		"Начислено взносов в ПФР (накопительная часть), в части ОСН");	
		
		мСтруктураПредставлениеПолей.Вставить("П000020110003",				"Суммы, не подлежащие налогообложению в отчетном периоде в соответствии со статьей 238 Налогового кодекса РФ (ФБ, ФФОМС, ТФОМС)");		
		мСтруктураПредставлениеПолей.Вставить("П000020110004",				"Суммы, не подлежащие налогообложению в отчетном периоде в соответствии со статьей 238 Налогового кодекса РФ (ФСС)");		
		мСтруктураПредставлениеПолей.Вставить("П000220010004",				"База для начисления страховых взносов   До 280 000 руб. Для лиц  1966 года рождения и старше");		
		мСтруктураПредставлениеПолей.Вставить("П000220010005",				"База для начисления страховых взносов (руб.)  До 280 000 руб. Для лиц 1966 года  рождения  и старше. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");
		мСтруктураПредставлениеПолей.Вставить("П000220010006",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше. До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220010007",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше. До 280 000 руб. в части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");
		мСтруктураПредставлениеПолей.Вставить("П000220010104",				"База для начисления страховых взносов (руб.)  До 280 000 руб. Для лиц 1966 года  рождения  и старше. Для лиц 1967 года рождения  и моложе");	
		мСтруктураПредставлениеПолей.Вставить("П000220010105",				"База для начисления страховых взносов (руб.)  До 280 000 руб.  Для лиц 1967 года рождения  и моложе. В  в части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");
		мСтруктураПредставлениеПолей.Вставить("П000220010106",				"Численность (чел.) База для начисления страховых взносов (руб.) До 280 000 руб. Для лиц 1967 года рождения  и моложе. До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220010107",				"Численность (чел.) База для начисления страховых взносов (руб.) До 280 000 руб. Для лиц 1967 года рождения  и моложе. До 280 000 руб. в части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");		
		мСтруктураПредставлениеПолей.Вставить("П000220021004",				"База для начисления страховых взносов за  отчетный период, всего.  280 000 руб.  Для лиц 1966 года  рождения и старше.");	
		мСтруктураПредставлениеПолей.Вставить("П000220021005",				"База для начисления страховых взносов за  отчетный период, всего.  280 000 руб.  Для лиц 1966 года  рождения и старше. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");	
		мСтруктураПредставлениеПолей.Вставить("П000220021006",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше.  280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220021007",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше.  280 000 руб. В части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");
		
		мСтруктураПредставлениеПолей.Вставить("П000220021104",				"База для начисления страховых взносов (руб.)  280 000 руб. Для лиц 1966 года  рождения  и старше. Для лиц 1967 года рождения  и моложе");	
		мСтруктураПредставлениеПолей.Вставить("П000220021105",				"База для начисления страховых взносов (руб.) 280 000 руб.  Для лиц 1967 года рождения  и моложе. В  в части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");
		мСтруктураПредставлениеПолей.Вставить("П000220021106",				"Численность (чел.) База для начисления страховых взносов (руб.) 280 000 руб. Для лиц 1967 года рождения  и моложе. До 280 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220021107",				"Численность (чел.) База для начисления страховых взносов (руб.) 280 000 руб. Для лиц 1967 года рождения  и моложе. До 280 000 руб. в части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");		
		
		мСтруктураПредставлениеПолей.Вставить("П000220022004",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 280 000 руб.  Для лиц 1966 года  рождения и старше.");	
		мСтруктураПредставлениеПолей.Вставить("П000220022005",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 280 000 руб.  Для лиц 1966 года  рождения и старше. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");	
		
		мСтруктураПредставлениеПолей.Вставить("П000220022104",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 280 000 руб.  Для лиц 1967 года рождения  и моложе.");	
		мСтруктураПредставлениеПолей.Вставить("П000220022105",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 280 000 руб.  Для лиц 1967 года рождения  и моложе. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");	
		
		мСтруктураПредставлениеПолей.Вставить("П000220030004",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 600 000 руб. Для лиц 1966 года  рождения и старше.");
		мСтруктураПредставлениеПолей.Вставить("П000220030005",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 600 000 руб.  Для лиц 1966 года  рождения и старше. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");	
		мСтруктураПредставлениеПолей.Вставить("П000220030006",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше.  Свыше 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220030007",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше.  Свыше 600 000 руб. В части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");
		
		мСтруктураПредставлениеПолей.Вставить("П000220030104",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 600 000 руб. Для лиц 1966 года  рождения и старше.");	
		мСтруктураПредставлениеПолей.Вставить("П000220030105",				"База для начисления страховых взносов за  отчетный период, всего. Свыше 600 000 руб. Для лиц 1966 года  рождения и старше. В части застрахованных лиц, занятых в сферах деятельности, облагаемых по общему налоговому режиму");	
		мСтруктураПредставлениеПолей.Вставить("П000220030106",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше. Свыше 600 000 руб.");
		мСтруктураПредставлениеПолей.Вставить("П000220030107",				"Численность (чел.) База для начисления страховых взносов (руб.) Для лиц 1966 года  рождения  и старше. Свыше 600 000 руб. В части  застрахованных лиц, занятых в сферах  деятельности, облагаемых по общему налоговому режиму");
		
		мСтруктураПредставлениеПолей.Вставить("НачисленоНалогаФБ",			"Начислено налога (Федеральный бюджет)");	
		мСтруктураПредставлениеПолей.Вставить("НачисленоНалогаФСС",			"Начислено налога (ФСС)");	
		мСтруктураПредставлениеПолей.Вставить("НачисленоНалогаФОМС",		"Начислено налога (ФФОМС)");
		мСтруктураПредставлениеПолей.Вставить("НачисленоНалогаТФОМС",		"Начислено налога (ТФОМС)");
		
		мСтруктураПредставлениеПолей.Вставить("НачисленоВсегоОбщ",			"Начислено выплат и иных вознагр. по трудовым, гражданск.- правов.,  авторским  договорам -  ВСЕГО (По видам деятельности облагаемым по общепринятой системе)");		
		мСтруктураПредставлениеПолей.Вставить("НачисленоВсегоСР",			"Начислено выплат и иных вознагр. по трудовым, гражданск.- правов.,  авторским  договорам -  ВСЕГО (По видам деятельности облагаемым по общепринятой системе)");
		
		мСтруктураПредставлениеПолей.Вставить("ВыплатыЗаСчетПрибылиОбщ",	"Выплаты, не отнесенные к расходам, уменьшающим налоговую базу по налогу на прибыль организаций (По видам деятельности облагаемым по общепринятой системе)");
		мСтруктураПредставлениеПолей.Вставить("ВыплатыЗаСчетПрибылиСР",		"Выплаты, не отнесенные к расходам, уменьшающим налоговую базу по налогу на прибыль организаций (По видам деятельности облагаемым по специальным налоговым режимам)");
		
		мСтруктураПредставлениеПолей.Вставить("НеОблагаетсяПоСт238Общ",		"Выплаты, не подлежащие обложению (п. 1, 2 ст. 238 НК РФ) (По видам деятельности облагаемым по специальным налоговым режимам)");	
		мСтруктураПредставлениеПолей.Вставить("НеОблагаетсяПоСт238СР",		"Выплаты, не подлежащие обложению (п. 1, 2 ст. 238 НК РФ) (По видам деятельности облагаемым по специальным налоговым режимам)");	
		
		мСтруктураПредставлениеПолей.Вставить("ВыплатыЗаСчетПрибылиПоВсем",	"Выплаты, не отнесенные к расходам, уменьшающим налоговую базу по налогу на прибыль организаций");
		мСтруктураПредставлениеПолей.Вставить("НеОблагаетсяПоСт238ПоВсем",	"Выплаты, не подлежащие обложению (п. 1, 2 ст. 238 НК РФ)");	
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		мСтруктураПредставлениеПолей.Вставить("БазаППС",			        "База для ППС");
		мСтруктураПредставлениеПолей.Вставить("ОтчисленияПоППС",			"Отчисления по ППС");
		//Аверсон СВФР-007332
		
		ЗаполнитьПредставления(мСтруктураПредставлениеПолей);
		
	КонецПроцедуры //ЗаполнитьНачальныеНастройки
	
	// Процедура установки начальных настроек отчета для получение базы налогов и отчислений с использованием текста запроса
	//
	Процедура ЗаполнитьНалоговыеНастройки(ЭтоНеРасшифрофка, ЕстьПодразделение=Истина,ЕстьРаботник = Истина,ЕстьОрганизация = Истина) Экспорт
		
		ПолучитьНазваниеОтчета();
		
		запросНов = Новый Запрос;
		запросНов.Текст = 
		"ВЫБРАТЬ
		|	НДФЛРасчетыСБюджетом.Организация КАК Организация,
		|	НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
		|	СУММА(НДФЛРасчетыСБюджетом.Налог) КАК НалогПриход
		|ИЗ
		|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
		|ГДЕ
		|	НДФЛРасчетыСБюджетом.Налог > 0
		|	И НДФЛРасчетыСБюджетом.ВидДвижения = &ВидДвижения
		|	И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛРасчетыСБюджетом.Организация,
		|	НДФЛРасчетыСБюджетом.ФизЛицо";
		запросНов.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);
		запросНов.УстановитьПараметр("ДатаНач",ДатаНач);
		запросНов.УстановитьПараметр("ДатаКон",КонецДня(ДатаКон));
		рез = запросНов.Выполнить();
		
		
		
		Если ВидСравненияРаботника = ВидСравнения.Равно Тогда
			ВидСравненияРаботникаСтрокой = "=" 
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеРавно Тогда
			ВидСравненияРаботникаСтрокой = "<>"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСписке Тогда
			ВидСравненияРаботникаСтрокой = "В"
		Иначе
			ВидСравненияРаботникаСтрокой = "НЕ В"
		КонецЕсли;
		
		ЭтоНеРасшифрофка = НЕ ЗначениеЗаполнено(ИмяЯчейки);
		
		// Периоды
		// Таблица список периодов
		// Поля:
		//		Период
		// Описание:
		//  список периодов - первые даты месяцеы с начала года по "текущий" для запроса период
		//
		
		// конец месяца налогового периода
		КонецМесяца = КонецМесяца(ДатаНач);
		// первый месяц
		ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
		// прибавим остальные месяцы
		Для Сч = 2 По Месяц(ДатаКон) Цикл
			КонецМесяца = КонецМесяца(КонецМесяца+1);
			ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
		КонецЦикла;
		
		// ДанныеОбИнвалидности
		//	Поля:
		//		Период
		//		Физлицо
		//
		//	Описание:
		// 	таблица списка периодов-физлиц которые являются инвалидами
		//
		ДанныеОбИнвалидностиТекст = "
		|ВЫБРАТЬ
		|	Месяц(Периоды.Период) КАК Месяц,
		|	СведенияОбИнвалидностиФизлиц.Инвалидность,
		|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		Периоды.Период КАК Период,
		|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
		|		СведенияОбИнвалидностиФизлиц.Инвалидность,
		|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
		|	ИЗ ("+ ПериодыТекст +") КАК Периоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОбИнвалидностиФизлиц.Физлицо,
		|		СведенияОбИнвалидностиФизлиц.Инвалидность,
		|		Периоды.Период) КАК Периоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|		ПО СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра И СведенияОбИнвалидностиФизлиц.Физлицо = Периоды.Физлицо И СведенияОбИнвалидностиФизлиц.Инвалидность
		|";
		
		
		//СтавкаФСС_НС = БухгалтерскийИНалоговыйУчет.ПолучитьСтавкуВзносаНаСтрахованиеОтНесчастныхСлучаев(Организация, КонецМесяца(ДатаКон));	
		
		ПроцентТарифаДляИнвалидовТекст = "0.6";
		
		Если ЭтоНеРасшифрофка Тогда
			НДФЛИсчисленный = 
			"ВЫБРАТЬ
			|	НДФЛРасчетыСБюджетом.Организация КАК Организация,
			|	НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
			|	НДФЛРасчетыСБюджетом.Период КАК Период,
			|	НДФЛРасчетыСБюджетом.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	НДФЛРасчетыСБюджетом.Период КАК ПериодВзаиморасчетов,";
			
			Если ЕстьПодразделение Тогда
				НДФЛИсчисленный = НДФЛИсчисленный + "
				|   НДФЛРасчетыСБюджетом.ПодразделениеОрганизации,";
			КонецЕсли;
			НДФЛИсчисленный = НДФЛИсчисленный + "
			//Аверсон СВФР-007332
			
			|	сумма(НДФЛРасчетыСБюджетом.Налог) КАК НалогПриход
			|ИЗ";
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			//Если ОтборРаботника Тогда
			//	НДФЛИсчисленный = НДФЛИсчисленный + "
			//	|	РегистрНакопления.НДФЛРасчетыСБюджетом.Обороты(&ДатаНач, &ДатаКон, , ФизЛицо "+ ВидСравненияРаботникаСтрокой + " (&парамРаботник)) КАК НДФЛРасчетыСБюджетомОбороты";
			//Иначе
			//Аверсон СВФР-007332
			
			НДФЛИсчисленный = НДФЛИсчисленный + "
			|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом";
			
			//КонецЕсли;
			//Аверсон-софт, Островская Татьяна 11.09.2012 № 15804
			//Островская Татьяна 02.05.2013 № 16457
			НДФЛИсчисленный = НДФЛИсчисленный + "
			|
			|ГДЕ
			//|	НДФЛРасчетыСБюджетом.Налог > 0
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			//|	НДФЛРасчетыСБюджетом.ВидДвижения = &ВидДвижения
			|	НДФЛРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)";
			
			Если ОтборРаботника Тогда
				НДФЛИсчисленный = НДФЛИсчисленный + "
				|И НДФЛРасчетыСБюджетом.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
			КонецЕсли;
			НДФЛИсчисленный = НДФЛИсчисленный + "
			//Аверсон СВФР-007332
			
			|	И НДФЛРасчетыСБюджетом.Период МЕЖДУ &ДатаНач И &ДатаКон
			//|   И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
			|СГРУППИРОВАТЬ ПО
			|	НДФЛРасчетыСБюджетом.Организация,";
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			Если ЕстьПодразделение Тогда
				НДФЛИсчисленный = НДФЛИсчисленный + "
				|НДФЛРасчетыСБюджетом.ПодразделениеОрганизации,";
			КонецЕсли;
			НДФЛИсчисленный = НДФЛИсчисленный + "
			//Аверсон СВФР-007332
			
			|	НДФЛРасчетыСБюджетом.ФизЛицо,
			|	НДФЛРасчетыСБюджетом.Период,
			|	НДФЛРасчетыСБюджетом.ОбособленноеПодразделение";
			//|	НДФЛРасчетыСБюджетом.Налог,
			//|   НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
			//|	НДФЛРасчетыСБюджетом.Период";
			//Островская Татьяна 30.10.2012 № 15
			//Аверсон-софт, Островская Татьяна 11.09.2012 № 15804
		КонецЕсли;
		//Островская Татьяна 12.06.2014 № 17424
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ";
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ВложенныйЗапрос.Работник КАК Работник,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ВложенныйЗапрос.Организация КАК Организация,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21
		ТекстЗапроса = ТекстЗапроса + "
		|	СУММА(ВложенныйЗапрос.НДФЛ) КАК НДФЛ,
		|	СУММА(ВложенныйЗапрос.ФСЗН) КАК ФСЗН,
		|	СУММА(ВложенныйЗапрос.СТРАХ) КАК СТРАХ,
		|	СУММА(ВложенныйЗапрос.ПенсионныйФонд) КАК ПенсионныйФонд,
		
		//Аверсон ЕАЕ 30.03.2021 СВФР-007332 
		//|	ВложенныйЗапрос.Период,
		//Аверсон СВФР-007332
		//ПСА 23.07.2021 СВФР-007874+++
		|	ВложенныйЗапрос.Период,
		//+++ПСА 23.07.2021 СВФР-007874
		
		|	ВложенныйЗапрос.ПериодВзаиморасчетов, //Аверсон 21.03.2023 КВВ СВФР-010574
		
		|";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ВложенныйЗапрос.ПодразделениеОрганизации КАК ПодразделениеОрганизации,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|	СУММА(ВложенныйЗапрос.Доплата) как Доплата, //О.Т. 17.09.2014 № 225
		
		//Аверсон ЕАЕ 30.03.2021 СВФР-007332
		//|	ВложенныйЗапрос.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		//Аверсон СВФР-007332
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	СУММА(ВложенныйЗапрос.ОтчисленияПоППС) КАК ОтчисленияПоППС
		//Аверсон
		
		|	{ВЫБРАТЬ";
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	Работник,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	Организация.*,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21
		ТекстЗапроса = ТекстЗапроса + "
		|	НДФЛ,
		|	ФСЗН,
		|	СТРАХ,
		|	ПенсионныйФонд,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332 
		//|	Период,
		//Аверсон СВФР-007332
		
		//ПСА 23.07.2021 СВФР-007874+++
		|	Период,
		//+++ПСА 23.07.2021 СВФР-007874
		
		|	ПериодВзаиморасчетов, //Аверсон 21.03.2023 КВВ СВФР-010574
		
		|";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ПодразделениеОрганизации,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|	Доплата, //О.Т. 17.09.2014 № 225
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//|	ПериодВзаиморасчетов,
		//Аверсон СВФР-007332
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	ОтчисленияПоППС
		//Аверсон СВФР-007332
		
		|}//О.Т. Аверсон 08.12.2015 № 697
		|	ИЗ (ВЫБРАТЬ ";
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНИсчисленный.ФизЛицо КАК Работник,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНИсчисленный.ОбособленноеПодразделение КАК Организация,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21
		
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|	0 КАК НДФЛ,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса +"
		//О.Т. 12.07.2014 № 110
		|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		|	ЕСНИсчисленный.ОбязательноеСтрахование КАК СТРАХ,
		|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//О.Т. 12.07.2014 № 110
		|	ЕСНИсчисленный.Период,";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	РаботникиОрганизации.ПодразделениеОрганизации,";//Островская Татьяна 08.01.2014 № 17020
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		|	ЕСНИсчисленный.Доплата КАК Доплата,//О.Т. 17.09.2014 № 225
		|	ЕСНИсчисленный.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	0 КАК ОтчисленияПоППС
		//Аверсон СВФР-007332
		
		|";//О.Т. Аверсон 08.12.2015 № 697
		//|	СУММА(ЕСНИсчисленный.ТФОМС) КАК ТФОМС,
		//|	СУММА(ЕСНИсчисленный.ПФРСтраховая) КАК ПФРСтраховая,
		//|	СУММА(ЕСНИсчисленный.ПФРНакопительная) КАК ПФРНакопительная,";
		
		//ТекстЗапроса = ТекстЗапроса +"
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) < 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРСтраховая
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРСтраховая1,
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) < 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРНакопительная
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРНакопительная1,
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) >= 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРСтраховая
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРСтраховая2,
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) >= 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРНакопительная
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРНакопительная2,			
		//|	СУММА(ЕСНИсчисленный.ПФРНакопительная + ЕСНИсчисленный.ПФРСтраховая) КАК ПФРВзносыВсего,	
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) < 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРНакопительная + ЕСНИсчисленный.ПФРСтраховая
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРВзносыВсего1,
		//|	СУММА(ВЫБОР
		//|		КОГДА ГОД(ЕСНИсчисленный.ФизЛицо.ДатаРождения) >= 1967 
		//|			ТОГДА ЕСНИсчисленный.ПФРНакопительная + ЕСНИсчисленный.ПФРСтраховая
		//|		ИНАЧЕ 0 
		//|	КОНЕЦ) КАК ПФРВзносыВсего2,	
		//|	СУММА(ЕСНИсчисленный.ПФРНакопительная - ЕСНИсчисленный.ПФРНакопительнаяЕНВД) КАК ПФРНакопительнаяНеЕНВД,
		//|	СУММА(ЕСНИсчисленный.ПФРСтраховая - ЕСНИсчисленный.ПФРСтраховаяЕНВД) КАК ПФРСтраховаяНеЕНВД,
		//|	СУММА(ЕСНИсчисленный.ПФРНакопительная + ЕСНИсчисленный.ПФРСтраховая - ЕСНИсчисленный.ПФРНакопительнаяЕНВД - ЕСНИсчисленный.ПФРСтраховаяЕНВД) КАК ЛьготаПоВзносамВПФР,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФБ) КАК ПримененнаяЛьготаФБ,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФСС) КАК ПримененнаяЛьготаФСС,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФОМС) КАК ПримененнаяЛьготаФОМС,
		////  Сумма налога с налоговой льготы инвалидам за год  - строка 0500
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФБ * (МаксСтавкиЕСН.ФедеральныйБюджетВПроцентах - МаксСтавкиЕСН.ПФРСтраховая1вПроцентах - МаксСтавкиЕСН.ПФРНакопительная1вПроцентах) /100) КАК ПримененнаяЛьготаФБСумма,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФСС * МаксСтавкиЕСН.ФССвПроцентах /100) КАК ПримененнаяЛьготаФСССумма,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФОМС * МаксСтавкиЕСН.ФФОМСвПроцентах /100) КАК ПримененнаяЛьготаФФОМССумма,
		//|	СУММА(ЕСНИсчисленный.ПримененнаяЛьготаФОМС * МаксСтавкиЕСН.ТФОМСвПроцентах /100) КАК ПримененнаяЛьготаТФОМССумма,	
		//|	СУММА(ВЫБОР	
		//|			КОГДА СведенияИнвалидность.Инвалидность
		//|				ТОГДА (ЕСННачисления.База_ФСС_НС - ЕСННачисления.Скидка) * "  + ПроцентТарифаДляИнвалидовТекст + " * СтавкиФСС_НС.СтавкаФСС_НС / 100
		//|			ИНАЧЕ (ЕСННачисления.База_ФСС_НС - ЕСННачисления.Скидка) * СтавкиФСС_НС.СтавкаФСС_НС / 100
		//|		КОНЕЦ) КАК ФСС_НС";	
		//Если мВыбранныйПоказатель <> Неопределено Тогда
		//	ТекстЗапроса = 	ТекстЗапроса + ",
		//|	СУММА(ЕСНИсчисленный.ФедеральныйБюджет - (ЕСНИсчисленный.ПФРНакопительная + ЕСНИсчисленный.ПФРСтраховая - ЕСНИсчисленный.ПФРНакопительнаяЕНВД - ЕСНИсчисленный.ПФРСтраховаяЕНВД) - ЕСНИсчисленный.ПримененнаяЛьготаФБ) КАК НачисленоНалогаФБ,
		//|	СУММА(ЕСНИсчисленный.ФСС - ЕСНИсчисленный.ПримененнаяЛьготаФСС) КАК НачисленоНалогаФСС,
		//|	СУММА(ЕСНИсчисленный.ФФОМС - ЕСНИсчисленный.ПримененнаяЛьготаФОМС) КАК НачисленоНалогаФОМС,
		//|	СУММА(ЕСНИсчисленный.ТФОМС - ЕСНИсчисленный.ПримененнаяЛьготаФОМС) КАК НачисленоНалогаТФОМС";	
		//
		//КонецЕсли;
		
		Если мВыбранныйПоказатель = Неопределено Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|
			|{ВЫБРАТЬ ";
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьРаботник Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Работник,";
			КонецЕсли;
			Если ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Организация,";
			КонецЕсли;
			//О.Т. Аверсон 15.11.2016 № 21
			
			Если ЭтоНеРасшифрофка Тогда
				ТекстЗапроса = ТекстЗапроса +"
				|	НДФЛ,";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса +"
			|	ФСЗН,
			|	СТРАХ,
			|	ПенсионныйФонд,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	ОтчисленияПоППС,
			|	ПериодВзаиморасчетов,
			//Аверсон
			
			|";
			Если ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				
				|	Период,
				|	ПодразделениеОрганизации}"; //Островская Татьяна 08.01.2014 № 17020
			иначе
				ТекстЗапроса = ТекстЗапроса + "
				
				|	Период}"; //Островская Татьяна 08.01.2014 № 17020
				
			КонецЕсли;
			//|	ТФОМС,
			//|	ПФРСтраховая,
			//|	ПФРНакопительная,";
			//ТекстЗапроса = ТекстЗапроса +"
			//|	ПФРСтраховая1,
			//|	ПФРНакопительная1,
			//|	ПФРСтраховая2,
			//|	ПФРНакопительная2,
			//|	ПФРВзносыВсего,
			//|	ПФРВзносыВсего1,
			//|	ПФРВзносыВсего2,
			//|	ПФРНакопительнаяНеЕНВД,
			//|	ПФРСтраховаяНеЕНВД,
			//|	ЛьготаПоВзносамВПФР,
			//|	ПримененнаяЛьготаФБ,
			//|	ПримененнаяЛьготаФСС,
			//|	ПримененнаяЛьготаФОМС,
			//|   ПримененнаяЛьготаФБСумма,
			//|   ПримененнаяЛьготаФСССумма,
			//|   ПримененнаяЛьготаФФОМССумма,
			//|	ПримененнаяЛьготаТФОМССумма,
			//|	ФСС_НС}";		
		КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "
		|
		|ИЗ
		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный";
		//Если ЭтоНеРасшифрофка Тогда
		//	ТекстЗапроса = 	ТекстЗапроса + "
		//	|   ЛЕВОЕ СОЕДИНЕНИЕ ("+НДФЛИсчисленный+") КАК НДФЛИсчисленный
		//	|	ПО ЕСНИсчисленный.Физлицо = НДФЛИсчисленный.ФизЛицо И
		//	|	ЕСНИсчисленный.Организация = НДФЛИсчисленный.Организация";
		//КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "	
		//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК МаксСтавкиЕСН
		//|	ПО МаксСтавкиЕСН.ВидСтавокЕСНиПФР = ЕСНИсчисленный.Организация.ВидСтавокЕСНиПФР И МаксСтавкиЕСН.Год = &парамГод И МаксСтавкиЕСН.НомерСтрокиСтавок = 1		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК СведенияИнвалидность
		|	ПО СведенияИнвалидность.Физлицо = ЕСНИсчисленный.ФизЛицо И СведенияИнвалидность.Месяц = МЕСЯЦ(ЕСНИсчисленный.Период)";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|МАКСИМУМ(РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации) КАК ПодразделениеОрганизации
			|ИЗ
			|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|ИЗ
			|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК ВложенныйЗапрос
			|ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
			|ГДЕ
			|ЕСТЬNULL(ВложенныйЗапрос.ДатаУвольнения, 0) = 0 //Островская Татьяна 02.04.2014
			|
			|СГРУППИРОВАТЬ ПО
			//|РаботникиОрганизацийСрезПоследних.Сотрудник,
			|РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
			//|РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|) КАК РаботникиОрганизации
			|ПО ЕСНИсчисленный.ФизЛицо = РаботникиОрганизации.СотрудникФизлицо";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
		//|		ПО ЕСНИсчисленный.ФизЛицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо  //Островская Татьяна 08.01.2014 № 17020
		//|	ЛЕВОЕ СОЕДИНЕНИЕ(
		//|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|			ЕСТЬNULL(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.Ставка, 0) КАК СтавкаФСС_НС,
		//|			СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних.Организация
		//|		ИЗ
		//|			РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&ДатаКон, ) КАК СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних) КАК СтавкиФСС_НС
		//|	ПО ЕСНИсчисленный.Организация = СтавкиФСС_НС.Организация		
		//|	ЛЕВОЕ СОЕДИНЕНИЕ (
		//|		ВЫБРАТЬ	
		//|			ЕСН.ПериодРегистрации КАК ПериодРегистрации,
		//|			ЕСН.ФизЛицо КАК ФизЛицо,
		//|			СУММА(ЕСН.База_ФСС_НС) КАК База_ФСС_НС,
		//|			СУММА(ЕСН.Скидка) КАК Скидка
		//|		ИЗ
		//|			(ВЫБРАТЬ
		//|				ЕСНОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		//|				ЕСНОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		//|				ЕСНОсновныеНачисления.Результат КАК База_ФСС_НС,
		//|				0 КАК Скидка
		//|			ИЗ
		//|				РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления		
		//|
		//|			ГДЕ
		//|				ЕСНОсновныеНачисления.ПериодДействия МЕЖДУ &ДатаНач И &ДатаКон
		//|				И ЕСНОсновныеНачисления.Результат <> 0
		//|				И ЕСНОсновныеНачисления.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)";	
		//Если ОтборРаботника Тогда
		//	ТекстЗапроса = 	ТекстЗапроса + "
		//	|			И ЕСНОсновныеНачисления.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		//КонецЕсли;
		//
		//ТекстЗапроса = 	ТекстЗапроса + "
		//
		//|			ОБЪЕДИНИТЬ
		//|
		//|			ВЫБРАТЬ	
		//|				ЕСНДополнительныеНачисления.ПериодРегистрации,
		//|				ЕСНДополнительныеНачисления.ФизЛицо,
		//|				ЕСНДополнительныеНачисления.Результат,
		//|				ЕСНДополнительныеНачисления.Скидка
		//|			ИЗ
		//|				РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления		
		//|
		//|			ГДЕ
		//|				ЕСНДополнительныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		//|				И ЕСНДополнительныеНачисления.Результат <> 0
		//|				И ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)";
		//Если ОтборРаботника Тогда
		//	ТекстЗапроса = 	ТекстЗапроса + "
		//	|				И ЕСНДополнительныеНачисления.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		//КонецЕсли;
		//ТекстЗапроса = 	ТекстЗапроса + "
		//|		) КАК ЕСН
		//|	СГРУППИРОВАТЬ ПО ЕСН.ПериодРегистрации, ЕСН.ФизЛицо 
		//|			) КАК ЕСННачисления
		//|	ПО ЕСНИсчисленный.ФизЛицо = ЕСННачисления.ФизЛицо И ЕСННачисления.ПериодРегистрации = ЕСНИсчисленный.Период
		|
		|ГДЕ
		|		
		|	ЕСНИсчисленный.Период МЕЖДУ &ДатаНач И &ДатаКон
		|";
		Если ОтборРаботника Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|		И ЕСНИсчисленный.ФизЛицо " + ВидСравненияРаботникаСтрокой + " &парамРаботник";
		КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "		
		|
		|СГРУППИРОВАТЬ ПО ";
		
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНИсчисленный.ФизЛицо,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНИсчисленный.ОбособленноеПодразделение,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21    
		ТекстЗапроса = ТекстЗапроса + "
		|   ЕСНИсчисленный.Период,";
		//|   НДФЛИсчисленный.НалогПриход,
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|   РаботникиОрганизации.ПодразделениеОрганизации,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		//О.Т. 12.07.2014 № 110
		|	ЕСНИсчисленный.ФСЗН,
		|	ЕСНИсчисленный.ОбязательноеСтрахование,
		|	ЕСНИсчисленный.ПенсионныйФонд,
		//О.Т. 12.07.2014 № 110
		|	ЕСНИсчисленный.Доплата,
		|	ЕСНИсчисленный.ПериодВзаиморасчетов //О.Т. Аверсон 08.12.2015 № 697
		
		|   Объединить Все
		|   ВЫБРАТЬ ";
		
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	НДФЛИсчисленный.ФизЛицо КАК Работник,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	НДФЛИсчисленный.ОбособленноеПодразделение КАК Организация,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21
		
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|	НДФЛИсчисленный.НалогПриход КАК НДФЛ,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса +"
		|	0 КАК ФСЗН,
		|	0 КАК СТРАХ,
		|	0 КАК ПенсионныйФонд,
		|	НДФЛИсчисленный.Период,";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			//|	РаботникиОрганизации.ПодразделениеОрганизации,";//Островская Татьяна 08.01.2014 № 17020
			|	НДФЛИсчисленный.ПодразделениеОрганизации,";
			//Аверсон СВФР-007332
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|	Null,
		//|	Null,
		|	НДФЛИсчисленный.ПериодВзаиморасчетов,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	0
		//Аверсон
		
		|";//О.Т. Аверсон 08.12.2015 № 697
		Если мВыбранныйПоказатель = Неопределено Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|
			|{ВЫБРАТЬ ";
			
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьРаботник Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Работник,";
			КонецЕсли;
			Если ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Организация,";
			КонецЕсли;
			//О.Т. Аверсон 15.11.2016 № 21
			
			Если ЭтоНеРасшифрофка Тогда
				ТекстЗапроса = ТекстЗапроса +"
				|	НДФЛ,";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса +"
			|	ФСЗН,
			|	СТРАХ,
			|	ПенсионныйФонд,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	ОтчисленияПоППС,
			|	ПериодВзаиморасчетов,
			//Аверсон СВФР-007332
			
			|";
			Если ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Период,
				|	ПодразделениеОрганизации}"; //Островская Татьяна 08.01.2014 № 17020
			иначе
				ТекстЗапроса = ТекстЗапроса + "
				|	Период}"; //Островская Татьяна 08.01.2014 № 17020
			КонецЕсли;
			//|	ТФОМС,
			//|	ПФРСтраховая,
			//|	ПФРНакопительная,";
			//ТекстЗапроса = ТекстЗапроса +"
			//|	ПФРСтраховая1,
			//|	ПФРНакопительная1,
			//|	ПФРСтраховая2,
			//|	ПФРНакопительная2,
			//|	ПФРВзносыВсего,
			//|	ПФРВзносыВсего1,
			//|	ПФРВзносыВсего2,
			//|	ПФРНакопительнаяНеЕНВД,
			//|	ПФРСтраховаяНеЕНВД,
			//|	ЛьготаПоВзносамВПФР,
			//|	ПримененнаяЛьготаФБ,
			//|	ПримененнаяЛьготаФСС,
			//|	ПримененнаяЛьготаФОМС,
			//|   ПримененнаяЛьготаФБСумма,
			//|   ПримененнаяЛьготаФСССумма,
			//|   ПримененнаяЛьготаФФОМССумма,
			//|	ПримененнаяЛьготаТФОМССумма,
			//|	ФСС_НС}";		
		КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "
		|
		|ИЗ ("+НДФЛИсчисленный+") как НДФЛИсчисленный";
		//Если ЭтоНеРасшифрофка Тогда
		//	ТекстЗапроса = 	ТекстЗапроса + "
		//	|   ЛЕВОЕ СОЕДИНЕНИЕ ("+НДФЛИсчисленный+") КАК НДФЛИсчисленный
		//	|	ПО ЕСНИсчисленный.Физлицо = НДФЛИсчисленный.ФизЛицо И
		//	|	ЕСНИсчисленный.Организация = НДФЛИсчисленный.Организация";
		//КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "	
		//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК МаксСтавкиЕСН
		//|	ПО МаксСтавкиЕСН.ВидСтавокЕСНиПФР = ЕСНИсчисленный.Организация.ВидСтавокЕСНиПФР И МаксСтавкиЕСН.Год = &парамГод И МаксСтавкиЕСН.НомерСтрокиСтавок = 1		
		|	ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК СведенияИнвалидность
		|	ПО СведенияИнвалидность.Физлицо = НДФЛИсчисленный.ФизЛицо И СведенияИнвалидность.Месяц = МЕСЯЦ(НДФЛИсчисленный.Период)";
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//Если ЕстьПодразделение Тогда 
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//	|РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		//	|РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		//	|РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации
		//	|ИЗ
		//	|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
		//	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//	|РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		//	|РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
		//	|ИЗ
		//	|РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
		//	|ГДЕ
		//	|РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК ВложенныйЗапрос
		//	|ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
		//	|ГДЕ
		//	|ЕСТЬNULL(ВложенныйЗапрос.ДатаУвольнения, 0) = 0 //Островская Татьяна 02.04.2014
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|РаботникиОрганизацийСрезПоследних.Сотрудник,
		//	|РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации) КАК РаботникиОрганизации
		//	|ПО НДФЛИсчисленный.ФизЛицо = РаботникиОрганизации.СотрудникФизлицо";
		//КонецЕсли;
		//Аверсон СВФР-007332
		
		
		Если ОтборРаботника Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|		Где НДФЛИсчисленный.ФизЛицо " + ВидСравненияРаботникаСтрокой + " &парамРаботник";
		КонецЕсли;
		ТекстЗапроса = 	ТекстЗапроса + "		
		|
		|СГРУППИРОВАТЬ ПО ";
		//О.Т. Аверсон 15.11.2016 № 21
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	НДФЛИсчисленный.ФизЛицо,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	НДФЛИсчисленный.ОбособленноеПодразделение,";
		КонецЕсли;
		//О.Т. Аверсон 15.11.2016 № 21
		ТекстЗапроса = ТекстЗапроса + "
		|   НДФЛИсчисленный.Период,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	НДФЛИсчисленный.ПериодВзаиморасчетов,
		//Аверсон СВФР-007332
		
		|";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|   НДФЛИсчисленный.НалогПриход,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332 
			//|   РаботникиОрганизации.ПодразделениеОрганизации) КАК ВложенныйЗапрос";//Островская Татьяна 08.01.2014 № 17020
			|   НДФЛИсчисленный.ПодразделениеОрганизации";
			//Аверсон СВФР-007332 
			
		иначе
			ТекстЗапроса = ТекстЗапроса + "
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			//|   НДФЛИсчисленный.НалогПриход) КАК ВложенныйЗапрос";//Островская Татьяна 08.01.2014 № 17020
			|   НДФЛИсчисленный.НалогПриход";
			//Аверсон СВФР-007332
			
		КонецЕсли;
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//ППС
		ТекстЗапроса = ТекстЗапроса + "
		|   Объединить Все
		|   ВЫБРАТЬ ";
		
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНСведенияОДоходахППСОбороты.ФизЛицо КАК Работник,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНСведенияОДоходахППСОбороты.Организация КАК Организация,";
		КонецЕсли;
		
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|	0 КАК НДФЛ,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса +"
		|	0 КАК ФСЗН,
		|	0 КАК СТРАХ,
		|	0 КАК ПенсионныйФонд,
		|	ЕСНСведенияОДоходахППСОбороты.ПериодСекунда,";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	РаботникиОрганизации.ПодразделениеОрганизации,";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|	Null,
		|	ЕСНСведенияОДоходахППСОбороты.ПериодВзаиморасчетов,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	СУММА(ЕСНСведенияОДоходахППСОбороты.ППСОборот)
		//Аверсон СВФР-007332
		
		|";
		Если мВыбранныйПоказатель = Неопределено Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|
			|{ВЫБРАТЬ ";
			
			Если ЕстьРаботник Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Работник,";
			КонецЕсли;
			Если ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Организация,";
			КонецЕсли;
			
			Если ЭтоНеРасшифрофка Тогда
				ТекстЗапроса = ТекстЗапроса +"
				|	НДФЛ,";
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса +"
			|	ФСЗН,
			|	СТРАХ,
			|	ПенсионныйФонд,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|   ОтчисленияПоППС,
			|	ПериодВзаиморасчетов
			//Аверсон СВФР-007332
			
			|";
			Если ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Период,
				|	ПодразделениеОрганизации}";
			иначе
				ТекстЗапроса = ТекстЗапроса + "
				|	Период}";
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстЗапроса = 	ТекстЗапроса + "
		|
		|ИЗ РегистрНакопления.ЕСНСведенияОДоходахППС.Обороты(&ДатаНач, &ДатаКон, Авто) КАК ЕСНСведенияОДоходахППСОбороты";
		
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ различные ДокРегистратор.Сотрудник,ДокРегистратор.ФизЛицо,ДокРегистратор.Ссылка ИЗ Документ.РасчетППС.ОтработанноеВремя КАК ДокРегистратор) КАК РасчетППС
			|ПО РасчетППС.ФизЛицо = ЕСНСведенияОДоходахППСОбороты.ФизЛицо
			|	И РасчетППС.Ссылка = ЕСНСведенияОДоходахППСОбороты.Регистратор
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|					РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|					РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации
			|				   ИЗ
			|					РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
			|				   ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|										РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|										РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения
			|				   					 ИЗ
			|										РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, ) КАК РаботникиОрганизацийСрезПоследних
			|				   					 ГДЕ
			|										РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК ВложенныйЗапрос
			|				   ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ВложенныйЗапрос.Сотрудник
			|				   ГДЕ
			|					ЕСТЬNULL(ВложенныйЗапрос.ДатаУвольнения, 0) = 0
			|
			|				   СГРУППИРОВАТЬ ПО
			|					РаботникиОрганизацийСрезПоследних.Сотрудник,
			|					РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации) КАК РаботникиОрганизации
			|ПО РасчетППС.Сотрудник = РаботникиОрганизации.Сотрудник";
		КонецЕсли;
		
		Если ОтборРаботника Тогда
			ТекстЗапроса = 	ТекстЗапроса + "
			|		Где ЕСНСведенияОДоходахППСОбороты.ФизЛицо " + ВидСравненияРаботникаСтрокой + " &парамРаботник";
		КонецЕсли;
		
		ТекстЗапроса = 	ТекстЗапроса + "		
		|
		|СГРУППИРОВАТЬ ПО ";
		
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНСведенияОДоходахППСОбороты.ФизЛицо,";
		КонецЕсли;
		Если ЕстьОрганизация Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСНСведенияОДоходахППСОбороты.Организация,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|   ЕСНСведенияОДоходахППСОбороты.ПериодВзаиморасчетов,
		|   ЕСНСведенияОДоходахППСОбороты.ПериодСекунда,";
		Если ЕстьПодразделение Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|   0,
			|   РаботникиОрганизации.ПодразделениеОрганизации) КАК ВложенныйЗапрос";//Островская Татьяна 08.01.2014 № 17020
		иначе
			ТекстЗапроса = ТекстЗапроса + "
			|   0) КАК ВложенныйЗапрос";
			
		КонецЕсли;
		//Аверсон СВФР-007332
		
		
		Если мВыбранныйПоказатель = Неопределено Тогда //Островская Татьяна 02.05.2013 № 16457
			Если ЕстьОрганизация или ЕстьРаботник или ЕстьПодразделение Тогда //О.Т. Аверсон 15.11.2016 № 21
				ТекстЗапроса = 	ТекстЗапроса + "
				|	{ГДЕ ";
				
				//О.Т. Аверсон 15.11.2016 № 21 		
				Если ЕстьОрганизация и (ЕстьРаботник или ЕстьПодразделение) Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	ВложенныйЗапрос.Организация,";
				ИначеЕсли  ЕстьОрганизация и не (ЕстьРаботник или ЕстьПодразделение) Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	ВложенныйЗапрос.Организация"+ ?(ЕстьРаботник или ЕстьПодразделение,"","}");				
				КонецЕсли;
				Если ЕстьРаботник и ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	ВложенныйЗапрос.Работник,
					|	ВложенныйЗапрос.ПодразделениеОрганизации}";
				ИначеЕсли ЕстьРаботник и не ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	ВложенныйЗапрос.Работник}";
				ИначеЕсли не ЕстьРаботник и ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	ВложенныйЗапрос.ПодразделениеОрганизации}";	
				КонецЕсли;
				//О.Т. Аверсон 15.11.2016 № 21
				
			КонецЕсли;
			
			//Аверсон ЕАЕ 30.03.2021 СВФР-007332
			Если ЕстьПодразделение или ЕстьРаботник или ЕстьОрганизация Тогда
				ТекстЗапроса = ТекстЗапроса + "
				| СГРУППИРОВАТЬ ПО
				
				|	ВложенныйЗапрос.ПериодВзаиморасчетов, //Аверсон 21.03.2023 КВВ СВФР-010574
				
				|ВложенныйЗапрос.Период" + ?(ЕстьПодразделение или ЕстьРаботник или ЕстьОрганизация,", "," "); //ПСА 23.07.2021 СВФР-007874+++
			КонецЕсли;
			//|	СГРУППИРОВАТЬ ПО
			//|	ВложенныйЗапрос.Период,
			//|	ВложенныйЗапрос.ПериодВзаиморасчетов" + ?(ЕстьПодразделение или ЕстьРаботник или ЕстьОрганизация,", "," ");//О.Т. Аверсон 08.12.2015 № 697
			//Аверсон СВФР-007332
			
			Если ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				
				|	ВложенныйЗапрос.ПодразделениеОрганизации";
			КонецЕсли;
			
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьРаботник и ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьПодразделение,", ","") +" ВложенныйЗапрос.Работник,
				|	ВложенныйЗапрос.Организация";
			ИначеЕсли ЕстьРаботник и не ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьПодразделение,", ","")+"
				|	ВложенныйЗапрос.Работник";	
			ИначеЕсли не ЕстьРаботник и ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьПодразделение,", ","")+ "
				|	ВложенныйЗапрос.Организация";			
			КонецЕсли;
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьОрганизация или ЕстьРаботник Тогда 
				ТекстЗапроса = ТекстЗапроса + " 				
				|УПОРЯДОЧИТЬ ПО ";
				//О.Т. Аверсон 15.11.2016 № 21
				Если ЕстьОрганизация Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	Организация";
				КонецЕсли;
				Если ЕстьРаботник Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация,", ","") + " ВложенныйЗапрос.Работник.Наименование";
				КонецЕсли;
			КонецЕсли;
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьОрганизация или ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "		
				|{УПОРЯДОЧИТЬ ПО ";
				//О.Т. Аверсон 15.11.2016 № 21
				Если ЕстьОрганизация Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	Организация КАК Работник"+ ?(ЕстьПодразделение,"","}");
				КонецЕсли;
				//О.Т. Аверсон 15.11.2016 № 21
				
				Если ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация,", ","") + " ПодразделениеОрганизации}"; //Островская Татьяна 08.01.2014 № 17020
				КонецЕсли;
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			
			|	
			|ИТОГИ 
			|СУММА(НДФЛ),
			|СУММА(ФСЗН),
			|СУММА(СТРАХ),
			|СУММА(ПенсионныйФонд),
			|СУММА(Доплата),
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|СУММА(ОтчисленияПоППС)
			//Аверсон СВФР-007332
			
			|ПО
			|	ОБЩИЕ" +?(ЕстьОрганизация или ЕстьПодразделение или ЕстьРаботник,", ","");
			
			//О.Т. Аверсон 15.11.2016 № 21
			Если ЕстьОрганизация Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|	Организация";
			КонецЕсли;
			//О.Т. Аверсон 15.11.2016 № 21
			
			Если ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация,", ","") + " ПодразделениеОрганизации";  //Островская Татьяна 08.01.2014 № 17020
			КонецЕсли; 
			Если ЕстьРаботник Тогда 
				ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация или ЕстьПодразделение,", ","") + " Работник";
			КонецЕсли;
			Если ЕстьОрганизация или ЕстьРаботник или ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				|{ИТОГИ ПО ";
				
				//О.Т. Аверсон 15.11.2016 № 21
				Если ЕстьОрганизация Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	Организация"+ ?(ЕстьРаботник или ЕстьПодразделение,"","}");
				КонецЕсли;
				Если ЕстьРаботник Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация,", ","") + " Работник" + ?(ЕстьПодразделение,"","}");
				КонецЕсли;
				//О.Т. Аверсон 15.11.2016 № 21
				Если ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация или ЕстьРаботник,", ","")+ " ПодразделениеОрганизации}";//Островская Татьяна 08.01.2014 № 17020
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если мВыбранныйПоказатель <> Неопределено Тогда
			ТекстЗапроса  = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
			ТекстЗапроса = 	
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСН.Работник КАК Работник,
			|	ЕСН.Организация КАК Организация,
			|	СУММА(ЕСН.ФСЗН) КАК ФСЗН,
			|	СУММА(ЕСН.СТРАХ) КАК СТРАХ,
			|	СУММА(ЕСН.ПенсионныйФонд) КАК ПенсионныйФонд,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	СУММА(ЕСН.ОтчисленияПоППС) КАК ОтчисленияПоППС
			//Аверсон СВФР-007332
			
			//|	СУММА(ЕСН.ТФОМС) КАК ТФОМС,
			//|	СУММА(ЕСН.ПФРСтраховая) КАК ПФРСтраховая,
			//|	СУММА(ЕСН.ПФРНакопительная) КАК ПФРНакопительная,
			//|	СУММА(ЕСН.ПФРСтраховая1) КАК ПФРСтраховая1,
			//|	СУММА(ЕСН.ПФРНакопительная1) КАК ПФРНакопительная1,
			//|	СУММА(ЕСН.ПФРСтраховая2) КАК ПФРСтраховая2,
			//|	СУММА(ЕСН.ПФРНакопительная2) КАК ПФРНакопительная2,
			//|	СУММА(ЕСН.ПФРВзносыВсего) КАК ПФРВзносыВсего,
			//|	СУММА(ЕСН.ПФРВзносыВсего1) КАК ПФРВзносыВсего1,
			//|	СУММА(ЕСН.ПФРВзносыВсего2) КАК ПФРВзносыВсего2,
			//|	СУММА(ЕСН.ПФРНакопительнаяНеЕНВД) КАК ПФРНакопительнаяНеЕНВД,
			//|	СУММА(ЕСН.ПФРСтраховаяНеЕНВД) КАК ПФРСтраховаяНеЕНВД,
			//|	СУММА(ЕСН.ЛьготаПоВзносамВПФР) КАК ЛьготаПоВзносамВПФР,
			//|	СУММА(ЕСН.ПримененнаяЛьготаФБ) КАК ПримененнаяЛьготаФБ,
			//|	СУММА(ЕСН.ПримененнаяЛьготаФСС) КАК ПримененнаяЛьготаФСС,
			//|	СУММА(ЕСН.ПримененнаяЛьготаФОМС) КАК ПримененнаяЛьготаФОМС,
			//|   СУММА(ЕСН.ПримененнаяЛьготаФБСумма) КАК ПримененнаяЛьготаФБСумма,
			//|   СУММА(ЕСН.ПримененнаяЛьготаФСССумма) КАК ПримененнаяЛьготаФСССумма,
			//|   СУММА(ЕСН.ПримененнаяЛьготаФФОМССумма) КАК ПримененнаяЛьготаФФОМССумма,
			//|	СУММА(ЕСН.ПримененнаяЛьготаТФОМССумма) КАК ПримененнаяЛьготаТФОМССумма,
			//|	СУММА(ЕСН.ФСС_НС) КАК ФСС_НС,
			//|	//строких 6XX отчета по ЕСН
			//|	СУММА(ЕСН.НачисленоНалогаФБ) КАК НачисленоНалогаФБ,
			//|	СУММА(ЕСН.НачисленоНалогаФСС) КАК НачисленоНалогаФСС,
			//|	СУММА(ЕСН.НачисленоНалогаФОМС) КАК НачисленоНалогаФОМС,
			//|	СУММА(ЕСН.НачисленоНалогаТФОМС) КАК НачисленоНалогаТФОМС
			|
			|{ВЫБРАТЬ
			|	Работник,
			|	ФСЗН,
			|	СТРАХ,
			|	ПенсионныйФонд,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	ОтчисленияПоППС
			//Аверсон СВФР-007332
			
			|}
			//|	ТФОМС,
			//|	ПФРСтраховая,
			//|	ПФРНакопительная,
			//|	ПФРСтраховая1,
			//|	ПФРНакопительная1,
			//|	ПФРСтраховая2,
			//|	ПФРНакопительная2,
			//|	ПФРВзносыВсего,
			//|	ПФРВзносыВсего1,
			//|	ПФРВзносыВсего2,
			//|	ПФРНакопительнаяНеЕНВД,
			//|	ПФРСтраховаяНеЕНВД,
			//|	ЛьготаПоВзносамВПФР,
			//|	ПримененнаяЛьготаФБ,
			//|	ПримененнаяЛьготаФСС,
			//|	ПримененнаяЛьготаФОМС,
			//|   ПримененнаяЛьготаФБСумма,
			//|   ПримененнаяЛьготаФСССумма,
			//|   ПримененнаяЛьготаФФОМССумма,
			//|	ПримененнаяЛьготаТФОМССумма,
			//|	ФСС_НС,
			//|	НачисленоНалогаФБ,
			//|	НачисленоНалогаФСС,
			//|	НачисленоНалогаФОМС,
			//|	НачисленоНалогаТФОМС}		
			|
			|ИЗ
			|	(" +ТекстЗапроса+ ") КАК ЕСН 		
			|ГДЕ ЕСН." + мВыбранныйПоказатель + " <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСН.Организация,
			|	ЕСН.Работник,
			|	НДФЛИсчисленный.НДФЛ
			|	
			|УПОРЯДОЧИТЬ ПО
			|	ЕСН.Организация,
			|	ЕСН.Работник	
			|{ГДЕ
			|	ЕСН.Организация,
			|	ЕСН.Работник}	
			|{УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	Работник}
			|	
			|ИТОГИ ПО
			|	ОБЩИЕ,
			|	Организация,
			|	Работник";
			Если ЕстьОрганизация или ЕстьРаботник или ЕстьПодразделение Тогда 
				ТекстЗапроса = ТекстЗапроса + "
				
				|{ИТОГИ ПО ";
				Если ЕстьОрганизация Тогда 
					ТекстЗапроса = ТекстЗапроса + "
					|	Организация"+ ?(ЕстьРаботник или ЕстьПодразделение,"","}");
				КонецЕсли;
				Если ЕстьРаботник Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация,", ","")+" Работник"+ ?(ЕстьПодразделение,"","}");
				КонецЕсли;
				
				Если ЕстьПодразделение Тогда 
					ТекстЗапроса = ТекстЗапроса + ?(ЕстьОрганизация или ЕстьРаботник,", ","") + " ПодразделениеОрганизации}";//Островская Татьяна 08.01.2014 № 17020
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		//Островская Татьяна 12.06.2014 № 17424
		
		ПостроительОтчета.Текст = ТекстЗапроса;	
		
		Если ПостроительОтчета.Отбор.Количество() = 0 и мДокументРезультат = Неопределено Тогда
			МассивОтбора = Новый Массив;
			МассивОтбора.Добавить("Работник");
			МассивОтбора.Добавить("Организация");
			Если ЕстьПодразделение Тогда 
				МассивОтбора.Добавить("ПодразделениеОрганизации");//Островская Татьяна 08.01.2014 № 17020
			КонецЕсли;
			УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);	
		КонецЕсли;
		
		Если ЭтоНеРасшифрофка Тогда	
			//УдалитьВыбранноеПоле("ЛьготаПоВзносамВПФР");
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФБ");
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФСС");
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФОМС");
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФБСумма");		
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФСССумма");		
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаФФОМССумма");		
			//УдалитьВыбранноеПоле("ПримененнаяЛьготаТФОМССумма");		
			//УдалитьВыбранноеПоле("ПФРСтраховая1");		
			//УдалитьВыбранноеПоле("ПФРНакопительная1");
			//УдалитьВыбранноеПоле("ПФРСтраховая2");
			//УдалитьВыбранноеПоле("ПФРНакопительная2");		
			//УдалитьВыбранноеПоле("ПФРВзносыВсего");	
			//УдалитьВыбранноеПоле("ПФРВзносыВсего1");	
			//УдалитьВыбранноеПоле("ПФРВзносыВсего2");
			//УдалитьВыбранноеПоле("ПФРНакопительнаяНеЕНВД");
			//УдалитьВыбранноеПоле("ПФРСтраховаяНеЕНВД");				
		КонецЕсли;
		
	КонецПроцедуры //ЗаполнитьНалоговыеНастройки
	
	// Процедура установки начальных настроек отчета для вывода исчисленных налогов  с использованием текста запроса
	//
	Процедура ЗаполнитьБазовыеНастройки(ЭтоНеРасшифрофка, ЕстьПодразделение=Истина,ЕстьРаботник = Истина,ЕстьВидРасчета = Истина,ЕстьОрганизация = Истина) Экспорт
		
		ПолучитьНазваниеОтчета();	
		
		Если ВидСравненияРаботника = ВидСравнения.Равно Тогда
			ВидСравненияРаботникаСтрокой = "=" 
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.НеРавно Тогда
			ВидСравненияРаботникаСтрокой = "<>"
		ИначеЕсли ВидСравненияРаботника = ВидСравнения.ВСписке Тогда
			ВидСравненияРаботникаСтрокой = "В"
		Иначе
			ВидСравненияРаботникаСтрокой = "НЕ В"
		КонецЕсли; 					
		
		ГруппироватьПоВР = НЕ НеГруппироватьПоВР;
		
		// ---------------------------------------------------------------------------
		// тексты запросов
		//
		
		// Периоды
		// Таблица список периодов
		// Поля:
		//		Период
		// Описание:
		//  список периодов - первые даты месяцеы с начала года по "текущий" для запроса период
		//
		
		// конец месяца налогового периода
		КонецМесяца = КонецМесяца(ДатаНач);
		// первый месяц
		ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
		// прибавим остальные месяцы
		Для Сч = 2 По Месяц(ДатаКон) Цикл
			КонецМесяца = КонецМесяца(КонецМесяца+1);
			ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
		КонецЦикла;
		
		//СтавкаФСС_НС = БухгалтерскийИНалоговыйУчет.ПолучитьСтавкуВзносаНаСтрахованиеОтНесчастныхСлучаев(Организация, КонецМесяца(ДатаКон));	
		
		ПроцентТарифаДляИнвалидовТекст = "0.6";
		
		
		// ДанныеОПравеНаПенсию
		// Таблица Таблица Данные о праве на пенсию: - таблица это список иностранцев и периодов
		// Поля:
		//		Физлицо, 
		//		Месяц - месяц налогового периода
		// 
		// Описание:
		//	Выбираем Из Списка периодов
		//	Внутреннее соединение с ГражданствоФизЛиц.СрезПоследних
		//  по равенству периодов
		//  условие: что физлицо - не имеет права на пенсию
		//
		ДанныеОПравеНаПенсиюТекст = "
		|ВЫБРАТЬ
		|	Месяц(Периоды.Период) КАК Месяц,
		|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		Периоды.Период КАК Период,
		|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
		|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
		|	ИЗ
		|		("+ПериодыТекст+") КАК Периоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ГражданствоФизЛиц.ФизЛицо,
		|		Периоды.Период) КАК Периоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		|		ПО ГражданствоФизЛиц.Период = Периоды.ПериодРегистра И ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо И ГражданствоФизЛиц.НеИмеетПравоНаПенсию
		|";
		
		
		// ДанныеОбИнвалидности
		//	Поля:
		//		Период
		//		Физлицо
		//
		//	Описание:
		// 	таблица списка периодов-физлиц которые являются инвалидами
		//
		ДанныеОбИнвалидностиТекст = "
		|ВЫБРАТЬ
		|	Месяц(Периоды.Период) КАК Месяц,
		|	СведенияОбИнвалидностиФизлиц.Инвалидность,
		|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		Периоды.Период КАК Период,
		|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
		|		СведенияОбИнвалидностиФизлиц.Инвалидность,
		|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
		|	ИЗ
		|		("+ПериодыТекст+") КАК Периоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОбИнвалидностиФизлиц.Физлицо,
		|		СведенияОбИнвалидностиФизлиц.Инвалидность,
		|		Периоды.Период) КАК Периоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|		ПО СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра И СведенияОбИнвалидностиФизлиц.Физлицо = Периоды.Физлицо И СведенияОбИнвалидностиФизлиц.Инвалидность
		|";
		
		// УчетнаяПолитикаНалоговыйУчет
		// Таблица УчетнаяПолитикаНалоговыйУчетУСН - это список периодов, когда организация переходила на УСН
		// поля:
		//		УСН, 
		//		Месяц - месяц налогового периода
		// Описание:	
		//	Выбираем Из Периоды (таблица - список периодов с начала года по текущий период)
		//	Внутреннее соединение с "псевдосрезом" последних регистра УчетнаяПолитикаНалоговыйУчет
		//	по равенству периодов
		//  условие: что организация использует УСН	
		// УчетнаяПолитикаНалоговыйУчет = 
		//"ВЫБРАТЬ
		//|	МЕСЯЦ(Периоды.Период) КАК Месяц,
		//|	УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
		//|	УчетнаяПолитикаНалоговыйУчет.УСН КАК УСН
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		Периоды.Период КАК Период,
		//|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра,
		//|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация
		//|	ИЗ
		//|		("+ ПериодыТекст +") КАК Периоды
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
		//|		ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
		//|
		//|	СГРУППИРОВАТЬ ПО
		//|		Периоды.Период, УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
		//|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период И (УчетнаяПолитикаНалоговыйУчет.УСН) И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация";
		//
		
		// данный запрос нужен исключительно для расшифровок в разрезе ПВР
		РегРасчетЕСН = 	
		"ВЫБРАТЬ
		|	БазаЕСН.Период,";
		Если ГруппироватьПоВР Тогда
			РегРасчетЕСН = РегРасчетЕСН + "	
			|	БазаЕСН.ВидРасчета КАК ВидРасчета,";
		КонецЕсли;
		РегРасчетЕСН = РегРасчетЕСН + "	
		|	БазаЕСН.Работник КАК Работник,	
		|	БазаЕСН.Организация КАК Организация,	
		|	БазаЕСН.КодДоходаЕСН КАК КодДоходаЕСН,
		//|	БазаЕСН.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,	
		|	СУММА(БазаЕСН.Результат) КАК Результат,
		|	БазаЕСН.Сотрудник КАК Сотрудник //Островская Татьяна 23.12.2013 № 17003
		//|	СУММА(БазаЕСН.Скидка) КАК Скидка,
		//|	СУММА(БазаЕСН.ФСС_НС) КАК ФСС_НС
		|ИЗ	
		|	
		|	(ВЫБРАТЬ
		|		ЕСНОсновныеНачисления.ПериодРегистрации КАК Период,";
		Если ГруппироватьПоВР Тогда
			РегРасчетЕСН = РегРасчетЕСН + "		
			|		ЕСНОсновныеНачисления.ВидРасчета КАК ВидРасчета,";	
		КонецЕсли;
		РегРасчетЕСН = РегРасчетЕСН + "		
		|		ЕСНОсновныеНачисления.ФизЛицо КАК Работник,
		|		ЕСНОсновныеНачисления.ОбособленноеПодразделение КАК Организация,
		|		ЕСНОсновныеНачисления.КодДоходаЕСН КАК КодДоходаЕСН,
		//|		ЕСНОсновныеНачисления.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|		ЕСНОсновныеНачисления.Результат КАК Результат,
		|		ЕСНОсновныеНачисления.Сотрудник //Островская Татьяна 23.12.2013 № 17003
		//|		0 КАК Скидка,	
		//|		ВЫБОР
		//|			КОГДА ЕСНОсновныеНачисления.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//|				ТОГДА ЕСНОсновныеНачисления.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК ФСС_НС
		|	ИЗ
		|		РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
		|
		|	ГДЕ
		|		ЕСНОсновныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		|		И ЕСНОсновныеНачисления.Результат <> 0";
		Если ОтборРаботника Тогда
			РегРасчетЕСН = 	РегРасчетЕСН + "
			|		И ЕСНОсновныеНачисления.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		КонецЕсли;
		РегРасчетЕСН = 	РегРасчетЕСН + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|		
		|	ВЫБРАТЬ
		|		ЕСНДополнительныеНачисления.ПериодРегистрации,";
		Если ГруппироватьПоВР Тогда
			РегРасчетЕСН = РегРасчетЕСН + "		
			|		ЕСНДополнительныеНачисления.ВидРасчета,";
		КонецЕсли;
		РегРасчетЕСН = РегРасчетЕСН + "				
		|		ЕСНДополнительныеНачисления.ФизЛицо КАК Работник,
		|		ЕСНДополнительныеНачисления.ОбособленноеПодразделение,
		|		ЕСНДополнительныеНачисления.КодДоходаЕСН,
		//|		ЕСНДополнительныеНачисления.ОблагаетсяЕНВД,	
		|		ЕСНДополнительныеНачисления.Результат,
		|		ЕСНДополнительныеНачисления.Сотрудник //Островская Татьяна 23.12.2013 № 17003
		//|		ЕСНДополнительныеНачисления.Скидка,
		//|		ВЫБОР
		//|			КОГДА ЕСНДополнительныеНачисления.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
		//|				ТОГДА ЕСНДополнительныеНачисления.Результат - ЕСНДополнительныеНачисления.Скидка
		//|			ИНАЧЕ 0
		//|		КОНЕЦ
		|	ИЗ
		|		РегистрРасчета.ЕСНДополнительныеНачисления КАК ЕСНДополнительныеНачисления	
		|
		|	ГДЕ
		|		ЕСНДополнительныеНачисления.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		|		И ЕСНДополнительныеНачисления.Результат <> 0";
		Если ОтборРаботника Тогда
			РегРасчетЕСН = 	РегРасчетЕСН + "
			|		И ЕСНДополнительныеНачисления.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		КонецЕсли;
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		РегРасчетЕСН = 	РегРасчетЕСН + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|		
		|	ВЫБРАТЬ
		|		ЕСНСведенияОДоходахППСОбороты.ПериодВзаиморасчетов,";
		Если ГруппироватьПоВР Тогда
			РегРасчетЕСН = РегРасчетЕСН + "		
			|		""ППС"",";
		КонецЕсли;
		РегРасчетЕСН = РегРасчетЕСН + "				
		|		ЕСНСведенияОДоходахППСОбороты.ФизЛицо КАК Работник,
		|		ЕСНСведенияОДоходахППСОбороты.Организация,
		|		""ППС"",
		|		ЕСНСведенияОДоходахППСОбороты.ФОНДППСОборот,
		|		РасчетППС.Сотрудник
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходахППС.Обороты(&ДатаНач, &ДатаКон, Авто) КАК ЕСНСведенияОДоходахППСОбороты	
		|   ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ различные ДокРегистратор.Сотрудник,ДокРегистратор.ФизЛицо,ДокРегистратор.Ссылка ИЗ Документ.РасчетППС.ОтработанноеВремя КАК ДокРегистратор) КАК РасчетППС
		|	ПО РасчетППС.ФизЛицо = ЕСНСведенияОДоходахППСОбороты.ФизЛицо
		|		И РасчетППС.Ссылка = ЕСНСведенияОДоходахППСОбороты.Регистратор
		|";
		Если ОтборРаботника Тогда
			РегРасчетЕСН = 	РегРасчетЕСН + "
			|		И ЕСНСведенияОДоходахППСОбороты.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		КонецЕсли;
		//Аверсон СВФР-007332
		
		//РегРасчетЕСН = 	РегРасчетЕСН + "
		//|
		//|	ОБЪЕДИНИТЬ ВСЕ
		//|
		//|	ВЫБРАТЬ
		//|		ЕСНСведенияОДоходах.Период,";
		//Если ГруппироватьПоВР Тогда
		//	РегРасчетЕСН = РегРасчетЕСН + "		
		//|		""Ручные корректеровки"" КАК ВидРасчета,";
		//КонецЕсли;
		//РегРасчетЕСН = РегРасчетЕСН + "					
		//   |		ЕСНСведенияОДоходах.ФизЛицо,
		//   |		ЕСНСведенияОДоходах.ОбособленноеПодразделение,
		//|		ЕСНСведенияОДоходах.КодДоходаЕСН,
		////|		ЕСНСведенияОДоходах.ОблагаетсяЕНВД,
		//   |		ЕСНСведенияОДоходах.Результат
		////   |		ЕСНСведенияОДоходах.Скидка,
		////|		NULL
		//|	ИЗ
		//   |		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|	ГДЕ
		//   |		ЕСНСведенияОДоходах.Регистратор Ссылка Документ.НДФЛиЕСНДоходыИНалоги
		//   |		И ЕСНСведенияОДоходах.Период МЕЖДУ &ДатаНач И &ДатаКон";
		// Если ОтборРаботника Тогда
		//	РегРасчетЕСН = 	РегРасчетЕСН + "
		//	|		И ЕСНСведенияОДоходах.ФизЛицо " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		//КонецЕсли;	
		РегРасчетЕСН = 	РегРасчетЕСН + "		
		|) КАК БазаЕСН
		|СГРУППИРОВАТЬ ПО
		|	БазаЕСН.Период,";
		Если ГруппироватьПоВР Тогда
			РегРасчетЕСН = РегРасчетЕСН + "		
			|	БазаЕСН.ВидРасчета,";
		КонецЕсли;
		РегРасчетЕСН = РегРасчетЕСН + "		
		|	БазаЕСН.Работник,	
		|	БазаЕСН.Организация,	
		|	БазаЕСН.КодДоходаЕСН,
		|	БазаЕСН.Сотрудник"; //Островская Татьяна 23.12.2013 № 17003
		//|	БазаЕСН.ОблагаетсяЕНВД";
		
		// для базы НДФЛ
		РегРасчета = "ВЫБРАТЬ
		|	РегНачислений.ВидРасчета,
		|	РегНачислений.ФизЛицо,
		|	РегНачислений.Организация,
		|	СУММА(РегНачислений.Результат) КАК Результат,
		|	ВЫБОР
		|		КОГДА РегНачислений.КодДоходаНДФЛ = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
		|		ИНАЧЕ ЕСТЬNULL(РегНачислений.КодДоходаНДФЛ, ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию))
		|	КОНЕЦ КАК КодДоходаНДФЛ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации КАК Период,
		|		ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение КАК Организация,
		|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
		|		ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		|		ОсновныеНачисленияРаботниковОрганизаций.Результат КАК Результат,
		|		ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		|		И ОсновныеНачисленияРаботниковОрганизаций.Результат <> 0
		|		И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ ЕСТЬ НЕ NULL 
		|		И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ.СтавкаНалогообложенияРезидента ЕСТЬ НЕ NULL 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Результат,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|	ГДЕ
		|		ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		|		И ДополнительныеНачисленияРаботниковОрганизаций.Результат <> 0
		|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ ЕСТЬ НЕ NULL 
		|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.КодДоходаНДФЛ.СтавкаНалогообложенияРезидента ЕСТЬ НЕ NULL ) КАК РегНачислений
		|
		|СГРУППИРОВАТЬ ПО
		|	РегНачислений.ВидРасчета,
		|	РегНачислений.ФизЛицо,
		|	РегНачислений.Организация,
		|	РегНачислений.КодДоходаНДФЛ";
		
		
		
		ОборотНДФЛ = "ВЫБРАТЬ
		|	НДФЛСведенияОДоходах.ФизЛицо,
		|	НДФЛСведенияОДоходах.ОбособленноеПодразделение КАК Организация,
		|	НДФЛСведенияОДоходах.КодДохода,
		|	СУММА(НДФЛСведенияОДоходах.СуммаДохода) КАК СуммаДоходаОборот,
		|	СУММА(НДФЛСведенияОДоходах.СуммаВычета) КАК СуммаВычетаОборот
		|ИЗ
		|	РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
		|ГДЕ
		|	НДФЛСведенияОДоходах.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	НДФЛСведенияОДоходах.ФизЛицо,
		|	НДФЛСведенияОДоходах.ОбособленноеПодразделение,
		|	НДФЛСведенияОДоходах.КодДохода";
		
		
		РегРасчетНДФЛ = "
		|ВЫБРАТЬ                                                   
		|	ЕСТЬNULL(РегНачислений.ВидРасчета,""Ручные корректеровки"") КАК ВидРасчета,
		|	Сумма(РегНачислений.Результат - ВЫБОР КОГДА НДФЛСведенияОДоходахОбороты.СуммаДоходаОборот > 0 ТОГДА ВЫРАЗИТЬ(НДФЛСведенияОДоходахОбороты.СуммаВычетаОборот * РегНачислений.Результат / НДФЛСведенияОДоходахОбороты.СуммаДоходаОборот КАК Число(15,2)) ИНАЧЕ 0 КОНЕЦ) КАК Результат, //Аверсон ЕАЕ 27.01.2023 СВФР-010189 (округление)
		|	Сумма(РегНачислений.Результат) КАК РегНачисленийРезультат,
		|  Сумма(НДФЛСведенияОДоходахОбороты.СуммаДоходаОборот) КАК НДФЛСведенияОДоходахОборотыСуммаДоходаОборот,
		|	НДФЛСведенияОДоходахОбороты.Организация,
		|	НДФЛСведенияОДоходахОбороты.ФизЛицо
		|ИЗ
		|	("+ОборотНДФЛ+") КАК НДФЛСведенияОДоходахОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+РегРасчета+") КАК РегНачислений ПО
		|			НДФЛСведенияОДоходахОбороты.Организация = РегНачислений.Организация И
		| 			НДФЛСведенияОДоходахОбороты.ФизЛицо = РегНачислений.ФизЛицо И
		|			ВЫБОР 
		|				КОГДА (НДФЛСведенияОДоходахОбороты.КодДохода = Значение(Справочник.ДоходыНДФЛ.ПустаяСсылка)) ИЛИ НДФЛСведенияОДоходахОбороты.КодДохода ЕСТЬ NULL ТОГДА 
		|					РегНачислений.КодДоходаНДФЛ = Значение(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
		|				ИНАЧЕ
		|                  НДФЛСведенияОДоходахОбороты.КодДохода = РегНачислений.КодДоходаНДФЛ
		|			КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|  ЕСТЬNULL(РегНачислений.ВидРасчета,""Ручные корректеровки""),
		|  НДФЛСведенияОДоходахОбороты.ФизЛицо,
		|	НДФЛСведенияОДоходахОбороты.Организация"; 
		
		// Основной запрос
		БазовыйТекст =
		"ВЫБРАТЬ";
		Если ГруппироватьПоВР Тогда
			БазовыйТекст = БазовыйТекст + "
			|	ЕСТЬNULL(ЕСН.ВидРасчета,""Ручные корректеровки"") КАК ВидРасчета,";
		КонецЕсли;
		БазовыйТекст = БазовыйТекст + "
		|	ЕСН.Работник КАК Работник,	
		|	ЕСН.Организация КАК Организация,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//|	СУММА(ЕСН.Результат) КАК Начислено,
		|	СУММА(ВЫБОР КОГДА ЕСН.ВидРасчета = ""ППС"" ТОГДА 0 ИНАЧЕ ЕСН.Результат КОНЕЦ) КАК Начислено,
		//Аверсон СВФР-007332
		
		|	СУММА(ЕСН.БазаФСЗН) КАК БазаФСЗН,
		|	СУММА(ЕСН.БазаСТРАХ) КАК БазаСТРАХ,
		//|	СУММА(ЕСН.ФФОМС) КАК ФФОМС,
		//|	СУММА(ЕСН.ТФОМС) КАК ТФОМС,
		//|	СУММА(ЕСН.ПФРСтрах) КАК ПФРСтрах,
		//|	СУММА(ЕСН.ПФРНак) КАК ПФРНак,		
		//|	СУММА(ЕСН.РасходыЗаСчетФСС) КАК РасходыЗаСчетФСС,
		//|	СУММА(ЕСН.ПФРНеЕНВД) КАК ПФРНеЕНВД,
		//|	СУММА(ЕСН.ФСС_НС) КАК ФСС_НС,
		//|	СУММА(ЕСН.ЗаСчетПрибыли) КАК ЗаСчетПрибыли,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	СУММА(ЕСН.БазаППС) КАК БазаППС,
		//Аверсон СВФР-007332
		
		|	СУММА(ЕСН.ОблагаетсяВсего) КАК ОблагаетсяВсего,
		|	ЕСН.Сотрудник КАК Сотрудник";//Островская Татьяна 23.12.2013 № 17003	
		//|
		//|	СУММА(ЕСН.ПФРСтрах1)	КАК ПФРСтрах1,
		//|	СУММА(ЕСН.ПФРНак1)		КАК ПФРНак1,	
		//|	СУММА(ЕСН.ПФРСтрах2)	КАК ПФРСтрах2,
		//|	СУММА(ЕСН.ПФРНак2)		КАК ПФРНак2,";
		Если НЕ ЭтоНеРасшифрофка Тогда
			БазовыйТекст = БазовыйТекст 
			//|// Строка 1100 - справочно суммы не подлежащие налогообложению по ст. 238 НК РФ	
			//|	СУММА(ЕСН.П000020110003) КАК П000020110003,
			//
			//|	СУММА(ЕСН.НачисленоВсегоОбщ) КАК НачисленоВсегоОбщ,	
			//|	СУММА(ЕСН.НачисленоВсегоСР) КАК НачисленоВсегоСР,
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиОбщ) КАК ВыплатыЗаСчетПрибылиОбщ,
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиСР) КАК ВыплатыЗаСчетПрибылиСР,	
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238Общ) КАК НеОблагаетсяПоСт238Общ,
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238СР) КАК НеОблагаетсяПоСт238СР,
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиПоВсем) КАК ВыплатыЗаСчетПрибылиПоВсем,
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238ПоВсем) КАК НеОблагаетсяПоСт238ПоВсем,	
			//|	СУММА(ЕСН.П000020110004) КАК П000020110004";
		КонецЕсли;
		Если ЭтоНеРасшифрофка Тогда
			БазовыйТекст = БазовыйТекст + "
			//|NULL
			|{ВЫБРАТЬ	
			|	Работник,
			|	Организация,";
			Если ГруппироватьПоВР Тогда
				БазовыйТекст = БазовыйТекст + "		
				|	ВидРасчета,";
			КонецЕсли;
			БазовыйТекст = БазовыйТекст + "		
			|	Начислено,
			|	БазаФСЗН,
			|	БазаСТРАХ,
			//|	ФФОМС,
			//|	ТФОМС,
			//|	ПФРСтрах,
			//|	ПФРНак,
			//|	РасходыЗаСчетФСС,
			//|	ПФРНеЕНВД,
			//|	ФСС_НС,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|   БазаППС,
			//Аверсон СВФР-007332
			
			|	ОблагаетсяВсего}";
			//|	ЗаСчетПрибыли}";		
			
		КонецЕсли;
		БазовыйТекст = БазовыйТекст + "
		|
		|ИЗ	
		|	(ВЫБРАТЬ";
		Если ГруппироватьПоВР Тогда
			БазовыйТекст = БазовыйТекст + "	
			|		ЕСН_Начисления.ВидРасчета КАК ВидРасчета,";
		КонецЕсли;		
		БазовыйТекст = БазовыйТекст + "
		|		ЕСН_Начисления.Работник КАК Работник,
		|		ЕСН_Начисления.Организация КАК Организация,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//|		ВЫБОР
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуФСЗН
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат)
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК БазаФСЗН,
		|		СУММА(ВЫБОР
		|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуФСЗН
		|				ТОГДА ЕСН_Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК БазаФСЗН,
		//|		ВЫБОР
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуСтрах
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат)
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК БазаСТРАХ,
		|		СУММА(ВЫБОР
		|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуСтрах
		|				ТОГДА ЕСН_Начисления.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК БазаСТРАХ,
		//Аверсон СВФР-007332
		
		//|		ВЫБОР
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуФСЗН И НЕ ЕСН_Начисления.ОблагаетсяЕНВД
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка)
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК ФФОМС,
		//|		ВЫБОР
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуФСЗН И НЕ ЕСН_Начисления.ОблагаетсяЕНВД
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка)
		//|			ИНАЧЕ 0
		//|		КОНЕЦ КАК ТФОМС,	
		//|		ВЫБОР 
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL)
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРСтрах,
		//|		ВЫБОР 
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL) 
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРНак,		
		//|		ВЫБОР 
		//|			КОГДА ГОД(ЕСН_Начисления.Работник.ДатаРождения) < 1967 И ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL)
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРСтрах1,	
		//|		ВЫБОР 
		//|			КОГДА ГОД(ЕСН_Начисления.Работник.ДатаРождения) < 1967 И ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL) 
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРНак1,		
		//|		ВЫБОР 
		//|			КОГДА ГОД(ЕСН_Начисления.Работник.ДатаРождения) >= 1967 И ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL)
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРСтрах2,	
		//|		ВЫБОР 
		//|			КОГДА ГОД(ЕСН_Начисления.Работник.ДатаРождения) >= 1967 И ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL)
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРНак2,	
		//|		ВЫБОР 
		//|			КОГДА ЕСН_Начисления.ОблагаетсяЕНВД ИЛИ УчетнаяПолитикаНалоговыйУчетУСН.УСН
		//|				ТОГДА 0	
		//|			КОГДА ЕСН_Начисления.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж И (Иностр.Физлицо ЕСТЬ NULL)
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат - ЕСН_Начисления.Скидка) 
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК ПФРНеЕНВД,	
		//|		ВЫБОР КОГДА ЕСН_Начисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.БольничныйИзФСЗН) И НЕ ЕСН_Начисления.ОблагаетсяЕНВД И УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ NULL
		//|				ТОГДА СУММА(ЕСН_Начисления.Результат)
		//|			ИНАЧЕ 0 
		//|		КОНЕЦ КАК РасходыЗаСчетФСС,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//|		СУММА(ВЫБОР КОГДА НЕ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ОблагаетсяВсего,
		|		СУММА(ВЫБОР КОГДА НЕ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью) И ЕСН_Начисления.КодДоходаЕСН <> ""ППС"" ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ОблагаетсяВсего,
		//Аверсон СВФР-007332
		
		// Строка 1000 - справочно выплаты за счет прибыли
		//|	СУММА(ВЫБОР КОГДА ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ВыплатыЗаСчетПрибыли) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ЗаСчетПрибыли,
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ NULL И НЕ ЕСН_Начисления.ОблагаетсяЕНВД И ЕСН_Начисления.КодДоходаЕСН <> Значение(Справочник.ДоходыЕСН.НеЯвляетсяОбъектом) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК НачисленоВсегоОбщ,
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И (УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ НЕ NULL ИЛИ ЕСН_Начисления.ОблагаетсяЕНВД) И ЕСН_Начисления.КодДоходаЕСН <> Значение(Справочник.ДоходыЕСН.НеЯвляетсяОбъектом) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК НачисленоВсегоСР,
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ NULL И НЕ ЕСН_Начисления.ОблагаетсяЕНВД И ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ВыплатыЗаСчетПрибыли) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ВыплатыЗаСчетПрибылиОбщ,
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И (УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ НЕ NULL ИЛИ ЕСН_Начисления.ОблагаетсяЕНВД) И ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ВыплатыЗаСчетПрибыли) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ВыплатыЗаСчетПрибылиСР,		
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ NULL И НЕ ЕСН_Начисления.ОблагаетсяЕНВД И (ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ПособияЗаСчетФСС) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью)) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ ЕСН_Начисления.Скидка КОНЕЦ) КАК НеОблагаетсяПоСт238Общ,
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И (УчетнаяПолитикаНалоговыйУчетУСН.УСН ЕСТЬ НЕ NULL ИЛИ ЕСН_Начисления.ОблагаетсяЕНВД) ТОГДА ВЫБОР КОГДА ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ПособияЗаСчетФСС) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ ЕСН_Начисления.Скидка КОНЕЦ ИНАЧЕ 0 КОНЕЦ) КАК НеОблагаетсяПоСт238СР,	
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ВыплатыЗаСчетПрибыли) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ 0 КОНЕЦ) КАК ВыплатыЗаСчетПрибылиПоВсем,	
		//|	СУММА(ВЫБОР КОГДА Иностр.Физлицо ЕСТЬ NULL И (ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.БольничныйИзФСЗН) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью)) ТОГДА ЕСН_Начисления.Результат ИНАЧЕ ЕСН_Начисления.Скидка КОНЕЦ) КАК НеОблагаетсяПоСт238ПоВсем,
		|	СУММА(ЕСН_Начисления.Результат) КАК Результат,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|СУММА(ВЫБОР
		|КОГДА ЕСН_Начисления.КодДоходаЕСН = ""ППС""
		|ТОГДА ЕСН_Начисления.Результат
		|ИНАЧЕ 0
		|КОНЕЦ) КАК БазаППС,	
		//Аверсон
		
		|	ЕСН_Начисления.Сотрудник КАК Сотрудник //Островская Татьяна 23.12.2013 № 17003
		//|	СУММА(ВЫБОР
		//|			КОГДА СведенияИнвалидность.Инвалидность
		//|				ТОГДА ЕСН_Начисления.ФСС_НС * " + ПроцентТарифаДляИнвалидовТекст + "
		//|			ИНАЧЕ ЕСН_Начисления.ФСС_НС
		//|		КОНЕЦ) КАК ФСС_НС,
		//|	СУММА(ВЫБОР КОГДА (ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.БольничныйИзФСЗН) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью)) И НЕ ЕСН_Начисления.ОблагаетсяЕНВД ТОГДА ЕСН_Начисления.Результат ИНАЧЕ ЕСН_Начисления.Скидка КОНЕЦ) КАК П000020110003,
		//|	СУММА(ВЫБОР КОГДА (ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.БольничныйИзФСЗН) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.НеОблагаетсяПолностью) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ) ИЛИ ЕСН_Начисления.КодДоходаЕСН = Значение(Справочник.ДоходыЕСН.ОблагаетсяФСЗНиСТРАХ)) И НЕ ЕСН_Начисления.ОблагаетсяЕНВД ТОГДА ЕСН_Начисления.Результат ИНАЧЕ ЕСН_Начисления.Скидка КОНЕЦ) КАК П000020110004
		//|
		|	ИЗ
		|		("+РегРасчетЕСН+") КАК ЕСН_Начисления
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		//|ЛЕВОЕ СОЕДИНЕНИЕ (" + ППС + ") КАК ППС
		//|ПО ППС.Организация = ЕСН_Начисления.Организация И ППС.ФизЛицо = ЕСН_Начисления.Работник И ППС.Период = МЕСЯЦ(ЕСН_Начисления.Период)
		//Аверсон СВФР-007332
		
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОбИнвалидностиТекст+") КАК СведенияИнвалидность
		|		ПО СведенияИнвалидность.Физлицо = ЕСН_Начисления.Работник И СведенияИнвалидность.Месяц = МЕСЯЦ(ЕСН_Начисления.Период)	
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ДанныеОПравеНаПенсиюТекст+") КАК Иностр
		|		ПО Иностр.Физлицо = ЕСН_Начисления.Работник И Иностр.Месяц = МЕСЯЦ(ЕСН_Начисления.Период)";
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ("+УчетнаяПолитикаНалоговыйУчет+") КАК УчетнаяПолитикаНалоговыйУчетУСН
		//|		ПО МЕСЯЦ(ЕСН_Начисления.Период) = УчетнаяПолитикаНалоговыйУчетУСН.Месяц И ВЫБОР КОГДА ЕСН_Начисления.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА ЕСН_Начисления.Организация ИНАЧЕ ЕСН_Начисления.Организация.ГоловнаяОрганизация КОНЕЦ = УчетнаяПолитикаНалоговыйУчетУСН.Организация";	
		
		Если ОтборРаботника Тогда
			БазовыйТекст = 	БазовыйТекст + "
			|		И ЕСН_Начисления.Работник " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		КонецЕсли;
		
		БазовыйТекст = 	БазовыйТекст + "		
		|
		|	
		|	СГРУППИРОВАТЬ ПО";
		Если ГруппироватьПоВР Тогда
			БазовыйТекст = БазовыйТекст + "
			|		ЕСН_Начисления.ВидРасчета,";
		КонецЕсли;
		БазовыйТекст = БазовыйТекст + "
		|		ЕСН_Начисления.Работник,
		|		ЕСН_Начисления.Организация,
		|		ЕСН_Начисления.КодДоходаЕСН,
		|		ЕСН_Начисления.Сотрудник,//Островская Татьяна 23.12.2013 № 17003
		//|		ЕСН_Начисления.ОблагаетсяЕНВД,		
		|		Иностр.Физлицо) КАК ЕСН
		//|		УчетнаяПолитикаНалоговыйУчетУСН.УСН) КАК ЕСН
		|
		|";
		//Если ОтборРаботника Тогда
		//	БазовыйТекст = 	БазовыйТекст + "
		//	|		И ЕСН.Работник " + ВидСравненияРаботникаСтрокой + " (&парамРаботник)";
		//КонецЕсли;
		
		БазовыйТекст = 	БазовыйТекст + "	
		|
		|СГРУППИРОВАТЬ ПО";		
		Если ГруппироватьПоВР Тогда
			БазовыйТекст = БазовыйТекст + "
			|	ЕСН.ВидРасчета,";
		КонецЕсли;
		БазовыйТекст = БазовыйТекст + "		
		|	ЕСН.Работник,
		|	ЕСН.Организация,
		|	ЕСН.Сотрудник //Островская Татьяна 23.12.2013 № 17003
		|";      	
		
		
		Если ЭтоНеРасшифрофка Тогда
			БазовыйТекстЗапроса = БазовыйТекст;
		Иначе
			БазовыйТекстЗапроса = 
			"ВЫБРАТЬ";		
			Если ГруппироватьПоВР Тогда
				БазовыйТекстЗапроса = БазовыйТекстЗапроса + "
				|	ЕСТЬNULL(База.ВидРасчета,""Ручные корректеровки"") КАК ВидРасчета,";
			КонецЕсли;
			БазовыйТекстЗапроса = БазовыйТекстЗапроса + "
			|	База.Работник КАК Работник,	
			|	База.Организация КАК Организация,	
			|	СУММА(База.Начислено) КАК БазаНачислено,	
			|	СУММА(База.БазаФСЗН) КАК БазаФСЗН,
			|	СУММА(База.БазаСТРАХ) КАК БазаСТРАХ,
			//|	СУММА(База.ФФОМС) КАК ФФОМС,
			//|	СУММА(База.ТФОМС) КАК ТФОМС,
			//|	СУММА(База.ПФРСтрах) КАК ПФРСтрах,
			//|	СУММА(База.ПФРНак) КАК ПФРНак,		
			//|	СУММА(База.РасходыЗаСчетФСС) КАК РасходыЗаСчетФСС,
			//|	СУММА(База.ПФРНеЕНВД) КАК ПФРНеЕНВД,
			//|	СУММА(База.ФСС_НС) КАК ФСС_НС,
			//|	СУММА(База.ЗаСчетПрибыли) КАК ЗаСчетПрибыли,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|   СУММА(База.БазаППС) КАК БазаППС,
			//Аверсон СВФР-007332
			
			|	СУММА(База.ОблагаетсяВсего) КАК ОблагаетсяВсего,
			|	ЕСН.Сотрудник КАК Сотрудник  //Островская Татьяна 23.12.2013 № 17003
			
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ЕСН
			//|	//***************************************************		
			//|	СУММА(ВЫБОР	КОГДА СтавкиФБ.НомерСтрокиСтавок = 1 ТОГДА База.ФБ	КОГДА База.ФБ < 0 ТОГДА База.ФБ ИНАЧЕ 0 КОНЕЦ) КАК П000210001003,
			//|	СУММА(ВЫБОР	КОГДА СтавкиФСС.НомерСтрокиСтавок = 1 ТОГДА База.ФСС КОГДА База.ФСС < 0 ТОГДА База.ФСС ИНАЧЕ 0 КОНЕЦ) КАК П000210001004,
			//|	СУММА(ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 1 ТОГДА База.ФФОМС КОГДА База.ФФОМС < 0 ТОГДА База.ФФОМС ИНАЧЕ 0 КОНЕЦ) КАК П000210001005,
			//|	ВЫБОР	КОГДА СтавкиФБ.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФБ < 0 ТОГДА 1	ИНАЧЕ 0	КОНЕЦ		КАК П000210001006,
			//|	ВЫБОР	КОГДА СтавкиФСС.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФСС < 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ		КАК П000210001007,
			//|	ВЫБОР	КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФФОМС < 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ	КАК П000210001008,
			//|
			//|
			//|//	Строки 021 и 022 - Налоговые базы второго предела (до 600000 рублей) 
			//|	ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 									КАК П000210002106, 
			//|	ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 									КАК П000210002107, 
			//|	ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 								КАК П000210002108,
			//|	СУММА(ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 2 ТОГДА База.ФБ - СтавкиФБ.СуммаДоходаС	ИНАЧЕ 0 КОНЕЦ)		КАК П000210002203, 
			//|	СУММА(ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 2 ТОГДА База.ФСС - СтавкиФСС.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ) 	КАК П000210002204, 
			//|	СУММА(ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 2 ТОГДА База.ФФОМС - СтавкиФФОМС.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ)КАК П000210002205,
			//|//	Строки 031 и 032 - Налоговые базы третьего предела (свыше 600000 рублей) 
			//|	ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 3 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ									КАК П000210003106, 
			//|	ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 3 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ									КАК П000210003107, 
			//|	ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 3 ТОГДА 1	ИНАЧЕ 0 КОНЕЦ								КАК П000210003108,
			//|	СУММА(ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 3 ТОГДА База.ФБ - СтавкиФБ.СуммаДоходаС	ИНАЧЕ 0 КОНЕЦ)		КАК П000210003203, 
			//|	СУММА(ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 3 ТОГДА База.ФСС - СтавкиФСС.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ) 	КАК П000210003204, 
			//|	СУММА(ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 3 ТОГДА База.ФФОМС - СтавкиФФОМС.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ)КАК П000210003205,
			//
			//|// Строка 1100 - справочно суммы не подлежащие налогообложению по ст. 238 НК РФ	
			//|	СУММА(База.П000020110003) КАК П000020110003,
			//|	СУММА(База.П000020110004) КАК П000020110004,
			//
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ПФР
			//|	//***************************************************	
			//|	СУММА(База.НачисленоВсегоОбщ) КАК НачисленоВсегоОбщ,
			//|	СУММА(База.НачисленоВсегоСР) КАК НачисленоВсегоСР,		
			//|	СУММА(База.ВыплатыЗаСчетПрибылиОбщ) КАК ВыплатыЗаСчетПрибылиОбщ,
			//|	СУММА(База.ВыплатыЗаСчетПрибылиСР) КАК ВыплатыЗаСчетПрибылиСР,			
			//|	СУММА(База.НеОблагаетсяПоСт238Общ) КАК НеОблагаетсяПоСт238Общ,
			//|	СУММА(База.НеОблагаетсяПоСт238СР) КАК НеОблагаетсяПоСт238СР,
			//|	СУММА(База.ВыплатыЗаСчетПрибылиПоВсем) КАК ВыплатыЗаСчетПрибылиПоВсем,
			//|	СУММА(База.НеОблагаетсяПоСт238ПоВсем) КАК НеОблагаетсяПоСт238ПоВсем,	
			//|
			//|	СУММА(База.ПФРСтрах1)	КАК ПФРСтрах1,
			//|	СУММА(База.ПФРНак1)		КАК ПФРНак1,	
			//|	СУММА(База.ПФРСтрах2)	КАК ПФРСтрах2,
			//|	СУММА(База.ПФРНак2)		КАК ПФРНак2,
			//|	// До 280 000 
			//|
			//|	// строка 100 - первая возрастная группа
			//|	СУММА(ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах1 < 0) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРСтрах1) 		КАК П000220010004, 
			//|	СУММА(ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРНеЕНВД) 		КАК П000220010005, // под ОСН
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ		 							КАК П000220010006, 
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) < 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ			КАК П000220010007, 
			//
			//|	// строка 101 - вторая возрастная группа
			//|	СУММА(ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРСтрах) 		КАК П000220010104, 
			//|	СУММА(ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРНеЕНВД)		КАК П000220010105, // под ОСН
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ  								КАК П000220010106, 
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ			КАК П000220010107, 
			//|
			//|	// От 280 000 до 600 000: 
			//|
			//|	// строка 210 - первая возрастная группа 
			////	|	Сумма(Выбор КОГДА Ставки.НомерСтрокиСтавок = 2 И Доходы.НомерВозрастнойГруппы = 1 ТОГДА Ставки.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ)										КАК П000220021004, 
			//|	Сумма(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА СтавкиПФРСтрах.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ)											КАК П000220021004, 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА База.ПФРНеЕНВД * СтавкиПФРСтрах.СуммаДоходаС / База.ПФРСтрах ИНАЧЕ 0 КОНЕЦ)	КАК П000220021005, // база под ОСН 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ	 																		КАК П000220021006, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 												КАК П000220021007, 
			//|	// строка 211 - вторая возрастная группа 
			//|	Сумма(Выбор КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА СтавкиПФРСтрах.СуммаДоходаС ИНАЧЕ 0 КОНЕЦ)										КАК П000220021104, 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА База.ПФРНеЕНВД * СтавкиПФРСтрах.СуммаДоходаС / База.ПФРСтрах ИНАЧЕ 0 КОНЕЦ)	КАК П000220021105, // база под ОСН 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ 																		КАК П000220021106, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ		 										КАК П000220021107, 
			//|
			//|	// строка 220 - первая возрастная группа 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * (База.ПФРСтрах - СтавкиПФРСтрах.СуммаДоходаС)) 							КАК П000220022004,	// база за минусом 280000
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА База.ПФРНеЕНВД * (База.ПФРСтрах - СтавкиПФРСтрах.СуммаДоходаС) / База.ПФРСтрах ИНАЧЕ 0 КОНЕЦ)	КАК П000220022005,	// база под ОСН за минусом 280000
			//|	// строка 221 - вторая возрастная группа 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * (База.ПФРСтрах - СтавкиПФРСтрах.СуммаДоходаС)) 							КАК П000220022104,	// база за минусом 280000
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА База.ПФРНеЕНВД * (База.ПФРСтрах - СтавкиПФРСтрах.СуммаДоходаС) / База.ПФРСтрах ИНАЧЕ 0 КОНЕЦ)КАК П000220022105, 		// база под ОСН за минусом 280000
			//|
			//|	// Свыше 600 000: 
			//|
			//|	// строка 300 - первая возрастная группа 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРСтрах )		КАК П000220030004, // вся база
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРНеЕНВД )		КАК П000220030005, // вся база под ОСН
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)							КАК П000220030006, // численность
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) < 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) 	КАК П000220030007, 
			//|	// строка 301 - вторая возрастная группа 
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРСтрах )		КАК П000220030104, // вся база
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ * База.ПФРНеЕНВД )		КАК П000220030105, // вся база  под ОСН
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)							КАК П000220030106, // численность
			//|	СУММА(ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 3 И ГОД(База.Работник.ДатаРождения) >= 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)	КАК П000220030107 
			|	
			|{ВЫБРАТЬ
			|	Работник,
			|	Организация,";
			Если ГруппироватьПоВР Тогда
				БазовыйТекстЗапроса = БазовыйТекстЗапроса + "
				|	ВидРасчета,";
			КонецЕсли;
			БазовыйТекстЗапроса = БазовыйТекстЗапроса + "
			|	Начислено,
			|	БазаФСЗН,
			|	БазаСТРАХ,
			//|	ФФОМС,
			//|	ТФОМС,
			//|	ПФРСтрах,
			//|	ПФРНак,
			//|	РасходыЗаСчетФСС,
			//|	ПФРНеЕНВД,
			//|	ФСС_НС,
			
			//Аверсон ЕАЕ 29.03.2021 СВФР-007332
			|	БазаППС,
			//Аверсон СВФР-007332
			
			|	ОблагаетсяВсего}
			//|	ЗаСчетПрибыли,	
			
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ЕСН
			//|	//***************************************************	
			//|
			//|//	Строка 010 - Налоговые базы первого предела (до 280000 рублей) 
			//|	П000210001003,
			//|	П000210001004,
			//|	П000210001005,
			//|	П000210001006,
			//|	П000210001007,
			//|	П000210001008,	
			//|//	Строки 021 и 022 - Налоговые базы второго предела (до 600000 рублей) 
			//|	П000210002106, 
			//|	П000210002107,
			//|	П000210002108,
			//|	П000210002203,
			//|	П000210002204,
			//|	П000210002205,	
			//|//	Строки 031 и 032 - Налоговые базы третьего предела (свыше 600000 рублей) 
			//|	П000210003106,
			//|   П000210003107,
			//|   П000210003108,
			//|   П000210003203,
			//|   П000210003204,
			//|   П000210003205,	
			//|// Строка 1100 - справочно суммы не подлежащие налогообложению по ст. 238 НК РФ
			//|	П000020110003,
			//|	П000020110004,
			//
			//|	НачисленоВсегоОбщ,
			//|	НачисленоВсегоСР,				
			//|	ВыплатыЗаСчетПрибылиОбщ,
			//|	ВыплатыЗаСчетПрибылиСР,					
			//|	НеОблагаетсяПоСт238Общ,
			//|	НеОблагаетсяПоСт238СР,
			//|	ВыплатыЗаСчетПрибылиПоВсем,
			//|	НеОблагаетсяПоСт238ПоВсем,
			//		
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ПФР
			//|	//***************************************************
			//|
			//|	ПФРСтрах1,
			//|	ПФРНак1,	
			//|	ПФРСтрах2,
			//|	ПФРНак2,
			//|	// До 280 000 
			//|
			//|	// строка 100 - первая возрастная группа
			//|	П000220010004, 
			//|	П000220010005, // под ОСН
			//|	П000220010006, 
			//|	П000220010007, 
			//|	// строка 101 - вторая возрастная группа
			//|	П000220010104, 
			//|	П000220010105, // под ОСН
			//|	П000220010106, 
			//|	П000220010107, 
			//|
			//|	// От 280 000 до 600 000: 
			//|
			//|	// строка 210 - первая возрастная группа 
			//|	П000220021004, 
			//|	П000220021005, // база под ОСН 
			//|	П000220021006, 
			//|	П000220021007,
			//|	// строка 211 - вторая возрастная группа 
			//|	П000220021104, 
			//|	П000220021105, // база под ОСН 
			//|	П000220021106, 
			//|	П000220021107, 
			//|
			//|	// строка 220 - первая возрастная группа 
			//|	П000220022004, // база за минусом 280000
			//|	П000220022005, // база под ОСН за минусом 280000
			//|	// строка 221 - вторая возрастная группа 
			//|	П000220022104, // база за минусом 280000
			//|	П000220022105, // база под ОСН за минусом 280000
			//|
			//|	// Свыше 600 000: 
			//|
			//|	// строка 300 - первая возрастная группа 
			//|	П000220030004, // вся база
			//|	П000220030005, // вся база под ОСН
			//|	П000220030006, // численность
			//|	П000220030007, 
			//|	// строка 301 - вторая возрастная группа 
			//|	П000220030104, // вся база
			//|	П000220030105, // вся база  под ОСН
			//|	П000220030106,  // численность
			//|	П000220030107}
			|	
			|ИЗ ("+БазовыйТекст+") КАК База
			//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК СтавкиФБ
			//|	ПО СтавкиФБ.ВидСтавокЕСНиПФР = База.Организация.ВидСтавокЕСНиПФР И СтавкиФБ.Год = &парамГод И База.ФБ > СтавкиФБ.СуммаДоходаС И База.ФБ <= СтавкиФБ.СуммаДоходаПо
			//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК СтавкиФСС
			//|	ПО СтавкиФСС.ВидСтавокЕСНиПФР = База.Организация.ВидСтавокЕСНиПФР И СтавкиФСС.Год = &парамГод И База.ФСС > СтавкиФСС.СуммаДоходаС И База.ФСС <= СтавкиФСС.СуммаДоходаПо		
			//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК СтавкиФФОМС
			//|	ПО СтавкиФФОМС.ВидСтавокЕСНиПФР = База.Организация.ВидСтавокЕСНиПФР И СтавкиФФОМС.Год = &парамГод И База.ФФОМС > СтавкиФФОМС.СуммаДоходаС И База.ФФОМС <= СтавкиФФОМС.СуммаДоходаПо			
			//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахЕСНиПФР КАК СтавкиПФРСтрах
			//|	ПО СтавкиПФРСтрах.ВидСтавокЕСНиПФР = База.Организация.ВидСтавокЕСНиПФР И СтавкиПФРСтрах.Год = &парамГод И База.ПФРСтрах > СтавкиПФРСтрах.СуммаДоходаС И База.ПФРСтрах <= СтавкиПФРСтрах.СуммаДоходаПо
			|{ГДЕ 	
			|	Работник,
			|	Организация}";
			
			БазовыйТекстЗапроса = 	БазовыйТекстЗапроса + "	
			|
			|СГРУППИРОВАТЬ ПО";		
			Если ГруппироватьПоВР Тогда
				БазовыйТекстЗапроса = БазовыйТекстЗапроса + "
				|	База.ВидРасчета,";
			КонецЕсли;
			БазовыйТекстЗапроса = БазовыйТекстЗапроса + "		
			|	База.Работник,
			|	База.Организация	
			//|	ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФБ < 0 ТОГДА 1	ИНАЧЕ 0	КОНЕЦ,
			//|	ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФСС < 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,
			//|	ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 1 ТОГДА 1 КОГДА База.ФФОМС < 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,
			//|	ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 2 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ,
			//|	ВЫБОР КОГДА СтавкиФБ.НомерСтрокиСтавок = 3 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиФСС.НомерСтрокиСтавок = 3 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиФФОМС.НомерСтрокиСтавок = 3 ТОГДА 1	ИНАЧЕ 0 КОНЕЦ,
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) < 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА (СтавкиПФРСтрах.НомерСтрокиСтавок = 1 ИЛИ База.ПФРСтрах < 0) И ГОД(База.Работник.ДатаРождения) >= 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) < 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ, 
			//|	ВЫБОР КОГДА СтавкиПФРСтрах.НомерСтрокиСтавок = 2 И ГОД(База.Работник.ДатаРождения) >= 1967 И База.ПФРНеЕНВД <> 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ
			|";      	
		КонецЕсли;
		
		
		// Подключим базу НДФЛ		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ 
		|	ЕСН.Работник КАК Работник,
		|	ЕСН.Организация КАК Организация,";
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСН.ВидРасчета КАК ВидРасчета,"
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	СУММА(ЕСН.Начислено) КАК Начислено,
		|	СУММА(ЕСН.БазаФСЗН) КАК БазаФСЗН,
		|	СУММА(ЕСН.БазаСТРАХ) КАК БазаСТРАХ,
		//|	СУММА(ЕСН.ФФОМС) КАК ФФОМС,
		//|	СУММА(ЕСН.ТФОМС) КАК ТФОМС,
		//|	СУММА(ЕСН.ПФРСтрах) КАК ПФРСтрах,
		//|	СУММА(ЕСН.ПФРНак) КАК ПФРНак,
		//|	СУММА(ЕСН.РасходыЗаСчетФСС) КАК РасходыЗаСчетФСС,
		//|	СУММА(ЕСН.ПФРНеЕНВД) КАК ПФРНеЕНВД,
		//|	СУММА(ЕСН.ФСС_НС) КАК ФСС_НС,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	СУММА(ЕСН.БазаППС) КАК БазаППС,
		//Аверсон СВФР-007332
		
		|	СУММА(ЕСН.ОблагаетсяВсего) КАК ОблагаетсяВсего,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,"; //Островская Татьяна 23.12.2013 № 17003
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса + "			
			//|	СУММА(ЕСН.ЗаСчетПрибыли) КАК ЗаСчетПрибыли,		
			|	СУММА(ЕСТЬNULL(БАЗА_НДФЛ.Результат,0)) КАК БазаНДФЛ";
		Иначе
			ТекстЗапроса = ТекстЗапроса
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ЕСН
			//|	//***************************************************
			//		|
			//|//	Строка 010 - Налоговые базы первого предела (до 280000 рублей) 
			//|	СУММА(ЕСН.П000210001003) КАК П000210001003,
			//|	СУММА(ЕСН.П000210001004) КАК П000210001004,
			//|	СУММА(ЕСН.П000210001005) КАК П000210001005,
			//|	СУММА(ЕСН.П000210001006) КАК П000210001006,
			//|	СУММА(ЕСН.П000210001007) КАК П000210001007,
			//|	СУММА(ЕСН.П000210001008) КАК П000210001008,	
			//|//	Строки 021 и 022 - Налоговые базы второго предела (до 600000 рублей) 
			//|	СУММА(ЕСН.П000210002106) КАК П000210002106, 
			//|	СУММА(ЕСН.П000210002107) КАК П000210002107,
			//|	СУММА(ЕСН.П000210002108) КАК П000210002108,
			//|	СУММА(ЕСН.П000210002203) КАК П000210002203,
			//|	СУММА(ЕСН.П000210002204) КАК П000210002204,
			//|	СУММА(ЕСН.П000210002205) КАК П000210002205,	
			//|//	Строки 031 и 032 - Налоговые базы третьего предела (свыше 600000 рублей) 
			//|	СУММА(ЕСН.П000210003106) КАК П000210003106,
			//|   СУММА(ЕСН.П000210003107) КАК П000210003107,
			//|   СУММА(ЕСН.П000210003108) КАК П000210003108,
			//|   СУММА(ЕСН.П000210003203) КАК П000210003203,
			//|   СУММА(ЕСН.П000210003204) КАК П000210003204,
			//|   СУММА(ЕСН.П000210003205) КАК П000210003205,	
			//|// Строка 1100 - справочно суммы не подлежащие налогообложению по ст. 238 НК РФ
			//|	СУММА(ЕСН.П000020110003) КАК П000020110003,
			//|	СУММА(ЕСН.П000020110004) КАК П000020110004,
			//
			//|	СУММА(ЕСН.НачисленоВсегоОбщ) КАК НачисленоВсегоОбщ,
			//|	СУММА(ЕСН.НачисленоВсегоСР) КАК НачисленоВсегоСР,		
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиОбщ) КАК ВыплатыЗаСчетПрибылиОбщ,
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиСР) КАК ВыплатыЗаСчетПрибылиСР,					
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238Общ) КАК НеОблагаетсяПоСт238Общ,
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238СР) КАК НеОблагаетсяПоСт238СР,
			//|	СУММА(ЕСН.ВыплатыЗаСчетПрибылиПоВсем) КАК ВыплатыЗаСчетПрибылиПоВсем,
			//|	СУММА(ЕСН.НеОблагаетсяПоСт238ПоВсем) КАК НеОблагаетсяПоСт238ПоВсем,
			//
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ПФР
			//|	//***************************************************
			//|
			//|
			//|	СУММА(ЕСН.ПФРСтрах1) КАК ПФРСтрах1,
			//|	СУММА(ЕСН.ПФРНак1) КАК ПФРНак1,	
			//|	СУММА(ЕСН.ПФРСтрах2) КАК ПФРСтрах2,
			//|	СУММА(ЕСН.ПФРНак2) КАК ПФРНак2,
			//|	// До 280 000 
			//|
			//|	// строка 100 - первая возрастная группа
			//|	СУММА(ЕСН.П000220010004) КАК П000220010004, 
			//|	СУММА(ЕСН.П000220010005) КАК П000220010005, // под ОСН
			//|	СУММА(ЕСН.П000220010006) КАК П000220010006, 
			//|	СУММА(ЕСН.П000220010007) КАК П000220010007, 
			//|	// строка 101 - вторая возрастная группа
			//|	СУММА(ЕСН.П000220010104) КАК П000220010104, 
			//|	СУММА(ЕСН.П000220010105) КАК П000220010105, // под ОСН
			//|	СУММА(ЕСН.П000220010106) КАК П000220010106, 
			//|	СУММА(ЕСН.П000220010107) КАК П000220010107, 
			//|
			//|	// От 280 000 до 600 000: 
			//|
			//|	// строка 210 - первая возрастная группа 
			//|	СУММА(ЕСН.П000220021004) КАК П000220021004, 
			//|	СУММА(ЕСН.П000220021005) КАК П000220021005, // база под ОСН 
			//|	СУММА(ЕСН.П000220021006) КАК П000220021006, 
			//|	СУММА(ЕСН.П000220021007) КАК П000220021007,
			//|	// строка 211 - вторая возрастная группа 
			//|	СУММА(ЕСН.П000220021104) КАК П000220021104, 
			//|	СУММА(ЕСН.П000220021105) КАК П000220021105, // база под ОСН 
			//|	СУММА(ЕСН.П000220021106) КАК П000220021106, 
			//|	СУММА(ЕСН.П000220021107) КАК П000220021107, 
			//|
			//|	// строка 220 - первая возрастная группа 
			//|	СУММА(ЕСН.П000220022004) КАК П000220022004, // база за минусом 280000
			//|	СУММА(ЕСН.П000220022005) КАК П000220022005, // база под ОСН за минусом 280000
			//|	// строка 221 - вторая возрастная группа 
			//|	СУММА(ЕСН.П000220022104) КАК П000220022104, // база за минусом 280000
			//|	СУММА(ЕСН.П000220022105) КАК П000220022105, // база под ОСН за минусом 280000
			//|
			//|	// Свыше 600 000: 
			//|
			//|	// строка 300 - первая возрастная группа 
			//|	СУММА(ЕСН.П000220030004) КАК П000220030004, // вся база
			//|	СУММА(ЕСН.П000220030005) КАК П000220030005, // вся база под ОСН
			//|	СУММА(ЕСН.П000220030006) КАК П000220030006, // численность
			//|	СУММА(ЕСН.П000220030007) КАК П000220030007,		
			//|	// строка 301 - вторая возрастная группа 
			//|	СУММА(ЕСН.П000220030104) КАК П000220030104, // вся база
			//|	СУММА(ЕСН.П000220030105) КАК П000220030105, // вся база  под ОСН
			//|	СУММА(ЕСН.П000220030106) КАК П000220030106, // численность
			//|	СУММА(ЕСН.П000220030107) КАК П000220030107";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	
		|{ВЫБРАТЬ
		|	Работник,
		|	Организация,";
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ВидРасчета,"
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	Начислено,
		|	БазаФСЗН,
		|	БазаСТРАХ,
		//|	ФФОМС,
		//|	ТФОМС,
		//|	ПФРСтрах,
		//|	ПФРНак,
		//|	РасходыЗаСчетФСС,
		//|	ПФРНеЕНВД,
		//|	ФСС_НС,
		
		//Аверсон ЕАЕ 29.03.2021 СВФР-007332
		|	БазаППС,
		//Аверсон СВФР-007332
		
		|	ОблагаетсяВсего,";
		//|	ЗаСчетПрибыли,";
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	БазаНДФЛ,
			|	ПодразделениеОрганизации}";  //Островская Татьяна 23.12.2013 № 17003
		Иначе
			ТекстЗапроса = ТекстЗапроса 
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ЕСН
			//|	//***************************************************		|
			//|//	Строка 010 - Налоговые базы первого предела (до 280000 рублей) 
			//|	П000210001003,
			//|	П000210001004,
			//|	П000210001005,
			//|	П000210001006,
			//|	П000210001007,
			//|	П000210001008,	
			//|//	Строки 021 и 022 - Налоговые базы второго предела (до 600000 рублей) 
			//|	П000210002106, 
			//|	П000210002107,
			//|	П000210002108,
			//|	П000210002203,
			//|	П000210002204,
			//|	П000210002205,	
			//|//	Строки 031 и 032 - Налоговые базы третьего предела (свыше 600000 рублей) 
			//|	П000210003106,
			//|   П000210003107,
			//|   П000210003108,
			//|   П000210003203,
			//|   П000210003204,
			//|   П000210003205,	
			//|// Строка 1100 - справочно суммы не подлежащие налогообложению по ст. 238 НК РФ
			//|	П000020110003,
			//|	П000020110004,
			//
			//|	НачисленоВсегоОбщ,
			//|	НачисленоВсегоСР,		
			//|	ВыплатыЗаСчетПрибылиОбщ,
			//|	ВыплатыЗаСчетПрибылиСР,	
			//|	НеОблагаетсяПоСт238Общ,
			//|	НеОблагаетсяПоСт238СР,
			//|	ВыплатыЗаСчетПрибылиПоВсем,	
			//|	НеОблагаетсяПоСт238ПоВсем,
			//|	//***************************************************
			//|	// ДАЛЕЕ ИДЕТ РАСШИФРОВКА ОТЧЕТОВ ПО ПФР
			//|	//***************************************************
			//|
			//|	ПФРСтрах1,
			//|	ПФРНак1,	
			//|	ПФРСтрах2,
			//|	ПФРНак2,
			//|	// До 280 000 
			//|
			//|	// строка 100 - первая возрастная группа
			//|	П000220010004, 
			//|	П000220010005, // под ОСН
			//|	П000220010006, 
			//|	П000220010007, 
			//|	// строка 101 - вторая возрастная группа
			//|	П000220010104, 
			//|	П000220010105, // под ОСН
			//|	П000220010106, 
			//|	П000220010107, 
			//|
			//|	// От 280 000 до 600 000: 
			//|
			//|	// строка 210 - первая возрастная группа 
			//|	П000220021004, 
			//|	П000220021005, // база под ОСН 
			//|	П000220021006, 
			//|	П000220021007,
			//|	// строка 211 - вторая возрастная группа 
			//|	П000220021104, 
			//|	П000220021105, // база под ОСН 
			//|	П000220021106, 
			//|	П000220021107, 
			//|
			//|	// строка 220 - первая возрастная группа 
			//|	П000220022004, // база за минусом 280000
			//|	П000220022005, // база под ОСН за минусом 280000
			//|	// строка 221 - вторая возрастная группа 
			//|	П000220022104, // база за минусом 280000
			//|	П000220022105, // база под ОСН за минусом 280000
			//|
			//|	// Свыше 600 000: 
			//|
			//|	// строка 300 - первая возрастная группа 
			//|	П000220030004, // вся база
			//|	П000220030005, // вся база под ОСН
			//|	П000220030006, // численность
			//|	П000220030007, 
			//|	// строка 301 - вторая возрастная группа 
			//|	П000220030104, // вся база
			//|	П000220030105, // вся база  под ОСН
			//|	П000220030106, // численность
			//|	П000220030107}";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ИЗ ("+БазовыйТекстЗапроса+") КАК ЕСН";
		Если ЭтоНеРасшифрофка Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ЛЕВОЕ СОЕДИНЕНИЕ ("+РегРасчетНДФЛ+") КАК БАЗА_НДФЛ
			|	ПО ЕСН.Работник = БАЗА_НДФЛ.ФизЛицо И ЕСН.Организация = БАЗА_НДФЛ.Организация";
			Если ГруппироватьПоВР Тогда
				ТекстЗапроса = ТекстЗапроса + "
				|	И ЕСН.ВидРасчета = БАЗА_НДФЛ.ВидРасчета
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон) КАК РаботникиОрганизацийСрезПоследних //Аверсон 02.03.2020 КВВ СВФР-005598 (&ДатаКон)
				|	ПО ЕСН.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник";
			КонецЕсли;				
		КонецЕсли;
		Если мВыбранныйПоказатель <> Неопределено Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ ЕСН." + мВыбранныйПоказатель + " <> 0";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО";		
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСН.ВидРасчета,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "		
		|	ЕСН.Работник,
		|	ЕСН.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации УПОРЯДОЧИТЬ ПО  //Островская Татьяна 23.12.2013 № 17003
		|	ЕСН.Работник.Наименование
		|";
		ТекстЗапроса = ТекстЗапроса + "		
		|ИТОГИ ПО
		|	ОБЩИЕ,
		|	ЕСН.Организация,";
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСН.ВидРасчета,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСН.Работник,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
		|		
		|{ГДЕ";
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	ЕСН.ВидРасчета,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСН.Работник,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,//Островская Татьяна 23.12.2013 № 17003
		|	ЕСН.Организация}
		|
		
		|{УПОРЯДОЧИТЬ ПО";
		Если ГруппироватьПоВР Тогда
			ТекстЗапроса = ТекстЗапроса + "	
			|	ЕСН.ВидРасчета,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "	
		|	ЕСН.Работник,
		|	ЕСН.Организация}
		|
		|
		|{ИТОГИ ПО
		|	ЕСН.Организация" + ?(ЕстьПодразделение или ЕстьВидРасчета или ЕстьРаботник,",","}");
		Если ЕстьПодразделение Тогда //О.Т. Аверсон 11.11.2016 № 21
			ТекстЗапроса = ТекстЗапроса + "
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации"+?(ЕстьВидРасчета или ЕстьРаботник,",","}");//Островская Татьяна 08.01.2014 № 17020
		КонецЕсли;
		
		//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,"; //Островская Татьяна 23.12.2013 № 17003
		Если ЕстьВидРасчета Тогда 
			Если ГруппироватьПоВР Тогда
				ТекстЗапроса = ТекстЗапроса + "	
				|	ЕСН.ВидРасчета"+?(ЕстьРаботник,",","}");
			КонецЕсли;
		КонецЕсли;
		Если ЕстьРаботник Тогда 
			ТекстЗапроса = ТекстЗапроса + "	
			|	ЕСН.Работник}";	
		КонецЕсли;
		
		ПостроительОтчета.Текст = ТекстЗапроса;
		
		Если ПостроительОтчета.Отбор.Количество() = 0 Тогда
			МассивОтбора = Новый Массив;
			МассивОтбора.Добавить("Организация");
			МассивОтбора.Добавить("Работник");
			МассивОтбора.Добавить("ПодразделениеОрганизации");
			УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);	
		КонецЕсли;
		
		
		// уберём пустые строки
		Если ЭтоНеРасшифрофка Тогда	
			//
			//УдалитьВыбранноеПоле("РасходыЗаСчетФСС");		
			//УдалитьВыбранноеПоле("ПФРНеЕНВД");		
			//УдалитьВыбранноеПоле("ОблагаетсяВсего");
			//УдалитьВыбранноеПоле("ЗаСчетПрибыли");
			
		КонецЕсли;	
	КонецПроцедуры //ЗаполнитьБазовыеНастройки
	
	////////////////////////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ ИНТЕРФЕЙСА ОТЧЕТОВ
	
	// Функция формирования заголовка отчета
	//
	Функция СформироватьЗаголовок(МакетОтчета)
		
		
		ЗаголовокОтчета = МакетОтчета.ПолучитьОбласть("Заголовок");
		
		// Вывод заголовка, описателя периода и фильтров и заголовка
		Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
			ОписаниеПериода     = "Период не установлен";
		Иначе
			Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
				ОписаниеПериода = "" + Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
				+ " - "      + Формат(ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");
			Иначе
				Если ДатаНач <= ДатаКон Тогда
					ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
				Иначе
					ОписаниеПериода = "Неправильно задан период!"
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		СписокОтбор = "";
		Для Сч=0 По ПостроительОтчета.Отбор.Количество()-1 Цикл
			
			Если ПостроительОтчета.Отбор[Сч].Использование И Не (ПостроительОтчета.Отбор[Сч].Имя = "Периодичность" ИЛИ ПостроительОтчета.Отбор[Сч].Имя = "Организация")Тогда
				
				СписокОтбор = СписокОтбор +", "+ ПостроительОтчета.Отбор[Сч].Представление 
				+" "+ ПостроительОтчета.Отбор[Сч].ВидСравнения +" "+ ПостроительОтчета.Отбор[Сч].Значение;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ЗаголовокОтчета.Параметры.ЗаголовокОтчета = мНазваниеОтчета;
		ЗаголовокОтчета.Параметры.Период     = "Период: "+ОписаниеПериода;
		Если СокрЛП(СписокОтбор) <> "" Тогда
			ЗаголовокОтчета.Параметры.Отбор      = "Отбор:"    +Сред(СписокОтбор,2);
		КонецЕсли;
		
		ЗаголовокОтчета.Параметры.Организация = "Организация: " +Организация;
		
		
		Возврат ЗаголовокОтчета;
	КонецФункции // СформироватьЗаголовок()
	
	// Процедура формирования представлений полей отчета
	//
	Процедура ЗаполнитьПредставления(СтруктураПредставлениеПолей) Экспорт
		
		Для Каждого ВыбранноеПоле Из ПостроительОтчета.ВыбранныеПоля Цикл
			НайденноеЗначение = "";
			Если мСтруктураПредставлениеПолей.Свойство(ВыбранноеПоле.Имя, НайденноеЗначение) Тогда
				ВыбранноеПоле.Представление = НайденноеЗначение;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Поле Из ПостроительОтчета.ДоступныеПоля Цикл
			НайденноеЗначение = "";
			Если мСтруктураПредставлениеПолей.Свойство(Поле.Имя, НайденноеЗначение) Тогда
				Поле.Представление = НайденноеЗначение;
			КонецЕсли;
		КонецЦикла;	
		
	КонецПроцедуры //ЗаполнитьПредставления
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
	// Процедура формирования отчета
	//
	Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь, Форма = Неопределено) Экспорт
		
		
		ПостроительОтчета.ОбрабатыватьПрерываниеПользователя = Истина;
		
		ЭтоРасшифровка = ЗначениеЗаполнено(ИмяЯчейки);
		
		Если ЭтоРасшифровка Тогда
			
			ЗаполнитьПредставления(мСтруктураПредставлениеПолей);
			
			//проверить установлен ли отбор
			Если НЕ ПостроительОтчета.Отбор["Организация"].Использование и ЗначениеЗаполнено(Организация) тогда
				ПостроительОтчета.Отбор["Организация"].Значение      = Организация;
				ПостроительОтчета.Отбор["Организация"].Использование = Истина;
			КонецЕсли;
		Иначе
			
			Если ПостроительОтчета.ИзмеренияСтроки.Количество() = 0 Тогда
				ПостроительОтчета.ИзмеренияСтроки.Добавить("Организации");
				ПостроительОтчета.ИзмеренияСтроки.Добавить("Работник");
				Если ВыводитьБазу Тогда
					ПостроительОтчета.ИзмеренияСтроки.Добавить("ВидРасчета");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		
		мГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
		
		// Проверка на пустые значения
		Если ПустаяСтрока(ПостроительОтчета.Текст) Тогда
			
			Предупреждение("Не определен запрос отчета!");
			
			ЕстьОшибки = Истина;
			Возврат;
		КонецЕсли;
		
		Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
			Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
			ЕстьОшибки = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ УправлениеОтчетами.ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
			//повторные отборы по категориям
			Предупреждение("По одной категории нельзя устанавливать два отбора", 60);
			ЕстьОшибки = Истина;
			Возврат;
		КонецЕсли;
		
		УправлениеОтчетами.ПроверитьПорядокПостроителяОтчета(ПостроительОтчета);
		
		ПостроительОтчета.Параметры.Вставить("ДатаНач", ДатаНач);
		//ПостроительОтчета.Параметры.Вставить("МесяцНалоговогоПериода1", КонецМесяца(КонецМесяца(ДатаКон)+86400));
		ПостроительОтчета.Параметры.Вставить("ВидСтроки", Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
		//Аверсон-софт, Островская Татьяна 11.09.2012 № 15804
		ПостроительОтчета.Параметры.Вставить("ВидДвижения", ВидДвиженияНакопления.Приход);
		//Аверсон-софт, Островская Татьяна 11.09.2012 № 15804
		ПостроительОтчета.Параметры.Вставить("парамГоловнаяОрганизация", мГоловнаяОрганизация);
		ПостроительОтчета.Параметры.Вставить("парамОрганизация", Организация);
		ПостроительОтчета.Параметры.Вставить("парамГод", Год(ДатаКон));		
		ПостроительОтчета.Параметры.Вставить("парамВидСтавокЕСНиПФР",         Организация.ВидСтавокЕСНиПФР);	
		ПостроительОтчета.Параметры.Вставить("парамРаботник",         Работник);			
		
		Если ДатаКон <> '00010101000000' Тогда
			ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКон));
		Иначе
			ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
		КонецЕсли;
		
		// разные макты для налоговой ведомости и расшифровки
		Если ЭтоРасшифровка Тогда
			МакетОтчета = ПолучитьМакет("МакетРасшифровки");
			ВысотаЗаголовка = 0;
		Иначе
			МакетОтчета = ПолучитьМакет("Макет");
			ЗаголовокОтчета = СформироватьЗаголовок(МакетОтчета);
			// Параметр для показа заголовка
			ВысотаЗаголовка = ЗаголовокОтчета.ВысотаТаблицы;
		КонецЕсли;
		
		ПостроительОтчета.Макет = МакетОтчета;
		// Заголовок отчета
		ДокументРезультат.Очистить();
		
		// Когда нужен только заголовок:
		Если ТолькоЗаголовок Тогда
			Возврат;
		КонецЕсли; 
		
		Если Не ЭтоРасшифровка Тогда
			ДокументРезультат.Вывести(ЗаголовокОтчета);
		КонецЕсли;	
		
		// Исполнение запроса
		ПостроительОтчета.Выполнить();
		
		// Вывод в отчет
		// вывод самих извещений
		РезультатЗапроса = ПостроительОтчета.Результат;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		
		Выборка			= РезультатЗапроса.Выбрать();		
		Выборка.Следующий();	
		
		ВыбраноГруппировок = 0;
		//Выведем шапку отчета
		Если ЭтоРасшифровка Тогда
			ОбластьПоказатель = МакетОтчета.ПолучитьОбласть("ЗаголовокШапка|ПустаяВертикальнаяЛиния");	
			ДокументРезультат.Вывести(ОбластьПоказатель);
		КонецЕсли;
		ОбластьПоказатель = МакетОтчета.ПолучитьОбласть("ЗаголовокШапка|Показатель");
		ОбластьПоказатель.Параметры.ШапкаПоказатель = "";
		Для Каждого ПоказательШапки Из ПостроительОтчета.ИзмеренияСтроки Цикл
			Если ПоказательШапки.Имя ="Работник" или ПоказательШапки.Имя ="ВидРасчета" или ПоказательШапки.Имя = "Организация" или
				ПоказательШапки.Имя = "ПодразделениеОрганизации" Тогда  //Островская Татьяна 10.01.2014 № 17003
				ВыбраноГруппировок = ВыбраноГруппировок + 1;
				Представление = "";
				мСтруктураПредставлениеПолей.Свойство(ПоказательШапки.Имя, Представление);
				Если ОбластьПоказатель.Параметры.ШапкаПоказатель = "" Тогда
					ОбластьПоказатель.Параметры.ШапкаПоказатель = Представление;
				Иначе
					ОбластьПоказатель.Параметры.ШапкаПоказатель = ОбластьПоказатель.Параметры.ШапкаПоказатель + Символы.ПС + Представление;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ВыводитьПоказатели = Новый Соответствие;
		
		Если ЭтоРасшифровка Тогда
			ДокументРезультат.Присоединить(ОбластьПоказатель);
		Иначе
			ДокументРезультат.Вывести(ОбластьПоказатель);
		КонецЕсли;
		Индекс = 0;
		Для Каждого ПоказательШапки Из ПостроительОтчета.ВыбранныеПоля Цикл
			Если ПоказательШапки.Имя = "Работник" или ПоказательШапки.Имя = "ВидРасчета" или ПоказательШапки.Имя = "Организация" или
				ПоказательШапки.Имя = "ПодразделениеОрганизации" 	//Островская Татьяна 10.01.2014 № 17003	
				или ПоказательШапки.Имя = "Период" Тогда //ПСА 23.07.2021 СВФР-007874+++
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;	
			
			//Аверсон 21.03.2023 КВВ СВФР-010574 (
			Если НЕ ВыводитьБазу И ПоказательШапки.Имя = "ПериодВзаиморасчетов" Тогда   
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
			//Аверсон 21.03.2023 КВВ СВФР-010574 )
			
			Если Выборка.Получить(Индекс) <> 0 Тогда
				ВыводитьПоказатели.Вставить(ПоказательШапки.Имя, Истина);
				ОбластьПоказатель.Параметры.ШапкаПоказатель = ПоказательШапки.Представление;
				ДокументРезультат.Присоединить(ОбластьПоказатель);
			Иначе
				ВыводитьПоказатели.Вставить(ПоказательШапки.Имя, Ложь);
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;		
		
		Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Тогда
			Если ЭтоРасшифровка Тогда
				ПустаяОбл = МакетОтчета.ПолучитьОбласть("ВРГруппа0|ПустаяВертикальнаяЛиния");
			КонецЕсли;
			ВыборкаПоГруппировке = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, ПостроительОтчета.ИзмеренияСтроки[0].Имя);
			Пока ВыборкаПоГруппировке.Следующий() Цикл
				// вывод строк с разным фоном
				Если ПостроительОтчета.ИзмеренияСтроки.Количество() = 3 Тогда
					ОбластьВР = МакетОтчета.ПолучитьОбласть("ВРГруппа0|Показатель");
				ИначеЕсли ПостроительОтчета.ИзмеренияСтроки.Количество() = 2 Тогда
					ОбластьВР = МакетОтчета.ПолучитьОбласть("ВРГруппа1|Показатель");
				Иначе
					ОбластьВР = МакетОтчета.ПолучитьОбласть("ВР|Показатель");
				КонецЕсли;
				
				Если ВыборкаПоГруппировке.Группировка() = "ВидРасчета" Тогда
					ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировке.ВидРасчета;
				ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Работник" Тогда				
					ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировке.Работник;
				ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Организация" Тогда				
					ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировке.Организация;
				ИначеЕсли ВыборкаПоГруппировке.Группировка() = "ПодразделениеОрганизации" Тогда	//Островская Татьяна 10.01.2014 № 17003			
					ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировке.ПодразделениеОрганизации;
					
				КонецЕсли;			
				
				Если ЭтоРасшифровка Тогда
					ДокументРезультат.Вывести(ПустаяОбл);
					ДокументРезультат.Присоединить(ОбластьВР);
				Иначе
					ДокументРезультат.Вывести(ОбластьВР);
				КонецЕсли;
				
				СчКолонок = 1;
				Для Каждого ПоказательШапки Из ПостроительОтчета.ВыбранныеПоля Цикл
					
					Если ПоказательШапки.Имя = "Работник" или ПоказательШапки.Имя = "ВидРасчета" или ПоказательШапки.Имя = "Организация" или
						ПоказательШапки.Имя = "ПодразделениеОрганизации" //Островская Татьяна 10.01.2014 № 17003 
						или ПоказательШапки.Имя = "Период" Тогда //ПСА 23.07.2021 СВФР-007874+++
						СчКолонок = СчКолонок + 1;
						Продолжить;
					КонецЕсли;
					
					//Аверсон 21.03.2023 КВВ СВФР-010574 (
					Если НЕ ВыводитьБазу И ПоказательШапки.Имя = "ПериодВзаиморасчетов" Тогда   
						СчКолонок = СчКолонок + 1;
						Продолжить;
					КонецЕсли;
					//Аверсон 21.03.2023 КВВ СВФР-010574 )
					
					Если РезультатЗапроса.Колонки.Найти(ПоказательШапки.Имя) <> Неопределено Тогда								
						
						Показатель										= ВыборкаПоГруппировке[ПоказательШапки.Имя];
						//ВыборкаПоГруппировке.Получить(СчКолонок-1);
						ОбластьВР.Параметры.Показатель					= Показатель;										
						
						Область = Лев(ДокументРезультат.ТекущаяОбласть.Имя,3) + Число(Прав(ДокументРезультат.ТекущаяОбласть.Имя,1)) + 1;
						
						Если ВыводитьПоказатели[ПоказательШапки.Имя] Тогда
							ДокументРезультат.Присоединить(ОбластьВР);						
						КонецЕсли;
						СчКолонок = СчКолонок + 1;
					КонецЕсли;
				КонецЦикла;
				
				Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 1 Тогда
					Если ВыборкаПоГруппировке.Группировка() = "ВидРасчета" Тогда
						ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировке.ВидРасчета, НЕ ЭтоРасшифровка);
					ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Работник" Тогда				
						ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировке.Работник, НЕ ЭтоРасшифровка);
					ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Организация" Тогда				
						ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировке.Организация, НЕ ЭтоРасшифровка);
					ИначеЕсли ВыборкаПоГруппировке.Группировка() = "ПодразделениеОрганизации" Тогда	//Островская Татьяна 10.01.2014 № 17003			
						ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировке.ПодразделениеОрганизации, НЕ ЭтоРасшифровка);
					КонецЕсли;	//Островская Татьяна 10.01.2014 № 17003						
				КонецЕсли;
				
				Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 1 Тогда
					ВыборкаПоГруппировкеУровень2 = ВыборкаПоГруппировке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, ПостроительОтчета.ИзмеренияСтроки[1].Имя);
					Пока ВыборкаПоГруппировкеУровень2.Следующий() Цикл
						
						Если ПостроительОтчета.ИзмеренияСтроки.Количество() = 3 Тогда
							ОбластьВР = МакетОтчета.ПолучитьОбласть("ВРГруппа1|Показатель");
						Иначе
							ОбластьВР = МакетОтчета.ПолучитьОбласть("ВР|Показатель");
						КонецЕсли;
						
						Если ВыборкаПоГруппировкеУровень2.Группировка() = "ВидРасчета" Тогда
							ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень2.ВидРасчета;
						ИначеЕсли ВыборкаПоГруппировкеУровень2.Группировка() = "Работник" Тогда				
							ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень2.Работник;
						ИначеЕсли ВыборкаПоГруппировкеУровень2.Группировка() = "Организация" Тогда				
							ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень2.Организация;
						ИначеЕсли ВыборкаПоГруппировкеУровень2.Группировка() = "ПодразделениеОрганизации" Тогда	//Островская Татьяна 10.01.2014 № 17003			
							ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень2.ПодразделениеОрганизации;
						КонецЕсли;			
						
						Если ЭтоРасшифровка Тогда
							ДокументРезультат.Вывести(ПустаяОбл);
							ДокументРезультат.Присоединить(ОбластьВР);
						Иначе
							ДокументРезультат.Вывести(ОбластьВР);
						КонецЕсли;					
						
						СчКолонок = 1;
						Для Каждого ПоказательШапки Из ПостроительОтчета.ВыбранныеПоля Цикл
							
							Если ПоказательШапки.Имя = "Работник" или ПоказательШапки.Имя = "ВидРасчета" или ПоказательШапки.Имя = "Организация" или
								ПоказательШапки.Имя = "ПодразделениеОрганизации"   //Островская Татьяна 10.01.2014 № 17003
								или ПоказательШапки.Имя = "Период" Тогда //ПСА 23.07.2021 СВФР-007874+++
								СчКолонок = СчКолонок + 1;
								Продолжить;
							КонецЕсли;
							
							//Аверсон 21.03.2023 КВВ СВФР-010574 (
							Если НЕ ВыводитьБазу И ПоказательШапки.Имя = "ПериодВзаиморасчетов" Тогда   
								СчКолонок = СчКолонок + 1;
								Продолжить;
							КонецЕсли;
							//Аверсон 21.03.2023 КВВ СВФР-010574 )
							
							Если РезультатЗапроса.Колонки.Найти(ПоказательШапки.Имя) <> Неопределено Тогда															
								Показатель										= ВыборкаПоГруппировкеУровень2[ПоказательШапки.Имя];
								//ВыборкаПоГруппировкеУровень2.Получить(СчКолонок-1);
								ОбластьВР.Параметры.Показатель					= Показатель;																	
								Область = Лев(ДокументРезультат.ТекущаяОбласть.Имя,3) + Число(Прав(ДокументРезультат.ТекущаяОбласть.Имя,1)) + 1;							
								Если ВыводитьПоказатели[ПоказательШапки.Имя] Тогда
									ДокументРезультат.Присоединить(ОбластьВР);								
								КонецЕсли;							
								СчКолонок = СчКолонок + 1;
							КонецЕсли;
						КонецЦикла;
						
						Если ВыборкаПоГруппировке.Группировка() = "ВидРасчета" Тогда
							ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировкеУровень2.ВидРасчета,Ложь);
						ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Работник" Тогда				
							ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировкеУровень2.Работник,Ложь);
						ИначеЕсли ВыборкаПоГруппировке.Группировка() = "Организация" Тогда				
							ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировкеУровень2.Организация,Ложь);
						ИначеЕсли ВыборкаПоГруппировке.Группировка() = "ПодразделениеОрганизации" Тогда	//Островская Татьяна 10.01.2014 № 17003			
							ДокументРезультат.НачатьГруппуСтрок(ВыборкаПоГруппировкеУровень2.ПодразделениеОрганизации,Ложь);
						КонецЕсли;
						
						Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 2 Тогда
							ВыборкаПоГруппировкеУровень3 = ВыборкаПоГруппировкеУровень2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, ПостроительОтчета.ИзмеренияСтроки[2].Имя);
							Пока ВыборкаПоГруппировкеУровень3.Следующий() Цикл
								
								ОбластьВР = МакетОтчета.ПолучитьОбласть("ВР|Показатель");
								
								Если ВыборкаПоГруппировкеУровень3.Группировка() = "ВидРасчета" Тогда
									ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень3.ВидРасчета;
								ИначеЕсли ВыборкаПоГруппировкеУровень3.Группировка() = "Работник" Тогда				
									ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень3.Работник;
								ИначеЕсли ВыборкаПоГруппировкеУровень3.Группировка() = "Организация" Тогда				
									ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень3.Организация;
								ИначеЕсли ВыборкаПоГруппировкеУровень3.Группировка() = "ПодразделениеОрганизации" Тогда	//Островская Татьяна 10.01.2014 № 17003			
									ОбластьВР.Параметры.Показатель	= ВыборкаПоГруппировкеУровень3.ПодразделениеОрганизации;
								КонецЕсли;			
								Если ЭтоРасшифровка Тогда
									ДокументРезультат.Вывести(ПустаяОбл);
									ДокументРезультат.Присоединить(ОбластьВР);
								Иначе
									ДокументРезультат.Вывести(ОбластьВР);
								КонецЕсли;	
								
								СчКолонок = 1;
								Для Каждого ПоказательШапки Из ПостроительОтчета.ВыбранныеПоля Цикл
									
									Если ПоказательШапки.Имя = "Работник" или ПоказательШапки.Имя = "ВидРасчета"  или ПоказательШапки.Имя = "Организация" или
										ПоказательШапки.Имя = "ПодразделениеОрганизации"
										или ПоказательШапки.Имя = "Период" Тогда //ПСА 23.07.2021 СВФР-007874+++
										СчКолонок = СчКолонок + 1;
										Продолжить;
									КонецЕсли;
									
									//Аверсон 21.03.2023 КВВ СВФР-010574 (
									Если НЕ ВыводитьБазу И ПоказательШапки.Имя = "ПериодВзаиморасчетов" Тогда   
										СчКолонок = СчКолонок + 1;
										Продолжить;
									КонецЕсли;
									//Аверсон 21.03.2023 КВВ СВФР-010574 )
									
									Если РезультатЗапроса.Колонки.Найти(ПоказательШапки.Имя) <> Неопределено Тогда								
										
										Показатель										= ВыборкаПоГруппировкеУровень3[ПоказательШапки.Имя];
										ВыборкаПоГруппировкеУровень3.Получить(СчКолонок-1);
										ОбластьВР.Параметры.Показатель					= Показатель;										
										
										Область = Лев(ДокументРезультат.ТекущаяОбласть.Имя,3) + Число(Прав(ДокументРезультат.ТекущаяОбласть.Имя,1)) + 1;
										Если ВыводитьПоказатели[ПоказательШапки.Имя] Тогда
											ДокументРезультат.Присоединить(ОбластьВР);										
										КонецЕсли;
										СчКолонок = СчКолонок + 1;									
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;	
						КонецЕсли;
						
						ДокументРезультат.ЗакончитьГруппуСтрок();
						
					КонецЦикла;
				КонецЕсли;
				
				Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 1 Тогда
					ДокументРезультат.ЗакончитьГруппуСтрок();
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;;
		
		
		// Выведема итоги
		Если ЭтоРасшифровка Тогда
			ДокументРезультат.Вывести(ПустаяОбл);	
		КонецЕсли;
		ОбластьИтоги = МакетОтчета.ПолучитьОбласть("ИтогБазы|Показатель");
		ОбластьИтоги.Параметры.Итог = "ИТОГО:";	
		Если ЭтоРасшифровка Тогда
			ДокументРезультат.Присоединить(ОбластьИтоги);
		Иначе
			ДокументРезультат.Вывести(ОбластьИтоги);
		КонецЕсли;
		СчПоказателя = 1;
		Для Каждого ПоказательШапки Из РезультатЗапроса.Колонки Цикл
			
			Если ПоказательШапки.Имя = "Работник" или ПоказательШапки.Имя = "ВидРасчета" или ПоказательШапки.Имя = "Организация" или
				ПоказательШапки.Имя = "ПодразделениеОрганизации"
				или ПоказательШапки.Имя = "Период" Тогда //ПСА 23.07.2021 СВФР-007874+++
				СчПоказателя = СчПоказателя + 1;
				Продолжить;				
			КонецЕсли;			
			
			//Аверсон 21.03.2023 КВВ СВФР-010574 (
			Если НЕ ВыводитьБазу И ПоказательШапки.Имя = "ПериодВзаиморасчетов" Тогда   
				СчПоказателя = СчПоказателя + 1;
				Продолжить;
			КонецЕсли;
			//Аверсон 21.03.2023 КВВ СВФР-010574 )
			
			Если РезультатЗапроса.Колонки.Найти(ПоказательШапки.Имя) <> Неопределено и ВыводитьПоказатели[ПоказательШапки.Имя] Тогда
				
				ОбластьИтоги.Параметры.Итог = Выборка.Получить(СчПоказателя-1);
				
				ДокументРезультат.Присоединить(ОбластьИтоги);								
			КонецЕсли;
			СчПоказателя = СчПоказателя + 1;
			
		КонецЦикла;		
		
		//Аверсон-софт, Островская Татьяна 28.04.2012 №  15275
		//ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		//Аверсон-софт, Островская Татьяна 28.04.2012 №  15275
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "АнализНачисленийНалоговИВзносов";
		
		Если НЕ ЭтоРасшифровка Тогда
			ДокументРезультат.Область(1,,ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
		КонецЕсли;
		ДокументРезультат.ТолькоПросмотр = Истина;
		Если Форма <> Неопределено Тогда
			Форма.Ширина = ДокументРезультат.Ширина-50; 
		КонецЕсли;
		
	КонецПроцедуры //СформироватьОтчет
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
	ПоказыватьЗаголовок = Истина;
	
#КонецЕсли