
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПлановыеНачисленияРаботниковОрганизаций
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движения.ПлановыеНачисленияРаботниковОрганизаций.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Организация = Организация;
		Движение.ВидРасчетаИзмерение = ТекСтрокаНачисления.ВидРасчета;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.Показатель1 = ТекСтрокаНачисления.Результат;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
