
Процедура ЗаписатьДанныеДляОбмена(источник, Отказ)    Экспорт
	
	Если источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если Не Константы.ОбменЕРПСотрудники.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОбменЕРПСотрудники.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Сотрудник.Установить(Источник.Ссылка);
	Запись = НаборЗаписей.Добавить();
	Запись.Сотрудник	= Источник.Ссылка;
	Запись.ИдентификаторЗаписи				= Строка(Новый УникальныйИдентификатор);

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать данные для обмена с ЕРП об ответственном лице : " + ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
		
КонецПроцедуры
