//Аверсон ЕАЕ 31.01.2025 СВФР-014735
Функция ПолучитьДанныеПоСотруднику(Сотр, Дат, Орг,Док) Экспорт
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("График", Справочники.ГрафикиРаботы.ПустаяСсылка());
	СтруктураДанных.Вставить("ЧасовПоГрафику", 0);
	СтруктураДанных.Вставить("ОбедС", '00010101');
	СтруктураДанных.Вставить("ОбедПо", '00010101');
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Сотрудник", Сотр);
	График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Дат, СтруктураОтбора).ГрафикРаботы;
	СтруктураДанных.График = График;
	
	ЧасовПоИндивидуальномуГрафику = ПрочиеПроцедуры.ПолучитьДанныеПоИндивидуальномуЗаИнтервал(НачалоДня(Дат), КонецДня(Дат), Сотр).КоличествоЧасов;
	Если ЧасовПоИндивидуальномуГрафику <> 0 Тогда
		СтруктураДанных.ЧасовПоГрафику = ЧасовПоИндивидуальномуГрафику;
		
	Иначе
		ЧасовПоГрафику = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(График, Перечисления.ВидыУчетаВремени.ПоЧасам, 
		НачалоДня(Дат), КонецДня(Дат), Орг, ,Док);
		СтруктураДанных.ЧасовПоГрафику = ЧасовПоГрафику;
		
		ДанныеГрафика = ПолучитьДанныеГрафика(График, Дат);
		Если ЗначениеЗаполнено(ДанныеГрафика.ОбедС) И ЗначениеЗаполнено(ДанныеГрафика.ОбедПо) Тогда
			СтруктураДанных.ОбедС  = ДанныеГрафика.ОбедС;  //Дата(Год(Дат), Месяц(Дат), День(Дат), Час(ДанныеГрафика.ОбедС), Минута(ДанныеГрафика.ОбедС), Секунда(ДанныеГрафика.ОбедС));
			СтруктураДанных.ОбедПо = ДанныеГрафика.ОбедПо; //Дата(Год(Дат), Месяц(Дат), День(Дат), Час(ДанныеГрафика.ОбедПо), Минута(ДанныеГрафика.ОбедПо), Секунда(ДанныеГрафика.ОбедПо));
		КонецЕсли;
	КонецЕсли;
	Возврат СтруктураДанных;
КонецФункции

Функция ПолучитьДанныеГрафика(График, Дат)
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ОбедС", '00010101');
	СтруктураДанных.Вставить("ОбедПо", '00010101');
	
	ДеньНедели = ДеньНедели(Дат);
	Если ДеньНедели = 1 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Понедельник;
	ИначеЕсли ДеньНедели = 2 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Вторник;
	ИначеЕсли ДеньНедели = 3 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Среда;
	ИначеЕсли ДеньНедели = 4 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Четверг;
	ИначеЕсли ДеньНедели = 5 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Пятница;
	ИначеЕсли ДеньНедели = 6 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Суббота;
	ИначеЕсли ДеньНедели = 7 Тогда
		ДеньНеделиПеречисление = Перечисления.ДниНедели.Воскресенье;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикиРаботыПериодыСмены.ДеньНедели,
		|	ГрафикиРаботыПериодыСмены.ВремяНачала КАК ВремяНачала,
		|	ГрафикиРаботыПериодыСмены.ВремяОкончания
		|ИЗ
		|	Справочник.ГрафикиРаботы.ПериодыСмены КАК ГрафикиРаботыПериодыСмены
		|ГДЕ
		|	ГрафикиРаботыПериодыСмены.Ссылка = &График
		|	И ГрафикиРаботыПериодыСмены.ДеньНедели = &ДеньНедели
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВремяНачала";
	
	Запрос.УстановитьПараметр("График", График);
	Запрос.УстановитьПараметр("ДеньНедели", ДеньНеделиПеречисление);
	
	ТЗПериоды = Запрос.Выполнить().Выгрузить();
	Если ТЗПериоды.Количество() > 1 Тогда
		СтруктураДанных.ОбедС = ТЗПериоды[0].ВремяОкончания;
		СтруктураДанных.ОбедПо = ТЗПериоды[ТЗПериоды.Количество() - 1].ВремяНачала;
	КонецЕсли;
	
	Возврат СтруктураДанных;
КонецФункции
//Аверсон СВФР-014735