///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА ПОЛНОТЕКСТОВЫЙ ПОИСК
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

Процедура ОбновлениеИндексаППД() Экспорт
	Попытка	
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Начато регламентное индексирование порции");
			
		ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
		
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Закончено регламентное  индексирование порции");
	Исключение
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Во время регламентного обновления индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
	КонецПопытки;		
КонецПроцедуры

Процедура СлияниеИндексаППД() Экспорт
	Попытка	
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Начато регламентное слияние индексов");
			
		ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Закончено регламентное слияние индексов");
	Исключение
		ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Во время регламентного слияния индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
	КонецПопытки;		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕРЕСЧЕТА ИТОГОВ РЕГИСТРОВ НАКОПЛЕНИЯ
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

// Процедура выполняет пересчет регистров накопления, для удаления нулевых записей
Процедура ПересчетИтоговРегистровНакопления() Экспорт

	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;
		ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
	
	Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
		МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
	Иначе
		МенеджерРегистра.ПересчитатьИтоги();
	КонецЕсли;
	
КонецПроцедуры




///////////////////////////////////////////
// Процедуры регламентного обновления конфигурации ИБ
//

// Функция выделяет необходимые части из строки запуска
//
Функция ВыделитьПодстрокуСтрокиЗапуска(СтрокаЗапуска, КлючПодстроки)

	НомерПервогоСимвола = Найти(ВРег(СтрокаЗапуска), ВРег(КлючПодстроки)) + СтрДлина(КлючПодстроки);
	Для Счетчик = НомерПервогоСимвола По СтрДлина(СтрокаЗапуска) Цикл
		Если Сред(СтрокаЗапуска, Счетчик, 1) = ";" Тогда
			НомерПоследнегоСимвола = Счетчик - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Получаем искомую подстроку
	ИскомаяПодстрока = Сред(СтрокаЗапуска, НомерПервогоСимвола, (НомерПоследнегоСимвола - НомерПервогоСимвола + 1));
	Если Сред(ИскомаяПодстрока, 1, 1) = """" Тогда
		// Если подстрока в кавычках, то выделяем их
		ИскомаяПодстрока = Сред(ИскомаяПодстрока, 2, (СтрДлина(ИскомаяПодстрока) - 2));
	КонецЕсли;
	
	Возврат ИскомаяПодстрока;

КонецФункции // ВыделитьПодстроку()

// Процедура производит действия, приводящие к регламетному обновлению ИБ,
// но только для серверного варианта
Процедура ОбновлениеКонфигурации() Экспорт

	СтруктураОбновленияИБ = Константы.НастройкаОбновленияКонфигурации.Получить().Получить();
	Если ТипЗнч(СтруктураОбновленияИБ) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ФайлОбновления = Константы.ФайлКонфигурацииДляОбновления.Получить().Получить();
		Если ТипЗнч(ФайлОбновления) = Тип("ДвоичныеДанные") Тогда
			ПутьКФайлу = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".cf";
			ФайлОбновления.Записать(ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ФайлОбновленияКонфигурации", ПутьКФайлу);
			СтруктураОбновленияИБ.Вставить("ОписаниеФайлаОбновленияКонфигурации", Константы.ОписаниеФайлаКонфигурацииДляОбновления.Получить());
		Иначе
			СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если СтрЧислоВхождений(ВРег(СтрокаСоединения), "FILE=") Тогда
		Возврат;
	КонецЕсли;
	
	СтрДлина = СтрДлина(СтрокаСоединения);
	
	// Ищем имя сервера
	СтрокаСервера = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Srvr=");
	// Если в имени сервера присутствует имя порта, то выделяем его
	РазделительПорта = Найти(СтрокаСервера, ":");
	Если РазделительПорта > 0 Тогда
		ИмяСервера = Сред(СтрокаСервера, 1, (РазделительПорта - 1));
		НомерПортаКластера = Сред(СтрокаСервера, (РазделительПорта + 1));
	Иначе
		ИмяСервера = СтрокаСервера;
		ком = Новый COMОбъект("v81.COMConnector");
		НомерПортаКластера = ком.RMngrPortDefault;
	КонецЕсли; 
	
	// Ищем имя ИБ
	ИмяИБ = ВыделитьПодстрокуСтрокиЗапуска(СтрокаСоединения, "Ref=");
	
	ТекстСообщенияБлокировки = СтруктураОбновленияИБ.СообщениеОБлокировкеИБ;
	ПараметрБлокировки = СтруктураОбновленияИБ.ПараметрБлокировкиИБ;
	ИмяАдминистратораКластера = СтруктураОбновленияИБ.ИмяАдминистратораКластера;
	ПарольАдминистратораКластера = СтруктураОбновленияИБ.ПарольАдминистратораКластера;
	ИмяАдминистратораИБ = СтруктураОбновленияИБ.ИмяАдминистратораИБ;
	ИсполняемыйФайлКлиентаНаСервере = СтруктураОбновленияИБ.ИсполняемыйФайлКлиентаНаСервере;
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяАдминистратораИБ);
	НовыйПароль = Лев(Строка(Новый УникальныйИдентификатор), 20);
	Пользователь.Пароль = НовыйПароль;
	Пользователь.Записать();
	ПарольАдминистратораИБ = НовыйПароль;
	
	ПутьКФайлуЖурнала = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".txt";
	
	ШаблонТекста = ПолучитьОбщийМакет("МакетФайлаОбновленияКонфигурации");
	
	КонечныйТекст = ШаблонТекста.ПолучитьОбласть("ОбластьДоОбновленияКонфигурации");
	КонечныйТекст.УдалитьСтроку(1);
	КонечныйТекст.УдалитьСтроку(КонечныйТекст.КоличествоСтрок());
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьЗагрузкиИзмененнойКонфигурации");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	Если СтруктураОбновленияИБ.ОбновлятьКонфигурациюИБ Тогда
		ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьОбновленияКонфигурацииБД");
		ПромТекст.УдалитьСтроку(1);
		ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
		КонечныйТекст.УстановитьТекст(КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст());
	КонецЕсли;
	ПромТекст = ШаблонТекста.ПолучитьОбласть("ОбластьПослеОбновленияКонфигурации");
	ПромТекст.УдалитьСтроку(1);
	ПромТекст.УдалитьСтроку(ПромТекст.КоличествоСтрок());
	КонечныйТекст = КонечныйТекст.ПолучитьТекст() + ПромТекст.ПолучитьТекст();
	
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ServerName]", """" + ИмяСервера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[KlasterPortNumber]", СтрЗаменить(Строка(НомерПортаКластера), Символы.НПП, ""));
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBaseName]", """" + ИмяИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockMessageText]", """" + ТекстСообщенияБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[LockPermissionCode]", """" + ПараметрБлокировки + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminName]", """" + ИмяАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ClasterAdminPass]", """" + ПарольАдминистратораКластера + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminName]", """" + ИмяАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[InfoBasesAdminPass]", """" + ПарольАдминистратораИБ + """");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[NewPass]", """" + Лев(Строка(Новый УникальныйИдентификатор), 20) + """");
	
	// ВАЖНО!!! Это же время (5 минут) прописано как задержка проверки в механизме завершения работы пользователей, модуль приложения ЗавершениеРаботыПользователей.КонтрольРежимаЗавершенияРаботыПользователей()
	// Рюмин - вернуться сюда и разобраться с этим временем...
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeBeginLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[TimeEndLock]", "CDate(""" + Формат((ТекущаяДата() + 60*5 + 60*60*2), "ДФ=""дд/ММ/гггг ЧЧ:мм:сс""") + """)");
	
	Если СтруктураОбновленияИБ.ЗагружатьИзмененнуюКонфигурацию Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + СтруктураОбновленияИБ.ФайлОбновленияКонфигурации + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + СтруктураОбновленияИБ.ОписаниеФайлаОбновленияКонфигурации + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Cfg]", """" + "" + """");
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[ОписаниеФайлаОбновленияКонфигурации]", """" + "" + """");
	КонецЕсли; 
	Если ТипЗнч(ИсполняемыйФайлКлиентаНаСервере) = Тип("Строка") И НЕ ПустаяСтрока(ИсполняемыйФайлКлиентаНаСервере) Тогда
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + ИсполняемыйФайлКлиентаНаСервере + """");
	Иначе
		КонечныйТекст = СтрЗаменить(КонечныйТекст, "[v8exe]", """" + КаталогПрограммы() + "1cv8.exe" + """");
	КонецЕсли; 
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[Out]", """" + ПутьКФайлуЖурнала + """");

	ИмяВременногоФайла = КаталогВременныхФайлов() + Строка(Новый УникальныйИдентификатор) + ".vbs";
	КонечныйТекст = СтрЗаменить(КонечныйТекст, "[FilePath]", """" + ИмяВременногоФайла + """");
	
	Скрипт = Новый ТекстовыйДокумент;
	Скрипт.Вывод = ИспользованиеВывода.Разрешить;
	Скрипт.УстановитьТекст(КонечныйТекст);
	Скрипт.Записать(ИмяВременногоФайла, КодировкаТекста.Системная);
	
	Ком = Новый COMObject("wScript.Shell");
	Ком.Run("""" + ИмяВременногоФайла + """");
	
КонецПроцедуры

///////////////////////////////////////////
// Процедуры получения электронных сообщений
//

Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),,,, Истина, Ложь, ТекстОшибок);
	
	Если ПустаяСтрока(ТекстОшибок) Тогда
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено успешно");
	Иначе
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено с ошибками:" + Символы.ПС + ТекстОшибок);
	КонецЕсли; 
	
КонецПроцедуры

//Аверсон ЕАЕ 11.11.2020
Процедура ВыгрузкаWEBTutor() Экспорт
	//Подключение
	
	SQL_Соединение = Новый COMОбъект("ADODB.Connection");
	
	Провайдер = "SQLOLEDB.1";
	Сервер = "Srv-sql-002";
	НазваниеБазы = "webtutor";
	Пользователь = "webtutor";
	Пароль = "vBK2shqC";

	//СтрокаПодключения = "Provider=" + Провайдер + "; Server=" + Сервер + " ;Database=" + НазваниеБазы + "; User Id=" + Пользователь + ";Password=" + Пароль + ";";
	СтрокаПодключения = "driver={SQL Server};" + 
	                    "server=" + Сервер + ";" + 
						"uid=" + Пользователь + ";" +
	                    "pwd=" + Пароль + ";" +
	                    "database=" + НазваниеБазы + ";";
	SQL_Соединение.Connectionstring = СтрокаПодключения;

	Попытка
		
		SQL_Соединение.Open();
		//Сообщить("Соединение установлено.");
		ПодключениеSQL = Истина;
		
	Исключение
		
		//Сообщить("Соединение не установлено");
		//Сообщить(ОписаниеОшибки());
		ПодключениеSQL = Ложь;
	КонецПопытки;
	
	Если ПодключениеSQL = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	//Выгрузка
	ВыгрузитьСотрудники(SQL_Соединение);
	
	ВыгрузитьПодразделения(SQL_Соединение);
	
	ВыгрузитьДолжности(SQL_Соединение);
	
	//Отключение
	Попытка
		SQL_Соединение.Close();

		//Сообщить("Отключение соединения произошло успешно.");

	Исключение   
		//Сообщить("Отключение соединения не произошло.");

	КонецПопытки;	
КонецПроцедуры

Процедура ВыгрузитьСотрудники(SQL_Соединение)
	НачатьТранзакцию();
	ВсеСотрудникиВыгрузились = Истина;
	
	SQL_Соединение.Execute("DELETE FROM WTEmployees");

	WT_Employees = ПолучитьТЗСотрудники();
	
	Для Каждого Стр Из WT_Employees Цикл
		EmployeeID    = Стр.ТабельныйНомер;
		Last_Name     = Стр.Фамилия;
		First_Name    = Стр.Имя;
		Surname       = Стр.Отчество;
		Gender        = Стр.Пол;
		Если ЗначениеЗаполнено(Стр.ДатаРождения) Тогда
			Birthdate     = Формат(Стр.ДатаРождения, "ДФ=yyyyMMdd"); //"CONVERT(datetime, '" + Birthdate + "')"
		Иначе
			Birthdate = null;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ДатаПриема) Тогда
			Accept_date     = Формат(Стр.ДатаПриема, "ДФ=yyyyMMdd"); //"CONVERT(datetime, '" + Accept_date + "')"
		Иначе
			Accept_date = null;
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ДатаУвольнения) Тогда
			End_Date     = Формат(Стр.ДатаУвольнения, "ДФ=yyyyMMdd"); //"CONVERT(datetime, '" + End_Date + "')"
		Иначе
			End_Date = null;
		КонецЕсли;
		Login         = Стр.Логин;
		Если ЗначениеЗаполнено(Стр.ЭлПочта) Тогда
			Email         = Стр.ЭлПочта;
		Иначе
			Email         = null;
		КонецЕсли;
		Position_Name = Стр.ДолжностьНаименование;
		PositionID    = Стр.ДолжностьКод;
		MainWork      = Стр.ОсновноеМестоРаботы;
		Если ЗначениеЗаполнено(Стр.РуководительТабельныйНомер) Тогда
			Main_Employee = Стр.РуководительТабельныйНомер;
		Иначе
			Main_Employee = null;
		КонецЕсли;
		DepartmentID  = Стр.ПодразделениеКод;
		Entity = Стр.Организация;
		
		Если Не ЗначениеЗаполнено(Стр.НомерПаспорта) ИЛИ Не ЗначениеЗаполнено(Стр.СерияПаспорта) Тогда
			Passport = null;
		Иначе
			Passport = СокрЛП(Стр.СерияПаспорта) + СокрЛП(Стр.НомерПаспорта);
		КонецЕсли;
		
		Попытка
			SQL_Соединение.Execute("Insert into WTEmployees ([EmployeeID], [EmployeeFirstNameLocal], [EmployeeSurnameLocal], [EmployeeLastNameLocal], [BirtDate], 
			|[Entity], [Active], [Passport], [WorkStart], [WorkEnd], [Email], [DepartmentID], [PositionID]) values ('" + 
			EmployeeID + "','" + First_Name  + "','" + Surname + "','" + Last_Name + "'," + "CONVERT(datetime, '" + Birthdate + "')"  + ",'" + Entity + "'," + MainWork + ",'" + Passport + 
			"'," + "CONVERT(datetime, '" + Accept_date + "')" + "," + "CONVERT(datetime, '" + End_Date + "')" + ",'" + Email + "','" + DepartmentID + "','" + PositionID + "')");
		Исключение
			//Сообщить(ОписаниеОшибки());
			ВсеСотрудникиВыгрузились = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Если ВсеСотрудникиВыгрузились Тогда
		//Сообщить("Сотрудники выгружены.");
		ЗафиксироватьТранзакцию();
	Иначе
		//Сообщить("Сотрудники не выгружены.");
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗСотрудники()
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизаций.Код КАК ТабельныйНомер,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ВЫБОР
	|	КОГДА СотрудникиОрганизаций.ФизЛицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Женский)
	|	ТОГДА 1
	|   ИНАЧЕ 2
	|	КОНЕЦ КАК Пол,
	|	СотрудникиОрганизаций.Физлицо.ДатаРождения КАК ДатаРождения,
	|	ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК ДатаПриема,
	|	УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения,
	|	""       "" КАК Логин,
	|	КонтактнаяИнформацияЭлПочта.Представление КАК ЭлПочта,
	|	ВЫБОР
	|	КОГДА СотрудникиОрганизаций.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
	|	ТОГДА ""Договор подряда""
	|	ИНАЧЕ РаботникиОрганизаций.Должность.Наименование 
	|	КОНЕЦ КАК ДолжностьНаименование,
	|	ВЫБОР
	|	КОГДА СотрудникиОрганизаций.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
	|	ТОГДА ""99999""
	|	ИНАЧЕ РаботникиОрганизаций.Должность.Код 
	|	КОНЕЦ КАК ДолжностьКод,
	|	1 КАК ОсновноеМестоРаботы,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Код КАК РуководительТабельныйНомер,
	|	ВЫБОР
	|	КОГДА СотрудникиОрганизаций.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
	|	ТОГДА ""99999""
	|	ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации.Код 
	|	КОНЕЦ КАК ПодразделениеКод,
	|	""NBF"" КАК Организация,
	|	ПаспортныеДанные.ДокументНомер КАК НомерПаспорта,
	|	ПаспортныеДанные.ДокументСерия КАК СерияПаспорта
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ТекДата, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СотрудникиОрганизаций.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
	|		ПО СотрудникиОрганизаций.Ссылка = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
	|		ПО СотрудникиОрганизаций.Ссылка = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЭлПочта
	|		ПО СотрудникиОрганизаций.Физлицо = КонтактнаяИнформацияЭлПочта.Объект
	|			И (КонтактнаяИнформацияЭлПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформацияЭлПочта.Вид.Наименование = ""Личная почта"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ТекДата, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ПО СотрудникиОрганизаций.ПодразделениеОрганизации = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ТекДата) КАК РаботникиОрганизаций
	|		ПО РаботникиОрганизаций.Сотрудник = СотрудникиОрганизаций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ТекДата, ) КАК ПаспортныеДанные
	|		ПО СотрудникиОрганизаций.ФизЛицо = ПаспортныеДанные.ФизЛицо
	|ГДЕ
	|	НЕ СотрудникиОрганизаций.ПометкаУдаления
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//Для Каждого Стр Из ТЗ Цикл
	//	Стр.Логин = "NBF" + СокрЛП(Стр.ТабельныйНомер);	
	//КонецЦикла;
	
	Возврат ТЗ;
КонецФункции

Процедура ВыгрузитьПодразделения(SQL_Соединение)
	НачатьТранзакцию();
	ВсеПодразделенияВыгрузились = Истина;
	
	SQL_Соединение.Execute("DELETE FROM WTDepartments");
	
	WT_Departments = ПолучитьТЗПодразделения();
	
	Для Каждого Стр Из WT_Departments Цикл
		DepartmentID = Стр.ПодразделениеКод;                                                                            
		Name_Local   = Стр.ПодразделениеНаименование;
		Entity       = Стр.Организация;
		Parents_ID   = Стр.ПодразделениеРодительКод;
		Если ЗначениеЗаполнено(Стр.РуководительТабельныйНомер) Тогда
			MainEmployeeid = Стр.РуководительТабельныйНомер;
		Иначе
			MainEmployeeid = null;
		КонецЕсли;
		
		Попытка
			SQL_Соединение.Execute("Insert into WTDepartments ([DepartmentID], [Name_Local], [Entity], [MainEmployeeid], [ParentDepartmentID]) values ('" + 
			DepartmentID + "','" + Name_Local  + "','" + Entity + "','" + MainEmployeeid + "','" + Parents_ID + "')");
		Исключение
			//Сообщить(ОписаниеОшибки());
			ВсеПодразделенияВыгрузились = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Если ВсеПодразделенияВыгрузились Тогда
		//Сообщить("Подразделения выгружены.");
		ЗафиксироватьТранзакцию();
	Иначе
		//Сообщить("Подразделения не выгружены.");
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗПодразделения()
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	ПодразделенияОрганизаций.Код КАК ПодразделениеКод,
	        |	ПодразделенияОрганизаций.Наименование КАК ПодразделениеНаименование,
	        |	""NBF"" КАК Организация,
	        |	ПодразделенияОрганизаций.Родитель.Код КАК ПодразделениеРодительКод,
			|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Код КАК РуководительТабельныйНомер
	        |ИЗ
	        |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ТекДата, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
			|		ПО ПодразделенияОрганизаций.Ссылка = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	        |ГДЕ
	        |	НЕ ПодразделенияОрганизаций.ПометкаУдаления";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции

Процедура ВыгрузитьДолжности(SQL_Соединение)
	НачатьТранзакцию();
	ВсеДолжностиВыгрузились = Истина;
	
	SQL_Соединение.Execute("DELETE FROM WTPositions");
	
	WTPostitions = ПолучитьТЗДолжности();
	
	Для Каждого Стр Из WTPostitions Цикл
		PositionID = Стр.ДолжностьКод;                                                                            
		Name_Local   = Стр.ДолжностьНаименование;
		Entity       = Стр.Организация;
		
		Попытка
			SQL_Соединение.Execute("Insert into WTPositions ([PositionID], [Name_Local], [Entity]) values ('" + 
			PositionID + "','" + Name_Local  + "','" + Entity + "')");
		Исключение
			//Сообщить(ОписаниеОшибки());
			ВсеДолжностиВыгрузились = Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Если ВсеДолжностиВыгрузились Тогда
		//Сообщить("Должности выгружены.");
		ЗафиксироватьТранзакцию();
	Иначе
		//Сообщить("Должности не выгружены.");
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТЗДолжности()
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	Должности.Код КАК ДолжностьКод,
	        |	Должности.Наименование КАК ДолжностьНаименование,
	        |	""NBF"" КАК Организация
	        |ИЗ
	        |	Справочник.Должности КАК Должности
	        |ГДЕ
	        |	НЕ Должности.ПометкаУдаления";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;
КонецФункции
//Аверсон

//Аверсон ЕАЕ 27.06.2022 СВФР-009181
Процедура ВыгрузкаСотрудников() Экспорт
	
	// Запись данных справочника в DBF-файл:
	БД = Новый XBase;
	
	// проектируется структура таблицы, т.е. имена и типы полей
	БД.Поля.Добавить("TABNUMBER","N",10,0);	// таб.номер
	БД.Поля.Добавить("LASTNAME","S",50);	// фамилия
	БД.Поля.Добавить("NAME","S",50);	    // имя
	БД.Поля.Добавить("MIDNAME","S",50);	    // отчество
	БД.Поля.Добавить("DPRI","D");	        // дата приема
	БД.Поля.Добавить("DUVOL","D");	        // дата увольнения
	БД.Поля.Добавить("NUMPROPUSK","S",30);	// номер пропуска
	
	// создание файла с указанной структурой
	Путь = Константы.КаталогДляВыгрузкиСотрудников.Получить();
	БД.СоздатьФайл(Путь + "\" + Формат(ТекущаяДата(), "ДФ=dd_MM_yy") + ".dbf");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизаций.Код,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|   РаботникиОрганизацийПрием.Период КАК ДатаПриема,
		|   ЕстьNull(ДобавитьКДате(РаботникиОрганизацийУвольнение.Период, День, -1), ДатаВремя(1,1,1)) КАК ДатаУвольнения
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&НаДату, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СотрудникиОрганизаций.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПрием
		|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийПрием.Сотрудник
		|			И (РаботникиОрганизацийПрием.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнение
		|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизацийУвольнение.Сотрудник
		|			И (РаботникиОрганизацийУвольнение.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
		|ГДЕ
		|	НЕ СотрудникиОрганизаций.ПометкаУдаления
		|	И (СотрудникиОрганизаций.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Постоянный)
		|			ИЛИ СотрудникиОрганизаций.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Совместитель))";
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// создается новая пустая строка таблицы
		БД.Добавить();
		
		// заполняем поля новой строки
		БД.TABNUMBER = СтрЗаменить(ВыборкаДетальныеЗаписи.Код, Символы.НПП, "");
		БД.LASTNAME = СокрЛП(ВыборкаДетальныеЗаписи.Фамилия);
		БД.NAME = СокрЛП(ВыборкаДетальныеЗаписи.Имя);
		БД.MIDNAME = СокрЛП(ВыборкаДетальныеЗаписи.Отчество);
		БД.DPRI = ВыборкаДетальныеЗаписи.ДатаПриема;
		БД.DUVOL = ВыборкаДетальныеЗаписи.ДатаУвольнения;
		БД.NUMPROPUSK = "";
		БД.Записать();
	КонецЦикла;
	
	// зафиксировать изменения в файле
	БД.ЗакрытьФайл();
КонецПроцедуры
//Аверсон СВФР-009181


Процедура ОповещенияДопПенсия() Экспорт 
	Если СтрЧислоВхождений(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") Тогда //файловая //Аверсон 03.11.2022 КВВ СВФР-009612 
		//Аверсон 25.10.2022 КВВ СВФР-009612 ( 
		Организация_ = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Если Организация_.УчетДополнительнойПенсии Тогда
			
			ТекстПериодовДопПенсии = "
			|ВЫБРАТЬ
			|ИсторияИзмененияУровней.Сотрудник КАК Сотрудник,
			|ИсторияИзмененияУровней.ПроцентРаботника КАК ПроцентРаботника,
			|ИсторияИзмененияУровней.Период КАК Период
			|ПОМЕСТИТЬ ВТУровни
			|ИЗ РегистрСведений.ДополнительнаяПенсияРаботодательРаботник КАК ИсторияИзмененияУровней
			//|ГДЕ ИсторияИзмененияУровней.Период <= &ДатаНачала
			|;
			|ВЫБРАТЬ
			|ВТУровни.Сотрудник КАК Сотрудник,
			|МАКСИМУМ(ВТУровни.Период) КАК Период
			|ПОМЕСТИТЬ ВтМаксимальныеПериод
			|ИЗ ВТУровни КАК ВТУровни
			|СГРУППИРОВАТЬ ПО
			|ВТУровни.Сотрудник
			|;		
			|ВЫБРАТЬ
			|ВТУровни.Сотрудник КАК Сотрудник,
			|ВТУровни1.Период КАК НачалоПериода,
			|МИНИМУМ(ДОБАВИТЬКДАТЕ(ВТУровни.Период, СЕКУНДА, -1)) КАК КонецПериода
			|ПОМЕСТИТЬ ВТПЕРИОДЫ
			|ИЗ ВТУровни КАК ВТУровни
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни1
			|ПО ВТУровни.Сотрудник = ВТУровни1.Сотрудник
			|И ВТУровни.Период > ВТУровни1.Период
			|СГРУППИРОВАТЬ ПО
			|ВТУровни.Сотрудник,
			|ВТУровни1.Период
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|ВтМаксимальныеПериод.Сотрудник,
			|ВтМаксимальныеПериод.Период,
			|ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
			|ИЗ ВтМаксимальныеПериод КАК ВтМаксимальныеПериод
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни1
			|ПО ВтМаксимальныеПериод.Сотрудник = ВТУровни1.Сотрудник
			|И ВтМаксимальныеПериод.Период = ВТУровни1.Период
			|;
			|ВЫБРАТЬ
			|ВТПЕРИОДЫ.Сотрудник КАК Сотрудник,
			|ВТПЕРИОДЫ.НачалоПериода КАК НачалоПериода,
			|КОНЕЦПЕРИОДА(ВТПЕРИОДЫ.КонецПериода, ДЕНЬ) КАК КонецПериода,
			|ВТУровни.ПроцентРаботника КАК ПроцентРаботника
			|ПОМЕСТИТЬ ВтПериодыДопПенсии
			|ИЗ ВТПЕРИОДЫ КАК ВТПЕРИОДЫ
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровни КАК ВТУровни
			|ПО ВТПЕРИОДЫ.Сотрудник = ВТУровни.Сотрудник
			|И ВТПЕРИОДЫ.НачалоПериода = ВТУровни.Период
			|ГДЕ ВТУровни.ПроцентРаботника <> 0
			|;
			|";
			
			СписокСотрудников = Новый СписокЗначений;
			
			//основные уволенные (
			ЗапросОсновныеУволенные = Новый Запрос;
			ЗапросОсновныеУволенные.Текст = ТекстПериодовДопПенсии + "
			|ВЫБРАТЬ 
			|Работники.Сотрудник,
			|Работники.ТипРаботника,
			|Работники.ПодразделениеОрганизации,
			|КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) КАК ДатаУвольнения
			|ИЗ РегистрСведений.РаботникиОрганизаций КАК Работники   		
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
			|ПО Работники.Сотрудник = ВтПериодыДопПенсии.Сотрудник
			|ГДЕ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)		
			|И Работники.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.Постоянный)
			|И НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
			|И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
			|И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(Работники.Период,ДЕНЬ,-1),ДЕНЬ) МЕЖДУ ВтПериодыДопПенсии.НачалоПериода И ВтПериодыДопПенсии.КонецПериода		
			|И Работники.Сотрудник.НеОповещатьДопПенсияУволенные = Ложь";
			ЗапросОсновныеУволенные.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
			ЗапросОсновныеУволенные.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
			РезЗЗапросОсновныеУволенные = ЗапросОсновныеУволенные.Выполнить().Выгрузить();
			//основные уволенные )
			
			
			//договора подряда уволенные (
			ЗапросДогПодУволенные = Новый Запрос;
			ЗапросДогПодУволенные.Текст = ТекстПериодовДопПенсии + "
			|ВЫБРАТЬ
			|ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
			|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник
			|ИЗ Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
			|ПО ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник = ВтПериодыДопПенсии.Сотрудник
			|ГДЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника = ЗНАЧЕНИЕ(Перечисление.ТипыРаботников.ДоговорПодряда)
			|И НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
			|И ДоговорНаВыполнениеРаботСФизЛицом.Ссылка.НеОповещатьДопПенсия = Ложь
			|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
			|И КОНЕЦПЕРИОДА(ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,ДЕНЬ) МЕЖДУ ВтПериодыДопПенсии.НачалоПериода И ВтПериодыДопПенсии.КонецПериода
			|И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
			ЗапросДогПодУволенные.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
			ЗапросДогПодУволенные.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
			РезЗЗапросДогПодУволенные = ЗапросДогПодУволенные.Выполнить().Выгрузить();
			//договора подряда уволенные )		
			
			
			//пересчет (
			ЗапросПересчет = Новый Запрос;
			ЗапросПересчет.Текст = ТекстПериодовДопПенсии + "
			|ВЫБРАТЬ 
			|ОснНУ.Сотрудник
			|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНУ
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
			|ПО ОснНУ.Сотрудник = ВтПериодыДопПенсии.Сотрудник
			|ГДЕ
			|НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
			|И НАЧАЛОПЕРИОДА(ОснНУ.ПериодДействия,МЕСЯЦ) < НАЧАЛОПЕРИОДА(ОснНУ.ПериодРегистрации,МЕСЯЦ)
			|И ОснНУ.Сотрудник.НеОповещатьДопПенсияПересчет = ЛОЖЬ
			|И НАЧАЛОПЕРИОДА(ОснНУ.ПериодРегистрации,МЕСЯЦ) = &ПериодРегистрации
			|СГРУППИРОВАТЬ ПО 
			|ОснНУ.Сотрудник
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ 
			|ДопНУ.Сотрудник
			|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДопНУ
			|ЛЕВОЕ СОЕДИНЕНИЕ ВтПериодыДопПенсии КАК ВтПериодыДопПенсии
			|ПО ДопНУ.Сотрудник = ВтПериодыДопПенсии.Сотрудник
			|ГДЕ
			|НЕ ВтПериодыДопПенсии.Сотрудник ЕСТЬ NULL
			|И НАЧАЛОПЕРИОДА(ДопНУ.БазовыйПериодНачало,МЕСЯЦ) < НАЧАЛОПЕРИОДА(ДопНУ.ПериодРегистрации,МЕСЯЦ)
			|И ДопНУ.Сотрудник.НеОповещатьДопПенсияПересчет = ЛОЖЬ
			|И НАЧАЛОПЕРИОДА(ДопНУ.ПериодРегистрации,МЕСЯЦ) = &ПериодРегистрации
			|СГРУППИРОВАТЬ ПО 
			|ДопНУ.Сотрудник";
			ЗапросПересчет.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())-86400*60);  // 60 дней
			ЗапросПересчет.УстановитьПараметр("ПериодРегистрации", ?(День(ТекущаяДата())<19,НачалоМесяца(НачалоМесяца(ТекущаяДата())-1),НачалоМесяца(ТекущаяДата())));
			РезЗЗапросПересчет = ЗапросПересчет.Выполнить().Выгрузить();
			
			//пересчет )
			
			
			Если РезЗЗапросОсновныеУволенные.Количество() > 0 ИЛИ РезЗЗапросДогПодУволенные.Количество() > 0 ИЛИ РезЗЗапросПересчет.Количество() > 0 Тогда
				
				Для Каждого Стр1 ИЗ РезЗЗапросОсновныеУволенные Цикл
					СписокСотрудников.Добавить(Стр1.Сотрудник,1);
				КонецЦикла;
				Для Каждого Стр1 ИЗ РезЗЗапросДогПодУволенные Цикл
					СписокСотрудников.Добавить(Стр1.Сотрудник,2);
				КонецЦикла;	
				Для Каждого Стр1 ИЗ РезЗЗапросПересчет Цикл
					СписокСотрудников.Добавить(Стр1.Сотрудник,3);
				КонецЦикла;
				
				Попытка
					Форма1 = ПолучитьОбщуюФорму("ОповещенияДопПенсия");				
					Форма1.СписокСотрудников = СписокСотрудников;
					Форма1.Открыть();				
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 25.10.2022 КВВ СВФР-009612 )
	КонецЕсли;
КонецПроцедуры

//Аверсон ЕАЕ 10.11.2023 СВФР-011701
Процедура ПереносГродно() Экспорт
	//Параметры = "File=""%ИмяБазы%""; Usr=""%Пользователь%"";Pwd=""%Пароль%""";
	Параметры = "Srvr=""%ИмяСервера%""; Ref=""%ИмяБазы%""; Usr=""%Пользователь%""; Pwd=""%Пароль%"";";
	ИмяСервера = Константы.ИмяСервераГродно.Получить();
	ИмяБазы = Константы.ИмяБазыГродно.Получить();
	Пользователь = Константы.ПользовательГродно.Получить();
	Пароль = Константы.ПарольГродно.Получить();
	Параметры = СтрЗаменить(Параметры, "%ИмяСервера%", СокрЛП(ИмяСервера));
	Параметры = СтрЗаменить(Параметры, "%ИмяБазы%", СокрЛП(ИмяБазы));
	Параметры = СтрЗаменить(Параметры, "%Пользователь%", СокрЛП(Пользователь));
	Параметры = СтрЗаменить(Параметры, "%Пароль%", СокрЛП(Пароль));

	УчЗапись = Константы.УчетнаяЗаписьОтправкаОшибокПеренос.Получить();
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчЗапись);
	Логин = УчЗапись.ЛогинSMTP;
	АдресПолучателя = УчЗапись.АдресЭлектроннойПочты;
	
	ТекстОшибки = "";
	База = "";
	Попытка
		V83COMConnector = Новый COMОбъект("V83.COMConnector");
		База = V83COMConnector.Connect(Параметры);
	Исключение
		Т = "Не удалось поключиться к базе.";
		Сообщить(Т);
		ТекстОшибки = ТекстОшибки + "
		|" + Т;
		
		Т = СокрЛП(ОписаниеОшибки());
		Сообщить(Т);
		ТекстОшибки = ТекстОшибки + "
		|" + Т;
		База = "";
		Возврат;
	КонецПопытки;
	
	МассивТабНомера = ПолучитьТабНомера();
	
	ЗапросТам = База.NewObject("Запрос");
	ЗапросТам.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|*,
	|ДОБАВИТЬКДАТЕ(РСПеренос.ДатаРождения,ГОД,18) КАК ДатаКонцаВычета
	|ИЗ РегистрСведений.СВЭЙ_Перенос КАК РСПеренос
	|УПОРЯДОЧИТЬ ПО
	|Период";
	
	РС = ЗапросТам.Выполнить().выбрать(); 
	Пока РС.следующий() цикл
		Док = РС.Регистратор;
		ВидДок = РС.ВидДок;
		Гуид = РС.Гуид;
		Если Не ЗначениеЗаполнено(Гуид) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидДок = 1 Тогда //Прием
			УИДок = Новый УникальныйИдентификатор(Гуид);
			СОтр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);
			ГуидФЛ = База.XMLСтрока(Док.ФизическоеЛицо);
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если Не ЗначениеЗаполнено(ФЛ.Наименование) Тогда
				ФЛОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ФЛОбъект.УстановитьСсылкуНового(ФЛ);
			Иначе
				ФЛОбъект = ФЛ.ПолучитьОбъект();
			КонецЕсли;
			Наим = СтрЗаменить(СокрЛП(Док.Сотрудник.Наименование), "  ", " ");
			ФЛОбъект.Наименование = СокрЛП(Наим);
			ФЛОбъект.ДатаРождения = Док.ФизическоеЛицо.ДатаРождения;
			ФЛОбъект.СтраховойНомерПФР = Док.ФизическоеЛицо.СтраховойНомерПФР;
			Если База.XMLСтрока(Док.ФизическоеЛицо.Пол) = "Мужской" Тогда
				ФЛОбъект.Пол = Перечисления.ПолФизическихЛиц.Мужской;
			Иначе
				ФЛОбъект.Пол = Перечисления.ПолФизическихЛиц.Женский;
			КонецЕсли;
			ФЛОбъект.МестоРождения = Док.ФизическоеЛицо.МестоРождения;
			ФЛОбъект.Оклад = 1;
			ФЛОбъект.ЛичныйНомер = Док.ФизическоеЛицо.ИдентификационныйНомер;
			Попытка
				ФЛОбъект.Записать();
				Сообщить("Создан элемент справочника Физические лица " + СокрЛП(ФЛОбъект) + ".");
				
				//Контактная информация
				АдресРегистрацииФЛ = ПолучитьАдресФЛ(Док.ФизическоеЛицо, База);
				Если ЗначениеЗаполнено(АдресРегистрацииФЛ) Тогда
					МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
					
					МенеджерЗаписи.Объект = ФЛОбъект.Ссылка;
					МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
					МенеджерЗаписи.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица;
					МенеджерЗаписи.Представление = АдресРегистрацииФЛ;
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
				//ФИО физ.лиц
				СтруктураФИО = ПолучитьФИО(Док.ФизическоеЛицо, База);
				Если ЗначениеЗаполнено(СтруктураФИО.Фамилия) И ЗначениеЗаполнено(СтруктураФИО.Имя) И ЗначениеЗаполнено(СтруктураФИО.Отчество) Тогда
					МенеджерЗаписи = РегистрыСведений.ФИОФизЛиц.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = Док.Дата;
					МенеджерЗаписи.ФизЛицо = ФЛОбъект.Ссылка;
					МенеджерЗаписи.Фамилия = СокрЛП(СтруктураФИО.Фамилия);
					МенеджерЗаписи.Имя = СокрЛП(СтруктураФИО.Имя);
					МенеджерЗаписи.Отчество = СокрЛП(СтруктураФИО.Отчество);
					МенеджерЗаписи.Записать();
				КонецЕсли;
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				Сообщить(Т); //эти ошибки нужно собирать и потом куда-то там отправить
				ТекстОшибки = ТекстОшибки + "
		        |" + Т;
			КонецПопытки;
			
			//Создадим сотрудника
			Если Не ЗначениеЗаполнено(ФЛОбъект.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
				Продолжить;
			КонецЕсли;
			УИ = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИ);
			Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
				СотрОбъект = Справочники.СотрудникиОрганизаций.СоздатьЭлемент();
				СотрОбъект.УстановитьСсылкуНового(Сотр);
				
				//Таб. номер будем создавать только новому сотруднику
				Если ЗначениеЗаполнено(Док.Сотрудник.ТабЗП) Тогда
					ТабНомер = Док.Сотрудник.ТабЗП;
					Если МассивТабНомера.Найти(ТабНомер, "ТабНомер") <> Неопределено Тогда
						ТабНомер = ПолучитьСледующийТабНомер(МассивТабНомера);
					КонецЕсли;
				Иначе
					ТабНомер = ПолучитьСледующийТабНомер(МассивТабНомера);
					
				КонецЕсли;
				СотрОбъект.Код = ТабНомер;
				НоваяСтр = МассивТабНомера.Добавить();
				НоваяСтр.ТабНомер = ТабНомер;
			Иначе
				СотрОбъект = Сотр.ПолучитьОбъект();
			КонецЕсли;
			СотрОбъект.Наименование = Наим;
			СотрОбъект.Актуальность = Истина;
			СотрОбъект.Физлицо = ФЛОбъект.Ссылка;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				СотрОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				СотрОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			
			Если База.XMLСтрока(Док.ВидДоговора) = "Контракт" Тогда
				ВидДоговора = 1;
			ИначеЕсли База.XMLСтрока(Док.ВидДоговора) = "ТрудовойДоговор" 
				ИЛИ База.XMLСтрока(Док.ВидДоговора) = "ТрудовойДоговорСрочный" Тогда
				ВидДоговора = 2;
			ИначеЕсли База.XMLСтрока(Док.ВидДоговора) = "ДоговорГПХ" Тогда
				ВидДоговора = 3;
			Иначе
				ВидДоговора = 4;
			КонецЕсли;
			
			Если ВидДоговора = 1 Тогда
				СотрОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
			ИначеЕсли ВидДоговора = 2 или ВидДоговора = 4 Тогда
				СотрОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
			ИначеЕсли ВидДоговора = 3 Тогда
				СотрОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
			Иначе
				СотрОбъект.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий;
			КонецЕсли;
			
			Если База.XMLСтрока(Док.ВидЗанятости) = "ОсновноеМестоРаботы" Тогда
				ТипРаботника = 1;
			ИначеЕсли База.XMLСтрока(Док.ВидЗанятости) = "Совместительство" 
				ИЛИ База.XMLСтрока(Док.ВидЗанятости) = "ВнутреннееСовместительство" 
				ИЛИ База.XMLСтрока(Док.ВидЗанятости) = "ОсновноеМестоРаботыВтораяПрофессия" Тогда
				ТипРаботника = 2;
			ИначеЕсли База.XMLСтрока(Док.ВидЗанятости) = "РаботаПоДоговоруПодряда" Тогда
				ТипРаботника = 3;
			ИначеЕсли База.XMLСтрока(Док.ВидЗанятости) = "Подработка"
				ИЛИ База.XMLСтрока(Док.ВидЗанятости) = "ВнештатныеСотрудники"
				ИЛИ База.XMLСтрока(Док.ВидЗанятости) = "БезВыполненияТрудовыхОбязательств" Тогда
				ТипРаботника = 4;
			КонецЕсли;
			
			Если ТипРаботника = 1 Тогда
				СотрОбъект.ТипРаботника = Перечисления.ТипыРаботников.Постоянный;
			ИначеЕсли ТипРаботника = 2 Тогда
				СотрОбъект.ТипРаботника = Перечисления.ТипыРаботников.Совместитель;
			ИначеЕсли ТипРаботника = 3 Тогда
				СотрОбъект.ТипРаботника = Перечисления.ТипыРаботников.ДоговорПодряда;
			Иначе
				СотрОбъект.ТипРаботника = Перечисления.ТипыРаботников.НесписочныйСостав;
			КонецЕсли;
			
			Если База.XMLСтрока(Док.ВидЗанятости) = "ОсновноеМестоРаботы" Тогда
				СотрОбъект.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
			ИначеЕсли База.XMLСтрока(Док.ВидЗанятости) = "Совместительство" Тогда
				СотрОбъект.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.Совместительство;
			Иначе
				СотрОбъект.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство;
			КонецЕсли;
			Попытка
				СотрОбъект.Записать();
				Сообщить("Создан элемент справочника Сотрудники организаций " + СокрЛП(СотрОбъект) + ".");
				
				Сотр = СотрОбъект.ссылка;
				
				КатегорияОбъекта = Справочники.КатегорииОбъектов.НайтиПоНаименованию("Табель", Истина);
				Если ЗначениеЗаполнено(КатегорияОбъекта) Тогда
					МенеджерЗаписи = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи();
					
					МенеджерЗаписи.Объект = Сотр;
					МенеджерЗаписи.Категория = КатегорияОбъекта;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				Сообщить(Т); //эти ошибки нужно собирать и потом куда-то там отправить
				ТекстОшибки = ТекстОшибки  + "
		        |"+ Т;
			КонецПопытки;
			
			/////////////////////////////////////////////////////
			
			ДокПрием = Документы.ПриемНаРаботуВОрганизацию.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокПрием.Номер) Тогда
				ДокПриемОбъект = Документы.ПриемНаРаботуВОрганизацию.СоздатьДокумент();
				ДокПриемОбъект.УстановитьСсылкуНового(ДокПрием);
			Иначе
				ДокПриемОбъект = ДокПрием.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокПриемОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокПриемОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокПриемОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокПриемОбъект.Дата = Док.Дата;
			ДокПриемОбъект.ОбменДанными.Загрузка = Ложь;
			ДокПриемОбъект.НомерД = Док.НомерПриказа;
			ДокПриемОбъект.ДатаПриказа = Док.Дата;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокПриемОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокПриемОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			Если ДокПриемОбъект.РаботникиОрганизации.Количество() = 0 Тогда
				НоваяСтр = ДокПриемОбъект.РаботникиОрганизации.Добавить();
			Иначе
				НоваяСтр = ДокПриемОбъект.РаботникиОрганизации[0];
			КонецЕсли;
			НоваяСтр.Сотрудник = Сотр;
			НоваяСтр.ФизЛицо = Сотр.Физлицо;
			
			//ищем/создаем подразделение
			УИПодрТам = База.XMLСтрока(Док.Подразделение);//Док.Подразделение.УникальныйИдентификатор();
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			ПодрНаименование = Док.Подразделение.Наименование;
			Попытка
				УИРодитель1 = База.XMLСтрока(Док.Подразделение.Родитель);//Док.Подразделение.Родитель.УникальныйИдентификатор();
				Родитель1Наименование = Док.Подразделение.Родитель.Наименование;
			Исключение
				УИРодитель1 = "";
			КонецПопытки;
			Попытка
				УИРодитель2 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.УникальныйИдентификатор();
				Родитель2Наименование = Док.Подразделение.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель2 = "";
			КонецПопытки;
			Попытка
				УИРодитель3 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель3Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель3 = "";
			КонецПопытки;
			
			//Аверсон ЕАЕ 09.06.2025 СВФР-015971
			Попытка
				УИРодитель4 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель4Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель4 = "";
			КонецПопытки;
			Попытка
				УИРодитель5 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель5Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель5 = "";
			КонецПопытки;
			
			Родитель5 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель5 <> "" И УИРОдитель5 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель5Тут = Новый УникальныйИдентификатор(УИРодитель5);
				Родитель5 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель5Тут);
				Если Не ЗначениеЗаполнено(Родитель5.Наименование) Тогда
					Родитель5Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель5Объект.УстановитьСсылкуНового(Родитель5);
					Родитель5Объект.Наименование = Родитель5Наименование;
					Родитель5Объект.Владелец = ДокПриемОбъект.Организация;
					Попытка
						Родитель5Объект.Записать();
						Родитель5 = Родитель5Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель4 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель4 <> "" И УИРОдитель4 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель4Тут = Новый УникальныйИдентификатор(УИРодитель4);
				Родитель4 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель4Тут);
				Если Не ЗначениеЗаполнено(Родитель4.Наименование) Тогда
					Родитель4Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель4Объект.УстановитьСсылкуНового(Родитель4);
					Родитель4Объект.Наименование = Родитель4Наименование;
					Родитель4Объект.Владелец = ДокПриемОбъект.Организация;
					Попытка
						Родитель4Объект.Записать();
						Родитель4 = Родитель4Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-015971
			
			Родитель3 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель3 <> "" И УИРОдитель3 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель3Тут = Новый УникальныйИдентификатор(УИРодитель3);
				Родитель3 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель3Тут);
				Если Не ЗначениеЗаполнено(Родитель3.Наименование) Тогда
					Родитель3Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель3Объект.УстановитьСсылкуНового(Родитель3);
					Родитель3Объект.Наименование = Родитель3Наименование;
					Родитель3Объект.Владелец = ДокПриемОбъект.Организация;
					Попытка
						Родитель3Объект.Записать();
						Родитель3 = Родитель3Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель2 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель2 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель2Тут = Новый УникальныйИдентификатор(УИРодитель2);
				Родитель2 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель2Тут);
				Если Не ЗначениеЗаполнено(Родитель2.Наименование) Тогда
					Родитель2Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель2Объект.УстановитьСсылкуНового(Родитель2);
					Родитель2Объект.Наименование = Родитель2Наименование;
					Родитель2Объект.Родитель = Родитель3;
					Родитель2Объект.Владелец = ДокПриемОбъект.Организация;

					Попытка
						Родитель2Объект.Записать();
						Родитель2 = Родитель2Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель1 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель1Тут = Новый УникальныйИдентификатор(УИРодитель1);
				Родитель1 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель1Тут);
				Если Не ЗначениеЗаполнено(Родитель1.Наименование) Тогда
					Родитель1Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель1Объект.УстановитьСсылкуНового(Родитель1);
					Родитель1Объект.Наименование = Родитель1Наименование;
					Родитель1Объект.Родитель = Родитель2;
					Родитель1Объект.Владелец = ДокПриемОбъект.Организация;

					Попытка
						Родитель1Объект.Записать();
						Родитель1 = Родитель1Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Если ЗначениеЗаполнено(Подр.Наименование) Тогда
				НоваяСтр.ПодразделениеОрганизации = Подр;
			Иначе
				ПодрОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
				ПодрОбъект.УстановитьСсылкуНового(Подр);
				ПодрОбъект.Наименование = ПодрНаименование;
				ПодрОбъект.Родитель = Родитель1;
				ПодрОбъект.Владелец = ДокПриемОбъект.Организация;

				Попытка
					ПодрОбъект.Записать();
					НоваяСтр.ПодразделениеОрганизации = ПодрОбъект.Ссылка;
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
				КонецПОпытки;
			КонецЕсли;
			Попытка
				ДокПриемОбъект.ПодразделениеОрганизации = Подр;
			Исключение
			КонецПОпытки;
			
			//ищем/создаем должность
			УИТам = База.XMLСтрока(Док.Должность);//Док.Должность.УникальныйИдентификатор();
			УИ = Новый УникальныйИдентификатор(УИТам);
			Должн = Справочники.ДолжностиОрганизаций.ПолучитьСсылку(УИ);
			Если Не ЗначениеЗаполнено(Должн.Наименование) Тогда
				ДолжнОбъект = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
				ДолжнОбъект.УстановитьСсылкуНового(Должн);
			Иначе
				ДолжнОбъект = Должн.ПолучитьОбъект();
			КонецЕсли;
			ДолжнОбъект.Наименование = СокрЛП(Док.Должность.Наименование);
			ПОпытка
				КатегорияНаименование = Док.Должность.Категория.Наименование;
			Исключение
				КатегорияНаименование = "";
			КонецПОпытки;
			Если ЗначениеЗаполнено(КатегорияНаименование) Тогда
				КатегорияРаботника = Справочники.КатегорииРаботников.НайтиПоНаименованию(КатегорияНаименование, Истина);
				Если КатегорияРаботника.Пустая() Тогда
					КатегорияРаботникаОбъект = Справочники.КатегорииРаботников.СоздатьЭлемент();
					КатегорияРаботникаОбъект.Наименование = КатегорияНаименование;
					Попытка
						КатегорияРаботникаОбъект.Записать();
						Сообщить("Создан элемент справочника Категории работников " + СокрЛП(КатегорияРаботникаОбъект) + ".");
						КатегорияРаботника = КатегорияРаботникаОбъект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПопытки;
				КонецЕсли;
				ДолжнОбъект.Категория = КатегорияРаботника;
			КонецЕсли;
				Попытка
					ДолжнОбъект.КодПоОКПДТР = СформироватьКодПоОКРБ(СокрЛП(Док.ДолжностьЕКСД.КодЕКСД));  //сокрлп
				Исключение
				КонецПопытки;
			Попытка
				ДолжнОбъект.Записать();
				Сообщить("Создан элемент справочника Должности организаций " + СокрЛП(ДолжнОбъект) + ".");
				Должн = ДолжнОбъект.Ссылка;
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
			КонецПопытки;
			НоваяСтр.Должность = Должн;
			
			НоваяСтр.ЗанимаемыхСтавок = Док.КоличествоСтавок;
			НоваяСтр.ДатаПриема = Док.ДатаПриема;
			Если НоваяСтр.МесячнаяТарифнаяСтавка = 0 Тогда
				НоваяСтр.МесячнаяТарифнаяСтавка = 1;	 //
			КонецЕсли;
			Если НоваяСтр.ТарифнаяСтавка = 0 Тогда
				НоваяСтр.ТарифнаяСтавка = 1;
			КонецЕсли;
			Попытка
				ГрафикРаботыНаименование = Док.ГрафикРаботы.Наименование;
				ГрафикРаботы = Справочники.ГрафикиРаботы.НайтиПоНаименованию(ГрафикРаботыНаименование);
				Если ГрафикРаботы.Пустая() Тогда
					ГрафикРаботыОбъект = Справочники.ГрафикиРаботы.СоздатьЭлемент();
					ГрафикРаботыОбъект.Наименование = ГрафикРаботыНаименование;
					Попытка
						ГрафикРаботыОбъект.Записать();
						ГрафикРаботы = ГрафикРаботыОбъект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПопытки;
				КонецЕсли;
				НоваяСтр.ГрафикРаботы = ГрафикРаботы;
			Исключение
			КонецПопытки;
			НоваяСтр.ТипРаботника = Сотр.ТипРаботника;
			НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
			
			НоваяСтрНачисления = ДокПриемОбъект.ОсновныеНачисления.Найти(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам, "ВидРасчета");
			Если НоваяСтрНачисления = Неопределено Тогда
				НоваяСтрНачисления = ДокПриемОбъект.ОсновныеНачисления.Добавить();
			КонецЕсли;
			НоваяСтрНачисления.Сотрудник = Сотр;
			НоваяСтрНачисления.ФизЛицо = Сотр.Физлицо;
			НоваяСтрНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
			Если НоваяСтрНачисления.Показатель1 = 0 Тогда
				НоваяСтрНачисления.Показатель1 = 1;
			КонецЕсли;
			
			Попытка
				Если ДокПриемОбъект.Проведен Тогда
					ДокПриемОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокПриемОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокПриемОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
				КонецПопытки;
			КонецПопытки;		
		ИначеЕсли ВидДок = 3 Тогда //Увольнение
			УИДок = Новый УникальныйИдентификатор(Гуид);
			СОтр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);//Док.Сотрудник.УникальныйИдентификатор();
			ГуидФЛ = База.XMLСтрока(Док.ФизическоеЛицо);//Док.ФизическоеЛицо.УникальныйИдентификатор();
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если ЗначениеЗаполнено(ФЛ.Наименование) Тогда
				ФЛОбъект = ФЛ.ПолучитьОбъект();
			Иначе
				Т = "Не найдено физ.лицо с гуидом " + СокрЛП(ГуидФЛ) + " (предположительно " + СокрЛП(Док.ФизическоеЛицо.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) ИЛИ Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
				Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.Сотрудник.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;

				Продолжить;	
			КонецЕсли;
			
			ДокУвольнение = Документы.УвольнениеИзОрганизаций.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокУвольнение.Номер) Тогда
				ДокУвольнениеОбъект = Документы.УвольнениеИзОрганизаций.СоздатьДокумент();
				ДокУвольнениеОбъект.УстановитьСсылкуНового(ДокУвольнение);
				
			Иначе
				ДокУвольнениеОбъект = ДокУвольнение.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокУвольнениеОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокУвольнениеОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокУвольнениеОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокУвольнениеОбъект.Дата = Док.Дата;
			ДокУвольнениеОбъект.ОбменДанными.Загрузка = Ложь;
			ДокУвольнениеОбъект.НомерД = Док.НомерПриказа;
			ДокУвольнениеОбъект.ДатаПриказа = Док.Дата;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокУвольнениеОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокУвольнениеОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			
			//табличная часть
			Если ДокУвольнениеОбъект.РаботникиОрганизации.Количество() = 0 Тогда
				НоваяСтр = ДокУвольнениеОбъект.РаботникиОрганизации.Добавить();
			Иначе
				НоваяСтр = ДокУвольнениеОбъект.РаботникиОрганизации[0];
			КонецЕсли;
			НоваяСтр.Сотрудник = Сотр;
			НоваяСтр.ФизЛицо = Сотр.Физлицо;
			
			НоваяСтр.ДатаУвольнения = Док.ДатаУвольнения;
			
			НоваяСтр.ТипРаботника = Сотр.ТипРаботника;
			НоваяСтр.ОснованиеУвольнения = Док.ОснованиеУвольнения;
			НоваяСтр.ПрекращатьСтандартныеВычеты = Истина;
			Подр = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НоваяСтр.ДатаУвольнения,Новый Структура("Сотрудник",Сотр) ).ПодразделениеОрганизации;
			ДокУвольнениеОбъект.ПодразделениеОрганизации = Подр;
			Попытка
				Если ДокУвольнениеОбъект.Проведен Тогда
					ДокУвольнениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокУвольнениеОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокУвольнениеОбъект.Записать(РежимЗаписиДокумента.Запись);
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
				КонецПопытки;
			КонецПопытки;
		ИначеЕсли ВидДок = 2 Тогда //Кадровый перевод
			УИДок = Новый УникальныйИдентификатор(Гуид);
			СОтр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);//Док.Сотрудник.УникальныйИдентификатор();
			ГуидФЛ = База.XMLСтрока(Док.ФизическоеЛицо);//Док.ФизическоеЛицо.УникальныйИдентификатор();
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если Не ЗначениеЗаполнено(ГуидСотрудник) ИЛИ Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
				Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.Сотрудник.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
				Продолжить;	
			КонецЕсли;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокПеревод = Документы.КадровоеПеремещениеОрганизаций.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокПеревод.Номер) Тогда
				ДокПереводОбъект = Документы.КадровоеПеремещениеОрганизаций.СоздатьДокумент();
				ДокПереводОбъект.УстановитьСсылкуНового(ДокПеревод);
				
			Иначе
				ДокПереводОбъект = ДокПеревод.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокПереводОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокПереводОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокПереводОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокПереводОбъект.Дата = Док.Дата;
			ДокПереводОбъект.ОбменДанными.Загрузка = Ложь;
			ДокПереводОбъект.НомерД = Док.НомерПриказа;
			ДокПереводОбъект.НомерПриказа = Док.НомерПриказа;
			ДокПереводОбъект.ДатаПриказа = Док.Дата;
			
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокПереводОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокПереводОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			Если ДокПереводОбъект.РаботникиОрганизации.Количество() = 0 Тогда
				НоваяСтр = ДокПереводОбъект.РаботникиОрганизации.Добавить();
			Иначе
				НоваяСтр = ДокПереводОбъект.РаботникиОрганизации[0];
			КонецЕсли;
			НоваяСтр.Сотрудник = Сотр;
			НоваяСтр.ФизЛицо = Сотр.Физлицо;
			НоваяСтр.ТипРаботника =  Сотр.ТипРаботника;
			//ищем/создаем подразделение
			УИПодрТам = База.XMLСтрока(Док.Подразделение);//Док.Подразделение.УникальныйИдентификатор();
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			ПодрНаименование = Док.Подразделение.Наименование;
			Попытка
				УИРодитель1 = База.XMLСтрока(Док.Подразделение.Родитель);//Док.Подразделение.Родитель.УникальныйИдентификатор();
				Родитель1Наименование = Док.Подразделение.Родитель.Наименование;
			Исключение
				УИРодитель1 = "";
			КонецПопытки;
			Попытка
				УИРодитель2 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.УникальныйИдентификатор();
				Родитель2Наименование = Док.Подразделение.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель2 = "";
			КонецПопытки;
			Попытка
				УИРодитель3 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель3Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель3 = "";
			КонецПопытки;
			
			//Аверсон ЕАЕ 09.06.2025 СВФР-015971
			Попытка
				УИРодитель4 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель4Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель4 = "";
			КонецПопытки;
			Попытка
				УИРодитель5 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель5Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель5 = "";
			КонецПопытки;
			
			Родитель5 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель5 <> "" И УИРОдитель5 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель5Тут = Новый УникальныйИдентификатор(УИРодитель5);
				Родитель5 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель5Тут);
				Если Не ЗначениеЗаполнено(Родитель5.Наименование) Тогда
					Родитель5Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель5Объект.УстановитьСсылкуНового(Родитель5);
					Родитель5Объект.Наименование = Родитель5Наименование;
					Родитель5Объект.Владелец = ДокПереводОбъект.Организация;
					Попытка
						Родитель5Объект.Записать();
						Родитель5 = Родитель5Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель4 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель4 <> "" И УИРОдитель4 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель4Тут = Новый УникальныйИдентификатор(УИРодитель4);
				Родитель4 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель4Тут);
				Если Не ЗначениеЗаполнено(Родитель4.Наименование) Тогда
					Родитель4Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель4Объект.УстановитьСсылкуНового(Родитель4);
					Родитель4Объект.Наименование = Родитель4Наименование;
					Родитель4Объект.Владелец = ДокПереводОбъект.Организация;

					Попытка
						Родитель4Объект.Записать();
						Родитель4 = Родитель4Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-015971
			
			Родитель3 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель3 <> "" И УИРОдитель3 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель3Тут = Новый УникальныйИдентификатор(УИРодитель3);
				Родитель3 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель3Тут);
				Если Не ЗначениеЗаполнено(Родитель3.Наименование) Тогда
					Родитель3Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель3Объект.УстановитьСсылкуНового(Родитель3);
					Родитель3Объект.Наименование = Родитель3Наименование;
					Родитель3Объект.Владелец = ДокПереводОбъект.Организация;

					Попытка
						Родитель3Объект.Записать();
						Родитель3 = Родитель3Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель2 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель2 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель2Тут = Новый УникальныйИдентификатор(УИРодитель2);
				Родитель2 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель2Тут);
				Если Не ЗначениеЗаполнено(Родитель2.Наименование) Тогда
					Родитель2Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель2Объект.УстановитьСсылкуНового(Родитель2);
					Родитель2Объект.Наименование = Родитель2Наименование;
					Родитель2Объект.Родитель = Родитель3;
					Родитель2Объект.Владелец = ДокПереводОбъект.Организация;

					Попытка
						Родитель2Объект.Записать();
						Родитель2 = Родитель2Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель1 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель1Тут = Новый УникальныйИдентификатор(УИРодитель1);
				Родитель1 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель1Тут);
				Если Не ЗначениеЗаполнено(Родитель1.Наименование) Тогда
					Родитель1Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель1Объект.УстановитьСсылкуНового(Родитель1);
					Родитель1Объект.Наименование = Родитель1Наименование;
					Родитель1Объект.Родитель = Родитель2;
					Родитель1Объект.Владелец = ДокПереводОбъект.Организация;
					Попытка
						Родитель1Объект.Записать();
						Родитель1 = Родитель1Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Если ЗначениеЗаполнено(Подр.Наименование) Тогда
				НоваяСтр.ПодразделениеОрганизации = Подр;
			Иначе
				ПодрОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
				ПодрОбъект.УстановитьСсылкуНового(Подр);
				ПодрОбъект.Наименование = ПодрНаименование;
				ПодрОбъект.Родитель = Родитель1;
				ПодрОбъект.Владелец = ДокПереводОбъект.Организация;
				Попытка
					ПодрОбъект.Записать();
					НоваяСтр.ПодразделениеОрганизации = ПодрОбъект.Ссылка;
				Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

				КонецПОпытки;
			КонецЕсли;
			Попытка
				ДокПереводОбъект.ПодразделениеОрганизации = Подр;
			Исключение
			КонецПОпытки; 
			//ищем/создаем должность
			УИТам = База.XMLСтрока(Док.Должность);//Док.Должность.УникальныйИдентификатор();
			УИ = Новый УникальныйИдентификатор(УИТам);
			Должн = Справочники.ДолжностиОрганизаций.ПолучитьСсылку(УИ);
			Если Не ЗначениеЗаполнено(Должн.Наименование) Тогда
				ДолжнОбъект = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
				ДолжнОбъект.УстановитьСсылкуНового(Должн);
			Иначе
				ДолжнОбъект = Должн.ПолучитьОбъект();
			КонецЕсли;
			ДолжнОбъект.Наименование = СокрЛП(Док.Должность.Наименование);
			ПОпытка
				КатегорияНаименование = Док.Должность.Категория.Наименование;
			Исключение
				КатегорияНаименование = "";
			КонецПОпытки;
			Если ЗначениеЗаполнено(КатегорияНаименование) Тогда
				КатегорияРаботника = Справочники.КатегорииРаботников.НайтиПоНаименованию(КатегорияНаименование, Истина);
				Если КатегорияРаботника.Пустая() Тогда
					КатегорияРаботникаОбъект = Справочники.КатегорииРаботников.СоздатьЭлемент();
					КатегорияРаботникаОбъект.Наименование = КатегорияНаименование;
					Попытка
						КатегорияРаботникаОбъект.Записать();
						Сообщить("Создан элемент справочника Категории работников " + СокрЛП(КатегорияРаботникаОбъект) + ".");
						КатегорияРаботника = КатегорияРаботникаОбъект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПопытки;
				КонецЕсли;
				ДолжнОбъект.Категория = КатегорияРаботника;
			КонецЕсли;
				Попытка
					ДолжнОбъект.КодПоОКПДТР = СформироватьКодПоОКРБ(СокрЛП(Док.ДолжностьЕКСД.КодЕКСД));  //сокрлп
				Исключение
				КонецПопытки;
			Попытка
				ДолжнОбъект.Записать();
				Сообщить("Создан элемент справочника Должности организаций " + СокрЛП(ДолжнОбъект) + ".");
				Должн = ДолжнОбъект.Ссылка;
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;

			КонецПопытки;
			НоваяСтр.Должность = Должн;
			НоваяСтр.Категория = Должн.Категория;
			
			НоваяСтр.ЗанимаемыхСтавок = Док.КоличествоСтавок;
			НоваяСтр.ДатаНачала = Док.ДатаНачала;
			НоваяСтр.ДатаОкончания = Док.ДатаОкончания;
			НоваяСтр.ОснованиеПеремещения = Док.ОснованиеПеревода;
			Если НоваяСтр.МесячнаяТарифнаяСтавка = 0 Тогда
				НоваяСтр.МесячнаяТарифнаяСтавка = 1;
			КонецЕсли;
			Если НоваяСтр.ТарифнаяСтавка = 0 Тогда
				НоваяСтр.ТарифнаяСтавка = 1;
			КонецЕсли;
			Попытка
				ГрафикРаботы = Справочники.ГрафикиРаботы.НайтиПоНаименованию(Док.ГрафикРаботы.Наименование);
				Если ГрафикРаботы.Пустая() Тогда
					ГрафикРаботыОбъект = Справочники.ГрафикиРаботы.СоздатьЭлемент();
					ГрафикРаботыОбъект.Наименование = Док.ГрафикРаботы.Наименование;
					Попытка
						ГрафикРаботыОбъект.Записать();
						ГрафикРаботы = ГрафикРаботыОбъект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

					КонецПопытки;
				КонецЕсли;
				НоваяСтр.ГрафикРаботы = ГрафикРаботы;
			Исключение
			КонецПопытки;
			НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
			НоваяСтр.ТипРаботника = Сотр.ТипРаботника;
			НоваяСтрНачисления = ДокПереводОбъект.ОсновныеНачисления.Найти(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам, "ВидРасчета");
			Если НоваяСтрНачисления = Неопределено Тогда
				НоваяСтрНачисления = ДокПереводОбъект.ОсновныеНачисления.Добавить();
			КонецЕсли;
			НоваяСтрНачисления.Сотрудник = Сотр;
			НоваяСтрНачисления.ФизЛицо = Сотр.Физлицо;
			НоваяСтрНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
			Если НоваяСтрНачисления.Показатель1 = 0 Тогда
				НоваяСтрНачисления.Показатель1 = 1;
			КонецЕсли;
			НоваяСтрНачисления.Действие = Перечисления.ВидыДействияСНачислением.Изменить;
			Попытка
				Если ДокПереводОбъект.Проведен Тогда
					ДокПереводОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокПереводОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокПереводОбъект.Записать(РежимЗаписиДокумента.Запись);
					
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;

				КонецПопытки;
			КонецПопытки;
			
		ИначеЕсли ВидДок = 4 Тогда //Больничный лист
			
			
			УИДок = Новый УникальныйИдентификатор(Гуид);
			СОтр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);//Док.Сотрудник.УникальныйИдентификатор();
			ГуидФЛ = База.XMLСтрока(Док.ФизическоеЛицо);//Док.ФизическоеЛицо.УникальныйИдентификатор();
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Попытка
				Если Не ЗначениеЗаполнено(ФЛ.Наименование) Тогда
					Т = "Не найдено физ.лицо с гуидом " + СокрЛП(ГуидФЛ) + " (предположительно " + СокрЛП(Док.ФизическоеЛицо.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПОпытки;
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) ИЛИ Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Попытка
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.Сотрудник.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПОпытки;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокБЛ = Документы.НачислениеПоБольничномуЛисту.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокБЛ.Номер) Тогда
				ДокБЛОбъект = Документы.НачислениеПоБольничномуЛисту.СоздатьДокумент();
				ДокБЛОбъект.УстановитьСсылкуНового(ДокБЛ);
				
			Иначе
				ДокБЛОбъект = ДокБЛ.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокБЛОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокБЛОбъект) + " уже рассчитан пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930			
			КонецЕсли;
			//ДокБЛОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокБЛОбъект.Дата = Док.Дата;
			ДокБЛОбъект.ОбменДанными.Загрузка = Ложь;
			ДокБЛОбъект.ПериодРегистрации = Док.ПериодРегистрации;
			ДокБЛОбъект.СпособРасчетаВДнях = Истина;
			ДокБЛОбъект.НеИндексировать = Истина;
			ДокБЛОбъект.РучнойРасчетСреднегоЗаработка = Истина;
			ДокБЛОбъект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ;//огран. пустое в документе
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокБЛОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокБЛОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			ДокБЛОбъект.Сотрудник = Сотр;
			ДокБЛОбъект.Физлицо = ФЛ;
			Если База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ОбщееЗаболевание"
				ИЛИ База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ПрофЗаболевание" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ТравмаВБыту" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаВБыту;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ПоБеременностиИРодам" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ТравмаНаПроизводстве" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ПоУходуЗаРебенком" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ПоУходуЗаВзрослым" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "Карантин" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.Карантин;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "Протезирование" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.Протезирование;
			ИначеЕсли База.XMLСтрока(Док.ПричинаНетрудоспособности) = "ПособиеПриДолечивании" Тогда
				ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании;
			КонецЕсли;	
			
			//ДокБЛОбъект.ПроцентОплаты = Док.ПроцентОплаты;
			Если ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве 
				ИЛИ ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам 
				ИЛИ  ДокБЛОбъект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
				
				ДокБЛОбъект.ПроцентОплаты = 100;
				//Островская Татьяна 22.11.2012 № 16009
			//ИначеЕсли РезЛьгота.Количество()>0 Тогда 
				//ДокБЛОбъект.ПроцентОплаты = 100;
				//Островская Татьяна 22.11.2012 № 16009	
			Иначе
				
				ДокБЛОбъект.ПроцентОплаты = 80;
				
			КонецЕсли;
			
			//Первичный бл
			Попытка
				УИТам = База.XMLСтрока(Док.ПервичныйБольничныйЛист);
				УИ = Новый УникальныйИдентификатор(УИТам);
				ПервБЛ = Документы.НачислениеПоБольничномуЛисту.ПолучитьСсылку(УИ);
				Если ЗначениеЗаполнено(ПервБЛ.Номер) Тогда
					ДокБЛОбъект.ПервичныйБольничныйЛист = ПервБЛ;	
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ДокБЛОбъект.ДатаНачала = Док.ДатаНачала;
			ДокБЛОбъект.ДатаОкончания = Док.ДатаОкончания;
			ДокБЛОбъект.ДнейОплаты = (Док.ДатаОкончания -  Док.ДатаНачала)/ 86400 + 1;
			ДокБЛОбъект.НомерВходящегоДокумента = Док.НомерЛисткаНетрудоспособности;
			
			//Первичный бл
			Попытка
				УИТам = База.XMLСтрока(Док.ИсправленныйДокумент);
				УИ = Новый УникальныйИдентификатор(УИТам);
				ИспрБЛ = Документы.НачислениеПоБольничномуЛисту.ПолучитьСсылку(УИ);
				Если ЗначениеЗаполнено(ИспрБЛ.Номер) Тогда
					ДокБЛОбъект.ПерерассчитываемыйДокумент = ИспрБЛ;	
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			УИПодрТам = База.XMLСтрока(Док.Подразделение);
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					ДокБЛОбъект.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПОпытки;
			ДокБЛОбъект.ВидРасчета = ПолучитьВидРасчетаОтПричиныНетрудоспособности(ДокБЛОбъект.ПричинаНетрудоспособности);//ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ;
			Попытка
				Если ДокБЛОбъект.Проведен Тогда
					ДокБЛОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокБЛОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				//Попытка
				//	ДокБЛОбъект.Записать(РежимЗаписиДокумента.Запись);
				//	
				////Удалим запись РС
				//Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				//Набор.Отбор.Регистратор.Установить(Док);
				//Набор.Записать();
				//Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;

				//КонецПопытки;
			КонецПопытки;
		ИначеЕсли ВидДок = 5 Тогда //Отпуск
			УИДок = Новый УникальныйИдентификатор(Гуид);
			Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			Если Док.Сотрудники.Количество() > 0 Тогда
				Для Каждого Стр Из Док.Сотрудники Цикл
					СотрТам = Стр.Сотрудник;
					ГуидСотрудник = База.XMLСтрока(СотрТам);
				КонецЦикла;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Попытка
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(СотрТам.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокО = Документы.НачислениеОтпускаРаботникамОрганизаций.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокО.Номер) Тогда
				ДокООбъект = Документы.НачислениеОтпускаРаботникамОрганизаций.СоздатьДокумент();
				ДокООбъект.УстановитьСсылкуНового(ДокО);
				
			Иначе
				ДокООбъект = ДокО.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокООбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокООбъект) + " уже рассчитан пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930		
			КонецЕсли;
			//ДокООбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокООбъект.Дата = Док.Дата;
			ДокООбъект.ОбменДанными.Загрузка = Ложь;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокООбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокООбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			ДокООбъект.ПериодРегистрации = НачалоМесяца(Док.Дата);
			ДокООбъект.Сотрудник = Сотр;
			ДокООбъект.Физлицо = Сотр.Физлицо;
			УИПодрТам = База.XMLСтрока(Док.Подразделение);
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					ДокООбъект.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПопытки;
			ДокООбъект.ПорядокРасчетаОсновногоОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням;
			ДокООбъект.ПорядокРасчетаКомпенсацииОтпуска = Перечисления.ПорядокРасчетаОтпуска.ПоКалендарнымДням;
			//ДокООбъект.Начисления.Очистить();
			
			//доп.отпуска
			ДокООбъект.ВидРасчетаДополнительногоОтпуска = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
			ДокООбъект.ВидРасчетаДополнительногоОтпуска1 = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
			ДокООбъект.ВидРасчетаДополнительногоОтпуска2 = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
			
			ДокООбъект.ДатаНачалаДополнительногоОтпуска = '00010101';
			ДокООбъект.ДатаНачалаДополнительногоОтпуска1 = '00010101';
			ДокООбъект.ДатаНачалаДополнительногоОтпуска2 = '00010101';
			ДокООбъект.ДатаОкончанияДополнительногоОтпуска = '00010101';
			ДокООбъект.ДатаОкончанияДополнительногоОтпуска1 = '00010101';
			ДокООбъект.ДатаОкончанияДополнительногоОтпуска2 = '00010101';
			
			ДокООбъект.КоличествоДнейДополнительногоОтпуска = 0;
			ДокООбъект.КоличествоДнейДополнительногоОтпуска1 = 0;
			ДокООбъект.КоличествоДнейДополнительногоОтпуска2 = 0;
			н = 0;
			Для Каждого Стр Из Док.Сотрудники Цикл
				ВидОтпуска = СокрЛП(Стр.ВидОтпуска.Наименование);
				ВидОтпускаУНас = Справочники.ВидыЕжегодныхОтпусков.НайтиПоНаименованию(ВидОтпуска, Истина);
				Если Не ВидОтпускаУНас.Пустая() Тогда
					ВидРасчета = ВидОтпускаУНас.ВидРасчета;
				Иначе
					ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
				КонецЕсли;
				Если СокрЛП(ВидОтпуска) = "Основной" Тогда
					
					ДокООбъект.ВидРасчетаОсновногоОтпуска = ВидРасчета;//ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни;
					ДокООбъект.ДатаНачалаОсновногоОтпуска = Стр.ДатаНачала;
					ДокООбъект.ДатаОкончанияОсновногоОтпуска = Стр.ДатаОкончания;
					ДокООбъект.КоличествоДнейОсновногоОтпуска = Стр.КоличествоДней;
				Иначе
					н = н + 1;
					//ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию(ВидОтпуска, Истина);
					//Если ВидРасчета.Пустая() Тогда
					//	ВидРасчетаОбъект = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СоздатьВидРасчета();
					//	ВидРасчетаОбъект.Наименование = ВидОтпуска;
					//	Попытка
					//		ВидРасчетаОбъект.Записать();
					//		ВидРасчета = ВидРасчетаОбъект.Ссылка;
					//	Исключение
					//		Сообщить(СокрЛП(ОписаниеОшибки()));
					//	КонецПОпытки;
					//КонецЕсли;
					Если н = 1 Тогда
						ДокООбъект.ВидРасчетаДополнительногоОтпуска = ВидРасчета;
						ДокООбъект.ДатаНачалаДополнительногоОтпуска = Стр.ДатаНачала;
						ДокООбъект.ДатаОкончанияДополнительногоОтпуска = Стр.ДатаОкончания;
						ДокООбъект.КоличествоДнейДополнительногоОтпуска = Стр.КоличествоДней;
					ИначеЕсли н = 2 Тогда
						ДокООбъект.ВидРасчетаДополнительногоОтпуска1 = ВидРасчета;
						ДокООбъект.ДатаНачалаДополнительногоОтпуска1 = Стр.ДатаНачала;
						ДокООбъект.ДатаОкончанияДополнительногоОтпуска1 = Стр.ДатаОкончания;
						ДокООбъект.КоличествоДнейДополнительногоОтпуска1 = Стр.КоличествоДней;
					ИначеЕсли н = 3 Тогда
						ДокООбъект.ВидРасчетаДополнительногоОтпуска2 = ВидРасчета;
						ДокООбъект.ДатаНачалаДополнительногоОтпуска2 = Стр.ДатаНачала;
						ДокООбъект.ДатаОкончанияДополнительногоОтпуска2 = Стр.ДатаОкончания;
						ДокООбъект.КоличествоДнейДополнительногоОтпуска2 = Стр.КоличествоДней;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Попытка
				Если ДокООбъект.Проведен Тогда
					ДокООбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокООбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				//Попытка
				//	ДокООбъект.Записать(РежимЗаписиДокумента.Запись);
				//	
				////Удалим запись РС
				//Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				//Набор.Отбор.Регистратор.Установить(Док);
				//Набор.Записать();
				//Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;

				//КонецПопытки;
			КонецПопытки;
			
		ИначеЕсли ВидДок = 6 Тогда //Отпуск по уходу за ребенком
			УИДок = Новый УникальныйИдентификатор(Гуид);
			Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.ОсновнойСотрудник);//Док.Сотрудник.УникальныйИдентификатор();
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Попытка
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.ОсновнойСотрудник.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокОРеб = Документы.ОтпускПоУходуЗаРебенком.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокОРеб.Номер) Тогда
				ДокОРебОбъект = Документы.ОтпускПоУходуЗаРебенком.СоздатьДокумент();
				ДокОРебОбъект.УстановитьСсылкуНового(ДокОРеб);
				
			Иначе
				ДокОРебОбъект = ДокОРеб.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокОРебОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокОРебОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокОРебОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокОРебОбъект.Дата = Док.Дата;
			ДокОРебОбъект.ОбменДанными.Загрузка = Ложь;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокОРебОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокОРебОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			ДокОРебОбъект.Сотрудник = Сотр;
			ДокОРебОбъект.Физлицо = Сотр.Физлицо;
			ДокОРебОбъект.ДатаНачала = Док.ДатаНачала;
			ДокОРебОбъект.ДатаОкончания = Док.ДатаОкончания;
			УИПодрТам = База.XMLСтрока(Док.Подразделение);
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					ДокОРебОбъект.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			//Аверсон ЕАЕ 20.02.2024 СВФР-012324
			ДокОРебОбъект.ВидОперации = Перечисления.ВидыОперацийОтпускаПоУходу.ОтпускПоУходуЗаРебенком;
			ДокОРебОбъект.ЗаполнитьПлановыеНачисленияУдержания();
			//Аверсон СВФР-012324
			
			Попытка
				Если ДокОРебОбъект.Проведен Тогда
					ДокОРебОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокОРебОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокОРебОбъект.Записать(РежимЗаписиДокумента.Запись);
					
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;

				КонецПопытки;
			КонецПопытки;
		ИначеЕсли ВидДок = 7 Тогда //Отпуск без сохранения
			УИДок = Новый УникальныйИдентификатор(Гуид);
			Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);//Док.Сотрудник.УникальныйИдентификатор();
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Попытка
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.Сотрудник.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПОпытки;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокНевыход = Документы.НевыходыВОрганизациях.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокНевыход.Номер) Тогда
				ДокНевыходОбъект = Документы.НевыходыВОрганизациях.СоздатьДокумент();
				ДокНевыходОбъект.УстановитьСсылкуНового(ДокНевыход);
				
			Иначе
				ДокНевыходОбъект = ДокНевыход.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокНевыходОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокНевыходОбъект) + " уже рассчитан пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокНевыходОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокНевыходОбъект.Дата = Док.Дата;
			ДокНевыходОбъект.ОбменДанными.Загрузка = Ложь;
			ДокНевыходОбъект.НомерПриказа = Док.НомерПриказа;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокНевыходОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокНевыходОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			ДокНевыходОбъект.ПериодРегистрации = Док.ПериодРегистрации;
			Если Док.ОтсутствиеВТечениеЧастиСмены = Истина Тогда
				ДокНевыходОбъект.СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены;
			Иначе
				ДокНевыходОбъект.СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены;
			КонецЕсли;
			УИПодрТам = База.XMLСтрока(Док.Подразделение);
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					ДокНевыходОбъект.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПопытки;
			ДокНевыходОбъект.Начисления.Очистить();
			НоваяСтр = ДокНевыходОбъект.Начисления.Добавить();
			НоваяСтр.СОтрудник = Сотр;
			НоваяСтр.Физлицо = Сотр.Физлицо;
			НоваяСтр.ДатаНачала = Док.ДатаНачала;
			НоваяСтр.ДатаОкончания = Док.ДатаОкончания;
			Если СокрЛП(Док.ВидОтпуска.Наименование) = "Отпуск за свой счет без оплаты согласно ТК РБ" 
				ИЛИ СокрЛП(Док.ВидОтпуска.Наименование) = "Отпуск за свой счет" 
				ИЛИ СокрЛП(Док.ВидОтпуска.Наименование) = "Увольнительная записка" Тогда
				НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет;
			ИначеЕсли СокрЛП(Док.ВидОтпуска.Наименование) = "Дополнительный учебный отпуск без оплаты" Тогда
				НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный;
			ИначеЕсли СокрЛП(Док.ВидОтпуска.Наименование) = "Отпуск по уходу за ребенком" Тогда
				НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка;
			ИначеЕсли СокрЛП(Док.ВидОтпуска.Наименование) = "Учебный отпуск без оплаты" Тогда
				НоваяСтр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ;
			Иначе
				НоваяСтр.ВидРасчета = ПланыВидовРАсчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет;
			КонецЕсли;
			НоваяСтр.Основание = Док.Основание;
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					НоваяСтр.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПопытки;
			НоваяСтр.ДатаНачалаСобытия = Док.ДатаНачала;
			НоваяСтр.Авторасчет = Истина;
			Попытка
				Если ДокНевыходОбъект.Проведен Тогда
					ДокНевыходОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				//ДокНевыходОбъект.Рассчитать();
				ДокНевыходОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				//Попытка
				//	ДокНевыходОбъект.Записать(РежимЗаписиДокумента.Запись);
				//	
				////Удалим запись РС
				//Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				//Набор.Отбор.Регистратор.Установить(Док);
				//Набор.Записать();
				//Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;

				//КонецПопытки;
			КонецПопытки;
		ИначеЕсли ВидДок = 8 Тогда //Командировка
			УИДок = Новый УникальныйИдентификатор(Гуид);
			Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
			
			//Получаем/создаем сотрудника (физ.лицо)
			ГуидСотрудник = База.XMLСтрока(Док.Сотрудник);
			
			Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
			Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
			Попытка
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.Сотрудник.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокКом = Документы.КомандировкиОрганизаций.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокКом.Номер) Тогда
				ДокКомОбъект = Документы.КомандировкиОрганизаций.СоздатьДокумент();
				ДокКомОбъект.УстановитьСсылкуНового(ДокКом);
				
			Иначе
				ДокКомОбъект = ДокКом.ПолучитьОбъект();
				
				//Аверсон ЕАЕ 05.12.2023 СВФР-011930
				Если ДокКомОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокКомОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
				//Аверсон СВФР-011930
			КонецЕсли;
			//ДокКомОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокКомОбъект.Дата = Док.Дата;
			ДокКомОбъект.ОбменДанными.Загрузка = Ложь;
			ДокКомОбъект.НомерПриказа = Док.НомерПриказа;
			ДокКомОбъект.ДатаПриказа = Док.Дата;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокКомОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокКомОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			//ДокКомОбъект.ПериодРегистрации = Док.ПериодРегистрации;
			ДокКомОбъект.ОснованиеКомандировки = Док.Основание;
			УИПодрТам = База.XMLСтрока(Док.Подразделение);
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Попытка
				Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					ДокКомОбъект.ПодразделениеОрганизации = Подр;
				КонецЕсли;
			Исключение
			КонецПопытки;
			ДокКомОбъект.СтранаНазначения = Док.МестоНазначения;
			
			ДокКомОбъект.РаботникиОрганизации.Очистить();
			НоваяСтр = ДокКомОбъект.РаботникиОрганизации.Добавить();
			НоваяСтр.Сотрудник = Сотр;
			НоваяСтр.ФизЛицо = СОтр.Физлицо;
			НоваяСтр.ДатаНачала = Док.ДатаНачала;
			НоваяСтр.ДатаОкончания = Док.ДатаОкончания;
			НоваяСтр.Цель = Док.Цель;
			НоваяСтр.НомерПриказа = Док.НомерПриказа;
			НоваяСтр.ДатаПриказа = Док.Дата;
			
			Попытка
				Если ДокКомОбъект.Проведен Тогда
					ДокКомОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокКомОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокКомОбъект.Записать(РежимЗаписиДокумента.Запись);
					
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
				Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

				КонецПопытки;
			КонецПопытки;
			
		ИначеЕсли ВидДок = 9 Тогда //Изменения периодических реквизитов
			УИДок = Новый УникальныйИдентификатор(Гуид);
			
			УИДок = Новый УникальныйИдентификатор(УИДок);
			ДокИзм = Документы.ИзменениеПериодическихРеквизитов.ПолучитьСсылку(УИДок);
			Если Не ЗначениеЗаполнено(ДокИзм.Номер) Тогда
				ДокИзмОбъект = Документы.ИзменениеПериодическихРеквизитов.СоздатьДокумент();
				ДокИзмОбъект.УстановитьСсылкуНового(ДокИзм);
				
			Иначе
				ДокИзмОбъект = ДокИзм.ПолучитьОбъект();
				
				Если ДокИзмОбъект.ПереносИзБазы = Истина Тогда
					Т = "Документ " + СокрЛП(ДокИзмОбъект) + " уже проверен и проведен пользователем. Изменения не перенесены.";
					ТекстОшибки = ТекстОшибки + "
					|" + Т;
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ДокИзмОбъект.Дата = Док.Дата;
			ДокИзмОбъект.ОбменДанными.Загрузка = Ложь;
			ДокИзмОбъект.НомерД = Док.НомерПриказа;
			ДокИзмОбъект.ДатаПриказа = Док.Дата;
			Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
				ДокИзмОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
			Иначе
				ДокИзмОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
			КонецЕсли;
			
			//Аверсон ЕАЕ 11.06.2025 СВФР-015971
			///////////////////////////////////////////////////////////
			//ТАК НАДО/////////////////////////////////////////////////
			//ищем/создаем подразделение
			УИПодрТам = База.XMLСтрока(Док.Подразделение);//Док.Подразделение.УникальныйИдентификатор();
			УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			ПодрНаименование = Док.Подразделение.Наименование;
			Попытка
				УИРодитель1 = База.XMLСтрока(Док.Подразделение.Родитель);//Док.Подразделение.Родитель.УникальныйИдентификатор();
				Родитель1Наименование = Док.Подразделение.Родитель.Наименование;
			Исключение
				УИРодитель1 = "";
			КонецПопытки;
			Попытка
				УИРодитель2 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.УникальныйИдентификатор();
				Родитель2Наименование = Док.Подразделение.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель2 = "";
			КонецПопытки;
			Попытка
				УИРодитель3 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель3Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель3 = "";
			КонецПопытки;
			
			Попытка
				УИРодитель4 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель4Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель4 = "";
			КонецПопытки;
			Попытка
				УИРодитель5 = База.XMLСтрока(Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель);//Док.Подразделение.Родитель.Родитель.Родитель.УникальныйИдентификатор();
				Родитель5Наименование = Док.Подразделение.Родитель.Родитель.Родитель.Родитель.Родитель.Наименование;
			Исключение
				УИРодитель5 = "";
			КонецПопытки;
			
			Родитель5 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель5 <> "" И УИРОдитель5 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель5Тут = Новый УникальныйИдентификатор(УИРодитель5);
				Родитель5 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель5Тут);
				Если Не ЗначениеЗаполнено(Родитель5.Наименование) Тогда
					Родитель5Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель5Объект.УстановитьСсылкуНового(Родитель5);
					Родитель5Объект.Наименование = Родитель5Наименование;
					Родитель5Объект.Владелец = ДокИзмОбъект.Организация;
					Попытка
						Родитель5Объект.Записать();
						Родитель5 = Родитель5Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель4 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель4 <> "" И УИРОдитель4 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель4Тут = Новый УникальныйИдентификатор(УИРодитель4);
				Родитель4 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель4Тут);
				Если Не ЗначениеЗаполнено(Родитель4.Наименование) Тогда
					Родитель4Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель4Объект.УстановитьСсылкуНового(Родитель4);
					Родитель4Объект.Наименование = Родитель4Наименование;
					Родитель4Объект.Владелец = ДокИзмОбъект.Организация;
					Попытка
						Родитель4Объект.Записать();
						Родитель4 = Родитель4Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель3 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель3 <> "" И УИРОдитель3 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель3Тут = Новый УникальныйИдентификатор(УИРодитель3);
				Родитель3 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель3Тут);
				Если Не ЗначениеЗаполнено(Родитель3.Наименование) Тогда
					Родитель3Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель3Объект.УстановитьСсылкуНового(Родитель3);
					Родитель3Объект.Наименование = Родитель3Наименование;
					Родитель3Объект.Владелец = ДокИзмОбъект.Организация;
					Попытка
						Родитель3Объект.Записать();
						Родитель3 = Родитель3Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель2 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель2 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель2Тут = Новый УникальныйИдентификатор(УИРодитель2);
				Родитель2 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель2Тут);
				Если Не ЗначениеЗаполнено(Родитель2.Наименование) Тогда
					Родитель2Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель2Объект.УстановитьСсылкуНового(Родитель2);
					Родитель2Объект.Наименование = Родитель2Наименование;
					Родитель2Объект.Родитель = Родитель3;
					Родитель2Объект.Владелец = ДокИзмОбъект.Организация;
					Попытка
						Родитель2Объект.Записать();
						Родитель2 = Родитель2Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Родитель1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			Если УИРодитель1 <> "" И УИРодитель2 <> "00000000-0000-0000-0000-000000000000" Тогда
				УИРодитель1Тут = Новый УникальныйИдентификатор(УИРодитель1);
				Родитель1 = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИРодитель1Тут);
				Если Не ЗначениеЗаполнено(Родитель1.Наименование) Тогда
					Родитель1Объект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
					Родитель1Объект.УстановитьСсылкуНового(Родитель1);
					Родитель1Объект.Наименование = Родитель1Наименование;
					Родитель1Объект.Родитель = Родитель2;
					Родитель1Объект.Владелец = ДокИзмОбъект.Организация;
					Попытка
						Родитель1Объект.Записать();
						Родитель1 = Родитель1Объект.Ссылка;
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;
					КонецПОпытки;
				КонецЕсли;
			КонецЕсли;
			
			Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			Если ЗначениеЗаполнено(Подр.Наименование) Тогда
				ДокИзмОбъект.ПодразделениеОрганизации = Подр;
			Иначе
				ПодрОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
				ПодрОбъект.УстановитьСсылкуНового(Подр);
				ПодрОбъект.Наименование = ПодрНаименование;
				ПодрОбъект.Родитель = Родитель1;
				ПодрОбъект.Владелец = ДокИзмОбъект.Организация;
				Попытка
					ПодрОбъект.Записать();
					НоваяСтр.ПодразделениеОрганизации = ПодрОбъект.Ссылка;
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
				КонецПОпытки;
			КонецЕсли;
			Попытка
				ДокИзмОбъект.ПодразделениеОрганизации = Подр;
			Исключение
			КонецПОпытки;
			///////////////////////////////////////////////////////////
			///////////////////////////////////////////////////////////
			
			///////////////////////////////////////////////////////////
			//ТАК БЫЛО/////////////////////////////////////////////////
			//УИПодрТам = База.XMLСтрока(Док.Подразделение);
			//УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
			//Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
			//Попытка
			//	Если ЗначениеЗаполнено(Подр.Наименование) Тогда
			//		ДокИзмОбъект.ПодразделениеОрганизации = Подр;
			//	КонецЕсли;
			//Исключение
			//КонецПопытки;
			///////////////////////////////////////////////////////////
			///////////////////////////////////////////////////////////
			//Аверсон СВФР-015971
			
			ДокИзмОбъект.РаботникиОрганизации.Очистить();
			Для Каждого Стр Из Док.Сотрудники Цикл
				
				Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
				
				//Получаем/создаем сотрудника (физ.лицо)
				ГуидСотрудник = База.XMLСтрока(Стр.Сотрудник);
				
				Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
					Продолжить;
				КонецЕсли;
				
				УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
				Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
				Попытка
					Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
						Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Стр.Сотрудник.Наименование) + ")";
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
						|"+ Т;
						Продолжить;	
					КонецЕсли;
				Исключение
					Продолжить;
				КонецПопытки;
				
				НоваяСтр = ДокИзмОбъект.РаботникиОрганизации.Добавить();
				НоваяСтр.Сотрудник = Сотр;
				НоваяСтр.ТипРаботника = Сотр.ТипРаботника;
				НоваяСтр.ФизЛицо = Сотр.Физлицо;
				НоваяСтр.ДатаНачала = Стр.ДатаНачала;
				НоваяСтр.ДатаОкончания = Стр.ДатаОкончания;
				НоваяСтр.ГрафикРаботы = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(НоваяСтр.ДатаНачала, Новый Структура("Сотрудник,Организация", НоваяСтр.Сотрудник, ДокИзмОбъект.Организация)).ГрафикРаботы;
				УИПодрТам = База.XMLСтрока(Стр.Подразделение);
				УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
				Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
				Попытка
					Если ЗначениеЗаполнено(Подр.Наименование) Тогда
						НоваяСтр.ПодразделениеОрганизации = Подр;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				//ищем/создаем должность
				ДолжностьТам = Стр.Должность;
				УИТам = База.XMLСтрока(ДолжностьТам);//Док.Должность.УникальныйИдентификатор();
				УИ = Новый УникальныйИдентификатор(УИТам);
				Должн = Справочники.ДолжностиОрганизаций.ПолучитьСсылку(УИ);
				Если Не ЗначениеЗаполнено(Должн.Наименование) Тогда
					ДолжнОбъект = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
					ДолжнОбъект.УстановитьСсылкуНового(Должн);
				Иначе
					ДолжнОбъект = Должн.ПолучитьОбъект();
				КонецЕсли;
				ДолжнОбъект.Наименование = СокрЛП(ДолжностьТам.Наименование);
				Попытка
					КатегорияНаименование = ДолжностьТам.Категория.Наименование;
				Исключение
					КатегорияНаименование = "";
				КонецПопытки;
				Если ЗначениеЗаполнено(КатегорияНаименование) Тогда
					КатегорияРаботника = Справочники.КатегорииРаботников.НайтиПоНаименованию(КатегорияНаименование, Истина);
					Если КатегорияРаботника.Пустая() Тогда
						КатегорияРаботникаОбъект = Справочники.КатегорииРаботников.СоздатьЭлемент();
						КатегорияРаботникаОбъект.Наименование = КатегорияНаименование;
						Попытка
							КатегорияРаботникаОбъект.Записать();
							Сообщить("Создан элемент справочника Категории работников " + СокрЛП(КатегорияРаботникаОбъект) + ".");
							КатегорияРаботника = КатегорияРаботникаОбъект.Ссылка;
						Исключение
							Т = СокрЛП(ОписаниеОшибки());
							
							Сообщить(Т);
							ТекстОшибки = ТекстОшибки  + "
							|"+ Т;
						КонецПопытки;
					КонецЕсли;
					ДолжнОбъект.Категория = КатегорияРаботника;
				КонецЕсли;
				Попытка
					ДолжнОбъект.Записать();
					Сообщить("Создан элемент справочника Должности организаций " + СокрЛП(ДолжнОбъект) + ".");
					Должн = ДолжнОбъект.Ссылка;
				Исключение
					Т = СокрЛП(ОписаниеОшибки());
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					
				КонецПопытки;
				НоваяСтр.Должность = Должн;
				НоваяСтр.Категория = Должн.Категория;
				
				НоваяСтр.ЗанимаемыхСтавок = Стр.КоличествоСтавок;
				
				Если База.XMLСтрока(Стр.СистемаОплаты) = "ОкладПоДням" Тогда
					ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням;
				ИначеЕсли База.XMLСтрока(Стр.СистемаОплаты) = "ОкладПоЧасам" ИЛИ База.XMLСтрока(Стр.СистемаОплаты) = "Повременная" Тогда
					ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам;
				Иначе
					ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой;
				КонецЕсли;
				НоваяСтр.ВидРасчета = ВР;
				НоваяСтр.ТипРаботника = Сотр.ТипРаботника;
			КонецЦикла;
			
			Попытка
				Если ДокИзмОбъект.Проведен Тогда
					ДокИзмОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				ДокИзмОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
			Исключение
				Попытка
					ДокИзмОбъект.Записать(РежимЗаписиДокумента.Запись);
					
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
				Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
		                |"+ Т;

				КонецПопытки;
			КонецПопытки;
		ИначеЕсли ВидДок = 10 Тогда //Возврат из отпуска по уходу за ребенком
				//Гуид = База.XMLСтрока(Док.УникальныйИдентификатор());
				//УИДок = Новый УникальныйИдентификатор(Гуид);
				Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
				
				//Получаем/создаем сотрудника (физ.лицо)
				ГуидСотрудник = База.XMLСтрока(Док.ОсновнойСотрудник);
				
				Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
					Продолжить;
				КонецЕсли;
				
				УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
				Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
				Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
					Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Док.ОсновнойСотрудник.Наименование) + ")";
					
					Сообщить(Т);
					ТекстОшибки = ТекстОшибки  + "
					|"+ Т;
					Продолжить;	
				КонецЕсли;
				
				//УИДок = Новый УникальныйИдентификатор(УИДок);
				//ДокОРеб = Документы.ОтпускПоУходуЗаРебенком.ПолучитьСсылку(УИДок);
				ДатаВозврата = Док.ДатаВозврата;
				
				ДокОтпускТам = Док.ДокументОснование;
				ДокОтпускТамГуид = База.XMLСтрока(ДокОтпускТам);
				УИДокОтпуск = Новый УникальныйИдентификатор(ДокОтпускТамГуид);
				ДокОтпуск = Документы.ОтпускПоУходуЗаРебенком.ПолучитьСсылку(УИДокОтпуск);
				Если ЗначениеЗаполнено(ДокОтпуск.Номер) Тогда
					ДокОтпускОбъект = ДокОтпуск.ПолучитьОбъект();
					ДокОтпускОбъект.ДатаНачалаФакт = ДокОтпускОбъект.ДатаНачала;
					ДокОтпускОбъект.ДатаОкончанияФакт = ДатаВозврата;
					
					Попытка
						Если ДокОтпускОбъект.Проведен Тогда
							ДокОтпускОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						КонецЕсли;
						ДокОтпускОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
						//Удалим запись РС
						Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(Док);
						Набор.Записать();
						Сообщить("В документ " + СокрЛП(ДокОтпускОбъект) + " записаны даты факт.отпуска.");
					Исключение
						Попытка
							ДокОтпускОбъект.Записать(РежимЗаписиДокумента.Запись);
							
							//Удалим запись РС
							Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
							Набор.Отбор.Регистратор.Установить(Док);
							Набор.Записать();
							Сообщить("В документ " + СокрЛП(ДокОтпускОбъект) + " записаны даты факт.отпуска.");
						Исключение
							Т = СокрЛП(ОписаниеОшибки());
							
							Сообщить(Т);
							ТекстОшибки = ТекстОшибки  + "
							|"+ Т;
							
						КонецПопытки;
					КонецПопытки;
				Иначе
					ТЗДокОРеб = ПолучитьДокументыОтпускПоУходуЗаРебенком(Сотр, ДатаВозврата);
					//Если Не ЗначениеЗаполнено(ДокОРеб.Номер) Тогда
					//	ДокОРебОбъект = Документы.ОтпускПоУходуЗаРебенком.СоздатьДокумент();
					//	ДокОРебОбъект.УстановитьСсылкуНового(ДокОРеб);
					//	
					//Иначе
					//	ДокОРебОбъект = ДокОРеб.ПолучитьОбъект();
					//КонецЕсли;
					////ДокОРебОбъект.Ответственный = глЗначениеПеременной("глТекущийПользователь");
					//ДокОРебОбъект.Дата = Док.Дата;
					//Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
					//	ДокОРебОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
					//Иначе
					//	ДокОРебОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
					//КонецЕсли;
					//ДокОРебОбъект.Сотрудник = Сотр;
					//ДокОРебОбъект.Физлицо = Сотр.Физлицо;
					//ДокОРебОбъект.ДатаНачала = Док.ДатаНачала;
					//ДокОРебОбъект.ДатаОкончания = Док.ДатаОкончания;
					//УИПодрТам = База.XMLСтрока(Док.Подразделение);
					//УИПодр = Новый УникальныйИдентификатор(УИПодрТам);
					//Подр = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИПодр);
					//Если ЗначениеЗаполнено(Подр.Наименование) Тогда
					//	ДокОРебОбъект.ПодразделениеОрганизации = Подр;
					//КонецЕсли;
					
					Если ТЗДокОРеб.Количество() = 0 Тогда
						Сообщить("По сотруднику " + СокрЛП(Сотр) + " не найдено ни одного документа Отпуск по уходу за ребенком.");
					КонецЕсли;
					
					Для Каждого ДокОРеб Из ТЗДокОРеб Цикл
						ДокОРебОбъект = ДокОРеб.Ссылка.ПолучитьОбъект();
						ДокОРебОбъект.ДатаНачалаФакт = ДокОРеб.ДатаНачала;
						ДокОРебОбъект.ДатаОкончанияФакт = ДатаВозврата;
						Попытка
							Если ДокОРебОбъект.Проведен Тогда
								ДокОРебОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
							КонецЕсли;
							ДокОРебОбъект.Записать(РежимЗаписиДокумента.Проведение);
							
							//Удалим запись РС
							Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
							Набор.Отбор.Регистратор.Установить(Док);
							Набор.Записать();
							Сообщить("В документ " + СокрЛП(ДокОРебОбъект) + " записаны даты факт.отпуска.");
						Исключение
							Попытка
								ДокОРебОбъект.Записать(РежимЗаписиДокумента.Запись);
								
								//Удалим запись РС
								Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
								Набор.Отбор.Регистратор.Установить(Док);
								Набор.Записать();
								Сообщить("В документ " + СокрЛП(ДокОРебОбъект) + " записаны даты факт.отпуска.");
							Исключение
								Т = СокрЛП(ОписаниеОшибки());
								
								Сообщить(Т);
								ТекстОшибки = ТекстОшибки  + "
								|"+ Т;
								
							КонецПопытки;
						КонецПопытки;
					КонецЦикла;
				КонецЕсли;
		ИначеЕсли ВидДок = 11 Тогда //Работа в выходные и праздничные дни
				УИДок = Новый УникальныйИдентификатор(Гуид);
				ДокВых = Документы.ПриказНаРаботуВПраздничныеИВыходныеДни.ПолучитьСсылку(УИДок);
				Если Не ЗначениеЗаполнено(ДокВых.Номер) Тогда
					ДокВыхОбъект = Документы.ПриказНаРаботуВПраздничныеИВыходныеДни.СоздатьДокумент();
					ДокВыхОбъект.УстановитьСсылкуНового(ДокВых);
					
				Иначе
					ДокВыхОбъект = ДокВых.ПолучитьОбъект();
				КонецЕсли;
				ДокВыхОбъект.Дата = Док.Дата;
				Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
					ДокВыхОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
				Иначе
					ДокВыхОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
				КонецЕсли;
				ДокВыхОбъект.ПериодРегистрации = Док.ПериодРегистрации;
				ДокВыхОбъект.ПроизводственнаяНеобходимость = Док.Причина;
				Подр = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию(Док.Организация.Наименование,Истина,,ДокВыхОбъект.Организация);
				ДокВыхОбъект.ПодразделениеОрганизации = Подр;
				ДокВыхОбъект.РаботникиОрганизации.Очистить();
				Для Каждого Стр Из Док.Сотрудники Цикл
					Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
					ГуидСотрудник = База.XMLСтрока(Стр.Сотрудник);
					
					Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
						Продолжить;
					КонецЕсли;
					
					УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
					Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
					Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
						Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Стр.Сотрудник.Наименование) + ")";
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
						|"+ Т;
						Продолжить;	
					КонецЕсли;
					
					НоваяСтр = ДокВыхОбъект.РаботникиОрганизации.Добавить();
					НоваяСтр.Сотрудник = Сотр;
					НоваяСтр.Физлицо = Сотр.Физлицо;
					СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Док.Дата,Новый Структура("Сотрудник",Сотр));
					НоваяСтр.ПодразделениеОрганизации = СведенияОСотруднике.ПодразделениеОрганизации;
					НоваяСтр.ГрафикРаботы = СведенияОСотруднике.ГрафикРаботы;
					НоваяСтр.ДатаВыхода = Стр.Дата;
					Если ЗначениеЗаполнено(Стр.ДатаОтгула) Тогда
						НоваяСтр.Доплачивать = Ложь;
						НоваяСтр.ДеньОтдыха = Стр.ДатаОтгула;
					Иначе
						НоваяСтр.Доплачивать = Истина;
					КонецЕсли;
					Если Док.ВремяВЧасах = Истина Тогда
						НоваяСтр.ОтработаноЧасов = Стр.ОтработаноЧасов;
					Иначе
						НоваяСтр.ОтработаноЧасов = 8.5;
					КонецЕсли;
					НоваяСтр.ЯвкаВТабель = Истина;
				КонецЦикла;
				Попытка
					Если ДокВыхОбъект.Проведен Тогда
						ДокВыхОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
					ДокВыхОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					Сообщить("Перенесен документ " + СокрЛП(ДокВыхОбъект) + ".");
				Исключение
					Попытка
						ДокВыхОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						//Удалим запись РС
						Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(Док);
						Набор.Записать();
						Сообщить("Перенесен документ " + СокрЛП(ДокВыхОбъект) + ".");
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
						|"+ Т;
						
					КонецПопытки;
				КонецПопытки;
			ИначеЕсли ВидДок = 12 Тогда //Работа сверхурочно
				УИДок = Новый УникальныйИдентификатор(Гуид);
				
				ДокСверх = Документы.ПриказОКомпенсацииСверхурочнойРаботы.ПолучитьСсылку(УИДок);
				Если Не ЗначениеЗаполнено(ДокСверх.Номер) Тогда
					ДокСверхОбъект = Документы.ПриказОКомпенсацииСверхурочнойРаботы.СоздатьДокумент();
					ДокСверхОбъект.УстановитьСсылкуНового(ДокСверх);
					
				Иначе
					ДокСверхОбъект = ДокСверх.ПолучитьОбъект();
				КонецЕсли;
				ДокСверхОбъект.Дата = Док.Дата;
				Если Найти(Док.Организация.Наименование, "Протасовщина") > 0 Тогда
					ДокСверхОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("СПУ ""Протасовщина""", Истина);
				Иначе
					ДокСверхОбъект.Организация = Справочники.Организации.НайтиПоНаименованию("УП ""Гроднооблгаз""", Истина);
				КонецЕсли;
				Подр = Справочники.ПодразделенияОрганизаций.НайтиПоНаименованию(Док.Организация.Наименование,Истина,,ДокСверхОбъект.Организация);
				ДокСверхОбъект.ПодразделениеОрганизации = Подр;
				ДокСверхОбъект.ПериодРегистрации = Док.ПериодРегистрации;
				ДокСверхОбъект.РаботникиОрганизации.Очистить();
				Для Каждого Стр Из Док.Сотрудники Цикл
					Если Стр.ОтработаноЧасов = 0 Тогда
						Продолжить;
					КонецЕсли;
					Сотр = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
					ГуидСотрудник = База.XMLСтрока(Стр.Сотрудник);
					
					Если Не ЗначениеЗаполнено(ГуидСотрудник) Тогда
						Продолжить;
					КонецЕсли;
					
					УИСотр = Новый УникальныйИдентификатор(ГуидСотрудник);
					Сотр = Справочники.СотрудникиОрганизаций.ПолучитьСсылку(УИСотр);
					Если Не ЗначениеЗаполнено(Сотр.Наименование) Тогда
						Т = "Не найден сотрудник с гуидом " + СокрЛП(ГуидСотрудник) + " (предположительно " + СокрЛП(Стр.Сотрудник.Наименование) + ")";
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
						|"+ Т;
						Продолжить;	
					КонецЕсли;
					
					НоваяСтр = ДокСверхОбъект.РаботникиОрганизации.Добавить();
					НоваяСтр.Сотрудник = Сотр;
					НоваяСтр.Физлицо = Сотр.Физлицо;
					СведенияОСотруднике = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Док.Дата,Новый Структура("Сотрудник",Сотр));
					НоваяСтр.ПодразделениеОрганизации = СведенияОСотруднике.ПодразделениеОрганизации;
					НоваяСтр.Должность = СведенияОСотруднике.Должность;
					НоваяСтр.ГрафикРаботы = СведенияОСотруднике.ГрафикРаботы;
					НоваяСтр.Дата = Стр.Дата;
					НоваяСтр.ОтработаноЧасов = Стр.ОтработаноЧасов;
				КонецЦикла;
				Попытка
					Если ДокСверхОбъект.Проведен Тогда
						ДокСверхОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
					ДокВыхОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					//Удалим запись РС
					Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Док);
					Набор.Записать();
					Сообщить("Перенесен документ " + СокрЛП(ДокСверхОбъект) + ".");
				Исключение
					Попытка
						ДокСверхОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						//Удалим запись РС
						Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(Док);
						Набор.Записать();
						Сообщить("Перенесен документ " + СокрЛП(ДокСверхОбъект) + ".");
					Исключение
						Т = СокрЛП(ОписаниеОшибки());
						
						Сообщить(Т);
						ТекстОшибки = ТекстОшибки  + "
						|"+ Т;
						
					КонецПопытки;
				КонецПопытки;
		ИначеЕсли ВидДок = 13 Тогда //Стаж
			ФЛ = РС.ФизЛицо;
			ДатаОтсчета = РС.ДатаОтсчета;
			РазмерМесяцев = РС.РазмерМесяцев;
			РазмерДней = РС.РазмерДней;
			
			ГуидФЛ = База.XMLСтрока(ФЛ);
			
			Если Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФизЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если ФЛ.Наименование = "" Тогда
				Т = "Не найдено физ.лицо с гуидом " + СокрЛП(ГуидФЛ) + " (предположительно " + СокрЛП(ФЛ.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
				Продолжить;	
			КонецЕсли;
			ФизЛицоОбъект = ФизЛицо.ПолучитьОбъект();
			//ФизЛицоОбъект.Стажи.Очистить();
			НоваяСтр = ФизЛицоОбъект.Стажи.Найти(Справочники.ВидыСтажа.ОбщийСтаж, "ВидСтажа");
			Если НоваяСтр = Неопределено Тогда
				НоваяСтр = ФизЛицоОбъект.Стажи.Добавить();
				НоваяСтр.ВидСтажа = Справочники.ВидыСтажа.ОбщийСтаж;
			КонецЕсли;
			НоваяСтр.ДатаОтсчета = ДатаОтсчета;
			НоваяСтр.РазмерМесяцев = РазмерМесяцев;
			НоваяСтр.РазмерДней = РазмерДней;
			Попытка
				ФизЛицоОбъект.Записать();
				
				//Удалим запись РС
				Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Док);
				Набор.Записать();
				
				Сообщить("В карточку физ.лица " + СокрЛП(ФизЛицоОбъект) + " записан стаж.");
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
			КонецПопытки;
			
		ИначеЕсли ВидДок = 14 Тогда //Семья
			ФЛ = РС.ФизЛицо;
			Родственник = РС.Родственник;
			РодственникДатаРождения = РС.ДатаРождения;
			РодственникИмя = Родственник.Наименование;
			РодственникСтепеньРодства = РС.СтепеньРодства;
			РодственникСтепеньРодстваКод = Родственник.СтепеньРодства.Код;
			РодственникДатаКонцаВычета = РС.ДатаКонцаВычета;
			ГуидФЛ = База.XMLСтрока(ФЛ);
			
			Если Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФизЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если ФизЛицо.Наименование = "" Тогда
				Т = "Не найдено физ.лицо с гуидом " + СокрЛП(ГуидФЛ) + " (предположительно " + СокрЛП(ФЛ.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
				Продолжить;	
			КонецЕсли;
			ФизЛицоОбъект = ФизЛицо.ПолучитьОбъект();
			
			НовыйРебенок = ФизЛицоОбъект.СоставСемьи.Найти(РодственникДатаРождения, "ДатаРождения");
			Если НовыйРебенок = Неопределено Тогда
				НовыйРебенок = ФизЛицоОбъект.СоставСемьи.Добавить();
			КонецЕсли;
			СтепеньРодства = Справочники.СтепениРодстваФизЛиц.НайтиПоНаименованию(РодственникСтепеньРодства,Истина);
			Если СтепеньРодства.Пустая() Тогда
				НовСтепеньРодства = Справочники.СтепениРодстваФизЛиц.СоздатьЭлемент();
				НовСтепеньРодства.Наименование = РодственникСтепеньРодства;
				НовСтепеньРодства.Код = РодственникСтепеньРодстваКод;
				НовСтепеньРодства.Записать();
				СтепеньРодства = НовСтепеньРодства.Ссылка;
			КонецЕсли;
			НовыйРебенок.СтепеньРодства = СтепеньРодства;
			НовыйРебенок.Имя = РодственникИмя;
			НовыйРебенок.ГодРождения = РодственникДатаРождения;
			НовыйРебенок.ДатаРождения = РодственникДатаРождения;
			
			Попытка
				ФизЛицоОбъект.Записать();
				
				//Если РодственникСтепеньРодства = "Сын" ИЛИ РодственникСтепеньРодства = "Дочь" Тогда
					
					ДокСтандартныеВычеты = ПолучитьДокСтандартныеВычеты(ФизЛицоОбъект.Ссылка);
					Если ДокСтандартныеВычеты.Пустая() Тогда
						НовыйДок = Документы.НДФЛСтандартныеВычетыФизлиц.СоздатьДокумент();
						НовыйДок.Дата = '20230101';
						НовыйДок.Физлицо = ФизЛицоОбъект.Ссылка;
						НовыйДок.ПрименятьЛичныйВычет = Истина;
					Иначе
						НовыйДок = ДокСтандартныеВычеты.ПолучитьОбъект();
					КонецЕсли;
					
					СтруктураОтбораДети = Новый Структура;
					СтруктураОтбораДети.Вставить("СтепеньРодства", СтепеньРодства);
					СтруктураОтбораДети.Вставить("ДатаРождения",   РодственникДатаРождения);
					
					НужныеСтрокиДети = НовыйДок.СоставСемьи.НайтиСтроки(СтруктураОтбораДети);
					Если НужныеСтрокиДети.Количество() > 0 Тогда
						Для Каждого ЭлДети Из НужныеСтрокиДети Цикл
							Если Не ЗначениеЗаполнено(ЭлДети.ДатаНачалаВычета) Тогда
								ЭлДети.ДатаНачалаВычета = РодственникДатаРождения;	
							КонецЕсли;
							Если Не ЗначениеЗаполнено(ЭлДети.ДатаКонцаВычета) Тогда
								ЭлДети.ДатаКонцаВычета = РодственникДатаКонцаВычета;	
							КонецЕсли;
							Если СокрЛП(РодственникСтепеньРодства) = "Сын" ИЛИ СокрЛП(РодственникСтепеньРодства) = "Дочь" Тогда 
								ЭлДети.КодВычета = Справочники.ВычетыНДФЛ.Код610;
								ЭлДети.ПрименятьВычет = Истина;
							Иначе
								ЭлДети.КодВычета = Справочники.ВычетыНДФЛ.ПустаяСсылка();
								ЭлДети.ПрименятьВычет = Ложь;
							КонецЕсли;
						КонецЦикла;
					Иначе
						НоваяСтр = НовыйДок.СоставСемьи.Добавить();
						НоваяСтр.СтепеньРодства = СтепеньРодства;
						НоваяСтр.Имя = РодственникИмя;
						НоваяСтр.ДатаРождения = РодственникДатаРождения;
						Если СокрЛП(РодственникСтепеньРодства) = "Сын" ИЛИ СокрЛП(РодственникСтепеньРодства) = "Дочь" Тогда
							НоваяСтр.ПрименятьВычет = Истина;
							НоваяСтр.КодВычета = Справочники.ВычетыНДФЛ.Код610;
						Иначе
							НоваяСтр.ПрименятьВычет = Ложь;
							НоваяСтр.КодВычета = Справочники.ВычетыНДФЛ.ПустаяСсылка();
						КонецЕсли;
						НоваяСтр.ДатаНачалаВычета = РодственникДатаРождения;
						НоваяСтр.ДатаКонцаВычета = РодственникДатаКонцаВычета;
					КонецЕсли;
					
					Попытка
						Если НовыйДок.Проведен Тогда
							НовыйДок.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						КонецЕсли;
						НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
						
						//Удалим запись РС
						Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
						Набор.Отбор.Регистратор.Установить(Док);
						Набор.Записать();
						//Сообщить("Создан (перезаписан) документ " + СокрЛП(НовыйДок) + ". Физ.лицо " + СокрЛП(НовыйДок.Физлицо) + ".");
					Исключение
						Попытка
							НовыйДок.Записать(РежимЗаписиДокумента.Запись);
							
							//Удалим запись РС
							Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
							Набор.Отбор.Регистратор.Установить(Док);
							Набор.Записать();
							//Сообщить("Создан (перезаписан) документ " + СокрЛП(НовыйДок) + ". Физ.лицо " + СокрЛП(НовыйДок.Физлицо) + ".");
						Исключение
							Т = СокрЛП(ОписаниеОшибки());
							
							Сообщить(Т);
							ТекстОшибки = ТекстОшибки  + "
							|"+ Т;
							
						КонецПопытки;
					КонецПопытки;
					
				//КонецЕсли;
				
				//Удалим запись РС
				//Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
				//Набор.Отбор.Регистратор.Установить(Док);
				//Набор.Записать();
				
				//Сообщить("В карточку физ.лица " + СокрЛП(ФизЛицоОбъект) + " записан ребенок.");
			Исключение
				Т = СокрЛП(ОписаниеОшибки());
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
			КонецПопытки;
		ИначеЕсли ВидДок = 15 Тогда //Семейное положение
			ФЛ = РС.ФизЛицо;
			СемейноеПоложение = РС.СостояниеВБраке.Наименование;
			Период = РС.Период;
			//РазмерМесяцев = РС.РазмерМесяцев;
			//РазмерДней = РС.РазмерДней;
			
			ГуидФЛ = База.XMLСтрока(ФЛ);
			
			Если Не ЗначениеЗаполнено(ГуидФЛ) Тогда
				Продолжить;
			КонецЕсли;
			
			УИФЛ = Новый УникальныйИдентификатор(ГуидФЛ);
			ФизЛицо = Справочники.ФизическиеЛица.ПолучитьСсылку(УИФЛ);
			Если ФизЛицо.Наименование = "" Тогда
				Т = "Не найдено физ.лицо с гуидом " + СокрЛП(ГуидФЛ) + " (предположительно " + СокрЛП(ФЛ.Наименование) + ")";
				
				Сообщить(Т);
				ТекстОшибки = ТекстОшибки  + "
				|"+ Т;
				Продолжить;	
			КонецЕсли;
			//ФизЛицоОбъект = ФизЛицо.ПолучитьОбъект();
			////ФизЛицоОбъект.Стажи.Очистить();
			//НоваяСтр = ФизЛицоОбъект.Стажи.Найти(Справочники.ВидыСтажа.ОбщийСтаж, "ВидСтажа");
			//Если НоваяСтр = Неопределено Тогда
			//	НоваяСтр = ФизЛицоОбъект.Стажи.Добавить();
			//	НоваяСтр.ВидСтажа = Справочники.ВидыСтажа.ОбщийСтаж;
			//КонецЕсли;
			//НоваяСтр.ДатаОтсчета = ДатаОтсчета;
			//НоваяСтр.РазмерМесяцев = РазмерМесяцев;
			//НоваяСтр.РазмерДней = РазмерДней;
			//Попытка
			//	ФизЛицоОбъект.Записать();
			//	
			//	//Удалим запись РС
			//	Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
			//	Набор.Отбор.Регистратор.Установить(Док);
			//	Набор.Записать();
			//	
			//	Сообщить("В карточку физ.лица " + СокрЛП(ФизЛицоОбъект) + " записан стаж.");
			//Исключение
			//	Т = СокрЛП(ОписаниеОшибки());
			//	
			//	Сообщить(Т);
			//	ТекстОшибки = ТекстОшибки  + "
			//	|"+ Т;
			//КонецПопытки;
			
			НаборЗаписей = РегистрыСведений.СемейноеПоложениеФизЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизЛицо.Установить(ФизЛицо);
			НаборЗаписей.Отбор.Период.Установить(Период);
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.Период = Период;
			НоваяЗапись.ФизЛицо = ФизЛицо;
			СемейноеПоложениеСпр = Справочники.СемейноеПоложениеФизЛиц.НайтиПоНаименованию(СемейноеПоложение,Истина);
			Если СемейноеПоложениеСпр.Пустая() Тогда
				НовСП = Справочники.СемейноеПоложениеФизЛиц.СоздатьЭлемент();
				НовСП.Наименование = СемейноеПоложение;
				НовСП.Записать();
				СемейноеПоложениеСпр = НовСП.Ссылка;
			КонецЕсли;
			НоваяЗапись.СемейноеПоложение = СемейноеПоложениеСпр;

			НаборЗаписей.Записать();
			
			//Удалим запись РС
			Набор = База.РегистрыСведений.СВЭЙ_Перенос.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Док);
			Набор.Записать();
			//Сообщить("Создан (перезаписан) документ " + СокрЛП(НовыйДок) + ". Физ.лицо " + СокрЛП(НовыйДок.Физлицо) + ".");
			
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	База = "";
	//Отправляем ошибки по почте
	Если ТекстОшибки <> "" Тогда
		ОтправитьПоПочте(ТекстОшибки, УчЗапись, Профиль, Логин, АдресПолучателя);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьДокСтандартныеВычеты(Физлицо)
	Док = Документы.НДФЛСтандартныеВычетыФизлиц.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НДФЛСтандартныеВычетыФизлиц.Ссылка,
	|	НДФЛСтандартныеВычетыФизлиц.Физлицо
	|ИЗ
	|	Документ.НДФЛСтандартныеВычетыФизлиц КАК НДФЛСтандартныеВычетыФизлиц
	|ГДЕ
	|	НДФЛСтандартныеВычетыФизлиц.Физлицо = &Физлицо
	|	И НЕ НДФЛСтандартныеВычетыФизлиц.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Физлицо", Физлицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Док = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Док;
КонецФункции

Процедура ВыполнитьАвторасчетРеквизитовСтрокиНачисления(ДанныеСтроки,Организация,ПериодРегистрации,Дата, РассчитатьТариф = Истина)
	
	ДатаАктуальности  = ?(ЗначениеЗаполнено(ДанныеСтроки.ДатаВыхода), ДанныеСтроки.ДатаВыхода, Дата);
	Если РассчитатьТариф Тогда
		
		ЧасовойТариф = ПрочиеПроцедуры.ПолучитьЧасовуюТарифнуюСтавку(Организация, ДанныеСтроки.Сотрудник, ДатаАктуальности, ДанныеСтроки.Сотрудник, Ложь, Ложь,Истина,,,,,,,,,1);
		ДанныеСтроки.Размер = ЧасовойТариф;
		График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ДанныеСтроки.Сотрудник)).ГрафикРаботы; 
		СреднегодоваяНорма = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Организация,ВидПараметра",Организация,Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов)).Размер;
		МесячнаяТСВВалюте = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ДанныеСтроки.Сотрудник)).МесячнаяТарифнаяСтавкаВВалюте;
		Норма = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафику(График,Перечисления.ВидыУчетаВремени.ПоЧасам,ПериодРегистрации,Организация);
		//Если РасчетОтСреднегодовойНормы Тогда 
		//	ДанныеСтроки.ВалютныйЧасовойТариф = ?(ЗначениеЗаполнено(СреднегодоваяНорма),МесячнаяТСВВалюте / СреднегодоваяНорма,0);
		//иначе
		ДанныеСтроки.ВалютныйЧасовойТариф = ?(ЗначениеЗаполнено(Норма),МесячнаяТСВВалюте / Норма,0);  
		//КонецЕсли;
		
	КонецЕсли;
	
	Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные.Количество()>0 Тогда 
		ЗапросПлановые = Новый Запрос;
		ЗапросПлановые.Текст = 
		"ВЫБРАТЬ
		|	НачисленияРаботниковОрганизации.Показатель1
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
		|			&парамНачало,
		|			ДокументОснование = ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|				И Сотрудник = &Сотрудник) КАК НачисленияРаботниковОрганизации
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения
		|			ИНАЧЕ НачисленияРаботниковОрганизации.Действие
		|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|	И ВЫБОР
		|			КОГДА НачисленияРаботниковОрганизации.ПериодЗавершения <= &парамНачало
		|					И НачисленияРаботниковОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ВЫБОР
		|						КОГДА НачисленияРаботниковОрганизации.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
		|							ТОГДА НачисленияРаботниковОрганизации.ВидРасчета
		|						ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчетаЗавершения
		|					КОНЕЦ
		|			ИНАЧЕ НачисленияРаботниковОрганизации.ВидРасчета
		|		КОНЕЦ В (&ВидыРасчетаПовышения)";
		
		ЗапросПлановые.УстановитьПараметр("парамНачало", ?(ЗначениеЗаполнено(ДанныеСтроки.ДатаВыхода),ДанныеСтроки.ДатаВыхода,ПериодРегистрации)); 
		ЗапросПлановые.УстановитьПараметр("Сотрудник", ДанныеСтроки.Сотрудник);
		
		ВидыПовышений = Новый СписокЗначений;
		Для Каждого стр из Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.Основные Цикл 
			ВидыПовышений.Добавить(стр.ВидРасчета);
		КонецЦикла;
		
		ЗапросПлановые.УстановитьПараметр("ВидыРасчетаПовышения", ВидыПовышений);
		
		РезультатЗапроса = ЗапросПлановые.Выполнить().Выбрать();
		СуммаПовышений = 0;
		пока РезультатЗапроса.Следующий() Цикл 
			СуммаПовышений = СуммаПовышений + ДанныеСтроки.Размер * РезультатЗапроса.Показатель1/100;
		КонецЦикла;
		
		Если Справочники.ГруппыРасчетов.ПовышениеДляСверхурочныхИПраздников.РасчетПоСуммам Тогда
			ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(?(ЗначениеЗаполнено(ДанныеСтроки.ДатаВыхода),ДанныеСтроки.ДатаВыхода,ПериодРегистрации),
			Новый Структура("Организация,ВидПараметра,Категория", Организация, Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка()));
			Если ЧасовВГоду.Размер <> 0 Тогда
				СуммаПовышений = СуммаПовышений/ЧасовВГоду.Размер;
			КонецЕсли;
		КонецЕсли;
		
		ДанныеСтроки.Результат = ОбщегоНазначения.ОкруглитьЗначение2016((ДанныеСтроки.Размер+СуммаПовышений) * ДанныеСтроки.ЧасовДвойных, ДатаАктуальности);
	иначе          		
		ДанныеСтроки.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеСтроки.Размер * ДанныеСтроки.ЧасовДвойных, ДатаАктуальности);		
	КонецЕсли;			
	
КонецПроцедуры // ВыполнитьАвторасчетРеквизитовСтрокиНачисления()

Функция ПолучитьДокументыОтпускПоУходуЗаРебенком(Сотр, ДатаВозврата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтпускПоУходуЗаРебенком.Сотрудник,
	|	ОтпускПоУходуЗаРебенком.Ссылка,
	|   ОтпускПоУходуЗаРебенком.ДатаНачала
	|ИЗ
	|	Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|ГДЕ
	|	ОтпускПоУходуЗаРебенком.ДатаНачала МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаВозврата, ГОД, -3) И &ДатаВозврата
	|	И ОтпускПоУходуЗаРебенком.Проведен
	|	И ОтпускПоУходуЗаРебенком.Сотрудник = &Сотр";
	
	Запрос.УстановитьПараметр("ДатаВозврата", ДатаВозврата);
	Запрос.УстановитьПараметр("Сотр", Сотр);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
КонецФункции

Процедура ОтправитьПоПочте(ТекстОшибки, УчЗапись, Профиль, Логин, АдресПолучателя)
	//УчетнаяЗапись = ПолучитьУчетнуюЗапись();
	//АдресОтправитель = УчЗапись;//Константы.УчетнаяЗаписьОтправкаОшибокПеренос.Получить();//Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("000000001");
	//АдресПолучатель = АдресОтправитель;
	Если ЗначениеЗаполнено(Логин) И ЗначениеЗаполнено(АдресПолучателя) Тогда
		//Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(АдресОтправитель);
		
		Почта = Новый ИнтернетПочта;
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Текст = Письмо.Тексты.Добавить(ТекстОшибки);
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		Письмо.Тема = "Ошибки (перенос)";
		//Письмо.Отправитель = СокрЛП(Логин);
		Письмо.Отправитель = СокрЛП(АдресПолучателя);
		Письмо.ИмяОтправителя = "Отправитель";
		Письмо.Получатели.Добавить(СокрЛП(АдресПолучателя));
		
		
		Попытка
			Почта.Подключиться(Профиль);
			Сообщить("Подключено");
		Исключение
			Сообщить("Не удалось подключиться к серверу");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		Попытка
			Почта.Послать(Письмо);
			Сообщить("Письмо отправлено");
		Исключение
			Сообщить("Не удалось отправить письмо");
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
		Почта.Отключиться();
		Сообщить("Соединение завершено");		
	Иначе
		Сообщить("Адресату письмо не отправлено, не найден адрес электронной почты.");
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьУчетнуюЗапись()
	УчЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УчетныеЗаписиЭлектроннойПочты.Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|ГДЕ
		|	НЕ УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		УчЗапись = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат УчЗапись;
КонецФункции

Функция ПолучитьФИО(ФЛ,Соединение)
	Стр = Новый Структура;
	Стр.Вставить("Фамилия", "");
	Стр.Вставить("Имя", "");
	Стр.Вставить("Отчество", "");
	ЗапросТам = Соединение.NewObject("Запрос");
	ЗапросТам.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|ФИОФизическихЛиц.Фамилия,
	|ФИОФизическихЛиц.Имя,
	|ФИОФизическихЛиц.Отчество
	|ИЗ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|ГДЕ ФИОФизическихЛиц.ФизическоеЛицо = &ФЛ";
	ЗапросТам.УстановитьПараметр("ФЛ", ФЛ);
	РС = ЗапросТам.Выполнить().выбрать(); 
	Если РС.Следующий() Тогда
		Стр.Фамилия = РС.Фамилия;
		Стр.Имя = РС.Имя;
		Стр.Отчество = РС.Отчество;
	КонецЕсли;
	Возврат Стр;
КонецФункции

Функция ПолучитьТабНомера()
	//ТЗ = Сотрудники.Выгрузить(,"ТабНомер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизаций.Код КАК ТабНомер
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтр = ТЗ.Добавить();
	//	НоваяСтр.ТабНомер = ВыборкаДетальныеЗаписи.ТабНомер;
	//КонецЦикла;
	//
	Возврат ТЗ;
КонецФункции

Функция ПолучитьАдресФЛ(ФЛ, Соединение)
	Адрес = "";
	ЗапросТам = Соединение.NewObject("Запрос");
	ЗапросТам.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
	|КИ.Представление
	|ИЗ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КИ
	|ГДЕ КИ.Ссылка = &ФЛ
	|И КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|И КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)";
	ЗапросТам.УстановитьПараметр("ФЛ", ФЛ);
	РС = ЗапросТам.Выполнить().выбрать(); 
	Если РС.Следующий() Тогда
		Адрес = РС.Представление;
	КонецЕсли;
	Возврат Адрес;
КонецФункции

Функция ПолучитьСледующийТабНомер(ТЗТабНомера)
	ТЗТабНомера.Сортировать("ТабНомер Убыв");
	Если ТЗТабНомера.Количество() = 0 Тогда
		СледТабНомер = 1;
	Иначе
		ПоследнийТабНомер = ТЗТабНомера[0].ТабНомер;
		СледТабНомер = ПоследнийТабНомер + 1;
	КонецЕсли;
	Возврат СледТабНомер;
КонецФункции

// Возвращает вид расчета, соответствующий причине нетрудоспособности
//
// Параметры
//  Причина  – <ПеречислениеСсылка.ПричиныНетрудочпособности> – причина нетрудоспособности
//
// Возвращаемое значение:
//   ПланыВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций   – вид расчета
//
Функция ПолучитьВидРасчетаОтПричиныНетрудоспособности(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам;
		
	ИначеЕсли Причина = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве;
	ИначеЕсли Причина = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу;	
	Иначе
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьКодПоОКРБ(ОКРБ)
	КодПоОКРБ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОКРБ1.КодГруппы КАК КодГруппы,
		|	ОКРБ1.КодКатегорииРаботника КАК КодКатегории,
		|	ОКРБ1.КодКвалификационнойКатегорииДолжностиСлужащего КАК КодКвалификационнойКатегории,
		|	ОКРБ1.ДиапазонРазрядовПрофессииРабочего КАК ДиапазонРазрядов
		|ИЗ
		|	Справочник.ОКРБ1 КАК ОКРБ1
		|ГДЕ
		|	ОКРБ1.КодГруппы = &ОКРБ";
	
	Запрос.УстановитьПараметр("ОКРБ", ОКРБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КодСтр = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КодСтр = СокрЛП(ВыборкаДетальныеЗаписи.КодГруппы) + "-" + СокрЛП(ВыборкаДетальныеЗаписи.КодКатегории) + "-0-00";
	КонецЕсли;
	КодПоОКРБ = КодСтр;
	Возврат КодПоОКРБ;
КонецФункции
//Аверсон СВФР-011701

//Аверсон ПСА 30.07.2024 СВФР-013439+++
Процедура ВыгрузкаКадровыхДанных() Экспорт
	ПутьКФайламОбмена = Константы.КаталогВыгрузкиДляПодпискиНаСобытия.Получить();
	ОбработкаОбмен = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ОбработкаОбмен.РежимОбмена = "Выгрузка";
	ОбработкаОбмен.ДатаНачала = НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
	ОбработкаОбмен.ДатаОкончания   = КонецДня(ТекущаяДата());
	//ДатаВыгрузки = Формат(ТекущаяДата(),"ДЛФ=ДВ");
	//ДатаВыгрузки = СтрЗаменить(ДатаВыгрузки, ".", "_");
	//ДатаВыгрузки = СтрЗаменить(ДатаВыгрузки, ":", "_");	
	//ОбработкаОбмен.ИмяФайлаОбмена  = ПутьКФайламОбмена + "\Выгрузка кадровых данных из ЗУП_" + ДатаВыгрузки + ".xml";
	ОбработкаОбмен.ИмяФайлаОбмена  = ПутьКФайламОбмена + "\Выгрузка кадровых данных из ЗУП.xml";
	ОбработкаОбмен.ИмяФайлаПравилОбмена  = ПутьКФайламОбмена + "\ПравилаОбменаДанными ЗУП - Бух Кадры.xml";
	ОбработкаОбмен.ЗагрузитьПравилаОбмена();
	Попытка
		ОбработкаОбмен.ВыполнитьВыгрузку();	
	Исключение
	КонецПопытки;
	
	
КонецПроцедуры
//+++Аверсон ПСА 30.07.2024 СВФР-013439    

//Аверсон ЕАЕ 28.07.2025 СВФР-016337
Процедура ВыгрузкаФизЛиц() Экспорт
	//Получаем данные из РС
	ТЗДанные = ПолучитьДанныеФизЛиц();
	
	//Выгружаем в файл
	ВыгрузитьВФайл(ТЗДанные);
	
	//Удаляем из РС
	Для Каждого Стр Из ТЗДанные Цикл
		Набор = РегистрыСведений.ОбменЕРПФизЛица.СоздатьНаборЗаписей();
		Набор.Отбор.ФизЛицо.Установить(Стр.ФизЛицо);
		Набор.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьДанныеФизЛиц()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбменЕРПФизЛица.ФизЛицо,
		|	ОбменЕРПФизЛица.ФизЛицо.Код КАК Код,
		|	ОбменЕРПФизЛица.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	ОбменЕРПФизЛица.ДатаЗаписи,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	ОбменЕРПФизЛица.ФизЛицо.Пол КАК Пол
		|ИЗ
		|	РегистрСведений.ОбменЕРПФизЛица КАК ОбменЕРПФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
		|		ПО ОбменЕРПФизЛица.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		//Аверсон ЕАЕ 03.12.2025
		//|ГДЕ
		//|	ОбменЕРПФизЛица.ДатаЗаписи МЕЖДУ &НачалоПериода И &КонецПериода
		//Аверсон 
		|";
		
	//Аверсон ЕАЕ 03.12.2025	
	//Запрос.УстановитьПараметр("КонецПериода", КонецНедели(ТекущаяДата()));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоНедели(ТекущаяДата()));
	//Аверсон
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

Процедура ВыгрузитьВФайл(ТЗ)
	КаталогВыгрузки = Константы.КаталогДляВыгрузкиФизЛиц.Получить();
	Если Не ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("МакетДляВыгрузкиФизЛиц");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	Для Каждого Стр Из ТЗ Цикл
		ОбластьСтрока.Параметры.KOD = Стр.Код;
		ОбластьСтрока.Параметры.FAM = СокрЛП(Стр.Фамилия);
		ОбластьСтрока.Параметры.IM = СокрЛП(Стр.Имя);
		ОбластьСтрока.Параметры.OTCH = СокрЛП(Стр.Отчество);
		ОбластьСтрока.Параметры.DATR = Стр.ДатаРождения;
		ОбластьСтрока.Параметры.POL = СокрЛП(Стр.Пол);
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);	
	КонецЦикла;
	
	ТипФайла = ТипФайлаТабличногоДокумента.XLS;
	ИмяФайла = КаталогВыгрузки + "\ФизическиеЛица" + Формат(ТекущаяДата(),"ДФ=ddMMyyyy") + ".xls";
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайла);
	Сообщить("Файл " + ИмяФайла + " выгружен."); 
КонецПроцедуры
//Аверсон СВФР-016337