
&НаКлиенте
Процедура Загрузить(Команда)
	ВводФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ВводФайла.Фильтр = "Файл базы данных(*.dpu)|*.dpu";
	Если ВводФайла.Выбрать() Тогда
		Файл = ВводФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(Файл);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	МассивДанных = Результат.okigList;
	
	СоздатьЭлементыСправочника(МассивДанных);
	
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры




&НаСервере

Процедура СоздатьЭлементыСправочника(МассивДанных)
	Выборка = Справочники.ОКРБ1.ВыбратьИерархически();
	
	Пока Выборка.Следующий() Цикл
		ЭлементОбъект = Выборка.ПолучитьОбъект();
		ЭлементОбъект.Удалить();
	КонецЦикла;	
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		КодГруппы = СокрЛП(ЭлементМассива.groupCode);
		КодГруппы = СтрЗаменить(КодГруппы, Символы.НПП, "");
		Если НЕ ЗначениеЗаполнено(СокрЛП(ЭлементМассива.indexCode)) Тогда
			НовыйЭлемент = Справочники.ОКРБ1.СоздатьГруппу();
			НовыйЭлемент.КодГруппы = КодГруппы;
			Код = СокрЛП(ЭлементМассива.id);
			Код = СтрЗаменить(Код, Символы.НПП, "");
			НовыйЭлемент.Код = Код;
			НовыйЭлемент.Наименование = СокрЛП(ЭлементМассива.name);
			НовыйЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		КодГруппы = СокрЛП(ЭлементМассива.groupCode);
		КодГруппы = СтрЗаменить(КодГруппы, Символы.НПП, "");
		Если ЗначениеЗаполнено(СокрЛП(ЭлементМассива.indexCode)) Тогда
			Родитель = Справочники.ОКРБ1.НайтиПоРеквизиту("КодГруппы", КодГруппы);
			НовыйЭлемент = Справочники.ОКРБ1.СоздатьЭлемент();
			НовыйЭлемент.Родитель =  Родитель;
			НовыйЭлемент.КодГруппы = КодГруппы + "-" + СокрЛП(ЭлементМассива.indexCode);
			НовыйЭлемент.КодКатегорииРаботника = СокрЛП(ЭлементМассива.type);
			НовыйЭлемент.КодКвалификационнойКатегорииДолжностиСлужащего = СокрЛП(ЭлементМассива.category);
			НовыйЭлемент.ДиапазонРазрядовПрофессииРабочего = СокрЛП(ЭлементМассива.rank);
			Код = СокрЛП(ЭлементМассива.id);
			Код = СтрЗаменить(Код, Символы.НПП, "");
			НовыйЭлемент.Код = Код;
			НовыйЭлемент.Наименование = СокрЛП(ЭлементМассива.name);
			НовыйЭлемент.Записать();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры


