
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрочиеПричиныМинимальнойЗаработнойПлаты
	Движения.ПрочиеПричиныМинимальнойЗаработнойПлаты.Записывать = Истина;
	Движения.ПрочиеПричиныМинимальнойЗаработнойПлаты.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Движение = Движения.ПрочиеПричиныМинимальнойЗаработнойПлаты.Добавить();
		Движение.Период = Период;
		Движение.Организация = Организация;
		Движение.Сотрудник = ТекСтрокаРаботникиОрганизации.Сотрудник;
		Движение.ФизЛицо = ТекСтрокаРаботникиОрганизации.ФизЛицо;
		Движение.ПричиныМинимальнойЗаработнойПлаты = ТекСтрокаРаботникиОрганизации.Причина;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
