////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;
Перем мДатаЗакона180ФЗ Экспорт;
Перем мДатаЗакона255ФЗ Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачала, ВидРасчета, ПроцентОплаты)
	
	СтрокаИнтервала					= ТаблицаИнтерваловОплаты.Добавить();
	СтрокаИнтервала.Начало			= ДатаНачала;
	СтрокаИнтервала.Расчет			= ВидРасчета;
	СтрокаИнтервала.ПроцентОплаты	= ПроцентОплаты;
	
КонецПроцедуры // ДобавитьСтрокуВТаблицуИнтервалов()

// Выполняет проверку непрерывности интервалов начислений
Процедура ПроверитьНепрерывностьЗаписейНачислений(Отказ, Заголовок)
	
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Аверсон ЕАЕ 08.01.2025 СВФР-013953
	Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
		Если РаботаПриБЛПоУходу.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Аверсон СВФР-013953
	
	// создадим массив начислений, по которым будем проверять непрерывность записей
	МассивНачислений = Новый Массив;
	МассивНачислений.Добавить(?(ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезниПоБеременности, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезни));	
	МассивНачислений.Добавить(ВидРасчета);
	
	ТНачислений = Начисления.Выгрузить();
	ТНачислений.Сортировать("Сотрудник, ДатаНачала");
	
	ПредыдущийСотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	ПредыдущаяДатаОкончания = '00010101';
	СтрокаНеПервая = Ложь;
	Для Каждого Строка ИЗ ТНачислений Цикл
		
		// Пропустим сторно записи и записи не из массива начислений
		Если Строка.Сторно ИЛИ МассивНачислений.Найти(Строка.ВидРасчета) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПредыдущийСотрудник <> Строка.Сотрудник Тогда
			ПредыдущийСотрудник = Строка.Сотрудник;
			СтрокаНеПервая = Ложь;
		КонецЕсли;
		
		// если встретили не первую строку начислений
		Если СтрокаНеПервая Тогда
			// строка не первая
			Если Строка.ДатаНачала <> ПредыдущаяДатаОкончания + мДлинаСуток Тогда
				СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(Строка.НомерСтроки) +
				""" табл. части ""Начисления"": ";
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "нарушено требование непрерывности записей начислений!", Отказ, Заголовок);
			КонецЕсли;
		Иначе
			СтрокаНеПервая = Истина;
		КонецЕсли;
		ПредыдущаяДатаОкончания = Строка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьНепрерывностьЗаписейНачислений()

Функция КорректноеСочетаниеСчетовНУ(СчетДт,НаименованиеСчетДт, СчетКт, СчетДтНУ, СчетКтНУ, ЭтоЕНВД, Сообщение)
	
	Сообщение = "";
	
	Если СчетДтНУ.Пустая() Тогда
		Если (СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда или СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов)
			и Не ЭтоЕНВД Тогда
			Сообщение = "Не указан счет налогового учета!";
		КонецЕсли;
		Если НЕ СчетКтНУ.Пустая() Тогда
			Сообщение = Сообщение + ?(Сообщение = "","",Символы.ПС) + "Указан счет кредита налогового учета, но не указан счет дебета налогового учета!";
		КонецЕсли;
	Иначе
		Если (СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда или СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоВыплатеДоходов) Тогда
			Сообщение = "Проводки в дебет "+НаименованиеСчетДт +" не должны отражаться в налоговом учете!";
		ИначеЕсли ЭтоЕНВД Тогда
			Сообщение = "Проводки по видам деятельности, облагаемым ЕНВД не должны отражаться в налоговом учете!";
		КонецЕсли;
		
		Если СчетКтНУ.Пустая() Тогда
			Сообщение = Сообщение + ?(Сообщение = "","",Символы.ПС) + "Указан счет дебета налогового учета, но не указан счет кредита налогового учета!";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПустаяСтрока(Сообщение)
	
КонецФункции // КорректноеСочетаниеСчетовНУ()

Функция ПолучитьВариантАлгоритмаРасчета(ЭтоПереходныйПериодПоЗакону255ФЗ)
	
	Если ЭтоПереходныйПериодПоЗакону255ФЗ Тогда
		Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
			Если ОграничениеПособияПереходногоПериода = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОбщимОграничениемИВРазмереММОТ;
			ИначеЕсли ОграничениеПособияПереходногоПериода = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОбщимОграничением;
			Иначе
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОбщимОграничениемИБезОграничений;
			КонецЕсли;
		ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
			Если ОграничениеПособияПереходногоПериода = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениемВРазмереММОТ;
			ИначеЕсли ОграничениеПособияПереходногоПериода = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениямиВРазмереММОТиОбщим;
			Иначе
				ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениемВРазмереММОТиБезОграничений;
			КонецЕсли;
		Иначе
			ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаБезОграничений;
		КонецЕсли;
	ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам И ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
		ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОграничениемПоБеременности;
	ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
		ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОбщимОграничением;
	ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
		ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОграничениемВРазмереММОТ;
	Иначе
		ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйБезОграничений;
	КонецЕсли;
	
	Возврат ВариантАлгоритмаРасчета
	
КонецФункции // ПолучитьВариантАлгоритмаРасчета()

// получение первичных данных для бухучета
// первичные в данном случае, это те, для которых определено конкретное отражение
// в бухучете (не требуетяс предварительная обработка правила отражения в бухучете)
// или те которые определяют свой бухучет по базовым начисленияи и 
// при этом базируются на прошлом периоде
// 
// Параметры:
//  Основные - булево, если Истина, то получаем данные по основным начислениям иначе - по доп.
//
// Возвращаемое значение:
//  Результат запроса
// 
Функция ПолучитьДанныеУчета(ВыборкаПоШапкеДокумента, ЧитатьРасчетнуюБазу)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", ВыборкаПоШапкеДокумента.ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ПериодРегистрации", ВыборкаПоШапкеДокумента.ПериодРегистрации);
	Запрос.УстановитьПараметр("ДатаЗакона202ФЗ", '20050101');
	Запрос.УстановитьПараметр("ДатаЗакона255ФЗ", мДатаЗакона255ФЗ);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//получим отражение в учете сторно записей
	ОсновныеНачисленияСторноТекст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисления.Сотрудник,
	|	ОсновныеНачисления.ФизЛицо,
	|	ОсновныеНачисления.Организация,
	|	ОсновныеНачисления.ПериодДействияНачало,
	|	ОсновныеНачисления.ПериодДействияКонец,
	|	ОсновныеНачисления.ВидРасчета,
	|	ОсновныеНачисления.СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТ_ОсновныеНачисленияСторно
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
	|ГДЕ
	|	ОсновныеНачисления.Регистратор = &Регистратор
	|	И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
	|	И ОсновныеНачисления.Результат <> 0
	|	И ОсновныеНачисления.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	
	Запрос.Текст = ОсновныеНачисленияСторноТекст;
	//временная таблица - ВТ_ОсновныеНачисленияСторно
	Результат = Запрос.Выполнить().Выгрузить();
	КоличествоСторноЗаписей = Результат[0].Количество;
	
	Если КоличествоСторноЗаписей <> 0 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеНачисления.СторнируемыйДокумент.ПериодРегистрации КАК ПериодРегистрации,
		|	ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ ВТ_СторноСотрудники
		|ИЗ
		|	ВТ_ОсновныеНачисленияСторно КАК ОсновныеНачисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодРегистрации,
		|	Сотрудник,
		|	ВидРасчета";
		
		//временная таблица - ВТ_СторноСотрудники
		Запрос.Выполнить();
		
		
		ОтражениеВУчетеСторноТекст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	БУОсновныеНачисления.СчетДт,
		|	БУОсновныеНачисления.СубконтоДт1,
		|	БУОсновныеНачисления.СубконтоДт2,
		|	БУОсновныеНачисления.СубконтоДт3,
		|	БУОсновныеНачисления.СчетКт,
		|	БУОсновныеНачисления.СубконтоКт1,
		|	БУОсновныеНачисления.СубконтоКт2,
		|	БУОсновныеНачисления.СубконтоКт3,
		|	БУОсновныеНачисления.СчетДтНУ,
		|	БУОсновныеНачисления.СубконтоДтНУ1,
		|	БУОсновныеНачисления.СубконтоДтНУ2,
		|	БУОсновныеНачисления.СубконтоДтНУ3,
		|	БУОсновныеНачисления.СчетКтНУ,
		|	БУОсновныеНачисления.СубконтоКтНУ1,
		|	БУОсновныеНачисления.СубконтоКтНУ2,
		|	БУОсновныеНачисления.СубконтоКтНУ3,
		|	БУОсновныеНачисления.СчетКтУСН,
		|	БУОсновныеНачисления.ОтражениеВУСН,
		|	БУОсновныеНачисления.Результат,
		|	ВЫБОР
		|		КОГДА БУОсновныеНачисления.СчетДт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЕНВД))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОблагаетсяЕНВД,
		|	ВЫБОР
		|		КОГДА БУОсновныеНачисления.СчетДт В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_СПЕЦ_УСН), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ПособияЗаСчетФСС)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.НеОблагаетсяЦеликом)
		|	КОНЕЦ КАК КодДоходаЕСН,
		|	БУОсновныеНачисления.ПериодДействияНачало,
		|	БУОсновныеНачисления.ПериодДействияКонец
		|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно
		|ИЗ
		|	ВТ_ОсновныеНачисленияСторно КАК ОсновныеНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			БУОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|			БУОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|			БУОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|			БУОсновныеНачисления.Сотрудник КАК Сотрудник,
		|			БУОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|			БУОсновныеНачисления.Организация КАК Организация,
		|			БУОсновныеНачисления.Результат КАК Результат,
		|			БУОсновныеНачисления.СчетДт КАК СчетДт,
		|			БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
		|			БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
		|			БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
		|			БУОсновныеНачисления.СчетКт КАК СчетКт,
		|			БУОсновныеНачисления.СубконтоКт1 КАК СубконтоКт1,
		|			БУОсновныеНачисления.СубконтоКт2 КАК СубконтоКт2,
		|			БУОсновныеНачисления.СубконтоКт3 КАК СубконтоКт3,
		|			БУОсновныеНачисления.СчетДтНУ КАК СчетДтНУ,
		|			БУОсновныеНачисления.СубконтоДтНУ1 КАК СубконтоДтНУ1,
		|			БУОсновныеНачисления.СубконтоДтНУ2 КАК СубконтоДтНУ2,
		|			БУОсновныеНачисления.СубконтоДтНУ3 КАК СубконтоДтНУ3,
		|			БУОсновныеНачисления.СчетКтНУ КАК СчетКтНУ,
		|			БУОсновныеНачисления.СубконтоКтНУ1 КАК СубконтоКтНУ1,
		|			БУОсновныеНачисления.СубконтоКтНУ2 КАК СубконтоКтНУ2,
		|			БУОсновныеНачисления.СубконтоКтНУ3 КАК СубконтоКтНУ3,
		|			БУОсновныеНачисления.СчетКтУСН КАК СчетКтУСН,
		|			БУОсновныеНачисления.ОтражениеВУСН КАК ОтражениеВУСН,
		|			БУОсновныеНачисления.ДокументОснование КАК ДокументОснование,
		|			БУОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало1,
		|			БУОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец1
		|		ИЗ
		|			РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ГДЕ
		|			(БУОсновныеНачисления.ПериодРегистрации, БУОсновныеНачисления.Сотрудник, БУОсновныеНачисления.ВидРасчета) В
		|					(ВЫБРАТЬ
		|						ОсновныеНачисления.ПериодРегистрации,
		|						ОсновныеНачисления.Сотрудник,
		|						ОсновныеНачисления.ВидРасчета
		|					ИЗ
		|						ВТ_СторноСотрудники КАК ОсновныеНачисления)) КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисления.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И ОсновныеНачисления.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И ОсновныеНачисления.Организация = БУОсновныеНачисления.Организация
		|			И ОсновныеНачисления.ФизЛицо = БУОсновныеНачисления.ФизЛицо
		|			И ОсновныеНачисления.СторнируемыйДокумент = БУОсновныеНачисления.ДокументОснование
		|			И (БУОсновныеНачисления.ПериодДействияНачало >= ОсновныеНачисления.ПериодДействияНачало)
		|			И (БУОсновныеНачисления.ПериодДействияКонец <= ОсновныеНачисления.ПериодДействияКонец)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
		
	Иначе
		
		ОтражениеВУчетеСторноТекст = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК НомерСтроки,
		|	НЕОПРЕДЕЛЕНО КАК СчетДт,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СчетКт,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	НЕОПРЕДЕЛЕНО КАК СчетДтНУ,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДтНУ3,
		|	НЕОПРЕДЕЛЕНО КАК СчетКтНУ,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКтНУ3,
		|	НЕОПРЕДЕЛЕНО КАК СчетКтУСН,
		|	НЕОПРЕДЕЛЕНО КАК ОтражениеВУСН,
		|	НЕОПРЕДЕЛЕНО КАК ОблагаетсяЕНВД,
		|	НЕОПРЕДЕЛЕНО КАК ПериодДействияНачало,
		|	НЕОПРЕДЕЛЕНО КАК ПериодДействияКонец,
		|	НЕОПРЕДЕЛЕНО КАК КодДоходаЕСН,
		|	0 КАК Результат
		|ПОМЕСТИТЬ ВТ_ОтражениеВУчетеСторно";
		
	КонецЕсли;
	
	Запрос.Текст = ОтражениеВУчетеСторноТекст;
	//временная таблица - ВТ_ОтражениеВУчетеСторно
	Запрос.Выполнить();
	
	Если ЧитатьРасчетнуюБазу Тогда
		
		Измерения = Новый Массив(1);
		Измерения[0] = "Сотрудник";
		
		Запрос.УстановитьПараметр("парамИзмерения", Измерения);
		
		Разрезы = Новый Массив(17);
		Разрезы[0] = "СчетДт";
		Разрезы[1] = "СубконтоДт1";
		Разрезы[2] = "СубконтоДт2";
		Разрезы[3] = "СубконтоДт3";
		Разрезы[4] = "СчетКт";
		Разрезы[5] = "СубконтоКт1";
		Разрезы[6] = "СубконтоКт2";
		Разрезы[7] = "СубконтоКт3";
		Разрезы[8] = "СчетДтНУ";
		Разрезы[9] = "СчетКтНУ";
		Разрезы[10] = "СубконтоДтНУ1";
		Разрезы[11] = "СубконтоДтНУ2";
		Разрезы[12] = "СубконтоДтНУ3";
		Разрезы[13] = "СубконтоКтНУ1";
		Разрезы[14] = "СубконтоКтНУ2";
		Разрезы[15] = "СубконтоКтНУ3";
		Разрезы[16] = "ОтражениеВУСН";	
		
		Запрос.УстановитьПараметр("парамРазрезыБУ", Разрезы);
		
		// для учета особенностей расчета среднего заработка
		СписокСоставляющихСреднегоЗаработка = Новый Массив(10); 
		СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
		СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямБЛ;
		СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииБЛ;
		СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямБЛ;
		СписокСоставляющихСреднегоЗаработка[4] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииБЛ;
		СписокСоставляющихСреднегоЗаработка[5] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		СписокСоставляющихСреднегоЗаработка[6] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		СписокСоставляющихСреднегоЗаработка[7] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
		СписокСоставляющихСреднегоЗаработка[8] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		СписокСоставляющихСреднегоЗаработка[9] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
		Запрос.УстановитьПараметр("парамСписокСоставляющихСреднегоЗаработка", СписокСоставляющихСреднегоЗаработка);
		
		ОсновнойЗаработок = Новый Массив(3);
		ОсновнойЗаработок[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку;
		ОсновнойЗаработок[1] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
		ОсновнойЗаработок[2] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуПособий;
		ПоФиксПремиям = Новый Массив(3);
		ПоФиксПремиям[0] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		ПоФиксПремиям[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямБЛ;
		ПоФиксПремиям[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямПособий;
		ПоПремиям = Новый Массив(3);
		ПоПремиям[0] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		ПоПремиям[1] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямБЛ;
		ПоПремиям[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямПособий;
		ФиксГодовыеПремии = Новый Массив(3);
		ФиксГодовыеПремии[0] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремии;
		ФиксГодовыеПремии[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииБЛ;
		ФиксГодовыеПремии[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииПособий;
		
		Запрос.УстановитьПараметр("ОсновнойЗаработок", ОсновнойЗаработок);
		Запрос.УстановитьПараметр("ПоПремиям", ПоПремиям);
		Запрос.УстановитьПараметр("ПоФиксПремиям", ПоФиксПремиям);
		Запрос.УстановитьПараметр("ФиксГодовыеПремии", ФиксГодовыеПремии);
		
		БазаСреднегоЗаработкаТекст =
		"ВЫБРАТЬ
		|	БазаСреднегоЗаработка.Регистратор,
		|	БазаСреднегоЗаработка.НомерСтроки,
		|	БазаСреднегоЗаработка.СчетДтРазрез,
		|	БазаСреднегоЗаработка.СчетКтРазрез,
		|	БазаСреднегоЗаработка.СубконтоДт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт3Разрез,
		|	БазаСреднегоЗаработка.СчетДтНУРазрез,
		|	БазаСреднегоЗаработка.СчетКтНУРазрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ3Разрез,
		|	БазаСреднегоЗаработка.ОтражениеВУСНРазрез,
		|	СУММА(БазаСреднегоЗаработка.РезультатБаза) КАК РезультатБаза
		|ПОМЕСТИТЬ БазаСреднегоЗаработка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Регистратор КАК Регистратор,
		|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		БазаСреднегоЗаработка.СчетДтРазрез КАК СчетДтРазрез,
		|		БазаСреднегоЗаработка.СчетКтРазрез КАК СчетКтРазрез,
		|		БазаСреднегоЗаработка.СубконтоДт1Разрез КАК СубконтоДт1Разрез,
		|		БазаСреднегоЗаработка.СубконтоДт2Разрез КАК СубконтоДт2Разрез,
		|		БазаСреднегоЗаработка.СубконтоДт3Разрез КАК СубконтоДт3Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт1Разрез КАК СубконтоКт1Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт2Разрез КАК СубконтоКт2Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт3Разрез КАК СубконтоКт3Разрез,
		|		БазаСреднегоЗаработка.СчетДтНУРазрез КАК СчетДтНУРазрез,
		|		БазаСреднегоЗаработка.СчетКтНУРазрез КАК СчетКтНУРазрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ1Разрез КАК СубконтоДтНУ1Разрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ2Разрез КАК СубконтоДтНУ2Разрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ3Разрез КАК СубконтоДтНУ3Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ1Разрез КАК СубконтоКтНУ1Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ2Разрез КАК СубконтоКтНУ2Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ3Разрез КАК СубконтоКтНУ3Разрез,
		|		БазаСреднегоЗаработка.ОтражениеВУСНРазрез КАК ОтражениеВУСНРазрез,
		|		ВЫБОР
		|			КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|				ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации
		|			КОГДА БазаСреднегоЗаработка.ЧислоМесяцев = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ПоФиксПремиям)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации * ВЫБОР
		|								КОГДА БазаСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ БазаСреднегоЗаработка.ОтработаноПоПятидневке / БазаСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ПоПремиям)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ФиксГодовыеПремии)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * ВЫБОР
		|								КОГДА БазаСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ БазаСреднегоЗаработка.ОтработаноПоПятидневке / БазаСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					ИНАЧЕ БазаСреднегоЗаработка.РезультатБаза
		|				КОНЕЦ * ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.ЧислоМесяцев > БазаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка
		|						ТОГДА БазаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка / БазаСреднегоЗаработка.ЧислоМесяцев
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		КОНЕЦ КАК РезультатБаза
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.РасчетСреднегоЗаработка.БазаБУОсновныеНачисления(
		|					&парамИзмерения,
		|					&парамИзмерения,
		|					&парамРазрезыБУ,
		|					Регистратор = &Регистратор
		|						И (НЕ Сторно)
		|						И (ВидРасчета В (&парамСписокСоставляющихСреднегоЗаработка)
		|							ИЛИ ДатаНачалаСобытия >= &ДатаЗакона255ФЗ)) КАК БазаСреднегоЗаработка
		|			ПО (БазаСреднегоЗаработка.СпособРасчета = ОсновныеНачисления.ВидРасчета.СпособРасчета)
		|				И ОсновныеНачисления.ДатаНачалаСобытия = БазаСреднегоЗаработка.ДатаНачалаСобытия
		|				И ОсновныеНачисления.ПериодРасчетаСреднегоЗаработкаНачало = БазаСреднегоЗаработка.ДатаНачалаРасчетногоПериода
		|				И ОсновныеНачисления.ПериодРасчетаСреднегоЗаработкаОкончание = БазаСреднегоЗаработка.ДатаОкончанияРасчетногоПериода
		|				И (ОсновныеНачисления.Сотрудник = ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|							И БазаСреднегоЗаработка.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеПоУходуЗаРебенкомДо1_5Лет))
		|						ТОГДА ЕСТЬNULL(БазаСреднегоЗаработка.Регистратор.Сотрудник, БазаСреднегоЗаработка.Сотрудник)
		|					ИНАЧЕ БазаСреднегоЗаработка.Сотрудник
		|				КОНЕЦ)
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|		И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|		И (НЕ ОсновныеНачисления.Сторно)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОсновныеНачисления.Регистратор,
		|		ОсновныеНачисления.НомерСтроки,
		|		БазаСреднегоЗаработка.СчетДтРазрез,
		|		БазаСреднегоЗаработка.СчетКтРазрез,
		|		БазаСреднегоЗаработка.СубконтоДт1Разрез,
		|		БазаСреднегоЗаработка.СубконтоДт2Разрез,
		|		БазаСреднегоЗаработка.СубконтоДт3Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт1Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт2Разрез,
		|		БазаСреднегоЗаработка.СубконтоКт3Разрез,
		|		БазаСреднегоЗаработка.СчетДтНУРазрез,
		|		БазаСреднегоЗаработка.СчетКтНУРазрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ1Разрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ2Разрез,
		|		БазаСреднегоЗаработка.СубконтоДтНУ3Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ1Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ2Разрез,
		|		БазаСреднегоЗаработка.СубконтоКтНУ3Разрез,
		|		БазаСреднегоЗаработка.ОтражениеВУСНРазрез,
		|		ВЫБОР
		|			КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
		|				ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации
		|			КОГДА БазаСреднегоЗаработка.ЧислоМесяцев = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ПоФиксПремиям)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации * ВЫБОР
		|								КОГДА БазаСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ БазаСреднегоЗаработка.ОтработаноПоПятидневке / БазаСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ПоПремиям)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * БазаСреднегоЗаработка.КоэффициентИндексации
		|					КОГДА БазаСреднегоЗаработка.ВидРасчета В (&ФиксГодовыеПремии)
		|						ТОГДА БазаСреднегоЗаработка.РезультатБаза * ВЫБОР
		|								КОГДА БазаСреднегоЗаработка.НормаПоПятидневке = 0
		|									ТОГДА 0
		|								ИНАЧЕ БазаСреднегоЗаработка.ОтработаноПоПятидневке / БазаСреднегоЗаработка.НормаПоПятидневке
		|							КОНЕЦ
		|					ИНАЧЕ БазаСреднегоЗаработка.РезультатБаза
		|				КОНЕЦ * ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.ЧислоМесяцев > БазаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка
		|						ТОГДА БазаСреднегоЗаработка.ПериодРасчетаСреднегоЗаработка / БазаСреднегоЗаработка.ЧислоМесяцев
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		КОНЕЦ
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.РасчетСреднегоЗаработка.БазаБУДополнительныеНачисления(
		|					&парамИзмерения,
		|					&парамИзмерения,
		|					&парамРазрезыБУ,
		|					Регистратор = &Регистратор
		|						И (НЕ Сторно)
		|						И (ВидРасчета В (&парамСписокСоставляющихСреднегоЗаработка)
		|							ИЛИ ДатаНачалаСобытия >= &ДатаЗакона255ФЗ)) КАК БазаСреднегоЗаработка
		|			ПО (ОсновныеНачисления.Сотрудник = ВЫБОР
		|					КОГДА БазаСреднегоЗаработка.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|							И БазаСреднегоЗаработка.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПособиеПоУходуЗаРебенкомДо1_5Лет))
		|						ТОГДА ЕСТЬNULL(БазаСреднегоЗаработка.Регистратор.Сотрудник, БазаСреднегоЗаработка.Сотрудник)
		|					ИНАЧЕ БазаСреднегоЗаработка.Сотрудник
		|				КОНЕЦ)
		|				И (БазаСреднегоЗаработка.СпособРасчета = ОсновныеНачисления.ВидРасчета.СпособРасчета)
		|				И ОсновныеНачисления.ДатаНачалаСобытия = БазаСреднегоЗаработка.ДатаНачалаСобытия
		|				И ОсновныеНачисления.ПериодРасчетаСреднегоЗаработкаНачало = БазаСреднегоЗаработка.ДатаНачалаРасчетногоПериода
		|				И ОсновныеНачисления.ПериодРасчетаСреднегоЗаработкаОкончание = БазаСреднегоЗаработка.ДатаОкончанияРасчетногоПериода
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|		И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|		И (НЕ ОсновныеНачисления.Сторно)) КАК БазаСреднегоЗаработка
		|
		|СГРУППИРОВАТЬ ПО
		|	БазаСреднегоЗаработка.Регистратор,
		|	БазаСреднегоЗаработка.НомерСтроки,
		|	БазаСреднегоЗаработка.СчетДтРазрез,
		|	БазаСреднегоЗаработка.СчетКтРазрез,
		|	БазаСреднегоЗаработка.СубконтоДт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт3Разрез,
		|	БазаСреднегоЗаработка.СчетДтНУРазрез,
		|	БазаСреднегоЗаработка.СчетКтНУРазрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ3Разрез,
		|	БазаСреднегоЗаработка.ОтражениеВУСНРазрез";
		
		Запрос.Текст = БазаСреднегоЗаработкаТекст;
		//временная таблица - БазаСреднегоЗаработка
		Запрос.Выполнить();
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	&ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.Результат,
		|	ЕСТЬNULL(ОтражениеВУчетеСторно.ПериодДействияНачало, ДанныеУчета.ПериодДействияНачало) КАК ПериодДействияНачало,
		|	ЕСТЬNULL(ОтражениеВУчетеСторно.ПериодДействияКонец, ДанныеУчета.ПериодДействияКонец) КАК ПериодДействияКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	БазаСреднегоЗаработка.СчетДтРазрез КАК СчетДтРазрез,
		|	БазаСреднегоЗаработка.СчетКтРазрез КАК СчетКтРазрез,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА БазаСреднегоЗаработка.СубконтоДт1Разрез ССЫЛКА Справочник.СтатьиЗатрат
		|					ТОГДА БазаСреднегоЗаработка.СубконтоДт1Разрез.ОтнесениеРасходовКДеятельностиЕНВД
		|				КОГДА БазаСреднегоЗаработка.СубконтоДт2Разрез ССЫЛКА Справочник.СтатьиЗатрат
		|					ТОГДА БазаСреднегоЗаработка.СубконтоДт2Разрез.ОтнесениеРасходовКДеятельностиЕНВД
		|				КОГДА БазаСреднегоЗаработка.СубконтоДт3Разрез ССЫЛКА Справочник.СтатьиЗатрат
		|					ТОГДА БазаСреднегоЗаработка.СубконтоДт3Разрез.ОтнесениеРасходовКДеятельностиЕНВД
		|				ИНАЧЕ NULL
		|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЕНВД,
		|	БазаСреднегоЗаработка.СубконтоДт1Разрез КАК СубконтоДт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт2Разрез КАК СубконтоДт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДт3Разрез КАК СубконтоДт3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт1Разрез КАК СубконтоКт1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт2Разрез КАК СубконтоКт2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКт3Разрез КАК СубконтоКт3Разрез,
		|	БазаСреднегоЗаработка.СчетДтНУРазрез КАК СчетДтНУРазрез,
		|	БазаСреднегоЗаработка.СчетКтНУРазрез КАК СчетКтНУРазрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ1Разрез КАК СубконтоДтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ2Разрез КАК СубконтоДтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоДтНУ3Разрез КАК СубконтоДтНУ3Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ1Разрез КАК СубконтоКтНУ1Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ2Разрез КАК СубконтоКтНУ2Разрез,
		|	БазаСреднегоЗаработка.СубконтоКтНУ3Разрез КАК СубконтоКтНУ3Разрез,
		|	БазаСреднегоЗаработка.ОтражениеВУСНРазрез КАК ОтражениеВУСНРазрез,
		|	БазаСреднегоЗаработка.РезультатБаза КАК РезультатБаза,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ДанныеУчета.ПериодДействия >= &ДатаЗакона255ФЗ
		|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РазмерыММОТ.Размер, 0) * (ЕСТЬNULL(ДанныеФПД.КалендарныхДней, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ДанныеУчета.ПериодДействия, МЕСЯЦ))) КАК ЧИСЛО(10, 2))
		|			КОГДА ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеПериодДействия, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(РазмерыММОТ.Размер, 0) / ДанныеГрафика.ОсновноеЗначениеПериодДействия * ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия, 0) КАК ЧИСЛО(10, 2))
		|		КОНЕЦ, 0) КАК ВПределахММОТ,
		|	ЕСТЬNULL(ДанныеУчетаБЛ.ДоляБЛЗаСчетРаботодателя, 0) КАК ДоляБЛЗаСчетРаботодателя,
		|	ДанныеУчета.ВидРасчета.Наименование,
		|	ОтражениеВУчетеСторно.КодДоходаЕСН КАК КодДоходаЕСН,
		|	ОтражениеВУчетеСторно.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ОтражениеВУчетеСторно.СчетДт КАК СчетДт,
		|	ОтражениеВУчетеСторно.СубконтоДт1,
		|	ОтражениеВУчетеСторно.СубконтоДт2,
		|	ОтражениеВУчетеСторно.СубконтоДт3,
		|	ОтражениеВУчетеСторно.СчетКт,
		|	ОтражениеВУчетеСторно.СубконтоКт1,
		|	ОтражениеВУчетеСторно.СубконтоКт2,
		|	ОтражениеВУчетеСторно.СубконтоКт3,
		|	ОтражениеВУчетеСторно.СчетДтНУ,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ1,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ2,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ3,
		|	ОтражениеВУчетеСторно.СчетКтНУ,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ1,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ2,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ3,
		|	ОтражениеВУчетеСторно.СчетКтУСН,
		|	ОтражениеВУчетеСторно.ОтражениеВУСН,
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.Сторно КАК Сторно,
		|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|		И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)) КАК ДанныеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ БазаСреднегоЗаработка КАК БазаСреднегоЗаработка
		|		ПО ДанныеУчета.НомерСтроки = БазаСреднегоЗаработка.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыАктуальностиММОТ.Регистратор КАК Регистратор,
		|			ДатыАктуальностиММОТ.НомерСтроки КАК ОсновнойНомерСтроки,
		|			МинимальнаяОплатаТрудаРФ.Размер КАК Размер
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ОсновныеНачисления.Регистратор КАК Регистратор,
		|				ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(МинимальнаяОплатаТрудаРФ.Период) КАК ДатаАктуальности
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|					ПО (МинимальнаяОплатаТрудаРФ.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|			ГДЕ
		|				ОсновныеНачисления.Регистратор = &Регистратор
		|				И (НЕ ОсновныеНачисления.Сторно)
		|				И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ОсновныеНачисления.НомерСтроки,
		|				ОсновныеНачисления.Регистратор) КАК ДатыАктуальностиММОТ
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|				ПО (МинимальнаяОплатаТрудаРФ.Период = ДатыАктуальностиММОТ.ДатаАктуальности)) КАК РазмерыММОТ
		|		ПО ДанныеУчета.НомерСтроки = РазмерыММОТ.ОсновнойНомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ДанныеГрафика(
		|				ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|					И (НЕ Сторно)
		|					И Регистратор = &Регистратор) КАК ДанныеГрафика
		|		ПО ДанныеУчета.НомерСтроки = ДанныеГрафика.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ФактическийПериодДействияЗаписей.НомерСтроки КАК НомерСтроки,
		|			СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействияЗаписей.ПериодДействияНачало, НАЧАЛОПЕРИОДА(ФактическийПериодДействияЗаписей.ПериодДействияКонец, ДЕНЬ), ДЕНЬ) + 1) КАК КалендарныхДней
		|		ИЗ
		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|					ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|						И (НЕ Сторно)
		|						И Регистратор = &Регистратор) КАК ФактическийПериодДействияЗаписей
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ФактическийПериодДействияЗаписей.НомерСтроки) КАК ДанныеФПД
		|		ПО ДанныеУчета.НомерСтроки = ДанныеФПД.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОсновныеНачисления.Регистратор КАК Регистратор,
		|			ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|			ЕСТЬNULL(ВЫБОР
		|					КОГДА ОсновныеНачисления.ДатаНачалаСобытия >= &ДатаЗакона255ФЗ
		|						ТОГДА ФактическийПериодДействияЗаписей.ДнейЗаСчетРаботодателя / ФактическийПериодДействияЗаписей.КалендарныхДней
		|					КОГДА ВЫБОР
		|							КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|								ТОГДА ОсновныеНачисления.НормаДней
		|							ИНАЧЕ ОсновныеНачисления.НормаЧасов
		|						КОНЕЦ = 0
		|						ТОГДА 0
		|					ИНАЧЕ СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) / ВЫБОР
		|							КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|								ТОГДА ОсновныеНачисления.НормаДней
		|							ИНАЧЕ ОсновныеНачисления.НормаЧасов
		|						КОНЕЦ
		|				КОНЕЦ, 0) КАК ДоляБЛЗаСчетРаботодателя
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ОсновныеНачисления.Регистратор КАК Регистратор,
		|				ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|				ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|				ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|				ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|				ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|				ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|				ОсновныеНачисления.НормаДней КАК НормаДней,
		|				ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|				ОсновныеНачисления.НормаЧасов КАК НормаЧасов
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ГДЕ
		|				ОсновныеНачисления.Регистратор = &Регистратор
		|				И (НЕ ОсновныеНачисления.Сторно)
		|				И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|				И РАЗНОСТЬДАТ(ОсновныеНачисления.ДатаНачалаСобытия, ОсновныеНачисления.ПериодДействияНачало, ДЕНЬ) < 2
		|				И ОсновныеНачисления.ДатаНачалаСобытия >= &ДатаЗакона202ФЗ) КАК ОсновныеНачисления
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|				ПО ОсновныеНачисления.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|					И ОсновныеНачисления.ВидУчетаВремени = ГрафикиРаботыПоВидамВремени.ВидУчетаВремени
		|					И (ОсновныеНачисления.ПериодДействия < &ДатаЗакона255ФЗ)
		|					И ОсновныеНачисления.ПериодДействияНачало <= ГрафикиРаботыПоВидамВремени.Дата
		|					И (ДОБАВИТЬКДАТЕ(ОсновныеНачисления.ДатаНачалаСобытия, ДЕНЬ, 1) >= ГрафикиРаботыПоВидамВремени.Дата)
		|					И ОсновныеНачисления.ПериодДействияКонец >= ГрафикиРаботыПоВидамВремени.Дата
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ФактическийПериодДействияЗаписей.НомерСтроки КАК НомерСтроки,
		|					СУММА(ВЫБОР
		|							КОГДА ФактическийПериодДействияЗаписей.ПериодДействияНачало = ФактическийПериодДействияЗаписей.ДатаНачалаСобытия
		|								ТОГДА ВЫБОР
		|										КОГДА ФактическийПериодДействияЗаписей.ПериодДействияКонец >= ДОБАВИТЬКДАТЕ(ФактическийПериодДействияЗаписей.ДатаНачалаСобытия, ДЕНЬ, 1)
		|											ТОГДА 2
		|										ИНАЧЕ 1
		|									КОНЕЦ
		|							КОГДА ФактическийПериодДействияЗаписей.ПериодДействияНачало > ДОБАВИТЬКДАТЕ(ФактическийПериодДействияЗаписей.ДатаНачалаСобытия, ДЕНЬ, 1)
		|								ТОГДА 0
		|							ИНАЧЕ 1
		|						КОНЕЦ) КАК ДнейЗаСчетРаботодателя,
		|					СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействияЗаписей.ПериодДействияНачало, НАЧАЛОПЕРИОДА(ФактическийПериодДействияЗаписей.ПериодДействияКонец, ДЕНЬ), ДЕНЬ) + 1) КАК КалендарныхДней
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|							ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|								И Регистратор = &Регистратор
		|								И (НЕ Сторно)
		|								И ДатаНачалаСобытия >= &ДатаЗакона255ФЗ) КАК ФактическийПериодДействияЗаписей
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ФактическийПериодДействияЗаписей.НомерСтроки) КАК ФактическийПериодДействияЗаписей
		|				ПО ОсновныеНачисления.НомерСтроки = ФактическийПериодДействияЗаписей.НомерСтроки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеНачисления.Регистратор,
		|			ОсновныеНачисления.ВидУчетаВремени,
		|			ОсновныеНачисления.ДатаНачалаСобытия,
		|			ОсновныеНачисления.ПериодДействияНачало,
		|			ОсновныеНачисления.ПериодДействияКонец,
		|			ОсновныеНачисления.НормаЧасов,
		|			ОсновныеНачисления.НормаДней,
		|			ОсновныеНачисления.НомерСтроки,
		|			ФактическийПериодДействияЗаписей.КалендарныхДней,
		|			ФактическийПериодДействияЗаписей.ДнейЗаСчетРаботодателя) КАК ДанныеУчетаБЛ
		|		ПО ДанныеУчета.НомерСтроки = ДанныеУчетаБЛ.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ДанныеУчета.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	СчетДтРазрез,
		|	СчетДт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат РезультатЗапроса;
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	&ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	&ПериодРегистрации КАК ПериодРегистрации,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.Результат,
		|	ЕСТЬNULL(ОтражениеВУчетеСторно.ПериодДействияНачало, ДанныеУчета.ПериодДействияНачало) КАК ПериодДействияНачало,
		|	ЕСТЬNULL(ОтражениеВУчетеСторно.ПериодДействияКонец, ДанныеУчета.ПериодДействияКонец) КАК ПериодДействияКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.ДатаНачалаСобытия,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ДанныеУчета.ПериодДействия >= &ДатаЗакона255ФЗ
		|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РазмерыММОТ.Размер, 0) * (ЕСТЬNULL(ДанныеФПД.КалендарныхДней, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ДанныеУчета.ПериодДействия, МЕСЯЦ))) КАК ЧИСЛО(10, 2))
		|			КОГДА ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеПериодДействия, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(РазмерыММОТ.Размер, 0) / ДанныеГрафика.ОсновноеЗначениеПериодДействия * ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия, 0) КАК ЧИСЛО(10, 2))
		|		КОНЕЦ, 0) КАК ВПределахММОТ,
		|	ЕСТЬNULL(ДанныеУчетаБЛ.ДоляБЛЗаСчетРаботодателя, 0) КАК ДоляБЛЗаСчетРаботодателя,
		|	ДанныеУчета.ВидРасчета.Наименование,
		|	ЛОЖЬ КАК ЭтоЕНВД,
		|	ОтражениеВУчетеСторно.КодДоходаЕСН КАК КодДоходаЕСН,
		|	ОтражениеВУчетеСторно.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
		|	ОтражениеВУчетеСторно.СчетДт,
		|	ОтражениеВУчетеСторно.СубконтоДт1,
		|	ОтражениеВУчетеСторно.СубконтоДт2,
		|	ОтражениеВУчетеСторно.СубконтоДт3,
		|	ОтражениеВУчетеСторно.СчетКт,
		|	ОтражениеВУчетеСторно.СубконтоКт1,
		|	ОтражениеВУчетеСторно.СубконтоКт2,
		|	ОтражениеВУчетеСторно.СубконтоКт3,
		|	ОтражениеВУчетеСторно.СчетДтНУ,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ1,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ2,
		|	ОтражениеВУчетеСторно.СубконтоДтНУ3,
		|	ОтражениеВУчетеСторно.СчетКтНУ,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ1,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ2,
		|	ОтражениеВУчетеСторно.СубконтоКтНУ3,
		|	ОтражениеВУчетеСторно.СчетКтУСН,
		|	ОтражениеВУчетеСторно.ОтражениеВУСН,
		|	ОтражениеВУчетеСторно.Результат КАК РезультатСторно
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.ФизЛицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ОсновныеНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.Сторно КАК Сторно,
		|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|		И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)) КАК ДанныеУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатыАктуальностиММОТ.Регистратор КАК Регистратор,
		|			ДатыАктуальностиММОТ.НомерСтроки КАК ОсновнойНомерСтроки,
		|			МинимальнаяОплатаТрудаРФ.Размер КАК Размер
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ОсновныеНачисления.Регистратор КАК Регистратор,
		|				ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|				МАКСИМУМ(МинимальнаяОплатаТрудаРФ.Период) КАК ДатаАктуальности
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|					ПО (МинимальнаяОплатаТрудаРФ.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|			ГДЕ
		|				ОсновныеНачисления.Регистратор = &Регистратор
		|				И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|				И (НЕ ОсновныеНачисления.Сторно)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ОсновныеНачисления.НомерСтроки,
		|				ОсновныеНачисления.Регистратор) КАК ДатыАктуальностиММОТ
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|				ПО (МинимальнаяОплатаТрудаРФ.Период = ДатыАктуальностиММОТ.ДатаАктуальности)) КАК РазмерыММОТ
		|		ПО ДанныеУчета.НомерСтроки = РазмерыММОТ.ОсновнойНомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ДанныеГрафика(
		|				ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|					И (НЕ Сторно)
		|					И Регистратор = &Регистратор) КАК ДанныеГрафика
		|		ПО ДанныеУчета.НомерСтроки = ДанныеГрафика.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ФактическийПериодДействияЗаписей.НомерСтроки КАК НомерСтроки,
		|			СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействияЗаписей.ПериодДействияНачало, НАЧАЛОПЕРИОДА(ФактическийПериодДействияЗаписей.ПериодДействияКонец, ДЕНЬ), ДЕНЬ) + 1) КАК КалендарныхДней
		|		ИЗ
		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|					ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|						И (НЕ Сторно)
		|						И Регистратор = &Регистратор) КАК ФактическийПериодДействияЗаписей
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ФактическийПериодДействияЗаписей.НомерСтроки) КАК ДанныеФПД
		|		ПО ДанныеУчета.НомерСтроки = ДанныеФПД.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОсновныеНачисления.Регистратор КАК Регистратор,
		|			ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|			ЕСТЬNULL(ВЫБОР
		|					КОГДА ОсновныеНачисления.ДатаНачалаСобытия >= &ДатаЗакона255ФЗ
		|						ТОГДА ФактическийПериодДействияЗаписей.ДнейЗаСчетРаботодателя / ФактическийПериодДействияЗаписей.КалендарныхДней
		|					КОГДА ВЫБОР
		|							КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|								ТОГДА ОсновныеНачисления.НормаДней
		|							ИНАЧЕ ОсновныеНачисления.НормаЧасов
		|						КОНЕЦ = 0
		|						ТОГДА 0
		|					ИНАЧЕ СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) / ВЫБОР
		|							КОГДА ОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|								ТОГДА ОсновныеНачисления.НормаДней
		|							ИНАЧЕ ОсновныеНачисления.НормаЧасов
		|						КОНЕЦ
		|				КОНЕЦ, 0) КАК ДоляБЛЗаСчетРаботодателя
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ОсновныеНачисления.Регистратор КАК Регистратор,
		|				ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|				ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
		|				ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|				ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|				ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|				ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|				ОсновныеНачисления.НормаДней КАК НормаДней,
		|				ОсновныеНачисления.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|				ОсновныеНачисления.НормаЧасов КАК НормаЧасов
		|			ИЗ
		|				РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ГДЕ
		|				ОсновныеНачисления.Регистратор = &Регистратор
		|				И ОсновныеНачисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|				И РАЗНОСТЬДАТ(ОсновныеНачисления.ДатаНачалаСобытия, ОсновныеНачисления.ПериодДействияНачало, ДЕНЬ) < 2
		|				И ОсновныеНачисления.ДатаНачалаСобытия >= &ДатаЗакона202ФЗ
		|				И (НЕ ОсновныеНачисления.Сторно)) КАК ОсновныеНачисления
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|				ПО ОсновныеНачисления.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|					И ОсновныеНачисления.ВидУчетаВремени = ГрафикиРаботыПоВидамВремени.ВидУчетаВремени
		|					И (ОсновныеНачисления.ПериодДействия < &ДатаЗакона255ФЗ)
		|					И ОсновныеНачисления.ПериодДействияНачало <= ГрафикиРаботыПоВидамВремени.Дата
		|					И (ДОБАВИТЬКДАТЕ(ОсновныеНачисления.ДатаНачалаСобытия, ДЕНЬ, 1) >= ГрафикиРаботыПоВидамВремени.Дата)
		|					И ОсновныеНачисления.ПериодДействияКонец >= ГрафикиРаботыПоВидамВремени.Дата
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ФактическийПериодДействияЗаписей.НомерСтроки КАК НомерСтроки,
		|					СУММА(ВЫБОР
		|							КОГДА ФактическийПериодДействияЗаписей.ПериодДействияНачало = ФактическийПериодДействияЗаписей.ДатаНачалаСобытия
		|								ТОГДА ВЫБОР
		|										КОГДА ФактическийПериодДействияЗаписей.ПериодДействияКонец >= ДОБАВИТЬКДАТЕ(ФактическийПериодДействияЗаписей.ДатаНачалаСобытия, ДЕНЬ, 1)
		|											ТОГДА 2
		|										ИНАЧЕ 1
		|									КОНЕЦ
		|							КОГДА ФактическийПериодДействияЗаписей.ПериодДействияНачало > ДОБАВИТЬКДАТЕ(ФактическийПериодДействияЗаписей.ДатаНачалаСобытия, ДЕНЬ, 1)
		|								ТОГДА 0
		|							ИНАЧЕ 1
		|						КОНЕЦ) КАК ДнейЗаСчетРаботодателя,
		|					СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействияЗаписей.ПериодДействияНачало, НАЧАЛОПЕРИОДА(ФактическийПериодДействияЗаписей.ПериодДействияКонец, ДЕНЬ), ДЕНЬ) + 1) КАК КалендарныхДней
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|							ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|								И (НЕ Сторно)
		|								И Регистратор = &Регистратор
		|								И ДатаНачалаСобытия >= &ДатаЗакона255ФЗ) КАК ФактическийПериодДействияЗаписей
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ФактическийПериодДействияЗаписей.НомерСтроки) КАК ФактическийПериодДействияЗаписей
		|				ПО ОсновныеНачисления.НомерСтроки = ФактическийПериодДействияЗаписей.НомерСтроки
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеНачисления.Регистратор,
		|			ОсновныеНачисления.ВидУчетаВремени,
		|			ОсновныеНачисления.ДатаНачалаСобытия,
		|			ОсновныеНачисления.ПериодДействияНачало,
		|			ОсновныеНачисления.ПериодДействияКонец,
		|			ОсновныеНачисления.НормаЧасов,
		|			ОсновныеНачисления.НормаДней,
		|			ОсновныеНачисления.НомерСтроки,
		|			ФактическийПериодДействияЗаписей.КалендарныхДней,
		|			ФактическийПериодДействияЗаписей.ДнейЗаСчетРаботодателя) КАК ДанныеУчетаБЛ
		|		ПО ДанныеУчета.НомерСтроки = ДанныеУчетаБЛ.НомерСтроки
		|			И ((НЕ ДанныеУчета.Сторно))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтражениеВУчетеСторно КАК ОтражениеВУчетеСторно
		|		ПО ДанныеУчета.НомерСтроки = ОтражениеВУчетеСторно.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ОтражениеВУчетеСторно.СчетДт
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.Текст = ТекстЗапроса;
		
		Возврат Запрос.Выполнить();
		
	КонецЕсли;	
	
КонецФункции  // ПолучитьДанныеУчета

// создает строку таблицы данных учета
// 
// Параметры:
//	ДанныеУчета - спозиционированная выборка по результату запроса
//	НаборЗаписей
//
Функция СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей)
	
	СтрокаДанных = НаборЗаписей.Добавить();
	
	ЗаполнитьЗначенияСвойств(СтрокаДанных,ДанныеУчета,"Результат,ПериодДействияНачало, ПериодДействияКонец, Сторно");
	
	Возврат СтрокаДанных;
	
КонецФункции // СоздатьСтрокуДвижений()

// Формирует соответствие в котором находятся действующие графики сотрудника 
// на указанные даты
Функция ПолучитьГрафикРаботыСотрудника(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	//толик	Запрос.УстановитьПараметр("Физлицо",			ВыборкаПоШапкеДокумента.Физлицо);
	Запрос.УстановитьПараметр("Сотрудник",			ВыборкаПоШапкеДокумента.Сотрудник);
	Запрос.УстановитьПараметр("Дата",				ВыборкаПоШапкеДокумента.ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ВыборкаПоШапкеДокумента.Организация);
	Запрос.УстановитьПараметр("ПоВсемМестамРаботы",	ВыборкаПоШапкеДокумента.ДатаНачалаСобытия >= мДатаЗакона180ФЗ);
	Запрос.УстановитьПараметр("ВидРасчета",			ВыборкаПоШапкеДокумента.ВидРасчета);
	Запрос.УстановитьПараметр("РасчетПоКалендарнымДням",ВыборкаПоШапкеДокумента.ДатаНачалаСобытия >= мДатаЗакона255ФЗ);
	Запрос.УстановитьПараметр("СпособРасчетаВДнях",			ВыборкаПоШапкеДокумента.СпособРасчетаВДнях);
	
	НачМесяца = НачалоМесяца(ДатаНачала);
	ДатыПоМесяцамТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период
	|ПОМЕСТИТЬ ВТДатыПоМесяцам";
	Пока НачМесяца < НачалоМесяца(ДатаОкончания) Цикл
		НачМесяца = НачалоМесяца(КонецМесяца(НачМесяца) + 1);
		ДатыПоМесяцамТекст = ДатыПоМесяцамТекст +"
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	ДатыПоМесяцамТекст = ДатыПоМесяцамТекст + "
	|ИНДЕКСИРОВАТЬ ПО Период";
	
	Запрос.Текст = ДатыПоМесяцамТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписокДат.Период КАК Период,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &Дата
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	//|	ВЫБОР
	////|		КОГДА &РасчетПоКалендарнымДням
	////|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	//|		КОГДА ВЫБОР
	//|				КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &Дата
	//|						И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|					ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	//|				ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	//|			КОНЕЦ
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	////|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	//|	КОНЕЦ КАК ВидУчетаВремени,
	|	ВЫБОР
	|		КОГДА &СпособРасчетаВДнях
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &Дата
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &Дата
	|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацийСрезПоследних.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|	КОНЕЦ КАК ГрафикПолногоРабочегоВремени
	|ПОМЕСТИТЬ ВТСотрудникиДаты
	|ИЗ
	|	ВТДатыПоМесяцам КАК СписокДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&Дата,
	|				Сотрудник = &Сотрудник
	|) КАК РаботникиОрганизацийСрезПоследних
	//
	|		ПО (ИСТИНА)
	//О.Т. Аверсон 22.10.2015 № 657
	//|ГДЕ
	//|	ВЫБОР
	//|			КОГДА РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &Дата
	//|					И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//|				ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	//|			ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
	//|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//О.Т. Аверсон 22.10.2015 № 657 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Сотрудник";
	Запрос.Выполнить();
	
	//заявка №1744 (база заявок Кристалла) Дмитрук О.Г.
	
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПериодыДействия.Период КАК Период,
	//|	ГрафикиРаботыПоВидамВремени.План,
	//|	ПериодыДействия.Сотрудник КАК Сотрудник
	//|ПОМЕСТИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	//|ИЗ
	//|	ВТСотрудникиДаты КАК ПериодыДействия
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	//|		ПО ПериодыДействия.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	//|			И ПериодыДействия.Период = ГрафикиРаботыПоВидамВремени.Месяц
	//|ГДЕ
	//|	ГрафикиРаботыПоВидамВремени.План ЕСТЬ НЕ NULL 
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	Сотрудник";
	//Запрос.Выполнить();
	
	//Запрос.Текст =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПериодыДействия.Период КАК Период,
	//|	ПериодыДействия.Сотрудник КАК Сотрудник
	//|ПОМЕСТИТЬ ВТСводныеИндивидуальныеГрафикиРаботы
	//|ИЗ
	//|	ВТСотрудникиДаты КАК ПериодыДействия
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	//|		ПО ПериодыДействия.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	//|			И ПериодыДействия.Период = СводныеИндивидуальныеГрафики.Месяц
	//|ГДЕ
	//|	СводныеИндивидуальныеГрафики.Сотрудник ЕСТЬ НЕ NULL 
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Период,
	//|	Сотрудник";
	//Запрос.Выполнить();
	
	//заявка №1744
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыДействия.Сотрудник КАК Сотрудник,
	|	ПериодыДействия.Сотрудник.ВидЗанятости КАК ВидЗанятостиСотрудника,
	|	ПериодыДействия.Период КАК Месяц,
	|	ПериодыДействия.ВидУчетаВремени,
	|	ПериодыДействия.ПодразделениеОрганизации,
	|	ПериодыДействия.ГрафикРаботы
	
	//заявка №1744 (база заявок Кристалла) Дмитрук О.Г.
	
	//|	ВЫБОР
	//|		КОГДА ТабелиУчетаВремениПоСотруднику.Период ЕСТЬ NULL 
	//|			ТОГДА ПериодыДействия.ГрафикРаботы
	//|		ИНАЧЕ ПериодыДействия.Сотрудник
	//|	КОНЕЦ КАК ГрафикРаботы
	//|	ВЫБОР
	//|		КОГДА ИндивидуальныеГрафикиРаботы.Период ЕСТЬ NULL 
	//|				И СводныеИндивидуальныеГрафикиРаботы.Период ЕСТЬ NULL 
	//|				И ТабелиУчетаВремениПоСотруднику.Период ЕСТЬ НЕ NULL 
	//|			ТОГДА ПериодыДействия.ГрафикРаботы
	//|		КОГДА ПериодыДействия.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	//|				И (ИндивидуальныеГрафикиРаботы.Период ЕСТЬ НЕ NULL 
	//|					ИЛИ СводныеИндивидуальныеГрафикиРаботы.Период ЕСТЬ НЕ NULL )
	//|			ТОГДА ПериодыДействия.ГрафикПолногоРабочегоВремени
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	//|	КОНЕЦ КАК ГрафикРаботыНорма
	
	//заявка №1744 
	
	|ИЗ
	|	ВТСотрудникиДаты КАК ПериодыДействия
	
	//заявка №1744 (база заявок Кристалла) Дмитрук О.Г.
	
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСводныеИндивидуальныеГрафикиРаботы КАК СводныеИндивидуальныеГрафикиРаботы
	//|		ПО ПериодыДействия.Период = СводныеИндивидуальныеГрафикиРаботы.Период
	//|			И ПериодыДействия.Сотрудник = СводныеИндивидуальныеГрафикиРаботы.Сотрудник
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ИндивидуальныеГрафикиРаботы
	//|		ПО ПериодыДействия.Период = ИндивидуальныеГрафикиРаботы.Период
	//|			И ПериодыДействия.Сотрудник = ИндивидуальныеГрафикиРаботы.Сотрудник
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ТабелиУчетаВремениПоСотруднику
	//|		ПО ПериодыДействия.Период = ТабелиУчетаВремениПоСотруднику.Период
	//|			И ((НЕ ТабелиУчетаВремениПоСотруднику.План))
	//|			И ПериодыДействия.Сотрудник = ТабелиУчетаВремениПоСотруднику.Сотрудник
	
	//заявка №1744
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц,
	|	Сотрудник";
	
	//Возврат Запрос.Выполнить().Выгрузить();
	
	//Аверсон 30.03.2020 КВВ СВФР-005746 (
	ТЗГрафиков = Запрос.Выполнить().Выгрузить();
	ТЗГрафиков.Колонки.Добавить("ГрафикРаботыСотр",Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"));
	
	ИндивГрафикСотр = "";
	З = Новый Запрос;
	З.Текст = "ВЫБРАТЬ
	|		ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК ГрафикРаботы
	|	ИЗ
	|		РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|	ГДЕ
	|		ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|		И ГрафикиРаботыПоВидамВремени.Месяц = &Дата
	|		И ТИПЗНАЧЕНИЯ(ГрафикиРаботыПоВидамВремени.Документ) = ТИП(Документ.ВводИндивидуальныхГрафиковРаботыОрганизации)
	|		СГРУППИРОВАТЬ ПО
	|		ГрафикиРаботыПоВидамВремени.ГрафикРаботы";	
	З.УстановитьПараметр("Сотрудник", ВыборкаПоШапкеДокумента.Сотрудник);
	З.УстановитьПараметр("Дата", НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачалаСобытия));
	РезЗ = З.Выполнить().Выбрать();
	Пока РезЗ.Следующий() Цикл
		ИндивГрафикСотр = РезЗ.ГрафикРаботы;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИндивГрафикСотр) Тогда
		Для Каждого СтрТЗГрафиков ИЗ ТЗГрафиков Цикл
			СтрТЗГрафиков.ГрафикРаботыСотр = ИндивГрафикСотр;
		КонецЦикла;
	КонецЕсли;	
	Возврат ТЗГрафиков;
	//Аверсон 30.03.2020 КВВ СВФР-005746 )	
	
КонецФункции // ПолучитьГрафикРаботыСотрудника()

#Если Клиент Тогда
	
	// Формирует оборот листка нетрудоспособности
	//
	// Параметры
	//	Нет.
	//
	// Возвращаемое значение:
	//	табличный документ
	//
	Функция ПечатьОборотаБольничного()
		
		ДатаСобытия = ПолучитьДатуНачалаСобытия();
		
		Запрос = Новый Запрос;
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		
		// Установим параметры запроса
		Запрос.УстановитьПараметр("Сотрудник",			 Сотрудник);
		Запрос.УстановитьПараметр("ФизЛицо",			 Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("ДокументСсылка",		 Ссылка);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("ДатаНачалаСобытия",	 ДатаСобытия);
		Запрос.УстановитьПараметр("ДатаЗакона255ФЗ",	 мДатаЗакона255ФЗ);
		Запрос.УстановитьПараметр("МесяцСобытия",		 НачалоМесяца(ДатаСобытия));
		Запрос.УстановитьПараметр("ДатаНачала",			 ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания",		 ДатаОкончания);
		Запрос.УстановитьПараметр("ДатаНарушенияРежима", ДатаНарушенияРежима);
		Запрос.УстановитьПараметр("ПустойВидНалогообложения", Справочники.ВидыНалогообложения.ПустаяСсылка());//О.Т. Аверсон 13.07.2016 № 1308
		
		ДанныеОДокументеТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументБЛ.Ссылка,
		|	ДокументБЛ.Сотрудник.Физлицо КАК Физлицо,
		|	ДокументБЛ.Организация,
		|	ВЫРАЗИТЬ(ДокументБЛ.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеОрганизации,
		|	ДокументБЛ.ДатаНачала,
		|	ДокументБЛ.ДатаОкончания,
		|	ДокументБЛ.НомерВходящегоДокумента,
		|	ДокументБЛ.СерияВходящегоДокумента,
		|	ДокументБЛ.ПроцентОплаты,
		|	ВЫБОР
		|		КОГДА ДокументБЛ.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
		|			ТОГДА ""по беременности и родам""
		|		ИНАЧЕ ""по временной нетрудоспособности""
		|	КОНЕЦ КАК ПричинаНетрудоспособности,
		|	ЕСТЬNULL(ФИОФизлица.Фамилия + "" "" + ФИОФизлица.Имя + "" "" + ФИОФизлица.Отчество, ДокументБЛ.Сотрудник.Наименование) КАК ФИОРаботника,
		|	ВЫБОР
		|		КОГДА ДокументБЛ.Сотрудник.Физлицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Женский)
		|			ТОГДА ""Не работала""
		|		ИНАЧЕ ""Не работал""
		|	КОНЕЦ КАК СловаНеРаботал,
		|	ВЫБОР
		|		КОГДА ПараметрыВидаРасчета.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
		|			ТОГДА ПараметрыВидаРасчета.ПериодРасчетаСреднегоЗаработка
		|		ИНАЧЕ 12
		|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработка,
		|	ДокументБЛ.Сотрудник.Код КАК ТабельныйНомер,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность
		|	КОНЕЦ КАК Должность,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.Наименование
		|	КОНЕЦ КАК ПодразделениеНаименование,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность.Наименование
		|	КОНЕЦ КАК ДолжностьНаименование,
		|	ВЫБОР
		|		КОГДА &ДатаНачалаСобытия < &ДатаЗакона255ФЗ
		|				И ЕСТЬNULL(ВЫБОР
		|						КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|								И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
		|						ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
		|					КОНЕЦ, ЛОЖЬ)
		|			ТОГДА ""часов""
		|		ИНАЧЕ ""дней""
		|	КОНЕЦ КАК СловаДней,
		|	ЕСТЬNULL(ГрафикиРаботыПоВидамВремени.ГрафикРаботы, ВЫБОР
		|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
		|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
		|		КОНЕЦ) КАК ГрафикРаботы
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК ДокументБЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо) КАК ФИОФизлица
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчета
		|		ПО (ПараметрыВидаРасчета.Ссылка = ДокументБЛ.ВидРасчета)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК ГрафикРаботы
		|		ИЗ
		|			РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|		ГДЕ
		|			ГрафикиРаботыПоВидамВремени.Месяц = &МесяцСобытия
		|			И ГрафикиРаботыПоВидамВремени.План
		|			И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник) КАК ГрафикиРаботыПоВидамВремени
		|		ПО ДокументБЛ.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
		|ГДЕ
		|	ДокументБЛ.Ссылка = &ДокументСсылка";
		
		ВыходныеДниТекст =
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.Дата
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|	И ГрафикиРаботыПоВидамВремени.План
		|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение = 0
		|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы";
		
		// РазмерММОТ
		//	Поля:
		//		ОсновнойНомерСтроки - номер строки рассчитываемых движений
		//		Размер - размер ММОТ
		//	Описание:
		//		получает размер ММОТ для каждой строки начислений
		//
		РазмерММОТТекст = 
		"ВЫБРАТЬ
		|	ДатыАктуальностиММОТ.НомерСтроки КАК ОсновнойНомерСтроки,
		|	МинимальнаяОплатаТрудаРФ.Размер КАК Размер
		|ИЗ
		|	(ВЫБРАТЬ
		|		Основной.НомерСтроки КАК НомерСтроки,
		|		МАКСИМУМ(МинимальнаяОплатаТрудаРФ.Период) КАК ДатаАктуальности
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|			ПО МинимальнаяОплатаТрудаРФ.Период <= Основной.ПериодДействияНачало
		|	
		|	ГДЕ
		|		Основной.Регистратор = &ДокументСсылка И
		|		Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Основной.НомерСтроки) КАК ДатыАктуальностиММОТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|		ПО МинимальнаяОплатаТрудаРФ.Период = ДатыАктуальностиММОТ.ДатаАктуальности";
		
		// РазмерОграниченияПособия
		//	Поля:
		//		ОсновнойНомерСтроки - номер строки рассчитываемых движений
		//		Размер - размер ограничения
		//	Описание:
		//		получает размер ограничения пособия для каждой строки начислений
		//
		Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
			РазмерОграниченияПособияТекст = 
			"ВЫБРАТЬ
			|	ДатыАктуальности.НомерСтроки КАК ОсновнойНомерСтроки,
			|	РазмерОграниченияПособияПоНетрудоспособности.РазмерПоБеременности КАК Размер
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основной.НомерСтроки КАК НомерСтроки,
			|		МАКСИМУМ(РазмерОграниченияПособияПоНетрудоспособности.Период) КАК ДатаАктуальности
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|			ПО (РазмерОграниченияПособияПоНетрудоспособности.Период <= Основной.ПериодДействияНачало)
			|				И Основной.Организация = РазмерОграниченияПособияПоНетрудоспособности.Организация
			|				И (ВЫБОР
			|					КОГДА Основной.Сотрудник.ВидНалогообложенияОсновной = &ПустойВидНалогообложения
			|						ТОГДА Основной.Организация.ОсновнаяСтавкаНалогообложения
			|					ИНАЧЕ Основной.Сотрудник.ВидНалогообложенияОсновной
			|				КОНЕЦ = РазмерОграниченияПособияПоНетрудоспособности.ВидНалогообложения)
			|	ГДЕ
			|		Основной.Регистратор = &ДокументСсылка
			|		И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Основной.НомерСтроки) КАК ДатыАктуальности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|		ПО (РазмерОграниченияПособияПоНетрудоспособности.Период = ДатыАктуальности.ДатаАктуальности)"; //О.Т. Аверсон 13.07.2016 № 1308
		Иначе
			РазмерОграниченияПособияТекст = 
			"ВЫБРАТЬ
			|	ДатыАктуальности.НомерСтроки КАК ОсновнойНомерСтроки,
			|	РазмерОграниченияПособияПоНетрудоспособности.Размер КАК Размер
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основной.НомерСтроки КАК НомерСтроки,
			|		МАКСИМУМ(РазмерОграниченияПособияПоНетрудоспособности.Период) КАК ДатаАктуальности
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|			ПО (РазмерОграниченияПособияПоНетрудоспособности.Период <= Основной.ПериодДействияНачало)
			|				И Основной.Организация = РазмерОграниченияПособияПоНетрудоспособности.Организация
			|				И (ВЫБОР
			|					КОГДА Основной.Сотрудник.ВидНалогообложенияОсновной = &ПустойВидНалогообложения
			|						ТОГДА Основной.Организация.ОсновнаяСтавкаНалогообложения
			|					ИНАЧЕ Основной.Сотрудник.ВидНалогообложенияОсновной
			|				КОНЕЦ = РазмерОграниченияПособияПоНетрудоспособности.ВидНалогообложения)
			|	ГДЕ
			|		Основной.Регистратор = &ДокументСсылка
			|		И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Основной.НомерСтроки) КАК ДатыАктуальности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|		ПО (РазмерОграниченияПособияПоНетрудоспособности.Период = ДатыАктуальности.ДатаАктуальности)";//О.Т. Аверсон 13.07.2016 № 1308
		КонецЕсли;
		
		СводныеИндивидуальныеГрафикиТекст = 
		"ВЫБРАТЬ
		|	Основной.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			ТОГДА СводныеИндивидуальныеГрафики.Дней
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.Часов
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоВечернимЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.ЧасовВечерних
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.ЧасовНочных
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НормаВремени,
		|	ВЫБОР
		|		КОГДА (НАЧАЛОПЕРИОДА(Основной.ПериодДействияНачало, ДЕНЬ) > Основной.ПериодДействия
		|				ИЛИ КОНЕЦПЕРИОДА(Основной.ПериодДействияКонец, ДЕНЬ) < КОНЕЦПЕРИОДА(Основной.ПериодДействия, МЕСЯЦ))
		|				И СводныеИндивидуальныеГрафики.Дней ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаВводаИндивидуальногоГрафикаРаботы
		|ПОМЕСТИТЬ ВТСводныеИндивидуальныеГрафики
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО Основной.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И СводныеИндивидуальныеГрафики.Месяц = Основной.ПериодДействия
		|ГДЕ
		|	Основной.Регистратор = &ДокументСсылка
		|	И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
		
		Запрос.Текст = СводныеИндивидуальныеГрафикиТекст;
		Запрос.Выполнить();
		СводныеИндивидуальныеГрафикиТекст = "ВТСводныеИндивидуальныеГрафики";
		
		Если ДатаСобытия < мДатаЗакона255ФЗ Тогда
			
			ОграничениеВРазмереММОТТекст = 
			"ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВЫБОР
			|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
			|							ТОГДА 0
			|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
			|					КОНЕЦ = 0
			|					ТОГДА 0
			|				ИНАЧЕ ЕСТЬNULL(РазмерММОТ.Размер, 0) / ВЫБОР
			|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
			|							ТОГДА 0
			|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
			|			КОНЕЦ * ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
			|						ТОГДА ВЫБОР
			|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
			|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
			|								ИНАЧЕ 1
			|							КОНЕЦ
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
			|					ИНАЧЕ 1
			|				КОНЕЦ КОНЕЦ КАК ЧИСЛО(15, 2))";
			
			ОграничениеТекст = 
			"ВЫРАЗИТЬ(ВЫБОР
			|				КОГДА ВЫБОР
			|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
			|							ТОГДА 0
			|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
			|					КОНЕЦ = 0
			|						ТОГДА 0
			|				ИНАЧЕ ЕСТЬNULL(РазмерОграниченияПособия.Размер, 0) / ВЫБОР
			|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
			|							ТОГДА 0
			|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
			|					КОНЕЦ
			|			КОНЕЦ * ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
			|						ТОГДА ВЫБОР
			|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
			|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
			|								ИНАЧЕ 1
			|							КОНЕЦ
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
			|						ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
			|					ИНАЧЕ 1
			|				КОНЕЦ КАК ЧИСЛО(15, 2))";
			
			РасчетПособияТекст = 
			"ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
			|	ВЫБОР
			|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
			|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.НормаДней
			|		ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.НормаЧасов
			|	КОНЕЦ КАК ОплаченоВремени,
			|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1 КАК РазмерВПроцентах,
			|	ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Показатель1 * &Средний / 100 КАК ЧИСЛО(15, 2)) КАК РазмерВРублях,";
			Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
				РасчетПособияТекст = РасчетПособияТекст + "
				|	" + ОграничениеВРазмереММОТТекст + " КАК ОграничениеПособия,"
			ИначеЕсли ЗначениеЗаполнено(ДатаНарушенияРежима) Тогда
				Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
					РасчетПособияТекст = РасчетПособияТекст + "
					|	ВЫБОР
					|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
					|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
					|		ИНАЧЕ " + ОграничениеТекст + "
					|	КОНЕЦ КАК ОграничениеПособия,";
				Иначе
					РасчетПособияТекст = РасчетПособияТекст + "
					|	ВЫБОР
					|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
					|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
					|		ИНАЧЕ ""-""
					|	КОНЕЦ КАК ОграничениеПособия,";
				КонецЕсли;
			ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				РасчетПособияТекст = РасчетПособияТекст + "
				|	" + ОграничениеТекст + " КАК ОграничениеПособия,"
			Иначе
				РасчетПособияТекст = РасчетПособияТекст + "
				|	""-""  КАК ОграничениеПособия,"
			КонецЕсли;
			РасчетПособияТекст = РасчетПособияТекст + "
			|	ОсновныеНачисленияРаботниковОрганизаций.Результат
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		// присоединяем данные о размере пособия
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ДанныеГрафика(
			|		Регистратор = &ДокументСсылка
			|			И ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)) КАК ДанныеГрафика
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = ДанныеГрафика.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = СводныеИндивидуальныеГрафики.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерММОТТекст + ") КАК РазмерММОТ
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерММОТ.ОсновнойНомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерОграниченияПособияТекст + ") КАК РазмерОграниченияПособия
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерОграниченияПособия.ОсновнойНомерСтроки
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
			|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПериодДействияНачало";
			
		Иначе
			
			ОграничениеВРазмереММОТТекст = 
			"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерММОТ.Размер, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, МЕСЯЦ)) * ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
			|						ТОГДА ВЫБОР
			|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
			|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
			|								ИНАЧЕ 1
			|							КОНЕЦ
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
			|				ИНАЧЕ 1
			|			КОНЕЦ КАК ЧИСЛО(15, 2))";
			
			ОграничениеТекст = 
			"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерОграниченияПособия.Размер, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, МЕСЯЦ)) * ВЫБОР
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
			|						ТОГДА ВЫБОР
			|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
			|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
			|								ИНАЧЕ 1
			|							КОНЕЦ
			|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
			|				ИНАЧЕ 1
			|			КОНЕЦ КАК ЧИСЛО(15, 2))";
			
			РасчетПособияТекст = 
			"ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
			|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
			|	КалендарныеДниПособия.ОплачиватьДнейПособия КАК ОплаченоВремени,
			|	ОсновныеНачисленияРаботниковОрганизаций.Показатель1 КАК РазмерВПроцентах,
			|	ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Показатель1 * &Средний / 100 КАК ЧИСЛО(15, 2)) КАК РазмерВРублях,";
			Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
				РасчетПособияТекст = РасчетПособияТекст + "
				|	" + ОграничениеВРазмереММОТТекст + " КАК ОграничениеПособия,"
			ИначеЕсли ЗначениеЗаполнено(ДатаНарушенияРежима) Тогда
				Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
					РасчетПособияТекст = РасчетПособияТекст + "
					|	ВЫБОР
					|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
					|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
					|		ИНАЧЕ " + ОграничениеТекст + "
					|	КОНЕЦ КАК ОграничениеПособия,";
				Иначе
					РасчетПособияТекст = РасчетПособияТекст + "
					|	ВЫБОР
					|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
					|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
					|		ИНАЧЕ ""-""
					|	КОНЕЦ КАК ОграничениеПособия,";
				КонецЕсли;
			ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				РасчетПособияТекст = РасчетПособияТекст + "
				|	" + ОграничениеТекст + " КАК ОграничениеПособия,"
			Иначе
				РасчетПособияТекст = РасчетПособияТекст + "
				|	""-""  КАК ОграничениеПособия,"
			КонецЕсли;
			РасчетПособияТекст = РасчетПособияТекст + "
			|	ОсновныеНачисленияРаботниковОрганизаций.Результат
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ФактическийПериодДействия.НомерСтроки КАК НомерСтроки,
			|			СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействия.ПериодДействияНачало, ДОБАВИТЬКДАТЕ(ФактическийПериодДействия.ПериодДействияКонец, СЕКУНДА, 1), ДЕНЬ)) КАК ОплачиватьДнейПособия
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
			|				ВидРасчета.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС))
			|				    И Регистратор = &ДокументСсылка) КАК ФактическийПериодДействия
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ФактическийПериодДействия.Регистратор,
			|			ФактическийПериодДействия.НомерСтроки) КАК КалендарныеДниПособия
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = КалендарныеДниПособия.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерММОТТекст + ") КАК РазмерММОТ
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерММОТ.ОсновнойНомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерОграниченияПособияТекст + ") КАК РазмерОграниченияПособия
			|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерОграниченияПособия.ОсновнойНомерСтроки
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
			|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПериодДействияНачало";
		КонецЕсли;
		
		ОтражениеТекст = 
		"ВЫБРАТЬ
		|	БУОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	БУОсновныеНачисления.ПериодДействияКонец,
		|	СУММА(БУОсновныеНачисления.Результат) КАК Результат,
		|	РАЗНОСТЬДАТ(БУОсновныеНачисления.ПериодДействияНачало, БУОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК ДнейПериода,
		|	БУОсновныеНачисления.СчетДт.Код,
		|	БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
		|	БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
		|	БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА БУОсновныеНачисления.ОтражениеВУСН
		|		ИНАЧЕ БУОсновныеНачисления.СчетДтНУ.Код
		|	КОНЕЦ КАК СчетДтНУКод,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = БУОсновныеНачисления.ПериодДействия
		|			И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И (БУОсновныеНачисления.ПериодДействияНачало МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ПериодДействияКонец МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ПериодРегистрации <= &ПериодРегистрации)
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
		|	И (НЕ ОсновныеНачисленияРаботниковОрганизаций.Сторно)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = &ВидРасчетаКОплате
		|
		|СГРУППИРОВАТЬ ПО
		|	БУОсновныеНачисления.ПериодДействияНачало,
		|	БУОсновныеНачисления.ПериодДействияКонец,
		|	БУОсновныеНачисления.СубконтоДт3,
		|	БУОсновныеНачисления.СубконтоДтНУ1,
		|	БУОсновныеНачисления.СубконтоДтНУ2,
		|	БУОсновныеНачисления.СубконтоДтНУ3,
		|	БУОсновныеНачисления.СчетДт.Код,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА БУОсновныеНачисления.ОтражениеВУСН
		|		ИНАЧЕ БУОсновныеНачисления.СчетДтНУ.Код
		|	КОНЕЦ,
		|	БУОсновныеНачисления.СубконтоДт1,
		|	БУОсновныеНачисления.СубконтоДт2,
		|	БУОсновныеНачисления.СубконтоДт3
		|
		|ИМЕЮЩИЕ
		|	СУММА(БУОсновныеНачисления.Результат) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДействияНачало";
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПоБольничномуЛисту_ОборотЛисткаНетрудоспособности";
		
		Макет = ПолучитьМакет("ОборотЛисткаНетрудоспособности");
		СекцияШапка = Макет.ПолучитьОбласть("Шапка");
		СекцияРасчетПособияШапка = Макет.ПолучитьОбласть("РасчетПособияШапка");
		СекцияРасчетПособияСтрока = Макет.ПолучитьОбласть("РасчетПособияСтрока");
		СекцияРасчетПособияИтог = Макет.ПолучитьОбласть("РасчетПособияИтог");
		СекцияОтражениеПособияСтрока = Макет.ПолучитьОбласть("ОтражениеПособияСтрока");
		
		// определим налоговый режим
		БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете"), КонецМесяца(ПериодРегистрации), Организация);
		УчетнаяПолитика = глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете")[КонецМесяца(ПериодРегистрации)][Организация];
		мУСН = УчетнаяПолитика.УСН;
		мОбъектНалогообложенияУСН = УчетнаяПолитика.ОбъектНалогообложенияУСН;
		мЕНВД = УчетнаяПолитика.ОрганизацияЯвляетсяПлательщикомЕНВД;
		мФСС_БЛ = УчетнаяПолитика.УплачиватьДобровольныеВзносыВФСС;
		
		ЭтоПереходныйПериодПоЗакону255ФЗ = ДатаСобытия < мДатаЗакона255ФЗ И ДатаОкончания >= мДатаЗакона255ФЗ И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве;
		
		Запрос.Текст = ДанныеОДокументеТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СекцияШапка.Параметры,Выборка);
		ЗаполнитьЗначенияСвойств(СекцияРасчетПособияШапка.Параметры,Выборка);
		ГрафикРаботы = Выборка.ГрафикРаботы;
		ПериодРасчетаСреднегоЗаработка = Выборка.ПериодРасчетаСреднегоЗаработка;
		ЛетСтажа	= 0;
		МесяцевСтажа= 0;
		ДнейСтажа	= 0;
		ДатаНепрерывногоСтажа = ПроведениеРасчетов.ПолучитьНачалоСтажаДляБольничногоЛиста(ДатаСобытия, Сотрудник.Физлицо, Организация);
		Если ЗначениеЗаполнено(ДатаНепрерывногоСтажа) Тогда
			ОбщегоНазначения.РазобратьРазностьДат(ДатаСобытия, ДатаНепрерывногоСтажа, ЛетСтажа, МесяцевСтажа, ДнейСтажа);
		КонецЕсли;
		СекцияШапка.Параметры.НазваниеСтажа = ?(ДатаСобытия < мДатаЗакона255ФЗ,"Непрерывный","Страховой");
		СекцияШапка.Параметры.ЛетСтажа = ЛетСтажа;
		СекцияШапка.Параметры.ПодписьЛетСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("год","года","лет",ЛетСтажа);
		СекцияШапка.Параметры.МесяцевСтажа = МесяцевСтажа;
		СекцияШапка.Параметры.ПодписьМесяцевСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("месяц","месяца","месяцев",МесяцевСтажа);
		СекцияШапка.Параметры.ДнейСтажа = ДнейСтажа;
		СекцияШапка.Параметры.ПодписьДнейСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("день","дня","дней",ДнейСтажа);
		
		ДатыВыходныхДней = "";
		Если ДатаСобытия < мДатаЗакона255ФЗ Тогда
			Запрос.УстановитьПараметр("ГрафикРаботы" , ГрафикРаботы);
			Запрос.Текст = ВыходныеДниТекст;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДатыВыходныхДней = ДатыВыходныхДней + ?(ДатыВыходныхДней = "","","; ") + Формат(Выборка.Дата,"ДЛФ=DD")
			КонецЦикла;
		КонецЕсли;
		СекцияШапка.Параметры.НазваниеДней =  ?(ДатаСобытия < мДатаЗакона255ФЗ,"рабочих","календарных");
		СекцияШапка.Параметры.РабочихДней = ДнейОплаты - ?(ДатаСобытия < мДатаЗакона255ФЗ,Выборка.Количество(),0);
		СекцияШапка.Параметры.ДатыВыходныхДней = ДатыВыходныхДней;
		ТабДокумент.Вывести(СекцияШапка);
		
		СтруктураПоказателей = Неопределено;
		СписокСоставляющихСреднегоЗаработка = Неопределено;
		Если ЭтоПереходныйПериодПоЗакону255ФЗ Тогда
			СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
			СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
			СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямБЛ;
			СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииБЛ;
			СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямБЛ;
			СписокСоставляющихСреднегоЗаработка[4] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииБЛ;
		КонецЕсли;
		ПечатьРасчетаСреднегоЗаработкаОтчет = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаСобытия, ПериодРасчетаСреднегоЗаработка, "", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС, ?(ДатаСобытия < мДатаЗакона255ФЗ, Неопределено, Ложь), СписокСоставляющихСреднегоЗаработка, Ложь, Ложь, СтруктураПоказателей);
		ОбластьПрямоугольная = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, 1, ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы, ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы);
		НачалоНовогоФорматаСтрок = ТабДокумент.ВысотаТаблицы + 1;
		ТабДокумент.Область(НачалоНовогоФорматаСтрок, , НачалоНовогоФорматаСтрок + ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		Для Счетчик = 1 По ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы Цикл
			ТабДокумент.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТабДокумент.ВставитьОбласть(ОбластьПрямоугольная, ТабДокумент.Область(НачалоНовогоФорматаСтрок, 1));
		
		ТабДокумент.Вывести(СекцияРасчетПособияШапка);
		если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
			Запрос.УстановитьПараметр("Средний",Окр(СтруктураПоказателей.Средний,2));
		иначе
			Запрос.УстановитьПараметр("Средний",ОбщегоНазначения.ОкруглитьЗначение2016(СтруктураПоказателей.Средний,ПериодРегистрации));//О.Т. Аверсон 15.03.2016 № 949
		КонецЕсли;
		
		Запрос.Текст = РасчетПособияТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		НачисленоВсего = 0;
		Пока Выборка.Следующий() Цикл
			НачисленоВсего = НачисленоВсего + Выборка.Результат;
			ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока.Параметры,Выборка);
			ТабДокумент.Вывести(СекцияРасчетПособияСтрока);
		КонецЦикла;
		
		СекцияРасчетПособияИтог.Параметры.НачисленоВсегоПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(НачисленоВсего, Константы.ВалютаРегламентированногоУчета.Получить());
		СекцияРасчетПособияИтог.Параметры.ПериодРегистрации = ПериодРегистрации;
		ТабДокумент.Вывести(СекцияРасчетПособияИтог);
		
		Запрос.Текст = ОтражениеТекст;
		Запрос.УстановитьПараметр("УСН",мУСН);
		Запрос.УстановитьПараметр("ВидРасчетаКОплате", ВидРасчета);
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		
		Результат = Запрос.Выполнить();
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтражениеВУчетеШапка"));
		Если Результат.Пустой() Тогда
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("НетДанных"));
		Иначе
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтражениеПособияШапка"));
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(СекцияОтражениеПособияСтрока.Параметры,Выборка);
				
				СекцияОтражениеПособияСтрока.Параметры.СтрокаСубконтоБУ = ?(ЗначениеЗаполнено(Выборка.СубконтоДт1),Строка(Выборка.СубконтоДт1),"") +
				?(ЗначениеЗаполнено(Выборка.СубконтоДт2), Символы.ПС + Строка(Выборка.СубконтоДт2),"") + 
				?(ЗначениеЗаполнено(Выборка.СубконтоДт3), Символы.ПС+ Строка(Выборка.СубконтоДт3),"") ; 
				СекцияОтражениеПособияСтрока.Параметры.СтрокаСубконтоНУ = ?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ1),Строка(Выборка.СубконтоДтНУ1),"") +
				?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ2), Символы.ПС + Строка(Выборка.СубконтоДтНУ2),"") + 
				?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ3), Символы.ПС + Строка(Выборка.СубконтоДтНУ3),""); 
				
				ТабДокумент.Вывести(СекцияОтражениеПособияСтрока);
				
			КонецЦикла;
		КонецЕсли;
		
		Возврат	ТабДокумент
		
	КонецФункции // ПечатьОборотаБольничного()
	
	// Формирует оборот листка нетрудоспособности
	//
	// Параметры
	//  нет
	//
	// Возвращаемое значение:
	//   табличный документ
	//
	Функция ПечатьОборотаБольничногоВПереходныйПериод2007()
		
		ДатаСобытия = ПолучитьДатуНачалаСобытия();
		
		ДанныеОДокументеТекст = 
		"ВЫБРАТЬ
		|	Документ.Ссылка,
		|	Документ.Сотрудник.Физлицо КАК Физлицо,
		|	Документ.Организация,
		|	ВЫРАЗИТЬ(Документ.Организация.НаименованиеПолное КАК СТРОКА(300)) КАК НаименованиеОрганизации,
		|	Документ.ДатаНачала,
		|	Документ.ДатаОкончания,
		|	Документ.НомерВходящегоДокумента,
		|	Документ.СерияВходящегоДокумента,
		|	Документ.ПроцентОплаты,
		|	ВЫБОР
		|		КОГДА Документ.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
		|			ТОГДА ""по беременности и родам""
		|		ИНАЧЕ ""по временной нетрудоспособности""
		|	КОНЕЦ КАК ПричинаНетрудоспособности,
		|	ЕСТЬNULL(ФИОФизлица.Фамилия + "" "" + ФИОФизлица.Имя + "" "" + ФИОФизлица.Отчество, Документ.Сотрудник.Физлицо.Наименование) КАК ФИОРаботника,
		|	ВЫБОР
		|		КОГДА Документ.Сотрудник.Физлицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Женский)
		|			ТОГДА ""Не работала""
		|		ИНАЧЕ ""Не работал""
		|	КОНЕЦ КАК СловаНеРаботал,
		|	ВЫБОР
		|		КОГДА ПараметрыВидаРасчета.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ЗНАЧЕНИЕ(Перечисление.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоКолдоговору)
		|			ТОГДА ПараметрыВидаРасчета.ПериодРасчетаСреднегоЗаработка
		|		ИНАЧЕ 12
		|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработка,
		|	Документ.Сотрудник.Код КАК ТабельныйНомер,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность
		|	КОНЕЦ КАК Должность,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.Наименование
		|	КОНЕЦ КАК ПодразделениеНаименование,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность.Наименование
		|	КОНЕЦ КАК ДолжностьНаименование,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЫБОР
		|					КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|							И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
		|					ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
		|				КОНЕЦ, ЛОЖЬ)
		|			ТОГДА ""часов""
		|		ИНАЧЕ ""дней""
		|	КОНЕЦ КАК СловаДней,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
		|	КОНЕЦ КАК ГрафикРаботы,
		|	Документ.ПроцентОплатыПереходногоПериода
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо) КАК ФИОФизлица
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчета
		|		ПО (ПараметрыВидаРасчета.Ссылка = Документ.ВидРасчета)
		|ГДЕ
		|	Документ.Ссылка = &ДокументСсылка";
		
		ВыходныеДниТекст =
		"ВЫБРАТЬ
		|	ГрафикиРаботыПоВидамВремени.Дата
		|ИЗ
		|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
		|ГДЕ
		|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение = 0
		|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &ГрафикРаботы";
		
		// РазмерММОТ
		//	Поля:
		//		ОсновнойНомерСтроки - номер строки рассчитываемых движений
		//		Размер - размер ММОТ
		//	Описание:
		//		получает размер ММОТ для каждой строки начислений
		//
		РазмерММОТТекст = 
		"ВЫБРАТЬ
		|	ДатыАктуальностиММОТ.НомерСтроки КАК ОсновнойНомерСтроки,
		|	МинимальнаяОплатаТрудаРФ.Размер КАК Размер
		|ИЗ
		|	(ВЫБРАТЬ
		|		Основной.НомерСтроки КАК НомерСтроки,
		|		МАКСИМУМ(МинимальнаяОплатаТрудаРФ.Период) КАК ДатаАктуальности
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|			ПО МинимальнаяОплатаТрудаРФ.Период <= Основной.ПериодДействияНачало
		|	ГДЕ
		|		Основной.Регистратор = &ДокументСсылка
		|		И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Основной.НомерСтроки) КАК ДатыАктуальностиММОТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|		ПО МинимальнаяОплатаТрудаРФ.Период = ДатыАктуальностиММОТ.ДатаАктуальности";
		
		// РазмерОграниченияПособия
		//	Поля:
		//		ОсновнойНомерСтроки - номер строки рассчитываемых движений
		//		Размер - размер ограничения
		//	Описание:
		//		получает размер ограничения пособия для каждой строки начислений
		//
		Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
			РазмерОграниченияПособияТекст = 
			"ВЫБРАТЬ
			|	ДатыАктуальности.НомерСтроки КАК ОсновнойНомерСтроки,
			|	РазмерОграниченияПособияПоНетрудоспособности.РазмерПоБеременности КАК Размер
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основной.НомерСтроки КАК НомерСтроки,
			|		МАКСИМУМ(РазмерОграниченияПособияПоНетрудоспособности.Период) КАК ДатаАктуальности
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|			ПО (РазмерОграниченияПособияПоНетрудоспособности.Период <= Основной.ПериодДействияНачало)
			|				И Основной.Организация = РазмерОграниченияПособияПоНетрудоспособности.Организация
			|				И (ВЫБОР
			|					КОГДА Основной.Сотрудник.ВидНалогообложенияОсновной = &ПустойВидНалогообложения
			|						ТОГДА Основной.Организация.ОсновнаяСтавкаНалогообложения
			|					ИНАЧЕ Основной.Сотрудник.ВидНалогообложенияОсновной
			|				КОНЕЦ = РазмерОграниченияПособияПоНетрудоспособности.ВидНалогообложения)
			|	ГДЕ
			|		Основной.Регистратор = &ДокументСсылка
			|		И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Основной.НомерСтроки) КАК ДатыАктуальности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|		ПО (РазмерОграниченияПособияПоНетрудоспособности.Период = ДатыАктуальности.ДатаАктуальности)"; //О.Т. Аверсон 13.07.2016 № 1308
		Иначе
			РазмерОграниченияПособияТекст = 
			"ВЫБРАТЬ
			|	ДатыАктуальности.НомерСтроки КАК ОсновнойНомерСтроки,
			|	РазмерОграниченияПособияПоНетрудоспособности.Размер КАК Размер
			|ИЗ
			|	(ВЫБРАТЬ
			|		Основной.НомерСтроки КАК НомерСтроки,
			|		МАКСИМУМ(РазмерОграниченияПособияПоНетрудоспособности.Период) КАК ДатаАктуальности
			|	ИЗ
			|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|			ПО (РазмерОграниченияПособияПоНетрудоспособности.Период <= Основной.ПериодДействияНачало)
			|				И Основной.Организация = РазмерОграниченияПособияПоНетрудоспособности.Организация
			|				И (ВЫБОР
			|					КОГДА Основной.Сотрудник.ВидНалогообложенияОсновной = &ПустойВидНалогообложения
			|						ТОГДА Основной.Организация.ОсновнаяСтавкаНалогообложения
			|					ИНАЧЕ Основной.Сотрудник.ВидНалогообложенияОсновной
			|				КОНЕЦ = РазмерОграниченияПособияПоНетрудоспособности.ВидНалогообложения)
			|	ГДЕ
			|		Основной.Регистратор = &ДокументСсылка
			|		И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Основной.НомерСтроки) КАК ДатыАктуальности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерОграниченияПособияПоНетрудоспособности КАК РазмерОграниченияПособияПоНетрудоспособности
			|		ПО (РазмерОграниченияПособияПоНетрудоспособности.Период = ДатыАктуальности.ДатаАктуальности)"; //О.Т. Аверсон 13.07.2016 № 1308
		КонецЕсли;
		
		СводныеИндивидуальныеГрафикиТекст = 
		"ВЫБРАТЬ
		|	Основной.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			ТОГДА СводныеИндивидуальныеГрафики.Дней
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.Часов
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоВечернимЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.ЧасовВечерних
		|		КОГДА Основной.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоНочнымЧасам)
		|			ТОГДА СводныеИндивидуальныеГрафики.ЧасовНочных
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НормаВремени,
		|	ВЫБОР
		|		КОГДА (НАЧАЛОПЕРИОДА(Основной.ПериодДействияНачало, ДЕНЬ) > Основной.ПериодДействия
		|				ИЛИ КОНЕЦПЕРИОДА(Основной.ПериодДействияКонец, ДЕНЬ) < КОНЕЦПЕРИОДА(Основной.ПериодДействия, МЕСЯЦ))
		|				И СводныеИндивидуальныеГрафики.Дней ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОшибкаВводаИндивидуальногоГрафикаРаботы
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК Основной
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
		|		ПО Основной.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
		|			И СводныеИндивидуальныеГрафики.Месяц = Основной.ПериодДействия
		|ГДЕ
		|	Основной.Регистратор = &ДокументСсылка
		|	И Основной.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)";
		
		РазмерВРубляхТекст = 
		"ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 0
		|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|			КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 50
		|				ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|			ИНАЧЕ &ПроцентОплаты
		|		КОНЕЦ * &Средний / 100 КАК ЧИСЛО(15, 2))";
		
		ОплачиваемоеВремяТекст = 
		"ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.НормаДней
		|		ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.НормаЧасов
		|	КОНЕЦ";
		
		ВремяЗаМесяцТекст = 
		"ВЫБОР
		|	КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
		|		ТОГДА 0
		|	ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
		|КОНЕЦ";
		
		ОграничениеВРазмереММОТТекст = 
		"ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
		|							ТОГДА 0
		|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
		|					КОНЕЦ = 0
		|					ТОГДА 0
		|				ИНАЧЕ ЕСТЬNULL(РазмерММОТ.Размер, 0) / ВЫБОР
		|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
		|							ТОГДА 0
		|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
		|			КОНЕЦ * ВЫБОР
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|						ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|					ИНАЧЕ 1
		|				КОНЕЦ КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		ОграничениеВРазмереММОТЗаМесяцТекст = 
		"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерММОТ.Размер, 0) * ВЫБОР
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		ОграничениеТекст = 
		"ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
		|							ТОГДА 0
		|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
		|					КОНЕЦ = 0
		|						ТОГДА 0
		|				ИНАЧЕ ЕСТЬNULL(РазмерОграниченияПособия.Размер, 0) / ВЫБОР
		|						КОГДА ЕСТЬNULL(СводныеИндивидуальныеГрафики.ОшибкаВводаИндивидуальногоГрафикаРаботы, ЛОЖЬ)
		|							ТОГДА 0
		|						ИНАЧЕ ЕСТЬNULL(СводныеИндивидуальныеГрафики.НормаВремени, ЕСТЬNULL(ДанныеГрафика.ОсновноеЗначениеНормаПериодДействия, 0))
		|					КОНЕЦ
		|			КОНЕЦ * ВЫБОР
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|						ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|					ИНАЧЕ 1
		|				КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		ОграничениеЗаМесяцТекст = 
		"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерОграниченияПособия.Размер, 0) * ВЫБОР
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|						ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|					ИНАЧЕ 1
		|				КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		
		
		РасчетПособияТекст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.НормаДней
		|		ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.НормаЧасов
		|	КОНЕЦ КАК ОплаченоВремени,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 0
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 50
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		ИНАЧЕ ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Документ.НачислениеПоБольничномуЛисту).ПроцентОплаты
		|	КОНЕЦ КАК РазмерВПроцентах,
		|	" + РазмерВРубляхТекст + " КАК РазмерВРублях,";
		Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
			РасчетПособияТекст = РасчетПособияТекст + "
			|	ВЫБОР
			|		КОГДА " + РазмерВРубляхТекст + " < " + ОграничениеВРазмереММОТТекст + "
			|			ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
			|		КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
			|			ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
			|		ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
			|	КОНЕЦ  КАК РасчетныйРезультат,
			|	" + ОграничениеВРазмереММОТТекст + " КАК ОграничениеПособия,"
		ИначеЕсли ЗначениеЗаполнено(ДатаНарушенияРежима) Тогда
			Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				РасчетПособияТекст = РасчетПособияТекст + "
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА ВЫБОР
				|					КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеВРазмереММОТТекст + ")
				|						ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|					КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|						ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
				|					ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеТекст + ")
				|					ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|					ТОГДА " + ОграничениеЗаМесяцТекст + "
				|				ИНАЧЕ " + ОграничениеТекст + " * " + ОплачиваемоеВремяТекст + "
				|			КОНЕЦ
				|	КОНЕЦ КАК РасчетныйРезультат,
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
				|		ИНАЧЕ " + ОграничениеТекст + "
				|	КОНЕЦ  КАК ОграничениеПособия,"
			Иначе
				РасчетПособияТекст = РасчетПособияТекст + "
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА ВЫБОР
				|					КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеВРазмереММОТТекст + ")
				|						ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|					КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|						ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
				|					ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОНЕЦ
				|		ИНАЧЕ " + РазмерВРубляхТекст + " 
				|	КОНЕЦ КАК РасчетныйРезультат,
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
				|		ИНАЧЕ ""-""
				|	КОНЕЦ  КАК ОграничениеПособия,"
			КонецЕсли;
		ИначеЕсли ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
			РасчетПособияТекст = РасчетПособияТекст + "
			|	ВЫБОР
			|		КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеТекст + ")
			|			ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
			|		КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
			|			ТОГДА " + ОграничениеЗаМесяцТекст + "
			|		ИНАЧЕ " + ОграничениеТекст + " * " + ОплачиваемоеВремяТекст + "
			|	КОНЕЦ КАК РасчетныйРезультат,
			|	" + ОграничениеТекст + " КАК ОграничениеПособия,"
		Иначе
			РасчетПособияТекст = РасчетПособияТекст + "
			|	" + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + " КАК РасчетныйРезультат,
			|	""-""  КАК ОграничениеПособия,"
		КонецЕсли;
		РасчетПособияТекст = РасчетПособияТекст + "
		|	ОсновныеНачисленияРаботниковОрганизаций.Результат
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ДанныеГрафика(
		|		Регистратор = &ДокументСсылка
		|			И ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)) КАК ДанныеГрафика
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = ДанныеГрафика.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + СводныеИндивидуальныеГрафикиТекст + ") КАК СводныеИндивидуальныеГрафики
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = СводныеИндивидуальныеГрафики.НомерСтроки
		|		// присоединяем данные о размере пособия
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерММОТТекст + ") КАК РазмерММОТ
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерММОТ.ОсновнойНомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерОграниченияПособияТекст + ") КАК РазмерОграниченияПособия
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерОграниченияПособия.ОсновнойНомерСтроки
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДействияНачало";
		
		РазмерВРубляхТекст = 
		"ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 0
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 50
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		ИНАЧЕ &ПроцентОплатыПереходногоПериода
		|	КОНЕЦ * &СреднийПП / 100 КАК ЧИСЛО(15, 2))";
		
		ОграничениеВРазмереММОТТекст = 
		"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерММОТ.Размер, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, МЕСЯЦ)) * ВЫБОР
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		ОграничениеТекст = 
		"ВЫРАЗИТЬ(ЕСТЬNULL(РазмерОграниченияПособия.Размер, 0) / ДЕНЬ(КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, МЕСЯЦ)) * ВЫБОР
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.КодПоОКАТО <> """"
		|						ТОГДА ВЫБОР
		|								КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ > 1
		|								ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПодразделениеОрганизации.РайонныйКоэффициентРФ
		|								ИНАЧЕ 1
		|							КОНЕЦ
		|				КОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ > 1
		|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение.РайонныйКоэффициентРФ
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 2))";
		
		ОплачиваемоеВремяТекст = 
		"КалендарныеДниПособия.ОплачиватьДнейПособия";
		
		ВремяЗаМесяцТекст = 
		"ДЕНЬ(КОНЕЦПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, МЕСЯЦ))";
		
		РасчетПособияТекстПП = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
		|	КалендарныеДниПособия.ОплачиватьДнейПособия КАК ОплаченоВремениПП,
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 0
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1 = 50
		|			ТОГДА ОсновныеНачисленияРаботниковОрганизаций.Показатель1
		|		ИНАЧЕ ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Регистратор КАК Документ.НачислениеПоБольничномуЛисту).ПроцентОплатыПереходногоПериода
		|	КОНЕЦ КАК РазмерВПроцентахПП,
		|	" + РазмерВРубляхТекст + " КАК РазмерВРубляхПП,";
		Если ОграничениеПособияПереходногоПериода =Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ Тогда
			РасчетПособияТекстПП = РасчетПособияТекстПП + "
			|	ВЫБОР
			|		КОГДА " + РазмерВРубляхТекст + " < " + ОграничениеВРазмереММОТТекст + "
			|			ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
			|		КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
			|			ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
			|		ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
			|	КОНЕЦ  КАК РасчетныйРезультатПП,
			|	" + ОграничениеВРазмереММОТТекст + " КАК ОграничениеПособияПП,"
		ИначеЕсли ЗначениеЗаполнено(ДатаНарушенияРежима) Тогда
			Если ОграничениеПособияПереходногоПериода =Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
				РасчетПособияТекстПП = РасчетПособияТекстПП + "
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА ВЫБОР
				|					КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеВРазмереММОТТекст + ")
				|						ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|					КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|						ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
				|					ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеТекст + ")
				|					ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|					ТОГДА " + ОграничениеЗаМесяцТекст + "
				|				ИНАЧЕ " + ОграничениеТекст + " * " + ОплачиваемоеВремяТекст + "
				|			КОНЕЦ
				|	КОНЕЦ КАК РасчетныйРезультатПП,
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
				|		ИНАЧЕ " + ОграничениеТекст + "
				|	КОНЕЦ  КАК ОграничениеПособияПП,"
			Иначе
				РасчетПособияТекстПП = РасчетПособияТекстПП + "
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА ВЫБОР
				|					КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеВРазмереММОТТекст + ")
				|						ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
				|					КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
				|						ТОГДА " + ОграничениеВРазмереММОТЗаМесяцТекст + "
				|					ИНАЧЕ " + ОграничениеВРазмереММОТТекст + " * " + ОплачиваемоеВремяТекст + "
				|				КОНЕЦ
				|		ИНАЧЕ " + РазмерВРубляхТекст + " 
				|	КОНЕЦ КАК РасчетныйРезультатПП,
				|	ВЫБОР
				|		КОГДА &ДатаНарушенияРежима <= ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало
				|			ТОГДА " + ОграничениеВРазмереММОТТекст + "
				|		ИНАЧЕ ""-""
				|	КОНЕЦ  КАК ОграничениеПособияПП,"
			КонецЕсли;
		ИначеЕсли ОграничениеПособияПереходногоПериода =Перечисления.ВидыОграниченияПособия.ОбщееОграничение Тогда
			РасчетПособияТекстПП = РасчетПособияТекстПП + "
			|	ВЫБОР
			|		КОГДА (" + РазмерВРубляхТекст + ") < (" + ОграничениеТекст + ")
			|			ТОГДА " + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + "
			|		КОГДА " + ОплачиваемоеВремяТекст + " = " + ВремяЗаМесяцТекст + "
			|			ТОГДА " + ОграничениеЗаМесяцТекст + "
			|		ИНАЧЕ " + ОграничениеТекст + " * " + ОплачиваемоеВремяТекст + "
			|	КОНЕЦ КАК РасчетныйРезультатПП,
			|	" + ОграничениеТекст + " КАК ОграничениеПособияПП,"
		Иначе
			РасчетПособияТекстПП = РасчетПособияТекстПП + "
			|	" + РазмерВРубляхТекст + " * " + ОплачиваемоеВремяТекст + " КАК РасчетныйРезультатПП,
			|	""-""  КАК ОграничениеПособияПП,"
		КонецЕсли;
		РасчетПособияТекстПП = РасчетПособияТекстПП + "
		|	ОсновныеНачисленияРаботниковОрганизаций.Результат
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ФактическийПериодДействия.НомерСтроки КАК НомерСтроки,
		|			СУММА(РАЗНОСТЬДАТ(ФактическийПериодДействия.ПериодДействияНачало, ДОБАВИТЬКДАТЕ(ФактическийПериодДействия.ПериодДействияКонец, СЕКУНДА, 1), ДЕНЬ)) КАК ОплачиватьДнейПособия
		|		ИЗ
		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
		|				ВидРасчета.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС))
		|				    И Регистратор = &ДокументСсылка) КАК ФактическийПериодДействия
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ФактическийПериодДействия.Регистратор,
		|			ФактическийПериодДействия.НомерСтроки) КАК КалендарныеДниПособия
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = КалендарныеДниПособия.НомерСтроки
		|		// присоединяем данные о размере пособия
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерММОТТекст + ") КАК РазмерММОТ
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерММОТ.ОсновнойНомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + РазмерОграниченияПособияТекст + ") КАК РазмерОграниченияПособия
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.НомерСтроки = РазмерОграниченияПособия.ОсновнойНомерСтроки
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДействияНачало";
		
		
		ОтражениеТекст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
		|	СУММА(БУОсновныеНачисления.Результат) КАК Результат,
		|	БУОсновныеНачисления.СчетДт.Код,
		|	БУОсновныеНачисления.СубконтоДт1 КАК СубконтоДт1,
		|	БУОсновныеНачисления.СубконтоДт2 КАК СубконтоДт2,
		|	БУОсновныеНачисления.СубконтоДт3 КАК СубконтоДт3,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА БУОсновныеНачисления.ОтражениеВУСН
		|		ИНАЧЕ БУОсновныеНачисления.СчетДтНУ.Код
		|	КОНЕЦ КАК СчетДтНУКод,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ1
		|	КОНЕЦ КАК СубконтоДтНУ1,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ2
		|	КОНЕЦ КАК СубконтоДтНУ2,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА """"
		|		ИНАЧЕ БУОсновныеНачисления.СубконтоДтНУ3
		|	КОНЕЦ КАК СубконтоДтНУ3
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.БУОсновныеНачисления КАК БУОсновныеНачисления
		|		ПО ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = БУОсновныеНачисления.ВидРасчета
		|			И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия = БУОсновныеНачисления.ПериодДействия
		|			И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = БУОсновныеНачисления.Сотрудник
		|			И (БУОсновныеНачисления.ПериодДействияНачало МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|			И (БУОсновныеНачисления.ПериодДействияКонец МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец)
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор = &ДокументСсылка
		|	И (НЕ ОсновныеНачисленияРаботниковОрганизаций.Сторно)
		|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = &ВидРасчетаКОплате
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
		|	БУОсновныеНачисления.СубконтоДт3,
		|	БУОсновныеНачисления.СубконтоДтНУ1,
		|	БУОсновныеНачисления.СубконтоДтНУ2,
		|	БУОсновныеНачисления.СубконтоДтНУ3,
		|	БУОсновныеНачисления.СчетДт.Код,
		|	ВЫБОР
		|		КОГДА &УСН
		|			ТОГДА БУОсновныеНачисления.ОтражениеВУСН
		|		ИНАЧЕ БУОсновныеНачисления.СчетДтНУ.Код
		|	КОНЕЦ,
		|	БУОсновныеНачисления.СубконтоДт1,
		|	БУОсновныеНачисления.СубконтоДт2,
		|	БУОсновныеНачисления.СубконтоДт3
		|
		|ИМЕЮЩИЕ
		|	СУММА(БУОсновныеНачисления.Результат) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодДействияНачало";
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПоБольничномуЛисту_ОборотЛисткаНетрудоспособности";
		
		Макет = ПолучитьМакет("ОборотЛисткаНетрудоспособностиВПереходныйПериод2007");
		СекцияШапка = Макет.ПолучитьОбласть("Шапка");
		СекцияРасчетПособияШапка = Макет.ПолучитьОбласть("РасчетПособияШапка");
		СекцияРасчетПособияСтрока2006 = Макет.ПолучитьОбласть("РасчетПособияСтрока2006");
		СекцияРасчетПособияСтрока = Макет.ПолучитьОбласть("РасчетПособияСтрока");
		СекцияРасчетПособияИтог = Макет.ПолучитьОбласть("РасчетПособияИтог");
		СекцияОтражениеПособияСтрока = Макет.ПолучитьОбласть("ОтражениеПособияСтрока");
		
		// определим налоговый режим
		БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете"), КонецМесяца(ПериодРегистрации), Организация);
		УчетнаяПолитика = глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете")[КонецМесяца(ПериодРегистрации)][Организация];
		мУСН = УчетнаяПолитика.УСН;
		мОбъектНалогообложенияУСН = УчетнаяПолитика.ОбъектНалогообложенияУСН;
		мЕНВД = УчетнаяПолитика.ОрганизацияЯвляетсяПлательщикомЕНВД;
		мФСС_БЛ = УчетнаяПолитика.УплачиватьДобровольныеВзносыВФСС;
		
		Запрос = Новый Запрос;
		
		ГрафикРаботы = Неопределено;
		ЭтоПереходныйПериодПоЗакону255ФЗ = ДатаСобытия < мДатаЗакона255ФЗ И ДатаОкончания >= мДатаЗакона255ФЗ И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве;
		
		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаСобытия);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
		Запрос.УстановитьПараметр("Физлицо", Сотрудник.Физлицо);
		Запрос.УстановитьПараметр("ПроцентОплатыПереходногоПериода", ПроцентОплатыПереходногоПериода);
		Запрос.УстановитьПараметр("ПроцентОплаты", ПроцентОплаты);
		Запрос.УстановитьПараметр("ДатаНарушенияРежима", ДатаНарушенияРежима);
		Запрос.УстановитьПараметр("ПустойВидНалогообложения", Справочники.ВидыНалогообложения.ПустаяСсылка());//О.Т. Аверсон 13.07.2016 № 1308
		
		Запрос.Текст = ДанныеОДокументеТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СекцияШапка.Параметры,Выборка);
		ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока.Параметры,Выборка);
		ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока2006.Параметры,Выборка);
		ГрафикРаботы = Выборка.ГрафикРаботы;
		ПериодРасчетаСреднегоЗаработка = Выборка.ПериодРасчетаСреднегоЗаработка;
		ЛетСтажа	= 0;
		МесяцевСтажа= 0;
		ДнейСтажа	= 0;
		ДатаНепрерывногоСтажа = ПроведениеРасчетов.ПолучитьНачалоСтажаДляБольничногоЛиста(ДатаСобытия, Сотрудник.Физлицо, Организация);
		Если ЗначениеЗаполнено(ДатаНепрерывногоСтажа) Тогда
			ОбщегоНазначения.РазобратьРазностьДат(ДатаСобытия, ДатаНепрерывногоСтажа, ЛетСтажа, МесяцевСтажа, ДнейСтажа);
		КонецЕсли;
		СекцияШапка.Параметры.НазваниеСтажа = ?(ДатаСобытия < мДатаЗакона255ФЗ,"Непрерывный","Страховой");
		СекцияШапка.Параметры.ЛетСтажа = ЛетСтажа;
		СекцияШапка.Параметры.ПодписьЛетСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("год","года","лет",ЛетСтажа);
		СекцияШапка.Параметры.МесяцевСтажа = МесяцевСтажа;
		СекцияШапка.Параметры.ПодписьМесяцевСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("месяц","месяца","месяцев",МесяцевСтажа);
		СекцияШапка.Параметры.ДнейСтажа = ДнейСтажа;
		СекцияШапка.Параметры.ПодписьДнейСтажа = ОбщегоНазначения.ФормаМножественногоЧисла("день","дня","дней",ДнейСтажа);
		
		ДатыВыходныхДней = "";
		Запрос.УстановитьПараметр("ГрафикРаботы" , ГрафикРаботы);
		Запрос.Текст = ВыходныеДниТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		КоличествоДней = 0;
		Пока Выборка.Следующий() Цикл
			ДатыВыходныхДней = ДатыВыходныхДней + ?(ДатыВыходныхДней = "","","; ") + Формат(Выборка.Дата,"ДЛФ=DD");
			Если Выборка.Дата < мДатаЗакона255ФЗ Тогда
				КоличествоДней = КоличествоДней + 1
			КонецЕсли;
		КонецЦикла;
		СекцияШапка.Параметры.РабочихДней = ((мДатаЗакона255ФЗ - ДатаНачала) / мДлинаСуток) - КоличествоДней;
		СекцияШапка.Параметры.ДатыВыходныхДней = ДатыВыходныхДней;
		ТабДокумент.Вывести(СекцияШапка);
		
		СтруктураПоказателей = Неопределено;
		СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
		СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
		СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямБЛ;
		СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииБЛ;
		СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямБЛ;
		СписокСоставляющихСреднегоЗаработка[4] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииБЛ;
		ПечатьРасчетаСреднегоЗаработкаОтчет = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаСобытия, ПериодРасчетаСреднегоЗаработка, "", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС, , СписокСоставляющихСреднегоЗаработка, Ложь, Ложь, СтруктураПоказателей);
		ОбластьПрямоугольная = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, 1, ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы, ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы);
		НачалоНовогоФорматаСтрок = ТабДокумент.ВысотаТаблицы + 1;
		ТабДокумент.Область(НачалоНовогоФорматаСтрок, , НачалоНовогоФорматаСтрок + ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		Для Счетчик = 1 По ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы Цикл
			ТабДокумент.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТабДокумент.ВставитьОбласть(ОбластьПрямоугольная, ТабДокумент.Область(НачалоНовогоФорматаСтрок, 1));
		если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
			Запрос.УстановитьПараметр("Средний",Окр(СтруктураПоказателей.Средний,2));
		иначе
			Запрос.УстановитьПараметр("Средний",ОбщегоНазначения.ОкруглитьЗначение2016(СтруктураПоказателей.Средний,ПериодРегистрации));//О.Т. Аверсон 15.03.2016 № 949
		КонецЕсли;
		
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ЗаголовокНовогоПорядка"));
		СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуПособий;
		СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиямПособий;
		СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксГодовойПремииПособий;
		СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиямПособий;
		СписокСоставляющихСреднегоЗаработка[4] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремииПособий;
		ПечатьРасчетаСреднегоЗаработкаОтчет = ФормированиеПечатныхФорм.ПечатьРасчетаСреднегоЗаработка(Ссылка, ДатаСобытия, ПериодРасчетаСреднегоЗаработка, "", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС, Ложь, СписокСоставляющихСреднегоЗаработка, Ложь, Ложь, СтруктураПоказателей);
		ОбластьПрямоугольная = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, 1, ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы, ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы);
		НачалоНовогоФорматаСтрок = ТабДокумент.ВысотаТаблицы + 1;
		ТабДокумент.Область(НачалоНовогоФорматаСтрок, , НачалоНовогоФорматаСтрок + ПечатьРасчетаСреднегоЗаработкаОтчет.ВысотаТаблицы - 1, ).СоздатьФорматСтрок();
		// назначим ширину колонок у новой области формата строк
		Для Счетчик = 1 По ПечатьРасчетаСреднегоЗаработкаОтчет.ШиринаТаблицы Цикл
			ТабДокумент.Область(НачалоНовогоФорматаСтрок, Счетчик).ШиринаКолонки = ПечатьРасчетаСреднегоЗаработкаОтчет.Область(1, Счетчик).ШиринаКолонки;
		КонецЦикла;
		ТабДокумент.ВставитьОбласть(ОбластьПрямоугольная, ТабДокумент.Область(НачалоНовогоФорматаСтрок, 1));
		если ПериодРегистрации < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
			Запрос.УстановитьПараметр("СреднийПП",Окр(СтруктураПоказателей.Средний,2));
		иначе
			Запрос.УстановитьПараметр("СреднийПП",ОбщегоНазначения.ОкруглитьЗначение2016(СтруктураПоказателей.Средний,ПериодРегистрации));//О.Т. Аверсон 15.03.2016 № 949
		КонецЕсли;
		
		ТабДокумент.Вывести(СекцияРасчетПособияШапка);
		
		Запрос.Текст = РасчетПособияТекст;
		Выборка = Запрос.Выполнить().Выбрать();
		Запрос.Текст = РасчетПособияТекстПП;
		ВыборкаПП = Запрос.Выполнить().Выбрать(); ВыборкаПП.Следующий();
		СтруктураПоиска = Новый Структура("ПериодДействияНачало");
		НачисленоВсего = 0;
		Пока Выборка.Следующий() Цикл
			НачисленоВсего = НачисленоВсего + Выборка.Результат;
			Если Выборка.ПериодДействияНачало < мДатаЗакона255ФЗ Тогда
				ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока2006.Параметры,Выборка);
				ТабДокумент.Вывести(СекцияРасчетПособияСтрока2006);
			Иначе
				ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока.Параметры,Выборка);
				ЗаполнитьЗначенияСвойств(СтруктураПоиска,Выборка);
				ВыборкаПП.Сбросить();
				ВыборкаПП.НайтиСледующий(СтруктураПоиска);
				ЗаполнитьЗначенияСвойств(СекцияРасчетПособияСтрока.Параметры,ВыборкаПП);
				ТабДокумент.Вывести(СекцияРасчетПособияСтрока);
			КонецЕсли;
		КонецЦикла;
		
		СекцияРасчетПособияИтог.Параметры.НачисленоВсегоПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(НачисленоВсего, Константы.ВалютаРегламентированногоУчета.Получить());
		СекцияРасчетПособияИтог.Параметры.ПериодРегистрации = ПериодРегистрации;
		ТабДокумент.Вывести(СекцияРасчетПособияИтог);
		
		Запрос.Текст = ОтражениеТекст;
		Запрос.УстановитьПараметр("ВидРасчетаКОплате", ВидРасчета);
		Запрос.УстановитьПараметр("УСН",мУСН);
		Результат = Запрос.Выполнить();
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтражениеВУчетеШапка"));
		Если Результат.Пустой() Тогда
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("НетДанных"));
		Иначе
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтражениеПособияШапка"));
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(СекцияОтражениеПособияСтрока.Параметры,Выборка);
				
				СекцияОтражениеПособияСтрока.Параметры.СтрокаСубконтоБУ = ?(ЗначениеЗаполнено(Выборка.СубконтоДт1),Строка(Выборка.СубконтоДт1),"") +
				?(ЗначениеЗаполнено(Выборка.СубконтоДт2), Символы.ПС + Строка(Выборка.СубконтоДт2),"") + 
				?(ЗначениеЗаполнено(Выборка.СубконтоДт3), Символы.ПС+ Строка(Выборка.СубконтоДт3),"") ; 
				СекцияОтражениеПособияСтрока.Параметры.СтрокаСубконтоНУ = ?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ1),Строка(Выборка.СубконтоДтНУ1),"") +
				?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ2), Символы.ПС + Строка(Выборка.СубконтоДтНУ2),"") + 
				?(ЗначениеЗаполнено(Выборка.СубконтоДтНУ3), Символы.ПС + Строка(Выборка.СубконтоДтНУ3),""); 
				
				ТабДокумент.Вывести(СекцияОтражениеПособияСтрока);
				
			КонецЦикла;
		КонецЕсли;
		
		Возврат	ТабДокумент
		
	КонецФункции // ПечатьОборотаБольничного()
	
	////////////////////////////////////////////////////////////////////////////////
	// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
	
	//Аверсон ПСА 07.08.2024 СВФР-013512 +++
	Функция ВернутьКоэффициентГрафикаРаботы(ПериодДляКоэффициента) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	isNull(РаботникиОрганизацийСрезПоследних.ГрафикРаботы.ДлительностьРабочейНедели, 0) КАК ЧасыНеделиГрафика,
		|	isNull(РаботникиОрганизацийСрезПоследних.ГрафикРаботы.ГрафикПолногоРабочегоВремени.ДлительностьРабочейНедели, 0) КАК ЧасыНеделиПолногоГрафика
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&ДатаСреза,
		|			Сотрудник = &Сотрудник
		|				И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ПериодДляКоэффициента);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	КоэффициентГрафикаРаботы = 1;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ЧасыНеделиГрафика) 
			и ЗначениеЗаполнено(Выборка.ЧасыНеделиПолногоГрафика) Тогда
			КоэффициентГрафикаРаботы = Выборка.ЧасыНеделиГрафика/Выборка.ЧасыНеделиПолногоГрафика;	
		КонецЕсли;	
		Если КоэффициентГрафикаРаботы = 1 Тогда
			КоэффициентГрафикаРаботы = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодДляКоэффициента,Новый Структура("Сотрудник",Сотрудник)).ЗанимаемыхСтавок;
		КОнецЕсли;
	КонецЕсли;
	
	Возврат КоэффициентГрафикаРаботы;
КонецФункции	
	//+++Аверсон ПСА 07.08.2024 СВФР-013512

	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если Не Проведен Тогда
			//О.Т. Аверсон 24.02.2017 № 346
			ТекстВопроса = "Документ можно распечатать только после расчета и проведения! Провести?";
			Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат Неопределено;
			иначе
				попытка
					ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Возврат Неопределено;
				КонецПопытки;
			КонецЕсли;
			//О.Т. Аверсон 24.02.2017 № 346
			
		КонецЕсли;
		
		//Усков Сергей 08.08.2013 № 16699+
		Если ИмяМакета = "Оборот11072013" Тогда
			ПечатьОборота11072013(ИмяМакета,КоличествоЭкземпляров,НаПринтер);
			Возврат Неопределено;
		КонецЕсли;
		//Усков Сергей 08.08.2013 № 16699-
		
		//Островская Татьяна 17.04.2014 № 17287
		ТочностьСреднего = Константы.ТочностьСреднегоЗаработка.Получить();
		Если ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
			ЗначениеТочностьСреднего = 0;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
			ЗначениеТочностьСреднего = 1;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
			ЗначениеТочностьСреднего = 2;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
			ЗначениеТочностьСреднего = 3;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
			ЗначениеТочностьСреднего = 4;
		иначе
			ЗначениеТочностьСреднего = 0;
		КонецЕсли;
		//Островская Татьяна 17.04.2014 № 17287
		
		//+ СВЭЙ КДЯ 07.02.20 СВФР-005429
		ЭтоРасчетПоОкладу = ( ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу );
		СуфОкл = ?( ЭтоРасчетПоОкладу, "Окл", "" );
		//- СВЭЙ КДЯ 07.02.20 СВФР-005429
		
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПоБольничномуЛисту_Оборот";
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ВыборкаПоШапкеДокументадляПечати = СформироватьЗапросПоШапкеДляПечати().Выбрать();
		ВыборкаПоШапкеДокументадляПечати.Следующий();
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		// Определение даты начала и конца оплачиваемого события 
		
		ДатаНачалаСобытия 			= ВыборкаПоШапкеДокумента.ДатаНачала;
		ДатаОкончанияСобытия 		= ВыборкаПоШапкеДокумента.ДатаОкончания;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		//Запрос.УстановитьПараметр("Приказ", Приказ);
		Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаНачалаСобытия);
		
		//Выборка годовой премии
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.Результат) КАК Результат,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.ВидРасчета = &ВидРасчетаПоГодовойПремии
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации";
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоГодовойПремии", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		Годовая = Запрос.Выполнить().Выбрать();
		годоваяВМесяц = 0;
		Если Годовая.Следующий() тогда
			ГодоваяВМесяц = Годовая.Результат / 12 * Годовая.КоэффициентИндексации;
		КонецЕсли;
		
		// Запрос выборки среднего заработка
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.Результат) КАК Результат,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТарифнаяСтавкаПериода,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТекущаяТарифнаяСтавка,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		//|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		//	               |	И НачислениеПоБольничнымЛистамРасчетСреднего.ВидРасчета <> &ВидРасчетаПоГодовойПремии
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТарифнаяСтавкаПериода,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТекущаяТарифнаяСтавка
		|	УПОРЯДОЧИТЬ ПО
		|	МесяцВыборки";
		
		Измерения = Новый Массив(1);
		Измерения[0] = "Сотрудник";
		
		// основные начисления собираем по периодам действия
		РазрезыОсновных = Новый Массив(1);
		РазрезыОсновных[0] = "ПериодДействия";
		
		// дополнительные начисления собираем по периодам регистрации
		РазрезыДополнительных = Новый Массив(2);
		РазрезыДополнительных[0] = "ПериодРегистрации";
		РазрезыДополнительных[1] = "ЧислоМесяцев";
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("Измерения", Измерения);
		Запрос.УстановитьПараметр("РазрезыОсновных", РазрезыОсновных);
		Запрос.УстановитьПараметр("РазрезыДополнительных", РазрезыДополнительных);
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоГодовойПремии", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		ТаблицаСреднего = Новый ТаблицаЗначений;        
		ТаблицаСреднего.Колонки.Добавить("Месяц");
		ТаблицаСреднего.Колонки.Добавить("Сумма");
		ТаблицаСреднего.Колонки.Добавить("Описание");
		
		ВыборкаСреднегоЗаработка = Запрос.Выполнить().Выбрать();
		
		// Запрос выборки отработанного времени
		ТекстЗапроса = "ВЫБРАТЬ
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		//|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.ВидРасчета = &ВидРасчетаПоЗаработку
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки";
		
		Если СпособРасчетаВДнях Тогда //Островская Татьяна 10.06.2014 № 17421
			//если СпособРасчетаВЧасах Тогда 
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке");
			//иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноДней) КАК ОтработаноПоПятидневке");
			//КонецЕсли;	
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("Измерения", Измерения);
		Запрос.УстановитьПараметр("РазрезыОсновных", РазрезыОсновных);
		Запрос.УстановитьПараметр("РазрезыДополнительных", РазрезыДополнительных);
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоЗаработку", ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		ТаблицаСреднего.Колонки.Добавить("Отработано");
		
		ВыборкаОтработаноПоПятидневке = Запрос.Выполнить().Выгрузить();
		
		Макет = ПолучитьМакет("Оборот");
		
		// вывод лицевой стороны
		СекцияЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
		//Аверсон-софт, Островская Татьяна 11.06.2012 № 15476
		
		//Аверсон ЕАЕ 06.09.2024 СВФР-013586
		//СекцияЛицеваяСторона.Параметры.ДатаНачала = ВыборкаПоШапкеДокумента.ДатаНачала;
		//СекцияЛицеваяСторона.Параметры.ДатаОкончания = ВыборкаПоШапкеДокумента.ДатаОкончания;
		СекцияЛицеваяСторона.Параметры.ДатаНачала = Формат(ВыборкаПоШапкеДокумента.ДатаНачала, "ДФ=dd.MM.yyyy");
		СекцияЛицеваяСторона.Параметры.ДатаОкончания = Формат(ВыборкаПоШапкеДокумента.ДатаОкончания, "ДФ=dd.MM.yyyy");
		//Аверсон СВФР-013586
		
		СекцияЛицеваяСторона.Параметры.МесяцНачисления = Формат(ВыборкаПоШапкеДокумента.ПериодРегистрации, "ДФ='MMMM'");
		
		//Аверсон-софт, Островская Татьяна 11.06.2012 № 15476
		СекцияЛицеваяСторона.Параметры.Заполнить(ВыборкаПоШапкеДокументаДляПечати);
		
		Попытка
			СекцияЛицеваяСторона.Параметры.ДатаПриема = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', ЭтотОбъект.Сотрудник, 0,Организация).Период;//О.Т. Аверсон 16.10.2017 № 1120
			
		Исключение
		КонецПопытки;
		
		ТабДокумент.Вывести(СекцияЛицеваяСторона);
		
		Если ДвоичныеДанныеСообщенияПортала.Получить() = Неопределено Тогда //ПСА 12.08.2024 +++ 
		// Вывод сведений о порядке расчета среднего заработка
		СекцияРасчетСреднего = Макет.ПолучитьОбласть("РасчетСреднегоИ"+СуфОкл);
		СекцияРасчетСреднегоИтог = Макет.ПолучитьОбласть("РасчетСреднегоИИтог"+СуфОкл); //Островская Татьяна 22.07.2013 № 16645
		СекцияРасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего"+СуфОкл);
		
		//Аверсон ЕАЕ 05.09.2024 СВФР-013586
		Если ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП) Тогда
			РасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего1_Ручной");
		Иначе
		//Аверсон СВФР-013586
			РасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего1");
		КонецЕсли;
		
		если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда 
			СекцияРасчетСреднего1.Параметры.ДниШапка = "Раб. дни/часы для расчета";
		иначе
			СекцияРасчетСреднего1.Параметры.ДниШапка = "Кал. дни для расчета";
		КонецЕсли;
		ТабДокумент.Вывести(СекцияРасчетСреднего1);
		
		//Аверсон ЕАЕ 30.06.2022 СВФР-009236
		//50%БМП//////////////////////////////////////////////////////////////////////////
		Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ  Тогда
			СекцияРасчетСреднегоМесяц50 = Макет.ПолучитьОбласть("РасчетСреднегоМесяц50");
			СекцияРасчетСреднего50 = Макет.ПолучитьОбласть("РасчетСреднего50");
			ТЗПериоды = ПолучитьПериодыБЛ();
			Для Каждого Стр Из ТЗПериоды Цикл
				СекцияРасчетСреднегоМесяц50.Параметры.Год1 = Год(Стр.НачалоПериода);
				СекцияРасчетСреднегоМесяц50.Параметры.Месяц1 = Месяц(Стр.НачалоПериода);
				СекцияРасчетСреднегоМесяц50.Параметры.Коэфф1 = Стр.КоличествоДней;
				СекцияРасчетСреднегоМесяц50.Параметры.Сумма1 = Стр.Сумма;
				ТабДокумент.Вывести(СекцияРасчетСреднегоМесяц50);	
			КонецЦикла; 
		ИначеЕсли ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП  Тогда
			СекцияРасчетСреднегоМесяц50 = Макет.ПолучитьОбласть("РасчетСреднегоМесяц50");
			СекцияРасчетСреднего50 = Макет.ПолучитьОбласть("РасчетСреднего51");
			ТЗПериоды = ПолучитьПериодыБЛ();
			Для Каждого Стр Из ТЗПериоды Цикл
				СекцияРасчетСреднегоМесяц50.Параметры.Год1 = Год(Стр.НачалоПериода);
				СекцияРасчетСреднегоМесяц50.Параметры.Месяц1 = Месяц(Стр.НачалоПериода);
				СекцияРасчетСреднегоМесяц50.Параметры.Коэфф1 = Стр.КоличествоДней;
				СекцияРасчетСреднегоМесяц50.Параметры.Сумма1 = Стр.Сумма;
				ТабДокумент.Вывести(СекцияРасчетСреднегоМесяц50);	
			КонецЦикла;

		Иначе
			//Аверсон СВФР-009236	
			
			// вывод данных о сумме заработка за расчетный период
			НомерСтроки = 0;
			ИтогоЗаработок = 0;
			ИтогоОтработано = 0;
			//+ СВЭЙ КДЯ 07.02.20 СВФР-005429
			Если ЭтоРасчетПоОкладу Тогда
				ИтогоСреднийДневнойЗаработок = 0;	
				ИтогоМесяцев = 0;	
			КонецЕсли; 
			//- СВЭЙ КДЯ 07.02.20 СВФР-005429
			СтруктураПоиска = Новый Структура("МесяцВыборки");
			Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
				
				//Островская Татьяна 06.06.2014 № 17416
				
				//Аверсон ЕАЕ 13.10.2022 СВФР-009666
				//мНорма = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(
				мНорма = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуСУчетомИзмененияГрафика(
				//Аверсон СВФР-009666
				
				НачалоМесяца( ВыборкаСреднегоЗаработка.МесяцВыборки ), 
				КонецМесяца( ВыборкаСреднегоЗаработка.МесяцВыборки ), 
				Сотрудник
				//+ СВЭЙ КДЯ 09.01.20 СВФР-005273
				, УчитыватьСтавку 
				//- СВЭЙ КДЯ 09.01.20 СВФР-005273
				
				//Аверсон ЕАЕ 10.02.2021 СВФР-007115
				,,
				НормаИзГрафика
				//Аверсон
				);
				//Островская Татьяна 11.09.2013 № 16778
				
				ЗапросВидРасчета = Новый Запрос;
				ЗапросВидРасчета.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ОсновныеНачисленияРаботниковОрганизаций.ВидУчетаВремени
				|ИЗ
				|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
				|ГДЕ
				|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации = &ПериодРегистрации
				|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
				|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)";
				ВидРасчетаСписок = Новый СписокЗначений;
				ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
				ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
				ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
				ВидРасчетаСписок.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
				ЗапросВидРасчета.УстановитьПараметр("ВидРасчета",ВидРасчетаСписок);	
				ЗапросВидРасчета.УстановитьПараметр("Сотрудник",Сотрудник);	
				ЗапросВидРасчета.УстановитьПараметр("ПериодРегистрации",ВыборкаСреднегоЗаработка.МесяцВыборки);
				РезультВидУчета = ЗапросВидРасчета.Выполнить().Выгрузить();
				ВидУчетаВремени = Неопределено;
				
				если РезультВидУчета.Количество() > 0 Тогда 
					ВидУчетаВремени = РезультВидУчета[0].ВидУчетаВремени;
				КонецЕсли;
				
				
				ЗаписиДанныхДляСреднего =
				"ВЫБРАТЬ
				|	ЗаписиРасчетаСреднего.НомерСтроки КАК НомерСтроки,
				|	ЗаписиРасчетаСреднего.БазовыйПериодНачало КАК БазовыйПериодНачало,
				|	ЗаписиРасчетаСреднего.БазовыйПериодКонец КАК БазовыйПериодКонец,
				|	ЗаписиРасчетаСреднего.Сотрудник КАК Сотрудник,
				|	ЗаписиРасчетаСреднего.Организация КАК Организация,
				//|	ЗаписиРасчетаСреднего.Приказ КАК Приказ,
				|	ЗаписиРасчетаСреднего.ДатаНачалаРасчетногоПериода КАК ДатаНачалаРасчетногоПериода,
				|	ЗаписиРасчетаСреднего.ДатаОкончанияРасчетногоПериода КАК ДатаОкончанияРасчетногоПериода,
				|	ЗаписиРасчетаСреднего.ВидРасчета КАК ВидРасчета,
				|	ЗаписиРасчетаСреднего.СпособРасчета КАК СпособРасчета,
				|	ЗаписиРасчетаСреднего.МесяцВыборки
				|ИЗ
				|	РегистрРасчета.РасчетСреднегоЗаработка КАК ЗаписиРасчетаСреднего
				|ГДЕ
				|	ЗаписиРасчетаСреднего.Регистратор = &парамРегистратор
				|	И ЗаписиРасчетаСреднего.ВидРасчета В(&Заработок)";
				
				
				НормаПоШестидневкеТекст = 
				"ВЫБРАТЬ
				|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцПериода,
				|	СУММА(ПроизводственныйКалендарь.Шестидневка) КАК ДнейПоШестидневке
				|ИЗ
				|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК ПроизводственныйКалендарь
				|ГДЕ
				|	ПроизводственныйКалендарь.ДатаКалендаря >= &парамДатаС
				|	И ПроизводственныйКалендарь.ДатаКалендаря <= &парамДатаПо
				|
				|СГРУППИРОВАТЬ ПО
				|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)";
				
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОтработанноеВремя.НомерСтроки КАК НомерСтроки,
				|	ОтработанноеВремя.МесяцВыборки КАК МесяцВыборки,
				|	ОтработанноеВремя.ОтработаноДней - ЕстьNull(ИсключенияКалДней.Дней,0) КАК ОтработаноДней,
				|	ОтработанноеВремя.ОтработаноЧасов - ЕстьNull(ИсключенияКалДней.Дней,0) КАК ОтработаноЧасов
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЗаписиРасчетаСреднего.НомерСтроки КАК НомерСтроки,
				|		ОтработанноеВремя.ПериодДействия КАК Месяцвыборки,
				|		СУММА(ВЫБОР
				|			КОГДА ЗаписиРасчетаСреднего.СпособРасчета В (&парамНеОтпуск)
				|				ТОГДА ОтработанноеВремя.ОтработаноДней
				|			ИНАЧЕ ВЫБОР
				|					КОГДА ВЫБОР
				|								КОГДА ОтработанноеВремя.ВидРасчета В (&Прогулы)
				|									ТОГДА ОтработанноеВремя.НормаДнейПоПятидневке
				|								ИНАЧЕ ОтработанноеВремя.ОтработаноДнейПоПятидневке
				|							КОНЕЦ < ОтработанноеВремя.НормаДнейПоПятидневке
				|						ТОГДА ВЫБОР
				|								КОГДА ЗаписиРасчетаСреднего.СпособРасчета = &парамПоШестидневке
				|									ТОГДА ОтработанноеВремя.ОтработаноДнейПоПятидневке * 1.2
				|								КОГДА ОтработанноеВремя.ВидРасчета = &ПарамОтпуск
				|									ТОГДА ОтработанноеВремя.НормаДней
				
				|								ИНАЧЕ ОтработанноеВремя.ОтработаноДней //СУММА(ОтработанноеВремя.ОтработаноДнейПоПятидневке) * 1.4
				|							КОНЕЦ
				|					КОГДА ОтработанноеВремя.ВидРасчета = &ПарамОтпуск
				|							ТОГДА ОтработанноеВремя.НормаДней
				|					ИНАЧЕ ВЫБОР
				|							КОГДА ЗаписиРасчетаСреднего.СпособРасчета = &парамПоШестидневке
				|								ТОГДА НормаПоШестидневке.ДнейПоШестидневке
				|							ИНАЧЕ ОтработанноеВремя.НормаДней //29.7
				|						КОНЕЦ
				|				КОНЕЦ
				|		КОНЕЦ) КАК ОтработаноДней, //Островская Татьяна 27.05.2014 № 17387
				|		СУММА(ВЫБОР
				|			КОГДА ЗаписиРасчетаСреднего.СпособРасчета В (&парамНеОтпуск)
				|				ТОГДА ВЫБОР КОГДА ОтработанноеВремя.ВидРасчета В (&ДетскийДень) ТОГДА 0 ИНАЧЕ ОтработанноеВремя.ОтработаноЧасов КОНЕЦ //толик
				|			ИНАЧЕ ВЫБОР
				|				КОГДА ОтработанноеВремя.ВидРасчета В (&Прогулы)
				|					ТОГДА ОтработанноеВремя.НормаЧасов
				|				КОГДА ОтработанноеВремя.ВидРасчета = &ПарамОтпуск
				|					ТОГДА ОтработанноеВремя.НормаЧасов
				|				ИНАЧЕ ОтработанноеВремя.ОтработаноЧасов
				|			КОНЕЦ 
				|		КОНЕЦ) КАК ОтработаноЧасов //Островская Татьяна 27.05.2014 № 17387
				
				|	ИЗ
				|		(" + ЗаписиДанныхДляСреднего + ") КАК ЗаписиРасчетаСреднего
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОтработанноеВремя
				|			ПО ЗаписиРасчетаСреднего.Сотрудник = ОтработанноеВремя.Сотрудник
				|				И ЗаписиРасчетаСреднего.Организация = ОтработанноеВремя.Организация
				|				И ЗаписиРасчетаСреднего.ДатаНачалаРасчетногоПериода <= ОтработанноеВремя.ПериодДействияКонец
				|				И ЗаписиРасчетаСреднего.ДатаОкончанияРасчетногоПериода >= ОтработанноеВремя.ПериодДействияНачало
				|				И ((ЗаписиРасчетаСреднего.ДатаНачалаРасчетногоПериода = ЗаписиРасчетаСреднего.БазовыйПериодНачало
				|							И НАЧАЛОПЕРИОДА(ЗаписиРасчетаСреднего.БазовыйПериодНачало, МЕСЯЦ) <= ОтработанноеВремя.ПериодДействия
				|						ИЛИ ЗаписиРасчетаСреднего.ДатаНачалаРасчетногоПериода < ЗаписиРасчетаСреднего.БазовыйПериодНачало
				|							И ЗаписиРасчетаСреднего.БазовыйПериодНачало <= ОтработанноеВремя.ПериодДействия)
				|						И НАЧАЛОПЕРИОДА(ЗаписиРасчетаСреднего.БазовыйПериодКонец, МЕСЯЦ) >= ОтработанноеВремя.ПериодДействия
				|					ИЛИ ЗаписиРасчетаСреднего.ВидРасчета = &ФиксПремии)
				|			ЛЕВОЕ СОЕДИНЕНИЕ (" + НормаПоШестидневкеТекст + ") КАК НормаПоШестидневке
				|			ПО НормаПоШестидневке.МесяцПериода = ОтработанноеВремя.ПериодДействия
				|	
				|	СГРУППИРОВАТЬ ПО
				|		ЗаписиРасчетаСреднего.НомерСтроки,
				|		ЗаписиРасчетаСреднего.МесяцВыборки,
				|		ОтработанноеВремя.ПериодДействия) КАК ОтработанноеВремя
				//О.Т. Аверсон 09.01.2018 № 1416
				|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	СУММА(РабочееВремяРаботниковОрганизаций.Дней) КАК Дней,
				|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
				|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ) КАК Период,
				|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник
				|ИЗ
				|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
				|ГДЕ
				|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
				|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени В(&СписокКлассификаторовИскл)
				|
				|СГРУППИРОВАТЬ ПО
				|	НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ),
				|	РабочееВремяРаботниковОрганизаций.Сотрудник) КАК ИсключенияКалДней
				|ПО ОтработанноеВремя.Месяцвыборки = ИсключенияКалДней.Период
				//О.Т. Аверсон 09.01.2018 № 1416
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
				ЗапросПВР = Новый Запрос(
				"ВЫБРАТЬ
				|	ОсновныеНачисленияОрганизаций.Ссылка
				|ИЗ
				|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
				|ГДЕ
				|	ОсновныеНачисленияОрганизаций.ЗачетНормыВремени
				|	И ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени = &Прогул");
				ЗапросПВР.УстановитьПараметр("Прогул", Справочники.КлассификаторИспользованияРабочегоВремени.Прогулы);
				Запрос.УстановитьПараметр("Прогулы", ЗапросПВР.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
				ЗапросПР = Новый Запрос(
				"ВЫБРАТЬ
				|	ОсновныеНачисленияОрганизаций.Ссылка
				|ИЗ
				|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
				|ГДЕ
				|	ОсновныеНачисленияОрганизаций.ЗачетНормыВремени
				|	И ОсновныеНачисленияОрганизаций.ОбозначениеВТабелеУчетаРабочегоВремени В (&Простои)");
				СписокПростоев = Новый Массив();
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты);
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул);
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый);
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Простой);
				СписокПростоев.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя);
				ЗапросПР.УстановитьПараметр("Простои", СписокПростоев);
				//толик
				СписокДД = Новый Массив();
				СписокДД.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоКоду("031"));
				Запрос.УстановитьПараметр("ДетскийДень", СписокДД);
				//
				Запрос.УстановитьПараметр("Простои", ЗапросПР.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
				Заработок = Новый Массив();
				Заработок.Добавить(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработку);
				Заработок.Добавить(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуОтпуск);
				Заработок.Добавить(ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ);
				//Заработок.Добавить(ПланыВидовРасчета.СреднийЗаработок.ПоПремиям);
				//Заработок.Добавить(ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
				Запрос.УстановитьПараметр("Заработок", Заработок);
				Запрос.УстановитьПараметр("ФиксПремии", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
				Запрос.УстановитьПараметр("парамДатаС", НачалоМесяца(ВыборкаСреднегоЗаработка.МесяцВыборки));
				Запрос.УстановитьПараметр("парамДатаПо", КонецМесяца(ВыборкаСреднегоЗаработка.МесяцВыборки));
				СписокСпособов = Новый Массив();
				СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку);
				СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
				Запрос.УстановитьПараметр("парамНеОтпуск", СписокСпособов);
				Запрос.УстановитьПараметр("парамОтпуск", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни); //Островская Татьяна 27.05.2014 № 17387
				Запрос.УстановитьПараметр("парамПоШестидневке", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоШестидневке);
				Запрос.УстановитьПараметр("парамРегистратор",Ссылка);
				//О.Т. Аверсон 09.01.2018 № 1416
				ИслючениеДнейБЛ = Новый Массив; 
				Для Каждого стр из Справочники.ГруппыРасчетов.КаленДниБезОтпИБЛ.КлассификаторИспользованияРВ Цикл 
					ИслючениеДнейБЛ.Добавить(стр.ВидКлассификатора); 
				КонецЦикла;
				Запрос.УстановитьПараметр("СписокКлассификаторовИскл",ИслючениеДнейБЛ);
				Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
				//О.Т. Аверсон 09.01.2018 № 1416
				
				ЗапросОтработанные = Запрос.Выполнить().Выгрузить();
				СтруктураПоискаДоп = Новый Структура("МесяцВыборки");
				СтруктураПоискаДоп.МесяцВыборки = ВыборкаСреднегоЗаработка.МесяцВыборки;
				ОтработанноеВремя = ЗапросОтработанные.НайтиСтроки(СтруктураПоискаДоп);
				если ОтработанноеВремя.Количество()>0 Тогда 
					ОтработанноеВремя = ОтработанноеВремя[0];
					
					если ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням  Тогда //и не СпособРасчетаВЧасах
						ОтработаноДнейФакт = ОтработанноеВремя.ОтработаноДней;
						СекцияРасчетСреднего.Параметры["Факт1"] = ОтработанноеВремя.ОтработаноДней;
					иначе
						ОтработаноЧасовФакт = ОтработанноеВремя.ОтработаноЧасов;
						СекцияРасчетСреднего.Параметры["Факт1"] = ОтработанноеВремя.ОтработаноЧасов;
					КонецЕсли;
					Если СпособРасчетаВДнях и не СпособРасчетаВЧасах Тогда 
						ОтработаноДнейФакт = ОтработанноеВремя.ОтработаноДней;
						СекцияРасчетСреднего.Параметры["Факт1"] = ОтработанноеВремя.ОтработаноДней;
					КонецЕсли;
					
				КонецЕсли;
				//Островская Татьяна 06.06.2014 № 17416
				
				НомерСтроки = НомерСтроки  + 1;
				ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
				Если ПериодРегистрации >= Дата(2016,07,1) Тогда //О.Т. Аверсон 22.06.2016 № 949 
					ОписаниеСуммы = "Заработок " +  Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
				иначе
					ОписаниеСуммы = "Заработок " +  Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ=2");
				КонецЕсли;
				СтруктураПоиска.МесяцВыборки =  ВыборкаСреднегоЗаработка.МесяцВыборки;
				
				ОтработаноДней = ВыборкаОтработаноПоПятидневке.НайтиСтроки(СтруктураПоиска);
				Отработано = 0;
				Для каждого Строка из ОтработаноДней цикл
					Отработано = Отработано + Строка.ОтработаноПоПятидневке;
				КонецЦикла;
				Коэфф = Отработано;
				
				//+ СВЭЙ КДЯ 07.02.20 СВФР-005429
				Если ЭтоРасчетПоОкладу Тогда
					СреднийДневнойЗаработок = Окр( ВыборкаСреднегоЗаработка.Результат / Отработано, ЗначениеТочностьСреднего );
					ИтогоСреднийДневнойЗаработок = ИтогоСреднийДневнойЗаработок + СреднийДневнойЗаработок;	
					ИтогоМесяцев = ИтогоМесяцев + 1;
					СекцияРасчетСреднего.Параметры.СреднийДневнойЗаработок = СреднийДневнойЗаработок;
					СекцияРасчетСреднегоИтог.Параметры.ИтогСреднийДневнойЗаработок = ИтогоСреднийДневнойЗаработок;
					СекцияРасчетСреднегоИтог.Параметры.ИтогоМесяцев = ИтогоМесяцев;
					ИтогСреднийЗаработок = Окр( ИтогоСреднийДневнойЗаработок / ИтогоМесяцев, ЗначениеТочностьСреднего );
				КонецЕсли;
				//- СВЭЙ КДЯ 07.02.20 СВФР-005429
				
				ИтогоЗаработок = ИтогоЗаработок + ВыборкаСреднегоЗаработка.Результат;// + ГодоваяВМесяц;
				ИтогоОтработано = ИтогоОтработано + Отработано;
				
				//Если НомерСтроки <= 2 Тогда //мое
				//Островская Татьяна 06.06.2014 № 17416
				если ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням   Тогда //и не СпособРасчетаВЧасах
					СекцияРасчетСреднего.Параметры["План1"] = мНорма.НормаДней;
				иначе
					СекцияРасчетСреднего.Параметры["План1"] = мНорма.НормаЧасов;
				КонецЕсли;
				Если СпособРасчетаВДнях и не СпособРасчетаВЧасах Тогда 
					СекцияРасчетСреднего.Параметры["План1"] = мНорма.НормаДней;
				КонецЕсли;
				
				
				ЗапросИтогСумма = Новый Запрос;
				ЗапросИтогСумма.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РасшифровкаРасчетаСреднего.МесяцВыборки,
				|	СУММА(РасшифровкаРасчетаСреднего.НачисленнаяЗП) КАК НачисленнаяЗП
				|ИЗ
				|	РегистрСведений.РасшифровкаРасчетаСреднего КАК РасшифровкаРасчетаСреднего
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			НачислениеПоБольничномуЛистуРасчетСреднего.Ссылка КАК Ссылка,
				|			НачислениеПоБольничномуЛистуРасчетСреднего.МесяцВыборки КАК МесяцВыборки
				|		ИЗ
				|			Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничномуЛистуРасчетСреднего
				|		ГДЕ
				|			НачислениеПоБольничномуЛистуРасчетСреднего.Ссылка = &Документ
				|			И МЕСЯЦ(НачислениеПоБольничномуЛистуРасчетСреднего.МесяцВыборки) = &МесяцВыборки
				|		
				|		СГРУППИРОВАТЬ ПО
				|			НачислениеПоБольничномуЛистуРасчетСреднего.МесяцВыборки,
				|			НачислениеПоБольничномуЛистуРасчетСреднего.Ссылка) КАК ВложенныйЗапрос
				|		ПО РасшифровкаРасчетаСреднего.Документ = ВложенныйЗапрос.Ссылка
				|			И РасшифровкаРасчетаСреднего.МесяцВыборки = ВложенныйЗапрос.МесяцВыборки
				|ГДЕ
				|	РасшифровкаРасчетаСреднего.Документ = &Документ
				|	И МЕСЯЦ(РасшифровкаРасчетаСреднего.МесяцВыборки) = &МесяцВыборки
				|
				|СГРУППИРОВАТЬ ПО
				|	РасшифровкаРасчетаСреднего.МесяцВыборки";
				
				ЗапросИтогСумма.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
				ЗапросИтогСумма.УстановитьПараметр("МесяцВыборки", Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки));
				
				РезультатИтогСумма = ЗапросИтогСумма.Выполнить().Выгрузить();
				ИтогНачсленныйДоход = РезультатИтогСумма.НайтиСтроки(Новый Структура("МесяцВыборки", ВыборкаСреднегоЗаработка.МесяцВыборки));
				СекцияРасчетСреднего.Параметры["НачисленнаяЗП1"]= 0;
				если ИтогНачсленныйДоход.Количество()>0 Тогда 
					СекцияРасчетСреднего.Параметры["НачисленнаяЗП1"]= ИтогНачсленныйДоход[0].НачисленнаяЗП;
				КонецЕсли;			
				//Островская Татьяна 06.06.2014 № 17416
				
				СекцияРасчетСреднего.Параметры["Год1"] 		= Год(ВыборкаСреднегоЗаработка.МесяцВыборки);
				СекцияРасчетСреднего.Параметры["Месяц1"] 		= Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки);
				СекцияРасчетСреднего.Параметры["Сумма1"] 		= ОписаниеСуммы;
				СекцияРасчетСреднего.Параметры["Коэфф1"] 		= Коэфф;
				
				//Островская Татьяна 22.07.2013 № 16645
				ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
				Если ПериодРегистрации >= Дата(2016,07,1) Тогда //О.Т. Аверсон 22.06.2016 № 949
					СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"] 		= ?(ЗначениеЗаполнено(СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"]),
					СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"],0) + ?(ВыборкаСреднегоЗаработка.Результат = 0,0,Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления)));
				иначе  				
					СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"] 		= ?(ЗначениеЗаполнено(СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"]),
					СекцияРасчетСреднегоИтог.Параметры["ИтогСумма1"],0) + ?(ВыборкаСреднегоЗаработка.Результат = 0,0,Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ=2"));
				КонецЕсли;
				СекцияРасчетСреднегоИтог.Параметры["ИтогКоэфф1"] 		= ?(ЗначениеЗаполнено(СекцияРасчетСреднегоИтог.Параметры["ИтогКоэфф1"]),
				СекцияРасчетСреднегоИтог.Параметры["ИтогКоэфф1"],0)+ Коэфф; 
				//Островская Татьяна 22.07.2013 № 16645
				
				СекцияРасшифровка = Макет.ПолучитьОбласть("Расшифровка"+СуфОкл);
				
				//Островская Татьяна 15.07.2013 № 16620
				ЗапросР = Новый Запрос;
				ТекстЗапроса = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РасшифровкаРасчетаСреднего.ВидРасчета,
				|	РасшифровкаРасчетаСреднего.МесяцВыборки,
				|	РасшифровкаРасчетаСреднего.ПериодРегистрации КАК Месяц,
				|	РасшифровкаРасчетаСреднего.Результат,
				|	//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано,
				|	//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1,
				|	РасшифровкаРасчетаСреднего.НачисленнаяЗП
				|ИЗ
				|	РегистрСведений.РасшифровкаРасчетаСреднего КАК РасшифровкаРасчетаСреднего
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничномуЛистуРасчетСреднего
				|		ПО РасшифровкаРасчетаСреднего.Документ = НачислениеПоБольничномуЛистуРасчетСреднего.Ссылка
				|			И РасшифровкаРасчетаСреднего.МесяцВыборки = НачислениеПоБольничномуЛистуРасчетСреднего.МесяцВыборки
				|ГДЕ
				|	РасшифровкаРасчетаСреднего.Документ = &Документ
				|	И МЕСЯЦ(РасшифровкаРасчетаСреднего.МесяцВыборки) = &МесяцВыборки
				|
				|СГРУППИРОВАТЬ ПО
				|	РасшифровкаРасчетаСреднего.ВидРасчета,
				|	РасшифровкаРасчетаСреднего.МесяцВыборки,
				|	РасшифровкаРасчетаСреднего.ПериодРегистрации,
				|	РасшифровкаРасчетаСреднего.Результат,
				|	РасшифровкаРасчетаСреднего.НачисленнаяЗП";
				//Островская Татьяна 15.07.2013 № 16620
				Если СпособРасчетаВДнях Тогда
					//Островская Татьяна 15.07.2013 № 16620
					если КалендарныеДни Тогда
						//если СпособРасчетаВЧасах Тогда 
						//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноДней) КАК Отработано1");
						//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноЧасов) как Отработано");
						//иначе
						
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноДней) КАК Отработано1");
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) как Отработано");
						//КонецЕсли;	
					иначе 
						если СпособРасчетаВЧасах Тогда 
							ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано");
							ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноЧасов) как Отработано1");
						Иначе 	
							ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноДней) КАК Отработано");
							ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) как Отработано1");
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 15.07.2013 № 16620
				Иначе
					если СпособРасчетаВЧасах Тогда 
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","Сумма(РасшифровкаРасчетаСреднего.ОтработаноДней) КАК Отработано");//О.Т. Аверсон 05.01.2016 № дНЕЙ ПОСТАВИЛА
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) как Отработано1");
					иначе
						
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(РасшифровкаРасчетаСреднего.ОтработаноЧасов) КАК Отработано","Сумма(РасшифровкаРасчетаСреднего.ОтработаноДней) КАК Отработано");//О.Т. Аверсон 05.01.2016 № дней поставила
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) КАК Отработано1","МАКСИМУМ(НачислениеПоБольничномуЛистуРасчетСреднего.ОтработаноДней) как Отработано1");
					КонецЕсли;
					
				КонецЕсли;              
				
				ЗапросР.Текст = ТекстЗапроса;
				
				Если ЗначениеЗаполнено(ЭтотОбъект.ПервичныйБольничныйЛист) Тогда
					ЗапросР.УстановитьПараметр("Документ", ЭтотОбъект.ПервичныйБольничныйЛист.Ссылка);	
				Иначе	
					ЗапросР.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);	
				КонецЕсли;
				ЗапросР.УстановитьПараметр("МесяцВыборки", Месяц(ВыборкаСреднегоЗаработка.Месяцвыборки));
				ВыборкаР = ЗапросР.Выполнить().Выбрать();
				//Островская Татьяна 17.06.2013 № 16559
				если не СворачиватьНачисления Тогда 
					Пока ВыборкаР.Следующий() Цикл
						СекцияРасшифровка.Параметры.Заполнить(ВыборкаР);
						
						ВидРасчетаИзПремии = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям.БазовыеВидыРасчета.НайтиСтроки(Новый Структура("ВидРасчета",ВыборкаР.ВидРасчета)).Количество()>0;
						ДопДни = 0;
						ДопЧасы = 0;
						Если ВидРасчетаИзПремии Тогда 
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.ОплаченоДней) КАК ОплаченоДней,
							|	СУММА(ОсновныеНачисленияРаботниковОрганизаций.ОплаченоДнейЧасов) КАК ОплаченоДнейЧасов
							|ИЗ
							|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
							|ГДЕ
							|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &ПериодВыборки И &ПериодВыборки1
							|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник = &Сотрудник
							|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)";
							
							СписокВидРасчета = Новый СписокЗначений;
							ГруппаРасчетовБЛПремия = Справочники.ГруппыРасчетов.ВключениеРабочегоВремениДляБЛДляРасчетаПремии;    
							для Каждого СтрДляПремии из ГруппаРасчетовБЛПремия.Основные Цикл 
								СписокВидРасчета.Добавить(СтрДляПремии.ВидРасчета);
							КонецЦикла;
							
							Запрос.УстановитьПараметр("ВидРасчета", СписокВидРасчета);
							Запрос.УстановитьПараметр("ПериодВыборки", НачалоМесяца(ВыборкаСреднегоЗаработка.Месяцвыборки));
							Запрос.УстановитьПараметр("ПериодВыборки1", КонецМесяца(ВыборкаСреднегоЗаработка.Месяцвыборки));
							Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
							
							РезДляПремии = Запрос.Выполнить().Выбрать();
							
							Пока РезДляПремии.Следующий() Цикл
								ДопДни = ДопДни + ?(РезДляПремии.ОплаченоДней = Null,0,РезДляПремии.ОплаченоДней);
								ДопЧасы = ДопЧасы + ?(РезДляПремии.ОплаченоДнейЧасов = Null,0,РезДляПремии.ОплаченоДнейЧасов);
							КонецЦикла;
						КонецЕсли;
						
						
						//Островская Татьяна 06.06.2014 № 17416
						если ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоДням  Тогда  //и не СпособРасчетаВЧасах
							СекцияРасшифровка.Параметры["План"] = мНорма.НормаДней;
							СекцияРасшифровка.Параметры["Факт"] = ОтработаноДнейФакт+ДопДни;
						иначе
							СекцияРасшифровка.Параметры["План"] = мНорма.НормаЧасов;
							СекцияРасшифровка.Параметры["Факт"] = ОтработаноЧасовФакт+ДопЧасы;
						КонецЕсли;
						Если СпособРасчетаВДнях и не СпособРасчетаВЧасах Тогда 
							СекцияРасшифровка.Параметры["План"] = мНорма.НормаДней;
							СекцияРасшифровка.Параметры["Факт"] = ОтработаноДнейФакт+ДопДни;
						КонецЕсли;
						//Островская Татьяна 06.06.2014 № 17416
						СекцияРасшифровка.Параметры.План = 
						ТабДокумент.Вывести(СекцияРасшифровка);
					КонецЦикла;
				КонецЕсли;
				//Островская Татьяна 17.06.2013 № 16559
				//Если НомерСтроки = 2  Тогда
				//	Сообщить("Бланк формы не позволяет отразить более 2 записей заработка!");		
				//	
				//	ИтогоОтработано = ?(ИтогоОтработано=0, 1, ИтогоОтработано);
				//	СекцияРасчетСреднего.Параметры["СреднийЗаработок"] = Формат(ИтогоЗаработок / ИтогоОтработано,"ЧЦ=15; ЧДЦ=0");
				//	ТабДокумент.Вывести(СекцияРасчетСреднего);
				//Иначе
				Если ВыборкаСреднегоЗаработка.Количество() = 1 Тогда
					ИтогоОтработано = ?(ИтогоОтработано=0, 1, ИтогоОтработано);
					//СекцияРасчетСреднего.Параметры["СреднийЗаработок"] = Формат(ИтогоЗаработок / ИтогоОтработано,"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"0"));
				КонецЕсли;
				ТабДокумент.Вывести(СекцияРасчетСреднего);
				//КонецЕсли; 
				
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		///////////////////////////////////////////////////////////////////////////
		
		СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
		СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
		СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
		
		МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
		//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
		ИспользоватьСреднеЧасовойЗаработок = Ложь;
		СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок);
		
		
		Если ЭтотОбъект.РучнойРасчетСреднегоЗаработка Тогда
			СекцияРасчетСреднего.Параметры["Год1"] 		= "Ручной ввод";
			//СекцияРасчетСреднего.Параметры["СреднийЗаработок"] = Формат(ЭтотОбъект.РазмерСреднегоЗаработка,"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"2"));
			//+ СВЭЙ КДЯ 07.02.20 СВФР-005429
			Если ЭтоРасчетПоОкладу Тогда
				СекцияРасчетСреднегоИтог.Параметры.ИтогСреднийЗаработок = ИтогСреднийЗаработок;
			Иначе
				//- СВЭЙ КДЯ 07.02.20 СВФР-005429
				СекцияРасчетСреднегоИтог.Параметры["ИтогСреднийЗаработок"] = Формат(ЭтотОбъект.РазмерСреднегоЗаработка,"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"2"));//Островская Татьяна 22.07.2013 № 16645
			КонецЕсли; //+ СВЭЙ КДЯ 07.02.20 СВФР-005429
			ТабДокумент.Вывести(СекцияРасчетСреднего);
			//Островская Татьяна 22.07.2013 № 16645	
		иначе
			//+ СВЭЙ КДЯ 07.02.20 СВФР-005429
			Если ЭтоРасчетПоОкладу Тогда
				СекцияРасчетСреднегоИтог.Параметры.ИтогСреднийЗаработок = ИтогСреднийЗаработок;
			Иначе
				//- СВЭЙ КДЯ 07.02.20 СВФР-005429
				СекцияРасчетСреднегоИтог.Параметры["ИтогСреднийЗаработок"] = ?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Окр(СреднедневнойЗаработок,ЗначениеТочностьСреднего),Окр(СреднедневнойЗаработок,0));//Островская Татьяна 17.04.2014 № 17287	
			КонецЕсли; //+ СВЭЙ КДЯ 07.02.20 СВФР-005429
		КонецЕсли;  //Островская Татьяна 22.07.2013 № 16645
		если не РучнойРасчетСреднегоЗаработка Тогда 
			СекцияРасчетСреднегоИтог.Параметры["Равно"] = " = ";
			СекцияРасчетСреднегоИтог.Параметры["Дел"] = "/";
		КонецЕсли;
		
		//Аверсон ЕАЕ 30.06.2022 СВФР-009236
		//50%БМП
		
		//Аверсон ЕАЕ 05.09.2024 СВФР-013586
		СрЗаработокРасчетный = 0;
		//Аверсон СВФР-013586
		
		Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ Тогда
			Для Каждого Стр Из ТЗПериоды Цикл
				СекцияРасчетСреднего50.Параметры.Равно = " = ";
				СекцияРасчетСреднего50.Параметры.ИтогСумма1 = Стр.Сумма;
				СекцияРасчетСреднего50.Параметры.Дел = "/";
				СекцияРасчетСреднего50.Параметры.ИтогКоэфф1 = Стр.КоличествоДней;
				СекцияРасчетСреднего50.Параметры.ИтогСреднийЗаработок = ?(Стр.КоличествоДней = 0, 0, Окр(Стр.Сумма / Стр.КоличествоДней * 0.5, ЗначениеТочностьСреднего));
				
				//Аверсон ЕАЕ 05.09.2024 СВФР-013586
				СрЗаработокРасчетный = ?(Стр.КоличествоДней = 0, 0, Окр(Стр.Сумма / Стр.КоличествоДней * 0.5, ЗначениеТочностьСреднего));
				//Аверсон СВФР-013586
				
				//Аверсон ЕАЕ 26.09.2024 СВФР-013786
				Стр.СрЗаработокРасчетный = СрЗаработокРасчетный;
				//Аверсон СВФР-013786
				
				ТабДокумент.Вывести(СекцияРасчетСреднего50);
			КонецЦикла;  
			
			//Аверсон ЕАЕ 05.09.2024 СВФР-013586
			Если ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП) Тогда
				СекцияРасчетСреднегоРучной = Макет.ПолучитьОбласть("РасчетСреднегоРучной");
				СекцияРасчетСреднегоРучной.Параметры.ИтогСреднийЗаработокРучной = РазмерСреднегоЗаработка;
				ТабДокумент.Вывести(СекцияРасчетСреднегоРучной);	
			КонецЕсли;
			//Аверсон СВФР-013586
			
		ИначеЕсли ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда
			Для Каждого Стр Из ТЗПериоды Цикл
				СекцияРасчетСреднего50.Параметры.Равно = " = ";
				СекцияРасчетСреднего50.Параметры.ИтогСумма1 = Стр.Сумма;
				СекцияРасчетСреднего50.Параметры.Дел = "/";
				//Аверсон ПСА 07.08.2024 СВФР-013512+++  
				//СекцияРасчетСреднего50.Параметры.ИтогКоэфф1 = Стр.КоличествоДней;
				//СекцияРасчетСреднего50.Параметры.ИтогСреднийЗаработок = ?(Стр.КоличествоДней = 0, 0, Окр(Стр.Сумма / Стр.КоличествоДней, ЗначениеТочностьСреднего));
				КоэффициентГрафикаРаботы = ВернутьКоэффициентГрафикаРаботы(Стр.КонецПериода);
				СекцияРасчетСреднего50.Параметры.ИтогКоэфф1 = "" + Стр.КоличествоДней + ?(КоэффициентГрафикаРаботы = 1, "", " * " + Окр(КоэффициентГрафикаРаботы,4));
				СекцияРасчетСреднего50.Параметры.ИтогСреднийЗаработок = ?(Стр.КоличествоДней = 0, 0, Окр(КоэффициентГрафикаРаботы*Стр.Сумма / Стр.КоличествоДней, ЗначениеТочностьСреднего));
				//+++Аверсон ПСА 07.08.2024 СВФР-013512
				
				//Аверсон ЕАЕ 05.09.2024 СВФР-013586
				СрЗаработокРасчетный = ?(Стр.КоличествоДней = 0, 0, КоэффициентГрафикаРаботы*Стр.Сумма / Стр.КоличествоДней);
				//Аверсон СВФР-013586
				
				//Аверсон ЕАЕ 26.09.2024 СВФР-013786
				Стр.СрЗаработокРасчетный = СрЗаработокРасчетный;
				//Аверсон СВФР-013786
				
				ТабДокумент.Вывести(СекцияРасчетСреднего50);
			КонецЦикла;

			//Аверсон ЕАЕ 05.09.2024 СВФР-013586
			Если ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП) Тогда
				СекцияРасчетСреднегоРучной = Макет.ПолучитьОбласть("РасчетСреднегоРучной");
				СекцияРасчетСреднегоРучной.Параметры.ИтогСреднийЗаработокРучной = РазмерСреднегоЗаработка;
				ТабДокумент.Вывести(СекцияРасчетСреднегоРучной);	
			КонецЕсли;
			//Аверсон СВФР-013586
			
		Иначе
			//Аверсон СВФР-009236
			
			ТабДокумент.Вывести(СекцияРасчетСреднегоИтог);
		КонецЕсли; 
		//ПСА 12.08.2024 +++
		Иначе
		    ДанныеСообщенияПортала = Макет.ПолучитьОбласть("ДанныеСообщенияПортала");
			ТекстСообщенияПортала = ""; 
			ВрФайл = ПолучитьИмяВременногоФайла("txt");
			ДанныеФайла = ДвоичныеДанныеСообщенияПортала.Получить();
			ДанныеФайла.Записать(ВрФайл); 
			ТекстовыйФайл = Новый ТекстовыйДокумент;
			ТекстовыйФайл.Прочитать(ВрФайл,КодировкаТекста.UTF8);
			ТекстСообщенияПортала = ТекстовыйФайл.ПолучитьТекст();
			УдалитьФайлы(ВрФайл);  
			ДанныеСообщенияПортала.Параметры.ТекстСообщенияПортала = ТекстСообщенияПортала;  
			ТабДокумент.Вывести(ДанныеСообщенияПортала);
			РасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего1");
			СреднедневнойЗаработок = ЭтотОбъект.РазмерСреднегоЗаработка;
		КонецЕсли; 
		
		//+++ПСА 12.08.2024
		ТабДокумент.Вывести(РасчетСреднего1);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НачислениеПоБольничномуЛистуНачисления.Показатель1,
		|	НачислениеПоБольничномуЛистуНачисления.Результат,
		|	НачислениеПоБольничномуЛистуНачисления.НормаДней,
		|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета,
		|	НачислениеПоБольничномуЛистуНачисления.НомерСтроки,
		|	НачислениеПоБольничномуЛистуНачисления.ДатаНачала,
		|	НачислениеПоБольничномуЛистуНачисления.ДатаОкончания,
		|	НачислениеПоБольничномуЛистуНачисления.ДополнительныеДанные КАК ДополнительныеДанные1,
		|	НачислениеПоБольничномуЛистуНачисления.Показатель6,
		|	НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
		|ГДЕ
		|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета.СпособРасчета = &парамПоСреднемуФСЗН
		|	И НачислениеПоБольничномуЛистуНачисления.Ссылка = &парамРегистратор";
		
		Запрос.УстановитьПараметр("парамПоСреднемуФСЗН", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		ИтогСумма = 0;
		ИтогСуммаОрганичения = 0;
		
		//О.Т. Аверсон 10.07.2016 № 1135 
		ДатаПрошл = Дата(1,1,1);
		Пока Выборка.Следующий() Цикл			
			
			//О.Т. 25.02.2015 № 334
			если ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу Тогда 
				СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
				СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
				СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
				СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
				СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
				
				МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
				//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
				ИспользоватьСреднеЧасовойЗаработок = Ложь;
				СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок,НачалоМесяца(Выборка.ДатаНачала));
				
			КонецЕсли;
			//О.Т. 25.02.2015 № 334
			Сумма = СреднедневнойЗаработок*Выборка.ОплаченоДнейЧасов*Выборка.Показатель1/100;
			
			ИтогСумма = ИтогСумма + Сумма;
			
			Если ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение или 
				ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда
				
				//(начало) закомментировано Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				//СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ДатаНачала, -1)), //О.Т. Аверсон 28.04.2016 № 7777 //НачалоМесяца(Выборка.ДатаНачала)
				//Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер; //Островская Татьяна 22.07.2013 № 16623
				//(конец) закомментировано Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				
				//(начало) добавлено Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				Если ЗначениеЗаполнено( ПервичныйБольничныйЛист )   Тогда
					ПериодСредняяЗПРаботников = НачалоМесяца( ПервичныйБольничныйЛист.ДатаНачала ) - 1;
				Иначе	
					ПериодСредняяЗПРаботников = НачалоМесяца( ДатаНачала ) - 1;
				КонецЕсли; 
				СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее( ПериодСредняяЗПРаботников, 
				Новый Структура( "ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников ) ).Размер;
				//(конец) добавлено Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				
				Если (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах) Тогда
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаЧасов;
				Иначе
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаДней;
				КонецЕсли;
				//Островская Татьяна 22.07.2013 № 16645
				если КалендарныеДни Тогда
					НормаВремени = (КонецМесяца(Выборка.ДатаНачала) - НачалоМесяца(Выборка.ДатаНачала)+1)/86400;
				КонецЕсли;
				
				мДатаНачалаСобытияРег = ПолучитьДатуНачалаСобытия();
				Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
					если НачалоМесяца(ДатаНачала) <> НачалоМесяца(ДатаОкончания) Тогда 
						Если НачалоМесяца(Выборка.ДатаНачала) = НачалоМесяца(ДатаНачала) Тогда 
							мДатаНачалаСобытия = ДатаНачала;
						иначе
							мДатаНачалаСобытия = НачалоМесяца(Выборка.ДатаНачала);
						КонецЕсли;
						Если НачалоМесяца(Выборка.ДатаНачала)  = НачалоМесяца(ДатаОкончания) Тогда 
							мДатаКонецСобытия = ДатаОкончания;
						иначе
							мДатаКонецСобытия = НачалоДня(КонецМесяца(Выборка.ДатаНачала));
						КонецЕсли;
					иначе
						мДатаНачалаСобытия = ДатаНачала;
						мДатаКонецСобытия = ДатаОкончания;
						
					КонецЕсли;
					
					Если мДатаНачалаСобытияРег <> мДатаНачалаСобытия Тогда
						ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытияРег) / мДлинаСуток + 1 ;
						ОплаченоРанее = (мДатаНачалаСобытия - мДатаНачалаСобытияРег) / мДлинаСуток;
					Иначе
						ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытия) / мДлинаСуток + 1;
						ОплаченоРанее = 0;
					КонецЕсли;
					//Островская Татьяна 10.06.2014 № 17421
					если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
						График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаКонецСобытия,Новый Структура("Сотрудник",Сотрудник)).ГрафикРаботы;
						ДнейКОплате = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(График, Перечисления.ВидыУчетаВремени.ПоДням, мДатаНачалаСобытия,мДатаКонецСобытия,Организация);//О.Т. Аверсон 16.10.2017 № 1120
					КонецЕсли;
					//Островская Татьяна 10.06.2014 № 17421
					
					// учтем ограничение периода оплаты по одному страховому случаю
					Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 24) - ОплаченоРанее,0) // п.2 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаВзрослым Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 7) - ОплаченоРанее,0) // пп. 6 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					ИначеЕсли СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетАмбулаторно
						Или СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетВСтационаре Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 15) - ОплаченоРанее,0) // пп. 2 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					Иначе
						ОплаченоДниЧасы = Макс(ДнейКОплате - ОплаченоРанее,0)
					КонецЕсли;
				КонецЕсли;
				
				Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
					ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
				иначе
					ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
				КонецЕсли;
				
				если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда 
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).РазмерПоБеременности; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				иначе
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).Размер; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				КонецЕсли;
				РазмерОграничения =  ОбщегоНазначения.ОкруглитьЗначение2016((РазмерОграничения * СредняяПоРБ) / НормаВремени * ОплаченоДниЧасы, ПериодРегистрации);
				если НачалоМесяца(Выборка.ДатаНачала) <> ДатаПрошл Тогда 
					ИтогСуммаОрганичения = ИтогСуммаОрганичения + РазмерОграничения;
					
				КонецЕсли;
				
			КонецЕсли;
			ДатаПрошл = НачалоМесяца(Выборка.ДатаНачала);//О.Т. 07.08.2014 № 164
		КонецЦикла;
		Выборка = Результат.Выбрать();
		//О.Т. Аверсон 10.07.2016 № 1135
		
		
		СекцияСтрокаОплаты = Макет.ПолучитьОбласть("СтрокаВыплат");
		ИтогоКВыплате = 0;
		ИтогоКВыплатеОбщая = 0; //О.Т. Аверсон 11.07.2016 № 1135
		ЗапросНормаДней = Новый Запрос;
		
		ЗапросНормаДней.УстановитьПараметр("парамДатаС", НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачала));
		ЗапросНормаДней.УстановитьПараметр("парамДатаПо", КонецМесяца(ВыборкаПоШапкеДокумента.ДатаОкончания)); 
		
		// НормаДнейТекст = 
		// "ВЫБРАТЬ
		//|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) КАК МесяцПериода,
		//|	СУММА(ПроизводственныйКалендарь.Пятидневка) КАК ДнейПоПятидневке
		//|ИЗ
		//|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК ПроизводственныйКалендарь
		//|ГДЕ
		//|	ПроизводственныйКалендарь.ДатаКалендаря >= &парамДатаС
		//|	И ПроизводственныйКалендарь.ДатаКалендаря <= &парамДатаПо
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	НАЧАЛОПЕРИОДА(ПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ)";
		
		//ЗапросНормаДней.Текст = НормаДнейТекст;
		//НормаДней = ЗапросНормаДней.Выполнить().Выгрузить(); 
		//О.Т. 07.08.2014 № 164
		СекцияИтогПоМесяцу = Макет.ПолучитьОбласть("ИтогПоМесяцу");
		ДатаПрошл = Дата(1,1,1);
		ИтогНормаСумма = 0;
		СуммаОбщаяИтог = 0; //О.Т. Аверсон 11.07.2016 № 1135
		//О.Т. 07.08.2014 № 164
		Пока Выборка.Следующий() Цикл
			//О.Т. 25.02.2015 № 334
			если ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу Тогда 
				СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
				СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
				СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
				СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
				СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
				
				МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
				//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
				ИспользоватьСреднеЧасовойЗаработок = Ложь;
				СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок,НачалоМесяца(Выборка.ДатаНачала));
				
			КонецЕсли;
			//О.Т. 25.02.2015 № 334
			
			//О.Т. 07.08.2014 № 164
			если НачалоМесяца(Выборка.ДатаНачала) <> ДатаПрошл и ДатаПрошл <> Дата(1,1,1) Тогда 
				СекцияИтогПоМесяцу.Параметры.ИтогНормаСумма = ИтогНормаСумма; 
				Если ИтогСумма > ИтогСуммаОрганичения и ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда //О.Т. Аверсон 10.07.2016 № 1135
					СекцияИтогПоМесяцу.Параметры.КВыплатеОграничение = РазмерОграничения;
				КонецЕсли;  				
				ТабДокумент.Вывести(СекцияИтогПоМесяцу);
				ИтогНормаСумма = 0;
			КонецЕсли;
			//О.Т. 07.08.2014 № 164
			СекцияСтрокаОплаты.Параметры.Год = Год(Выборка.ДатаНачала);
			СекцияСтрокаОплаты.Параметры.Месяц = Месяц(Выборка.ДатаНачала);
			//СекцияСтрокаОплаты.Параметры.Оплачено = Выборка.НормаДней;
			СекцияСтрокаОплаты.Параметры.Оплачено = Выборка.ОплаченоДнейЧасов;
			
			//Аверсон ЕАЕ 05.09.2024 СВФР-013586
			Если ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП) Тогда
				//Здесь выведем мин.заработок
				
				//Аверсон ЕАЕ 27.09.2024 СВФР-013786
				НужныйПериод = ТЗПериоды.Найти(Выборка.ДатаНачала, "НачалоПериода");
				СрЗаработокРасчетный = 0;
				Если НужныйПериод = Неопределено Тогда 
					НужныйПериод = ТЗПериоды.Найти(НачалоМесяца(Выборка.ДатаНачала), "НачалоПериода");
                КонецЕсли;
				Если НужныйПериод <> Неопределено Тогда
					СрЗаработокРасчетный = НужныйПериод.СрЗаработокРасчетный;		
				КонецЕсли;
				Если ТЗПериоды.количество() = 1 и СрЗаработокРасчетный =0 Тогда
					СрЗаработокРасчетный =ТЗПериоды[0].СрЗаработокРасчетный; 
				КонецЕсли;
				//Аверсон СВФР-013786
				
				СекцияСтрокаОплаты.Параметры.Коэффициент = Окр(СрЗаработокРасчетный * Выборка.ОплаченоДнейЧасов, 2); 
			Иначе 
			//Аверсон СВФР-013586
			
				СекцияСтрокаОплаты.Параметры.Коэффициент = ?(ЗначениеЗаполнено(Выборка.Показатель6), Выборка.Показатель6, 1); 
			КонецЕсли;
			СекцияСтрокаОплаты.Параметры.Процент = Выборка.Показатель1;
			//Островская Татьяна 15.01.2013
			//О.Т. 07.08.2014 № 164
			Сумма = СреднедневнойЗаработок*Выборка.ОплаченоДнейЧасов*Выборка.Показатель1/100;
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
			СекцияСтрокаОплаты.Параметры.Сумма = Формат(ОбщегоНазначения.ОкруглитьРезультат(Сумма, Константы.ОкруглениеСуммДляБЛ.Получить()),"ЧДЦ="+Строка(ЗначениеОкругления));
			СуммаОбщаяИтог = СуммаОбщаяИтог + ОбщегоНазначения.ОкруглитьЗначение2016(ОбщегоНазначения.ОкруглитьРезультат(Сумма, Константы.ОкруглениеСуммДляБЛ.Получить()),ПериодРегистрации); //Аверсон 24.11.2020 КВВ СВФР-006808
			//О.Т. 07.08.2014 № 164
			//Островская Татьяна 15.01.2013
			Если ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение или 
				ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда
				//СтрокаДней = НормаДней.НайтиСтроки(Новый Структура ("МесяцПериода", НачалоМесяца(Выборка.ДатаНачала)));
				
				//(начало) закомментировано Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				//СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ДатаНачала, -1)), //О.Т. Аверсон 28.04.2016 № 7777 //НачалоМесяца(Выборка.ДатаНачала)
				//Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер; //Островская Татьяна 22.07.2013 № 16623
				//(конец) закомментировано Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				
				//(начало) добавлено Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				Если ЗначениеЗаполнено( ПервичныйБольничныйЛист )   Тогда
					ПериодСредняяЗПРаботников = НачалоМесяца( ПервичныйБольничныйЛист.ДатаНачала ) - 1;
				Иначе	
					ПериодСредняяЗПРаботников = НачалоМесяца( ДатаНачала ) - 1;
				КонецЕсли; 
				СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее( ПериодСредняяЗПРаботников, 
				Новый Структура( "ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников ) ).Размер;
				//(конец) добавлено Кухарчуком Д.Я. 13.08.18, Задача СВФР-002295
				
				
				Если (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах) Тогда
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаЧасов;
				Иначе
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаДней;
				КонецЕсли;
				//Островская Татьяна 22.07.2013 № 16645
				если КалендарныеДни Тогда
					НормаВремени = (КонецМесяца(Выборка.ДатаНачала) - НачалоМесяца(Выборка.ДатаНачала)+1)/86400;
					//Если СпособРасчетаВДнях Тогда
					//	НормаВремени = ПрочиеПроцедуры.ПолучитьДниПоКалендарю (НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала),Сотрудник,Ссылка);
					//Иначе
					//	НормаВремени = ПрочиеПроцедуры.ПолучитьДниПоКалендарю (НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала),Сотрудник,Ссылка);
					//КонецЕсли;
				КонецЕсли;
				//Островская Татьяна 22.07.2013 № 16645
				//Островская Татьяна 22.07.2013 № 16645
				Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
					ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
				иначе
					ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
				КонецЕсли;
				
				если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда 
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).РазмерПоБеременности; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				иначе
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).Размер; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				КонецЕсли;
				//О.Т. 11.08.2014 № 164
				мДатаНачалаСобытияРег = ПолучитьДатуНачалаСобытия();
				Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
					если НачалоМесяца(ДатаНачала) <> НачалоМесяца(ДатаОкончания) Тогда 
						Если НачалоМесяца(Выборка.ДатаНачала) = НачалоМесяца(ДатаНачала) Тогда 
							мДатаНачалаСобытия = ДатаНачала;
						иначе
							мДатаНачалаСобытия = НачалоМесяца(Выборка.ДатаНачала);
						КонецЕсли;
						Если НачалоМесяца(Выборка.ДатаНачала) =  НачалоМесяца(ДатаОкончания) Тогда 
							мДатаКонецСобытия = ДатаОкончания;
						иначе
							мДатаКонецСобытия = НачалоДня(КонецМесяца(Выборка.ДатаНачала));
						КонецЕсли;
					иначе
						мДатаНачалаСобытия = ДатаНачала;
						мДатаКонецСобытия = ДатаОкончания;
						
					КонецЕсли;
					
					Если мДатаНачалаСобытияРег <> мДатаНачалаСобытия Тогда
						ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытияРег) / мДлинаСуток + 1;
						ОплаченоРанее = (мДатаНачалаСобытия - мДатаНачалаСобытияРег) / мДлинаСуток;
					Иначе
						ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытия) / мДлинаСуток + 1;
						ОплаченоРанее = 0;
					КонецЕсли;
					//Островская Татьяна 10.06.2014 № 17421
					если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
						График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаКонецСобытия,Новый Структура("Сотрудник",Сотрудник)).ГрафикРаботы;
						ДнейКОплате = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(График, Перечисления.ВидыУчетаВремени.ПоДням, мДатаНачалаСобытия,мДатаКонецСобытия,Организация);//О.Т. Аверсон 16.10.2017 № 1120
					КонецЕсли;
					//Островская Татьяна 10.06.2014 № 17421
					
					// учтем ограничение периода оплаты по одному страховому случаю
					Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 24) - ОплаченоРанее,0) // п.2 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаВзрослым Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 7) - ОплаченоРанее,0) // пп. 6 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					ИначеЕсли СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетАмбулаторно
						Или СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетВСтационаре Тогда
						ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 15) - ОплаченоРанее,0) // пп. 2 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
					Иначе
						ОплаченоДниЧасы = Макс(ДнейКОплате - ОплаченоРанее,0)
					КонецЕсли;
				КонецЕсли;
				
				//О.Т. 11.08.2014 № 1164
				РазмерОграничения =  ОбщегоНазначения.ОкруглитьЗначение2016((РазмерОграничения * СредняяПоРБ) / НормаВремени * ОплаченоДниЧасы, ПериодРегистрации);
				//Островская Татьяна 22.07.2013 № 16645
				//СекцияСтрокаОплаты.Параметры.НормаСумма =  ОбщегоНазначения.ОкруглитьРезультат(РазмерОграничения, Константы.ОкруглениеСуммДляБЛ.Получить());
				если ИтогНормаСумма = 0 Тогда 
					ИтогНормаСумма = ИтогНормаСумма + РазмерОграничения;//О.Т. 07.08.2014 № 164
				КонецЕсли;
				//О.Т. 07.08.2014 № 164
			КонецЕсли;
			//Островская Татьяна 15.01.2013	
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
			//Островская Татьяна 15.01.2013		
			Если ИтогСумма > ИтогСуммаОрганичения и ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда //О.Т. Аверсон 10.07.2016 № 1135
				Если НачалоМесяца(Выборка.ДатаНачала) <> ДатаПрошл Тогда 
					ИтогоКВыплатеОбщая = ИтогоКВыплатеОбщая + ?(Формат(РазмерОграничения,"ЧДЦ="+Строка(ЗначениеОкругления))="",0,Число(Формат(РазмерОграничения,"ЧДЦ="+Строка(ЗначениеОкругления))));
				КонецЕсли;
			иначе
				СекцияСтрокаОплаты.Параметры.КВыплате =  Формат(Выборка.Результат,"ЧДЦ="+Строка(ЗначениеОкругления));
				ИтогоКВыплатеОбщая = ИтогоКВыплатеОбщая + ?(Формат(Выборка.Результат,"ЧДЦ="+Строка(ЗначениеОкругления))="",0,Число(Формат(Выборка.Результат,"ЧДЦ="+Строка(ЗначениеОкругления))));
			КонецЕсли;
			ИтогоКВыплате = ИтогоКВыплате + ?(Формат(Выборка.Результат,"ЧДЦ="+Строка(ЗначениеОкругления))="",0,Число(Формат(Выборка.Результат,"ЧДЦ="+Строка(ЗначениеОкругления))));
			
			//Островская Татьяна 15.01.2013
			
			//Островская Татьяна 15.01.2013
			
			//Аверсон ЕАЕ 05.09.2024 СВФР-013586 
			Если ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП) Тогда
				СекцияСтрокаОплаты.Параметры.НормаСумма = РазмерОграничения;
			КонецЕсли;
			//Аверсон СВФР-013586
			
			ТабДокумент.Вывести(СекцияСтрокаОплаты);
			ДатаПрошл = НачалоМесяца(Выборка.ДатаНачала);//О.Т. 07.08.2014 № 164
		КонецЦикла;
		//О.Т. 07.08.2014 № 164
		СекцияИтогПоМесяцу.Параметры.ИтогНормаСумма = ИтогНормаСумма; 
		Если ИтогСумма > ИтогСуммаОрганичения и ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда //О.Т. Аверсон 10.07.2016 № 1135
			СекцияИтогПоМесяцу.Параметры.КВыплатеОграничение = РазмерОграничения;
		КонецЕсли;
		
		//Аверсон ЕАЕ 05.09.2024 СВФР-013586
		//Если Не (ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП)) Тогда
			ТабДокумент.Вывести(СекцияИтогПоМесяцу);
		//КонецЕсли;  вывод после каждого месяца
		//О.Т. 07.08.2014 № 164
		
		//
		// Вывод подвала
		СекцияПодвал = Макет.ПолучитьОбласть("Подвал");
		//Островская Татьяна 28.12.2012 № 16068
		если РаботалВПервыйДеньБЛ Тогда 
			СекцияПодвал.Параметры.ДопТекст = "Удержано в связи с работой в 1-ый день БЛ(-1дн.)"
		КонецЕсли;
		//Островская Татьяна 28.12.2012 № 16068
		
		//Аверсон ЕАЕ 05.09.2024 СВФР-013586
		//Если Не (ЗначениеЗаполнено(РазмерСреднегоЗаработка) И (ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ ИЛИ ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП)) Тогда
		//	СекцияПодвал.Параметры.ИтогоКВыплате = ИтогоКВыплате;
		//КонецЕсли;  двоит вывод итога
	
		СекцияПодвал.Параметры.ИтогКВыплатеОбщая = ИтогоКВыплатеОбщая;
		СекцияПодвал.Параметры.ИтогМаксРазмерОбщая = ИтогСуммаОрганичения;
		СекцияПодвал.Параметры.ИтогСуммаОбщая = Формат(СуммаОбщаяИтог,"ЧДЦ="+Строка(ЗначениеОкругления));
		
		
		
		СекцияПодвал.Параметры.КВыплатеПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ИтогоКВыплате, Константы.ВалютаРегламентированногоУчета.Получить());
		
		
		//Аверсон 12.10.2021 КВВ СВФР-008203 (
		Если Организация.ИНН = "100765738" ИЛИ Организация.ИНН = "190530779" Тогда //Госпиталь
			Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
				Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.НачальникГруппы Тогда 
					СекцияПодвал.Параметры.ДолжностьФИО = стрОтв.Должность;
					СекцияПодвал.Параметры.ОтветственныйФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник);
				КонецЕсли;
			КонецЦикла;
		Иначе
			//Аверсон 12.10.2021 КВВ СВФР-008203 )    
			//Островская Татьяна 12.02.2013 № 16216
			СтруктураОтветственный = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Ответственный);
			СекцияПодвал.Параметры.ДолжностьФИО = СтруктураОтветственный.Должность;
			СекцияПодвал.Параметры.ОтветственныйФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Ответственный.Сотрудник);//СтруктураОтветственный.ФИО; 
			//Островская Татьяна 12.02.2013 № 16216
		КонецЕсли;
		
		//Аверсон 28.01.2023 КВВ СВФР-010240 (
		//Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
		//	Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
		//		СекцияПодвал.Параметры.ГлБухгалтер = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник);
		//	КонецЕсли;  			
		//КонецЦикла;
		СтаршийБух = "";
		Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
			Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.СтаршийБухгалтер Тогда 
				СтаршийБух = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник); 
			КонецЕсли;
		КонецЦикла;

		ГлавныйБух = "";
		Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
			Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
				ГлавныйБух = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник); 
			КонецЕсли;
		КонецЦикла;
		СекцияПодвал.Параметры.ГлБухгалтер = ?(ЗначениеЗаполнено(СтаршийБух),СтаршийБух,?(ЗначениеЗаполнено(ГлавныйБух),ГлавныйБух,""));
		СекцияПодвал.Параметры.ДолжностьГБ = ?(ЗначениеЗаполнено(СтаршийБух),"Старший бухгалтер","Главный бухгалтер");
		//Аверсон 28.01.2023 КВВ СВФР-010240 )
		
		//
		ТабДокумент.Вывести(СекцияПодвал);
		//
		//
		//Возврат ТабДокумент;
		РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (оборот листка нетрудоспособности)");
		
		
		
	КонецФункции // Печать()
	
	//Усков Сергей 08.08.2013 № 16699+
	Процедура ПечатьОборота11072013(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь)
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеПоБольничномуЛисту_Оборот11072013";
		
		Макет = ПолучитьМакет(ИмяМакета);
		
		//Островская Татьяна 17.04.2014 № 17287
		ТочностьСреднего = Константы.ТочностьСреднегоЗаработка.Получить();
		Если ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
			ЗначениеТочностьСреднего = 0;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
			ЗначениеТочностьСреднего = 1;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
			ЗначениеТочностьСреднего = 2;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
			ЗначениеТочностьСреднего = 3;
		ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
			ЗначениеТочностьСреднего = 4;
		иначе
			ЗначениеТочностьСреднего = 0;
		КонецЕсли;
		//Островская Татьяна 17.04.2014 № 17287
		
		СекцияЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
		СекцияШапкаОплаты = Макет.ПолучитьОбласть("РазмерПособияШапка");
		СекцияСтрокаОплаты = Макет.ПолучитьОбласть("РазмерПособияСтрока");
		СекцияНижняяГраницаОплаты = Макет.ПолучитьОбласть("РазмерПособияНижняяГраница");
		
		СекцияПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ВыборкаПоШапкеДокументадляПечати = СформироватьЗапросПоШапкеДляПечати().Выбрать();
		ВыборкаПоШапкеДокументадляПечати.Следующий();
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
		
		// Определение даты начала и конца оплачиваемого события 
		ДатаНачалаСобытия 			= ВыборкаПоШапкеДокумента.ДатаНачала;
		ДатаОкончанияСобытия 		= ВыборкаПоШапкеДокумента.ДатаОкончания;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		Запрос.УстановитьПараметр("ДатаНачалаСобытия", ДатаНачалаСобытия);
		
		//Выборка годовой премии
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.Результат) КАК Результат,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		//|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.ВидРасчета = &ВидРасчетаПоГодовойПремии
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации";
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоГодовойПремии", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		Годовая = Запрос.Выполнить().Выбрать();
		годоваяВМесяц = 0;
		Если Годовая.Следующий() тогда
			ГодоваяВМесяц = Годовая.Результат / 12 * Годовая.КоэффициентИндексации;
		КонецЕсли;
		
		// Запрос выборки среднего заработка
		
		Запрос.Текст = "ВЫБРАТЬ
		|	СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.Результат) КАК Результат,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТарифнаяСтавкаПериода,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТекущаяТарифнаяСтавка,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		//|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.КоэффициентИндексации,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТарифнаяСтавкаПериода,
		|	НачислениеПоБольничнымЛистамРасчетСреднего.ТекущаяТарифнаяСтавка
		|	УПОРЯДОЧИТЬ ПО
		|	МесяцВыборки";
		
		Измерения = Новый Массив(1);
		Измерения[0] = "Сотрудник";
		
		// основные начисления собираем по периодам действия
		РазрезыОсновных = Новый Массив(1);
		РазрезыОсновных[0] = "ПериодДействия";
		
		// дополнительные начисления собираем по периодам регистрации
		РазрезыДополнительных = Новый Массив(2);
		РазрезыДополнительных[0] = "ПериодРегистрации";
		РазрезыДополнительных[1] = "ЧислоМесяцев";
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("Измерения", Измерения);
		Запрос.УстановитьПараметр("РазрезыОсновных", РазрезыОсновных);
		Запрос.УстановитьПараметр("РазрезыДополнительных", РазрезыДополнительных);
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоГодовойПремии", ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		ТаблицаСреднего = Новый ТаблицаЗначений;        
		ТаблицаСреднего.Колонки.Добавить("Месяц");
		ТаблицаСреднего.Колонки.Добавить("Сумма");
		ТаблицаСреднего.Колонки.Добавить("Описание");
		
		ВыборкаСреднегоЗаработка = Запрос.Выполнить().Выбрать();
		
		// Запрос выборки отработанного времени
		ТекстЗапроса = "ВЫБРАТЬ
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки,
		|	//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК НачислениеПоБольничнымЛистамРасчетСреднего
		|ГДЕ
		//|	НачислениеПоБольничнымЛистамРасчетСреднего.Результат <> 0
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки <> &ПустаяДата
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.ВидРасчета = &ВидРасчетаПоЗаработку
		|	И НачислениеПоБольничнымЛистамРасчетСреднего.Ссылка = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеПоБольничнымЛистамРасчетСреднего.МесяцВыборки";
		
		Если СпособРасчетаВДнях Тогда //Островская Татьяна 10.06.2014 № 17421
			//если СпособРасчетаВЧасах Тогда 
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке");
			//иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноДней) КАК ОтработаноПоПятидневке");
			//КонецЕсли;	
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке");
		КонецЕсли;
		
		//Если не СпособРасчетаВЧасах Тогда  //Островская Татьяна 10.06.2014 № 17421
		//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноДней) КАК ОтработаноПоПятидневке");
		//Иначе
		//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке","СУММА(НачислениеПоБольничнымЛистамРасчетСреднего.ОтработаноЧасов) КАК ОтработаноПоПятидневке");
		//КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
		Запрос.УстановитьПараметр("Измерения", Измерения);
		Запрос.УстановитьПараметр("РазрезыОсновных", РазрезыОсновных);
		Запрос.УстановитьПараметр("РазрезыДополнительных", РазрезыДополнительных);
		Запрос.УстановитьПараметр("ВидРасчетаПоФиксПремиям", ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям);
		Запрос.УстановитьПараметр("ВидРасчетаПоЗаработку", ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ);
		Запрос.УстановитьПараметр("ГодоваяПремия", Перечисления.ВидыПремии.ГодоваяПремия);
		Запрос.УстановитьПараметр("ГодПредшествующийСобытию", ГОД(ДатаНачалаСобытия) - 1);
		
		ТаблицаСреднего.Колонки.Добавить("Отработано");
		
		ВыборкаОтработаноПоПятидневке = Запрос.Выполнить().Выгрузить();
		
		//Аверсон-софт, Островская Татьяна 11.06.2012 № 15476
		//О.Т. 15.07.2014 № 123
		СекцияЛицеваяСторона.Параметры.ДатаНачала = Формат(ВыборкаПоШапкеДокумента.ДатаНачала,"ДФ=""дд.ММ.гггг""");
		СекцияЛицеваяСторона.Параметры.ДатаОкончания = Формат(ВыборкаПоШапкеДокумента.ДатаОкончания,"ДФ=""дд.ММ.гггг""");
		
		//Аверсон-софт, Островская Татьяна 11.06.2012 № 15476
		СекцияЛицеваяСторона.Параметры.Заполнить(ВыборкаПоШапкеДокументаДляПечати);
		
		Попытка
			СекцияЛицеваяСторона.Параметры.ДатаПриема = ПрочиеПроцедуры.ПолучитьДанныеОСотруднике('18000101000000', ЭтотОбъект.Сотрудник, 0,Организация).Период;//О.Т. Аверсон 16.10.2017 № 1120
			
		Исключение
		КонецПопытки;
		//О.Т. 15.07.2014 № 123
		//ТабДокумент.Вывести(СекцияЛицеваяСторона);
		
		// Вывод сведений о порядке расчета среднего заработка
		//СекцияРасчетСреднего = Макет.ПолучитьОбласть("РасчетСреднегоИ");
		//СекцияРасчетСреднегоИтог = Макет.ПолучитьОбласть("РасчетСреднегоИИтог"); //Островская Татьяна 22.07.2013 № 16645
		//СекцияРасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего");
		//РасчетСреднего1 = Макет.ПолучитьОбласть("РасчетСреднего1");
		//ТабДокумент.Вывести(СекцияРасчетСреднего1);
		
		// вывод данных о сумме заработка за расчетный период
		НомерСтроки = 0;
		ИтогоЗаработок = 0;
		ИтогоОтработано = 0;
		СтруктураПоиска = Новый Структура("МесяцВыборки");
		
		Если ЭтотОбъект.РучнойРасчетСреднегоЗаработка Тогда
			
			//Аверсон ЕАЕ 08.08.2025 СВФР-016450
			Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда
				ТЗПериоды = ПолучитьПериодыБЛ();
				НС = 0;
				Для Каждого Стр Из ТЗПериоды Цикл
					НС = НС + 1;
					СекцияЛицеваяСторона.Параметры["Месяц"+НС] = Формат(Стр.НачалоПериода, "ДФ='MMMM'");
					СекцияЛицеваяСторона.Параметры["Дней"+НС] = Стр.КоличествоДней;
					СекцияЛицеваяСторона.Параметры["Заработок"+НС] = Стр.Сумма;
				КонецЦикла;
			Иначе 
			//Аверсон СВФР-016450
				
				СекцияЛицеваяСторона.Параметры["Месяц1"] 		= "Ручной ввод";
				СекцияЛицеваяСторона.Параметры["СреднийЗаработок"] = Формат(ЭтотОбъект.РазмерСреднегоЗаработка,"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"2"));//Островская Татьяна 22.07.2013 № 16645
			КонецЕсли;
			
		Иначе 
			
			//Аверсон ЕАЕ 30.06.2022 СВФР-009236
			//50%БМП
			Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда
				ТЗПериоды = ПолучитьПериодыБЛ();
				НС = 0;
				Для Каждого Стр Из ТЗПериоды Цикл
					НС = НС + 1;
					СекцияЛицеваяСторона.Параметры["Месяц"+НС] = Формат(Стр.НачалоПериода, "ДФ='MMMM'");
					СекцияЛицеваяСторона.Параметры["Дней"+НС] = Стр.КоличествоДней;
					СекцияЛицеваяСторона.Параметры["Заработок"+НС] = Стр.Сумма;
				КонецЦикла;
			Иначе
				//Аверсон СВФР-009236
				
				Пока ВыборкаСреднегоЗаработка.Следующий() Цикл
					
					НомерСтроки = НомерСтроки  + 1;
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					Если ПериодРегистрации >= Дата(2016,07,1) Тогда 
						ОписаниеСуммы = "Заработок " +  Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
					иначе  					
						ОписаниеСуммы = "Заработок " +  Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ=2");
					КонецЕсли;
					
					СтруктураПоиска.МесяцВыборки =  ВыборкаСреднегоЗаработка.МесяцВыборки;
					
					ОтработаноДней = ВыборкаОтработаноПоПятидневке.НайтиСтроки(СтруктураПоиска);
					Отработано = 0;
					Для каждого Строка из ОтработаноДней цикл
						Отработано = Отработано + Строка.ОтработаноПоПятидневке;
					КонецЦикла;
					Коэфф = Отработано;
					
					ИтогоЗаработок = ИтогоЗаработок + ВыборкаСреднегоЗаработка.Результат;// + ГодоваяВМесяц;
					ИтогоОтработано = ИтогоОтработано + Отработано;
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					СекцияЛицеваяСторона.Параметры["Месяц"+НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.Месяцвыборки, "ДФ='MMMM'");
					СекцияЛицеваяСторона.Параметры["Дней"+НомерСтроки] = Коэфф;
					Если ПериодРегистрации >=Дата(2016,07,1) Тогда //О.Т. Аверсон 22.06.2016 № 949
						СекцияЛицеваяСторона.Параметры["Заработок"+НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
					иначе
						СекцияЛицеваяСторона.Параметры["Заработок"+НомерСтроки] = Формат(ВыборкаСреднегоЗаработка.Результат,"ЧЦ=15; ЧДЦ=2");
					КонецЕсли;		
					Если ВыборкаСреднегоЗаработка.Количество() = 1 Тогда
						ИтогоОтработано = ?(ИтогоОтработано=0, 1, ИтогоОтработано);
						СекцияЛицеваяСторона.Параметры["ИтогоОтработанно"] = Формат(ИтогоОтработано,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
						СекцияЛицеваяСторона.Параметры["ИтогоЗаработок"] = Формат(ИтогоЗаработок,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
						СекцияЛицеваяСторона.Параметры["СреднийЗаработок"] = Формат(ИтогоЗаработок / ИтогоОтработано,"ЧЦ=15; ЧДЦ="+?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Строка(ЗначениеТочностьСреднего),"0"));//Островская Татьяна 18.04.2014 № 17287
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
			СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
			СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
			СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
			СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
			
			МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
			//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
			ИспользоватьСреднеЧасовойЗаработок = Ложь;//О.Т. Аверсон 09.02.2017 № 282
			СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок);
			ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
			СекцияЛицеваяСторона.Параметры["ИтогоОтработанно"] = Формат(ИтогоОтработано,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
			СекцияЛицеваяСторона.Параметры["ИтогоЗаработок"] = Формат(ИтогоЗаработок,"ЧЦ=15; ЧДЦ="+Строка(ЗначениеОкругления));
			
			//Аверсон ЕАЕ 30.06.2022 СВФР-009236
			//50%БМП
			Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ Тогда                
				СреднедневныеЗаработки = "";
				Для Каждого Стр Из ТЗПериоды Цикл
					СуммаСреднего = ?(Стр.КоличествоДней = 0, 0, Окр(Стр.Сумма / Стр.КоличествоДней * 0.5, ЗначениеТочностьСреднего));
					СреднедневныеЗаработки = СреднедневныеЗаработки + ?(СреднедневныеЗаработки = "", "", "; ") + СуммаСреднего;	
				КонецЦикла;
				СекцияЛицеваяСторона.Параметры["СреднийЗаработок"] = СреднедневныеЗаработки;
			ИначеЕсли ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда                
				СреднедневныеЗаработки = "";
				Для Каждого Стр Из ТЗПериоды Цикл
					СуммаСреднего = ?(Стр.КоличествоДней = 0, 0, Окр(Стр.Сумма / Стр.КоличествоДней, ЗначениеТочностьСреднего));
					СреднедневныеЗаработки = СреднедневныеЗаработки + ?(СреднедневныеЗаработки = "", "", "; ") + СуммаСреднего;	
				КонецЦикла;
				СекцияЛицеваяСторона.Параметры["СреднийЗаработок"] = СреднедневныеЗаработки;
			Иначе
				//Аверсон СВФР-009236
				
				СекцияЛицеваяСторона.Параметры["СреднийЗаработок"] = ?(ЗначениеЗаполнено(ЗначениеТочностьСреднего),Окр(СреднедневнойЗаработок,ЗначениеТочностьСреднего),Окр(СреднедневнойЗаработок,0));//Островская Татьяна 17.04.2014 № 17287	
			КонецЕсли;
			
		КонецЕсли; 
		
		ТабДокумент.Вывести(СекцияЛицеваяСторона);
		
		//Аверсон ЕАЕ 30.06.2022 СВФР-009236
		Если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда
			
			//Аверсон ЕАЕ 08.08.2025 СВФР-016450 
			//Обл = ТабДокумент.Область(20, 1, 21, 8);
			//Обл.Очистить(Истина, Ложь, Истина);
			Если Не РучнойРасчетСреднегоЗаработка Тогда
				Обл = ТабДокумент.Область(20, 1, 21, 8);
				Обл.Очистить(Истина, Ложь, Истина);
			Иначе
				Обл = ТабДокумент.Область(20,2,22,8);
				Обл.Объединить();
				Обл.Очистить(Истина, Ложь, Истина);
				СрЗаработокТекст = "Ручной ввод";
				Для Каждого Стр Из ТЗПериоды Цикл 
					Если Стр.КоличествоДней = 0 Тогда
						Ср = 0;
					Иначе
						Ср = Окр(Стр.Сумма / Стр.КоличествоДней, ЗначениеТочностьСреднего);
					КонецЕсли;
					СрЗаработокТекст = СрЗаработокТекст + ?(СрЗаработокТекст = "","",Символы.ПС) + "Средний заработок = " + Формат(Стр.Сумма,"ЧДЦ=2") + " / " + Формат(Стр.КоличествоДней,"ЧДЦ=0") + " = " + 
					СокрЛП(Ср);	
				КонецЦикла;
				Обл.Текст = СрЗаработокТекст;
			КонецЕсли;
			//Аверсон СВФР-016450
			
		КонецЕсли;
		//Аверсон СВФР-009236
		
		ТабДокумент.Вывести(СекцияШапкаОплаты);
		
		
		//О.Т. 25.02.2015 № 334
		если ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу Тогда 
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(НачислениеПоБольничномуЛистуНачисления.ДатаНачала, МЕСЯЦ) КАК Датаначала,
			|	НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов
			|ИЗ
			|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
			|ГДЕ
			|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета.СпособРасчета = &парамПоСреднемуФСЗН
			|	И НачислениеПоБольничномуЛистуНачисления.Ссылка = &парамРегистратор";
			Запрос.УстановитьПараметр("парамПоСреднемуФСЗН", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
			Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
			ТаблицаСреднийЗП = Новый ТаблицаЗначений;
			ТаблицаСреднийЗП.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
			ТаблицаСреднийЗП.Колонки.Добавить("СреднийЗП",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15, 4)));
			ТЗСредний = Запрос.Выполнить().Выгрузить();
			Для Каждого стрТЗСредний из ТЗСредний Цикл 
				стрТаблицаСреднийЗП = ТаблицаСреднийЗП.Добавить();
				стрТаблицаСреднийЗП.Дата = стрТЗСредний.Датаначала;
				СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
				СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
				СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
				СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
				СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
				
				МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
				//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
				ИспользоватьСреднеЧасовойЗаработок = Ложь;//О.Т. Аверсон 09.02.2017 № 282
				ДатаСр = стрТЗСредний.Датаначала;
				СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок,ДатаСр);
				
				
				стрТаблицаСреднийЗП.СреднийЗП = СреднедневнойЗаработок;
			КонецЦикла;
			ТаблицаСреднийЗП.Свернуть("Дата,СреднийЗП"); //О.Т. Аверсон 28.11.2018 № 2806
			Запрос.Текст = "Выбрать ТЗСредний.Дата, ТЗСредний.СреднийЗП Поместить ВТСреднийПоДате из &ТЗСредний как ТЗСредний";
			Запрос.УстановитьПараметр("ТЗСредний",ТаблицаСреднийЗП);
			Запрос.Выполнить();
		КонецЕсли;
		//О.Т. 25.02.2015 № 334
		
		//Запрос.Текст = "ВЫБРАТЬ
		//|	НачислениеПоБольничномуЛистуНачисления.Показатель1,
		//|	НачислениеПоБольничномуЛистуНачисления.Результат,
		//|	НачислениеПоБольничномуЛистуНачисления.НормаДней,
		//|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета,
		//|	НачислениеПоБольничномуЛистуНачисления.НомерСтроки,
		//|	НачислениеПоБольничномуЛистуНачисления.ДатаНачала,
		//|	НачислениеПоБольничномуЛистуНачисления.ДополнительныеДанные КАК ДополнительныеДанные1,
		//|	НачислениеПоБольничномуЛистуНачисления.Показатель6,
		//|	НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов
		//|ИЗ
		//|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
		//|ГДЕ
		//|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета.СпособРасчета = &парамПоСреднемуФСЗН
		//|	И НачислениеПоБольничномуЛистуНачисления.Ссылка = &парамРегистратор";
		//Островская Татьяна 08.10.2013
		
		//О.Т. 25.02.2015 № 334
		если ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	НачислениеПоБольничномуЛистуНачисления.Показатель1 КАК процент,
			|	НачислениеПоБольничномуЛистуНачисления.Результат,
			|	НАЧАЛОПЕРИОДА(НачислениеПоБольничномуЛистуНачисления.ДатаНачала, МЕСЯЦ) КАК Датаначала,
			|	НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов,
			|	ВТСреднийПоДате.СреднийЗП * НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов КАК Результат1
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСреднийПоДате КАК ВТСреднийПоДате
			|		ПО (НАЧАЛОПЕРИОДА(НачислениеПоБольничномуЛистуНачисления.ДатаНачала, МЕСЯЦ) = ВТСреднийПоДате.Дата)
			|ГДЕ
			|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета.СпособРасчета = &парамПоСреднемуФСЗН
			|	И НачислениеПоБольничномуЛистуНачисления.Ссылка = &парамРегистратор
			
			//Аверсон 25.05.2022 КВВ СВФР-009114 (
			|И (НачислениеПоБольничномуЛистуНачисления.Ссылка.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.БольничныйЛистАлкоголь)
			|ИЛИ
			|(НачислениеПоБольничномуЛистуНачисления.Ссылка.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.БольничныйЛистАлкоголь)
			|И НачислениеПоБольничномуЛистуНачисления.Результат <> 0
			|))
			//Аверсон 25.05.2022 КВВ СВФР-009114 )
			
			|;
			|";
		иначе
			Запрос.Текст = "ВЫБРАТЬ
			|	НачислениеПоБольничномуЛистуНачисления.Показатель1 КАК процент,
			|	НачислениеПоБольничномуЛистуНачисления.Результат как результат1,
			|	НАЧАЛОПЕРИОДА(НачислениеПоБольничномуЛистуНачисления.ДатаНачала, МЕСЯЦ) КАК Датаначала,
			|	НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов,
			|	&СреднийЗаработок * НачислениеПоБольничномуЛистуНачисления.ОплаченоДнейЧасов * НачислениеПоБольничномуЛистуНачисления.Показатель1/100 КАК Результат //О.Т. Аверсон 19.06.2017 № 734
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК НачислениеПоБольничномуЛистуНачисления
			|ГДЕ
			|	НачислениеПоБольничномуЛистуНачисления.ВидРасчета.СпособРасчета = &парамПоСреднемуФСЗН
			|	И НачислениеПоБольничномуЛистуНачисления.Ссылка = &парамРегистратор
			
			//Аверсон 25.05.2022 КВВ СВФР-009114 (
			|И (НачислениеПоБольничномуЛистуНачисления.Ссылка.ПричинаНетрудоспособности <> ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.БольничныйЛистАлкоголь)
			|ИЛИ
			|(НачислениеПоБольничномуЛистуНачисления.Ссылка.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.БольничныйЛистАлкоголь)
			|И НачислениеПоБольничномуЛистуНачисления.Результат <> 0
			|))
			//Аверсон 25.05.2022 КВВ СВФР-009114 )
			
			|;
			|";
		КонецЕсли;
		//О.Т. 25.02.2015 № 334
		Если причинанетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь Тогда     
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
			
			|	вт.Датаначала,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 40
			|				ТОГДА вт.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент80,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 50
			|				ТОГДА вт.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент100,
			
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 40
			|				ТОГДА вт.ОплаченоДнейЧасов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОплаченоДнейЧасов80,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 40
			|				ТОГДА вт.Результат1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент801,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 50
			|				ТОГДА вт.Результат1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент1001,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 50
			|				ТОГДА вт.ОплаченоДнейЧасов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОплаченоДнейЧасов100,
			|	СУММА(вт.ОплаченоДнейЧасов) КАК ОплаченоДнейЧасов
			|ИЗ
			|	вт КАК вт
			|
			|СГРУППИРОВАТЬ ПО
			|	вт.Датаначала";
			
		Иначе 
			Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
			
			|	вт.Датаначала,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 80
			|				ТОГДА вт.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент80,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 100
			|				ТОГДА вт.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент100,
			
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 80
			|				ТОГДА вт.ОплаченоДнейЧасов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОплаченоДнейЧасов80,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент <= 80
			|				ТОГДА вт.Результат1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент801,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 100
			|				ТОГДА вт.Результат1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК процент1001,
			|	СУММА(ВЫБОР
			|			КОГДА вт.процент = 100
			|				ТОГДА вт.ОплаченоДнейЧасов
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ОплаченоДнейЧасов100,
			|	СУММА(вт.ОплаченоДнейЧасов) КАК ОплаченоДнейЧасов
			|ИЗ
			|	вт КАК вт
			|
			|СГРУППИРОВАТЬ ПО
			|	вт.Датаначала";
			//Островская Татьяна 08.10.2013
		КонецЕсли;
		//Островская Татьяна 08.10.2013
		
		Запрос.УстановитьПараметр("парамПоСреднемуФСЗН", Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
		//О.Т. 11.08.2014 
		СписокСоставляющихСреднегоЗаработка = Новый Массив(5); 
		СписокСоставляющихСреднегоЗаработка[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
		СписокСоставляющихСреднегоЗаработка[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
		СписокСоставляющихСреднегоЗаработка[2] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
		СписокСоставляющихСреднегоЗаработка[3] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
		
		МесяцевРасчетногоПериода = ВидРасчета.ПериодРасчетаСреднегоЗаработка;	
		//ИспользоватьСреднеЧасовойЗаработок = (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах); //Островская Татьяна 10.06.2014 № 17421
		ИспользоватьСреднеЧасовойЗаработок = Ложь; //О.Т. Аверсон 09.02.2017 № 282
		СреднедневнойЗаработок = РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, МесяцевРасчетногоПериода, ДатаНачалаСобытия, ИспользоватьСреднеЧасовойЗаработок);
		//О.Т. 11.08.2014 
		
		Запрос.УстановитьПараметр("СреднийЗаработок", СреднедневнойЗаработок);
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		
		ИтогоКВыплате = 0;
		ИтогоМаксПособия = 0;
		
		
		ЗапросНормаДней = Новый Запрос;
		
		ЗапросНормаДней.УстановитьПараметр("парамДатаС", НачалоМесяца(ВыборкаПоШапкеДокумента.ДатаНачала));
		ЗапросНормаДней.УстановитьПараметр("парамДатаПо", КонецМесяца(ВыборкаПоШапкеДокумента.ДатаОкончания)); 
		
		
		ВсегоЗаписей = Выборка.Количество();
		инд=0;
		Пока Выборка.Следующий() Цикл
			
			СекцияСтрокаОплаты.Параметры.Месяц = Формат(Выборка.ДатаНачала, "ДФ='MMMM'");
			
			СекцияСтрокаОплаты.Параметры.КолДней = Строка(Выборка.ОплаченоДнейЧасов80) + ";"+ Строка(Выборка.ОплаченоДнейЧасов100);
			//О.Т. 11.08.2014
			Процент80 = 0;
			если ЗначениеЗаполнено(Выборка.Процент80) Тогда 
				Процент80 = ОбщегоНазначения.ОкруглитьРезультат(Выборка.Процент80, Константы.ОкруглениеСуммДляБЛ.Получить()); //*80/100
			КонецЕсли;  
			Процент100 = 0;
			если ЗначениеЗаполнено(Выборка.Процент100) Тогда 
				Процент100 = ОбщегоНазначения.ОкруглитьРезультат(Выборка.Процент100, Константы.ОкруглениеСуммДляБЛ.Получить());
			КонецЕсли;
			
			//Аверсон 04.05.2020 КВВ СВФР-005943 (
			Если ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда
				Процент100 = ОбщегоНазначения.ОкруглитьРезультат(Выборка.Процент1001, Константы.ОкруглениеСуммДляБЛ.Получить());	
			КонецЕсли;
			//Аверсон 04.05.2020 КВВ СВФР-005943 )
			
			//Аверсон ЕАЕ 21.02.2025 СВФР-014820
			Если РучнойРасчетСреднегоЗаработка Тогда
				Процент100 = ОбщегоНазначения.ОкруглитьРезультат(Выборка.Процент1001, Константы.ОкруглениеСуммДляБЛ.Получить());
				Процент80  = ОбщегоНазначения.ОкруглитьРезультат(Выборка.Процент801, Константы.ОкруглениеСуммДляБЛ.Получить());	
			КонецЕсли;
			//Аверсон СВФР-014820
			
			СекцияСтрокаОплаты.Параметры.Пособие80 = Формат(Процент80,"ЧДЦ=2");
			СекцияСтрокаОплаты.Параметры.Пособие100 = Формат(Процент100,"ЧДЦ=2");			 
			//О.Т. 11.08.2014 
			Если Процент80 < Выборка.процент801 Тогда 
				Процент80 =Выборка.процент801; 
			КонецЕсли;
			Если Процент100 < Выборка.процент1001 Тогда 
				Процент100 =Выборка.процент1001; 
			КонецЕсли;
			//Островская Татьяна 15.01.2013
			СекцияСтрокаОплаты.Параметры.ПособиеВсего = Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Процент80+Процент100,ПериодРегистрации),"ЧДЦ=2");//О.Т. Аверсон 15.03.2016 № 949
			//Островская Татьяна 15.01.2013
			
			Если ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение или 
				ВыборкаПоШапкеДокументадляПечати.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда
				//СтрокаДней = НормаДней.НайтиСтроки(Новый Структура ("МесяцПериода", НачалоМесяца(Выборка.ДатаНачала)));
				СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ДатаНачала, -1)), //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер; //Островская Татьяна 22.07.2013 № 16623
				
				Если (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах) Тогда //Островская Татьяна 10.06.2014 № 17421
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаЧасов;
				Иначе
					НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала), Сотрудник).НормаДней;
				КонецЕсли;
				//Островская Татьяна 22.07.2013 № 16645
				если КалендарныеДни Тогда 
					НормаВремени = (КонецМесяца(Выборка.ДатаНачала) - НачалоМесяца(Выборка.ДатаНачала)+1)/86400;
					//Если СпособРасчетаВДнях Тогда
					//	НормаВремени = ПрочиеПроцедуры.ПолучитьДниПоКалендарю (НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала),Сотрудник,Ссылка);
					//Иначе
					//	НормаВремени = ПрочиеПроцедуры.ПолучитьДниПоКалендарю (НачалоМесяца(Выборка.ДатаНачала),КонецМесяца(Выборка.ДатаНачала),Сотрудник,Ссылка);
					//КонецЕсли;
				КонецЕсли;
				//Островская Татьяна 22.07.2013 № 16645
				//Островская Татьяна 22.07.2013 № 16645
				Если Сотрудник.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
					ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
				иначе
					ВидНалогообложения = Сотрудник.ВидНалогообложенияОсновной;
				КонецЕсли;
				
				если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда 
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).РазмерПоБеременности;//О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				иначе
					РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1)),Новый Структура("Организация,ВидНалогоОбложения", Организация,ВидНалогообложения)).Размер; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
				КонецЕсли;
				РазмерОграничения = (РазмерОграничения * СредняяПоРБ) / НормаВремени * ?(Выборка.ОплаченоДнейЧасов,Выборка.ОплаченоДнейЧасов,днейоплаты);//Выборка.ОплаченоДнейЧасов; если 0 берем из докуента
				//Островская Татьяна 22.07.2013 № 16645
				СекцияСтрокаОплаты.Параметры.МаксРазмерПособия =  ОбщегоНазначения.ОкруглитьЗначение2016(РазмерОграничения, ПериодРегистрации);
			КонецЕсли;                                     
			
			//Аверсон ЕАЕ 26.09.2024 СВФР-013586
			//ИтогоКВыплате = ИтогоКВыплате + ОбщегоНазначения.ОкруглитьЗначение2016(Выборка.Процент80+?(ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ,Выборка.Процент1001,Выборка.Процент100),ПериодРегистрации);  //Аверсон 04.05.2020 КВВ СВФР-005943 //Аверсон 24.11.2020 КВВ СВФР-006808
			//ИтогоКВыплате = ИтогоКВыплате + ОбщегоНазначения.ОкруглитьЗначение2016(Выборка.Процент80 + ?(ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП, Выборка.Процент1001, Выборка.Процент100), ПериодРегистрации);  //Аверсон 04.05.2020 КВВ СВФР-005943 //Аверсон 24.11.2020 КВВ СВФР-006808
			ИтогоКВыплате = ИтогоКВыплате + ОбщегоНазначения.ОкруглитьЗначение2016(Процент80 + ?(ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ или ВыборкаПоШапкеДокумента.ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП, Выборка.Процент1001, Процент100), ПериодРегистрации);  //нарушение итог неверный
			
			ИтогоМаксПособия = ИтогоМаксПособия + ОбщегоНазначения.ОкруглитьЗначение2016(РазмерОграничения, ПериодРегистрации);
			
			инд = инд+1;
			Если инд = ВсегоЗаписей Тогда 
				//Аверсон 25.05.2022 КВВ СВФР-009114 (
				//СекцияСтрокаОплаты.Параметры.СуммаПособияКВыплате = Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Мин(ИтогоКВыплате,ИтогоМаксПособия),ПериодРегистрации),"ЧДЦ=2");//О.Т. Аверсон 15.03.2016 № 949 ,734
				//ИтогоКВыплате = ОбщегоНазначения.ОкруглитьЗначение2016(Мин(ИтогоКВыплате,ИтогоМаксПособия),ПериодРегистрации); //О.Т. Аверсон 19.06.2017 № 734
				ИтогоКВыплате_ = ?(ИтогоМаксПособия<0,ИтогоКВыплате,Мин(ИтогоКВыплате,ИтогоМаксПособия));
				СекцияСтрокаОплаты.Параметры.СуммаПособияКВыплате = Формат(ОбщегоНазначения.ОкруглитьЗначение2016(ИтогоКВыплате_,ПериодРегистрации),"ЧДЦ=2");
				ИтогоКВыплате = ОбщегоНазначения.ОкруглитьЗначение2016(ИтогоКВыплате_,ПериодРегистрации);
				//Аверсон 25.05.2022 КВВ СВФР-009114 )
			КонецЕсли;
			ТабДокумент.Вывести(СекцияСтрокаОплаты);
		КонецЦикла;
		ТабДокумент.Вывести(СекцияНижняяГраницаОплаты);
		//Островская Татьяна 28.12.2012 № 16068
		
		СекцияПодвал.Параметры.СуммаПособияКВыплатеПрописью = РаботаСДиалогами.СформироватьСуммуПрописью(ИтогоКВыплате, Константы.ВалютаРегламентированногоУчета.Получить());
		СекцияПодвал.Параметры.ВедомостьМесяц =  Формат(ВыборкаПоШапкеДокумента.ПериодРегистрации, "ДФ='MMMM'");
		СекцияПодвал.Параметры.ВедомостьГод =  Год(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		
		//Аверсон 25.05.2022 КВВ СВФР-009114 (
		//СекцияПодвал.Параметры.Ответственный = Ответственный;
		СекцияПодвал.Параметры.Ответственный = ?(ЗначениеЗаполнено(Ответственный),?(ЗначениеЗаполнено(Ответственный.Сотрудник),ОбщегоНазначения.ФамилияИнициалыФизЛица(Ответственный.Сотрудник),?(ЗначениеЗаполнено(Ответственный.ФизЛицо),ОбщегоНазначения.ФамилияИнициалыФизЛица(Ответственный.ФизЛицо),Ответственный)),"");
		//Аверсон 25.05.2022 КВВ СВФР-009114 )
		
		//Аверсон 28.01.2023 КВВ СВФР-010240 (
		//Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
		//	Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
		//		СекцияПодвал.Параметры.ГлБухгалтер = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник);
		//	КонецЕсли;  			
		//КонецЦикла;
		СтаршийБух = "";
		Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
			Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.СтаршийБухгалтер Тогда 
				СтаршийБух = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник); 
			КонецЕсли;
		КонецЦикла;

		ГлавныйБух = "";
		Для Каждого стрОтв из Организация.ОтветственныеЛица Цикл 
			Если стрОтв.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер Тогда 
				ГлавныйБух = ОбщегоНазначения.ФамилияИнициалыФизЛица(стрОтв.Сотрудник); 
			КонецЕсли;
		КонецЦикла;
		СекцияПодвал.Параметры.ГлБухгалтер = ?(ЗначениеЗаполнено(СтаршийБух),СтаршийБух,?(ЗначениеЗаполнено(ГлавныйБух),ГлавныйБух,""));
		//Аверсон 28.01.2023 КВВ СВФР-010240 )		
		
		ТабДокумент.Вывести(СекцияПодвал);
		//
		//
		//Возврат ТабДокумент;
		РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним) + " (оборот листка нетрудоспособности)");
		
	КонецПроцедуры	
	//Усков Сергей 08.08.2013 № 16699-
	
	Функция РасчетСреднегоЗаработка(СписокСоставляющихСреднегоЗаработка, ПродолжительностьРасчетногоПериода, ДатаСобытия, ИспользоватьСреднеЧасовойЗаработок,ДатаСр = Неопределено) //О.Т. 25.02.2015 № 334
		
		Запрос = Новый Запрос;
		
		// определим использование среднечасового заработка
		Если ИспользоватьСреднеЧасовойЗаработок = Неопределено Тогда
			
			Запрос.УстановитьПараметр("ДатаНачалаСобытия",		ДатаСобытия);
			Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
			|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ЕСТЬNULL(РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени, ЛОЖЬ)
			|		ИНАЧЕ ЕСТЬNULL(РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ)
			|	КОНЕЦ КАК ИспользоватьСреднеЧасовойЗаработок
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних";
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			
			Результат = Запрос.Выполнить();
			ИспользоватьСреднеЧасовойЗаработок = Ложь;
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ИспользоватьСреднеЧасовойЗаработок = Выборка.ИспользоватьСреднеЧасовойЗаработок;
			КонецЕсли;
			
			
		КонецЕсли;	
		
		Если РучнойРасчетСреднегоЗаработка тогда 
			Возврат РазмерСреднегоЗаработка; 
		Иначе 
			ОсновнойЗаработок = Новый Массив(2);
			ОсновнойЗаработок[0] = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ;
			
			
			ФиксированныеПремии = Новый Массив(2);
			ФиксированныеПремии[0] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
			
			ПоПремиям = Новый Массив(5);
			ПоПремиям[0] = ПланыВидовРасчета.СреднийЗаработок.ПоПремиям;
			ПоПремиям[1] = ПланыВидовРасчета.СреднийЗаработок.ПоФиксПремиям;
			ПоПремиям[2] = ПланыВидовРасчета.СреднийЗаработок.ПоГодовойПремии;
			
			
			Запрос.УстановитьПараметр("ИспользоватьСреднеЧасовойЗаработок", ИспользоватьСреднеЧасовойЗаработок);
			Запрос.УстановитьПараметр("СписокСоставляющихСреднегоЗаработка",СписокСоставляющихСреднегоЗаработка);
			Запрос.УстановитьПараметр("ОсновнойЗаработок",					ОсновнойЗаработок);
			
			Запрос.УстановитьПараметр("ПоПремиям",							ПоПремиям);
			Запрос.УстановитьПараметр("ВсеФиксированныеПремии",				ФиксированныеПремии);
			Запрос.УстановитьПараметр("РасчетныйПериодНачало",				ДобавитьМесяц(НачалоМесяца(ДатаСобытия), - ПродолжительностьРасчетногоПериода));
			Запрос.УстановитьПараметр("РасчетныйПериодОкончание",			НачалоДня(НачалоМесяца(ДатаСобытия) - 1));
			Запрос.УстановитьПараметр("ПродолжительностьРасчетногоПериода",	ПродолжительностьРасчетногоПериода);
			Запрос.УстановитьПараметр("Сотрудник", 							Сотрудник);
			
			МенеджерВТ = Новый МенеджерВременныхТаблиц;
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	РасчетСреднегоЗаработка.ВидРасчета,
			|	РасчетСреднегоЗаработка.Результат,
			|	РасчетСреднегоЗаработка.КоэффициентИндексации,
			|	РасчетСреднегоЗаработка.Сотрудник,
			|	РасчетСреднегоЗаработка.ОтработаноДней,
			|	РасчетСреднегоЗаработка.ОтработаноЧасов,
			|	РасчетСреднегоЗаработка.НормаПоПятидневке,
			|	РасчетСреднегоЗаработка.ОтработаноПоПятидневке,
			|	РасчетСреднегоЗаработка.ЧислоМесяцев,
			|	РасчетСреднегоЗаработка.БазовыйПериодНачало,
			|	РасчетСреднегоЗаработка.БазовыйПериодКонец
			|ПОМЕСТИТЬ ВТ_РасчетСреднегоЗаработка
			|ИЗ
			|	&ТаблицаСреднего КАК РасчетСреднегоЗаработка";
			если ДатаСр <> Неопределено Тогда 
				ТекстЗапроса = ТекстЗапроса + " ГДЕ
				|	РасчетСреднегоЗаработка.МесяцВыборки = &МесяцВыборки";
				Запрос.УстановитьПараметр("МесяцВыборки",ДатаСр);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ТаблицаСреднего",РасчетСреднего);
			Запрос.Текст = ТекстЗапроса;
			Результат = Запрос.Выполнить().Выгрузить(); 
			КоличествоСтрок = Результат[0].Количество;
			
			Если КоличествоСтрок = 0 Тогда
				Возврат 0;
			КонецЕсли;	
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(РасчетСреднегоЗаработка.Результат * ВЫБОР
			|						КОГДА РасчетСреднегоЗаработка.КоэффициентИндексации < 1
			|							ТОГДА 1
			|						ИНАЧЕ РасчетСреднегоЗаработка.КоэффициентИндексации
			|					КОНЕЦ) КАК ВсегоЗаработка,
			|	СУММА(ВЫБОР
			|			КОГДА РасчетСреднегоЗаработка.ВидРасчета В (&ОсновнойЗаработок)
			|					И РасчетСреднегоЗаработка.Сотрудник = &Сотрудник
			|				ТОГДА ВЫБОР
			|						КОГДА &ИспользоватьСреднеЧасовойЗаработок
			|							ТОГДА РасчетСреднегоЗаработка.ОтработаноЧасов
			|						ИНАЧЕ РасчетСреднегоЗаработка.ОтработаноДней
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ВсегоДнейРасчетногоПериода
			|ИЗ
			|	ВТ_РасчетСреднегоЗаработка КАК РасчетСреднегоЗаработка
			|ГДЕ
			|	(РасчетСреднегоЗаработка.Результат <> 0
			|			ИЛИ РасчетСреднегоЗаработка.ОтработаноДней <> 0
			|			ИЛИ РасчетСреднегоЗаработка.ОтработаноЧасов <> 0)
			|	И РасчетСреднегоЗаработка.ВидРасчета В(&СписокСоставляющихСреднегоЗаработка)";
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				//Островская Татьяна 17.04.2014 № 17287
				ТочностьСреднего = Константы.ТочностьСреднегоЗаработка.Получить();
				Если ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр0 Тогда 
					ЗначениеТочностьСреднего = 0;
				ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр1 Тогда 
					ЗначениеТочностьСреднего = 1;
				ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр2 Тогда 
					ЗначениеТочностьСреднего = 2;
				ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр3 Тогда 
					ЗначениеТочностьСреднего = 3;
				ИначеЕсли ТочностьСреднего = Перечисления.ПорядокОкругленияСреднегоЗаработка.Окр4 Тогда 
					ЗначениеТочностьСреднего = 4;
				иначе
					ЗначениеТочностьСреднего = 0;
				КонецЕсли;
				Возврат ?(ЗначениеЗаполнено(ЗначениеТочностьСреднего), Окр(?(Выборка.ВсегоДнейРасчетногоПериода = NULL ИЛИ Выборка.ВсегоДнейРасчетногоПериода = 0,0, (Выборка.ВсегоЗаработка) / Выборка.ВсегоДнейРасчетногоПериода),ЗначениеТочностьСреднего),
				Окр(?(Выборка.ВсегоДнейРасчетногоПериода = NULL ИЛИ Выборка.ВсегоДнейРасчетногоПериода = 0,0, (Выборка.ВсегоЗаработка) / Выборка.ВсегоДнейРасчетногоПериода)));
				
				//Островская Татьяна 17.04.2014 № 17287
			КонецЕсли;
			
			Возврат 0;
		КонецЕсли;
		
	КонецФункции // РасчетСреднедневногоЗаработка()
	
#КонецЕсли

// Формирует записи регистра "ОсновныеНачисленияРаботниковОрганизаций" по данным шапки документа
//
Процедура СформироватьДвиженияПоНачислениям(ВыборкаПоШапкеДокумента, НаборОсновныеНачисления) Экспорт
	
	СтрокаСвойствИзДокумента = "ПериодРегистрации,Сотрудник,ФизЛицо,Организация,ОбособленноеПодразделение,ДатаНачалаСобытия,ПериодРасчетаСреднегоЗаработкаНачало,ПериодРасчетаСреднегоЗаработкаОкончание,РучнойРасчетСреднегоЗаработка";
	
	ДатаНачалаСобытия = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия;
	Если ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда //О.Т. Аверсон 04.04.2018 № 1808
		ДатаОкончанияОплаты = ВыборкаПоШапкеДокумента.ДатаОкончания;// + (ВыборкаПоШапкеДокумента.ДнейОплаты - 1) * мДлинаСуток;
	иначе
		ДатаОкончанияОплаты = ВыборкаПоШапкеДокумента.ДатаНачала + (ВыборкаПоШапкеДокумента.ДнейОплаты - 1) * мДлинаСуток;
	КонецЕсли;
	//ЭтоПереходныйПериодПоЗакону255ФЗ = ДатаНачалаСобытия < мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ДатаОкончания >= мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве;
	//ВариантАлгоритмаРасчета = ПолучитьВариантАлгоритмаРасчета(ЭтоПереходныйПериодПоЗакону255ФЗ);	
	БЛБезОплаты = ?(ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезниПоБеременности, ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезни);
	
	// в зависимости от причины нетрудоспособности оплачивается разное количество дней; процент оплаты также меняется
	ТаблицаИнтерваловОплаты = ЗаполнитьТаблицуИнтервалов(ДатаНачалаСобытия, ВыборкаПоШапкеДокумента.ВидРасчета);
	// таблица значений с колонками:  Месяц, ГрафикРаботы, ГрафикРаботыНорма
	ГрафикиСотрудникаПоМесяцам = ПолучитьГрафикРаботыСотрудника(ВыборкаПоШапкеДокумента);
	ГрафикиСотрудникаПоМесяцам.Индексы.Добавить("Месяц");
	ЕстьДанныеОСотруднике = ГрафикиСотрудникаПоМесяцам.Количество() > 0;
	СтруктураПоиска = Новый Структура("Месяц");
	
	
	Для Каждого ИнтервалОплаты Из ТаблицаИнтерваловОплаты Цикл
		
		НомерИнтервалаОплаты = ТаблицаИнтерваловОплаты.Индекс(ИнтервалОплаты);
		
		Если ИнтервалОплаты.Начало > ДатаОкончания Тогда
			Продолжить;
		КонецЕсли;
		Если НомерИнтервалаОплаты < 2 и ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало < ДатаНачала Тогда
			Продолжить;
		КонецЕсли;
		
		ОкончаниеИнтервалаОплаты = ?(НомерИнтервалаОплаты = 2, ДатаОкончания, Мин(ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток,ДатаОкончания));
		ОкончаниеИнтервалаОплатыНарушения = ?(НомерИнтервалаОплаты = 2, ДатаОкончания, Мин(ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток,ДатаОкончания));
		
		ТекущаяДатаНачала = Макс(ИнтервалОплаты.Начало, ДатаНачала);
		
		Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) Или ВыборкаПоШапкеДокумента.ДатаНарушенияРежима <= ТекущаяДатаНачала Тогда
			//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
			//если не ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь и КалендарныеДни Тогда //Островская Татьяна 02.10.2013 № 16645
			Если ДатаОкончанияОплаты < ТекущаяДатаНачала Тогда
				ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты, ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
			Иначе
				ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты, ДатаОкончанияОплаты, ОкончаниеИнтервалаОплаты, ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
			КонецЕсли;
			//иначе
			//	Если ДатаОкончанияОплаты < ТекущаяДатаНачала Тогда
			//		ТекущаяДатаОкончания = Мин(ОкончаниеИнтервалаОплаты, ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
			//	Иначе
			//		ТекущаяДатаОкончания = Мин(ОкончаниеИнтервалаОплаты, ДатаОкончанияОплаты, ОкончаниеИнтервалаОплаты, ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
			//	КонецЕсли;
			//КонецЕсли;
			//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
		Иначе 
			Если ДатаОкончанияОплаты < ТекущаяДатаНачала Тогда
				ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты, ВыборкаПоШапкеДокумента.ДатаНарушенияРежима - 1);
			Иначе
				//Островская Татьяна 22.07.2013 № 16645
				ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты, ДатаОкончанияОплаты, ОкончаниеИнтервалаОплаты, ?(КалендарныеДни и 
				(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима - 1) < ОкончаниеИнтервалаОплаты,ОкончаниеИнтервалаОплаты, ВыборкаПоШапкеДокумента.ДатаНарушенияРежима - 1));
			КонецЕсли;
		КонецЕсли;
		
		
		Пока ТекущаяДатаНачала <= ТекущаяДатаОкончания Цикл
			
			Если ЕстьДанныеОСотруднике Тогда
				СтруктураПоиска.Месяц = НачалоМесяца(ТекущаяДатаНачала);
				Для каждого ДанныеОГрафиках Из ГрафикиСотрудникаПоМесяцам.НайтиСтроки(СтруктураПоиска) Цикл
					
					// строка движений
					Движение = НаборОсновныеНачисления.Добавить();
					
					ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
					
					// заполнение графиков работы
					ЗаполнитьЗначенияСвойств(Движение,ДанныеОГрафиках); // ГрафикРаботы, ГрафикРаботыНорма, ВидУчетаВремени, ПодразделениеОрганизации 
					
					//Аверсон 30.03.2020 КВВ СВФР-005746 (
					Если ЗначениеЗаполнено(ДанныеОГрафиках.ГрафикРаботыСотр) Тогда
						Движение.ГрафикРаботы = ДанныеОГрафиках.ГрафикРаботыСотр;
					КонецЕсли;
					//Аверсон 30.03.2020 КВВ СВФР-005746 )
					
					// Свойства
					Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
					Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
					//толик на внутреннего совм можно					Если ДанныеОГрафиках.ВидЗанятостиСотрудника = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство Тогда
					//						Движение.ВидРасчета				= БЛБезОплаты;
					//					Иначе
					Движение.ВидРасчета				= ?(Движение.ПериодДействияНачало <= ДатаОкончанияОплаты,ИнтервалОплаты.Расчет,БЛБезОплаты);
					//					КонецЕсли;
					
					// Реквизиты
					Движение.Показатель1				= ИнтервалОплаты.ПроцентОплаты;
					//Если ЭтоПереходныйПериодПоЗакону255ФЗ И НачалоДня(ТекущаяДатаНачала) >= мДатаЗакона255ФЗ И ИнтервалОплаты.ПроцентОплаты <> 50 Тогда
					//	Движение.Показатель1 = Макс(ВыборкаПоШапкеДокумента.ПроцентОплатыПереходногоПериода,ИнтервалОплаты.ПроцентОплаты)
					//КонецЕсли;
					Если Движение.ПериодДействияНачало > ДатаОкончанияОплаты Тогда
						Движение.Показатель1					= 0;
					КонецЕсли;
					Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
					//толик нарушение режима
					Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) И ВыборкаПоШапкеДокумента.ДатаНарушенияРежима >= Движение.ПериодДействияНачало и Движение.ПериодДействияНачало <= ВыборкаПоШапкеДокумента.ДатаНарушенияРежимаКон
						и ВыборкаПоШапкеДокумента.ДатаНарушенияРежима <= Движение.ПериодДействияКонец и Движение.ПериодДействияКонец >= ВыборкаПоШапкеДокумента.ДатаНарушенияРежимаКон Тогда //О.Т. 09.07.2015 № 483
						Если ИнтервалОплаты.ПроцентОплаты = 80 Тогда
							Движение.Показатель1 = 40;
						Иначе
							Движение.Показатель1 = 50;
						КонецЕсли;
					КонецЕсли;
					//Если весь бл наружение
					Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) И 
						ВыборкаПоШапкеДокумента.ДатаНарушенияРежима = ВыборкаПоШапкеДокумента.ДатаНачала и
						ВыборкаПоШапкеДокумента.ДатаНарушенияРежимаКон = ВыборкаПоШапкеДокумента.ДатаОкончания Тогда 
						Если ИнтервалОплаты.ПроцентОплаты = 80 Тогда
							Движение.Показатель1 = 40;
						Иначе
							Движение.Показатель1 = 50;
						КонецЕсли;
					КонецЕсли;
					
					//Аверсон ЕАЕ 29.04.2022 СВФР-008992
					//если период действия полностью входит в период нарушения режима
					Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) Тогда
						Если НачалоДня(Движение.ПериодДействияНачало) >= НачалоДня(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима)
							И НачалоДня(Движение.ПериодДействияКонец) <= НачалоДня(ВыборкаПоШапкеДокумента.ДатаНарушенияРежимаКон) Тогда
							Если ИнтервалОплаты.ПроцентОплаты = 80 Тогда
								Движение.Показатель1 = 40;
							Иначе
								Движение.Показатель1 = 50;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//Аверсон СВФР-008992
					
					//	Если ЭтоПереходныйПериодПоЗакону255ФЗ Тогда
					//		Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениемВРазмереММОТ;
					//	Иначе
					//		Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОграничениемВРазмереММОТбезРК;
					//	КонецЕсли;
					Движение.Авторасчет					= Истина;
					Если Движение.РучнойРасчетСреднегоЗаработка тогда
						Движение.РазмерСреднегоЗаработка = ВыборкаПоШапкеДокумента.РазмерСреднегоЗаработка;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				// строка движений
				Движение = НаборОсновныеНачисления.Добавить();
				
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
				
				// Свойства
				Движение.ПериодДействияНачало		= НачалоДня(ТекущаяДатаНачала);
				Движение.ПериодДействияКонец		= КонецДня(ТекущаяДатаОкончания);
				Движение.ВидРасчета				    = ?(Движение.ПериодДействияНачало <= ДатаОкончанияОплаты,ИнтервалОплаты.Расчет,БЛБезОплаты);
				
				// Реквизиты
				Движение.Показатель1				= ИнтервалОплаты.ПроцентОплаты;
				//Если ЭтоПереходныйПериодПоЗакону255ФЗ И НачалоДня(ТекущаяДатаНачала) >= мДатаЗакона255ФЗ И ИнтервалОплаты.ПроцентОплаты <> 50 Тогда
				//	Движение.Показатель1 = Макс(ВыборкаПоШапкеДокумента.ПроцентОплатыПереходногоПериода,ИнтервалОплаты.ПроцентОплаты)
				//КонецЕсли;
				Если Движение.ПериодДействияНачало > ДатаОкончанияОплаты Тогда
					Движение.Показатель1					= 0;
				КонецЕсли;
				Движение.ДатаНачалаСобытия			= ДатаНачалаСобытия;
				
				//толик нарушение режима
				//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
				Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) И Движение.ПериодДействияНачало >= ВыборкаПоШапкеДокумента.ДатаНарушенияРежима Тогда
					//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598	
					Если ИнтервалОплаты.ПроцентОплаты = 80 Тогда
						Движение.Показатель1 = 40;
					Иначе
						Движение.Показатель1 = 50;
					КонецЕсли;
				КонецЕсли;
				//Движение.ВариантАлгоритмаРасчета	= ВариантАлгоритмаРасчета;
				//Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) И Движение.ПериодДействияНачало >= ВыборкаПоШапкеДокумента.ДатаНарушенияРежима Тогда
				//	Если ЭтоПереходныйПериодПоЗакону255ФЗ Тогда
				//		Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениемВРазмереММОТ;
				//	Иначе
				//		Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОграничениемВРазмереММОТбезРК;
				//	КонецЕсли;
				//КонецЕсли;
				Движение.Авторасчет					= Истина;
				
			КонецЕсли;
			
			ТекущаяДатаНачала = КонецДня(ТекущаяДатаОкончания) + 1;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) Или ВыборкаПоШапкеДокумента.ДатаНарушенияРежима <= ТекущаяДатаНачала Тогда
				//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
				Если ДатаОкончанияОплаты < ТекущаяДатаНачала Тогда
					ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты,ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
				Иначе
					ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОплаты, ОкончаниеИнтервалаОплаты,ТаблицаИнтерваловОплаты[НомерИнтервалаОплаты + 1].Начало - мДлинаСуток);
				КонецЕсли;
				//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
			Иначе 
				Если ДатаОкончанияОплаты < ТекущаяДатаНачала Тогда
					ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ОкончаниеИнтервалаОплаты, ВыборкаПоШапкеДокумента.ДатаНарушенияРежима - 1);
				Иначе
					ТекущаяДатаОкончания = Мин(КонецМесяца(ТекущаяДатаНачала), ДатаОкончанияОплаты, ОкончаниеИнтервалаОплаты, ВыборкаПоШапкеДокумента.ДатаНарушенияРежима - 1);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияПоНачислениям()

// Процедура рассчитывает начисления по среднему и заполняет реквизит Результат таблицы начислений
// Параметры:
//		РассчитываемыеТаблицы  - структура из элементов, соответствующих табличным частям документа. 
//				Значение Истина для каждого из элементов структуры означает необходимость расчета 
//				соответствующей табличной части документа
//		РежимПерерасчета - булево - признак вызов расчета при перерасчете документа
Процедура Рассчитать(РассчитываемыеТаблицы, РежимПерерасчета = Ложь) Экспорт
	
	//Перед вызовом процедуры документ должнен быть записан, движения должны быть удалены 
	
	Отказ = Ложь;
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если РассчитываемыеТаблицы.РасчетСреднего И ЗначениеЗаполнено(ПервичныйБольничныйЛист) и не ТипРасчета = Перечисления.ТипРасчетаБЛ.ПоОкладу Тогда //О.Т. Аверсон 22.04.2016 (если по окладу, то пересчитывать средний)
		РасчетСреднего.Загрузить(ПервичныйБольничныйЛист.РасчетСреднего.Выгрузить());
		Записать();
		РассчитываемыеТаблицы.РасчетСреднего = Ложь;
	КонецЕсли;
	
	РезультатЗапроса = Неопределено;
	Если НЕ РассчитываемыеТаблицы.РасчетСреднего Тогда
		РезультатЗапроса = СформироватьЗапросПоРасчетСреднего();
	КонецЕсли;
	
	Отказ = Не ПроведениеРасчетов.РассчитатьДокументСреднегоЗаработка(ЭтотОбъект, РассчитываемыеТаблицы, ВыборкаПоШапкеДокумента, РежимПерерасчета, РезультатЗапроса);
	
	
	Если Не Отказ Тогда
		// Отразим пособие в учете
		Если РассчитываемыеТаблицы.Начисления Тогда
			Записать();
			//АвтозаполнениеПроводок(ВыборкаПоШапкеДокумента, Не РежимПерерасчета);
		КонецЕсли;
	КонецЕсли;
	//Островская Татьяна 06.06.2014 № 17416
	если ЗначениеЗаполнено(ПервичныйБольничныйЛист)Тогда 
		если ПервичныйБольничныйЛист.РучнойРасчетСреднегоЗаработка Тогда 
			РучнойРасчетСреднегоЗаработка = Истина;
			РазмерСреднегоЗаработка = ПервичныйБольничныйЛист.РазмерСреднегоЗаработка;
		КонецЕсли;
		
	КонецЕсли;
	//Островская Татьяна 06.06.2014 № 17416 
	//О.Т. Аверсон 10.07.2016 № 1135
	Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда 
		ИтогСуммаОрганичения = 0;
		ДатаПрошл = Дата(1,1,1);
		ТЗОграничение = новый ТаблицаЗначений;
		ТЗОграничение.Колонки.Добавить("Месяц");
		ТЗОграничение.Колонки.Добавить("Ограничение");
		
		ТЗМесяца = новый ТаблицаЗначений;
		ТЗМесяца.Колонки.Добавить("Месяц");
		
		Для Каждого стр из Начисления Цикл 
			 Если ЗначениеЗаполнено( ПервичныйБольничныйЛист )   Тогда
				ПериодСредняяЗПРаботников = НачалоМесяца( ПервичныйБольничныйЛист.ДатаНачала ) - 1;
			Иначе	
				ПериодСредняяЗПРаботников = НачалоМесяца( ДатаНачала ) - 1;
			КонецЕсли; 
			СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодСредняяЗПРаботников, //замена на прошлый месяц от первичного бл О.Т. Аверсон 28.04.2016 № 7777 //НачалоМесяца(Выборка.ДатаНачала)
			Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер; //Островская Татьяна 22.07.2013 № 16623
			
			Если (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах) Тогда
				НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(стр.ДатаНачала),КонецМесяца(стр.ДатаНачала), Сотрудник).НормаЧасов;
			Иначе
				НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(стр.ДатаНачала),КонецМесяца(стр.ДатаНачала), Сотрудник).НормаДней;
			КонецЕсли;
			//Островская Татьяна 22.07.2013 № 16645
			если КалендарныеДни Тогда
				НормаВремени = (КонецМесяца(стр.ДатаНачала) - НачалоМесяца(стр.ДатаНачала)+1)/86400;
			КонецЕсли;
			
			мДатаНачалаСобытияРег = ПолучитьДатуНачалаСобытия();
			Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
				если НачалоМесяца(ДатаНачала) <> НачалоМесяца(ДатаОкончания) Тогда 
					Если НачалоМесяца(стр.ДатаНачала) = НачалоМесяца(ДатаНачала) Тогда 
						мДатаНачалаСобытия = ДатаНачала;
					иначе
						мДатаНачалаСобытия = НачалоМесяца(стр.ДатаНачала);
					КонецЕсли;
					Если НачалоМесяца(стр.ДатаНачала) =  НачалоМесяца(ДатаОкончания) Тогда 
						мДатаКонецСобытия = ДатаОкончания;
					иначе
						мДатаКонецСобытия = НачалоДня(КонецМесяца(стр.ДатаНачала));
					КонецЕсли;
				иначе
					мДатаНачалаСобытия = ДатаНачала;
					мДатаКонецСобытия = ДатаОкончания;
					
				КонецЕсли;
				
				Если мДатаНачалаСобытияРег <> мДатаНачалаСобытия Тогда
					ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытияРег) / мДлинаСуток + 1;
					ОплаченоРанее = (мДатаНачалаСобытия - мДатаНачалаСобытияРег) / мДлинаСуток;
				Иначе
					ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытия) / мДлинаСуток + 1;
					ОплаченоРанее = 0;
				КонецЕсли;
				//Островская Татьяна 10.06.2014 № 17421
				если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
					График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаКонецСобытия,Новый Структура("Сотрудник",Сотрудник)).ГрафикРаботы;
					ДнейКОплате = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(График, Перечисления.ВидыУчетаВремени.ПоДням, мДатаНачалаСобытия,мДатаКонецСобытия,Организация);//О.Т. Аверсон 16.10.2017 № 1120
				КонецЕсли;
				//Островская Татьяна 10.06.2014 № 17421
				
				// учтем ограничение периода оплаты по одному страховому случаю
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 24) - ОплаченоРанее,0) // п.2 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаВзрослым Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 7) - ОплаченоРанее,0) // пп. 6 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				ИначеЕсли СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетАмбулаторно
					Или СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетВСтационаре Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 15) - ОплаченоРанее,0) // пп. 2 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				Иначе
					ОплаченоДниЧасы = Макс(ДнейКОплате - ОплаченоРанее,0)
				КонецЕсли;
			КонецЕсли;
			
			
			если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда 
				РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1))).РазмерПоБеременности; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
			иначе
				РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1))).Размер; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
			КонецЕсли;
			РазмерОграничения =  ОбщегоНазначения.ОкруглитьЗначение2016((РазмерОграничения * СредняяПоРБ) / НормаВремени * ОплаченоДниЧасы, ПериодРегистрации);
			СтрТЗМесяца = ТЗМесяца.Добавить();
			СтрТЗМесяца.Месяц = НачалоМесяца(стр.ДатаНачала);
			если НачалоМесяца(стр.ДатаНачала) <> ДатаПрошл Тогда 
				ИтогСуммаОрганичения = ИтогСуммаОрганичения + РазмерОграничения;
				СтрТЗОграничение = ТЗОграничение.Добавить();
				СтрТЗОграничение.Месяц = НачалоМесяца(стр.ДатаНачала);
				СтрТЗОграничение.Ограничение = РазмерОграничения;
				
			КонецЕсли;
			
			
			ДатаПрошл = НачалоМесяца(стр.ДатаНачала);	
		КонецЦикла;	
		МаксимальноеОграничениеПоПособию = ИтогСуммаОрганичения;
		ДатаПрошл = "";
		СуммаПоМесяцу = 0;
		Если ИтогСуммаОрганичения < Начисления.Итог("Результат") Тогда 
			Сч = 0;
			Для Каждого Стр из Начисления Цикл 
				
				СтрОграничениеРез = ТЗОграничение.НайтиСтроки(Новый Структура("Месяц",НачалоМесяца(стр.ДатаНачала)));
				Если СтрОграничениеРез.Количество()>0 Тогда 
					СтрОграничениеРез = СтрОграничениеРез[0];
					КолСтрокМесяца = ТЗМесяца.НайтиСтроки(Новый Структура("Месяц",НачалоМесяца(стр.ДатаНачала))).Количество();
					Если КолСтрокМесяца > 1 Тогда
						Сч = Сч + 1;
					иначе
						Сч = 1;
					КонецЕсли;
					Если Сч = КолСтрокМесяца Тогда 
						Стр.Результат = СтрОграничениеРез.Ограничение - СуммаПоМесяцу;
						СуммаПоМесяцу = 0;
						Сч = 0;
					иначе
						СуммаПоМесяцу = СуммаПоМесяцу + Стр.Результат;
					КонецЕсли;
					
				КонецЕсли;
				ДатаПрошл = НачалоМесяца(стр.ДатаНачала);
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;	
	//О.Т. Аверсон 10.07.2016 № 1135
	
	//Аверсон ЕАЕ 08.01.2024 СВФР-013953
	Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
		Если не  ВидРасчета.способрасчета = Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма тогда     //если нулевая сумма не удаляем
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Результат", 0);
			НужныеСтроки = Начисления.НайтиСтроки(СтруктураОтбора);
			Для Каждого Стр Из НужныеСтроки Цикл
				Начисления.Удалить(Стр);
			КонецЦикла; 
		Конецесли;
	КонецЕсли;
	//Аверсон СВФР-013953
	
КонецПроцедуры // Рассчитать()

// Выполняет перерасчет по заданному списку физлиц
// Параметры
// 	Физлица - массив - ссылки на физлиц
// Возвращаемое значение
//  Нет
//
Процедура Перерассчитать(Физлица = Неопределено) Экспорт
	
	// проверим можно ли что-то делать с документом
	ОписаниеПричиныОтказа = "";
	Если ПроведениеРасчетов.ДокументНельзяИзменятьЗаднимЧислом(Ссылка, ОписаниеПричиныОтказа) Тогда
		ВызватьИсключение(ОписаниеПричиныОтказа);
	КонецЕсли;
	
	// Выполним полный перерасчет документа
	Рассчитать(Новый Структура("Начисления,РасчетСреднего",Истина,Истина), Истина);
	
	// Зафиксируем данные табличных частей после расчета
	Записать();
	
	Движения.НДФЛСведенияОДоходах.Очистить();
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Движения.БУОсновныеНачисления.Очистить();
	Движения.ЕСНОсновныеНачисления.Очистить();
	Движения.ЕСНСведенияОДоходах.Очистить();
	
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	// Получение учетной политики по персоналу организации
	УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
	
	ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		// на основе данных табличной части "начисления" полностью перепишем регистры накопления НДФЛСведенияОДоходах и ВзаиморасчетыСРаботникамиОрганизаций
		ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
	КонецЦикла;
	
	Если ПособиеОтражаетсяВРеглУчетеТекущимДокументом Тогда
		АвтозаполнениеПроводок(ВыборкаПоШапкеДокумента,Ложь);
		Записать();
		ВыборкаПоОтражениеВУчете = СформироватьЗапросПоОтражениеВУчете().Выбрать();
		Пока ВыборкаПоОтражениеВУчете.Следующий() Цикл
			ДобавитьСтрокуОтраженияВУчете(ВыборкаПоШапкеДокумента, ВыборкаПоОтражениеВУчете);
		КонецЦикла;
	КонецЕсли;
	
	// записываем обновленные движения
	Для Каждого Набор Из Движения Цикл
		ТипНабораЗаписей = ТипЗнч(Набор);
		Если ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.НДФЛСведенияОДоходах") 
			Или ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.ВзаиморасчетыСРаботникамиОрганизаций") 
			Или ТипНабораЗаписей = Тип("РегистрНакопленияНаборЗаписей.ЕСНСведенияОДоходах") 
			Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.БУОсновныеНачисления") 
			Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ЕСНОсновныеНачисления") Тогда
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Удалим записи перерасчета по которым выполнен перерасчет
	ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка);
	
	//О.Т. Аверсон 10.07.2016 № 1135
	Если ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеРазмераПособияПоСуммеБЛ Тогда 
		ИтогСуммаОрганичения = 0;
		ДатаПрошл = Дата(1,1,1);
		ТЗОграничение = новый ТаблицаЗначений;
		ТЗОграничение.Колонки.Добавить("Месяц");
		ТЗОграничение.Колонки.Добавить("Ограничение");
		
		ТЗМесяца = новый ТаблицаЗначений;
		ТЗМесяца.Колонки.Добавить("Месяц");
		
		Для Каждого стр из Начисления Цикл 
			
			
			СредняяПоРБ = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ДатаНачала, -1)), //О.Т. Аверсон 28.04.2016 № 7777 //НачалоМесяца(Выборка.ДатаНачала)
			Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер; //Островская Татьяна 22.07.2013 № 16623
			
			Если (не СпособРасчетаВДнях и СпособРасчетаВЧасах)или (СпособРасчетаВДнях и СпособРасчетаВЧасах) Тогда
				НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(стр.ДатаНачала),КонецМесяца(стр.ДатаНачала), Сотрудник).НормаЧасов;
			Иначе
				НормаВремени = ПрочиеПроцедуры.ПолучитьНормуВремениПоГраффику(НачалоМесяца(стр.ДатаНачала),КонецМесяца(стр.ДатаНачала), Сотрудник).НормаДней;
			КонецЕсли;
			//Островская Татьяна 22.07.2013 № 16645
			если КалендарныеДни Тогда
				НормаВремени = (КонецМесяца(стр.ДатаНачала) - НачалоМесяца(стр.ДатаНачала)+1)/86400;
			КонецЕсли;
			
			мДатаНачалаСобытияРег = ПолучитьДатуНачалаСобытия();
			Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
				если НачалоМесяца(ДатаНачала) <> НачалоМесяца(ДатаОкончания) Тогда 
					Если НачалоМесяца(стр.ДатаНачала) = НачалоМесяца(ДатаНачала) Тогда 
						мДатаНачалаСобытия = ДатаНачала;
					иначе
						мДатаНачалаСобытия = НачалоМесяца(стр.ДатаНачала);
					КонецЕсли;
					Если НачалоМесяца(стр.ДатаНачала)  = НачалоМесяца(ДатаОкончания) Тогда 
						мДатаКонецСобытия = ДатаОкончания;
					иначе
						мДатаКонецСобытия = НачалоДня(КонецМесяца(стр.ДатаНачала));
					КонецЕсли;
				иначе
					мДатаНачалаСобытия = ДатаНачала;
					мДатаКонецСобытия = ДатаОкончания;
					
				КонецЕсли;
				
				Если мДатаНачалаСобытияРег <> мДатаНачалаСобытия Тогда
					ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытияРег) / мДлинаСуток + 1;
					ОплаченоРанее = (мДатаНачалаСобытия - мДатаНачалаСобытияРег) / мДлинаСуток;
				Иначе
					ДнейКОплате = (мДатаКонецСобытия - мДатаНачалаСобытия) / мДлинаСуток + 1;
					ОплаченоРанее = 0;
				КонецЕсли;
				//Островская Татьяна 10.06.2014 № 17421
				если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
					График = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаКонецСобытия,Новый Структура("Сотрудник",Сотрудник)).ГрафикРаботы;
					ДнейКОплате = ПрочиеПроцедуры.ПолучитьНормуВремениПоГрафикуЗаИнтервалВремени(График, Перечисления.ВидыУчетаВремени.ПоДням, мДатаНачалаСобытия,мДатаКонецСобытия,Организация);//О.Т. Аверсон 16.10.2017 № 1120
				КонецЕсли;
				//Островская Татьяна 10.06.2014 № 17421
				
				// учтем ограничение периода оплаты по одному страховому случаю
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПособиеПриДолечивании Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 24) - ОплаченоРанее,0) // п.2 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаВзрослым Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 7) - ОплаченоРанее,0) // пп. 6 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				ИначеЕсли СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетАмбулаторно
					Или СлучайУходаЗаБольнымРебенком = Перечисления.СлучаиУходаЗаБольнымиДетьми.ПоУходуДо15тиЛетВСтационаре Тогда
					ОплаченоДниЧасы = Макс(Мин(ДнейКОплате, 15) - ОплаченоРанее,0) // пп. 2 п.5 ст.6 Федерального закона от 29 декабря 2006 г. № 255-ФЗ
				Иначе
					ОплаченоДниЧасы = Макс(ДнейКОплате - ОплаченоРанее,0)
				КонецЕсли;
			КонецЕсли;
			
			
			если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда 
				РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1))).РазмерПоБеременности; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
			иначе
				РазмерОграничения = РегистрыСведений.РазмерОграниченияПособияПоНетрудоспособности.ПолучитьПоследнее(КонецМесяца(ДобавитьМесяц(ПериодРегистрации, -1))).Размер; //О.Т. Аверсон 28.04.2016 № 7777 НачалоМесяца(Выборка.ДатаНачала)
			КонецЕсли;
			РазмерОграничения =  ОбщегоНазначения.ОкруглитьЗначение2016((РазмерОграничения * СредняяПоРБ) / НормаВремени * ОплаченоДниЧасы, ПериодРегистрации);
			СтрТЗМесяца = ТЗМесяца.Добавить();
			СтрТЗМесяца.Месяц = НачалоМесяца(стр.ДатаНачала);
			если НачалоМесяца(стр.ДатаНачала) <> ДатаПрошл Тогда 
				ИтогСуммаОрганичения = ИтогСуммаОрганичения + РазмерОграничения;
				СтрТЗОграничение = ТЗОграничение.Добавить();
				СтрТЗОграничение.Месяц = НачалоМесяца(стр.ДатаНачала);
				СтрТЗОграничение.Ограничение = РазмерОграничения;
				
			КонецЕсли;
			
			
			ДатаПрошл = НачалоМесяца(стр.ДатаНачала);	
		КонецЦикла;	
		МаксимальноеОграничениеПоПособию = ИтогСуммаОрганичения;
		ДатаПрошл = "";
		СуммаПоМесяцу = 0;
		Если ИтогСуммаОрганичения < Начисления.Итог("Результат") Тогда 
			Сч = 0;
			Для Каждого Стр из Начисления Цикл 
				
				СтрОграничениеРез = ТЗОграничение.НайтиСтроки(Новый Структура("Месяц",НачалоМесяца(стр.ДатаНачала)));
				Если СтрОграничениеРез.Количество()>0 Тогда 
					СтрОграничениеРез = СтрОграничениеРез[0];
					КолСтрокМесяца = ТЗМесяца.НайтиСтроки(Новый Структура("Месяц",НачалоМесяца(стр.ДатаНачала))).Количество();
					Если КолСтрокМесяца > 1 Тогда
						Сч = Сч + 1;
					иначе
						Сч = 1;
					КонецЕсли;
					Если Сч = КолСтрокМесяца Тогда 
						Стр.Результат = СтрОграничениеРез.Ограничение - СуммаПоМесяцу;
						СуммаПоМесяцу = 0;
						Сч = 0;
					иначе
						СуммаПоМесяцу = СуммаПоМесяцу + Стр.Результат;
					КонецЕсли;
					
				КонецЕсли;
				ДатаПрошл = НачалоМесяца(стр.ДатаНачала);
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;	
	//О.Т. Аверсон 10.07.2016 № 1135
	
	
КонецПроцедуры // Перерассчитать()

// Выполняет отражение сумм пособия во всех учетах
Функция АвтозаполнениеПроводок(ВыборкаПоШапкеДокумента = Неопределено, ФормироватьДвижения = Истина) Экспорт
	
	// Получим реквизиты шапки из запроса
	Если ВыборкаПоШапкеДокумента = Неопределено Тогда
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		ВыборкаПоШапкеДокумента.Следующий();
	КонецЕсли;
	
	// запрос по соответсвиям статей затрат начислений и статей затарт для 
	// отражения б/л за счет работодателя
	// соответствие будет использоваться только при отражении в учете
	//доли за счет работодателя по данным базовых начислений
	ДополнительныеСтатьиЗатратЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатратНачисления,
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.СтатьяЗатрат
	|ИЗ
	|   РегистрСведений.СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете КАК СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете
	|ГДЕ
	|   СоответствиеСтатейЗатратОтраженияЗарплатыВРеглУчете.ВидСтатьиЗатрат = &ПособияЗаСчетРаботодателя");
	
	ДополнительныеСтатьиЗатратЗапрос.УстановитьПараметр("ДатаЗапроса", ПериодРегистрации);
	ДополнительныеСтатьиЗатратЗапрос.УстановитьПараметр("ПособияЗаСчетРаботодателя", Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя);
	ДополнительныеСтатьиЗатрат = ДополнительныеСтатьиЗатратЗапрос.Выполнить().Выгрузить();
	
	ПараметрыПолученияСубконто = Новый Соответствие;
	ПараметрыПолученияСубконто[Тип("СправочникСсылка.СтатьиЗатрат")] = Новый Структура("ВидСтатьиЗатрат, ДополнительныеСтатьиЗатрат", 
	Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя, 
	ДополнительныеСтатьиЗатрат);
	
	Если ФормироватьДвижения Тогда
		
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = "Формирование списка проводок документа: " + СокрЛП(Ссылка);
		Отказ = Ложь;
		ПроверятьМестоРаботы = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия >= мДатаЗакона180ФЗ;
		
		// перепишем данные из таблицы начислений в набор записей
		ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
		Пока ВыборкаПоНачислениям.Следующий() Цикл 
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок, ПроверятьМестоРаботы);
			
			Если НЕ Отказ Тогда
				Если ВыборкаПоНачислениям.ОсновныеНачисления Тогда
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				Иначе
					ПроведениеРасчетов.ДобавитьСтрокуДополнительныхНачислений(Движения.ДополнительныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// получим реквизиты табличной части
		ВыборкаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего().Выбрать();
		Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок, ПроверятьМестоРаботы);
			
			Если НЕ Отказ Тогда
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Движения.РасчетСреднегоЗаработка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Отказ Тогда
			Возврат Ложь
		КонецЕсли;
		
		Для Каждого Набор Из Движения Цикл
			Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
				или ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.РасчетСреднегоЗаработка") Тогда
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
	мЕНВД = Ложь;
	Если ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
		// определим налоговый режим
		БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете"), КонецМесяца(ПериодРегистрации), Организация);
		УчетнаяПолитика = глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете")[КонецМесяца(ПериодРегистрации)][Организация];
		мУСН = УчетнаяПолитика.УСН;
		мОбъектНалогообложенияУСН = УчетнаяПолитика.ОбъектНалогообложенияУСН;
		мЕНВД = УчетнаяПолитика.ОрганизацияЯвляетсяПлательщикомЕНВД;
		мФСС_БЛ = УчетнаяПолитика.УплачиватьДобровольныеВзносыВФСС;
	КонецЕсли;
	
	УказаноОтражениеВУчетеДляРаботодателя = ВыборкаПоШапкеДокумента.УказаноОтражениеВУчетеДляРаботодателя;
	ВторойКалендарныйДень = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия + мДлинаСуток;
	ТретийКалендарныйДень = ВторойКалендарныйДень + мДлинаСуток;
	
	// для всех болезней, кроме прозводственного травматизма может потребоваться расчетная база
	// расчетная база используется для вычисления доли ЕНВД и для распределения по счетам затрат
	// доли пособия за счет работодателя, когда явно не указан способ отражения пособия за счет работодателя:
	// - два календарных дня при ОСН
	// - при УСН доходы минус расходы, добровольные взносы не уплачиваются
	
	НадоЧитатьРасчетнуюБазу = ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве 
	И ((мЕНВД И ВыборкаПоШапкеДокумента.СтратегияОтраженияВУчете = Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления)
	ИЛИ (Не УказаноОтражениеВУчетеДляРаботодателя	
	И НЕ мУСН
	И (ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание ИЛИ ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаВБыту))
	ИЛИ (Не УказаноОтражениеВУчетеДляРаботодателя
	И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам
	И мУСН и НЕ мФСС_БЛ
	И мОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы));
	//
	
	// основная выборка - по ней ведем обход и вводим записи движений
	РезультатДанныеУчета = ПолучитьДанныеУчета(ВыборкаПоШапкеДокумента, НадоЧитатьРасчетнуюБазу);
	ДанныеУчета = РезультатДанныеУчета.Выбрать();
	
	ПродолжатьОбработку = ДанныеУчета.Следующий(); 
	Успешно = Истина;
	
	НаборЗаписей = ОтражениеВУчете.ВыгрузитьКолонки();
	
	ПодпадаетПодЕНВД = 0;
	
	Если ПродолжатьОбработку и мЕНВД И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
		
		Если ВыборкаПоШапкеДокумента.СтратегияОтраженияВУчете <> Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления Тогда
			
			ПодпадаетПодЕНВД = ВыборкаПоШапкеДокумента.ПроцентЕНВД;
			
		Иначе
			
			ОбщаяБазаРаспределенияСтроки = 0;
			БазаЕНВД = 0;
			
			// вспомогательная выборка - по ней ведем суммирование базовых результатов
			ДанныеУчетаВспомогательные = РезультатДанныеУчета.Выбрать();
			ДанныеУчетаВспомогательные.Следующий();
			ТекущийНомерСтроки = ДанныеУчетаВспомогательные.НомерСтроки;
			
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если НЕ ДанныеУчетаВспомогательные.Сторно Тогда
					Если ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
						Успешно = Ложь;
					Иначе
						ОбщаяБазаРаспределенияСтроки = ОбщаяБазаРаспределенияСтроки + ДанныеУчетаВспомогательные.РезультатБаза;
						Если ДанныеУчетаВспомогательные.ЭтоЕНВД Тогда
							БазаЕНВД = БазаЕНВД + ДанныеУчетаВспомогательные.РезультатБаза
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ОбщаяБазаРаспределенияСтроки = 0 Тогда
				ДоляЕНВД = 0
			Иначе
				ДоляЕНВД = БазаЕНВД / ОбщаяБазаРаспределенияСтроки
			КонецЕсли;
			ПодпадаетПодЕНВД = ДоляЕНВД * 100;
		КонецЕсли;
		
	КонецЕсли;
	
	// вспомогательная выборка - по ней ведем суммирование базовых результатов
	ДанныеУчетаВспомогательные = РезультатДанныеУчета.Выбрать();
	
	// структура поиска для позиционирования в ДанныеНалоговогоУчетаВспомогательные
	// при необходимости суммирования "базовых" ресурсов
	СтруктураПоиска = Новый Структура("НомерСтроки");
	
	#Если Клиент Тогда
		КомментарийОшибкаСбораРасчетнойБазы = "";
		ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	#КонецЕсли
	
	Пока ПродолжатьОбработку Цикл
		
		Если ДанныеУчета.Сторно Тогда
			
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;
			
			СуммаПоСтроке = 0;
			
			// суммируем базовые ресурсы по текущей строке набора записей
			Пока ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
				Если ДанныеУчетаВспомогательные.РезультатСторно = NULL Тогда
					Успешно = Ложь;
				Иначе
					СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатСторно;
				КонецЕсли;
				Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// суммарная доля, которую уже "разбросали" на строки с одинаковым номером строки
			СуммарнаяДоля = 0;
			// полный результат
			ПолныйРезультат = ДанныеУчета.Результат;
			
			СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
			
			// обходим строки и вычисляем долю результата по базовым записям
			ПерваяИзГруппыСтрок = Истина;
			Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				// если это не первая из группы "базовых" строк по одной строке основного регистра
				// то создаем очередную строку движений
				
				Если Не ПерваяИзГруппыСтрок Тогда
					СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
				Иначе
					ПерваяИзГруппыСтрок = Ложь;
				КонецЕсли;
				
				Если СуммаПоСтроке = 0 Тогда
					Доля = 0;
				Иначе
					Если ДанныеУчета.РезультатСторно = NULL Тогда
						Успешно = Ложь;
						Доля = 0;
					Иначе
						Доля = ПолныйРезультат * ДанныеУчета.РезультатСторно / СуммаПоСтроке;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДт;
				СтрокаДанных.СубконтоДт1 = ДанныеУчета.СубконтоДт1;
				СтрокаДанных.СубконтоДт2 = ДанныеУчета.СубконтоДт2;
				СтрокаДанных.СубконтоДт3 = ДанныеУчета.СубконтоДт3;
				СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУ;
				СтрокаДанных.СубконтоДтНУ1 = ДанныеУчета.СубконтоДтНУ1;
				СтрокаДанных.СубконтоДтНУ2 = ДанныеУчета.СубконтоДтНУ2;
				СтрокаДанных.СубконтоДтНУ3 = ДанныеУчета.СубконтоДтНУ3;
				
				СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКт;
				СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1;
				СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2;
				СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3;
				СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУ;
				СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1;
				СтрокаДанных.СубконтоКтНУ2 = ДанныеУчета.СубконтоКтНУ2;
				СтрокаДанных.СубконтоКтНУ3 = ДанныеУчета.СубконтоКтНУ3;
				
				СтрокаДанных.КодДоходаЕСН   = ДанныеУчета.КодДоходаЕСН;
				СтрокаДанных.ОблагаетсяЕНВД = ДанныеУчета.ОблагаетсяЕНВД;
				
				СтрокаДанных.Результат = ?(ПолныйРезультат > 0,Мин(Доля, ПолныйРезультат - СуммарнаяДоля),Макс(Доля,ПолныйРезультат - СуммарнаяДоля));
				СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
				
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// ошибки округления складываются на последнюю запись из группы базовых записей
			СтрокаДанных.Результат = СтрокаДанных.Результат + ПолныйРезультат - СуммарнаяДоля;
			
			
		ИначеЕсли ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда // отражение в учете не зависит от налогового режима
			
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			
			СуммаПоСтроке = ДанныеУчета.Результат;
			СуммаПоСтрокеЕНВД = 0;
			
			Если СуммаПоСтроке = 0 Тогда
				Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
					Если Не ДанныеУчета.Следующий() Тогда
						ПродолжатьОбработку = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			
			СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
			СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ;
			СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
			СтрокаДанных.СубконтоДт2 = Неопределено;
			СтрокаДанных.СубконтоДт3 = Неопределено;
			СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
			СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
			СтрокаДанных.СубконтоКт2 = Неопределено;
			СтрокаДанных.СубконтоКт3 = Неопределено;
			СтрокаДанных.СчетДтНУ	 = Неопределено;
			СтрокаДанных.СчетКтНУ	 = Неопределено;
			СтрокаДанных.СубконтоДтНУ1 = Неопределено;
			СтрокаДанных.СубконтоДтНУ2 = Неопределено;
			СтрокаДанных.СубконтоДтНУ3 = Неопределено;
			СтрокаДанных.СубконтоКтНУ1 = Неопределено;
			СтрокаДанных.СубконтоКтНУ2 = Неопределено;
			СтрокаДанных.СубконтоКтНУ3 = Неопределено;
			СтрокаДанных.ОтражениеВУСН	 = Неопределено;		
			СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
			
			Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
				Если Не ДанныеУчета.Следующий() Тогда
					ПродолжатьОбработку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			ТекущийНомерСтроки = ДанныеУчета.НомерСтроки;
			// позиционируемся во вспомогательной выборке по запросу для суммирования "базовых" данных
			СтруктураПоиска.НомерСтроки = ТекущийНомерСтроки;
			Если ДанныеУчетаВспомогательные.НомерСтроки <> ТекущийНомерСтроки Тогда
				// ищем следующую строку во спомогательной выборке если она не является искомой	
				ДанныеУчетаВспомогательные.НайтиСледующий(СтруктураПоиска);
			КонецЕсли;
			
			СуммаПоСтроке = 0;
			СуммаПоСтрокеЕНВД = 0;
			Если НадоЧитатьРасчетнуюБазу и ВыборкаПоШапкеДокумента.СтратегияОтраженияВУчете = Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления Тогда
				// суммируем базовые ресурсы по текущей строке набора записей
				Пока ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
					Если ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
						Успешно = Ложь;
					Иначе
						СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатБаза;
						Если ДанныеУчетаВспомогательные.ЭтоЕНВД Тогда
							СуммаПоСтрокеЕНВД = СуммаПоСтрокеЕНВД + ДанныеУчетаВспомогательные.РезультатБаза;
						КонецЕсли;						
					КонецЕсли;
					Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли НадоЧитатьРасчетнуюБазу и ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
				// суммируем базовые ресурсы по текущей строке набора записей
				// сюда попали когда для БЛ доля ЕНВД определяется по текущему месяцу, а доля за счет работодателя распределяется по базовым начислениям
				Пока ДанныеУчетаВспомогательные.НомерСтроки = ТекущийНомерСтроки Цикл
					Если ДанныеУчетаВспомогательные.РезультатБаза = NULL Тогда
						Успешно = Ложь;
					Иначе 
						СуммаПоСтроке = СуммаПоСтроке + ДанныеУчетаВспомогательные.РезультатБаза;
					КонецЕсли;
					Если Не ДанныеУчетаВспомогательные.Следующий() Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				СуммаПоСтрокеЕНВД = СуммаПоСтроке * ВыборкаПоШапкеДокумента.ПроцентЕНВД / 100;
			ИначеЕсли ВыборкаПоШапкеДокумента.ПроцентЕНВД = 100 Тогда
				СуммаПоСтроке = ДанныеУчета.Результат;
				СуммаПоСтрокеЕНВД = ДанныеУчета.Результат;
			ИначеЕсли ВыборкаПоШапкеДокумента.ПроцентЕНВД = 0 Тогда
				СуммаПоСтроке = ДанныеУчета.Результат;
			Иначе
				СуммаПоСтроке = ДанныеУчета.Результат;
				СуммаПоСтрокеЕНВД = ДанныеУчета.Результат * ВыборкаПоШапкеДокумента.ПроцентЕНВД / 100;
			КонецЕсли;
			
			Если Не Успешно Тогда
				// не удалось собрать данные отражения в учете, необходимо разобраться зачем мы собирали расчетную базу
				// и сообщить пользователю о проблемах
				
				// ДоляЕНВДПоБазе - необходимо было собирать долю ЕНВД по базовым начислениям
				ДоляЕНВДПоБазе =  мЕНВД и ВыборкаПоШапкеДокумента.СтратегияОтраженияВУчете = Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления;
				
				// ДоляРаботодателяПоБазе - необходимо было собирать долю пособия за счет работодателя по базе
				// данные по базе нужны для 2-х календарных дней и для доли за счет работодателя при УСН доходы минус расходы
				ДоляРаботодателяПоБазе = Не УказаноОтражениеВУчетеДляРаботодателя 
				и ((НЕ мУСН и (ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание
				ИЛИ ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаВБыту)
				и ДанныеУчета.ДоляБЛЗаСчетРаботодателя <>0)
				или (ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам
				и мУСН и НЕ мФСС_БЛ и мОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы));
				
				Если Не ДоляЕНВДПоБазе и Не ДоляРаботодателяПоБазе Тогда
					
					// данные собранные по базе не нужны, можно использовать результат запроса по шапке документа
					Успешно = Истина;
					Если ВыборкаПоШапкеДокумента.ПроцентЕНВД = 100 Тогда
						СуммаПоСтроке = ДанныеУчета.Результат;
						СуммаПоСтрокеЕНВД = ДанныеУчета.Результат;
					ИначеЕсли ВыборкаПоШапкеДокумента.ПроцентЕНВД = 0 Тогда
						СуммаПоСтроке = ДанныеУчета.Результат;
					Иначе
						СуммаПоСтроке = ДанныеУчета.Результат;
						СуммаПоСтрокеЕНВД = ДанныеУчета.Результат * ВыборкаПоШапкеДокумента.ПроцентЕНВД / 100;
					КонецЕсли;
					
				Иначе
					
					Если Не ДоляЕНВДПоБазе Тогда
						// данные по базе нужны только для распределения по счетам затрат доли пособия за счет работодателя
						// соберм суммы и продолжим работу, при этом счет затрат для пособия за счет работодателя будет пустой
						Если ВыборкаПоШапкеДокумента.ПроцентЕНВД = 100 Тогда
							СуммаПоСтроке = ДанныеУчета.Результат;
							СуммаПоСтрокеЕНВД = ДанныеУчета.Результат;
						ИначеЕсли ВыборкаПоШапкеДокумента.ПроцентЕНВД = 0 Тогда
							СуммаПоСтроке = ДанныеУчета.Результат;
						Иначе
							СуммаПоСтроке = ДанныеУчета.Результат;
							СуммаПоСтрокеЕНВД = ДанныеУчета.Результат * ВыборкаПоШапкеДокумента.ПроцентЕНВД / 100;
						КонецЕсли;
					КонецЕсли;
					
					#Если Клиент Тогда
						
						Если ПустаяСтрока(КомментарийОшибкаСбораРасчетнойБазы) Тогда 
							
							//Добавим родительскую сторку
							ТекстСообщения = "Внимание! Нет данных для отражения пособия в учете.
							|Отсутствуют данные по отражению зарплаты в регламентированном учете за расчетный период.";
							КомментарийОшибкаСбораРасчетнойБазы = ОбработкаКомментариев.ДобавитьСообщение(ТекстСообщения, Перечисления.ВидыСообщений.Ошибка);
							
							Если Не ПособиеОтражаетсяВРеглУчетеТекущимДокументом и (ДоляЕНВДПоБазе или ДоляРаботодателяПоБазе) Тогда
								ТекстСообщения = "Рекомендуется зарегистрировать отражение пособия в учете текущим документом.
								|На закладке ""Отражение пособия в учете"" установите ""Отражать в учете по данным текущего документа""
								|и заполните таблицу ""Проводки и данные для ЕСН""";	
								ОбработкаКомментариев.ДобавитьСообщение(ТекстСообщения, Перечисления.ВидыСообщений.ВажнаяИнформация,,КомментарийОшибкаСбораРасчетнойБазы);
							КонецЕсли;
							
							Если ДоляЕНВДПоБазе Тогда
								ТекстСообщения = "Нет данных для определения доли ЕНВД пособия. Стратегия определения доли ЕНВД - ""по базовым начислениям "" задана в ";
								Если Не ПособиеОтражаетсяВРеглУчетеТекущимДокументом Тогда
									ТекстСообщения = ТекстСообщения + "начислении: " + ДанныеУчета.ВидРасчетаНаименование;	
								Иначе
									ТекстСообщения = ТекстСообщения + "документе";
								КонецЕсли;	
								ОбработкаКомментариев.ДобавитьСообщение(ТекстСообщения, Перечисления.ВидыСообщений.ВажнаяИнформация,,КомментарийОшибкаСбораРасчетнойБазы);
							КонецЕсли;	
							
							Если ДоляРаботодателяПоБазе Тогда
								ТекстСообщения = "Нет данных для распределения доли пособия за счет работодателя по счетам затрат.";
								ОбработкаКомментариев.ДобавитьСообщение(ТекстСообщения, Перечисления.ВидыСообщений.ВажнаяИнформация,,КомментарийОшибкаСбораРасчетнойБазы);
							КонецЕсли;
							
						КонецЕсли;
						
					#КонецЕсли
					
				КонецЕсли;
				
			КонецЕсли;	
			
			Если СуммаПоСтроке = 0 Тогда
				Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
					Если Не ДанныеУчета.Следующий() Тогда
						ПродолжатьОбработку = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			
			СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
			
			// доля пособия за счет работодателя за первые два календарных дня может быть
			// при этом ДоляБЛЗаСчетРаботодателя может быть равна нулю по причине отсутствия ФПД
			ЕстьДоляБЛЗаСчетРаботодателя = ТретийКалендарныйДень > ДанныеУчета.ПериодДействияНачало;
			
			Если мУСН и НЕ мФСС_БЛ Тогда  // налоговые режимы: УСН и УСН+ЕНВД, без уплаты добровольных взносов
				
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
					
					Если Не мЕНВД Или СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_УСН;
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;		
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 Тогда
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					
					Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 Тогда
						Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						КонецЕсли;
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;	
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						СтрокаДанных.ОблагаетсяЕНВД = Истина;
					КонецЕсли;
					
					Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
						Если Не ДанныеУчета.Следующий() Тогда
							ПродолжатьОбработку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				Иначе // не травма на производстве и не отпуск по беременности и родам
					
					ВПределахММОТ = ?(ДанныеУчета.Сторно,Макс(ДанныеУчета.Результат,ДанныеУчета.ВПределахММОТ),Мин(ДанныеУчета.Результат,ДанныеУчета.ВПределахММОТ));
					СтрокаДанных.Результат	 = ВПределахММОТ;
					
					Если Не мЕНВД Или СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
						// доля УСН
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_УСН; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;		
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 Тогда
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = ВПределахММОТ - Окр(ВПределахММОТ * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ВПределахММОТ - ОбщегоНазначения.ОкруглитьЗначение2016(ВПределахММОТ * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 Тогда
						Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						КонецЕсли;
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = Окр(ВПределахММОТ * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ВПределахММОТ * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						СтрокаДанных.ОблагаетсяЕНВД = Истина;
					КонецЕсли;
					
					// полный результат
					ПолныйРезультат = ДанныеУчета.Результат - ВПределахММОТ;
					
					Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 и ПолныйРезультат <> 0 Тогда
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНВД; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;	
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = Окр(ПолныйРезультат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ПолныйРезультат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
						СтрокаДанных.ОблагаетсяЕНВД = Истина;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							ПолныйРезультат = ПолныйРезультат - Окр(ПолныйРезультат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							ПолныйРезультат = ПолныйРезультат - ОбщегоНазначения.ОкруглитьЗначение2016(ПолныйРезультат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
					КонецЕсли;
					
					Если мОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
						Если ПолныйРезультат <> 0 Тогда
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНприУСН;
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;		
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
							СтрокаДанных.Результат	 = ПолныйРезультат
						КонецЕсли;
						
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					Иначе 
						Если ПолныйРезультат <> 0 Тогда 
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							Если УказаноОтражениеВУчетеДляРаботодателя Тогда
								ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
								"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
								"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
								СтрокаДанных.Результат	 = ПолныйРезультат;
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
								Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
									Если Не ДанныеУчета.Следующий() Тогда
										ПродолжатьОбработку = Ложь;
										Прервать;
									КонецЕсли;
								КонецЦикла;
							Иначе // обходим строки и вычисляем долю результата по базовым записям
								// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
								СуммарнаяДоля = 0;
								ПерваяИзГруппыСтрок = Истина;
								Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
									Если Не ДанныеУчета.ЭтоЕНВД Тогда
										// если это не первая из группы "базовых" строк по одной строке основного регистра
										// то создаем очередную строку движений
										Если Не ПерваяИзГруппыСтрок Тогда
											СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
										Иначе
											ПерваяИзГруппыСтрок = Ложь;
										КонецЕсли;
										
										Если СуммаПоСтроке = 0 Тогда
											Доля = 0;
										Иначе
											Если ДанныеУчета.РезультатБаза = NULL Тогда
												Успешно = Ложь;
												Доля = 0;
											Иначе
												Доля = ПолныйРезультат * ДанныеУчета.РезультатБаза / (СуммаПоСтроке - СуммаПоСтрокеЕНВД);
											КонецЕсли;
										КонецЕсли;
										
										Если ДанныеУчета.СчетДтРазрез = NULL Тогда
											Успешно = Ложь;
										Иначе
											СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
											СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
											СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
											СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
											СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
											СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
											СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
											СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
										КонецЕсли;
										
										Если ДанныеУчета.СчетКтРазрез = NULL Тогда
											Успешно = Ложь;
										Иначе
											СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
											СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
											СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
											СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
											СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
											СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
											СтрокаДанных.СубконтоКтНУ2 = Неопределено;
											СтрокаДанных.СубконтоКтНУ3 = Неопределено;
											СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.Принимаются;		
										КонецЕсли;
										СтрокаДанных.Результат = ?(ПолныйРезультат > 0,Мин(Доля,ПолныйРезультат - СуммарнаяДоля),Макс(Доля,ПолныйРезультат - СуммарнаяДоля));
										СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
										СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
									КонецЕсли;
									Если Не ДанныеУчета.Следующий() Тогда
										ПродолжатьОбработку = Ложь;
										Прервать;
									КонецЕсли;
								КонецЦикла;
								// ошибки округления складываются на последнюю запись из группы базовых записей
								СтрокаДанных.Результат = СтрокаДанных.Результат + ПолныйРезультат - СуммарнаяДоля;
							КонецЕсли;
						Иначе	
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли мЕНВД и СуммаПоСтрокеЕНВД <> 0 и НЕ мФСС_БЛ Тогда // налоговые режимы: ОСН+ЕНВД, без уплаты добровольных взносов
				
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
					Если СуммаПоСтрокеЕНВД <> СуммаПоСтроке  Тогда
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
					КонецЕсли;
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
						СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
					иначе
						СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
					
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
					СтрокаДанных.ОблагаетсяЕНВД = Истина;
					Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
						Если Не ДанныеУчета.Следующий() Тогда
							ПродолжатьОбработку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли  ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание
					И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаВБыту Тогда
					Если СуммаПоСтрокеЕНВД <> СуммаПоСтроке  Тогда
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
					КонецЕсли;		
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
						ВПределахММОТ	 = ?(ДанныеУчета.Сторно,Макс(Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2),ДанныеУчета.ВПределахММОТ),Мин(Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2),ДанныеУчета.ВПределахММОТ));
					иначе
						ВПределахММОТ	 = ?(ДанныеУчета.Сторно,Макс(ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия),ДанныеУчета.ВПределахММОТ),Мин(ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия),ДанныеУчета.ВПределахММОТ)); //О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
					
					СтрокаДанных.Результат	 = ВПределахММОТ;
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
					СтрокаДанных.ОблагаетсяЕНВД = Истина;
					если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
						СтрокаДанных.Результат = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2) - ВПределахММОТ;
					иначе
						СтрокаДанных.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия) - ВПределахММОТ;//О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
					
					Если ?(ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1),Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2),ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия)) - ВПределахММОТ <> 0 Тогда //О.Т. Аверсон 15.03.2016 № 949
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНВД; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2) - ВПределахММОТ;
						иначе
							СтрокаДанных.Результат = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия) - ВПределахММОТ;//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
						СтрокаДанных.ОблагаетсяЕНВД = Истина;
					КонецЕсли;
					
					Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
						Если Не ДанныеУчета.Следующий() Тогда
							ПродолжатьОбработку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				Иначе // ОбщееЗаболевание или ТравмаВБыту
					
					если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
						ДоляПособияЕНВД = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
					иначе
						ДоляПособияЕНВД = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
					
					
					// это доля возмещаемая ФСС в части ЕНВД в пределах ММОТ
					ВПределахММОТ = ?(ДанныеУчета.Сторно,Макс(ДоляПособияЕНВД, ДанныеУчета.ВПределахММОТ),Мин(ДоляПособияЕНВД, ДанныеУчета.ВПределахММОТ));
					
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					СтрокаДанных.Результат	 = ВПределахММОТ;
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
					СтрокаДанных.ОблагаетсяЕНВД = Истина;
					
					// зарегистрируем долю за счет работодателя в части ЕНВД
					СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНВД; 
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					СтрокаДанных.Результат = ДоляПособияЕНВД - ВПределахММОТ;
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
					СтрокаДанных.ОблагаетсяЕНВД = Истина;
					
					
					// за счет работодателя в части ОСН, первые два календарных дня
					Если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
						РезультатЗаСчетРаботодателя = Окр((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
					иначе
						РезультатЗаСчетРаботодателя = ОбщегоНазначения.ОкруглитьЗначение2016((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия);
					КонецЕсли;
					//за счет ФСС
					ЗаСчетФССРезультат = ДанныеУчета.Результат - ДоляПособияЕНВД - РезультатЗаСчетРаботодателя;
					
					Если ЗаСчетФССРезультат <> 0 Тогда
						//доля за счет ФСС
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						СтрокаДанных.Результат	 = ЗаСчетФССРезультат;
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						
						Если ЕстьДоляБЛЗаСчетРаботодателя Тогда
							СтрокаДанных.ПериодДействияНачало = Мин(СтрокаДанных.ПериодДействияКонец, ТретийКалендарныйДень);
						КонецЕсли;
						
					КонецЕсли;
					
					Если РезультатЗаСчетРаботодателя <> 0 Тогда 
						
						СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
						Если УказаноОтражениеВУчетеДляРаботодателя Тогда
							ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
							"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
							"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
							СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						Иначе // обходим строки и вычисляем долю результата по базовым записям
							// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
							СуммарнаяДоля = 0;
							ПерваяИзГруппыСтрок = Истина;
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.ЭтоЕНВД Тогда
									// если это не первая из группы "базовых" строк по одной строке основного регистра
									// то создаем очередную строку движений
									Если Не ПерваяИзГруппыСтрок Тогда
										СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
										СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
									Иначе
										ПерваяИзГруппыСтрок = Ложь;
									КонецЕсли;
									
									Если СуммаПоСтроке = 0 Тогда
										Доля = 0;
									Иначе
										Если ДанныеУчета.РезультатБаза = NULL Тогда
											Успешно = Ложь;
											Доля = 0;
										Иначе
											Доля = РезультатЗаСчетРаботодателя * ДанныеУчета.РезультатБаза / (СуммаПоСтроке -  СуммаПоСтрокеЕНВД);
										КонецЕсли;
									КонецЕсли;
									
									Если ДанныеУчета.СчетДтРазрез = NULL Тогда
										Успешно = Ложь;
									Иначе
										СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
										СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
										СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
									КонецЕсли;
									Если ДанныеУчета.СчетКтРазрез = NULL Тогда
										Успешно = Ложь;
									Иначе
										СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
										СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
										СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
										СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
										СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
										СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
										СтрокаДанных.СубконтоКтНУ2 = Неопределено;
										СтрокаДанных.СубконтоКтНУ3 = Неопределено;
									КонецЕсли;
									СтрокаДанных.Результат = ?(РезультатЗаСчетРаботодателя > 0,Мин(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля),Макс(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля));
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
									СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
								КонецЕсли;
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							// ошибки округления складываются на последнюю запись из группы базовых записей
							СтрокаДанных.Результат = СтрокаДанных.Результат + РезультатЗаСчетРаботодателя - СуммарнаяДоля;
						КонецЕсли;
					Иначе
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли мФСС_БЛ Тогда // налоговые режимы: УСН, ОСН+ЕНВД и УСН+ЕНВД, с уплатой добровольных взносов
				
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
					
					Если мЕНВД и НЕ мУСН Тогда // налоговые режимы: ОСН+ЕНВД, с уплатой добровольных взносов
						
						Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						КонецЕсли;	
						
						Если СуммаПоСтрокеЕНВД <> 0 Тогда
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							КонецЕсли;
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							СтрокаДанных.ОблагаетсяЕНВД = Истина;
						КонецЕсли;
						
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли мУСН Тогда  // налоговые режимы: УСН и УСН+ЕНВД, с уплатой добровольных взносов
						
						Если Не мЕНВД Или СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_УСН;
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							Если мЕНВД Тогда
								если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
									СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
								иначе
									СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
						
						Если мЕНВД И СуммаПоСтрокеЕНВД <> 0 Тогда
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							КонецЕсли;
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_СПЕЦ_ЕНВД; 
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							СтрокаДанных.ОблагаетсяЕНВД = Истина;
						КонецЕсли;							
						
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				ИначеЕсли  ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание
					И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаВБыту Тогда
					
					Если мЕНВД и НЕ мУСН Тогда // налоговые режимы: ОСН+ЕНВД, с уплатой добровольных взносов
						
						Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						КонецЕсли;
						
						Если СуммаПоСтрокеЕНВД <> 0 Тогда
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							КонецЕсли;
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							СтрокаДанных.ОблагаетсяЕНВД = Истина;
						КонецЕсли;
						
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли мУСН Тогда // налоговые режимы: УСН и УСН+ЕНВД, с уплатой добровольных взносов
						
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
						иначе
							СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
						КонецЕсли;
						
						Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД и мЕНВД Тогда
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							СтрокаДанных.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
							СтрокаДанных.КодДоходаЕСН  = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							СтрокаДанных.ОблагаетсяЕНВД = Истина;
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
						КонецЕсли;
						
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;							
						
					КонецЕсли;	
					
				Иначе // заболевание работника, налоговые режимы: УСН, ОСН+ЕНВД и УСН+ЕНВД, с уплатой добровольных взносов
					
					Если мЕНВД и НЕ мУСН Тогда // налоговые режимы: ОСН+ЕНВД, с уплатой добровольных взносов
						
						Если ДанныеУчета.ДатаНачалаСобытия < мДатаЗакона180ФЗ Тогда
							
							
							
							// за счет работодателя в части ОСН
							Если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								ДоляПособияЕНВД = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
								РезультатЗаСчетРаботодателя = Окр((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
							иначе
								ДоляПособияЕНВД = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);
								РезультатЗаСчетРаботодателя = ОбщегоНазначения.ОкруглитьЗначение2016((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия);
							КонецЕсли;
							
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								// за счет ФСС в части ОСН
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - ДоляПособияЕНВД - РезультатЗаСчетРаботодателя;
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
								
								Если ЕстьДоляБЛЗаСчетРаботодателя Тогда
									СтрокаДанных.ПериодДействияНачало = Мин(СтрокаДанных.ПериодДействияКонец, ТретийКалендарныйДень);	
								КонецЕсли;	
								
							КонецЕсли;
							
							Если СуммаПоСтрокеЕНВД <> 0 Тогда
								
								// за счет добровольных взносов
								Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								КонецЕсли;
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
									СтрокаДанных.Результат	 = ДоляПособияЕНВД - Окр(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
								иначе
									СтрокаДанных.Результат	 = ДоляПособияЕНВД - ОбщегоНазначения.ОкруглитьЗначение2016(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
								КонецЕсли;
								
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
								СтрокаДанных.ОблагаетсяЕНВД = Истина;
								
								Если ДанныеУчета.ДоляБЛЗаСчетРаботодателя <> 0 Тогда
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
									СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНВД; 
									СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
									СтрокаДанных.СубконтоДт2 = Неопределено;
									СтрокаДанных.СубконтоДт3 = Неопределено;
									СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
									СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
									СтрокаДанных.СубконтоКт2 = Неопределено;
									СтрокаДанных.СубконтоКт3 = Неопределено;
									СтрокаДанных.СчетДтНУ	 = Неопределено;
									СтрокаДанных.СчетКтНУ	 = Неопределено;
									СтрокаДанных.СубконтоДтНУ1 = Неопределено;
									СтрокаДанных.СубконтоДтНУ2 = Неопределено;
									СтрокаДанных.СубконтоДтНУ3 = Неопределено;
									СтрокаДанных.СубконтоКтНУ1 = Неопределено;
									СтрокаДанных.СубконтоКтНУ2 = Неопределено;
									СтрокаДанных.СубконтоКтНУ3 = Неопределено;
									если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
										СтрокаДанных.Результат	 = Окр(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
									иначе
										СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
									КонецЕсли;
									
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
									СтрокаДанных.ОблагаетсяЕНВД = Истина;
								КонецЕсли;
							КонецЕсли;							
							
							Если РезультатЗаСчетРаботодателя <> 0 Тогда 
								
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
								Если УказаноОтражениеВУчетеДляРаботодателя Тогда
									ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
									"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
									"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
									СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
								Иначе  // обходим строки и вычисляем долю результата по базовым записям
									// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
									СуммарнаяДоля = 0;
									ПерваяИзГруппыСтрок = Истина;
									Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
										Если Не ДанныеУчета.ЭтоЕНВД Тогда
											// если это не первая из группы "базовых" строк по одной строке основного регистра
											// то создаем очередную строку движений
											Если Не ПерваяИзГруппыСтрок Тогда
												СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
												СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
											Иначе
												ПерваяИзГруппыСтрок = Ложь;
											КонецЕсли;
											
											Если СуммаПоСтроке = 0 Тогда
												Доля = 0;
											Иначе
												Если ДанныеУчета.РезультатБаза = NULL Тогда
													Успешно = Ложь;
													Доля = 0;
												Иначе
													Доля = РезультатЗаСчетРаботодателя * ДанныеУчета.РезультатБаза / (СуммаПоСтроке - СуммаПоСтрокеЕНВД);
												КонецЕсли;
											КонецЕсли;
											
											Если ДанныеУчета.СчетДтРазрез = NULL Тогда
												Успешно = Ложь;
											Иначе
												СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
												СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
												СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
											КонецЕсли;
											Если ДанныеУчета.СчетКтРазрез = NULL Тогда
												Успешно = Ложь;
											Иначе
												СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
												СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
												СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
												СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
												СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
												СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
												СтрокаДанных.СубконтоКтНУ2 = Неопределено;
												СтрокаДанных.СубконтоКтНУ3 = Неопределено;
											КонецЕсли;
											
											СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
											СтрокаДанных.Результат = ?(РезультатЗаСчетРаботодателя > 0,Мин(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля),Макс(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля));
											СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
										КонецЕсли;
										Если Не ДанныеУчета.Следующий() Тогда
											ПродолжатьОбработку = Ложь;
											Прервать;
										КонецЕсли;
									КонецЦикла;
									// ошибки округления складываются на последнюю запись из группы базовых записей
									СтрокаДанных.Результат = СтрокаДанных.Результат + РезультатЗаСчетРаботодателя - СуммарнаяДоля;
								КонецЕсли;	
								
							КонецЕсли;	
							
							Пока ПродолжатьОбработку И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;							
							
						Иначе // ДанныеУчета.ДатаНачалаСобытия > мДатаЗакона180ФЗ, налоговые режимы: ОСН+ЕНВД, с уплатой добровольных взносов
							
							
							// за счет работодателя
							Если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								ДоляПособияЕНВД = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
								РезультатЗаСчетРаботодателя = Окр((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
							иначе
								ДоляПособияЕНВД = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);
								РезультатЗаСчетРаботодателя = ОбщегоНазначения.ОкруглитьЗначение2016((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия);
							КонецЕсли;
							
							//за счет ФСС
							ЗаСчетФССРезультат = 0;
							
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								
								ЗаСчетФССРезультат = ДанныеУчета.Результат - ДоляПособияЕНВД - РезультатЗаСчетРаботодателя;
								
								Если ЗаСчетФССРезультат <> 0 Тогда
									СтрокаДанных.Результат	 = ЗаСчетФССРезультат;
									СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
									СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
									СтрокаДанных.СубконтоДт2 = Неопределено;
									СтрокаДанных.СубконтоДт3 = Неопределено;
									СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
									СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
									СтрокаДанных.СубконтоКт2 = Неопределено;
									СтрокаДанных.СубконтоКт3 = Неопределено;
									СтрокаДанных.СчетДтНУ	 = Неопределено;
									СтрокаДанных.СчетКтНУ	 = Неопределено;
									СтрокаДанных.СубконтоДтНУ1 = Неопределено;
									СтрокаДанных.СубконтоДтНУ2 = Неопределено;
									СтрокаДанных.СубконтоДтНУ3 = Неопределено;
									СтрокаДанных.СубконтоКтНУ1 = Неопределено;
									СтрокаДанных.СубконтоКтНУ2 = Неопределено;
									СтрокаДанных.СубконтоКтНУ3 = Неопределено;
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
									Если ЕстьДоляБЛЗаСчетРаботодателя Тогда
										СтрокаДанных.ПериодДействияНачало = Мин(СтрокаДанных.ПериодДействияКонец, ТретийКалендарныйДень);	
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
							Если СуммаПоСтрокеЕНВД <> 0 Тогда
								Если ЗаСчетФССРезультат <> 0 Тогда
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								КонецЕсли;
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								СтрокаДанных.Результат	 = ДоляПособияЕНВД;
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
								СтрокаДанных.ОблагаетсяЕНВД = Истина;
							КонецЕсли;							
							
							Если РезультатЗаСчетРаботодателя <> 0 Тогда 
								Если ЗаСчетФССРезультат <> 0 ИЛИ СуммаПоСтрокеЕНВД <> 0 Тогда
									//добавим новую строку движений, т.к. есть доля за счет ФСС
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								КонецЕсли;
								СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
								Если УказаноОтражениеВУчетеДляРаботодателя Тогда
									ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
									"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
									"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
									СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
								Иначе // обходим строки и вычисляем долю результата по базовым записям
									// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
									СуммарнаяДоля = 0;
									ПерваяИзГруппыСтрок = Истина;
									Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
										Если Не ДанныеУчета.ЭтоЕНВД Тогда
											// если это не первая из группы "базовых" строк по одной строке основного регистра
											// то создаем очередную строку движений
											Если Не ПерваяИзГруппыСтрок Тогда
												СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
												СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
											Иначе
												ПерваяИзГруппыСтрок = Ложь;
											КонецЕсли;
											
											Если СуммаПоСтроке = 0 Тогда
												Доля = 0;
											Иначе
												Если ДанныеУчета.РезультатБаза = NULL Тогда
													Успешно = Ложь;
													Доля = 0;
												Иначе
													Доля = РезультатЗаСчетРаботодателя * ДанныеУчета.РезультатБаза / (СуммаПоСтроке - СуммаПоСтрокеЕНВД);
												КонецЕсли;
											КонецЕсли;
											
											Если ДанныеУчета.СчетДтРазрез = NULL Тогда
												Успешно = Ложь;
											Иначе
												СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
												СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
												СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
												СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
											КонецЕсли;
											Если ДанныеУчета.СчетКтРазрез = NULL Тогда
												Успешно = Ложь;
											Иначе
												СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
												СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
												СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
												СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
												СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
												СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
												СтрокаДанных.СубконтоКтНУ2 = Неопределено;
												СтрокаДанных.СубконтоКтНУ3 = Неопределено;
											КонецЕсли;
											
											СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
											СтрокаДанных.Результат = ?(РезультатЗаСчетРаботодателя > 0,Мин(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля),Макс(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля));
											СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
										КонецЕсли;
										Если Не ДанныеУчета.Следующий() Тогда
											ПродолжатьОбработку = Ложь;
											Прервать;
										КонецЕсли;
									КонецЦикла;
									// ошибки округления складываются на последнюю запись из группы базовых записей
									СтрокаДанных.Результат = СтрокаДанных.Результат + РезультатЗаСчетРаботодателя - СуммарнаяДоля;
								КонецЕсли;	
							КонецЕсли;	
							
							Пока ПродолжатьОбработку И ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						КонецЕсли;
						
					ИначеЕсли мУСН Тогда // налоговые режимы: УСН и УСН+ЕНВД, с уплатой добровольных взносов
						
						Если ДанныеУчета.ДатаНачалаСобытия < мДатаЗакона180ФЗ Тогда
							
							
							Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
								ДоляПособияЕНВД = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								ДоляПособияЕНВД = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия);//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							
							// за счет работодателя
							если ДанныеУчета.ДатаНачалаСобытия < Дата(2016,07,1) Тогда //О.Т. Аверсон 14.03.2016 № 949
								РезультатЗаСчетРаботодателя = Окр((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
							иначе
								РезультатЗаСчетРаботодателя = ОбщегоНазначения.ОкруглитьЗначение2016((ДанныеУчета.Результат - ДоляПособияЕНВД) * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия);
							КонецЕсли;
							
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - ДоляПособияЕНВД - РезультатЗаСчетРаботодателя;
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы;
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							КонецЕсли;
							
							Если СуммаПоСтрокеЕНВД <> 0 Тогда
								Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД Тогда
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								КонецЕсли;
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
								Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									СтрокаДанных.Результат	 = ДоляПособияЕНВД - Окр(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
								иначе
									СтрокаДанных.Результат	 = ДоляПособияЕНВД - ОбщегоНазначения.ОкруглитьЗначение2016(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
								КонецЕсли;
								
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
								СтрокаДанных.ОблагаетсяЕНВД = Истина;
								
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНВД; 
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыРасчетовПоСредствамФСС.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									СтрокаДанных.Результат	 = Окр(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
								иначе
									СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДоляПособияЕНВД * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
								КонецЕсли;
								
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
								СтрокаДанных.ОблагаетсяЕНВД = Истина;
							КонецЕсли;
							
							Если РезультатЗаСчетРаботодателя <> 0 Тогда
								
								Если мОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
									
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
									СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
									СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ЕНприУСН;
									СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
									СтрокаДанных.СубконтоДт2 = Неопределено;
									СтрокаДанных.СубконтоДт3 = Неопределено;
									СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
									СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
									СтрокаДанных.СубконтоКт2 = Неопределено;
									СтрокаДанных.СубконтоКт3 = Неопределено;
									СтрокаДанных.СчетДтНУ	 = Неопределено;
									СтрокаДанных.СчетКтНУ	 = Неопределено;
									СтрокаДанных.СубконтоДтНУ1 = Неопределено;
									СтрокаДанных.СубконтоДтНУ2 = Неопределено;
									СтрокаДанных.СубконтоДтНУ3 = Неопределено;
									СтрокаДанных.СубконтоКтНУ1 = Неопределено;
									СтрокаДанных.СубконтоКтНУ2 = Неопределено;
									СтрокаДанных.СубконтоКтНУ3 = Неопределено;
									СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
									
								Иначе
									
									СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
									Если УказаноОтражениеВУчетеДляРаботодателя Тогда
										ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
										"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
										"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
										СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
										СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
									Иначе // обходим строки и вычисляем долю результата по базовым записям
										// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
										СуммарнаяДоля = 0;
										ПерваяИзГруппыСтрок = Истина;
										Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
											Если Не ДанныеУчета.ЭтоЕНВД Тогда
												// если это не первая из группы "базовых" строк по одной строке основного регистра
												// то создаем очередную строку движений
												Если Не ПерваяИзГруппыСтрок Тогда
													СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
												Иначе
													ПерваяИзГруппыСтрок = Ложь;
												КонецЕсли;
												
												Если СуммаПоСтроке = 0 Тогда
													Доля = 0;
												Иначе
													Если ДанныеУчета.РезультатБаза = NULL Тогда
														Успешно = Ложь;
														Доля = 0;
													Иначе
														Доля = РезультатЗаСчетРаботодателя * ДанныеУчета.РезультатБаза / (СуммаПоСтроке - СуммаПоСтрокеЕНВД);
													КонецЕсли;
												КонецЕсли;
												
												Если ДанныеУчета.СчетДтРазрез = NULL Тогда
													Успешно = Ложь;
												Иначе
													СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
													СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
													СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
													СтрокаДанных.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
												КонецЕсли;
												Если ДанныеУчета.СчетКтРазрез = NULL Тогда
													Успешно = Ложь;
												Иначе
													СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
													СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
													СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
													СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
													СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
													СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
													СтрокаДанных.СубконтоКтНУ2 = Неопределено;
													СтрокаДанных.СубконтоКтНУ3 = Неопределено;
													СтрокаДанных.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
												КонецЕсли;
												
												СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
												СтрокаДанных.Результат = ?(РезультатЗаСчетРаботодателя > 0,Мин(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля),Макс(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля));
												СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
											КонецЕсли;
											Если Не ДанныеУчета.Следующий() Тогда
												ПродолжатьОбработку = Ложь;
												Прервать;
											КонецЕсли;											
										КонецЦикла;		
										// ошибки округления складываются на последнюю запись из группы базовых записей
										СтрокаДанных.Результат = СтрокаДанных.Результат + РезультатЗаСчетРаботодателя - СуммарнаяДоля;
									КонецЕсли;									
								КонецЕсли;									
								
							КонецЕсли;
							
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
						Иначе // ДанныеУчета.ДатаНачалаСобытия > мДатаЗакона180ФЗ, налоговые режимы: УСН и УСН+ЕНВД, с уплатой добровольных взносов
							
							СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
							СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
							СтрокаДанных.СубконтоДт2 = Неопределено;
							СтрокаДанных.СубконтоДт3 = Неопределено;
							СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
							СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
							СтрокаДанных.СубконтоКт2 = Неопределено;
							СтрокаДанных.СубконтоКт3 = Неопределено;
							СтрокаДанных.СчетДтНУ	 = Неопределено;
							СтрокаДанных.СчетКтНУ	 = Неопределено;
							СтрокаДанных.СубконтоДтНУ1 = Неопределено;
							СтрокаДанных.СубконтоДтНУ2 = Неопределено;
							СтрокаДанных.СубконтоДтНУ3 = Неопределено;
							СтрокаДанных.СубконтоКтНУ1 = Неопределено;
							СтрокаДанных.СубконтоКтНУ2 = Неопределено;
							СтрокаДанных.СубконтоКтНУ3 = Неопределено;
							СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
							Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
							иначе
								СтрокаДанных.Результат	 = ДанныеУчета.Результат - ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
							КонецЕсли;
							
							
							// здесь ЕСН отдельно - двумя строками
							Если СуммаПоСтроке <> СуммаПоСтрокеЕНВД и мЕНВД Тогда
								СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
								СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС_ДобровольныеВзносы; 
								СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
								СтрокаДанных.СубконтоДт2 = Неопределено;
								СтрокаДанных.СубконтоДт3 = Неопределено;
								СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
								СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
								СтрокаДанных.СубконтоКт2 = Неопределено;
								СтрокаДанных.СубконтоКт3 = Неопределено;
								СтрокаДанных.СчетДтНУ	 = Неопределено;
								СтрокаДанных.СчетКтНУ	 = Неопределено;
								СтрокаДанных.СубконтоДтНУ1 = Неопределено;
								СтрокаДанных.СубконтоДтНУ2 = Неопределено;
								СтрокаДанных.СубконтоДтНУ3 = Неопределено;
								СтрокаДанных.СубконтоКтНУ1 = Неопределено;
								СтрокаДанных.СубконтоКтНУ2 = Неопределено;
								СтрокаДанных.СубконтоКтНУ3 = Неопределено;
								СтрокаДанных.ОтражениеВУСН	 = Перечисления.ОтражениеВУСН.НеПринимаются;
								СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
								СтрокаДанных.ОблагаетсяЕНВД = Истина;
								Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
									СтрокаДанных.Результат	 = Окр(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,2);
								иначе
									СтрокаДанных.Результат	 = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * СуммаПоСтрокеЕНВД / СуммаПоСтроке,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
								КонецЕсли;
								
							КонецЕсли;
							
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;							
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе // налоговые режимы: ОСН, ОСН+ЕНВД но доли ЕНВД нет
				
				Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
					
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
					Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
						Если Не ДанныеУчета.Следующий() Тогда
							ПродолжатьОбработку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли  ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание
					И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаВБыту Тогда
					
					СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
					СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
					СтрокаДанных.СубконтоДт2 = Неопределено;
					СтрокаДанных.СубконтоДт3 = Неопределено;
					СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
					СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
					СтрокаДанных.СубконтоКт2 = Неопределено;
					СтрокаДанных.СубконтоКт3 = Неопределено;
					СтрокаДанных.СчетДтНУ	 = Неопределено;
					СтрокаДанных.СчетКтНУ	 = Неопределено;
					СтрокаДанных.СубконтоДтНУ1 = Неопределено;
					СтрокаДанных.СубконтоДтНУ2 = Неопределено;
					СтрокаДанных.СубконтоДтНУ3 = Неопределено;
					СтрокаДанных.СубконтоКтНУ1 = Неопределено;
					СтрокаДанных.СубконтоКтНУ2 = Неопределено;
					СтрокаДанных.СубконтоКтНУ3 = Неопределено;
					СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
					Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
						Если Не ДанныеУчета.Следующий() Тогда
							ПродолжатьОбработку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
				Иначе // причина ОбщееЗаболевание или ТравмаВБыту
					
					// результат пособия за счет работодателя
					Если ДанныеУчета.ДатаНачалаСобытия  < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
						РезультатЗаСчетРаботодателя = Окр(ДанныеУчета.Результат * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,2);
					иначе
						РезультатЗаСчетРаботодателя = ОбщегоНазначения.ОкруглитьЗначение2016(ДанныеУчета.Результат * ДанныеУчета.ДоляБЛЗаСчетРаботодателя,ДанныеУчета.ДатаНачалаСобытия );//О.Т. Аверсон 15.03.2016 № 949
					КонецЕсли;
					
					Если ДанныеУчета.Результат <> РезультатЗаСчетРаботодателя Тогда
						
						// есть доля пособия за счет ФСС
						СтрокаДанных.Результат	 = ДанныеУчета.Результат - РезультатЗаСчетРаботодателя;
						СтрокаДанных.СчетДт 	 = ПланыСчетов.Хозрасчетный.ФСС;
						СтрокаДанных.СубконтоДт1 = Перечисления.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию;
						СтрокаДанных.СубконтоДт2 = Неопределено;
						СтрокаДанных.СубконтоДт3 = Неопределено;
						СтрокаДанных.СчетКт 	 = ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда;
						СтрокаДанных.СубконтоКт1 = ДанныеУчета.ФизЛицо;
						СтрокаДанных.СубконтоКт2 = Неопределено;
						СтрокаДанных.СубконтоКт3 = Неопределено;
						СтрокаДанных.СчетДтНУ	 = Неопределено;
						СтрокаДанных.СчетКтНУ	 = Неопределено;
						СтрокаДанных.СубконтоДтНУ1 = Неопределено;
						СтрокаДанных.СубконтоДтНУ2 = Неопределено;
						СтрокаДанных.СубконтоДтНУ3 = Неопределено;
						СтрокаДанных.СубконтоКтНУ1 = Неопределено;
						СтрокаДанных.СубконтоКтНУ2 = Неопределено;
						СтрокаДанных.СубконтоКтНУ3 = Неопределено;
						СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.ПособияЗаСчетФСС;
						
						Если ЕстьДоляБЛЗаСчетРаботодателя Тогда
							//доля за счет работодателя есть, скорректируем начало периода действия доли за счет ФСС
							СтрокаДанных.ПериодДействияНачало = Мин(СтрокаДанных.ПериодДействияКонец, ТретийКалендарныйДень);	
						КонецЕсли;
						
					КонецЕсли;
					
					Если РезультатЗаСчетРаботодателя <> 0 Тогда
						//доля пособия за счет работодателя не равна нулю, произведем отражение в учете
						Если ДанныеУчета.Результат <> РезультатЗаСчетРаботодателя Тогда
							// доля пособия за счет работодателя не равно единицы, создадим новую строку
							СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
						КонецЕсли;
						СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
						Если УказаноОтражениеВУчетеДляРаботодателя Тогда
							ЗаполнитьЗначенияСвойств(СтрокаДанных,ВыборкаПоШапкеДокумента,
							"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1," +
							"СчетДтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СчетКтНУ,СубконтоКтНУ1,ОтражениеВУСН");
							СтрокаДанных.Результат	 = РезультатЗаСчетРаботодателя;
							СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						Иначе // обходим строки и вычисляем долю результата по базовым записям
							// суммарная доля, которую уже "разбросали" на строки с одинаковым регистратором и номером строки
							СуммарнаяДоля = 0;
							ПерваяИзГруппыСтрок = Истина;
							Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
								// если это не первая из группы "базовых" строк по одной строке основного регистра
								// то создаем очередную строку движений
								Если Не ДанныеУчета.ЭтоЕНВД Тогда
									
									Если Не ПерваяИзГруппыСтрок Тогда
										СтрокаДанных = СоздатьСтрокуДвижений(ДанныеУчета, НаборЗаписей);
										СтрокаДанных.ПериодДействияКонец = Мин(СтрокаДанных.ПериодДействияКонец, ВторойКалендарныйДень);
									Иначе
										ПерваяИзГруппыСтрок = Ложь;
									КонецЕсли;
									
									Если СуммаПоСтроке = 0 Тогда
										Доля = 0;
									Иначе
										Если ДанныеУчета.РезультатБаза = NULL Тогда
											Успешно = Ложь;
											Доля = 0;
										Иначе
											Доля = РезультатЗаСчетРаботодателя * ДанныеУчета.РезультатБаза / СуммаПоСтроке;
										КонецЕсли;
									КонецЕсли;
									
									Если ДанныеУчета.СчетДтРазрез = NULL Тогда
										Успешно = Ложь;
									Иначе
										СтрокаДанных.СчетДт 	 = ДанныеУчета.СчетДтРазрез;
										СтрокаДанных.СубконтоДт1 = ПолучитьСубконто(ДанныеУчета.СубконтоДт1Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДт2 = ПолучитьСубконто(ДанныеУчета.СубконтоДт2Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДт3 = ПолучитьСубконто(ДанныеУчета.СубконтоДт3Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СчетДтНУ	 = ДанныеУчета.СчетДтНУРазрез;
										СтрокаДанных.СубконтоДтНУ1 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ1Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДтНУ2 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ2Разрез, ПараметрыПолученияСубконто);
										СтрокаДанных.СубконтоДтНУ3 = ПолучитьСубконто(ДанныеУчета.СубконтоДтНУ3Разрез, ПараметрыПолученияСубконто);
									КонецЕсли;
									Если ДанныеУчета.СчетКтРазрез = NULL Тогда
										Успешно = Ложь;
									Иначе
										СтрокаДанных.СчетКт 	 = ДанныеУчета.СчетКтРазрез;
										СтрокаДанных.СубконтоКт1 = ДанныеУчета.СубконтоКт1Разрез;
										СтрокаДанных.СубконтоКт2 = ДанныеУчета.СубконтоКт2Разрез;
										СтрокаДанных.СубконтоКт3 = ДанныеУчета.СубконтоКт3Разрез;
										СтрокаДанных.СчетКтНУ	 = ДанныеУчета.СчетКтНУРазрез;
										СтрокаДанных.СубконтоКтНУ1 = ДанныеУчета.СубконтоКтНУ1Разрез;
										СтрокаДанных.СубконтоКтНУ2 = Неопределено;
										СтрокаДанных.СубконтоКтНУ3 = Неопределено;
									КонецЕсли;
									
									СтрокаДанных.КодДоходаЕСН = Справочники.ДоходыЕСН.НеОблагаетсяЦеликом;
									СтрокаДанных.Результат = ?(РезультатЗаСчетРаботодателя > 0,Мин(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля),Макс(Доля,РезультатЗаСчетРаботодателя - СуммарнаяДоля));
									СуммарнаяДоля = СуммарнаяДоля + СтрокаДанных.Результат;
								КонецЕсли;
								Если Не ДанныеУчета.Следующий() Тогда
									ПродолжатьОбработку = Ложь;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							// ошибки округления складываются на последнюю запись из группы базовых записей
							СтрокаДанных.Результат = СтрокаДанных.Результат + РезультатЗаСчетРаботодателя - СуммарнаяДоля;
						КонецЕсли;
					Иначе
						Пока ДанныеУчета.НомерСтроки = ТекущийНомерСтроки Цикл
							Если Не ДанныеУчета.Следующий() Тогда
								ПродолжатьОбработку = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Свернуть("КодДоходаЕСН,ОблагаетсяЕНВД,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3,СчетДтНУ,СчетКтНУ,СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,ОтражениеВУСН,ПериодДействияНачало, ПериодДействияКонец, Сторно","Результат");
	
	ОтражениеВУчете.Загрузить(НаборЗаписей);
	
	Если ФормироватьДвижения Тогда
		
		Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
		Движения.РасчетСреднегоЗаработка.Очистить();
		
		Для Каждого Набор Из Движения Цикл
			Если ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
				или ТипЗнч(Набор)=Тип("РегистрРасчетаНаборЗаписей.РасчетСреднегоЗаработка") Тогда
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Успешно
	
КонецФункции

// Получает значение субконто в том случае, если заданы правила его переопределения
//
// Параметры
//  Субконто - начальное значение субконто
//  ПараметрыПолученияСубконто - соответсвие, 
//                              ключ соответсвия - тип, 
//                              значение - параметры, которые помогают преобразовывать 
//                              субконто соотв. типа из одного значения в другое
//
// Возвращаемое значение:
//   Субконто
// Если для субконто некоторого типа не задаы параметры преобразования, то его 
// значение не изменяется
//
Функция ПолучитьСубконто(Субконто, ПараметрыПолученияСубконто)
	
	Параметры = ПараметрыПолученияСубконто[ТипЗнч(Субконто)];
	Если Параметры = НеОпределено Тогда
		// для субконто этого типа не заданы парамтры переопределения
		Возврат Субконто;
	КонецЕсли;
	// для статьи затрат
	Если ТипЗнч(Субконто) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		ВидСтатьиЗатрат = Параметры.ВидСтатьиЗатрат;
		ДополнительныеСтатьиЗатрат = Параметры.ДополнительныеСтатьиЗатрат;
		КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Субконто);
		Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
		Если Строки.Количество() = 0 Тогда
			КлючПоиска = Новый Структура("ВидСтатьиЗатрат, СтатьяЗатратНачисления", ВидСтатьиЗатрат, Справочники.СтатьиЗатрат.ПустаяСсылка());
			Строки = ДополнительныеСтатьиЗатрат.НайтиСтроки(КлючПоиска);
			Если Строки.Количество() = 0 Тогда
				Возврат Субконто;
			Иначе
				Возврат Строки[0].СтатьяЗатрат;
			КонецЕсли;
		Иначе
			Возврат Строки[0].СтатьяЗатрат;
		КонецЕсли;
		// для получения субконто другого типа - дописываем ИначеЕсли...
	Иначе
		Возврат Субконто;
	КонецЕсли;
	
КонецФункции

// Заполняет документ по перерассчитываемому документу
// ИсходныйДокумент - тип ДокументОбъект.НачислениеПоБольничномуЛисту
//
Процедура ЗаполнитьПоПерерассчитываемомуДокументу(ИсходныйДокумент, Сотрудники = Неопределено) Экспорт
	
	ПерерассчитываемыйДокумент = ИсходныйДокумент.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ИсходныйДокумент,,
	"Проведен, Номер, Дата, ПометкаУдаления, ПерерассчитываемыйДокумент, ПериодРегистрации, Комментарий, Ответственный"); // кроме указанных
	
КонецПроцедуры // ЗаполнитьПоПерерассчитываемомуДокументу()

// Формирует таблицу значений, описывающую размеры выплаты пособия по периодам
//
Функция ЗаполнитьТаблицуИнтервалов(ДатаНачалаСобытия, ВидРасчетаОтПричины) Экспорт 
	
	ТаблицаИнтерваловОплаты = Новый ТаблицаЗначений;
	ТаблицаИнтерваловОплаты.Колонки.Добавить("Начало",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаИнтерваловОплаты.Колонки.Добавить("Расчет",Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"));
	ТаблицаИнтерваловОплаты.Колонки.Добавить("ПроцентОплаты",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(6,2)));
	
	// в зависимости от причины нетрудоспособности оплачивается разное количество дней; процент оплаты также меняется
	Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь тогда
		КоэффициентПроцента = 0.5;
	Иначе
		КоэффициентПроцента = 1;
	КонецЕсли;
	
	ДатаОкончанияОплаты = Датаокончания;
	//Если ЗначениеЗаполнено(ДатаНарушенияРежима) И ДатаОкончания >= ДатаНарушенияРежима Тогда
	//	 ДатаОкончанияОплаты = ДатаНарушенияРежима-мДлинаСуток;
	//КонецЕсли;
	//Островская Татьяна 11.09.2013 № 16778
	если ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ  Тогда //или ТипРасчета = Перечисления.ТипРасчетаБЛ.МЗП Тогда не меняем процент оплаты для МЗП
		ПроцентОплаты = 100;
	КонецЕсли;
	//Островская Татьяна 11.09.2013 № 16778
	
	//Если ПроцентОплаты = 80 Тогда
		
		ДниНеПолнойОплаты = 0;
		
		Если ПервичныйбольничныйЛист = Документы.НачислениеПоБольничномуЛисту.ПустаяСсылка() тогда
			//Островская Татьяна 12.07.2013 № 16623
			если КалендарныеДни Тогда
				ДниНеПолнойОплаты = 12; 
				Если ДатаНачала >= Дата('20240701') Тогда 
					ДниНеПолнойОплаты = ДнейОплаты;
				КонецЕсли;
			иначе
				ДниНеПолнойОплаты = 6;
			КонецЕсли;
			//Островская Татьяна 22.07.2013 № 16623
		Иначе
			Если ПервичныйБольничныйЛист.ПроцентОплаты = 80 тогда
				НачалоПервичного = ПервичныйБольничныйЛист.ДатаНачала;
				ОкончаниеПервичного = ПервичныйБольничныйЛист.ДатаОкончания;
				//толик не нужно рассчитывать оплаченные дни т.к дата начала берется датой начала первичного б.л.
				//				ДниОплаченныеПоПервичномуБольничномуЛисту = (ОкончаниеПервичного - НачалоПервичного) / мДлинаСуток;
				//				ДниНеПолнойОплаты = МАКС(6 - (ДниОплаченныеПоПервичномуБольничномуЛисту),0);
				//толик добавляем выходные при разрыве больничного листа
				мВыходные = 0;
				Если ДеньНедели(ОкончаниеПервичного)=5 И ДеньНедели(ДатаНачала)=1 Тогда
					мВыходные = 2;
				КонецЕсли; 
				//Островская Татьяна 12.07.2013 № 16623
				
				//Аверсон 08.02.2023 КВВ СВФР-010298 (
				Если ОкончаниеПервичного + мДлинаСуток <> ДатаНачала Тогда
					З_БЛ = Новый Запрос;
					З_БЛ.Текст = 
					"ВЫБРАТЬ
					|	МАКСИМУМ(НачислениеПоБольничномуЛисту.ДатаОкончания) КАК ДатаОкончания
					|ИЗ Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
					|ГДЕ
					|	НачислениеПоБольничномуЛисту.Сотрудник = &Сотрудник
					|	И НачислениеПоБольничномуЛисту.Проведен
					|	И НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = &ПервичныйБольничныйЛист
					|	И НачислениеПоБольничномуЛисту.Ссылка <> &ТекДок
					|	И НачислениеПоБольничномуЛисту.ДатаНачала < &ДатаНачалаТекДок";
					З_БЛ.УстановитьПараметр("Сотрудник", Сотрудник);
					З_БЛ.УстановитьПараметр("ПервичныйБольничныйЛист", ПервичныйБольничныйЛист);
					З_БЛ.УстановитьПараметр("ТекДок", Ссылка);
					З_БЛ.УстановитьПараметр("ДатаНачалаТекДок", ДатаНачала);
					РезЗ_БЛ = З_БЛ.Выполнить().Выгрузить();
					Если РезЗ_БЛ.Количество() > 0 Тогда
						ОкончаниеПервичного = РезЗ_БЛ[0].ДатаОкончания;
					КонецЕсли;
				КонецЕсли;	
				//Аверсон 08.02.2023 КВВ СВФР-010298 )
				
				Если ОкончаниеПервичного + мДлинаСуток <> ДатаНачала Тогда
					Дней = 0;
					Общегоназначения.РазобратьРазностьДат(ДатаНачала,ОкончаниеПервичного,,,Дней);	
					мВыходные = Дней-1 ;
					Сообщить("Период первых 12 дней продлен");
				КонецЕсли;

				если КалендарныеДни Тогда
					ДниНеПолнойОплаты = 12 + мВыходные; 
				иначе
					ДниНеПолнойОплаты = 6 + мВыходные;
				КонецЕсли;
				Если ДатаНачала >= Дата('20240701') и не ЗначениеЗаполнено(ПервичныйБольничныйЛист)  Тогда 
					ДниНеПолнойОплаты = ДнейОплаты+100;
				ИначеЕсли ЗначениеЗаполнено(ПервичныйБольничныйЛист) Тогда
					Если  ПервичныйБольничныйЛист.ДатаНачала >= Дата('20240701') Тогда 
						ДниНеПолнойОплаты = ДнейОплаты+250;  
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
		//Островская Татьяна 19.07.2013 № 16645
		если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь и КалендарныеДни Тогда 		
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия, 				   ВидРасчетаОтПричины, 0);
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия + 6 * мДлинаСуток, ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
		иначе
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия, 				   ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
		КонецЕсли;
		если ЗначениеЗаполнено(ДатаНарушенияРежима) и ЗначениеЗаполнено(ДатаНарушенияРежимаКон) И ДатаНарушенияРежима <> ДатаНачалаСобытия тогда //Аверсон ЕАЕ 04.05.2022 СВФР-008992
			если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь и КалендарныеДни Тогда
				если ДатаНарушенияРежима < ДатаНачалаСобытия + 6 * мДлинаСуток Тогда 
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия + 6 * мДлинаСуток,  ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
				иначе	
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежима,  ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
				КонецЕсли;
			иначе	
				
				//Аверсон ЕАЕ 04.05.2022 СВФР-008992
				//если ДатаНарушенияРежимаКон > ДатаНачалаСобытия + дниНеПолнойОплаты * мДлинаСуток тогда  //О.Т. 07.09.2015 № 572
				если ДатаНарушенияРежима > ДатаНачалаСобытия + дниНеПолнойОплаты * мДлинаСуток тогда
					//Аверсон СВФР-008992
					
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежима,  ВидРасчетаОтПричины, 100 * КоэффициентПроцента);//О.Т. 07.09.2015 № 572
				иначе
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежима,  ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		//Островская Татьяна 19.07.2013 № 16645
		если ДатаНарушенияРежимаКон > ДатаНачалаСобытия + дниНеПолнойОплаты * мДлинаСуток тогда 
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия + дниНеПолнойОплаты * мДлинаСуток, ВидРасчетаОтПричины, 100 * КоэффициентПроцента);
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, 100 * КоэффициентПроцента);
		иначе
			если  не (ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.БольничныйЛистАлкоголь и КалендарныеДни) Тогда
				
				//Аверсон 07.02.2023 КВВ СВФР-010300 (
				
				////Аверсон ЕАЕ 29.04.2022 СВФР-008992
				////ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
				//ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, 100 * КоэффициентПроцента);
				////Аверсон СВФР-008992
				
				//ПрОпл = ?(Организация.ИНН = "192798722" ИЛИ Организация.ИНН = "191307958",ПроцентОплаты,100); //сказано делать для всех
				ПрОпл = ПроцентОплаты;
				
				//СВЭЙ 28.08.2023 КВВ СВФР-011318 (
				//ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, 100 * КоэффициентПроцента);
				ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, ПрОпл * КоэффициентПроцента);
				//СВЭЙ 28.08.2023 КВВ СВФР-011318 )
				
				//Аверсон 07.02.2023 КВВ СВФР-010300 )
				
			иначе
				если ЗначениеЗаполнено(ДатаНарушенияРежимаКон) Тогда 
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНарушенияРежимаКон+мДлинаСуток,  ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
				КонецЕсли;
			КонецЕсли;
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия + дниНеПолнойОплаты * мДлинаСуток, ВидРасчетаОтПричины, 100 * КоэффициентПроцента);
		КонецЕсли;
		//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
		
		ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаОкончанияОплаты + мДлинаСуток, 		   ВидРасчетаОтПричины, 0);
		
	//Иначе
	//	
	//	ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаНачалаСобытия, 		   ВидРасчетаОтПричины, ПроцентОплаты * КоэффициентПроцента);
	//	ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаОкончанияОплаты + мДлинаСуток, ВидРасчетаОтПричины, 0);
	//	ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, ДатаОкончанияОплаты + мДлинаСуток, ВидРасчетаОтПричины, 0);
	//	
	//КонецЕсли;
	
	//Аверсон ЕАЕ 08.01.2024 СВФР-013953
	ТаблицаИнтерваловОплатыДобавляем = ТаблицаИнтерваловОплаты.Скопировать();
	ТаблицаИнтерваловОплатыДобавляем.Очистить();
	Если ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
		Для Каждого Стр Из РаботаПриБЛПоУходу Цикл
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплатыДобавляем, Стр.Дата, ВидРасчетаОтПричины, 0);
			//находим предыдущую дату
			д = НачалоДня(Стр.Дата - 1);
			Нашли = Ложь;
			Пока д >= ДатаНачалаСобытия Цикл 
				НужнаяСтр = ТаблицаИнтерваловОплаты.Найти(д, "Начало");
				Если НужнаяСтр <> Неопределено Тогда
					ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплатыДобавляем, КонецДня(Стр.Дата) + 1, НужнаяСтр.Расчет, НужнаяСтр.ПроцентОплаты);
                    Нашли = Истина;
					Прервать;
				КонецЕсли;
				д = НачалоДня(д - 1);		
			КонецЦикла;
			Если Не Нашли Тогда
				ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплатыДобавляем, КонецДня(Стр.Дата) + 1, ВидРасчетаОтПричины, 100);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Стр Из ТаблицаИнтерваловОплатыДобавляем Цикл
			ДобавитьСтрокуВТаблицуИнтервалов(ТаблицаИнтерваловОплаты, Стр.Начало, Стр.Расчет, Стр.ПроцентОплаты);
		КонецЦикла;
	КонецЕсли;
	//Аверсон СВФР-013953
	
	ТаблицаИнтерваловОплаты.Сортировать("Начало");//О.Т. 07.09.2015 № 572
	Возврат ТаблицаИнтерваловОплаты
	
	
КонецФункции // ЗаполнитьТаблицуИнтервалов()

// Возвращает дату начала события
Функция ПолучитьДатуНачалаСобытия() Экспорт
	
	Если ЗначениеЗаполнено(ПервичныйБольничныйЛист) Тогда
		Возврат ПервичныйБольничныйЛист.ДатаНачала;
	Иначе
		Возврат ДатаНачала;
	КонецЕсли;
	
КонецФункции // ПолучитьДатуНачалаСобытия()

// Возвращает вид расчета, соответствующий причине нетрудоспособности
//
// Параметры
//  Причина  – <ПеречислениеСсылка.ПричиныНетрудочпособности> – причина нетрудоспособности
//
// Возвращаемое значение:
//   ПланыВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций   – вид расчета
//
Функция ПолучитьВидРасчетаОтПричиныНетрудоспособности(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам;
		
	ИначеЕсли Причина = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве;
	ИначеЕсли Причина = Перечисления.ПричиныНетрудоспособности.ПоУходу Тогда
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоУходу;	
	Иначе
		Возврат ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ;
		
	КонецЕсли;
	
КонецФункции // ПолучитьВидРасчетаОтПричиныНетрудоспособности()

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати
//	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	//Усков Сергей 08.08.2013 № 16699+
	//Возврат Новый Структура("РасчетСреднегоЗаработка","Расчет среднего заработка");
	Результат = Новый Структура();
	Результат.Вставить("РасчетСреднегоЗаработка","Расчет среднего заработка");
	Результат.Вставить("Оборот11072013","Форма с 11.07.13");
	Возврат Результат;
	//Усков Сергей 08.08.2013 № 16699+
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа для целей выода документа на печать
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапкеДляПечати()
	
	ДатаНачалаСобытия = Датаначала;
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	//Запрос.УстановитьПараметр("ГоловнаяОрганизация" , ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДатаНачалаСобытия" , ДатаНачалаСобытия);
	Запрос.УстановитьПараметр("ФизЛицо" , Сотрудник.Физлицо);	
	Запрос.УстановитьПараметр("Сотрудник" , Сотрудник);	
	//Запрос.УстановитьПараметр("Приказ" , Приказ);
	
	//Толик	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Отпуск.Дата КАК ДатаДокумента,
	|	Отпуск.Номер КАК НомерДокумента1,
	|	Отпуск.Сотрудник.Физлицо КАК ФизЛицо,
	|	Отпуск.Организация.КодПоОКПО КАК КодПоОКПО,
	|	Отпуск.Организация.НаименованиеПолное КАК НазваниеОрганизации,
	|	ВЫБОР
	|		КОГДА ФИОФизлица.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА Отпуск.Физлицо.Наименование
	|		ИНАЧЕ ФИОФизлица.Фамилия + "" "" + ФИОФизлица.Имя + "" "" + ФИОФизлица.Отчество
	|	КОНЕЦ КАК ФИО,
	|	Отпуск.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.Наименование КАК Подразделение,
	|	РаботникиОрганизацииСрезПоследних.Должность.Наименование КАК Должность,
	|	Отпуск.СерияВходящегоДокумента + Отпуск.НомерВходящегоДокумента КАК НомерДокумента,
	|	Отпуск.ОграничениеПособия
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК Отпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаНачалаСобытия, ФизЛицо = &ФизЛицо) КАК ФИОФизлица
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Отпуск.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапкеДляПечати()

//заявка №1640 (база заявок Кристалла) Дмитрук О.Г.
Функция ПроверкаСотрудника() Экспорт
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДатаНачала,
	Новый Структура("Организация, Сотрудник", Организация, Сотрудник));
	
	Если мСтрока.ЗанимаемыхСтавок = 0 Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
	
КонецФункции
//заявка №1640

// Формирует запрос по шапке документа
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(ОтражениеВУчете = Истина)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",			Ссылка);
	Запрос.УстановитьПараметр("Сотрудник",				Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",		ПолучитьДатуНачалаСобытия());
	//Запрос.УстановитьПараметр("ДатаЗакона255ФЗ", 		мДатаЗакона255ФЗ);
	//толик - перерасчет 1 01 2009	
	
	мДатаИзмененияЗП = ПрочиеПроцедуры.ОпределитьДатуИзмененияЗП(Организация);
	мМесяц = НачалоМесяца(ПолучитьДатуНачалаСобытия());
	
	Если мМесяц = мДатаИзмененияЗП Тогда
		ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка-1;
		КоличествоМесяцевРасчета = 0;
		СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
	ИначеЕсли мМесяц = ДобавитьМесяц(мДатаИзмененияЗП, 1) Тогда
		ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка+1;
		СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
	Иначе
		ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		СекундыКонцаПериода = -1;
	КонецЕсли;
	
	//проверим был ли принят в расчетном месяце
	
	мСтрока = РегистрыСведений.РаботникиОрганизаций.СрезПервых('19000101000000',
	Новый Структура("Организация, Сотрудник", Организация, Сотрудник));
	Если мСтрока.Количество() <>  0 Тогда
		Если НачалоМесяца(мСтрока[0].Период) = НачалоМесяца(мМесяц) Тогда
			ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка-1;
			КоличествоМесяцевРасчета = 0;
			СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
		КонецЕсли;
		//СМА СВФР-007810  06.07.2021
		РасчетнаяДатаНачала = ДобавитьМесяц(мМесяц,КоличествоМесяцевРасчета);
		Если РасчетнаяДатаНачала < НачалоМесяца(мСтрока[0].Период) Тогда
			Мес = 0;
			ОбщегоНазначения.РазобратьРазностьДат(НачалоМесяца(мМесяц), НачалоМесяца(мСтрока[0].Период), ,Мес,);
			ПериодРСЗ = Мес;
			КоличествоМесяцевРасчета = -Мес;
		КонецЕсли;
		//СМА СВФР-007810
		
		//Аверсон ЕАЕ 10.10.2017
		//Если НачалоМесяца(мСтрока[0].Период) = ДобавитьМесяц(НачалоМесяца(мМесяц), -1) Тогда
		//	ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		//	КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка+1;
		//	СекундыКонцаПериода = КонецМесяца(мМесяц)-мМесяц;
		//КонецЕсли;
		//Аверсон
	КонецЕсли;
	
	//проверим были ли начисления в текущем месяце
	мНетДанных = Ложь;
	Если мМесяц = мДатаИзмененияЗП Тогда
		Если ПрочиеПроцедуры.ПолучитьБазу(Сотрудник.Физлицо, мМесяц, ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ, мМесяц+СекундыКонцаПериода) = 0 Тогда
			мНетДанных = Истина;
		КонецЕсли;
		Если (НЕ ЗначениеЗаполнено(ПрочиеПроцедуры.ОтработанноеВремяПоПлановымГраффикамПлан(НачалоМесяца(мМесяц), ПолучитьДатуНачалаСобытия()-86400, Сотрудник, Перечисления.ВидыУчетаВремени.ПоЧасам, Ложь))) Тогда
			мНетДанных = Истина;
		КонецЕсли;
	КонецЕсли;
	Если мНетДанных Тогда
		//расчет по умолчанию
		ПериодРСЗ = ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		КоличествоМесяцевРасчета = -ВидРасчета.ПериодРасчетаСреднегоЗаработка;
		СекундыКонцаПериода = -1;
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("ПериодРСЗ",	ПериодРСЗ);
	Запрос.УстановитьПараметр("КоличествоМесяцевРасчета",	КоличествоМесяцевРасчета);
	Запрос.УстановитьПараметр("СекундыКонцаПериода",	СекундыКонцаПериода);
	
	//енд	
	
	Запрос.Текст =
	"ВЫБРАТЬ              
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|	КОНЕЦ КАК СуммированныйУчетРабочегоВремени,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаНачалаСобытия
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ГрафикПолногоРабочегоВремени
	|	КОНЕЦ КАК ГрафикПолногоРабочегоВремени
	|ПОМЕСТИТЬ ВТДанныеОСотруднике
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних";
	Запрос.Выполнить();
	//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
	//Островская Татьяна 28.12.2012 № 16068, 17421
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеПоБольничномуЛисту.Дата,
	|	НачислениеПоБольничномуЛисту.ПериодРегистрации,
	|	НачислениеПоБольничномуЛисту.Организация,
	|	НачислениеПоБольничномуЛисту.Комментарий,
	|	НачислениеПоБольничномуЛисту.Ответственный,
	|	НачислениеПоБольничномуЛисту.Сотрудник,
	|	НачислениеПоБольничномуЛисту.Физлицо,
	|	НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности,
	|	НачислениеПоБольничномуЛисту.ПроцентОплаты,
	|	НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист,
	|	НачислениеПоБольничномуЛисту.ДатаНачала,
	|	НачислениеПоБольничномуЛисту.ДатаОкончания,
	|	НачислениеПоБольничномуЛисту.ОграничениеПособия,
	|	НачислениеПоБольничномуЛисту.ПерерассчитываемыйДокумент,
	|	НачислениеПоБольничномуЛисту.ПособиеОтражаетсяВРеглУчетеТекущимДокументом,
	|	НачислениеПоБольничномуЛисту.ДнейОплаты,
	|	НачислениеПоБольничномуЛисту.ОграничениеПособияПереходногоПериода,
	|	НачислениеПоБольничномуЛисту.ДатаНарушенияРежима,
	|	НачислениеПоБольничномуЛисту.ВидРасчета,
	|	НачислениеПоБольничномуЛисту.Ссылка,
	|	НачислениеПоБольничномуЛисту.РучнойРасчетСреднегоЗаработка,
	|	НачислениеПоБольничномуЛисту.РазмерСреднегоЗаработка,
	|	НачислениеПоБольничномуЛисту.СпособРасчетаВДнях,
	|	НачислениеПоБольничномуЛисту.ДатаНарушенияРежимаКон,
	|	НачислениеПоБольничномуЛисту.ДнейДоБЛ,
	|	НачислениеПоБольничномуЛисту.РаботалВПервыйДеньБЛ,
	|	НачислениеПоБольничномуЛисту.ТипРасчета,
	|	НачислениеПоБольничномуЛисту.СпособРасчетаВЧасах
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
	|ГДЕ
	|	НачислениеПоБольничномуЛисту.Ссылка = &ДокументСсылка";
	//Островская Татьяна 28.12.2012 № 16068
	//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598,17421
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	"""" КАК СтратегияОтраженияВУчете,
	|	0 КАК ПроцентЕНВД,
	|	ЛОЖЬ КАК УказаноОтражениеВУчетеДляРаботодателя,
	|	"""" КАК ОтражениеВУСН,
	|	"""" КАК СчетДт,
	|	"""" КАК СубконтоДт1,
	|	"""" КАК СубконтоДт2,
	|	"""" КАК СубконтоДт3,
	|	"""" КАК СчетКт,
	|	"""" КАК СубконтоКт1,
	|	"""" КАК СчетДтНУ,
	|	"""" КАК СубконтоДтНУ1,
	|	"""" КАК СубконтоДтНУ2,
	|	"""" КАК СубконтоДтНУ3,
	|	"""" КАК СчетКтНУ,
	|	"""" КАК СубконтоКтНУ1
	|ПОМЕСТИТЬ ВТОтражениеВУчете";
	
	//КонецЕсли;
	Запрос.Выполнить();
	//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598,17421
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеПоБольничномуЛисту.Ссылка,
	|	НачислениеПоБольничномуЛисту.Дата,
	|	НачислениеПоБольничномуЛисту.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачислениеПоБольничномуЛисту.Организация
	|		ИНАЧЕ НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НачислениеПоБольничномуЛисту.Организация
	|		ИНАЧЕ НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	НачислениеПоБольничномуЛисту.Организация КАК ОбособленноеПодразделение,
	|	НачислениеПоБольничномуЛисту.Сотрудник,
	|	НачислениеПоБольничномуЛисту.Сотрудник.Физлицо КАК Физлицо,
	|	НачислениеПоБольничномуЛисту.Сотрудник.ВидЗанятости КАК ВидЗанятости,
	|	НачислениеПоБольничномуЛисту.ПроцентОплаты,
	|	НачислениеПоБольничномуЛисту.ПричинаНетрудоспособности,
	|	НачислениеПоБольничномуЛисту.ДатаНачала,
	|	НачислениеПоБольничномуЛисту.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|			ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|		ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|	КОНЕЦ КАК ДатаНачалаСобытия,
	|	НачислениеПоБольничномуЛисту.ДатаНарушенияРежима,
	|	НачислениеПоБольничномуЛисту.ДнейОплаты,
	|	НачислениеПоБольничномуЛисту.ВидРасчета КАК ВидРасчета,
	|	ПараметрыВидаРасчета.СпособРасчета КАК СпособРасчета,
	|	&ДокументСсылка КАК ДокументОснование,
	|	&ПериодРСЗ КАК ПериодРасчетаСреднегоЗаработка,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|					ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|				ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫБОР
	|						КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|							ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|						ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|					КОНЕЦ, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|					ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|				ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫБОР
	|						КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|							ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|						ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|					КОНЕЦ, МЕСЯЦ), МЕСЯЦ, &КоличествоМесяцевРасчета)
	|	КОНЕЦ КАК ДатаНачалаРасчетногоПериода,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|					ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|				ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫБОР
	|						КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|							ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|						ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|					КОНЕЦ, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	|	КОНЕЦ КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|					ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|				ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|			КОНЕЦ = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВЫБОР
	|						КОГДА НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист = ЗНАЧЕНИЕ(Документ.НачислениеПоБольничномуЛисту.ПустаяСсылка)
	|							ТОГДА НачислениеПоБольничномуЛисту.ДатаНачала
	|						ИНАЧЕ НачислениеПоБольничномуЛисту.ПервичныйБольничныйЛист.ДатаНачала
	|					КОНЕЦ, МЕСЯЦ), СЕКУНДА, &СекундыКонцаПериода)
	|	КОНЕЦ КАК ДатаОкончанияРасчетногоПериода,
	|	РаботникиОрганизацииСрезПоследних.ГрафикРаботы КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизацииСрезПоследних.СуммированныйУчетРабочегоВремени
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	НачислениеПоБольничномуЛисту.ПерерассчитываемыйДокумент КАК ПерерассчитываемыйДокумент,
	|	НачислениеПоБольничномуЛисту.ПерерассчитываемыйДокумент.ПериодРегистрации КАК ПериодПерерасчета,
	|	НачислениеПоБольничномуЛисту.ПерерассчитываемыйДокумент.Организация КАК ОрганизацияПерерасчета,
	|	НачислениеПоБольничномуЛисту.ПособиеОтражаетсяВРеглУчетеТекущимДокументом КАК ОтражатьВУчетеЭтимДокументом,
	|	ВЫБОР
	|		КОГДА НачислениеПоБольничномуЛисту.Сотрудник.Организация = ВЫБОР
	|				КОГДА НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА НачислениеПоБольничномуЛисту.Организация
	|				ИНАЧЕ НачислениеПоБольничномуЛисту.Организация.ГоловнаяОрганизация
	|			КОНЕЦ
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА НачислениеПоБольничномуЛисту.Дата < НачислениеПоБольничномуЛисту.ПериодРегистрации
	|			ТОГДА НачислениеПоБольничномуЛисту.ПериодРегистрации
	|		КОГДА НачислениеПоБольничномуЛисту.Дата > КОНЕЦПЕРИОДА(НачислениеПоБольничномуЛисту.ПериодРегистрации, МЕСЯЦ)
	|			ТОГДА КОНЕЦПЕРИОДА(НачислениеПоБольничномуЛисту.ПериодРегистрации, МЕСЯЦ)
	|		ИНАЧЕ НачислениеПоБольничномуЛисту.Дата
	|	КОНЕЦ КАК ПериодРегистрацииДополнительныхНачислений,
	|	НачислениеПоБольничномуЛисту.РучнойРасчетСреднегоЗаработка,
	|	НачислениеПоБольничномуЛисту.РазмерСреднегоЗаработка,
	|	НачислениеПоБольничномуЛисту.СпособРасчетаВДнях,
	|	ДанныеОбОтражении.СтратегияОтраженияВУчете,
	|	ДанныеОбОтражении.ПроцентЕНВД,
	|	ДанныеОбОтражении.УказаноОтражениеВУчетеДляРаботодателя,
	|	ДанныеОбОтражении.ОтражениеВУСН,
	|	ДанныеОбОтражении.СчетДт,
	|	ДанныеОбОтражении.СубконтоДт1,
	|	ДанныеОбОтражении.СубконтоДт2,
	|	ДанныеОбОтражении.СубконтоДт3,
	|	ДанныеОбОтражении.СчетКт,
	|	ДанныеОбОтражении.СубконтоКт1,
	|	ДанныеОбОтражении.СчетДтНУ,
	|	ДанныеОбОтражении.СубконтоДтНУ1,
	|	ДанныеОбОтражении.СубконтоДтНУ2,
	|	ДанныеОбОтражении.СубконтоДтНУ3,
	|	ДанныеОбОтражении.СчетКтНУ,
	|	ДанныеОбОтражении.СубконтоКтНУ1,
	|	НачислениеПоБольничномуЛисту.ДатаНарушенияРежимаКон,
	|	НачислениеПоБольничномуЛисту.ТипРасчета,
	|	НачислениеПоБольничномуЛисту.ДнейДоБЛ,
	|	НачислениеПоБольничномуЛисту.РаботалВПервыйДеньБЛ,
	|	НачислениеПоБольничномуЛисту.СпособРасчетаВЧасах
	|ИЗ
	|	ВТДанныеДокумента КАК НачислениеПоБольничномуЛисту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОСотруднике КАК РаботникиОрганизацииСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтражениеВУчете КАК ДанныеОбОтражении
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ПараметрыВидаРасчета
	|		ПО НачислениеПоБольничномуЛисту.ВидРасчета = ПараметрыВидаРасчета.Ссылка";
	//Островская Татьяна 28.12.2012 № 16068,17421
	//Аверсон-софт, Островская Татьяна 17.07.2012 № 15598
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по табличной части Начисления
//
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	
	ГоловнаяОрганизация = ВыборкаПоШапкеДокумента.Организация;
	СписокСтруктурныхПодразделений = ПроцедурыУправленияПерсоналом.ПолучитьСписокОбособленныхПодразделенийОрганизации(ГоловнаяОрганизация);
	СписокСтруктурныхПодразделений.Добавить(ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокСтруктурныхПодразделений",	СписокСтруктурныхПодразделений);
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",					Ссылка);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия" , 			ВыборкаПоШапкеДокумента.ДатаНачалаСобытия);
	//Запрос.УстановитьПараметр("ДатаЗакона255ФЗ",				мДатаЗакона255ФЗ);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",			ГоловнаяОрганизация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокиНачисления.НомерСтроки,
	|	СтрокиНачисления.Сотрудник,
	|	ЕСТЬNULL(ГрафикРаботыПоСотруднику.Сотрудник, ВЫБОР
	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|		КОНЕЦ) КАК ГрафикРаботы,
	|	ВЫБОР
	|		КОГДА (НЕ ГрафикРаботыНормаПоСотруднику.НомерСтроки ЕСТЬ NULL )
	|				ИЛИ (РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|						И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|						И (НЕ РаботникиОрганизации.ГрафикРаботыЗавершения.ГрафикПолногоРабочегоВремени ЕСТЬ NULL )
	|					ИЛИ (НЕ(РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|								И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)))
	|						И РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени <> ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|						И (НЕ РаботникиОрганизации.ГрафикРаботы.ГрафикПолногоРабочегоВремени ЕСТЬ NULL ))
	|			ТОГДА ВЫБОР
	|					КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|							И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
	|					ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
	|				КОНЕЦ
	|	КОНЕЦ КАК ГрафикРаботыНорма,
	|	ВЫБОР
	//|		КОГДА &ДатаНачалаСобытия >= &ДатаЗакона255ФЗ
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|		КОГДА ВЫБОР
	|				КОГДА РаботникиОрганизации.ПериодЗавершения <= СтрокиНачисления.ДатаНачалаСобытия
	|						И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения.СуммированныйУчетРабочегоВремени
	|				ИНАЧЕ РаботникиОрганизации.ГрафикРаботы.СуммированныйУчетРабочегоВремени
	|			КОНЕЦ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	КОНЕЦ КАК ВидУчетаВремени,
	|	СтрокиНачисления.ВидРасчета,
	|	СтрокиНачисления.ВидРасчета.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
	|	СтрокиНачисления.ВидРасчета.ЗачетНормыВремени КАК ЗачетНормыВремени,
	|	СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	//|	ВЫБОР
	//|		КОГДА СтрокиНачисления.ВидРасчета.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ПустаяСсылка)
	//|		КОГДА СтрокиНачисления.Ссылка.ПособиеОтражаетсяВРеглУчетеТекущимДокументом
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать)
	//|		КОГДА СтрокиНачисления.Ссылка.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.ОтпускПоБеременностиИРодамПоУходуЗаРебенком)
	//|		КОГДА СтрокиНачисления.Ссылка.ПричинаНетрудоспособности = ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаНаПроизводстве)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.БольничныйТравмаНаПроизводстве)
	//|		КОГДА СтрокиНачисления.Ссылка.ПричинаНетрудоспособности В (ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ТравмаВБыту), ЗНАЧЕНИЕ(Перечисление.ПричиныНетрудоспособности.ОбщееЗаболевание))
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.БольничныйОбщееЗаболевание)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.БольничныйПрочий)
	//|	КОНЕЦ КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете.НеОбрабатывать) КАК ВариантОбработкиЗаписиПриОтраженииВРеглУчете,
	//|	ВЫБОР
	//|		КОГДА СтрокиНачисления.ВидРасчета.КодДоходаНДФЛ В (ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию), ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код2012))
	//|			ТОГДА СтрокиНачисления.ДатаНачала
	//|		ИНАЧЕ СтрокиНачисления.Ссылка.ПериодРегистрации
	//|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	СтрокиНачисления.ДатаНачала КАК МесяцНалоговогоПериода,
	|	СтрокиНачисления.ДатаНачала КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	СтрокиНачисления.ДатаНачала КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокиНачисления.ДатаОкончания, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	СтрокиНачисления.Показатель1,
	|	СтрокиНачисления.Показатель2,
	|	СтрокиНачисления.Показатель3,
	|	СтрокиНачисления.Показатель4,
	|	СтрокиНачисления.Показатель5,
	|	СтрокиНачисления.Показатель6,
	|	СтрокиНачисления.Результат,
	|	СтрокиНачисления.ДополнительныеДанные,
	|	СтрокиНачисления.ПодразделениеОрганизации,
	|	СтрокиНачисления.ОплаченоДнейЧасов,
	//толик
	|	СтрокиНачисления.ОплаченоДней,
	//
	|	СтрокиНачисления.ОтработаноДней,
	|	СтрокиНачисления.ОтработаноЧасов,
	|	СтрокиНачисления.ОтработаноДнейПоПятидневке,
	|	СтрокиНачисления.ОтработаноЧасовПоПятидневке,
	|	СтрокиНачисления.НормаДней,
	|	СтрокиНачисления.НормаЧасов,
	|	СтрокиНачисления.НормаДнейПоПятидневке,
	|	СтрокиНачисления.НормаЧасовПоПятидневке,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаНачало,
	|	СтрокиНачисления.ПериодРасчетаСреднегоЗаработкаОкончание,
	|	СтрокиНачисления.ДатаНачалаСобытия,
	|	СтрокиНачисления.Сторно,
	|	СтрокиНачисления.Авторасчет,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ВЫБОР
	|		КОГДА (НЕ СтрокиНачисления.ПодразделениеОрганизации.Владелец В (&СписокСтруктурныхПодразделений))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПодразделениеНеПринадлежитОрганизации,
	|	ВЫБОР
	|		КОГДА СтрокиНачисления.Сторно
	|			ТОГДА СтрокиНачисления.СторнируемыйДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СторнируемыйДокумент,
	|	СтрокиНачисления.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления,
	|	СтрокиНачисления.ЧислоМесяцев
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту.Начисления КАК СтрокиНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РаботникиОрганизации.Период) КАК МаксПериод,
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			Документ.НачислениеПоБольничномуЛисту.Начисления КАК СтрокиНачисления
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|				ПО (РаботникиОрганизации.Период <= СтрокиНачисления.ДатаНачалаСобытия)
	|					И СтрокиНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтрокиНачисления.НомерСтроки) КАК ПоследниеДаты
	|		ПО СтрокиНачисления.НомерСтроки = ПоследниеДаты.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО (РаботникиОрганизации.Период = ПоследниеДаты.МаксПериод)
	|			И СтрокиНачисления.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|			СтрокиНачисления.Сотрудник КАК Сотрудник
	|		ИЗ
	|			Документ.НачислениеПоБольничномуЛисту.Начисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СтрокиНачисления.Сотрудник)
	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаНачала, МЕСЯЦ))
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка) КАК ГрафикРаботыПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыПоСотруднику.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			СтрокиНачисления.НомерСтроки КАК НомерСтроки,
	|			СтрокиНачисления.Сотрудник КАК Сотрудник
	|		ИЗ
	|			Документ.НачислениеПоБольничномуЛисту.Начисления КАК СтрокиНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|				ПО (ГрафикиРаботыПоВидамВремени.ГрафикРаботы = СтрокиНачисления.Сотрудник)
	|					И (ГрафикиРаботыПоВидамВремени.Месяц = НАЧАЛОПЕРИОДА(СтрокиНачисления.ДатаНачала, МЕСЯЦ))
	|					И ((НЕ ГрафикиРаботыПоВидамВремени.План))
	|		ГДЕ
	|			СтрокиНачисления.Ссылка = &ДокументСсылка) КАК ГрафикРаботыНормаПоСотруднику
	|		ПО СтрокиНачисления.НомерСтроки = ГрафикРаботыНормаПоСотруднику.НомерСтроки
	|ГДЕ
	|	СтрокиНачисления.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачислениям()

// Формирует запрос по таблице "РасчетСреднего" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоРасчетСреднего()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ДатаЗакона180ФЗ",	мДатаЗакона180ФЗ);
	
	// реализация Федерального закона № 180-ФЗ от 22.12.2005 г.:
	// поле "Сотрудник" с 1 января 2006 года может идентифицировать несколько мест работы,
	// включая работу по внутреннему совместительству
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СтрокаРасчетСреднего.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА СтрокаРасчетСреднего.Ссылка.Организация
	|		ИНАЧЕ СтрокаРасчетСреднего.Ссылка.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	СтрокаРасчетСреднего.Ссылка.Сотрудник.Физлицо КАК Физлицо,
	|	СтрокаРасчетСреднего.НомерСтроки,
	|	СтрокаРасчетСреднего.Сотрудник,
	|	СтрокаРасчетСреднего.ВидРасчета,
	|	СтрокаРасчетСреднего.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ВЫБОР
	|		КОГДА СтрокаРасчетСреднего.БазовыйПериодКонец <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокаРасчетСреднего.БазовыйПериодКонец, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК БазовыйПериодКонец,
	|	СтрокаРасчетСреднего.КоэффициентИндексации,
	|	СтрокаРасчетСреднего.Результат,
	|	СтрокаРасчетСреднего.ОтработаноПоПятидневке,
	|	СтрокаРасчетСреднего.НормаПоПятидневке,
	|	СтрокаРасчетСреднего.ОтработаноДней,
	|	СтрокаРасчетСреднего.ОтработаноЧасов,
	|	СтрокаРасчетСреднего.МесяцВыборки,
	|	СтрокаРасчетСреднего.ЧислоМесяцев,
	|	СтрокаРасчетСреднего.ТарифнаяСтавкаПериода,
	|	СтрокаРасчетСреднего.ТекущаяТарифнаяСтавка
	
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту.РасчетСреднего КАК СтрокаРасчетСреднего
	|ГДЕ
	|	СтрокаРасчетСреднего.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРасчетСреднего()

// Формирует запрос по таблице "ОтражениеВУчете" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоОтражениеВУчете()
	
	// готовим список счетов
	СчетаИсключения = Новый Массив();
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыль);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
	
	ТекстСчетаИсключения = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СчетаИсключения)";
	
	Запрос = Новый Запрос(ТекстСчетаИсключения);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	СчетаИсключения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	Запрос.УстановитьПараметр("ДатаНачалаСобытия", ПолучитьДатуНачалаСобытия());
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтрокаОтраженияВУчете.НомерСтроки,
	|	СтрокаОтраженияВУчете.Ссылка.Сотрудник,
	|	СтрокаОтраженияВУчете.Ссылка.Сотрудник.Физлицо КАК Физлицо,
	|	&ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	ВЫБОР
	|		КОГДА СтрокаОтраженияВУчете.СчетДт В (&СчетаИсключения)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОтражаетсяНУ,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА СтрокаОтраженияВУчете.СубконтоДт1 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА СтрокаОтраженияВУчете.СубконтоДт1.ОтнесениеРасходовКДеятельностиЕНВД
	|				КОГДА СтрокаОтраженияВУчете.СубконтоДт2 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА СтрокаОтраженияВУчете.СубконтоДт2.ОтнесениеРасходовКДеятельностиЕНВД
	|				КОГДА СтрокаОтраженияВУчете.СубконтоДт3 ССЫЛКА Справочник.СтатьиЗатрат
	|					ТОГДА СтрокаОтраженияВУчете.СубконтоДт3.ОтнесениеРасходовКДеятельностиЕНВД
	|				ИНАЧЕ NULL
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЕНВД,
	|	СтрокаОтраженияВУчете.Результат,
	|	СтрокаОтраженияВУчете.СчетДт,
	|	СтрокаОтраженияВУчете.СчетДт.Наименование КАК НаименованиеСчетДт,
	|	СтрокаОтраженияВУчете.СубконтоДт1,
	|	СтрокаОтраженияВУчете.СубконтоДт2,
	|	СтрокаОтраженияВУчете.СубконтоДт3,
	|	СтрокаОтраженияВУчете.СчетКт,
	|	СтрокаОтраженияВУчете.СубконтоКт1,
	|	СтрокаОтраженияВУчете.СубконтоКт2,
	|	СтрокаОтраженияВУчете.СубконтоКт3,
	|	СтрокаОтраженияВУчете.СчетДтНУ,
	|	СтрокаОтраженияВУчете.СубконтоДтНУ1,
	|	СтрокаОтраженияВУчете.СубконтоДтНУ2,
	|	СтрокаОтраженияВУчете.СубконтоДтНУ3,
	|	СтрокаОтраженияВУчете.СчетКтНУ,
	|	СтрокаОтраженияВУчете.СубконтоКтНУ1,
	|	СтрокаОтраженияВУчете.СубконтоКтНУ2,
	|	СтрокаОтраженияВУчете.СубконтоКтНУ3,
	|	СтрокаОтраженияВУчете.ОтражениеВУСН,
	|	СтрокаОтраженияВУчете.ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА СтрокаОтраженияВУчете.ПериодДействияКонец <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КОНЕЦПЕРИОДА(СтрокаОтраженияВУчете.ПериодДействияКонец, ДЕНЬ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	СтрокаОтраженияВУчете.КодДоходаЕСН,
	|	СтрокаОтраженияВУчете.ОблагаетсяЕНВД,
	|	СтрокаОтраженияВУчете.Сторно
	|ИЗ
	|	Документ.НачислениеПоБольничномуЛисту.ОтражениеВУчете КАК СтрокаОтраженияВУчете
	|ГДЕ
	|	СтрокаОтраженияВУчете.Ссылка = &ДокументСсылка
	|	И СтрокаОтраженияВУчете.Результат <> 0";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоОтражениеВУчете()

// Формирует запрос по табличным частям документам
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоПособияСоциальномуСтрахованию()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаЗакона255ФЗ" , НачалоМесяца(мДатаЗакона255ФЗ));
	Запрос.УстановитьПараметр("НовыйСтраховойСлучай", ?(ПервичныйБольничныйЛист.Пустая() и ПерерассчитываемыйДокумент.Пустая(),1,0));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСНОсновныеНачисления.ПериодРегистрации КАК Период,
	|	ЕСНОсновныеНачисления.ОбособленноеПодразделение КАК Организация,
	|	ВЫБОР
	|		КОГДА ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ПособияЗаСчетФСС)
	|			ТОГДА ЕСНОсновныеНачисления.ВидРасчета.ВидПособияСоциальногоСтрахования
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
	|	КОНЕЦ КАК ВидПособияСоциальногоСтрахования,
	|	ЕСНОсновныеНачисления.ОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСНОсновныеНачисления.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ПустаяСсылка)
	|	КОНЕЦ КАК ВидЗанятости,
	|	&НовыйСтраховойСлучай КАК СтраховыеСлучаи,
	|	СУММА(ЕСТЬNULL(ЕСНФактическийПериодДействия.ОплаченныеДни, ВЫБОР
	|				КОГДА ЕСНОсновныеНачисления.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|					ТОГДА ЕСНОсновныеНачисленияДанныеГрафика.ОсновноеЗначениеФактическийПериодДействия
	|				ИНАЧЕ ЕСНОсновныеНачисленияДанныеГрафика.ДополнительноеЗначениеФактическийПериодДействия
	|			КОНЕЦ) * ВЫБОР
	|			КОГДА ЕСНОсновныеНачисления.Сторно
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ОплаченныеДни,
	|	СУММА(ЕСНОсновныеНачисления.Результат) КАК СуммаВсего,
	|	ЕСНОсновныеНачисления.Сотрудник,
	|	ЕСНОсновныеНачисления.ДокументОснование
	|ИЗ
	|	РегистрРасчета.ЕСНОсновныеНачисления КАК ЕСНОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ЕСНОсновныеНачисления.ДанныеГрафика(
	|				Регистратор = &ДокументСсылка
	|					И (НЕ ВидРасчета.ВидПособияСоциальногоСтрахования В (ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)))) КАК ЕСНОсновныеНачисленияДанныеГрафика
	|		ПО ЕСНОсновныеНачисления.Регистратор = ЕСНОсновныеНачисленияДанныеГрафика.Регистратор
	|			И ЕСНОсновныеНачисления.НомерСтроки = ЕСНОсновныеНачисленияДанныеГрафика.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЕСНФактическийПериодДействия.Регистратор КАК Регистратор,
	|			ЕСНФактическийПериодДействия.НомерСтроки КАК НомерСтроки,
	|			СУММА(РАЗНОСТЬДАТ(ЕСНФактическийПериодДействия.ПериодДействияНачало, ЕСНФактическийПериодДействия.ПериодДействияКонец, ДЕНЬ) + 1) КАК ОплаченныеДни
	|		ИЗ
	|			РегистрРасчета.ЕСНОсновныеНачисления.ФактическийПериодДействия(
	|					Регистратор = &ДокументСсылка
	|						И ПериодДействия >= &ДатаЗакона255ФЗ
	|						И ВидРасчета.ВидПособияСоциальногоСтрахования В (ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.Нетрудоспособность), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.БеременностьРоды), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай))) КАК ЕСНФактическийПериодДействия
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЕСНФактическийПериодДействия.Регистратор,
	|			ЕСНФактическийПериодДействия.НомерСтроки) КАК ЕСНФактическийПериодДействия
	|		ПО ЕСНОсновныеНачисления.НомерСтроки = ЕСНФактическийПериодДействия.НомерСтроки
	|			И ЕСНОсновныеНачисления.Регистратор = ЕСНФактическийПериодДействия.Регистратор
	|ГДЕ
	|	ЕСНОсновныеНачисления.Регистратор = &ДокументСсылка
	|	И ЕСНОсновныеНачисления.ВидРасчета.ВидПособияСоциальногоСтрахования <> ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСНОсновныеНачисления.ПериодРегистрации,
	|	ЕСНОсновныеНачисления.ОбособленноеПодразделение,
	|	ЕСНОсновныеНачисления.ОблагаетсяЕНВД,
	|	ЕСНОсновныеНачисления.Сотрудник,
	|	ЕСНОсновныеНачисления.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ЕСНОсновныеНачисления.КодДоходаЕСН = ЗНАЧЕНИЕ(Справочник.ДоходыЕСН.ПособияЗаСчетФСС)
	|			ТОГДА ЕСНОсновныеНачисления.ВидРасчета.ВидПособияСоциальногоСтрахования
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСНОсновныеНачисления.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ПустаяСсылка)
	|	КОНЕЦ";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")
	
	// ПериодРегистрации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;
	
	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется начисление!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаНачала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала оплачиваемого события!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаОкончания
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания оплачиваемого события!", Отказ, Заголовок);
	КонецЕсли;
	
	// Период нетрудоспособности
	Если ВыборкаПоШапкеДокумента.ДатаОкончания < ВыборкаПоШапкеДокумента.ДатаНачала Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Дата окончания оплачиваемого события не должна быть меньше даты начала!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана причина нетрудоспособности!", Отказ, Заголовок);
		//ИначеЕсли ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком И НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.СлучайУходаЗаБольнымРебенком) Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("Не указан случай ухода за ребенком!", Отказ, Заголовок);
	КонецЕсли;
	
	// Процент оплаты
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПроцентОплаты) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан процент оплаты!", Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка данных для переходного периода
	//Если ПерерассчитываемыйДокумент.Пустая() 
	//	И ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) 
	//	И ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания)
	//	И ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности) Тогда
	//	
	//	//мДатаЗакона255ФЗ = ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийПоСоциальнымПособиям2006();
	//	//Если ВыборкаПоШапкеДокумента.ДатаНачалаСобытия < мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ДатаОкончания >= мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
	//	//	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПричинаНетрудоспособностиПереходногоПериода) Тогда
	//	//		ОбщегоНазначения.СообщитьОбОшибке("Не указана причина нетрудоспособности для переходного периода!", Отказ, Заголовок);
	//	//	ИначеЕсли ВыборкаПоШапкеДокумента.ПричинаНетрудоспособностиПереходногоПериода = Перечисления.ПричиныНетрудоспособности.ПоУходуЗаРебенком И НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.СлучайУходаЗаБольнымРебенкомПереходногоПериода) Тогда
	//	//		ОбщегоНазначения.СообщитьОбОшибке("Не указан случай ухода за ребенком для переходного периода!", Отказ, Заголовок);
	//	//	КонецЕсли;
	//	//	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПроцентОплатыПереходногоПериода) Тогда
	//	//		ОбщегоНазначения.СообщитьОбОшибке("Не указан процент оплаты для переходного периода!", Отказ, Заголовок);
	//	//	КонецЕсли;
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидЗанятости
	//толик отменил
	//Если ВыборкаПоШапкеДокумента.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Документ не может быть оформлен на внутреннего совместителя!", Отказ, Заголовок);
	//КонецЕсли;
	
	// соответствие периодов документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ПериодПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ПериодРегистрации <= ВыборкаПоШапкеДокумента.ПериодПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Период документа должен быть больше периода перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
	// соответствие организаций документа и перерассчитываемого документа
	Если ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета <> null 
		и ВыборкаПоШапкеДокумента.ОбособленноеПодразделение <> ВыборкаПоШапкеДокумента.ОрганизацияПерерасчета Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Организация, заданная для документа, должна совпадать с организацией перерассчитываемого документа!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Начисления" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса к ТЧ документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверятьМестоРаботы)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Оплата"": ";
	
	// Сотрудник в табличном поле
	Если ПроверятьМестоРаботы И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала начисления!", Отказ, Заголовок);
	Иначе
		// Дата окончания
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПериодДействияКонец) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания начисления!", Отказ, Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ПериодДействияКонец < ВыборкаПоСтрокамДокумента.ПериодДействияНачало Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания начисления не должна быть меньше даты начала!", Отказ, Заголовок);
			ИначеЕсли ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда
				Если НачалоМесяца(ВыборкаПоСтрокамДокумента.ПериодДействияКонец) <> НачалоМесяца(ВыборкаПоСтрокамДокумента.ПериодДействияНачало) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "даты начала и окончания должны принадлежать одному месяцу!", Отказ, Заголовок);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Дата начала события
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачалаСобытия) И ВыборкаПоСтрокамДокумента.ОсновныеНачисления Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала события!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ПроверятьМестоРаботы И ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Подразделение
	Если ПроверятьМестоРаботы И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано подразделение организации!", Отказ, Заголовок);
		
	ИначеЕсли ПроверятьМестоРаботы И ВыборкаПоСтрокамДокумента.ОшибкаПодразделениеНеПринадлежитОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указано подразделение, принадлежащее другой организации!", Отказ, Заголовок);
		
	КонецЕсли;
	
	Если НЕ ВыборкаПоСтрокамДокумента.Сторно И ВыборкаПоСтрокамДокумента.ОсновныеНачисления И 
		(ВыборкаПоСтрокамДокумента.ПериодДействияНачало < ВыборкаПоШапкеДокумента.ДатаНачала 
		ИЛИ ВыборкаПоСтрокамДокумента.ПериодДействияНачало > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания) 
		ИЛИ ВыборкаПоСтрокамДокумента.ПериодДействияКонец < ВыборкаПоШапкеДокумента.ДатаНачала 
		ИЛИ ВыборкаПоСтрокамДокумента.ПериодДействияКонец > КонецДня(ВыборкаПоШапкеДокумента.ДатаОкончания)) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "период начисления выходит за временные границы оплачиваемого события!", Ложь, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиНачисления()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РасчетСреднего" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса к ТЧ документа, 
//	Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, ПроверятьМестоРаботы)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Расчет среднего"": ";
	
	// Вид расчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан вид расчета среднего заработка!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата начала базового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала базового периода!", Отказ, Заголовок);
		// Дата окончания базового периода
	ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.БазовыйПериодКонец) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания базового периода!", Отказ, Заголовок);
	ИначеЕсли ВыборкаПоСтрокамДокумента.БазовыйПериодКонец < ВыборкаПоСтрокамДокумента.БазовыйПериодНачало Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата начала базового периода не может быть больше даты окончания базового периода!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	Если ПроверятьМестоРаботы И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРасчетСреднего()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтраженияВУчете" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
Процедура ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоДоходам, Отказ, ПроверятьСочетание, Заголовок = "")
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоДоходам.НомерСтроки) + """ табл. части ""Проводки и данные для ЕСН"": ";
	
	// Дата начала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияНачало) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата начала периода начисления!", Отказ, Заголовок);
	Иначе
		// Дата окончания
		Если НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.ПериодДействияКонец) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата окончания периода начисления!", Отказ, Заголовок);
		Иначе
			Если ВыборкаПоДоходам.ПериодДействияКонец < ВыборкаПоДоходам.ПериодДействияНачало Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "дата окончания периода начисления не должна быть меньше даты начала!", Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.СчетДт) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет дебета!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыборкаПоДоходам.СчетКт) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "Не указан счет кредита!", Отказ, Заголовок);
		ПроверятьСочетание = Ложь;
	КонецЕсли;
	
	Сообщение = "";
	Если ПроверятьСочетание И ВыборкаПоДоходам.ОтражаетсяНУ И Не КорректноеСочетаниеСчетовНУ(ВыборкаПоДоходам.СчетДт,ВыборкаПоДоходам.НаименованиеСчетДт,ВыборкаПоДоходам.СчетКт,ВыборкаПоДоходам.СчетДтНУ, ВыборкаПоДоходам.СчетКтНУ, ВыборкаПоДоходам.ЭтоЕНВД, Сообщение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + Сообщение, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры:
//	Выборка				- спозиционированная на определеной строке выборка
//						  из результата запроса к ТЧ документа
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Движение = ПроведениеРасчетов.ДобавитьСтрокуОсновныхНачислений(Движения.ОсновныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента);
	
	//ЭтоПереходныйПериодПоЗакону255ФЗ = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия < мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ДатаОкончания >= мДатаЗакона255ФЗ И ВыборкаПоШапкеДокумента.ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве;
	//Движение.ВариантАлгоритмаРасчета = ПолучитьВариантАлгоритмаРасчета(ЭтоПереходныйПериодПоЗакону255ФЗ);
	//Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНарушенияРежима) И Движение.ПериодДействияНачало >= ВыборкаПоШапкеДокумента.ДатаНарушенияРежима Тогда
	//Если ЭтоПереходныйПериодПоЗакону255ФЗ Тогда
	//	Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйПереходногоПериодаСОграничениемВРазмереММОТ;
	//Иначе
	//	Движение.ВариантАлгоритмаРасчета = Перечисления.ВариантыАлгоритмовРасчета.БольничныйСОграничениемВРазмереММОТбезРК;
	//КонецЕсли;
	//КонецЕсли;
	//толик оплачено дней
	Движение.ОплаченоДней = ВыборкаПоСтрокамДокумента.ОплаченоДней;
	
КонецПроцедуры // ДобавитьСтрокуОсновныхНачислений()

// По строке выборок из результатов запроса по документу формируем движения по регистру
//
// Параметры:
//	ВыборкаПоСтрокамДокумента				- спозиционированная на определеной строке выборка 
//											  из результата запроса к ТЧ документа, 
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, НаборОсновныеНачисления)
	
	СуммаРесурсов = ВыборкаПоСтрокамДокумента.Результат + ВыборкаПоСтрокамДокумента.ОтработаноПоПятидневке +
	ВыборкаПоСтрокамДокумента.НормаПоПятидневке + ВыборкаПоСтрокамДокумента.ОтработаноДней + ВыборкаПоСтрокамДокумента.ОтработаноЧасов;
	
	Если СуммаРесурсов <> 0 Тогда
		
		Движение = НаборОсновныеНачисления.Добавить();
		
		СтрокаСвойствИзДокумента = "ПериодРегистрации,ФизЛицо,Организация,ДатаНачалаСобытия,СпособРасчета,"
		+ "ДатаНачалаРасчетногоПериода,ДатаОкончанияРасчетногоПериода,ПериодРасчетаСреднегоЗаработка";
		СтрокаСвойствИзСтрокиДокумента = "БазовыйПериодНачало,БазовыйПериодКонец,Сотрудник,ВидРасчета,Результат," 
		+ "ОтработаноПоПятидневке,НормаПоПятидневке,ОтработаноДней,ОтработаноЧасов,"
		+ "КоэффициентИндексации,ЧислоМесяцев,"
		+ "МесяцВыборки"; //СВЭЙ 02.02.2024 КВВ СВФР-012133
		
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуРасчетаСреднего()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента                  - выборка из результата запроса по шапке документа
//	СтруктураПроведенияПоРегистрамНакопления - структура, содержащая имена регистров 
//											   накопления по которым надо проводить документ
//	СтруктураПараметров						 - структура параметров проведения.
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ, УчетЗадолженностиПоМесяцам)
	
	Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) Тогда
		
		Движение = Движения.НДФЛСведенияОДоходах.Добавить();
		
		// Свойства
		Движение.Период					= ВыборкаПоТЧ.МесяцНалоговогоПериода;
		
		// Измерения
		Движение.Организация			= ВыборкаПоШапкеДокумента.Организация;
		Движение.ФизЛицо				= ВыборкаПоШапкеДокумента.ФизЛицо;
		Движение.КодДохода				= ВыборкаПоТЧ.КодДоходаНДФЛ;
		Движение.ПериодРегистрации		= ПериодРегистрации;
		
		// Ресурсы
		Движение.СуммаДохода			= ВыборкаПоТЧ.Результат; 
		//Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ.КодВычета) Тогда 
		//	Движение.КодВычета 	            = ВыборкаПоТЧ.КодДоходаНДФЛ.КодВычета;
		//	Движение.СуммаВычета			= ВыборкаПоТЧ.Результат;
		//КонецЕсли;
		Попытка
			Если ЗначениеЗаполнено(ВыборкаПоТЧ.КодДоходаНДФЛ) и (Число(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ))>501 и Число(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ))< 900) Тогда 
				Движение.КодВычета 	            = Справочники.ВычетыНДФЛ.НайтиПоКоду(СокрЛП(ВыборкаПоТЧ.КодДоходаНДФЛ));
				Движение.СуммаВычета			= ВыборкаПоТЧ.Результат;
			КонецЕсли;
		Исключение
		Конецпопытки;

		// Реквизиты
		Движение.ОбособленноеПодразделение  = ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
		Движение.ИсчисленоИзЗарплаты	= Истина;
		Движение.ПодразделениеОрганизации = ВыборкаПоТЧ.ПодразделениеОрганизации; 
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
	
	// Свойства
	Движение.Период					= КонецМесяца(ПериодРегистрации);
	Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
	
	// Измерения
	Движение.Организация			= ВыборкаПоШапкеДокумента.ОбособленноеПодразделение;
	Движение.ФизЛицо				= ВыборкаПоШапкеДокумента.ФизЛицо;
	Если УчетЗадолженностиПоМесяцам Тогда
		Движение.ПериодВзаиморасчетов	= ПериодРегистрации;
	КонецЕсли;
	
	// Ресурсы
	Движение.СуммаВзаиморасчетов	= ВыборкаПоТЧ.Результат;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления

// Добавляет движение в наборы записей БУОсновныеНачисления
//
Процедура ДобавитьСтрокуОтраженияВУчете(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	СтрокаСвойствИзДокумента = "ПериодРегистрации,Сотрудник,ФизЛицо,Организация,ОбособленноеПодразделение,"
	+ "ГрафикРаботы,ВидУчетаВремени,ВидРасчета";
	
	СтрокаСвойствИзСтрокиДокумента = "ПериодДействияНачало,ПериодДействияКонец,Результат," 
	+ "СчетДт,СчетКт,СчетДтНУ,СчетКтНУ,ОтражениеВУСН,"
	+ "СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоКт1,СубконтоКт2,СубконтоКт3,"
	+ "СубконтоДтНУ1,СубконтоДтНУ2,СубконтоДтНУ3,СубконтоКтНУ1,СубконтоКтНУ2,СубконтоКтНУ3,Сторно";
	
	Движение = Движения.БУОсновныеНачисления.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
	Движение.ДокументОснование = Ссылка;
	
	СтрокаСвойствИзСтрокиДокумента = "ПериодДействияНачало,ПериодДействияКонец,Результат," 
	+ "КодДоходаЕСН,ОблагаетсяЕНВД,Сторно";
	
	Движение = Движения.ЕСНОсновныеНачисления.Добавить();
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента,СтрокаСвойствИзДокумента);
	ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоСтрокамДокумента,СтрокаСвойствИзСтрокиДокумента);
	Движение.ДокументОснование = Ссылка;
	
КонецПроцедуры  // ДобавитьСтрокуОтраженияВУчете

//Аверсон ЕАЕ 30.06.2022 СВФР-009236
Функция ПолучитьПериодыБЛ() Экспорт
	НачБЛ = ДатаНачала;
	КонБЛ = ДатаОкончания;
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НачалоПериода");
	ТЗ.Колонки.Добавить("КонецПериода");
	ТЗ.Колонки.Добавить("КоличествоДней");
	ТЗ.Колонки.Добавить("Сумма");
	
	//Аверсон ЕАЕ 26.09.2024 СВФР-013786
	ТЗ.Колонки.Добавить("СрЗаработокРасчетный");
	//Аверсон СВФР-013786
	//проверяем на самый первый БЛ
	Если ЗначениеЗаполнено(ЭтотОбъект.ПервичныйБольничныйЛист) Тогда 
		НачБЛ = ЭтотОбъект.ПервичныйБольничныйЛист.ДатаНачала  
	КонецЕсли;
	ДНач = НачБЛ;
	Пока ДНач <= КонБЛ Цикл
		Н = Макс(НачалоМесяца(ДНач), ДНач);
		К = Мин(КонецМесяца(Н), КонБЛ);
		
		НовыйПериод = ТЗ.Добавить();
		
		//Аверсон ЕАЕ 26.09.2024 СВФР-013786
		НовыйПериод.СрЗаработокРасчетный = 0;
		//Аверсон СВФР-013786
		
		НовыйПериод.НачалоПериода = Н;
		НовыйПериод.КонецПериода = К;
		
		КоличествоДней = День(КонецМесяца(Н));
		НовыйПериод.КоличествоДней = КоличествоДней;
		
		Если ДНач >= Дата('20240701') и не ТипРасчета = Перечисления.ТипРасчетаБЛ.БПМ Тогда
			БюджетПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДобавитьМесяц(НачалоМесяца(НачБЛ),-1), //мзп на начало болезни -1
			Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
			НовыйПериод.Сумма = БюджетПрожиточногоМинимума;
			ДНач = КонецМесяца(ДНач) + 1;   
		Иначе   
			БюджетПрожиточногоМинимума = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(Н, 
			Новый Структура("ВидПараметра", Перечисления.ВидыПараметровДляРасчетаЗарплаты.БПМ)).Размер;
			НовыйПериод.Сумма = БюджетПрожиточногоМинимума;
			ДНач = КонецМесяца(ДНач) + 1;    		
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТЗ;
КонецФункции
//Аверсон СВФР-009236

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	ПерерассчитываемыйДокумент = Неопределено; 
	//ПСА 13.08.2024+++
	ДвоичныеДанныеСообщенияПортала = Неопределено;
	ДокВыгруженНаПортал = Ложь;
	ПодключениеКПорталуФСЗН_ID_Дока = 0;
	//+++ПСА 13.08.2024
	
	//Аверсон ЕАЕ 08.01.2025 СВФР-013953
	РаботаПриБЛПоУходу.Очистить();
	//Аверсон СВФР-013953
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.НачислениеПоБольничномуЛисту") Тогда
		
		// Скопируем параметры начисления
		СтрокаРеквизитов = "Организация,Сотрудник,ФизЛицо,ПервичныйБольничныйЛист,ДатаНарушенияРежима,"
		+ "ПричинаНетрудоспособности,ДатаОкончания,ПроцентОплаты,ОграничениеПособия";
		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,Основание,СтрокаРеквизитов);	
		
		// добавим другие реквизиты
		Если ПервичныйБольничныйЛист.Пустая() Тогда
			ПервичныйБольничныйЛист	= Основание;
		КонецЕсли;
		ДатаНачала = КонецДня(ДатаОкончания) + 1;
		ДатаОкончания = '00010101';
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Ложь); // данные по отразжению в учете уже не нужны
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	//Надо позвать проверку заполнения реквизитов шапки
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	
	ПроверятьМестоРаботы = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия >= мДатаЗакона180ФЗ;
	
	// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
	Если НЕ Отказ Тогда
		
		// Проверим непрерывность следования записей начислений
		ПроверитьНепрерывностьЗаписейНачислений(Отказ, Заголовок);
		
		// Получение учетной политики по персоналу организации
		УчетЗадолженностиПоМесяцам	= ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "УчетЗадолженностиПоМесяцам");
		
		Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
		
		// перепишем данные из таблицы начислений в набор записей
		ВыборкаПоНачислениям = СформироватьЗапросПоНачислениям(ВыборкаПоШапкеДокумента).Выбрать();
		Пока ВыборкаПоНачислениям.Следующий() Цикл 
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок, ПроверятьМестоРаботы);
			
			Если НЕ Отказ Тогда
				Если ВыборкаПоНачислениям.ОсновныеНачисления Тогда
					ДобавитьСтрокуОсновныхНачислений(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				Иначе
					ПроведениеРасчетов.ДобавитьСтрокуДополнительныхНачислений(Движения.ДополнительныеНачисленияРаботниковОрганизаций, ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям);
				КонецЕсли;	
				ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетЗадолженностиПоМесяцам);
			КонецЕсли;
		КонецЦикла;
		
		// получим реквизиты табличной части
		ВыборкаПоРасчетСреднего = СформироватьЗапросПоРасчетСреднего().Выбрать();
		Пока ВыборкаПоРасчетСреднего.Следующий() Цикл
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРасчетСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Отказ, Заголовок, ПроверятьМестоРаботы);
			
			Если НЕ Отказ Тогда
				ДобавитьСтрокуРасчетаСреднего(ВыборкаПоШапкеДокумента, ВыборкаПоРасчетСреднего, Движения.РасчетСреднегоЗаработка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПособиеОтражаетсяВРеглУчетеТекущимДокументом Тогда
			
			// определим налоговый режим
			БухгалтерскийИНалоговыйУчет.ОбновитьДанныеУчетнойПолитикиПоНалоговомуУчету(глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете"), КонецМесяца(ПериодРегистрации), Организация);
			УчетнаяПолитика = глЗначениеПеременной("УчетнаяПолитикаОтраженияЗарплатыВУчете")[КонецМесяца(ПериодРегистрации)][Организация];
			
			ВыборкаПоОтражениеВУчете = СформироватьЗапросПоОтражениеВУчете().Выбрать();
			Пока ВыборкаПоОтражениеВУчете.Следующий() Цикл
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиОтраженияВУчете(ВыборкаПоОтражениеВУчете, Отказ, Не УчетнаяПолитика.УСН, Заголовок);
				
				Если НЕ Отказ Тогда
					ДобавитьСтрокуОтраженияВУчете(ВыборкаПоШапкеДокумента, ВыборкаПоОтражениеВУчете);
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				
				ТаблицаДвижений = Движения.ЕСНОсновныеНачисления.Выгрузить();
				// Свернем таблицу, в ней могут быть дубли строк из-за доли больничного за счет работодателя
				ТаблицаДвижений.Свернуть("ВидРасчета,ВидУчетаВремени,ГрафикРаботы,Организация,ОбособленноеПодразделение,Сотрудник,ФизЛицо,КодДоходаЕСН,ОблагаетсяЕНВД,ПериодДействия,ПериодДействияНачало,ПериодДействияКонец,Сторно,ДокументОснование,ПериодРегистрации","Результат");
				Движения.ЕСНОсновныеНачисления.Загрузить(ТаблицаДвижений);
				
				ТаблицаДвижений.Свернуть("Организация,ФизЛицо,КодДоходаЕСН,ОблагаетсяЕНВД,ОбособленноеПодразделение,ПериодРегистрации","Результат");
				ТаблицаДвижений.Колонки.ПериодРегистрации.Имя = "Период";
				Движения.ЕСНСведенияОДоходах.Загрузить(ТаблицаДвижений);
				
				Если НачалоМесяца(ПериодРегистрации) >= НачалоМесяца(мДатаЗакона255ФЗ) Тогда
					
					ТаблицаДвижений = Движения.ЕСНОсновныеНачисления.Выгрузить();
					
					// временно добавим сторно-записи для формирования правильного ФПД записей по пособиям
					ТаблицаСторно = Движения.ЕСНОсновныеНачисления.ПолучитьДополнение();
					Для каждого СтрокаТаблицы Из ТаблицаСторно Цикл
						Движение = Движения.ЕСНОсновныеНачисления.Добавить();
						ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
						Движение.Сторно = Истина;
						Движение.ПериодДействияНачало = СтрокаТаблицы.ПериодДействияНачалоСторно;
						Движение.ПериодДействияКонец  = СтрокаТаблицы.ПериодДействияКонецСторно;
						Движение.ПериодРегистрации    = СтрокаТаблицы.ПериодРегистрацииСторно;
					КонецЦикла;
					Движения.ЕСНОсновныеНачисления.Записать();
					
					Выборка = СформироватьЗапросПоПособияСоциальномуСтрахованию().Выбрать();
					Пока Выборка.Следующий() Цикл 
						Движение = Движения.ПособияСоциальномуСтрахованию.Добавить();
						ЗаполнитьЗначенияСвойств(Движение,Выборка);
						Движение.ДатаСтраховогоСлучая = ВыборкаПоШапкеДокумента.ДатаНачалаСобытия;
					КонецЦикла;
					// избавимся от временных строк учета
					Движения.ЕСНОсновныеНачисления.Загрузить(ТаблицаДвижений);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			// выполним удаление перерасчетов исправленного документа
			Если ЗначениеЗаполнено(ПерерассчитываемыйДокумент) Тогда
				ПроведениеРасчетов.УдалитьСведенияОПерерасчетеДокумента(Ссылка, Истина); // Только по исправленным документам
			КонецЕсли;
			
			Для Каждого Набор Из Движения Цикл
				ТипНабораЗаписей = ТипЗнч(Набор);
				Если ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ОсновныеНачисленияРаботниковОрганизаций") 
					Или ТипНабораЗаписей = Тип("РегистрРасчетаНаборЗаписей.ДополнительныеНачисленияРаботниковОрганизаций") Тогда
					Набор.Записать();
				КонецЕсли;
			КонецЦикла;
			ПроведениеРасчетов.ОбработатьТаблицуПерерасчетов(Ссылка);
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.ОсновныеНачисленияРаботниковОрганизаций.мВыполнятьВспомогательныеРасчеты = Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//заявка №1640 (база заявок Кристалла) Дмитрук О.Г.
	Если Не ПроверкаСотрудника() Тогда
		Сообщить(СокрЛП(Сотрудник.Наименование) + " не принят на работу !");
		Возврат;
	КонецЕсли;
	//заявка №1640
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (ПолучитьДатуНачалаСобытия() < мДатаЗакона255ФЗ И ДатаОкончания >= мДатаЗакона255ФЗ И ПричинаНетрудоспособности <> Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве) Тогда
		ПроцентОплатыПереходногоПериода = 0;
		ПричинаНетрудоспособностиПереходногоПериода = "";
		СлучайУходаЗаБольнымРебенкомПереходногоПериода = "";
		ОграничениеПособияПереходногоПериода = "";
	КонецЕсли;
	
	ЗаполнитьМестоРаботы = Не ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), Организация, "ПоддержкаВнутреннегоСовместительства");
	Если ЗаполнитьМестоРаботы Тогда
		Для каждого СтрокаТЧ Из РасчетСреднего Цикл
			СтрокаТЧ.Сотрудник = Сотрудник
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток		 = 86400;		// в секундах
мДатаЗакона180ФЗ = '20060101';	// 1 января 2006 года
мДатаЗакона255ФЗ = ПроведениеРасчетов.ПолучитьДатуВступленияВСилуИзмененийПоСоциальнымПособиям2006();

