
// Функция формирует фамилию и инициалы либо по наименованию элемента спр-ка ФизическиеЛица
//  либо по переданным строкам.
//  Если передан Объект, то извлеченная из него строка считается совокупностью 
//  Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры
//  Объект		- строка или ссылка или объект элемента спр-ка ФизическиеЛица.
//  Фамилия		- фамилия физ. лица.
//  Имя			- имя физ. лица.
//  Отчество	- отчество физ. лица.
//
// Возвращаемое значение 
//  Фамилия и Инициалы одной строкой. Побочные эффекты - переданная целая строка 
//  Побочные эффекты - переданная целая строка разбивается на подстроки, соответствующие
//  отдельным Фамилии,Имени и Отчеству
//
Функция ФамилияИнициалыФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект)," ");
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") ИЛИ
		ТипОбъекта = Тип("СправочникСсылка.СотрудникиОрганизаций") или ТипОбъекта = Тип("СправочникОбъект.СотрудникиОрганизаций") Тогда
		ФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.Наименование)," ");
		
	Иначе
		
		// используем возможно переданные отдельные строки
		Возврат ?(НЕ ПустаяСтрока(Фамилия), 
		Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
		"")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия = ?(КоличествоПодстрок > 0,ФИО[0],"");
	Имя		= ?(КоличествоПодстрок > 1,ФИО[1],"");
	Отчество= ?(КоличествоПодстрок > 2,ФИО[2],"");
	Фамилия = ТРег(Фамилия);//О.Т. Аверсон 16.03.2016 № 974
	
	Возврат ?(НЕ ПустаяСтрока(Фамилия), 
	Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
	"");
	
КонецФункции
// Функция формирует инициалы и фамилию либо по наименованию элемента спр-ка ФизическиеЛица
//  либо по переданным строкам.
//  Если передан Объект, то извлеченная из него строка считается совокупностью 
//  Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры
//  Объект		- строка или ссылка или объект элемента спр-ка ФизическиеЛица.
//  Фамилия		- фамилия физ. лица.
//  Имя			- имя физ. лица.
//  Отчество	- отчество физ. лица.
//
// Возвращаемое значение 
//  Фамилия и Инициалы одной строкой. Побочные эффекты - переданная целая строка 
//  Побочные эффекты - переданная целая строка разбивается на подстроки, соответствующие
//  отдельным Фамилии,Имени и Отчеству
//
Функция ИнициалыФамилияФизЛица(Объект = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект)," ");
		
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") ИЛИ
		ТипОбъекта = Тип("СправочникСсылка.СотрудникиОрганизаций") или ТипОбъекта = Тип("СправочникОбъект.СотрудникиОрганизаций") Тогда
		ФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.Наименование)," ");
		
	Иначе
		
		// используем возможно переданные отдельные строки
		Возврат ?(НЕ ПустаяСтрока(Фамилия), 
		Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), ""),
		"")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия = ?(КоличествоПодстрок > 0,ФИО[0],"");
	Имя		= ?(КоличествоПодстрок > 1,ФИО[1],"");
	Отчество= ?(КоличествоПодстрок > 2,ФИО[2],"");
	Фамилия = ТРег(Фамилия);//О.Т. Аверсон 16.03.2016 № 974
	
	Возврат ?(НЕ ПустаяСтрока(Фамилия), 
	?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + ?(НЕ ПустаяСтрока(Отчество),Лев(Отчество,1)+".", ""), "") + Фамилия,
	"");
	
КонецФункции

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция ПросклонятьСтрРезультат(Компонента, Знач Фраза = "", Падеж = 1, Пол = Неопределено, Объект, Флаг) Экспорт
	
	Результат = "";
	
	#Если Клиент Тогда
		
		//11-04-2011 Дмитрук О.Г.
		Если Флаг = 1 Тогда
			ЭлементПеречисления = Перечисления.Падеж.Именительный;
			Если Падеж = 1 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Именительный;
			ИначеЕсли Падеж = 2 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Родительный;
			ИначеЕсли Падеж = 3 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Дательный;
			ИначеЕсли Падеж = 4 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Винительный;
			ИначеЕсли Падеж = 5 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Творительный;
			ИначеЕсли Падеж = 6 Тогда
				ЭлементПеречисления = Перечисления.Падеж.Предложный;
			КонецЕсли;
			
			ВыборкаПроверки = ПроцедурыУправленияПерсоналом.ПроверкаСклонения(Объект.Ссылка, ЭлементПеречисления).Выбрать();	
			
			Если ВыборкаПроверки.Следующий() Тогда
				Результат = ВыборкаПроверки.Значение;
				
			Иначе
				
				МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
				
				Для Каждого СтрокаМассива Из МассивСтрок Цикл
					Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ РегламентированнаяОтчетность.ФИОНаписаноВерно(СтрокаМассива) Тогда
						Результат = Результат + СтрокаМассива + " ";
						Продолжить;
					КонецЕсли;
					
					//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 2) (
					ЕстьЛатинскиеБуквы = ПроверкаНаЛатинскиеБуквы(СтрокаМассива);
					Если ЕстьЛатинскиеБуквы Тогда
						Результат = Результат + СокрЛП(СтрокаМассива) + " ";
					Иначе
						//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 2) )
						Попытка
							Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
							
						Исключение
							Результат = Фраза;
							Возврат Ложь;
							
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			//11-04-2011 Дмитрук О.Г.
			
		Иначе
			МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ РегламентированнаяОтчетность.ФИОНаписаноВерно(СтрокаМассива) Тогда
					Результат = Результат + СтрокаМассива + " ";
					Продолжить;
				КонецЕсли;
				
				Попытка
					Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
					
				Исключение
					Результат = Фраза;
					Возврат Ложь;
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Результат = СокрЛП(Результат);
		
		Возврат Результат;
		
	#Иначе
		
		Возврат Ложь;
		
	#КонецЕсли
	
КонецФункции // Просклонять()

//Функция проверяет, есть ли в регистре сведений "Склонение" 
//данный объект по данному падежу                                                          
Функция ПроверкаСклонения(Объект, Падеж) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Склонение.Объект,
	|	Склонение.Падеж,
	|	Склонение.Значение	
	|ИЗ
	|	РегистрСведений.Склонение КАК Склонение
	|ГДЕ
	|	Склонение.Объект = &Объект
	|	И Склонение.Падеж = &Падеж";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Падеж", Падеж);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

//// Определяет размер часовой тарифной ставки на основании месячного оклада и других необходимых параметров
//Функция ПолучитьЧасовуюТарифнуюСтавкуНаОсновеМесячнойСтавки(Оклад, ПродолжительностьРабочейНедели, ЧислоРабочихДнейВГоду, ЧислоПредпраздничныхДнейВГоду) Экспорт
//	
//	Если НЕ ЗначениеЗаполнено(ЧислоРабочихДнейВГоду) Тогда  // в календаре нет данных
//		Возврат 0
//	КонецЕсли;
//	
//	СреднемесячноеКоличествоЧасов =  (ПродолжительностьРабочейНедели/5 * (ЧислоРабочихДнейВГоду + ЧислоПредпраздничныхДнейВГоду) - ЧислоПредпраздничныхДнейВГоду)/12;
//	
//	// расчет часовой ставки
//	Возврат ?(СреднемесячноеКоличествоЧасов <= 0, 0, Оклад / СреднемесячноеКоличествоЧасов);
//	
//КонецФункции	

//// Определяет размер часовой тарифной ставки на основании дневной тарифной ставки
//Функция ПолучитьЧасовуюТарифнуюСтавкуНаОсновеДневнойСтавки(ДневнаяСтавка, ПродолжительностьРабочейНедели, ВидГрафика) Экспорт
//	
//	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка Тогда	
//		ПродолжительностьРабочегоДня = ПродолжительностьРабочейНедели / 6;
//	Иначе	
//		// для пятидневки и сменного графика
//		ПродолжительностьРабочегоДня = ПродолжительностьРабочейНедели / 5;
//	КонецЕсли;
//	
//	// расчет часовой ставки
//	Возврат ?(ПродолжительностьРабочегоДня = 0, 0, ДневнаяСтавка / ПродолжительностьРабочегоДня);
//	
//КонецФункции	

// Выполняет расчет часовой тарифной ставки работника
// Возвращает результат с учетом курса валюты тарифной ставки
//
Функция ЧасоваяТарифнаяСтавкаРаботникаОрг(Знач Сотрудник, Знач ДатаАктуальности, Знач ДатаВалютногоУчета, ВалютаРегламентированногоУчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник",			Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("ПериодРегистрации",	НачалоМесяца(ДатаАктуальности));
	Запрос.УстановитьПараметр("ДатаВалютногоУчета",	НачалоМесяца(ДатаВалютногоУчета));
	Запрос.УстановитьПараметр("РегламентВалюта",	ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("Год",				Год(ДатаАктуальности));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеРаботника.Организация.ИНН = ""600124787""
	|			ТОГДА &Тариф
	|		КОГДА ДанныеРаботника.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.СдельныйЗаработок))
	|			ТОГДА ДанныеРаботника.ОкладТариф
	|		КОГДА ДанныеРаботника.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням))
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ЕСТЬNULL(ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую, ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)) = ЗНАЧЕНИЕ(Перечисление.ПорядкиПересчетаМесячнойСтавкиВЧасовую.ПоСреднемуКоличествуЧасовВМесяце)
	|							ТОГДА ВЫБОР
	|									КОГДА ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) = 0
	|										ТОГДА 0
	|									КОГДА ДанныеРаботника.ДлительностьРабочейНедели = 0
	|										ТОГДА 0
	|									ИНАЧЕ ДанныеРаботника.ОкладТариф / (ДанныеРаботника.ДлительностьРабочейНедели / 5 * (ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоРабочихДней, 0) + ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) - ЕСТЬNULL(ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней, 0)) * 12
	|								КОНЕЦ
	|						КОГДА ВЫБОР
	|								КОГДА СводныеИндивидуальныеГрафики.Часов ЕСТЬ НЕ NULL 
	|									ТОГДА СводныеИндивидуальныеГрафики.Часов
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение), 0)
	|							КОНЕЦ = 0
	|							ТОГДА 0
	|						ИНАЧЕ ДанныеРаботника.ОкладТариф / ВЫБОР
	|								КОГДА СводныеИндивидуальныеГрафики.Часов ЕСТЬ НЕ NULL 
	|									ТОГДА СводныеИндивидуальныеГрафики.Часов
	|								КОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц ЕСТЬ НЕ NULL 
	|									ТОГДА НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц
	|								ИНАЧЕ ЕСТЬNULL(СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение), 0)
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, 3))
	|		КОГДА ДанныеРаботника.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
	|			ТОГДА ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ДанныеРаботника.ДлительностьРабочейНедели = 0
	|							ТОГДА 0
	|						ИНАЧЕ ДанныеРаботника.ОкладТариф / ДанныеРаботника.ДлительностьРабочейНедели * ВЫБОР
	|								КОГДА ДанныеРаботника.ВидГрафика = ЗНАЧЕНИЕ(Перечисление.ВидыРабочихГрафиков.Шестидневка)
	|									ТОГДА 6
	|								ИНАЧЕ 5
	|							КОНЕЦ
	|					КОНЕЦ КАК ЧИСЛО(15, 3))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Размер
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
	|		ВЫБОР
	|			КОГДА ОсновноеНачисление.ПериодЗавершения <= &ДатаАктуальности
	|					И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|							ТОГДА РазмерТарифныхСтавок.Размер
	|						ИНАЧЕ ОсновноеНачисление.Показатель1Завершения
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|						ТОГДА РазмерТарифныхСтавок.Размер
	|					ИНАЧЕ ОсновноеНачисление.Показатель1
	|				КОНЕЦ
	|		КОНЕЦ * ВЫБОР
	|			КОГДА ВЫБОР
	|					КОГДА ОсновноеНачисление.ПериодЗавершения <= &ДатаАктуальности
	|							И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ВЫБОР
	|								КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|									ТОГДА РазмерТарифныхСтавок.Валюта
	|								ИНАЧЕ ОсновноеНачисление.Валюта1Завершения
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|								ТОГДА РазмерТарифныхСтавок.Валюта
	|							ИНАЧЕ ОсновноеНачисление.Валюта1
	|						КОНЕЦ
	|				КОНЕЦ В (&РегламентВалюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(Валюты.Курс / Валюты.Кратность, 0)
	|		КОНЕЦ КАК ОкладТариф,
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|		КОНЕЦ КАК ГрафикРаботы,
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ДлительностьРабочейНедели
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ДлительностьРабочейНедели
	|		КОНЕЦ КАК ДлительностьРабочейНедели,
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения.ВидГрафика
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы.ВидГрафика
	|		КОНЕЦ КАК ВидГрафика,
	|		ВЫБОР
	|			КОГДА ОсновноеНачисление.ПериодЗавершения <= &ДатаАктуальности
	|					И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ОсновноеНачисление.ВидРасчетаЗавершения.СпособРасчета
	|			ИНАЧЕ ОсновноеНачисление.ВидРасчета.СпособРасчета
	|		КОНЕЦ КАК СпособРасчета,
	|		ОсновноеНачисление.Организация КАК Организация
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|					&ДатаАктуальности,
	|					Сотрудник = &Сотрудник
	|						И ВидРасчетаИзмерение.Код ЕСТЬ NULL ) КАК ОсновноеНачисление
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок.СрезПоследних(&ДатаВалютногоУчета, ) КАК РазмерТарифныхСтавок
	|				ПО (ВЫБОР
	|						КОГДА ОсновноеНачисление.ПериодЗавершения <= &ДатаАктуальности
	|								И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ОсновноеНачисление.ТарифныйРазряд1Завершения
	|						ИНАЧЕ ОсновноеНачисление.ТарифныйРазряд1
	|					КОНЕЦ = РазмерТарифныхСтавок.ТарифныйРазряд)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК Валюты
	|				ПО (Валюты.Валюта = ВЫБОР
	|						КОГДА ОсновноеНачисление.ПериодЗавершения <= &ДатаАктуальности
	|								И ОсновноеНачисление.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ВЫБОР
	|									КОГДА ОсновноеНачисление.ВидРасчетаЗавершения.ТребуетВводаТарифногоРазряда
	|										ТОГДА РазмерТарифныхСтавок.Валюта
	|									ИНАЧЕ ОсновноеНачисление.Валюта1Завершения
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ОсновноеНачисление.ВидРасчета.ТребуетВводаТарифногоРазряда
	|									ТОГДА РазмерТарифныхСтавок.Валюта
	|								ИНАЧЕ ОсновноеНачисление.Валюта1
	|							КОНЕЦ
	|					КОНЕЦ)
	|					И (Валюты.Период = &ДатаВалютногоУчета)
	|			ПО (ИСТИНА)) КАК ДанныеРаботника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВариантыВстроенныхАлгоритмовРасчетаЗарплаты КАК ВариантыВстроенныхАлгоритмовРасчетаЗарплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоРабочихДней,
	|			СУММА(ВЫБОР
	|					КОГДА РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ЧислоПредпраздничныхДней
	|		ИЗ
	|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ГДЕ
	|			РегламентированныйПроизводственныйКалендарь.Год = &Год) КАК ДанныеПроизводственногоКалендаря
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СводныеИндивидуальныеГрафики КАК СводныеИндивидуальныеГрафики
	|		ПО ДанныеРаботника.Сотрудник = СводныеИндивидуальныеГрафики.Сотрудник
	|			И (СводныеИндивидуальныеГрафики.Месяц = &ПериодРегистрации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовЗаМесяц
	|		ИЗ
	|			РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ГДЕ
	|			ГрафикиРаботыПоВидамВремени.ГрафикРаботы = &Сотрудник
	|			И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|			И ГрафикиРаботыПоВидамВремени.Месяц = &ПериодРегистрации
	|			И ГрафикиРаботыПоВидамВремени.План) КАК НормаВремениПоЕжедневнымИндивидуальнымГрафикам
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО ДанныеРаботника.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|			И (ГрафикиРаботыПоВидамВремени.Месяц = &ПериодРегистрации)
	|			И (ГрафикиРаботыПоВидамВремени.План)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРаботника.ОкладТариф,
	|	ДанныеРаботника.ГрафикРаботы,
	|	ДанныеРаботника.ДлительностьРабочейНедели,
	|	ДанныеРаботника.ВидГрафика,
	|	ДанныеРаботника.СпособРасчета,
	|	ВариантыВстроенныхАлгоритмовРасчетаЗарплаты.ПорядокПересчетаМесячнойСтавкиВЧасовую,
	|	ДанныеПроизводственногоКалендаря.ЧислоРабочихДней,
	|	ДанныеПроизводственногоКалендаря.ЧислоПредпраздничныхДней,
	|	НормаВремениПоЕжедневнымИндивидуальнымГрафикам.ЧасовЗаМесяц,
	|	СводныеИндивидуальныеГрафики.Часов,
	|	ДанныеРаботника.Организация.ИНН";
	//О.Т. Аверсон 11.01.2016 № Для пухович
	мСтрока = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(КонецМесяца(ДатаАктуальности),Новый Структура("Сотрудник", Сотрудник));
	
	ТарифнаяСтавка = РегистрыСведений.ТарифныеСтавкиРаботниковОрганизации.ПолучитьПоследнее(КонецМесяца(ДатаАктуальности),Новый Структура("Сотрудник",Сотрудник)).ТарифнаяСтавка; 
	Если ЗначениеЗаполнено(мСтрока.ГрафикРаботы) Тогда //О.Т. Аверсон 05.02.2018 № 1547
		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(КонецМесяца(ДатаАктуальности),
		Новый Структура("ВидПараметра,Категория,ГрафикРаботы", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка(),мСтрока.ГрафикРаботы)).Размер;
		Если ЧасовВГоду = 0 Тогда 
			ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(КонецМесяца(ДатаАктуальности),
			Новый Структура("ВидПараметра,Категория", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка())).Размер;
		КонецЕсли;
	иначе
		ЧасовВГоду = РегистрыСведений.РазмерыПараметровДляРасчетаОрганизаций.ПолучитьПоследнее(КонецМесяца(ДатаАктуальности),
		Новый Структура("ВидПараметра,Категория", Перечисления.ВидыПараметровДляРасчетаЗарплаты.СреднемесячнаяНормаЧасов, Справочники.КатегорииРаботников.ПустаяСсылка())).Размер;
	КонецЕсли;
	Если ЧасовВГоду > 0 Тогда
		Если ДатаАктуальности < Дата(2016,07,1) Тогда //О.Т. Аверсон 15.03.2016 № 949
			Ставка = Окр(ТарифнаяСтавка/ЧасовВГоду,2);
		иначе
			Ставка = ОбщегоНазначения.ОкруглитьЗначение2016(ТарифнаяСтавка/ЧасовВГоду,ДатаАктуальности);//О.Т. Аверсон 15.03.2016 № 949
		КонецЕсли;
		
	КонецЕсли;
	Запрос.УстановитьПараметр("Тариф",Ставка);
	//О.Т. Аверсон 11.01.2016 № Для пухович
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		//толик		Возврат ОбщегоНазначения.ОкруглитьПоВалюте(Выборка.Размер,Константы.ВалютаРегламентированногоУчета.Получить());
		Возврат Выборка.Размер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции // ЧасоваяТарифнаяСтавкаРаботникаОрг()


// Возвращает значение ставки НДФЛ с доходов нерезидентов 
Функция ЗначениеСтавкиНДФЛСНерезидента() Экспорт
	Возврат 15;
КонецФункции 

// Возвращает результат запроса стандартных вычетов НДФЛ
// Параметры
//  Параметры  – Структура – структура параметров
// Возвращаемое значение:
//   РезультатЗапроса   
//
Функция ПолучитьРезультатЗапросаСтандартныхВычетовНДФЛ(Параметры) Экспорт
	
	// Параметры функции
	ГодНП = Параметры.ГодНП;
	Организация = Параметры.Организация;
	ГоловнаяОрганизация = Параметры.ГоловнаяОрганизация;
	СведенияФормируютсяПоОрганизацииВЦелом = Параметры.СведенияФормируютсяПоОрганизацииВЦелом;
	СписокВсехПодразделенийОрганизации = Параметры.СписокВсехПодразделенийОрганизации;
	СписокФизлицТекст  = Параметры.СписокФизлицТекст;
	МассивКодовДоходовРаздела7 = Параметры.МассивКодовДоходовРаздела7;
	ВычетыПолучитьПоМесяцам = Параметры.ВычетыПолучитьПоМесяцам;
	
	// Параметр, специфический для Формы2НДФЛ
	ДатаПодачиСведений = Параметры.ДатаПодачиСведений;
	
	ДатаНачалаНП = НачалоГода(Дата(ГодНП,1,1));
	ДатаКонцаНП = КонецГода(Дата(ГодНП,1,1));
	
	// Создание запроса и установка всех необходимых параметров
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);// последний месяц налогового периода, за который подаём сведения
	Запрос.УстановитьПараметр("МассивКодовДоходовРаздела7", МассивКодовДоходовРаздела7);
	Запрос.УстановитьПараметр("ДатаПодачиСведений", ДатаПодачиСведений);// дата акуальности сведений о доходах и налогах
	//Запрос.УстановитьПараметр("СписокВсехПодразделенийОрганизации", СписокВсехПодразделенийОрганизации);
	// Параметры, требуемые для выполнения текста запроса списка физлиц
	Для Каждого Элемент ИЗ Параметры.ДополнительныеПараметрыЗапроса  Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ , Элемент.Значение);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ВнутреннееСовместительство" , Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	Запрос.УстановитьПараметр("Ставка13", Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13);
	Запрос.УстановитьПараметр("ПустойКодВычета" , Справочники.ВычетыНДФЛ.ПустаяСсылка());
	Запрос.УстановитьПараметр("РасчетыСБюджетомНачисление" , Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Начисление);
	Запрос.УстановитьПараметр("РасчетыСБюджетомУдержание" , Перечисления.НДФЛРасчетыСБюджетомВидСтроки.Удержание);
	
	// Сформируем текст запроса с датами месяцев налогового периода
	// первый месяц
	КонецМесяца = КонецМесяца(ДатаНачалаНП);
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	// прибавим остальные месяцы
	Для Сч = 2 По 12 Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
		ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	//-----------------------------------------------------------------------------
	// ГЕНЕРАЦИЯ ТЕКСТА ЗАПРОСА
	
	// ПрименениеВычетовВОрганизации
	//	Поля:
	//		Период - месяц налогового периода
	//		Физлицо
	//
	// Описание:
	//	Для каждого месяца налогового периода выбирает список физлиц, для которых применяются стандартные вычеты по 
	//	заданной организации. Учитываем тот факт, что применяемость всегда регистрируется на головную организацию.
	//
	
	ПрименениеВычетовВОрганизацииТекст = 
	"ВЫБРАТЬ
	|	НДФЛПрименениеВычетовСрезПоследних.Физлицо КАК Физлицо,
	|	НДФЛПрименениеВычетовСрезПоследних.Период КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(НДФЛПрименениеВычетов.Период) КАК ПериодСреза,
	|		НДФЛПрименениеВычетов.Физлицо КАК Физлицо,
	|		Периоды.Период КАК Период
	|	ИЗ
	|		("+СписокФизлицТекст+") КАК РаботникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	|			ПО НДФЛПрименениеВычетов.Период <= Периоды.Период И НДФЛПрименениеВычетов.Физлицо = РаботникиОрганизации.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НДФЛПрименениеВычетов.Физлицо,
	|		Периоды.Период) КАК НДФЛПрименениеВычетовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	|		ПО НДФЛПрименениеВычетов.Период = НДФЛПрименениеВычетовСрезПоследних.ПериодСреза И НДФЛПрименениеВычетов.Физлицо = НДФЛПрименениеВычетовСрезПоследних.Физлицо
	|
	|ГДЕ
	|	НДФЛПрименениеВычетов.Организация = &ГоловнаяОрганизация";
	
	
	// МесяцыПоследнегоДоходаИлиНалогаТекст
	//	Поля:
	//		Месяц - месяц налогового периода - число от 1 до 12
	//		Физлицо
	//
	// Описание:
	//	Для каждого физлица расчитывается последний месяц предоставления вычетов
	// 	как максимальное значение из двух следующих:
	//  1. Месяц самого позднего начисления
	//	2. Месяц самого позднего расчета налога   
	
	МесяцыПоследнегоДоходаИлиНалогаТекст = 
	"ВЫБРАТЬ
	|		ПоследниеМесяцы.Физлицо КАК Физлицо,
	|		МАКСИМУМ(ПоследниеМесяцы.Месяц) КАК Месяц
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо, 
	|			Месяц(НДФЛСведенияОДоходах.Период) КАК Месяц
	|       ИЗ
	|			РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	|		ГДЕ 
	|			НДФЛСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП И
	|			" + ?(ДатаПодачиСведений <> Неопределено, "НДФЛСведенияОДоходах.ПериодРегистрации <= &ДатаПодачиСведений И", "") + "
	|			НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = &Ставка13 И
	|			" + ?(СведенияФормируютсяПоОрганизацииВЦелом, "НДФЛСведенияОДоходах.Организация = &ГоловнаяОрганизация", "НДФЛСведенияОДоходах.ОбособленноеПодразделение = &Организация") + " И
	|			НДФЛСведенияОДоходах.ФизЛицо в (" + СписокФизлицТекст + ") И
	|			НЕ (НДФЛСведенияОДоходах.КодДохода В (&МассивКодовДоходовРаздела7))
	|
	|		ОБЪЕДИНИТЬ ВСЕ 
	|			
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|			НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо, 
	|			Месяц(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК Месяц
	|       ИЗ
	|			РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСбюджетом
	|		ГДЕ 
	|			НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП И
	|			" + ?(ДатаПодачиСведений <> Неопределено, "НДФЛРасчетыСБюджетом.Период <= &ДатаПодачиСведений И", "") + "
	|			НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = &Ставка13 И
	|			(НДФЛРасчетыСБюджетом.ВидСтроки = &РасчетыСБюджетомНачисление ИЛИ НДФЛРасчетыСБюджетом.ВидСтроки = &РасчетыСБюджетомУдержание) И 
	|			" + ?(СведенияФормируютсяПоОрганизацииВЦелом, "НДФЛРасчетыСБюджетом.Организация = &ГоловнаяОрганизация", "НДФЛРасчетыСБюджетом.ОбособленноеПодразделение = &Организация") + " И
	|			НДФЛРасчетыСБюджетом.ФизЛицо в (" + СписокФизлицТекст + ")
	|	    ) КАК ПоследниеМесяцы
	|	СГРУППИРОВАТЬ ПО
	|		ПоследниеМесяцы.Физлицо";
	
	
	// Если формируем сведения для структурного подразделения организации,
	// то надо быть внимательнее с периодами предоставления вычетов
	МесяцыРаботыВОбособленномПодразделенииТекст = "";
	Если (НЕ СведенияФормируютсяПоОрганизацииВЦелом) И (СписокВсехПодразделенийОрганизации.Количество() > 1) Тогда
		
		// Для структурного подразделения периоды(месяцы) предоставления стандартных вычетов
		//будем ограничивать месяцами работы в данном подразделении.
		// Т.Е вычеты в месяце предоставляем, если работник на конец месяца числится 
		//не по внутреннему совместительству в данном обособленном подразделении.
		
		//МесяцыРаботыВОбособленномПодразделении
		//	Поля:
		//		Период - месяц налогового периода
		//		Физлицо
		//
		// Описание:
		//	Для каждого физлица выбираются месяцы работы в организации
		
		МесяцыРаботыВОбособленномПодразделенииТекст = 
		"ВЫБРАТЬ 
		|	ПоследниеДвиженияПоМесяцам.ФизЛицо,
		|	ПоследниеДвиженияПоМесяцам.Период 
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизации.ФизЛицо,
		|		РегРаботникиОрганизации.Организация,
		|		РегРаботникиОрганизации.Приказ,
		|		Периоды.Период,
		|		МАКСИМУМ(РегРаботникиОрганизации.Период) КАК ДатаПоследнегоДвижения
		|		ИЗ
		|			("+СписокФизлицТекст+") КАК РаботникиОрганизации
		|				ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
		|				ПО (ИСТИНА)
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РегРаботникиОрганизации
		|				ПО Месяц(РегРаботникиОрганизации.Период) <= Месяц(Периоды.Период) И РаботникиОрганизации.Физлицо = РегРаботникиОрганизации.Физлицо И (РегРаботникиОрганизации.Приказ.ВидЗанятости <> &ВнутреннееСовместительство ИЛИ (РегРаботникиОрганизации.Приказ.ВидЗанятости) ЕСТЬ NULL ) И Организация = &ГоловнаяОрганизация
		|		СГРУППИРОВАТЬ ПО 
		|			РаботникиОрганизации.ФизЛицо,
		|			РегРаботникиОрганизации.Организация,
		|			РегРаботникиОрганизации.Приказ,
		|			Периоды.Период ) КАК ПоследниеДвиженияПоМесяцам
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|	ПО РаботникиОрганизации.Период = ПоследниеДвиженияПоМесяцам.ДатаПоследнегоДвижения И РаботникиОрганизации.ФизЛицо = ПоследниеДвиженияПоМесяцам.ФизЛицо И РаботникиОрганизации.Организация = ПоследниеДвиженияПоМесяцам.Организация И РаботникиОрганизации.Приказ = ПоследниеДвиженияПоМесяцам.Приказ
		|
		|ГДЕ 
		|	РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация";
		
		
	КонецЕсли; 
	
	// Ограничим периоды предоставления вычетов
	
	ПрименениеВычетовВОрганизацииТекст = 
	"ВЫБРАТЬ
	|	ПрименениеВычетовВОрганизации.Физлицо КАК Физлицо,
	|	ПрименениеВычетовВОрганизации.Период КАК Период
	|ИЗ
	|	(" + ПрименениеВычетовВОрганизацииТекст + ") КАК ПрименениеВычетовВОрганизации";
	
	Если МесяцыПоследнегоДоходаИлиНалогаТекст <> "" Тогда
		// Ограничиваем месяцы предоставления вычетов месяцем, максимальным из двух: 1. Месяц последнего начисленного дохода ; 2. Месяц последнего расчета налога
		ПрименениеВычетовВОрганизацииТекст = ПрименениеВычетовВОрганизацииТекст + "
		| 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + МесяцыПоследнегоДоходаИлиНалогаТекст + ") КАК МесяцыПоследнегоДоходаИлиНалога
		|	ПО (Месяц(ПрименениеВычетовВОрганизации.Период) <= МесяцыПоследнегоДоходаИлиНалога.Месяц) И ПрименениеВычетовВОрганизации.ФизЛицо = МесяцыПоследнегоДоходаИлиНалога.ФизЛицо 
		|";
	КонецЕсли; 
	
	Если МесяцыРаботыВОбособленномПодразделенииТекст <> "" Тогда
		// Ограничиваем месяцы предоставления вычетов периодами работы в организации
		ПрименениеВычетовВОрганизацииТекст = ПрименениеВычетовВОрганизацииТекст + " 
		| 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + МесяцыРаботыВОбособленномПодразделенииТекст + ") КАК МесяцыРаботыВОбособленномПодразделении
		|	ПО ПрименениеВычетовВОрганизации.Период = МесяцыРаботыВОбособленномПодразделении.Период И ПрименениеВычетовВОрганизации.ФизЛицо = МесяцыРаботыВОбособленномПодразделении.ФизЛицо 
		|";
	КонецЕсли; 
	
	
	// ПраваНаВычеты
	//	Поля:
	//		Физлицо
	//		Период
	//		КодВычета
	//		РазмерВычета
	//		ОграничениеПоДоходам
	//
	//	Описание:
	//	Выбирает по всем месяца налогового периода суммы стандартных вычетов, на которые имеет право физлицо
	//	Два подзапроса: вычет на себя и вычеты на детей
	
	
	// первый год
	НачалоГода = НачалоМесяца(ДатаКонцаНП);	
	ПериодыТекстПоГодам = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоГода,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	Для Сч = Месяц(НачалоГода(ДатаНачалаНП))+ 1 По Месяц(ДатаКонцаНП) Цикл
		НачалоГода = НачалоМесяца(НачалоГода - 1);
		ПериодыТекстПоГодам = ПериодыТекстПоГодам +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоГода,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	БазовыеВеличиныПоМесяцам = 
	"ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	БазоваяВеличинаРег.Размер    
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(БазоваяВеличинаРег.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекстПоГодам+") КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ КАК БазоваяВеличинарег
	|			ПО БазоваяВеличинарег.Период <= Периоды.Период И БазоваяВеличинаРег.ВидПараметра = &БазоваяВеличина
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыПараметровДляРасчетаРБ КАК БазоваяВеличинарег
	|		ПО БазоваяВеличинарег.Период = Периоды.Периодрегистра И БазоваяВеличинаРег.ВидПараметра = &БазоваяВеличина";
	
	Запрос.Текст = БазовыеВеличиныПоМесяцам;
	
	
	НДФЛРазмерВычетов =
	"ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	ВЫБОР КОГДА (НДФЛРазмерВычетов.КодВычета) ЕСТЬ NULL ТОГДА 0 ИНАЧЕ НДФЛРазмерВычетов.КодВычета КОНЕЦ КАК КодВычета,
	|	НДФЛРазмерВычетов.Размер * БазоваяВеличина.Размер КАК Размер,    
	|	НДФЛРазмерВычетов.ОграничениеПоДоходам КАК ОграничениеПоДоходам
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		НДФЛРазмерВычетов.КодВычета КАК КодВычета,
	|		МАКСИМУМ(НДФЛРазмерВычетов.Период) КАК ПериодРегистра
	|	ИЗ
	|		("+ПериодыТекстПоГодам+") КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов КАК НДФЛРазмерВычетов
	|			ПО Периоды.Период >= НДФЛРазмерВычетов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		НДФЛРазмерВычетов.КодВычета) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ("+БазовыеВеличиныПоМесяцам+") КАК БазоваяВеличина
	|		ПО БазоваяВеличина.Период = Периоды.Период 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов КАК НДФЛРазмерВычетов
	|		ПО НДФЛРазмерВычетов.Период = Периоды.ПериодРегистра И Периоды.КодВычета = НДФЛРазмерВычетов.КодВычета ";
	
	Запрос.Текст =  НДФЛРазмерВычетов;
	// ПраваНаВычеты
	//	Поля:
	//		Физлицо
	//		Период
	//		СтандартныеВычетыЛичные
	//		СтандартныеВычетыДетские
	//
	//	Описание:
	//	Выбирает по всем периодам года стандартные вычеты на которые имеет право физлицо
	
	ПраваНаВычетыТекст = 
	"ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо КАК Физлицо,
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Период КАК Период,
	|	НДФЛРазмерВычетовЛичный.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
	|	ВычетыФизлиц.КодВычетаЛичный.Код КАК КодВычета,
	|	ВЫБОР КОГДА (ПрименениеВычетов.Физлицо) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВЫБОР КОГДА (НДФЛРазмерВычетовЛичный.Размер) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НДФЛРазмерВычетовЛичный.Размер КОНЕЦ КОНЕЦ КАК размерВычета
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВычетыФизлиц.Период) КАК ПериодСреза,
	|		РаботникиОрганизации.ФизЛицо КАК Физлицо,
	|		Периоды.Период КАК Период
	|	ИЗ
	|		("+СписокФизлицТекст+") КАК РаботникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|			ПО ВычетыФизлиц.Период <= Периоды.Период И ВычетыФизлиц.Физлицо = РаботникиОрганизации.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизации.ФизЛицо,
	|		Периоды.Период) КАК НДФЛСтандартныеВычетыФизлицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|		ПО ВычетыФизлиц.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.ПериодСреза И ВычетыФизлиц.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + НДФЛРазмерВычетов + ") КАК НДФЛРазмерВычетовЛичный
	|		ПО НДФЛРазмерВычетовЛичный.КодВычета = ВычетыФизлиц.КодВычетаЛичный И НДФЛРазмерВычетовЛичный.Период = НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСрезПоследних.Период, Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ПрименениеВычетовВОрганизацииТекст + ") КАК ПрименениеВычетов
	|		ПО ПрименениеВычетов.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо И ПрименениеВычетов.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.Период
	|	
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо КАК Физлицо,
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Период КАК Период,
	|	НДФЛРазмерВычетовНаДетей.ОграничениеПоДоходам КАК ОграничениеПоДоходам,
	|	ВычетыФизлиц.КодВычетаНаДетей.Код КАК КодВычета,
	|	ВЫБОР КОГДА (ПрименениеВычетов.Физлицо) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВЫБОР КОГДА (НДФЛРазмерВычетовНаДетей.Размер) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НДФЛРазмерВычетовНаДетей.Размер КОНЕЦ * ВЫБОР КОГДА (ВычетыФизлиц.КоличествоДетей) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВычетыФизлиц.КоличествоДетей КОНЕЦ КОНЕЦ КАК размерВычета
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВычетыФизлиц.Период) КАК ПериодСреза,
	|		РаботникиОрганизации.ФизЛицо КАК Физлицо,
	|		Периоды.Период КАК Период
	|	ИЗ
	|		("+СписокФизлицТекст+") КАК РаботникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|			ПО ВычетыФизлиц.Период <= Периоды.Период И ВычетыФизлиц.Физлицо = РаботникиОрганизации.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизации.ФизЛицо,
	|		Периоды.Период) КАК НДФЛСтандартныеВычетыФизлицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|		ПО ВычетыФизлиц.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.ПериодСреза И ВычетыФизлиц.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + НДФЛРазмерВычетов + ") КАК НДФЛРазмерВычетовНаДетей
	|		ПО НДФЛРазмерВычетовНаДетей.КодВычета = ВычетыФизлиц.КодВычетаНаДетей И НДФЛРазмерВычетовНаДетей.Период = НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСрезПоследних.Период, Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ПрименениеВычетовВОрганизацииТекст + ") КАК ПрименениеВычетов
	|		ПО ПрименениеВычетов.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо И ПрименениеВычетов.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.Период
	|	
	|ОБЪЕДИНИТЬ ВСЕ 
	|ВЫБРАТЬ
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо КАК Физлицо,
	|	НДФЛСтандартныеВычетыФизлицСрезПоследних.Период КАК Период,
	|	НДФЛРазмерВычетовДополнительный1.ОграничениеПоДоходам  КАК ОграничениеПоДоходам,
	|	ВычетыФизлиц.КодВычетаДополнительный.Код КАК КодВычета,
	|	ВЫБОР КОГДА (ПрименениеВычетов.Физлицо) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ВЫБОР КОГДА (НДФЛРазмерВычетовДополнительный1.Размер) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НДФЛРазмерВычетовДополнительный1.Размер КОНЕЦ КОНЕЦ КАК РазмерВычета
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВычетыФизлиц.Период) КАК ПериодСреза,
	|		РаботникиОрганизации.ФизЛицо КАК Физлицо,
	|		Периоды.Период КАК Период
	|	ИЗ
	|		("+СписокФизлицТекст+") КАК РаботникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|			ПО ВычетыФизлиц.Период <= Периоды.Период И ВычетыФизлиц.Физлицо = РаботникиОрганизации.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизации.ФизЛицо,
	|		Периоды.Период) КАК НДФЛСтандартныеВычетыФизлицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК ВычетыФизлиц
	|		ПО ВычетыФизлиц.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.ПериодСреза И ВычетыФизлиц.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + НДФЛРазмерВычетов + ") КАК НДФЛРазмерВычетовДополнительный1
	|		ПО НДФЛРазмерВычетовДополнительный1.КодВычета = ВычетыФизлиц.КодВычетаДополнительный И НДФЛРазмерВычетовДополнительный1.Период = НАЧАЛОПЕРИОДА(НДФЛСтандартныеВычетыФизлицСрезПоследних.Период, Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ПрименениеВычетовВОрганизацииТекст + ") КАК ПрименениеВычетов
	|		ПО ПрименениеВычетов.Физлицо = НДФЛСтандартныеВычетыФизлицСрезПоследних.Физлицо И ПрименениеВычетов.Период = НДФЛСтандартныеВычетыФизлицСрезПоследних.Период
	|";
	
	
	Запрос.Текст =  ПраваНаВычетыТекст;
	
	
	// ЗаработанныеДоходыПоМесяцамДляОграниченияСтандартныхВычетовТекст
	
	ЗаработанныеДоходыПоМесяцамДляОграниченияСтандартныхВычетовТекст = 
	"ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НДФЛСведенияОДоходах.Период КАК Период,
	|	СУММА(НДФЛСведенияОДоходах.СуммаДохода - НДФЛСведенияОДоходах.СуммаВычета) КАК ОблагаемыйДоход
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах 
	|
	|ГДЕ 
	|	НДФЛСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП И
	|	" + ?(ДатаПодачиСведений <> Неопределено, "НДФЛСведенияОДоходах.ПериодРегистрации <= &ДатаПодачиСведений И", "") + "
	|	НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = &Ставка13 И
	|	НДФЛСведенияОДоходах.Организация = &ГоловнаяОрганизация И
	|	НДФЛСведенияОДоходах.ФизЛицо В (" + СписокФизлицТекст + ") И
	|	НЕ (НДФЛСведенияОДоходах.КодДохода В (&МассивКодовДоходовРаздела7))
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	НДФЛСведенияОДоходах.ФизЛицо,
	|	НДФЛСведенияОДоходах.Период";
	
	
	// ОблДоходыЗаГодНарастИтогомПоСтавке13 
	//	Поля:
	//		ФизЛицо
	//		Период
	//		ОблагаемыйДоходЗаГод
	//
	//	Описание:
	//	Выбирает по всем периодам с начала года сумму дохода нарастающим итогом за год для расчета ограничения по стандартным вычетам
	//  Надо учитывать доходы, заработанные во всех структурных подразделениях организации
	
	//
	ОблДоходыЗаГодНарастИтогомПоСтавке13 = 
	"ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	НДФЛОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(НДФЛОбороты.ОблагаемыйДоход) КАК ОблагаемыйДоходЗаГод
	|ИЗ
	|	("+ПериодыТекст+") КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ("+ЗаработанныеДоходыПоМесяцамДляОграниченияСтандартныхВычетовТекст+") КАК НДФЛОбороты
	|		ПО Периоды.Период >= НДФЛОбороты.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Период,
	|	НДФЛОбороты.ФизЛицо";
	
	
	// ДоходыПредыдущегоМестаРаботыТекст
	//	Поля:
	//		Физлицо
	//		Период
	//		РазмерДоходаСНачалаГода
	//
	//	Описание:
	//	 Выбирает для всех физлиц суммы совокупного дохода с предыдущего места работы в разрезе месяцев налогового периода,
	//   зарегистрированные на любое структурное подразделение организации
	
	ДоходыПредыдущегоМестаРаботыЗаГодТекст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизации.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период КАК Период,
	|	НДФЛДоходыПредыдущегоМестаРаботы.Размер КАК РазмерДоходаЗаГод
	|ИЗ
	|		("+СписокФизлицТекст+") КАК РаботникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ("+ПериодыТекст+") КАК Периоды
	|			ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛДоходыПредыдущегоМестаРаботы КАК НДФЛДоходыПредыдущегоМестаРаботы
	|		ПО НДФЛДоходыПредыдущегоМестаРаботы.Организация = &ГоловнаяОрганизация И НДФЛДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода = НАЧАЛОПЕРИОДА(Периоды.Период,Месяц) И НДФЛДоходыПредыдущегоМестаРаботы.ФизЛицо = РаботникиОрганизации.Физлицо
	|";
	
	
	// ПрименяемыеСтандартныеВычетыЗаГодТекст
	// 	Основной запрос
	Если ВычетыПолучитьПоМесяцам Тогда
		
		ПрименяемыеСтандартныеВычетыЗаГодТекст = 
		"ВЫБРАТЬ
		|	РаботникиПраваНаВычеты.Физлицо КАК Физлицо,
		|	Месяц(РаботникиПраваНаВычеты.Период) КАК Месяц,
		|	РаботникиПраваНаВычеты.КодВычета КАК КодВычета,
		|	СУММА( ВЫБОР КОГДА РаботникиПраваНаВычеты.РазмерВычета ЕСТЬ NULL  
		|			ТОГДА 0 
		|			ИНАЧЕ РаботникиПраваНаВычеты.РазмерВычета КОНЕЦ ) КАК СуммаВычета
		//		|	СУММА( ВЫБОР КОГДА РаботникиПраваНаВычеты.ОграничениеПоДоходам = 0 ИЛИ ВЫБОР КОГДА (ДоходыЗаГод.ОблагаемыйДоходЗаГод) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ДоходыЗаГод.ОблагаемыйДоходЗаГод КОНЕЦ + ВЫБОР КОГДА (НДФЛДоходыПредыдущегоМестаРаботы.РазмерДоходаЗаГод) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НДФЛДоходыПредыдущегоМестаРаботы.РазмерДоходаЗаГод КОНЕЦ <= РаботникиПраваНаВычеты.ОграничениеПоДоходам ТОГДА РаботникиПраваНаВычеты.РазмерВычета ИНАЧЕ 0 КОНЕЦ ) КАК СуммаВычета
		|ИЗ
		|	("+ПраваНаВычетыТекст+") КАК РаботникиПраваНаВычеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ОблДоходыЗаГодНарастИтогомПоСтавке13+") КАК ДоходыЗаГод
		|		ПО ДоходыЗаГод.Период = РаботникиПраваНаВычеты.Период И ДоходыЗаГод.ФизЛицо = РаботникиПраваНаВычеты.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ДоходыПредыдущегоМестаРаботыЗаГодТекст + ") КАК НДФЛДоходыПредыдущегоМестаРаботы
		|		ПО НДФЛДоходыПредыдущегоМестаРаботы.Период = РаботникиПраваНаВычеты.Период И НДФЛДоходыПредыдущегоМестаРаботы.ФизЛицо = РаботникиПраваНаВычеты.Физлицо
		|
		|СГРУППИРОВАТЬ ПО
		|	Месяц(РаботникиПраваНаВычеты.Период),
		|	РаботникиПраваНаВычеты.Физлицо,
		|	РаботникиПраваНаВычеты.КодВычета
		|ИТОГИ ПО ФизЛицо, КодВычета";
		
	Иначе 	// свернутые данные за год
		
		ПрименяемыеСтандартныеВычетыЗаГодТекст = 
		"ВЫБРАТЬ
		|	РаботникиПраваНаВычеты.Физлицо КАК Физлицо,
		|	РаботникиПраваНаВычеты.КодВычета КАК КодВычета,
		|	СУММА( ВЫБОР КОГДА РаботникиПраваНаВычеты.РазмерВычета ЕСТЬ NULL  
		|			ТОГДА 0 
		|			ИНАЧЕ РаботникиПраваНаВычеты.РазмерВычета КОНЕЦ ) КАК СуммаВычета
		//		|	СУММА( ВЫБОР КОГДА РаботникиПраваНаВычеты.ОграничениеПоДоходам = 0 ИЛИ ВЫБОР КОГДА (ДоходыЗаГод.ОблагаемыйДоходЗаГод) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ ДоходыЗаГод.ОблагаемыйДоходЗаГод КОНЕЦ + ВЫБОР КОГДА (НДФЛДоходыПредыдущегоМестаРаботы.РазмерДоходаЗаГод) ЕСТЬ NULL  ТОГДА 0 ИНАЧЕ НДФЛДоходыПредыдущегоМестаРаботы.РазмерДоходаЗаГод КОНЕЦ <= РаботникиПраваНаВычеты.ОграничениеПоДоходам ТОГДА РаботникиПраваНаВычеты.РазмерВычета ИНАЧЕ 0 КОНЕЦ ) КАК СуммаВычета
		|ИЗ
		|	("+ПраваНаВычетыТекст+") КАК РаботникиПраваНаВычеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ("+ОблДоходыЗаГодНарастИтогомПоСтавке13+") КАК ДоходыЗаГод
		|		ПО ДоходыЗаГод.Период = РаботникиПраваНаВычеты.Период И ДоходыЗаГод.ФизЛицо = РаботникиПраваНаВычеты.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (" + ДоходыПредыдущегоМестаРаботыЗаГодТекст + ") КАК НДФЛДоходыПредыдущегоМестаРаботы
		|		ПО НДФЛДоходыПредыдущегоМестаРаботы.Период = РаботникиПраваНаВычеты.Период И НДФЛДоходыПредыдущегоМестаРаботы.ФизЛицо = РаботникиПраваНаВычеты.Физлицо
		|
		|СГРУППИРОВАТЬ ПО
		|	РаботникиПраваНаВычеты.Физлицо,
		|	РаботникиПраваНаВычеты.КодВычета";
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("БазоваяВеличина",                   Перечисления.ВидыПараметровДляРасчетаЗарплаты.БазоваяВеличина);
	Запрос.Текст = ПрименяемыеСтандартныеВычетыЗаГодТекст;
	Возврат Запрос.Выполнить();
	
КонецФункции  

// Возвращает результат запроса вычетов НДФЛ имущественный и социальный
// Параметры
//  Параметры  – Структура – структура параметров
// Возвращаемое значение:
//   РезультатЗапроса   
//
Функция ПолучитьРезультатЗапросаИмущественнымВычетамНДФЛ(Параметры) Экспорт
	
	СписокФизлицТекст  = Параметры.СписокФизлицТекст;
	
	// Периоды
	// Таблица список периодов-физлиц по которым необходимо выполнить расчет налога
	// Поля:
	//		Период
	//		Физлицо
	
	ПериодыТекст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	|	НДФЛСведенияОДоходах.ФизЛицо КАК Физлицо
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (" + СписокФизЛицТекст + ") КАК Работники
	|		ПО Работники.Физлицо = НДФЛСведенияОДоходах.ФизЛицо
	|
	|ГДЕ
	|	НДФЛСведенияОДоходах.ПериодРегистрации >= &парамНачалоГода И
	|	НДФЛСведенияОДоходах.ПериодРегистрации <= &парамПериодРегистрации И
	|	НДФЛСведенияОДоходах.Организация = &парамОрганизация И
	|	НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = &парамСтавка13";
	
	// Приходы вычетов помесячные  
	Вычеты312ПоМесяцамТекст = 
	"ВЫБРАТЬ
	|	Остатки.ФизЛицо КАК ФизЛицо,
	|	Остатки.Период КАК Период,
	|	Остатки.РазмерНачальныйОстаток КАК Вычет312Остаток,
	|	0 КАК ПримененныеВычеты312
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц.ОстаткиИОбороты(&парамНачалоГода, &парамКонецГода, Год, , КодВычетаИмущественный = &КодВычета312 И Физлицо В (" + СписокФизлицТекст + ")) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Обороты.ФизЛицо,
	|	Обороты.Период,
	|	Обороты.РазмерПриход,
	|	Обороты.РазмерРасход
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц.ОстаткиИОбороты(&парамНачалоГода, &парамКонецГода, Месяц, , КодВычетаИмущественный = &КодВычета312 И Физлицо В (" + СписокФизлицТекст + ")) КАК Обороты";
	
	Вычеты311ПоМесяцамТекст = 
	"ВЫБРАТЬ
	|	Остатки.ФизЛицо КАК ФизЛицо,
	|	Остатки.Период КАК Период,
	|	Остатки.РазмерНачальныйОстаток КАК Вычет311Остаток,
	|	0 КАК ПримененныеВычеты311
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц.ОстаткиИОбороты(&парамНачалоГода, &парамКонецГода, Год, , КодВычетаИмущественный = &КодВычета311 И Физлицо В (" + СписокФизлицТекст + ")) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Обороты.ФизЛицо,
	|	Обороты.Период,
	|	Обороты.РазмерПриход,
	|	Обороты.РазмерРасход
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц.ОстаткиИОбороты(&парамНачалоГода, &парамКонецГода, Месяц, , КодВычетаИмущественный = &КодВычета311 И Физлицо В (" + СписокФизлицТекст + ")) КАК Обороты";
	
	
	// Приходы вычетов с начала года нарастающим итогом
	Вычеты312Текст = 
	"ВЫБРАТЬ
	|	Периоды.Физлицо КАК Физлицо,
	|	Периоды.Период КАК Период,
	|	СУММА(Обороты.Вычет312Остаток) КАК Вычет312Остаток,
	|	СУММА(Обороты.ПримененныеВычеты312) КАК Вычет312ЗаГод
	|ИЗ
	|	(" + ПериодыТекст + ") КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + Вычеты312ПоМесяцамТекст + ") КАК Обороты
	|		ПО Обороты.ФизЛицо = Периоды.Физлицо И Обороты.Период <= Периоды.Период И Обороты.Период >= НАЧАЛОПЕРИОДА(Периоды.Период, Год) 
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Физлицо,
	|	Периоды.Период";
	
	Вычеты311Текст = 
	"ВЫБРАТЬ
	|	Периоды.Физлицо КАК Физлицо,
	|	Периоды.Период КАК Период,
	|	СУММА(Обороты.Вычет311Остаток) КАК Вычет311Остаток,
	|	СУММА(Обороты.ПримененныеВычеты311) КАК Вычет311ЗаГод
	|ИЗ
	|	(" + ПериодыТекст + ") КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (" + Вычеты311ПоМесяцамТекст + ") КАК Обороты
	|		ПО Обороты.ФизЛицо = Периоды.Физлицо И Обороты.Период <= Периоды.Период И Обороты.Период >= НАЧАЛОПЕРИОДА(Периоды.Период, Год) 
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Физлицо,
	|	Периоды.Период";
	
КонецФункции

// Определяет значение ставки налога для СтавкиНалоообложенияРезидента
// Параметры:
//  СтавкаНалогообложенияРезидента - ссылка на перечисление "НДФЛСтавкиНалогообложенияРезидента"
// Возвращаемое значение:
//  число - ставка налога в процентах
Функция ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(СтавкаНалогообложенияРезидента) Экспорт
	Если 	СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13 Тогда
		Возврат 13; //прогрессивная шкала
	ИначеЕсли СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка09 Тогда
		Возврат 15;
	ИначеЕсли СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка9 Тогда
		Возврат 9;
	ИначеЕсли СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка35 Тогда
		Возврат 13; //О.Т. Аверсон 11.05.2016 № 1161
	ИначеЕсли СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка40 Тогда
		Возврат 40;
	КонецЕсли;
	Возврат 0;
КонецФункции

// Выделяет из кода элемента адресного классификатора код региона (24 и 25 цифры кода)
//
// Параметры
//  КодАдресногоЭлемента  – Строка – код элемента  адресного классификатора
//
// Возвращаемое значение:
//   Строка   – код региона РФ
//
Функция ПолучитьКодРегионаРФИзКодаАдресногоЭлемента(КодАдресногоЭлемента) Экспорт
	
	СтрКодАдрЭлемента = Формат(КодАдресногоЭлемента, "ЧГ=0");
	Если СтрКодАдрЭлемента = "" Тогда
		Возврат "";
	КонецЕсли; 
	КодРегиона = Лев(СтрКодАдрЭлемента, СтрДлина(СтрКодАдрЭлемента) - 23);
	// Код региона должен состоять из 2 цифр. Например: 03, 77
	Возврат  Прав("00" + КодРегиона,2);
	
КонецФункции 

// Проверяет, заполнен ли регламентированный производственный календарь за переданный период 
//
// Параметры
//  ДатаНач, ДатаКон - дата, определяют проверяемый период
//  ВыводитьСообщения - булево - признак вывода сообщений в окно сообщений, по умолчанию - ложь
//
// Возвращаемое значение:
//   Булево  - если колендарь заполнен за весь период
//
Функция РегламентированныйКалендарьЗаполнен(ДатаНач, ДатаКон, ВыводитьСообщения = Ложь) Экспорт 
	
	ТекстЛет = "ВЫБРАТЬ " + Символы.ПС + Символы.Таб + Формат(ДатаНач,"ДФ=yyyy; ДП='0'") + " КАК Год";
	ТекущийГод = Год(ДатаНач) + 1;
	Пока ТекущийГод <= Год(ДатаКон) Цикл
		ТекстЛет = ТекстЛет + Символы.ПС + Символы.Таб + "Объединить" + Символы.ПС + "ВЫБРАТЬ " + Символы.ПС + Символы.Таб + Формат(ТекущийГод,"ЧГ=0");
		ТекущийГод = ТекущийГод + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ГодыПериода.Год,
	|	ДатыКалендаря.КоличествоДней
	|ИЗ
	|	(" + ТекстЛет + ") КАК ГодыПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КоличествоДней,
	|			РегламентированныйПроизводственныйКалендарь.Год КАК Год
	|		ИЗ
	|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		
	|		ГДЕ
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаС И &ДатаПо
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РегламентированныйПроизводственныйКалендарь.Год) КАК ДатыКалендаря
	|		ПО ГодыПериода.Год = ДатыКалендаря.Год";
	
	Запрос.Текст = ТекстЗапроса;					   
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ДатаС", ДатаНач);
	Выборка = Запрос.Выполнить().Выбрать();
	КалендарьЗаполнен = Истина;
	Сообщение = "Перед формированием отчета заполните ""Регламентированный производственный календарь"" за ";
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоДней = Null Тогда
			Сообщение = Сообщение + ?(КалендарьЗаполнен,"",", ") + Формат(Выборка.Год,"ЧГ=0");
			КалендарьЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если Не КалендарьЗаполнен и ВыводитьСообщения Тогда
		Сообщение = Сообщение + ?(Найти(Сообщение,",")=0," год!"," годы!");
		Сообщить(Сообщение + "
		|Интерфейсы: ""Полный"", ""Расчет зарплаты организаций"", ""Кадровый учет организаций"", пункт меню Предприятие - Производственный календарь.");
	КонецЕсли;
	
	Возврат КалендарьЗаполнен
	
КонецФункции // РегламентированныйКалендарьЗаполнен()

// Удаляет из строки фрагмент заключенный в скобки
//
// Параметры
//  СтрокаДляОбработки  – Строка – строка из которой необходимо удалить фрагмент
//
// Возвращаемое значение:
//   Строка   – строка без фрагмента заключенного в скобки.
//
Функция УдалениеСимволовСкобок(СтрокаДляОбработки)Экспорт 
	
	НачальнаяПозиция	= Найти(СтрокаДляОбработки,"(");
	КонечнаяПозиция		= Найти(СтрокаДляОбработки,")");
	ДлинаСтроки			= СтрДлина(СтрокаДляОбработки);
	
	Если НачальнаяПозиция > 0 Тогда
		Возврат Лев(СтрокаДляОбработки, НачальнаяПозиция - 1) + ?(КонечнаяПозиция > 0,Прав(СтрокаДляОбработки, ДлинаСтроки - КонечнаяПозиция),"")
	Иначе
		Возврат СтрокаДляОбработки
	КонецЕсли; 
	
КонецФункции // ()

// Заполняет реквизит "КраткийСоставДокумента" документа по его табличным частям.
//
// Параметры
//  ТЧДокумента					– табличная часть документа по которой происходит заполнение реквизита
//  ДополнительнаяТЧДокумента	- табличная часть документа, как правило это ТЧ с дополнительными начислениями
//
// Возвращаемое значение:
//   строка, значение реквизита "КраткийСоставДокумента".
//
Функция ЗаполнитьКраткийСоставДокумента(ТЧДокумента, ДополнительнаяТЧДокумента = Неопределено, ИмяРеквизита = "Сотрудник") Экспорт
	
	КраткийСоставДокумента = "";
	
	Для каждого СтрокаТЧ Из ТЧДокумента Цикл
		
		ФИОФизЛица = ФамилияИнициалыФизЛица(УдалениеСимволовСкобок(СтрокаТЧ[ИмяРеквизита].Наименование));
		Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
			
			Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
				КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
			Иначе
				КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
				Прервать;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ДополнительнаяТЧДокумента <> Неопределено И СтрДлина(КраткийСоставДокумента) < 100 Тогда
		
		Для каждого СтрокаТЧ Из ДополнительнаяТЧДокумента Цикл
			
			ФИОФизЛица = ФамилияИнициалыФизЛица(УдалениеСимволовСкобок(СтрокаТЧ[ИмяРеквизита].Наименование));
			Если Найти(КраткийСоставДокумента, ФИОФизЛица) = 0 Тогда
				
				Если СтрДлина(КраткийСоставДокумента) < 100 Тогда
					КраткийСоставДокумента = КраткийСоставДокумента + ", " + ФИОФизЛица;
				Иначе
					Если Лев(КраткийСоставДокумента,2) = ", " Тогда
						КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
					Иначе
						КраткийСоставДокумента = Лев(КраткийСоставДокумента,97) + "...";
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Лев(КраткийСоставДокумента,2) = ", " Тогда
		ДлинаСтроки = СтрДлина(КраткийСоставДокумента);
		Если ДлинаСтроки < 100 Тогда
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3)
		Иначе
			КраткийСоставДокумента = Сред(КраткийСоставДокумента,3,95) + "...";
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат КраткийСоставДокумента;
	
КонецФункции // ЗаполнитьКраткийСоставДокумента()

Функция ЗаполнитьКраткийСоставДокументаДопКолонокПоОдномуВДоке(ТЧДокумента,ИмяРеквизита) Экспорт
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 (
	КраткийСоставДокумента = "";
	Если ТЧДокумента.Количество() = 1 Тогда
		Если ТипЗнч(ТЧДокумента[0][ИмяРеквизита]) = Тип("Дата") Тогда
			КраткийСоставДокумента = Формат(ТЧДокумента[0][ИмяРеквизита],"ДЛФ=Д");	
		ИначеЕсли ТипЗнч(ТЧДокумента[0][ИмяРеквизита]) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
			КраткийСоставДокумента = ФамилияИнициалыФизЛица(УдалениеСимволовСкобок(ТЧДокумента[0][ИмяРеквизита].Наименование));
			//ИначеЕсли ТипЗнч(ТЧДокумента[0][ИмяРеквизита]) = Тип("Число") Тогда
			//	КраткийСоставДокумента = Формат(ТЧДокумента[0][ИмяРеквизита],"ЧДЦ=2");
		Иначе
			КраткийСоставДокумента = СокрЛП(ТЧДокумента[0][ИмяРеквизита]);
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(КраткийСоставДокумента);
		Если ДлинаСтроки > 100 Тогда
			КраткийСоставДокумента = Лев(КраткийСоставДокумента,95) + "...";
		КонецЕсли;
	КонецЕсли;	
	Возврат КраткийСоставДокумента;
	//СВЭЙ 22.05.2024 КВВ СВФР-012926 )
КонецФункции

// Функция склоняет переданую фразу
// Параметры:
//  Фраза (обязательный), тип строка
//   Параметр должен содержать фразу. Каждое слово фразы будет просклонено отдельно
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
Функция Просклонять(Компонента, Знач Фраза = "", Падеж = 1, Пол = Неопределено ) Экспорт
	
	Результат = "";
	
	#Если Клиент Тогда
		
		МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Фраза, " ");
		
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			Если ПустаяСтрока(СтрокаМассива) ИЛИ НЕ РегламентированнаяОтчетность.ФИОНаписаноВерно(СтрокаМассива) Тогда
				Результат = Результат + СтрокаМассива + " ";
				Продолжить;
			КонецЕсли;
			
			Попытка
				Результат = Результат + Компонента.Просклонять(СтрокаМассива, Падеж) + " ";
				
			Исключение
				Результат = Фраза;
				Возврат Ложь;
				
			КонецПопытки;
			
		КонецЦикла;
		
		Результат = СокрЛП(Результат);
		
		Возврат Истина;
		
	#Иначе
		
		Возврат Ложь;
		
	#КонецЕсли
	
КонецФункции // Просклонять()

// Функция склоняет ФИО
// Параметры:
//  ФИО (обязательный), тип строка
//   Параметр должен содержать фамилию, имя и отчество в именительном падеже единственного числа.
//   Строка должна состоять только из букв русского алфавита, пробелов и дефисов. Фамилия, имя и отчество
//   должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.
//   Допустимы следующие сочетания фамилии, имени и отчества: ФИО, ИОФ, ИО, ИФ, ФИ, Ф, И, О.
//   Двойные и тройные имена и фамилии должны писаться через дефис. Имена и отчества должны быть полные
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей, например, имя Карен Акопян
//   может принадлежать и мужчине, и женщине, и в зависимости от этого склоняться или не склоняться.
//   В остальных случаях рекомендуется опускать этот параметр.
//
Функция ПросклонятьФИО(Компонента, Знач ФИО = "", Падеж = 1, Пол = 0, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	Результат = ФИО;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО не должна быть пустой.";
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РегламентированнаяОтчетность.ФИОНаписаноВерно(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО должна состоять только из букв русского алфавита, пробелов и дефисов.";
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = "Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени и отчества пробелов быть не должно.";
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
		
		Попытка
			Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
				Результат = Компонента.Просклонять(ФИО, Падеж, 1);
				
			ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Результат = Компонента.Просклонять(ФИО, Падеж, 2);
				
			Иначе
				Результат = Компонента.Просклонять(ФИО, Падеж);
				
			КонецЕсли;
			
		Исключение
			Возврат Ложь;
			
		КонецПопытки;
		
		Возврат Истина;
		
	#Иначе
		
		Возврат Ложь;
		
	#КонецЕсли
	
КонецФункции // ПросклонятьФИО()

// Функция склоняет Фамилию, Имя и Отчество
// Параметры:
//  Фамилия, Имя, Отчество (обязательный), тип строка
//   Параметры должены содержать фамилию, имя и отчество в именительном падеже единственного числа.
//   Строка должна состоять только из букв русского алфавита, пробелов и дефисов. 
//   Внутри фамилии, имени, отчества пробелов быть не должно.
//   Двойные и тройные имена и фамилии должны писаться через дефис. Имена и отчества должны быть полные
//
//  Падеж (обязательный), тип число
//   Падеж, в который необходимо поставить ФИО.
//   1 - Именительный
//   2 - Родительный
//   3 - Дательный
//   4 - Винительный
//   5 - Творительный
//   6 - Предложный
//
//  Пол (необязательный), тип ПеречислениеСсылка.ПолФизическихЛиц
//   Данный параметр предназначен для разрешения возможных неоднозначностей, например, имя Карен Акопян
//   может принадлежать и мужчине, и женщине, и в зависимости от этого склоняться или не склоняться.
//   В остальных случаях рекомендуется опускать этот параметр.
//
Функция ПросклонятьФамилиюИмяОтчество(Компонента, Знач Фамилия = "", Знач Имя = "", Знач Отчество = "", Падеж = 1, Пол = 0, Результат = "", СообщениеОбОшибке = "") Экспорт
	
	ФамилияНовая	= Фамилия;
	ИмяНовое		= Имя;
	ОтчествоНовое	= Отчество;
	
	Результат = Фамилия + " " + Имя + " " + Отчество;
	
	// Двойные и тройные ФИО, если указаны с пробелами, исправим на использование дефиса
	НужноИсправитьФамилию	= Найти(Фамилия, " ") > 0;
	НужноИсправитьИмя		= Найти(Имя, " ") > 0;
	НужноИсправитьОтчество	= Найти(Отчество, " ") > 0;
	Если НужноИсправитьФамилию Тогда
		ФамилияНовая = СтрЗаменить(Фамилия, " ", "-");
	КонецЕсли;
	Если НужноИсправитьИмя Тогда
		ИмяНовое = СтрЗаменить(Имя, " ", "-");
	КонецЕсли;
	Если НужноИсправитьОтчество Тогда
		ОтчествоНовое = СтрЗаменить(Отчество, " ", "-");
	КонецЕсли;
	
	ФИО = ФамилияНовая + " " + ИмяНовое + " " + ОтчествоНовое;
	
	Если ПустаяСтрока(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО не должна быть пустая.";
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РегламентированнаяОтчетность.ФИОНаписаноВерно(ФИО) Тогда
		СообщениеОбОшибке = "Строка с ФИО должна состоять только из букв русского алфавита, пробелов и дефисов.";
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ФИО, " ") > 3 Тогда
		СообщениеОбОшибке = "Фамилия, имя и отчество должны разделяться пробелами. Внутри фамилии, имени, отчества пробелов быть не должно.";
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
		
		Попытка
			Если Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
				Результат = Компонента.Просклонять(ФИО, Падеж, 1);
				
			ИначеЕсли Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
				Результат = Компонента.Просклонять(ФИО, Падеж, 2);
				
			Иначе
				Результат = Компонента.Просклонять(ФИО, Падеж);
				
			КонецЕсли;
			
			// Вернем пробелы в составные ФИО обратно, если до этого их изменили
			Если НужноИсправитьФамилию ИЛИ НужноИсправитьИмя ИЛИ НужноИсправитьОтчество Тогда
				
				МассивФИО = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Результат, " ");
				
				Результат = "";
				
				ИндексФИО = 0;
				
				Если Не ПустаяСтрока(Фамилия) Тогда
					ФамилияНовая = МассивФИО[ИндексФИО];
					ИндексФИО = ИндексФИО + 1;
					
					Если НужноИсправитьФамилию Тогда
						
						Если СтрЧислоВхождений(Фамилия, "-") > 0 Тогда
							
							МассивФамилия = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ФамилияНовая, "-");
							ФамилияНовая = МассивФамилия[0];
							ИндексФамилия = 1;
							
							Пока Истина Цикл
								
								ПозПробел = Найти(Фамилия, " ");
								ПозДефис  = Найти(Фамилия, "-");
								
								Если ПозПробел = ПозДефис Тогда
									Прервать;
								КонецЕсли;
								
								Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
									ФамилияНовая = ФамилияНовая + " ";
									Фамилия = Сред(Фамилия, ПозПробел+1);
									
								ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
									ФамилияНовая = ФамилияНовая + "-";
									Фамилия = Сред(Фамилия, ПозДефис+1);
									
								КонецЕсли;
								
								ФамилияНовая = ФамилияНовая + МассивФамилия[ИндексФамилия];
								ИндексФамилия = ИндексФамилия + 1;
								
							КонецЦикла;
							
						Иначе
							ФамилияНовая = СтрЗаменить(ФамилияНовая, "-", " ");
							
						КонецЕсли;
						
					КонецЕсли;
					
					Результат = Результат + ФамилияНовая;
					
				КонецЕсли;
				
				Если Не ПустаяСтрока(Имя) Тогда
					ИмяНовое = МассивФИО[ИндексФИО];
					ИндексФИО = ИндексФИО + 1;
					
					Если НужноИсправитьИмя Тогда
						
						Если СтрЧислоВхождений(Имя, "-") > 0 Тогда
							
							МассивИмя = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ИмяНовое, "-");
							ИмяНовое = МассивИмя[0];
							ИндексИмя = 1;
							
							Пока Истина Цикл
								
								ПозПробел = Найти(Имя, " ");
								ПозДефис  = Найти(Имя, "-");
								
								Если ПозПробел = ПозДефис Тогда
									Прервать;
								КонецЕсли;
								
								Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
									ИмяНовое = ИмяНовое + " ";
									Имя = Сред(Имя, ПозПробел+1);
									
								ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
									ИмяНовое = ИмяНовое + "-";
									Имя = Сред(Имя, ПозДефис+1);
									
								КонецЕсли;
								
								ИмяНовое = ИмяНовое + МассивИмя[ИндексИмя];
								ИндексИмя = ИндексИмя + 1;
								
							КонецЦикла;
							
						Иначе
							ИмяНовое = СтрЗаменить(ИмяНовое, "-", " ");
							
						КонецЕсли;
						
					КонецЕсли;
					
					Результат = СокрЛП(Результат + " " + ИмяНовое);
					
				КонецЕсли;
				
				Если Не ПустаяСтрока(Отчество) Тогда
					ОтчествоНовое = МассивФИО[ИндексФИО];
					ИндексФИО = ИндексФИО + 1;
					
					Если НужноИсправитьОтчество Тогда
						
						Если СтрЧислоВхождений(Отчество, "-") > 0 Тогда
							
							МассивОтчество = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ОтчествоНовое, "-");
							ОтчествоНовое = МассивОтчество[0];
							ИндексОтчество = 1;
							
							Пока Истина Цикл
								
								ПозПробел = Найти(Отчество, " ");
								ПозДефис  = Найти(Отчество, "-");
								
								Если ПозПробел = ПозДефис Тогда
									Прервать;
								КонецЕсли;
								
								Если (ПозДефис = 0) ИЛИ (ПозПробел > 0) И (ПозПробел < ПозДефис) Тогда
									ОтчествоНовое = ОтчествоНовое + " ";
									Отчество = Сред(Отчество, ПозПробел+1);
									
								ИначеЕсли (ПозПробел = 0) ИЛИ (ПозДефис > 0) И (ПозДефис < ПозПробел) Тогда
									ОтчествоНовое = ОтчествоНовое + "-";
									Отчество = Сред(Отчество, ПозДефис+1);
									
								Иначе
									Прервать;
									
								КонецЕсли;
								
								ОтчествоНовое = ОтчествоНовое + МассивОтчество[ИндексОтчество];
								ИндексОтчество = ИндексОтчество + 1;
								
							КонецЦикла;
							
						Иначе
							ОтчествоНовое = СтрЗаменить(ОтчествоНовое, "-", " ");
							
						КонецЕсли;
						
					КонецЕсли;
					
					Результат = СокрЛП(Результат + " " + ОтчествоНовое);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Истина;
			
		Исключение
			Возврат Ложь;
			
		КонецПопытки;
		
	#Иначе
		
		Возврат Ложь;
		
	#КонецЕсли
	
КонецФункции // ПросклонятьФИО()

// Функция формирует наименовние элемента справочника СотрудникиОрганизаций
//
// Параметры
//  <Физлицо>  – <СправочникСсылка.ФизическиеЛица> – физлицо 
//  <Постфикс>  – <Строка> – постфикс наименования сотрудника
//
// Возвращаемое значение:
//   <Строка>   – наименование сотрудника
//
Функция УстановитьНаименованиеСотрудника(Физлицо, Постфикс) Экспорт
	
	Возврат  Физлицо.Наименование + ?(ЗначениеЗаполнено(Постфикс), " " + Постфикс, "");
	
КонецФункции // УстановитьНаименованиеСотрудника()

// Процедура производит синхронирзацию наименований сотрудников
Процедура СинхронизироватьНаименованияСотрудников(Физлицо, Сотрудник = Неопределено) Экспорт
	
	Если Сотрудник = Неопределено Тогда
		Сотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизаций.Наименование,
	|	СотрудникиОрганизаций.ПостфиксНаименования,
	|	СотрудникиОрганизаций.Ссылка
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.Физлицо = &парамФизлицо";	
	
	Запрос.УстановитьПараметр("парамФизлицо", Физлицо);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = Сотрудник Тогда
			// не обрабатываем сотрудника, из которого вызвана синхронизация
			Продолжить;
		КонецЕсли; 
		
		СотрудникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка	
			СотрудникОбъект.Заблокировать();
		Исключение
			Продолжить;
		КонецПопытки;
		СотрудникОбъект.Наименование = УстановитьНаименованиеСотрудника(Физлицо, Выборка.ПостфиксНаименования);
		СотрудникОбъект.Записать();
		СотрудникОбъект.Разблокировать();
	КонецЦикла; 
	
КонецПроцедуры

// Функция определяет пол физлица по его отчеству
//
Функция ПолучитьПол(ОтчествоРаботника) Экспорт
	
	Если Прав(ОтчествоРаботника, 2) = "ич" Тогда
		Возврат Перечисления.ПолФизическихЛиц.Мужской;
		
	ИначеЕсли Прав(ОтчествоРаботника, 2) = "на" Тогда
		Возврат Перечисления.ПолФизическихЛиц.Женский;
		
	КонецЕсли;
	
	Возврат Перечисления.ПолФизическихЛиц.ПустаяСсылка();
	
КонецФункции // ПолучитьПол()

Процедура ОткрытьВводПоказателейПоОрганизации() Экспорт
	
	ФормаОбработки = Обработки.ЗначенияПоказателейСхемМотивации.ПолучитьФорму();
	ФормаОбработки.ВидОрганизационнойСтруктурыПредприятия = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц;
	ФормаОбработки.Открыть();
	
КонецПроцедуры

Процедура ОткрытьВводПоказателейПоЦФО() Экспорт
	
	ФормаОбработки = Обработки.ЗначенияПоказателейСхемМотивации.ПолучитьФорму();
	ФормаОбработки.ВидОрганизационнойСтруктурыПредприятия = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоЦентрамОтветственности;
	ФормаОбработки.Открыть();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ГОЛОВНЫЕ ОРГАНИЗАЦИИ И ОБОСОБЛЕННЫЕ ПОДРАЗДЕЛЕНИЯ

// Формирует список головных организаций предприятия
Функция ПолучитьСписокГоловныхОрганизаций() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &ПустаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организации.ГоловнаяОрганизация,
	|	Организации.ГоловнаяОрганизация.Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация <> &ПустаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование");
	
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());						  
	
	СписокОрганизаций = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла; 
	
	Возврат СписокОрганизаций;
	
КонецФункции 

// Формирует список обособленных структурных подразделений организации
Функция ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	СписокОрганизаций = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокОрганизаций;
КонецФункции // ПолучитьСписокОбособленныхПодразделенийОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЕСПЕЧЕНИЯ РАБОТЫ ФОРМ ДОКУМЕНТОВ

#Если Клиент Тогда
	
	// Функция ищет единственного сотрудника среди работников предприятия или организаций по
	//  началу его наименования
	//
	// Параметры
	//  СтандартнаяОбработка – параметр стандартной обработки события обработчика АвтоПодборТекста
	//	Режим – строка, определяет источники, из которых производится подбор 
	//	Текст  - начальные буквы ФИО, текст из обработчика АвтоПодборТекста
	//	Организация – ссылка на организацию по которой подбирать сотрудников (работников)
	//	ВозвращатьФизлицо – параметр определяет, что должна вернуть функция, наименование Сотрудника или Физлица
	//	ТолькоАктуальных – параметр определяет, вести поиск среди всех сотрудников, или только актуальных
	//
	// Возвращаемое значение
	//  строка - наименование найденного сотрудника, физлица, если он единственный
	//
	Функция ПодобратьФИОРаботникаКандидата(СтандартнаяОбработка, Режим, Знач Текст, Организация = Неопределено, ВозвращатьФизлицо = Ложь, ТолькоАктуальные = Истина,Регистратор = Неопределено) Экспорт
		
		ТекстАвтоПодбора = "";
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		
		// заменим спецсимволы
		Текст = СтрЗаменить(Текст, "~", "~~");
		Текст = СтрЗаменить(Текст, "%", "~%");
		Текст = СтрЗаменить(Текст, "_", "~_");
		Текст = СтрЗаменить(Текст, "[", "~[");
		Текст = СтрЗаменить(Текст, "-", "~-");
		Текст = Текст+"%";
		
		Запрос.УстановитьПараметр("Текст", Текст);
		
		Если Режим = "Работники" Тогда
			
			ПозицияСкобки = Найти(Текст,"(");
			Если ПозицияСкобки <> 0 Тогда
				Текст = Лев(Текст, ПозицияСкобки - 1);	
			КонецЕсли;
			Запрос.УстановитьПараметр("Текст", СокрП(Текст));
			
			Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ПолучитьРабочуюДату());
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И СотрудникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Работники.ФизЛицо,
			|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|	СотрудникиОрганизаций.ВидДоговора,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоТрудовойДоговор
			|ПОМЕСТИТЬ ВТ_ФизическиеЛица
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
			|		Работники.ФизЛицо КАК ФизЛицо
			|	ИЗ
			|		РегистрСведений.Работники КАК Работники
			|	ГДЕ
			|		Работники.ФизЛицо.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~"") КАК Работники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ПО Работники.ФизЛицо = СотрудникиОрганизаций.Физлицо
			|ГДЕ
			|	СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)" + ТекстУсловияНаАктуальность +"
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭтоТрудовойДоговор";
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОсновноеМесто.Сотрудник,
			|	РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|	ВЫБОР
			|		КОГДА РаботникиОсновноеМесто.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоОсновноеМестоРаботы
			|ПОМЕСТИТЬ ВТ_Сотрудники_ТрудовойДоговор
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|			&ДатаАктуальности,
			|			Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_ФизическиеЛица ГДЕ ЭтоТрудовойДоговор)) КАК РаботникиОсновноеМесто
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|		ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭтоОсновноеМестоРаботы,
			|	Физлицо";
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
			|	СписокСотрудников.Сотрудник.Наименование КАК Наименование,
			|	СписокСотрудников.Физлицо.Наименование КАК ФизлицоНаименование
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|		РаботникиОсновноеМесто.Физлицо КАК Физлицо,
			|		1 КАК Приоритет
			|	ИЗ
			|		ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиОсновноеМесто
			|	
			|	ГДЕ
			|		РаботникиОсновноеМесто.ЭтоОсновноеМестоРаботы
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиОсновноеМесто.Физлицо
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|		МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|		РаботникиСовместительство.Физлицо,
			|		2
			|	ИЗ
			|		ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиСовместительство
			|			
			|	ГДЕ
			|		НЕ РаботникиСовместительство.ЭтоОсновноеМестоРаботы
			|		
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиСовместительство.Физлицо
			|		
			|	ОБЪЕДИНИТЬ
			|		
			|	ВЫБРАТЬ
			|		МАКСИМУМ(СотрудникиДУ.Сотрудник),
			|		СотрудникиДУ.Физлицо,
			|		ВЫБОР
			|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|				ТОГДА 3
			|			КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|				ТОГДА 4
			|			ИНАЧЕ 5
			|		КОНЕЦ
			|	ИЗ
			|		ВТ_ФизическиеЛица КАК СотрудникиДУ
			|			
			|	СГРУППИРОВАТЬ ПО
			|		СотрудникиДУ.Физлицо,
			|		ВЫБОР
			|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|				ТОГДА 3
			|			КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|				ТОГДА 4
			|			ИНАЧЕ 5
			|		КОНЕЦ) КАК СписокСотрудников
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					СписокФизическихЛиц.Физлицо КАК Физлицо,
			|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|				ИЗ
			|					(ВЫБРАТЬ
			|						РаботникиОсновноеМесто.Физлицо КАК Физлицо,
			|						1 КАК Приоритет
			|					ИЗ
			|						ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиОсновноеМесто
			|			
			|					ГДЕ
			|			  			РаботникиОсновноеМесто.ЭтоОсновноеМестоРаботы
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						РаботникиСовместительство.Физлицо,
			|						2
			|					ИЗ
			|						ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиСовместительство
			|			
			|					ГДЕ
			|						НЕ РаботникиСовместительство.ЭтоОсновноеМестоРаботы
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						СотрудникиДУ.Физлицо,
			|						ВЫБОР
			|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|								ТОГДА 3
			|							КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|								ТОГДА 4
			|							ИНАЧЕ 5
			|						КОНЕЦ
			|					ИЗ
			|						ВТ_ФизическиеЛица КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|	ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|		И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет";
			
		ИначеЕсли Режим = "РаботникиИДоговорники" Тогда
			
			ДоговорыГПХ = Новый Массив;
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
			Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
			
			ТекстУсловияРаботники = "";
			//условие по Организации используем, если в качестве параметра передана не пустая ссылка на справочник
			Если ЗначениеЗаполнено(Организация) и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияРаботники = " И Организация = &ГоловнаяОрганизация";
				ТекстУсловияРаботники1 = " И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			ТекстУсловияНаАктуальностьДоговорники = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И РаботникиОрганизации.Сотрудник.Актуальность";
				ТекстУсловияНаАктуальностьДоговорники = " И ДоговорникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Если ВозвращатьФизлицо Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				|	РаботникиИДоговорники.Физлицо,
				|	РаботникиИДоговорники.ФизлицоНаименование КАК ФизлицоНаименование
				|ИЗ
				|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		РаботникиОрганизации.Сотрудник.Физлицо как Физлицо,
				|		РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
				|	ИЗ
				|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|	ГДЕ
				|		РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст +" ) КАК РаботникиИДоговорники
				|	
				|	ОБЪЕДИНИТЬ
				|	
				|ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо,
				|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование 
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)";
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст + ТекстУсловияРаботники1;
				Запрос.УстановитьПараметр("ДатаАктуальности",Регистратор.Дата);
				
				Запрос.УстановитьПараметр("Подразделение",Подразделения);
				//|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				//|		ДоговорникиОрганизаций.Физлицо.Наименование
				//|	ИЗ
				//|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
				//|	ГДЕ
				//|		ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
				//|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ТекстУсловияНаАктуальностьДоговорники +") КАК РаботникиИДоговорники";
				
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				|	РаботникиИДоговорники.Сотрудник,
				|	РаботникиИДоговорники.Наименование КАК Наименование
				|ИЗ
				|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		РаботникиОрганизации.Сотрудник,
				|		РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
				|	ИЗ
				|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|	ГДЕ
				|		РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст +" ) КАК РаботникиИДоговорники
				|	
				|	ОБЪЕДИНИТЬ
				|	
				|ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
				|		ВЫБОР
				|			КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Актуальность
				|				ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование
				|			ИНАЧЕ ""(не актуалент) "" + ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование
				|		КОНЕЦ            
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)";
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст + ТекстУсловияРаботники1+"
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование УБЫВ";
				Запрос.УстановитьПараметр("ДатаАктуальности",Регистратор.Дата);
				Запрос.УстановитьПараметр("Подразделение",Подразделения);
				//|	ВЫБРАТЬ РАЗЛИЧНЫЕ
				//|		ДоговорникиОрганизаций.Наименование
				//|	ИЗ
				//|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
				//|	ГДЕ
				//|		ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
				//|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ТекстУсловияНаАктуальностьДоговорники +") КАК РаботникиИДоговорники";
				
			КонецЕсли;	
			
		ИначеЕсли Режим = "Договорники" Тогда
			
			ДоговорыГПХ = Новый Массив;
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
			Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
			
			ТекстУсловияРаботники = "";
			Если ЗначениеЗаполнено(Организация) и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияРаботники = " И ДоговорникиОрганизаций.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И ДоговорникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
			|	ДоговорникиОрганизаций.Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
			|ГДЕ
			|	ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ТекстУсловияНаАктуальность;
			
		ИначеЕсли Режим = "РаботникиОрганизации" Тогда
			
			ТекстУсловияОрганизации = "";
			
			Если ЗначениеЗаполнено(Организация) и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И РаботникиОрганизации.Сотрудник.Актуальность";
			КонецЕсли;
			
			Если ВозвращатьФизлицо Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|ГДЕ
				|	РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				
			Иначе
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				|	РаботникиОрганизации.Сотрудник.Наименование КАК Наименование
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|ГДЕ
				|	РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				
				
			КонецЕсли;
			Запрос.УстановитьПараметр("Подразделение",Подразделения);
			
		ИначеЕсли Режим = "Сотрудники" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
			|	СотрудникиОрганизаций.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|	И СотрудникиОрганизаций.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий))
			|	И СотрудникиОрганизаций.Актуальность";
			
		ИначеЕсли Режим = "СотрудникиОрганизации" Тогда
			
			ТекстУсловияОрганизации = "";
			Если ЗначениеЗаполнено(Организация) и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияОрганизации = " И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
			|	СотрудникиОрганизаций.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
			|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|	И СотрудникиОрганизаций.Актуальность"+ ТекстУсловияОрганизации;
			
		Иначе
			
			Возврат ТекстАвтоПодбора;
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Если ВозвращатьФизлицо Тогда
				ТекстАвтоПодбора = Выборка.ФизлицоНаименование;
			Иначе
				ТекстАвтоПодбора = Выборка.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		Возврат ТекстАвтоПодбора;
		
	КонецФункции // ПодобратьФИОРаботникаКандидата()
	
	//(начало) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169
	//Функция возвращает список сотрудников, у которых есть виды отпусков, рабочий год которых требует проведения процедуры смещения
	//
	// Параметры
	//  Документ – ссылка на документ "УстановкаКоличестваДнейОтпуска"
	//
	// Возвращаемое значение
	//  Список значений типа "СправочникСсылка.СотрудникиОрганизаций"
	Функция ПолучитьСписокСотрудниковСоСмещеннымРабочимГодомОтпуска( ТекущаяФорма ) Экспорт
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	УстановкаКоличестваДнейОтпуска.Дата,
		//|	УстановкаКоличестваДнейОтпуска.Организация,
		//|	УстановкаКоличестваДнейОтпуска.ПодразделениеОрганизации,
		//|	УстановкаКоличестваДнейОтпуска.ПериодНеявокС,
		//|	УстановкаКоличестваДнейОтпуска.ПериодНеявокПО
		//|ИЗ
		//|	Документ.УстановкаКоличестваДнейОтпуска КАК УстановкаКоличестваДнейОтпуска
		//|ГДЕ
		//|	УстановкаКоличестваДнейОтпуска.Ссылка = &Документ";	
		//
		//Запрос.УстановитьПараметр("Документ", Документ);
		//РеквизитыДокумента = Запрос.Выполнить().Выбрать();
		//Если НЕ РеквизитыДокумента.Следующий() Тогда Возврат Новый СписокЗначений; КонецЕсли;
		
		РеквизитыДокумента = Новый Структура( "ПериодНеявокС,ПериодНеявокПО,Дата,ПодразделениеОрганизации,Организация" );
		ЗаполнитьЗначенияСвойств( РеквизитыДокумента, ТекущаяФорма );
		Если НЕ ЗначениеЗаполнено( РеквизитыДокумента.Дата ) Тогда
			РеквизитыДокумента.Дата	= ТекущаяДата();
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено( РеквизитыДокумента.ПериодНеявокС ) Тогда
			Сообщить( "Укажите, пожалуйста, начальную дату периода неявок !", СтатусСообщения.Важное );
			Возврат Новый СписокЗначений;
		ИначеЕсли НЕ ЗначениеЗаполнено( РеквизитыДокумента.ПериодНеявокПО ) Тогда
			Сообщить( "Укажите, пожалуйста, конечную дату периода неявок !", СтатусСообщения.Важное );
			Возврат Новый СписокЗначений;
		ИначеЕсли  РеквизитыДокумента.ПериодНеявокС > РеквизитыДокумента.ПериодНеявокПО Тогда
			Сообщить( "Укажите, пожалуйста, корректный период неявок. Сейчас указанная конечная дата меньше начальной!", СтатусСообщения.Важное );
			Возврат Новый СписокЗначений;
		ИначеЕсли НЕ ЗначениеЗаполнено( РеквизитыДокумента.Дата ) Тогда
			Сообщить( "Укажите, пожалуйста, дату документа !", СтатусСообщения.Важное );
			Возврат Новый СписокЗначений;
		ИначеЕсли НЕ ЗначениеЗаполнено( РеквизитыДокумента.Организация ) Тогда
			Сообщить( "Укажите, пожалуйста, организацию !", СтатусСообщения.Важное );
			Возврат Новый СписокЗначений;
		КонецЕсли; 
		Документ = ТекущаяФорма.Ссылка;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|// 0
		|ВЫБРАТЬ
		|	Состояния.Сотрудник, 
		|	НАЧАЛОПЕРИОДА( МИНИМУМ( Состояния.Период ), ДЕНЬ ) КАК ДатаНачалаОтпуска,
		|	КОНЕЦПЕРИОДА( МАКСИМУМ( Состояния.ПериодЗавершения ), ДЕНЬ ) КАК ДатаОкончанияОтпуска
		|ПОМЕСТИТЬ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|ГДЕ
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183 +
		//|	Состояния.ПериодЗавершения МЕЖДУ &ПериодНеявокНачало И &ПериодНеявокКонец
		//|   		И Состояния.Период <= Состояния.ПериодЗавершения И 
		//- СВЭЙ КДЯ 12.12.19 СВФР-004448
		|			Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|СГРУППИРОВАТЬ ПО
		|	Состояния.Сотрудник
		|;
		|
		|// 1
		|ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска КАК ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.Период КАК ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|		СУММА( ВЫБОР КОГДА ОтпускаПоТрудовымДоговорам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
		|						ТОГДА ОтпускаПоТрудовымДоговорам.КоличествоДней 
		|						ИНАЧЕ - ОтпускаПоТрудовымДоговорам.КоличествоДней 
		|			   КОНЕЦ ) КАК КоличествоДней
		|	ПОМЕСТИТЬ ВтОтпускаПоТрудовымДоговорамИсходные
		|ИЗ
		|	РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорам
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.Сотрудник
		//+ СВЭЙ КДЯ 19.12.19 СВФР-005183
		| 				И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска
		|				И ОтпускаПоТрудовымДоговорам.Период <= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска
		//- СВЭЙ КДЯ 19.12.19 СВФР-005183
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|				&Дата,
		|				Организация = &ГоловнаяОрганизация
		|" + ?( ЗначениеЗаполнено(РеквизитыДокумента.ПодразделениеОрганизации), " 
		|				И ПодразделениеОрганизации В ИЕРАРХИИ (&ПодразделениеОрганизации)
		|", "" ) + "
		|					) КАК РаботникиОрганизацийСрезПоследних
		|		ПО ОтпускаПоТрудовымДоговорам.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
		|			И НЕ РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
		|
		|ГДЕ
		|  ( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска IS NULL
		|		И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= &ПериодНеявокНачало
		|		И ОтпускаПоТрудовымДоговорам.Период <= &ПериодНеявокКонец
		|    ИЛИ
		|    НЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска IS NULL
		|		И 
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		//|		 ( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска МЕЖДУ
		//|				ОтпускаПоТрудовымДоговорам.Период
		//|				И ОтпускаПоТрудовымДоговорам.ДатаОкончания
		//|           ИЛИ
		//|			ОтпускаПоТрудовымДоговорам.ДатаОкончания >= &ПериодНеявокНачало
		//|			И ОтпускаПоТрудовымДоговорам.Период <= &ПериодНеявокКонец
		//|         )
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183 +
		|			ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска МЕЖДУ &ПериодНеявокНачало И &ПериодНеявокКонец
		//+ СВЭЙ КДЯ 19.12.19 СВФР-005183
		//| 		И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска
		//|			И ОтпускаПоТрудовымДоговорам.Период <= ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска
		//- СВЭЙ КДЯ 19.12.19 СВФР-005183
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		|	)
		|	И ОтпускаПоТрудовымДоговорам.Регистратор <> &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.Период,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания
		|;
		|
		|// 2
		|ВЫБРАТЬ
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,	
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска КАК ВидОтпуска,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней КАК КоличествоДней
		|	ПОМЕСТИТЬ ВтОтпускаПоТрудовымДоговорам
		|ИЗ
		|	ВтОтпускаПоТрудовымДоговорамИсходные КАК ОтпускаПоТрудовымДоговорам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорамСторно
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ОтпускаПоТрудовымДоговорамСторно.Сотрудник
		|			И ОтпускаПоТрудовымДоговорам.ВидОтпуска = ОтпускаПоТрудовымДоговорамСторно.ВидОтпуска
		|			И ОтпускаПоТрудовымДоговорам.ДатаНачала = ОтпускаПоТрудовымДоговорамСторно.Период
		|			И ОтпускаПоТрудовымДоговорам.КоличествоДней = ОтпускаПоТрудовымДоговорамСторно.КоличествоДней
		|			И ОтпускаПоТрудовымДоговорам.ДатаОкончания >= ОтпускаПоТрудовымДоговорамСторно.ДатаОкончания
		|			И (ОтпускаПоТрудовымДоговорамСторно.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (ОтпускаПоТрудовымДоговорамСторно.Корректировка)
		|			И (ОтпускаПоТрудовымДоговорамСторно.Регистратор <> &Регистратор)
		|			И (НЕ ОтпускаПоТрудовымДоговорамСторно.Регистратор ССЫЛКА Документ.ТрудовойДоговор)
		|ГДЕ
		|	ОтпускаПоТрудовымДоговорамСторно.Сотрудник ЕСТЬ NULL
		|;
		|
		|// 3
		|ВЫБРАТЬ
		|	Состояния.Сотрудник, КОНЕЦПЕРИОДА( МАКСИМУМ( Состояния.ПериодЗавершения ), ДЕНЬ ) КАК ДатаОкончанияОтпуска
		|ПОМЕСТИТЬ ВтДатыОкончанияОтпусковПоУходуЗаРебенком
		|ИЗ
		|	РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтпускаПоТрудовымДоговорам КАК Отпуска
		|   	ПО 
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		//|			Состояния.Период МЕЖДУ Отпуска.ДатаНачала И Отпуска.ДатаОкончания
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		//+ СВЭЙ КДЯ 12.12.19 СВФР-005183
		|			Отпуска.ДатаОкончания >= Состояния.Период
		|			И Отпуска.ДатаНачала <= Состояния.ПериодЗавершения
		//- СВЭЙ КДЯ 12.12.19 СВФР-005183
		|   		И Состояния.Сотрудник = Отпуска.Сотрудник
		|   		И Состояния.Период <= Состояния.ПериодЗавершения
		|			И Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|СГРУППИРОВАТЬ ПО
		|	Состояния.Сотрудник
		|;
		|
		|// 4
		|ВЫБРАТЬ
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник КАК Сотрудник,
		|	СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СмещениеВДняхИззаОтпускаПоУходуЗаРебенком,
		|	СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) - 14 КАК СмещениеВДняхИззаОтпускаЗаСвойСчет,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник.Физлицо КАК ФизЛицо,
		|	&Дата КАК ДатаИзменения,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней КАК КоличествоДней,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска
		|ПОМЕСТИТЬ ВтСмещения
		|ИЗ
		|    ВтОтпускаПоТрудовымДоговорам КАК ОтпускаПоТрудовымДоговорам
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияОтпусковПоУходуЗаРебенком.Сотрудник
		|
		|       ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком КАК ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком
		|			ПО ОтпускаПоТрудовымДоговорам.Сотрудник = ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.Сотрудник
		|
		|
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК Состояния
		|		ПО ОтпускаПоТрудовымДоговорам.Сотрудник = Состояния.Сотрудник
		|			И (Состояния.Состояние В (&СостоянияОтпусковБезОплаты))
		|			И (Состояния.Период МЕЖДУ 
		|				  ВЫБОР 
		|					КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|                   	ТОГДА ISNULL( ВтДатыОкончанияПрошлыхОтпусковПоУходуЗаРебенком.ДатаНачалаОтпуска, ОтпускаПоТрудовымДоговорам.ДатаНачала )
		|						ИНАЧЕ ОтпускаПоТрудовымДоговорам.ДатаНачала
		|				  КОНЕЦ 
		|				И ВЫБОР 
		|					КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|                   	ТОГДА ISNULL( ВтДатыОкончанияОтпусковПоУходуЗаРебенком.ДатаОкончанияОтпуска, ДАТАВРЕМЯ( 1, 1, 1 ) )
		|						ИНАЧЕ КОНЕЦПЕРИОДА( ОтпускаПоТрудовымДоговорам.ДатаОкончания, ДЕНЬ )
		|				  КОНЕЦ 
		|			   )
		|			И Состояния.Организация = &ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтпускаПоТрудовымДоговорам.ПодразделениеОрганизации,
		|	ОтпускаПоТрудовымДоговорам.Должность,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник,
		|	ОтпускаПоТрудовымДоговорам.Сотрудник.Физлицо,
		|	ОтпускаПоТрудовымДоговорам.КоличествоДней,
		|	ОтпускаПоТрудовымДоговорам.ДатаНачала,
		|	ОтпускаПоТрудовымДоговорам.ДатаОкончания,
		|	ОтпускаПоТрудовымДоговорам.ВидОтпуска
		|
		|ИМЕЮЩИЕ
		|	(СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние = ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|			КОНЕЦ) > 0
		|		ИЛИ СУММА(ВЫБОР
		|			КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ( Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком )
		|				ТОГДА РАЗНОСТЬДАТ(
		|							Состояния.Период, 
		|							Состояния.ПериодЗавершения, 
		|							ДЕНЬ ) //+ 1
		|			ИНАЧЕ 0
		|			КОНЕЦ) - 14 > 0 )
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|// 5
		|ВЫБРАТЬ
		|	ВтСмещения.Сотрудник КАК Сотрудник,
		|	ВтСмещения.ФизЛицо КАК ФизЛицо,
		|	ВтСмещения.ПодразделениеОрганизации КАК Подразделение,
		|	ВтСмещения.Должность КАК Должность,
		|	ВтСмещения.ДатаИзменения КАК ДатаИзменения,
		|	ВтСмещения.КоличествоДней КАК КоличествоДней,
		|	ВтСмещения.КоличествоДней КАК НовоеКоличествоДней,
		|	ВЫБОР
		|		КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0
		|				И ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0
		|			ТОГДА ""отп.без з/п(%СмещениеВДняхИззаОтпускаЗаСвойСчет дн),отп.по уходу за реб.(%СмещениеВДняхИззаОтпускаПоУходуЗаРебенком дн)""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0
		|					ТОГДА ""отпуск по уходу за ребенком (%СмещениеВДняхИззаОтпускаПоУходуЗаРебенком дн.)""
		|				ИНАЧЕ ""отпуск без з/п (%СмещениеВДняхИззаОтпускаЗаСвойСчет дн.)""
		|			КОНЕЦ
		|	КОНЕЦ КАК Основание,
		|   ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком,
		|	ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 
		|				ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0
		|	КОНЕЦ КАК СмещениеВДняхИззаОтпускаЗаСвойСчет,
		|	ВтСмещения.ДатаНачала КАК ДатаНачала,
		|	ВтСмещения.ДатаОкончания КАК ДатаОкончания,
		|	ВтСмещения.ДатаНачала КАК ДатаНачалаНов,
		|	НАЧАЛОПЕРИОДА(
		|	  ДОБАВИТЬКДАТЕ(ВтСмещения.ДатаОкончания, ДЕНЬ, 
		|		ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком
		|				ИНАЧЕ 0 КОНЕЦ
		|		+ ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0 КОНЕЦ 
		|	  )
		|	, ДЕНЬ) КАК ДатаОкончанияНов,
		|	ВтСмещения.ДатаНачала КАК РабочийГодС,
		|	ВтСмещения.ДатаОкончания КАК РабочийГодПо,
		|	ВтСмещения.ДатаНачала КАК РабочийГодСНов,
		|	НАЧАЛОПЕРИОДА(
		|	  ДОБАВИТЬКДАТЕ(ВтСмещения.ДатаОкончания, ДЕНЬ,
		|		ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаПоУходуЗаРебенком
		|				ИНАЧЕ 0 КОНЕЦ
		|		+ ВЫБОР КОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет > 0 ТОГДА ВтСмещения.СмещениеВДняхИззаОтпускаЗаСвойСчет 
		|				ИНАЧЕ 0 КОНЕЦ 
		|	  )
		|	, ДЕНЬ) КАК РабочийГодПоНов,
		|	ВтСмещения.ВидОтпуска КАК ВидОтпуска,
		|	ВтСмещения.Сотрудник.Код КАК СотрудникКод
		|ИЗ
		|	ВтСмещения КАК ВтСмещения
		|";
		
		СостоянияОтпусковБезОплаты = Новый Массив;
		ПерСост = Перечисления.СостоянияРаботникаОрганизации;
		СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускУчебныйНеоплачиваемый );
		СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины );
		СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускБезСохраненияЗарплатыУчебныеСборы );
		СостоянияОтпусковБезОплаты.Добавить( ПерСост.ОтпускПоУходуЗаРебенком );
		Запрос.УстановитьПараметр("СостоянияОтпусковБезОплаты", СостоянияОтпусковБезОплаты);
		
		Запрос.УстановитьПараметр("ПериодНеявокКонец", КонецДня( РеквизитыДокумента.ПериодНеявокПО ));
		Запрос.УстановитьПараметр("ПериодНеявокНачало", РеквизитыДокумента.ПериодНеявокС);
		Запрос.УстановитьПараметр("Дата", РеквизитыДокумента.Дата);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", РеквизитыДокумента.ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(РеквизитыДокумента.Организация));
		Запрос.УстановитьПараметр("Регистратор", Документ);
		
		
		МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "Сотрудник" );
		СписокСотрудников = Новый СписокЗначений;
		СписокСотрудников.ЗагрузитьЗначения( МассивСотрудников );
		
		Возврат СписокСотрудников;
	КонецФункции // ПодобратьФИОРаботникаКандидата()
	//(конец) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169
	
	//+ СВЭЙ КДЯ 17.01.20 СВФР-005373 ( Пункт 1 . )
	// Возвращает перечень не помеченных на удаление сотрудников, 
	//	соответствующих указанному физ. лицу
	//
	// Параметры:
	//  <ФизЛицо>  - <СправочникСсылка.ФизическиеЛица> - <Физ. лицо,
	//                 по которому получаем список сотрудников>
	//
	// Возвращаемое значение:
	//   <Массив значений <СправочникСсылка.СотрудникиОрганизаций>>
	//
	Функция ПолучитьСписокСотрудниковФизЛица( ФизЛицо ) Экспорт
		
		СписокСотрудниковФизЛица = Новый СписокЗначений;
		// формируем по всем сотрудников, не только актуальным
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.Физлицо = &Физлицо
		//|	И СотрудникиОрганизаций.Актуальность
		|	И НЕ СотрудникиОрганизаций.ПометкаУдаления
		|";
		Запрос.УстановитьПараметр( "ФизЛицо", ФизЛицо );
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат СписокСотрудниковФизЛица;	
		КонецЕсли; 
		МассивСотрудниковФизЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку( "Ссылка" );
		СписокСотрудниковФизЛица.ЗагрузитьЗначения( МассивСотрудниковФизЛица );	
		Возврат СписокСотрудниковФизЛица;
		
	КонецФункции // ПолучитьСписокСотрудниковФизЛица()
	
	Функция ИспользоватьФункциналПрохождениеОбучения( ОрганизацияПоУмолчанию = Неопределено ) Экспорт
		
		Если НЕ ЗначениеЗаполнено( ОрганизацияПоУмолчанию ) Тогда
			ОрганизацияПоУмолчанию = 
			УправлениеПользователями.ПолучитьЗначениеПоУмолчанию( 
			глЗначениеПеременной( "глТекущийПользователь" ), "ОсновнаяОрганизация" );
		КонецЕсли; 
		ИспользоватьФункциналПрохождениеОбучения = 
		ОрганизацияПоУмолчанию.ИНН = "100092167";
		Возврат ИспользоватьФункциналПрохождениеОбучения;	
		
	КонецФункции // ЭтоЦЭМ()
	
	//- СВЭЙ КДЯ 17.01.20 СВФР-005373 ( Пункт 1 . )
	
	// Функция ищет сотрудника среди работников предприятия или организаций по
	//  началу его наименования
	//
	// Параметры
	// 	СтандартнаяОбработка – параметр стандартной обработки события обработчика АвтоПодборТекста
	//	Режим – строка, определяет источники, из которых производится подбор 
	//	Текст  - начальные буквы ФИО, текст из обработчика АвтоПодборТекста
	//	Организация – ссылка на организацию по которой подбирать сотрудников (работников)
	//	ВозвращатьФизлицо – параметр определяет, что должна вернуть функция, ссылку на Сотрудника или Физлицо
	//	ТолькоАктуальных – параметр определяет, вести поиск среди всех сотрудников, или только актуальных
	//
	// Возвращаемое значение
	//  СписокЗначений - список подходящих физлиц, если их найдено не более 50
	//  Неопределено - если найдено более 50 подходящих физлиц
	//
	Функция ПодобратьСписокРаботниковКандидатов(СтандартнаяОбработка, Режим, Знач Текст, НачальноеЗначение, Организация = Неопределено, ВозвращатьФизлицо = Ложь, ТолькоАктуальные = Истина,Регистратор = Неопределено) Экспорт
		
		Если ПустаяСтрока(Текст) Тогда
			Возврат Новый СписокЗначений;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		
		// заменим спецсимволы
		Текст = СОКРЛП(Текст);
		Текст = СтрЗаменить(Текст, "~", "~~");
		Текст = СтрЗаменить(Текст, "%", "~%");
		Текст = СтрЗаменить(Текст, "_", "~_");
		Текст = СтрЗаменить(Текст, "[", "~[");
		Текст = СтрЗаменить(Текст, "-", "~-");
		Текст = Текст+"%";
		
		Запрос.УстановитьПараметр("Текст", Текст);
		
		Если Режим = "Работники" Тогда
			
			ПозицияСкобки = Найти(Текст,"(");
			Если ПозицияСкобки <> 0 Тогда
				Текст = Лев(Текст, ПозицияСкобки - 1);	
			КонецЕсли;
			Запрос.УстановитьПараметр("Текст", СокрП(Текст));
			
			Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ПолучитьРабочуюДату());
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И СотрудникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Работники.ФизЛицо,
			|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
			|	СотрудникиОрганизаций.ВидДоговора,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоТрудовойДоговор
			|ПОМЕСТИТЬ ВТ_ФизическиеЛица
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|		Работники.ФизЛицо КАК ФизЛицо
			|	ИЗ
			|		РегистрСведений.Работники КАК Работники
			|	ГДЕ
			|		Работники.ФизЛицо.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~"") КАК Работники
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ПО Работники.ФизЛицо = СотрудникиОрганизаций.Физлицо
			|ГДЕ
			|	СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)" + ТекстУсловияНаАктуальность + "
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭтоТрудовойДоговор";
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОсновноеМесто.Сотрудник,
			|	РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|	ВЫБОР
			|		КОГДА РаботникиОсновноеМесто.Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоОсновноеМестоРаботы
			|ПОМЕСТИТЬ ВТ_Сотрудники_ТрудовойДоговор
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|			&ДатаАктуальности,
			|			Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_ФизическиеЛица ГДЕ ЭтоТрудовойДоговор)) КАК РаботникиОсновноеМесто
			|ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|		ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
			|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭтоОсновноеМестоРаботы,
			|	Физлицо";
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	СписокСотрудников.Сотрудник КАК Ссылка,
			|	СписокСотрудников.Сотрудник.Наименование КАК Наименование,
			|	СписокСотрудников.Физлицо КАК Физлицо,
			|	СписокСотрудников.ФизЛицо.Наименование КАК ФизлицоНаименование
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|		РаботникиОсновноеМесто.Физлицо КАК Физлицо,
			|		1 КАК Приоритет
			|	ИЗ
			|		ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиОсновноеМесто
			|	
			|	ГДЕ
			|		РаботникиОсновноеМесто.ЭтоОсновноеМестоРаботы
			|			
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиОсновноеМесто.Физлицо
			|			
			|	ОБЪЕДИНИТЬ
			|			
			|	ВЫБРАТЬ
			|		МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|		РаботникиСовместительство.Физлицо,
			|		2
			|	ИЗ
			|		ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиСовместительство
			|			
			|	ГДЕ
			|		НЕ РаботникиСовместительство.ЭтоОсновноеМестоРаботы
			|		
			|	СГРУППИРОВАТЬ ПО
			|		РаботникиСовместительство.Физлицо
			|			
			|	ОБЪЕДИНИТЬ
			|		
			|	ВЫБРАТЬ
			|		МАКСИМУМ(СотрудникиДУ.Сотрудник),
			|		СотрудникиДУ.Физлицо,
			|		ВЫБОР
			|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|				ТОГДА 3
			|			КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|				ТОГДА 4
			|			ИНАЧЕ 5
			|		КОНЕЦ
			|	ИЗ
			|		ВТ_ФизическиеЛица КАК СотрудникиДУ
			|			
			|	СГРУППИРОВАТЬ ПО
			|		СотрудникиДУ.Физлицо,
			|		ВЫБОР
			|			КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|				ТОГДА 3
			|			КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|				ТОГДА 4
			|			ИНАЧЕ 5
			|		КОНЕЦ) КАК СписокСотрудников
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					СписокФизическихЛиц.Физлицо КАК Физлицо,
			|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|				ИЗ
			|					(ВЫБРАТЬ
			|						РаботникиОсновноеМесто.Физлицо КАК Физлицо,
			|						1 КАК Приоритет
			|					ИЗ
			|						ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиОсновноеМесто
			|			
			|					ГДЕ
			|			  			РаботникиОсновноеМесто.ЭтоОсновноеМестоРаботы
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						РаботникиСовместительство.Физлицо,
			|						2
			|					ИЗ
			|						ВТ_Сотрудники_ТрудовойДоговор КАК РаботникиСовместительство
			|			
			|					ГДЕ
			|						НЕ РаботникиСовместительство.ЭтоОсновноеМестоРаботы
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						СотрудникиДУ.Физлицо,
			|						ВЫБОР
			|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|								ТОГДА 3
			|							КОГДА СотрудникиДУ.ЭтоТрудовойДоговор
			|								ТОГДА 4
			|							ИНАЧЕ 5
			|						КОНЕЦ
			|					ИЗ
			|						ВТ_ФизическиеЛица КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|	ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|		И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет";
			
		ИначеЕсли Режим = "РаботникиИДоговорники" Тогда
			
			ДоговорыГПХ = Новый Массив;
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
			Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
			
			ТекстУсловияРаботники = "";
			Если ЗначениеЗаполнено(Организация) и ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияРаботники = " И Организация = &ГоловнаяОрганизация";
				ТекстУсловияРаботники1 = " И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			ТекстУсловияНаАктуальностьДоговорники = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И РаботникиОрганизации.Сотрудник.Актуальность";
				ТекстУсловияНаАктуальностьДоговорники = " И ДоговорникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Если ВозвращатьФизлицо Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
				|	РаботникиИДоговорники.Физлицо,
				|	РаботникиИДоговорники.ФизлицоНаименование
				|ИЗ
				|	(ВЫБРАТЬ
				|		РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
				|		РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
				|	ИЗ
				|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|	ГДЕ
				|		РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~"""+ ТекстУсловияРаботники + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст +"
				|	ОБЪЕДИНИТЬ ВСЕ
				|ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо,
				|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование 
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)";
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст + ТекстУсловияРаботники1+") КАК РаботникиИДоговорники";
				Запрос.УстановитьПараметр("ДатаАктуальности",?(Регистратор = Неопределено, ОбщегоНазначения.ПолучитьРабочуюДату(),Регистратор.Дата));
				//|	
				//|	ОБЪЕДИНИТЬ ВСЕ
				//|	
				//|	ВЫБРАТЬ
				//|		ДоговорникиОрганизаций.Физлицо,
				//|		ДоговорникиОрганизаций.Физлицо.Наименование
				//|	ИЗ
				//|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
				//|	ГДЕ
				//|		ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
				//|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)"+ ТекстУсловияРаботники + ТекстУсловияНаАктуальностьДоговорники +") КАК РаботникиИДоговорники";
				
				Запрос.УстановитьПараметр("Подразделение",Подразделения);
			Иначе
				
				Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ПолучитьРабочуюДату());
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
				|	РаботникиОрганизации.Сотрудник КАК Сотрудник
				|ПОМЕСТИТЬ ВТ_СписокРаботников
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|ГДЕ
				|	РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияРаботники + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.УстановитьПараметр("Подразделение",Подразделения);
				Запрос.Выполнить();
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
				|	СписокРаботников.Ссылка,
				|	СписокРаботников.Наименование
				|ИЗ
				|	(ВЫБРАТЬ
				|		РаботникиСрезПоследних.Сотрудник КАК Ссылка,
				|		ВЫБОР
				|			КОГДА РаботникиСрезПоследних.Сотрудник.Актуальность
				|				ТОГДА ВЫБОР
				|						КОГДА РаботникиСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
				|								И РаботникиСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				|							ТОГДА ВЫБОР
				|									КОГДА РаботникиСрезПоследних.ПричинаИзмененияСостоянияЗавершения = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|										ТОГДА ""(ув.) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|									ИНАЧЕ РаботникиСрезПоследних.Сотрудник.Наименование
				|								КОНЕЦ
				|						ИНАЧЕ ВЫБОР
				|								КОГДА РаботникиСрезПоследних.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|									ТОГДА ""(ув.) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|								ИНАЧЕ РаботникиСрезПоследних.Сотрудник.Наименование
				|							КОНЕЦ
				|					КОНЕЦ
				|			ИНАЧЕ ""(не актуалент) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|		КОНЕЦ КАК Наименование
				|	ИЗ
				|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_СписокРаботников)) КАК РаботникиСрезПоследних";
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст +"
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				
				|ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
				|		ВЫБОР
				|			КОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Актуальность
				|				ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование
				|			ИНАЧЕ ""(не актуалент) "" + ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование
				|		КОНЕЦ            
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
				|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)";
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда 
					Запрос.Текст = Запрос.Текст +"
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст + ТекстУсловияРаботники1+") КАК СписокРаботников
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование УБЫВ";
				Запрос.УстановитьПараметр("ДатаАктуальности",?(Регистратор = Неопределено, ОбщегоНазначения.ПолучитьРабочуюДату(),Регистратор.Дата));
				
				//|	
				//|	ВЫБРАТЬ 
				//|		ДоговорникиОрганизаций.Ссылка,
				//|		ВЫБОР
				//|			КОГДА ДоговорникиОрганизаций.Актуальность
				//|				ТОГДА ДоговорникиОрганизаций.Наименование
				//|			ИНАЧЕ ""(не актуалент) "" + ДоговорникиОрганизаций.Наименование
				//|		КОНЕЦ
				//|	ИЗ
				//|		Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
				//|	ГДЕ
				//|		ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
				//|		И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ТекстУсловияНаАктуальностьДоговорники + ") КАК СписокРаботников
				//|
				//|УПОРЯДОЧИТЬ ПО
				//|	Наименование УБЫВ";
				
				
			КонецЕсли;
			
		ИначеЕсли Режим = "Договорники" Тогда
			
			ДоговорыГПХ = Новый Массив;
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
			ДоговорыГПХ.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
			Запрос.УстановитьПараметр("ДоговорыГПХ", ДоговорыГПХ);
			
			ТекстУсловияРаботники = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияРаботники = " И ДоговорникиОрганизаций.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И ДоговорникиОрганизаций.Актуальность";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	ВЫБОР
			|		КОГДА ДоговорникиОрганизаций.Актуальность
			|			ТОГДА ДоговорникиОрганизаций.Наименование
			|		ИНАЧЕ ""(не актуалент) "" + ДоговорникиОрганизаций.Наименование
			|	КОНЕЦ КАК Наименование,
			|	ДоговорникиОрганизаций.Ссылка
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК ДоговорникиОрганизаций
			|ГДЕ
			|	ДоговорникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И ДоговорникиОрганизаций.ВидДоговора В(&ДоговорыГПХ)" + ТекстУсловияРаботники + ТекстУсловияНаАктуальность + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование УБЫВ";
			
		ИначеЕсли Режим = "РаботникиОрганизации" Тогда
			
			ТекстУсловияОрганизации = "";
			
			Если ЗначениеЗаполнено(Организация) Тогда
				ТекстУсловияОрганизации = " И Организация = &ГоловнаяОрганизация";
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			КонецЕсли;
			
			ТекстУсловияНаАктуальность = "";
			Если ТолькоАктуальные Тогда
				ТекстУсловияНаАктуальность = " И РаботникиОрганизации.Сотрудник.Актуальность";
			КонецЕсли;
			
			Если ВозвращатьФизлицо Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
				|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
				|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФизлицоНаименование
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|ГДЕ
				|	РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				
			Иначе
				
				Запрос.УстановитьПараметр("ДатаАктуальности", ОбщегоНазначения.ПолучитьРабочуюДату());
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
				|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
				|	РаботникиОрганизации.ПодразделениеОрганизации
				|ПОМЕСТИТЬ ВТ_СписокРаботников
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
				|ГДЕ
				|	РаботникиОрганизации.Сотрудник.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""" + ТекстУсловияОрганизации + ТекстУсловияНаАктуальность;
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда  
					Запрос.Текст = Запрос.Текст +"
					|	И РаботникиОрганизации.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.УстановитьПараметр("Подразделение",Подразделения);
				Запрос.Выполнить();
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РаботникиСрезПоследних.Сотрудник КАК Ссылка,
				|	РаботникиСрезПоследних.ПодразделениеОрганизации,
				|	ВЫБОР
				|		КОГДА РаботникиСрезПоследних.Сотрудник.Актуальность
				|			ТОГДА ВЫБОР
				|					КОГДА РаботникиСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
				|							И РаботникиСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				|						ТОГДА ВЫБОР
				|								КОГДА РаботникиСрезПоследних.ПричинаИзмененияСостоянияЗавершения = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|									ТОГДА ""(ув.) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|								ИНАЧЕ РаботникиСрезПоследних.Сотрудник.Наименование
				|							КОНЕЦ
				|					ИНАЧЕ ВЫБОР
				|							КОГДА РаботникиСрезПоследних.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|								ТОГДА ""(ув.) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|							ИНАЧЕ РаботникиСрезПоследних.Сотрудник.Наименование
				|						КОНЕЦ
				|				КОНЕЦ
				|		ИНАЧЕ ""(не актуалент) "" + РаботникиСрезПоследних.Сотрудник.Наименование
				|	КОНЕЦ КАК Наименование
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_СписокРаботников)) КАК РаботникиСрезПоследних";
				
				Подразделения = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеПодразделениеОрганизации");
				Если ЗначениеЗаполнено(Подразделения) Тогда  
					Запрос.Текст = Запрос.Текст +"
					|	ГДЕ РаботникиСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
				КонецЕсли;
				Запрос.Текст = Запрос.Текст +"
				
				|
				|УПОРЯДОЧИТЬ ПО
				|	Наименование УБЫВ";
				
			КонецЕсли;
			
		ИначеЕсли Режим = "Сотрудники" Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	СотрудникиОрганизаций.Ссылка КАК Ссылка,
			|	СотрудникиОрганизаций.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
			|	И СотрудникиОрганизаций.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий))
			|	И СотрудникиОрганизаций.Актуальность";
			
		ИначеЕсли Режим = "СотрудникиОрганизации" Тогда
			
			ТекстУсловияОрганизации = "";
			
			Если ЗначениеЗаполнено(Организация) Тогда
				Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
				ТекстУсловияОрганизации = " И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация";
			КонецЕсли;
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 51
			|	СотрудникиОрганизаций.Ссылка КАК Ссылка,
			|	СотрудникиОрганизаций.Наименование КАК Наименование
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|		ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
			|ГДЕ
			|	СотрудникиОрганизаций.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""
			|	И РаботникиОрганизаций.Сотрудник ЕСТЬ NULL 
			|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|	И СотрудникиОрганизаций.Актуальность"+ ТекстУсловияОрганизации;
			
		Иначе
			
			Возврат Новый СписокЗначений;
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Количество = Выборка.Количество();
		
		Если Количество < 51 Тогда
			
			Значение = Новый СписокЗначений;
			Пока Выборка.Следующий() Цикл
				Если ВозвращатьФизлицо Тогда
					Значение.Добавить(Выборка.Физлицо, Выборка.ФизлицоНаименование);
				Иначе
					Значение.Добавить(Выборка.Ссылка, Выборка.Наименование);
				КонецЕсли;
			КонецЦикла;
			
			СтандартнаяОбработка = Ложь;
			Возврат Значение;
			
		Иначе
			// значений для выбора больше 50
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецФункции // ПодобратьСписокРаботниковКандидатов()
	
	// Открывает форму обработки для подготовки списка работников, отобранного по указанным пользователем критериям
	//
	// Владелец - форма, для которой требуется вызвать обработку
	// ДатаАктуальности - дата, по состоянию на которую осматривается список работников
	// ИмяРегистра - строка, возможны 2 значения - "РаботникиОрганизаций" или "Работники" - определяет
	//               какие работники будут отбираться - по регл. или по упр. учету
	// Организация - ссылка на организацию (может быть в том числе обособленным подразделением), если передана пустая ссылка, выбираются 
	//					работники всех организаций
	// Подразделение - ссылка на подразделение, если передана пустая ссылка, выбираются 
	//					работники всех подразделений
	// 
	Процедура ОткрытьФормуОтбораСпискаРаботников(Владелец, ДатаАктуальности, ИмяРегистра = "РаботникиОрганизаций", Знач Организация = Неопределено, Подразделение = Неопределено, 
												 ИсполнятьЗапрос = Истина, ВыбиратьСотрудника = Истина, ИменаСтраницФормы = Неопределено, Реквизиты = Неопределено, ДатаУволенных = Неопределено, 
												 ВключатьУволенных = Ложь, ВключатьДоговорников = Ложь, мВыборКнопки = Неопределено, ИсключатьДекретников = Неопределено, ИсключатьТолькоСОсвобожденнойСтавкой = Ложь) Экспорт  
												 //Аверсон 10.08.2021 КВВ СВФР-007858 (мВыборКнопки) 
												 //Аверсон ЕАЕ 29.09.2021 СВФР-008097 (ИсключатьДекретников)
												 //Аверсон ЕАЕ 22.07.2025 СВФР-016305 (ИсключатьТолькоСОсвобожденнойСтавкой)
		
		Если ИмяРегистра = "РаботникиОрганизаций" И НЕ ЗначениеЗаполнено(Организация) Тогда
			Предупреждение("Не указана организация, отобрать список работников невозможно!");
			Возврат;
		КонецЕсли;
		//О.Т. Аверсон 16.11.2016 № 33
		ИзменениеТарифнойСтавки = Ложь;
		Если Владелец <> Неопределено и Владелец <> Null Тогда
			Если ИменаСтраницФормы = "ИзменениеПериодическихРеквизитов" Тогда 
				ИзменениеТарифнойСтавки = Владелец.ДокументОбъект.ИзменениеТарифнойСтавки;
			КонецЕсли;
		КонецЕсли;
		//О.Т. Аверсон 16.11.2016 № 33
		
		ФормированиеСпискаРаботников = Обработки.ФормированиеСпискаРаботников.Создать();
		ФормированиеСпискаРаботников.ИмяРегистра			= ИмяРегистра;
		//Наркевич 14.03.2014 № меняем дату актуальности на конец месяца, что бы брались все людишки на конец месяца, а не на его начало
		ФормированиеСпискаРаботников.ДатаАктуальности		= КонецМесяца(ДатаАктуальности);
		ФормированиеСпискаРаботников.ДатаУволенных			= ?(ДатаУволенных = Неопределено, НачалоГода(ДатаАктуальности), ДатаУволенных);
		ФормированиеСпискаРаботников.ИсполнятьЗапрос		= ИсполнятьЗапрос;
		ФормированиеСпискаРаботников.ВыбиратьСотрудника		= ВыбиратьСотрудника;
		ФормированиеСпискаРаботников.ВключатьДоговорников	= ВключатьДоговорников;
		ФормированиеСпискаРаботников.Реквизиты				= Реквизиты;
		ФормированиеСпискаРаботников.ВключатьУволенных	    = ВключатьУволенных;
		
		//Аверсон ЕАЕ 09.07.2021 СВФР-007834
		ЭтоПремии = (ИменаСтраницФормы = "ПремииРаботниковОрганизаций")
		
		//Аверсон ЕАЕ 19.04.2022 СВФР-008963
		ИЛИ (ИменаСтраницФормы="ОплатаСверхурочныхЧасов" И мВыборКнопки = "РаботавшимиСверхурочноПоНарядам")
		//Аверсон СВФР-008963
		
		ИЛИ (ИменаСтраницФормы="ОплатаПраздничныхИВыходныхДнейОрганизаций" И мВыборКнопки = "РаботавшимиВПраздники"); //Аверсон 10.08.2021 КВВ СВФР-007858
		ФормированиеСпискаРаботников.ЗаПериод = ЭтоПремии;
		//Аверсон СВФР-007834
		//ПСА 17.09.2021 СВФР-008073 +++
		Если ИменаСтраницФормы = "НачислениеЗарплатыРаботникамОрганизации" Тогда
			ФормированиеСпискаРаботников.ЗаПериод = Истина;
			ИменаСтраницФормы = Неопределено;
		КонецЕсли;	
		//+++ПСА 17.09.2021 СВФР-008073
		
		// подготовим Построитель отчета к работе
		СортироватьПоПодразделению = Ложь;
		Если Владелец <> Неопределено и Владелец <> Null Тогда
			Если ИменаСтраницФормы = "МотивацияЗП" Тогда 
				СортироватьПоПодразделению = Истина;
			КонецЕсли;
		КонецЕсли;
		
		//Аверсон ЕАЕ 29.09.2021 СВФР-008097
		Если ИсключатьДекретников <> Неопределено Тогда
			ФормированиеСпискаРаботников.ИсключитьДекретников = ИсключатьДекретников;	
		КонецЕсли;
		//Аверсон СВФР-008097
		
		//Аверсон ЕАЕ 22.07.2025 СВФР-016305
		ФормированиеСпискаРаботников.ИсключитьТолькоСОсвобожденнойСтавкой = ИсключатьТолькоСОсвобожденнойСтавкой;
		//Аверсон СВФР-016305
		
		ФормированиеСпискаРаботников.ЗаполнитьНачальныеНастройки(,ИзменениеТарифнойСтавки,СортироватьПоПодразделению, ИменаСтраницФормы); //Аверсон ЕАЕ 15.10.2021 СВФР-008217 параметр ИменаСтраницФормы
		
		СтруктураНедоступныхОтборов = Новый Структура;
		Если ИмяРегистра = "РаботникиОрганизаций" Тогда
			Если ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Количество() = 0 Тогда 
				
				ФормированиеСпискаРаботников.ЗаполнитьНачальныеНастройки();
				
			КонецЕсли;
			// Переданную организацию пропишем независимо от сохраненных ранее настроек отбора
			Если ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Найти("ОбособленноеПодразделение") = Неопределено Тогда
				ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Добавить("ОбособленноеПодразделение")
			КонецЕсли;
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.ОбособленноеПодразделение.Установить(Организация,);
			
			//Островская Татьяна 17.12.2013 № 16983
			
			Если Организация.ИНН = "100765738" Тогда
				ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
				ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Работник.Значение = ТекПользователь.ГруппаСотрудника;
				ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Работник.Использование = Истина;
			КонецЕсли;
			//Островская Татьяна 17.12.2013 № 16983
			
			ФормированиеСпискаРаботников.ПостроительОтчета.Параметры.Вставить("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
			
			//Островская Татьяна 23.01.2014 № 17064
			СписокВакансий = Новый СписокЗначений;
			СписокВакансий.Добавить("Вакансия");
			СписокВакансий.Добавить("вакансия");
			СписокВакансий.Добавить("ВАКАНСИЯ");
			СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
			СписокВакансий.Добавить("вакансия 1 1");
			ФормированиеСпискаРаботников.ПостроительОтчета.Параметры.Вставить("Наименование",СписокВакансий);
			//Островская Татьяна 23.01.2014 № 17064
			СтруктураНедоступныхОтборов.Вставить("ОбособленноеПодразделение");
		КонецЕсли;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Если ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Найти("Подразделение") = Неопределено Тогда
				ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Добавить("Подразделение")
			КонецЕсли;
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.Значение = Подразделение;
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.Использование = Истина;
			//толик		ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.ВидСравнения = ВидСравнения.ВИерархии;
			ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.ВидСравнения = ВидСравнения.ВИерархии;  //отображается как "ВГруппе"
			//ФормированиеСпискаРаботников.ПостроительОтчета.Отбор.Подразделение.ВидСравнения = ВидСравнения.Равно;
			
			Если НЕ РольДоступна("ЗапретИзмененияОтбораПодразделения") Тогда //СВЭЙ 21.06.2024 КВВ СВФР-012992
				СтруктураНедоступныхОтборов.Вставить("Подразделение");
			КонецЕсли;
		КонецЕсли;
		
		// Теперь откроем подготовленную форму
		Форма = ФормированиеСпискаРаботников.ПолучитьФорму("ФормаНастройки",Владелец);
		Форма.мСтруктураНедоступныхОтборов = СтруктураНедоступныхОтборов;
		Если Реквизиты <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Форма,Реквизиты);
		КонецЕсли;
		
		Если ИменаСтраницФормы = Неопределено Тогда // страницу дополнительных данных не показываем
			Форма.ЭлементыФормы.ПанельСтраницы.Свертка = РежимСверткиЭлементаУправления.Низ;
		Иначе
			УдаляемыеСтраницы = Новый Массив;
			Страницы = Форма.ЭлементыФормы.ПанельСтраницы.Страницы;
			Для каждого СтраницаПанели Из Страницы Цикл
				Если СтраницаПанели.Имя <> ИменаСтраницФормы Тогда
					УдаляемыеСтраницы.Добавить(СтраницаПанели);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтраницаПанели Из УдаляемыеСтраницы Цикл
				Страницы.Удалить(Страницы.Индекс(СтраницаПанели))
			КонецЦикла;
		КонецЕсли;
		//О.Т. Аверсон 12.07.2016 № 1311
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетОтОбратного
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.РасчетОтОбратного Тогда 
				Форма.ЭлементыФормы.ВключатьВалютныхСотрудников.Видимость = Истина;
			иначе
				Форма.ЭлементыФормы.ВключатьВалютныхСотрудников.Видимость = Ложь; 
				Форма.ЭтотОбъект.ВключатьВалютныхСотрудников = Ложь;
			КонецЕсли;
		КонецЦикла;	
		//О.Т. Аверсон 12.07.2016 № 1311
		
		//Аверсон 21.07.2020 КВВ СВФР-006327 (
		Если Лев(ТипЗнч(Владелец.ЭтотОбъект),8) = "Документ" //Аверсон 07.09.2020 КВВ СВФР-006529 
			И (ТипЗнч(Владелец.ДокументОбъект) = Тип("ДокументОбъект.СведенияОЗаработкеРаботниковДПУПоСотр") 
			ИЛИ 
			(Метаданные.НайтиПоПолномуИмени("Документ.СведенияОЗаработкеРаботниковДПУПоСотр2024") <> Неопределено 
			И
			ТипЗнч(Владелец.ДокументОбъект) = Тип("ДокументОбъект.СведенияОЗаработкеРаботниковДПУПоСотр2024"))) Тогда //СВЭЙ 24.01.2024 КВВ СВФР-012080
			
			Форма.ЭлементыФормы.ТолькоИнвалиды.Видимость = Истина;
			Форма.ЭлементыФормы.БезИнвалидов.Видимость = Истина;
		Иначе
			Форма.ЭлементыФормы.ТолькоИнвалиды.Видимость = Ложь;
			Форма.ЭлементыФормы.БезИнвалидов.Видимость = Ложь;
			Форма.ЭтотОбъект.ТолькоИнвалиды = Ложь;
			Форма.ЭтотОбъект.БезИнвалидов = Ложь;
		КонецЕсли;
		//Аверсон 21.07.2020 КВВ СВФР-006327 )
		
		//Аверсон ЕАЕ 14.07.2021 СВФР-007834
		Форма.ЭлементыФормы.ЗаПериод.Видимость = ЭтоПремии;
		//Аверсон СВФР-007834
		
		//СВЭЙ 11.02.2024 КВВ СВФР-012275 (
		Если Лев(ТипЗнч(Владелец.ЭтотОбъект),8) = "Документ"  
			И ТипЗнч(Владелец.ДокументОбъект) = Тип("ДокументОбъект.СведенияОДоходахФизлиц2024") Тогда
			Форма.ЭлементыФормы.ЗаПериод.Видимость = Ложь; 
			Форма.ЭлементыФормы.ВключатьВалютныхСотрудников.Видимость = Ложь; 
			Форма.ЭтотОбъект.ВключатьВалютныхСотрудников = Ложь;
			Форма.ЭлементыФормы.ИсключитьДекретников.Видимость = Ложь;
			Форма.ЭлементыФормы.ИсключитьБЛПоБеременностиИРодам.Видимость = Ложь; 
			Форма.ЭлементыФормы.ВключатьВалютныхСотрудников1.Видимость = Ложь;
		КонецЕсли;
		//СВЭЙ 11.02.2024 КВВ СВФР-012275 )
		
		//Аверсон ЕАЕ 10.05.2024 СВФР-012983
		ЭтоВиток = (Организация.ИНН = "100194961");
		Форма.ЭлементыФормы.ИсключатьПринятыхПосле.Видимость = ЭтоПремии И ЭтоВиток;
		Форма.ЭлементыФормы.ИсключатьПринятыхПослеДата.Видимость = ЭтоПремии И ЭтоВиток;
		//Аверсон СВФР-012983
		
		//Аверсон ЕАЕ 22.07.2025 СВФР-016305
		ВидимостьФлага = (Организация.ИНН = "806000046" И ИсключатьДекретников = Истина);
		Форма.ЭлементыФормы.ИсключитьТолькоСОсвобожденнойСтавкой.Видимость = ВидимостьФлага;
		//Аверсон СВФР-016305
		
		Форма.ОткрытьМодально();
		
	КонецПроцедуры  // ОткрытьФормуОтбораСпискаРаботников()
	
	// Открывает для выбора список доков ЗарплатаКВыплатеОрганизаций конкретной организации
	//
	// Параметры
	//  Элемент - поле ввода, в котором выбирается платежная ведомость 
	//  СтандартнаяОбработка - булево, признак стандартной обработки события
	//  Организация - СправочникСсылка.Организации, организация ведости которой надо выбрать
	//  СпособыВыплатыЗарплаты - ПеречислениеСсылка.СпособыВыплатыЗарплаты - дополнительное ограничение на список ведомостей
	//
	Процедура ОткрытьФормуВыбораПлатежныхВедомостейОрганизации(Элемент, СтандартнаяОбработка, Организация, СпособыВыплатыЗарплаты) Экспорт
		
		СтандартнаяОбработка  = Ложь;
		
		ФормаВыбора = Документы.ЗарплатаКВыплатеОрганизаций.ПолучитьФормуВыбора(, Элемент);
		
		ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;	
		
		ФормаВыбора.Отбор.Организация.ВидСравнения	= ВидСравнения.Равно;
		ФормаВыбора.Отбор.Организация.Значение		= Организация;
		ФормаВыбора.Отбор.Организация.Использование	= Истина;
		
		ФормаВыбора.Отбор.СпособВыплаты.ВидСравнения	= ВидСравнения.Равно;
		ФормаВыбора.Отбор.СпособВыплаты.Значение		= СпособыВыплатыЗарплаты;
		ФормаВыбора.Отбор.СпособВыплаты.Использование	= Истина;
		
		ФормаВыбора.Открыть();
		
		
	КонецПроцедуры // ОткрытьФормуВыбораКассовыхПлатежныхВедомостейОрганизации()
	
	// Обеспечивает подбор данных по сотруднику
	// подбираются подразделение и должность
	// Параметры:
	//	Форма - форма в которой производится подбор данных
	//	ЭлементФормы - элементы формы в которой производится подбор данных
	//	Физлицо
	//
	// ВозвращаемоеЗначение - строка таблицы значений или Неопределено, 
	// если подбор данных не состоялся
	// Поля строки таблицы значений:
	//		ПодразделениеОрганизации
	//		Должность
	//
	Функция ПодборДанныхПоФизлицу(Форма, ЭлементФормы, Физлицо, Организация, ДатаСобытия, ПредлагатьВыбор = Ложь) Экспорт
		
		Запрос = Новый Запрос();
		
		
		Запрос.УстановитьПараметр("Физлицо", Физлицо);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("парамДатаСобытия", ДатаСобытия);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПодразделениеОрганизации,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
		|		ИНАЧЕ РаботникиОрганизации.Должность
		|	КОНЕЦ КАК Должность,
		|	РаботникиОрганизации.Сотрудник.Наименование КАК СотрудникНаименование,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Наименование
		|	КОНЕЦ КАК ПодразделениеОрганизацииНаименование,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Наименование
		|		ИНАЧЕ РаботникиОрганизации.Должность.Наименование
		|	КОНЕЦ КАК ДолжностьНаименование
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|		&парамДатаСобытия,
		|		Сотрудник.Физлицо = &Физлицо
		|			И Сотрудник.Организация = &Организация) КАК РаботникиОрганизации
		|
		|УПОРЯДОЧИТЬ ПО
		|	РаботникиОрганизации.Период";
		
		НаборыДанных = Запрос.Выполнить().Выгрузить();
		
		Если НаборыДанных.Количество() = 0 Тогда
			// Если не нашли данных - ничего не делаем
			Возврат Неопределено;
		ИначеЕсли НаборыДанных.Количество() = 1 Тогда
			//если запись единственная, вернем ее
			Возврат НаборыДанных[0];
		ИначеЕсли ПредлагатьВыбор Тогда
			// предложим выбрать из списка если записей больше одной и предлагать выбор
			СписокНаборовДанных = Новый СписокЗначений;
			Для Каждого Строка Из НаборыДанных Цикл
				СписокНаборовДанных.Добавить(Строка, Строка.СотрудникНаименование + " (" + Строка.ПодразделениеОрганизацииНаименование + ", " + Строка.ДолжностьНаименование + ")");
			КонецЦикла;
			ВыбранныйНаборДанных = Форма.ВыбратьИзСписка(СписокНаборовДанных, ЭлементФормы);
			Если ВыбранныйНаборДанных = Неопределено Тогда
				Возврат Неопределено;
			Иначе
				Возврат ВыбранныйНаборДанных.Значение;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецФункции // ПодборДанныхПоФизлицу()
	
	Процедура ОткрытьФормуВыбораСотрудника(Владелец, Ключ, ЗакрыватьПриВыборе, ДатаСреза, СтандартнаяОбработка = Неопределено, ТекущееЗначение = Неопределено) Экспорт
		
		СтандартнаяОбработка = Ложь;
		
		Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуВыбора(, Владелец, Ключ);
		
		Форма.ДатаСреза 					= ДатаСреза;
		Форма.ПараметрВыборГруппИЭлементов	= ИспользованиеГруппИЭлементов.Элементы;
		Форма.РежимВыбора					= Истина;
		Форма.ЗакрыватьПриВыборе			= ЗакрыватьПриВыборе;
		
		Если ТекущееЗначение <> Неопределено Тогда
			Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
				Форма.ПараметрТекущаяСтрока		= ТекущееЗначение;
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				Запрос = Новый Запрос;
				
				Запрос.УстановитьПараметр("Физлицо",					ТекущееЗначение);
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СотрудникиОрганизаций.Ссылка,
				|	ВЫБОР
				|		КОГДА СотрудникиОрганизаций.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)))
				|			ТОГДА ВЫБОР
				|					КОГДА СотрудникиОрганизаций.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)
				|						ТОГДА 1
				|					ИНАЧЕ 2
				|				КОНЕЦ
				|		ИНАЧЕ 3
				|	КОНЕЦ КАК Порядок
				|ИЗ
				|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				|ГДЕ
				|	((НЕ СотрудникиОрганизаций.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)))
				|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
				|	И СотрудникиОрганизаций.Физлицо = &Физлицо
				|
				|УПОРЯДОЧИТЬ ПО
				|	Порядок";
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Форма.ПараметрТекущаяСтрока	= Выборка.Ссылка;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("Массив") Тогда
				Форма.мМассивВыбранныхЗначений = ТекущееЗначение;
				
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке("Неверный тип параметра: " + ТипЗнч(ТекущееЗначение));
				
			КонецЕсли;
		КонецЕсли;
		//Островская Татьяна 13.05.2014 № 17355
		//СписокДоговоров = Новый СписокЗначений;
		//СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий);
		//СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор);
		//СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Контракт);
		//
		//Форма.Отбор.ВидДоговора.ВидСравнения	= ВидСравнения.ВСписке;
		//Форма.Отбор.ВидДоговора.Использование	= Истина;
		//Форма.Отбор.ВидДоговора.Значение		= СписокДоговоров;
		
		Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.НеРавно;
		Форма.Отбор.ВидДоговора.Использование = Истина;
		Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий;
		
		//установим отборы
		ГоловнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
			Форма.Отбор.Организация.Установить(ГоловнаяОрганизация);
			Форма.Отбор.Организация.Использование = ЗначениеЗаполнено(ГоловнаяОрганизация);
		КонецЕсли;
		//Островская Татьяна 13.05.2014 № 17355
		Форма.Отбор.ВидЗанятости.ВидСравнения = ВидСравнения.НеРавно;
		Форма.Отбор.ВидЗанятости.Использование = Истина;
		Форма.Отбор.ВидЗанятости.Значение = Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство;
		
		Форма.Открыть();
		
	КонецПроцедуры // ОткрытьФормуВыбораСотрудника()
	
	// Процедура открывает форму выбора сотрудников организации
	// Параметры:
	//	Владелец 			- владелец формы
	//	Ключ 				- ключ, ссылка на документ из которого открывается форма
	//	ЗакрыватьПриВыборе 	- Булево
	//	ДатаСреза 			- дата, передается в форму для получения доп. данных по сотруднику на эту дату
	//	ГоловнаяОрганизация - головная организация
	//	КогоПодбирать 		- 0-всех, 1 - только по трудовым договорам, 2 - только договора ГПХ
	//	СтандартнаяОбработка- Булево
	//	ТекущееЗначение 	- ссылка на элемент, на котором необходимо спозиционироваться при открытии формы
	//
	Процедура ОткрытьФормуВыбораСотрудникаОрганизации(Владелец, Ключ, ЗакрыватьПриВыборе, ДатаСреза, ГоловнаяОрганизация = Неопределено, КогоВыбирать = 0, СтандартнаяОбработка = Неопределено, ТекущееЗначение = Неопределено, НеВыбиратьГруппы = Истина, НеВнСовм = Истина, ТекЗначСотрудника = Неопределено) Экспорт   //Аверсон 20.08.2019 КВВ СВФР-004658 (НеВнСовм) //СВЭЙ 26.12.2023 КВВ СВФР-012031 (ТекЗначСотрудника) 
		
		СтандартнаяОбработка = Ложь; 
		
		//Аверсон ЕАЕ 15.06.2021 СВФР-007714
		//Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуВыбора(, Владелец, Ключ);
		Если ТипЗнч(Ключ) = Тип("ДокументСсылка.ЗарплатаКВыплатеОрганизаций") Тогда
			Форма = Справочники.СотрудникиОрганизаций.ПолучитьФорму("ФормаВыбораЛицевыеСчета", Владелец, Ключ);
		Иначе
			Форма = Справочники.СотрудникиОрганизаций.ПолучитьФормуВыбора(, Владелец, Ключ);
		КонецЕсли;
		//Аверсон СВФР-007714
		
		Форма.ДатаСреза 					= ДатаСреза;
		Форма.ПараметрВыборГруппИЭлементов	= ИспользованиеГруппИЭлементов.Элементы;
		Форма.РежимВыбора					= Истина;
		Форма.ЗакрыватьПриВыборе			= ЗакрыватьПриВыборе;
		//Островская Татьяна 16.12.2013 № 16983
		
		если ГоловнаяОрганизация.ИНН = "100765738" Тогда
			
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			форма.ЭлементыФормы.СправочникСписок.ТекущийРодитель = ТекПользователь.ГруппаСотрудника;
			
		КонецЕсли;
		//Островская Татьяна 16.12.2013 № 16983
		Если ТекущееЗначение <> Неопределено Тогда
			Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
				Форма.ПараметрТекущаяСтрока		= ТекущееЗначение;
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				//СВЭЙ 26.12.2023 КВВ СВФР-012031 (
				Если ТекЗначСотрудника <> Неопределено Тогда
					Форма.ПараметрТекущаяСтрока	= ТекЗначСотрудника;
				Иначе
					//СВЭЙ 26.12.2023 КВВ СВФР-012031 )
					
					Запрос = Новый Запрос;
					
					Запрос.УстановитьПараметр("Физлицо",				ТекущееЗначение);
					Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ГоловнаяОрганизация);
					Запрос.УстановитьПараметр("ДатаДок",				НачалоМесяца(ДатаСреза));//О.Т. Аверсон 11.04.2019 № 4231
					Запрос.УстановитьПараметр("НеВнСовм",				НеВнСовм);   //Аверсон 20.08.2019 КВВ СВФР-004658 (вн.совм)
					
					Запрос.Текст =
					"ВЫБРАТЬ
					|	СотрудникиОрганизаций.Ссылка,
					|	ВЫБОР
					//О.Т. Аверсон 11.04.2019 № 4231
					|	КОГДА ЕСТЬNULL(РаботникиОрганизаций.Период, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
					|		И ЕСТЬNULL(РаботникиОрганизаций.Период, ДАТАВРЕМЯ(1, 1, 1)) <= &ДатаДок
					|	ТОГДА 3
					//О.Т. Аверсон 11.04.2019 № 4231
					|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
					|			ТОГДА 1
					|		ИНАЧЕ 2
					|	КОНЕЦ КАК Порядок
					|ИЗ
					|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
					|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
					|	ПО СотрудникиОрганизаций.Ссылка = РаботникиОрганизаций.Сотрудник
					
					|ГДЕ
					|	ВЫБОР КОГДА &НеВнСовм    //Аверсон 20.08.2019 КВВ СВФР-004658 (вн.совм)
					|	ТОГДА(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
					|		 ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
					|   ИНАЧЕ СотрудникиОрганизаций.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)   //Аверсон 20.08.2019 КВВ СВФР-004658 (вн.совм)
					|   КОНЕЦ
					|	И СотрудникиОрганизаций.Физлицо = &Физлицо
					|	И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
					|
					|УПОРЯДОЧИТЬ ПО
					|	Порядок";
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Форма.ПараметрТекущаяСтрока	= Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;	
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("Массив") Тогда
				Форма.мМассивВыбранныхЗначений = ТекущееЗначение;
				
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке("Неверный тип параметра: " + ТипЗнч(ТекущееЗначение));
				
			КонецЕсли;
		КонецЕсли;
		
		//установим отборы
		Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
			Форма.Отбор.Организация.Установить(ГоловнаяОрганизация);
			Форма.Отбор.Организация.Использование = ЗначениеЗаполнено(ГоловнаяОрганизация);
		КонецЕсли;
		
		Если КогоВыбирать = 2 Тогда
			//выбор только договорников
			СписокДоговоров = Новый СписокЗначений;
			СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Подряда);
			СписокДоговоров.Добавить(Перечисления.ВидыДоговоровСФизЛицами.Авторский);
			Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.ВСписке;
			Форма.Отбор.ВидДоговора.Использование = Истина;
			Форма.Отбор.ВидДоговора.Значение	  = СписокДоговоров;
		ИначеЕсли КогоВыбирать = 1 Тогда
			//выбор только контракт
			Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.Равно;
			Форма.Отбор.ВидДоговора.Использование = Истина;
			Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.Контракт;
		ИначеЕсли КогоВыбирать = 0 Тогда
			//отбор по всем, исключим сотрудников упр. учета
			Форма.Отбор.ВидДоговора.ВидСравнения  = ВидСравнения.НеРавно;
			Форма.Отбор.ВидДоговора.Использование = Истина;
			Форма.Отбор.ВидДоговора.Значение	  = Перечисления.ВидыДоговоровСФизЛицами.ДоговорУправленческий;
			
			//(начало) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169
		ИначеЕсли КогоВыбирать = 4 Тогда
			//отбор по всем сотрудникам со смещенным рабочим годом отпуска
			СписокСотрудников = ПолучитьСписокСотрудниковСоСмещеннымРабочимГодомОтпуска( Владелец );
			Форма.Отбор.Ссылка.ВидСравнения  = ВидСравнения.ВСписке;
			Форма.Отбор.Ссылка.Использование = Истина;
			Форма.Отбор.Ссылка.Значение	  = СписокСотрудников;
			//(конец) добавлено Кухарчуком Д.Я. 14.09.18, Задача СВФР-002169
			
		КонецЕсли;
		
		Форма.Открыть();
		
	КонецПроцедуры // ОткрытьФормуВыбораСотрудникаОрганизации()
	
	
	// Открывает форму выбора перерассчитываемого документа
	//
	// Владелец - элемент формы
	//
	// СтандартнаяОбработка - флаг стандартной обработки события НачалоВыбора
	//
	// ДокументПерерасчет - ссылка на документ, для которого подбирается перерассчитываемый документ
	//
	// Ключ - ключ уникальности открываемой формы
	//
	// 
	Процедура ОткрытьФормуВыбораПерерассчитываемогоДокумента(Владелец, СтандартнаяОбработка, ДокументПерерасчет, Ключ = Неопределено) Экспорт
		
		ИмяДокумента = ДокументПерерасчет.Метаданные().Имя;
		ФормаВыбора = Документы[ИмяДокумента].ПолучитьФормуВыбора(, Владелец, Ключ);
		
		ФормаВыбора.Отбор.Организация.Использование	= Истина;
		ФормаВыбора.Отбор.Организация.ВидСравнения 	= ВидСравнения.Равно;
		ФормаВыбора.Отбор.Организация.Значение	 	= ДокументПерерасчет.Организация;
		
		ФормаВыбора.Отбор.ПериодРегистрации.Использование	= Истина;
		ФормаВыбора.Отбор.ПериодРегистрации.ВидСравнения 	= ВидСравнения.Меньше;
		ФормаВыбора.Отбор.ПериодРегистрации.Значение	 	= ДокументПерерасчет.ПериодРегистрации;
		
		ФормаВыбора.Открыть();
		СтандартнаяОбработка = Ложь;
		
	КонецПроцедуры
	
	// проставляет в строку табличной части или реквизит формы полученные данные по Сотруднику
	//
	Процедура ПроставитьДанныеСтроки(Сотрудник, ДатаСобытия, ЭлементФормы) Экспорт
		
		Запрос = Новый Запрос();
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("парамДатаСобытия", ДатаСобытия);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
		|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
		|	КОНЕЦ КАК ПодразделениеОрганизации,
		|	ВЫБОР
		|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &парамДатаСобытия
		|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ТОГДА РаботникиОрганизации.ДолжностьЗавершения
		|		ИНАЧЕ РаботникиОрганизации.Должность 
		|	КОНЕЦ КАК Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&парамДатаСобытия, Сотрудник = &Сотрудник) КАК РаботникиОрганизации";
		
		Запрос.Текст = ТекстЗапроса;
		НаборыДанных = Запрос.Выполнить().Выгрузить();
		
		Если НаборыДанных.Количество() = 0 Тогда
			// Если не нашли данных - ничего не делаем
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы) = Тип("ТабличноеПоле") Тогда
			
			// поле ПодразделениеОрганизации есть не во всех табличных частях
			Если ЭлементФормы.Колонки.Найти("ПодразделениеОрганизации") <> Неопределено Тогда
				ЭлементФормы.ТекущаяСтрока.ПодразделениеОрганизации = НаборыДанных[0].ПодразделениеОрганизации;
			КонецЕсли;
			
			// поле Должность есть не во всех табличных частях
			Если ЭлементФормы.Колонки.Найти("Должность") <> Неопределено Тогда
				ЭлементФормы.ТекущаяСтрока.Должность = НаборыДанных[0].Должность;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецПроцедуры // ПроставитьДанныеСтроки()
	
	// процедура устанавливает текущую строку в табличных полях формы 
	// объекта, связанных с табличными частями объекта
	// предположения:
	// все табличные части и соответсвующие им табличные поля - одноименны
	// все "синхронизируемые" табличные части имеют колонку с одинаковым 
	// именем по которой ведется синхронизация
	// 
	// Параметры:
	// 	Форма - форма объекта
	//  Объект - объект данных
	//  Элемент - элемнт формы в котором возникла активизация строки
	//  СинхронизируемыеТабличныеЧасти - соответствие с 
	//  			элементами, соответствующими синхронизируемым табличным полям
	//  ИмяКолонки - имя колнки синхронизации
	Процедура СинхронизироватьСтроки(Форма, Объект, Элемент, СинхронизируемыеТабличныеЧасти, ИмяКолонки ) Экспорт
		
		Если Элемент.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Имя = Элемент.Имя;
		Если СинхронизируемыеТабличныеЧасти[ Имя ] Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлементСоответствия Из СинхронизируемыеТабличныеЧасти Цикл
			
			Если ЭлементСоответствия.Ключ = Имя Тогда 
				Продолжить;
			КонецЕсли;
			
			Попытка
				СтрокаТЧ = Объект[ЭлементСоответствия.Ключ].Найти( Элемент.ТекущиеДанные[ ИмяКолонки ], ИмяКолонки );
			Исключение
				СтрокаТЧ = Форма[ЭлементСоответствия.Ключ].Найти( Элемент.ТекущиеДанные[ ИмяКолонки ], ИмяКолонки );
			КонецПопытки;
			
			Если СтрокаТЧ <> Неопределено Тогда
				
				//+ СВЭЙ 14.03.19 КДЯ СВФР-004085
				ТекСтрока = Форма.ЭлементыФормы[ ЭлементСоответствия.Ключ ].ТекущаяСтрока;
				
				Если ТекСтрока = Неопределено ИЛИ ТекСтрока[ ИмяКолонки ] <> СтрокаТЧ[ ИмяКолонки ] Тогда
					//- СВЭЙ 14.03.19 КДЯ СВФР-004085
					
					//+ СВЭЙ 14.03.19 КДЯ СВФР-004085
					//СинхронизируемыеТабличныеЧасти[ЭлементСоответствия.Ключ] = Истина;
					//- СВЭЙ 14.03.19 КДЯ СВФР-004085
					//+ СВЭЙ 14.03.19 КДЯ СВФР-004085
					ПредФлаг = СинхронизируемыеТабличныеЧасти[ЭлементСоответствия.Ключ];
					СинхронизируемыеТабличныеЧасти[ЭлементСоответствия.Ключ] = Истина;
					//- СВЭЙ 14.03.19 КДЯ СВФР-004085
					Форма.ЭлементыФормы[ ЭлементСоответствия.Ключ ].ТекущаяСтрока = СтрокаТЧ;
					СинхронизируемыеТабличныеЧасти[ ЭлементСоответствия.Ключ ] = ПредФлаг;
					
					//+ СВЭЙ 14.03.19 КДЯ СВФР-004085
				КонецЕсли;  // ТекСтрока = Неопределено ИЛИ ТекСтрока[ИмяКолонки] <> СтрокаТЧ[ИмяКолонки]
				//- СВЭЙ 14.03.19 КДЯ СВФР-004085
				
			КонецЕсли; // СтрокаТЧ <> Неопределено
			
		КонецЦикла;
		
	КонецПроцедуры  //  СинхронизироватьСтроки
	
	// Процедура строит список должностей (или подразделений), по штатному расписанию организации.
	//  
	// Параметры: 
	//  Режим - строка, может принимать значения: "Должность" или "ПодразделениеОрганизации"
	//			определяет, что именно будет выбирать пользователь
	//  ДолжностьИлиПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций или   
	//          СправочникСсылка.ДолжностиОрганизаций, второе значение в текущей строке т.п.
	//
	// Возвращаемое значение
	//  нет
	//
	Функция ВыбратьИзШтатногоРасписанияОрганизации(Режим, Организация, ДолжностьИлиПодразделениеОрганизации) Экспорт
		
		Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(ДолжностьИлиПодразделениеОрганизации) Тогда
			Возврат Новый СписокЗначений;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", Организация);
		Запрос.УстановитьПараметр("ДолжностьИлиПодразделениеОрганизации", ДолжностьИлиПодразделениеОрганизации);
		
		Если Режим = "ПодразделениеОрганизации" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации КАК Элемент,
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ЭлементНаименование
			|ИЗ
			|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(, ПодразделениеОрганизации.Владелец = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
			|ГДЕ
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность = &ДолжностьИлиПодразделениеОрганизации
			|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
			
		ИначеЕсли Режим = "Должность" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность КАК Элемент,
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.Должность.Наименование КАК ЭлементНаименование
			|ИЗ
			|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(, ПодразделениеОрганизации.Владелец = &Владелец) КАК ШтатноеРасписаниеОрганизацийСрезПоследних
			|ГДЕ
			|	ШтатноеРасписаниеОрганизацийСрезПоследних.ПодразделениеОрганизации = &ДолжностьИлиПодразделениеОрганизации
			|	И ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок > 0";
			
		Иначе
			Возврат Новый СписокЗначений
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Новый СписокЗначений
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		СписокВыбора = Новый СписокЗначений();
		
		Пока Выборка.Следующий() Цикл
			СписокВыбора.Добавить(Выборка.Элемент, Выборка.ЭлементНаименование);	
		КонецЦикла;
		
		Возврат СписокВыбора
		
	КонецФункции // ВыбратьИзШтатногоРасписанияОрганизации
	
	// Процедура строит список должностей (или подразделений), по кадровому плану предприятия.
	//
	// Параметры: 
	//  Режим - строка, может принимать значения: "Должность" или "Подразделение" определяет, что именно 
	//			будет выбирать пользователь
	//  ДолжностьИлиПодразделение - СправочникСсылка.Подразделения или СправочникСсылка.Должности,  
	//			второе значение в текущей строке т.п.
	//
	// Возвращаемое значение
	//  нет
	//
	Функция ВыбратьИзКадровогоПланаПредприятия(Режим, ДолжностьИлиПодразделение) Экспорт
		
		Запрос = Новый Запрос;
		
		Если НЕ ЗначениеЗаполнено(ДолжностьИлиПодразделение) Тогда
			Возврат Новый СписокЗначений 
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДолжностьИлиПодразделение",ДолжностьИлиПодразделение);
		
		Если Режим = "Подразделение" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КадровыйПланСрезПоследних.Подразделение КАК Элемент,
			|	КадровыйПланСрезПоследних.Подразделение.Наименование КАК ЭлементНаименование
			|ИЗ
			|	РегистрСведений.КадровыйПлан.СрезПоследних(
			|		,
			|		Должность В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				ДолжностиОрганизаций.Ссылка
			|			ИЗ
			|				Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
			|			ГДЕ
			|				ДолжностиОрганизаций.Должность = &ДолжностьИлиПодразделение)) КАК КадровыйПланСрезПоследних
			|ГДЕ
			|	КадровыйПланСрезПоследних.Количество > 0";
			
		ИначеЕсли Режим = "Должность" Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДолжностиОрганизаций.Ссылка КАК Элемент,
			|	ДолжностиОрганизаций.Наименование КАК ЭлементНаименование
			|ИЗ
			|	Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
			|ГДЕ
			|	ДолжностиОрганизаций.Должность В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				КадровыйПланСрезПоследних.Должность
			|			ИЗ
			|				РегистрСведений.КадровыйПлан.СрезПоследних(, Подразделение = &ДолжностьИлиПодразделение) КАК КадровыйПланСрезПоследних
			|			ГДЕ
			|				КадровыйПланСрезПоследних.Количество > 0)";
			
		Иначе
			Возврат Новый СписокЗначений 
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Новый СписокЗначений 
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		СписокВыбора = Новый СписокЗначений();
		
		Пока Выборка.Следующий() Цикл
			СписокВыбора.Добавить(Выборка.Элемент, Выборка.ЭлементНаименование);	
		КонецЦикла;
		
		Возврат СписокВыбора;
		
	КонецФункции // ВыбратьИзКадровогоПланаПредприятия
	
	// Функция возвращаект сведения о позиции штатного расписания на выбранную дату
	// для измерений Подразделение и Должность
	//
	Функция СведенияОПозицииШтатногоРасписания(Период, Подразделение, Должность) Экспорт
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ДатаАктуальности",	Период);
		Запрос.УстановитьПараметр("Подразделение",		Подразделение);
		Запрос.УстановитьПараметр("Должность",			Должность);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.КоличествоСтавок,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.МинимальнаяТарифнаяСтавка,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.МаксимальнаяТарифнаяСтавка,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВидТарифнойСтавки,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ГрафикРаботы,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ВалютаТарифнойСтавки,
		|	ШтатноеРасписаниеОрганизацийСрезПоследних.ОсобыеУсловияТруда
		|ИЗ
		|	РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(
		|		&ДатаАктуальности,
		|		ПодразделениеОрганизации = &Подразделение
		|			И Должность = &Должность) КАК ШтатноеРасписаниеОрганизацийСрезПоследних";
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецФункции // СведенияОПозицииШтатногоРасписания()
	
	// Возвращает структуру с данными по выбранному работнику 
	// Парамтеры:
	//	Сотрудник - ссылка на справочник Сотрудники
	//	ВыбираемыеДанные - строка, признак того, что нужно выбирать данные из регистров Работники и/или УчетЗаработкаРаботников
	//
	// Возвращаемое значение:
	//  Структура с элементами
	//		всегда присуствует 
	//			Физлицо
	//		если ВыбираемыеДанные содержит строку "Работники"
	//			Подразделение
	//			Должность
	//			ГрафикРаботы
	//			ЗанимаемыхСтавок
	//		если ВыбираемыеДанные содержит строку "УчетЗаработкаРаботников"
	//			СпособОтраженияВУпрУчете
	//			УчетНачисленийПоОрганизации
	//
	Функция СведенияПоВыбранномуРаботнику(Сотрудник, ВыбираемыеДанные) Экспорт
		
		// Получим данные из среза последних
		ВыбиратьРаботники = Найти(ВыбираемыеДанные, "Работники") > 0;
		ВыбиратьУчетЗаработкаРаботников = Найти(ВыбираемыеДанные, "УчетЗаработкаРаботников") > 0;
		
		Запрос = Новый Запрос;
		Если ВыбиратьРаботники Тогда
			Если Не ВыбиратьУчетЗаработкаРаботников Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	&Сотрудник КАК Сотрудник,
				|	Работники.ПодразделениеОрганизации,
				|	Работники.Должность,
				|	Работники.ГрафикРаботы,
				|	Работники.ЗанимаемыхСтавок
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|		,
				|		Физлицо В
				|			(ВЫБРАТЬ
				|				СотрудникиОрганизаций.Физлицо
				|			ИЗ
				|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				|			ГДЕ
				|				СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК Работники";
				
			Иначе
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	&Сотрудник КАК Сотрудник,
				|	Работники.Подразделение как ПодразделениеОрганизации,
				|	Работники.Должность,
				|	Работники.ГрафикРаботы,
				|	Работники.ЗанимаемыхСтавок,
				|	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете,
				|	УчетЗаработкаРаботников.УчетНачисленийПоОрганизации
				|ИЗ
				|	РегистрСведений.Работники.СрезПоследних(
				|		,
				|		Физлицо В
				|			(ВЫБРАТЬ
				|				СотрудникиОрганизаций.Физлицо
				|			ИЗ
				|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				|			ГДЕ
				|				СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК Работники
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников.СрезПоследних(
				|		,
				|		Физлицо В
				|			(ВЫБРАТЬ
				|				СотрудникиОрганизаций.Физлицо
				|			ИЗ
				|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				|			ГДЕ
				|				СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК УчетЗаработкаРаботников
				|		ПО (ИСТИНА)";
			КонецЕсли;
			
		ИначеЕсли ВыбиратьУчетЗаработкаРаботников Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	&Сотрудник КАК Сотрудник,
			|	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете,
			|	УчетЗаработкаРаботников.УчетНачисленийПоОрганизации
			|ИЗ
			|	РегистрСведений.УчетЗаработкаРаботников.СрезПоследних(
			|		,
			|		Физлицо В
			|			(ВЫБРАТЬ
			|				СотрудникиОрганизаций.Физлицо
			|			ИЗ
			|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|			ГДЕ
			|				СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК УчетЗаработкаРаботников";
			
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	&Сотрудник КАК Сотрудник,
			|	Работники.ФизЛицо
			|ИЗ
			|	РегистрСведений.Работники.СрезПоследних(
			|		,
			|		Физлицо В
			|			(ВЫБРАТЬ
			|				СотрудникиОрганизаций.Физлицо
			|			ИЗ
			|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|			ГДЕ
			|				СотрудникиОрганизаций.Ссылка = &Сотрудник)) КАК Работники";
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
			
		Иначе
			Если ВыбиратьРаботники Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ВыбранныйНаборДанных = Новый Структура("Сотрудник, Подразделение, Должность, ГрафикРаботы, ЗанимаемыхСтавок");
				ВыбранныйНаборДанных.Сотрудник			= Выборка.Сотрудник;
				ВыбранныйНаборДанных.Подразделение		= Выборка.ПодразделениеОрганизации;
				ВыбранныйНаборДанных.Должность			= Выборка.Должность;
				ВыбранныйНаборДанных.ГрафикРаботы		= Выборка.ГрафикРаботы;
				ВыбранныйНаборДанных.ЗанимаемыхСтавок	= Выборка.ЗанимаемыхСтавок;
				Если ВыбиратьУчетЗаработкаРаботников Тогда
					ВыбранныйНаборДанных.Вставить("СпособОтраженияВУпрУчете",		Выборка.СпособОтраженияВУпрУчете);
					ВыбранныйНаборДанных.Вставить("УчетНачисленийПоОрганизации",	Выборка.УчетНачисленийПоОрганизации);
				КонецЕсли;
				
			ИначеЕсли ВыбиратьУчетЗаработкаРаботников Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ВыбранныйНаборДанных = Новый Структура("Сотрудник, СпособОтраженияВУпрУчете, УчетНачисленийПоОрганизации");
				ВыбранныйНаборДанных.Сотрудник						= Выборка.Сотрудник;
				ВыбранныйНаборДанных.СпособОтраженияВУпрУчете		= Выборка.СпособОтраженияВУпрУчете;
				ВыбранныйНаборДанных.УчетНачисленийПоОрганизации	= Выборка.УчетНачисленийПоОрганизации;
				
			Иначе
				ВыбранныйНаборДанных = Новый Структура("Сотрудник");
				ВыбранныйНаборДанных.Сотрудник	= Выборка.Сотрудник;
				
			КонецЕсли;
			
			Возврат ВыбранныйНаборДанных;
			
		КонецЕсли;
		
	КонецФункции // СведенияПоВыбранномуРаботнику
	
	// Открывает форму ввода на основании
	//
	Процедура ВводРегламентированногоКадровогоДокументаНаОсновании(Основание) Экспорт
		
		Если Основание = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФормаВводаНаОсновании = Обработки.ВводРегламентированныхКадровыхДокументовНаОсновании.ПолучитьФорму();
		
		ФормаВводаНаОсновании.Основание = Основание;
		
		ФормаВводаНаОсновании.Открыть();
		
	КонецПроцедуры
	
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПОЛУЧЕНИЕ СПИСКОВ ЗНАЧЕНИЙ ПЕРЕЧИСЛЕНИЙ

// Возвращает список отпусков, регистрируемых документом Отпуска организации
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления 
//
Функция ПолучитьСписокОтпусковОрганизации() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодный);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускЕжегодныйЧасть);	
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебныйНеоплачиваемый);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация);
	//Островская Татьяна 13.02.2014 № 17105
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.БольничныйПоБеременностиИРодам);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком);
	//Островская Татьяна 13.02.2014 № 17105
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоКоллДоговору); //О.Т. Аверсон 29.11.2018 № 2833
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоИнициативеНанимателя); //Аверсон 11.05.2020 КВВ СВФР-005970
	
	//Аверсон 22.03.2021 КВВ СВФР-007331 (	
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоСостояниюЗдоровья);
	СписокСпособов.Добавить(Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускСамоизоляция); 
	//Аверсон 22.03.2021 КВВ СВФР-007331 )
	
	Возврат СписокСпособов
	
КонецФункции

// Возвращает список причин отсутствия, регистрируемых документом Отсутствие организации
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления 
//
Функция ПолучитьСписокПрочихСостоянийРаботника() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.Работает);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.Простой);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.ВынужденныйПрогул);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.ГосударственныеОбязанности);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.Прогулы);
	СписокСпособов.Добавить(Перечисления.СостоянияРаботникаОрганизации.ДополнительныеВыходныеДниОплачиваемые);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокПрочихСостоянийРаботника()

// Функция возвращает массив видов времени, 
// по идексам этого массива происходит упорядочивание видов времени в сводном табеле
//
Функция ПолучитьМассивУпорядоченныхВидовИспользованияРабочегоВремени() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторИспользованияРабочегоВремени.Ссылка
	|ИЗ
	|	Справочник.КлассификаторИспользованияРабочегоВремени КАК КлассификаторИспользованияРабочегоВремени
	|ГДЕ
	|	(НЕ КлассификаторИспользованияРабочегоВремени.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|			ТОГДА 1
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.РаботаНочныеЧасы)
	|			ТОГДА 2
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|			ТОГДА 3
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|			ТОГДА 4
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|			ТОГДА 5
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные)
	|			ТОГДА 6
	|		КОГДА КлассификаторИспользованияРабочегоВремени.Ссылка = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
	|			ТОГДА 7
	|		ИНАЧЕ 100
	|	КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ПолучитьМассивДляУпорядочивания()

////////////////////////////////////////////////////////////////////////////////
// КАДРОВАЯ НУМЕРАЦИЯ

// имитация кадрового нумератора для поддержки учетной политики по персоналу с 
// кадровым нумераторм документов
Процедура ПриУстановкеНовогоНомераКадровогоДокумента(СтандартнаяОбработка, ЕдиныйНумераторКадровыхДокументов, Номер, Префикс, Дата) Экспорт
	// проверка учетной политики
	Если ЕдиныйНумераторКадровыхДокументов Тогда
		СписокДокументов = Новый Массив;
		СписокДокументов.Добавить("КадровоеПеремещениеОрганизаций");
		СписокДокументов.Добавить("ПриемНаРаботуВОрганизацию");
		СписокДокументов.Добавить("УвольнениеИзОрганизаций");
		//О.Т. Аверсон 02.02.2016
		СписокДокументов.Добавить("ИзменениеПериодическихРеквизитов");
		СписокДокументов.Добавить("УстановкаКоличестваДнейОтпуска");
		//О.Т. Аверсон 02.02.2016
		
		НовыйНомер = ПолучитьНовыйНомерПоДокументам(СписокДокументов, Префикс, Дата);
		
		Если НовыйНомер <> "" Тогда
			СтандартнаяОбработка = Ложь;
			Номер = НовыйНомер;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает новый номер документа по переданному списку документов и префиксу
// Фактически, имитирует работу нумератора докумнетов
// Если в информационной базе еще нет документов вернет пустую стоку
//
// Только для документов со строковым номером!
//
// Параметры:
//	СписокДокументов - массив строк с именами документов
//  Префикс - строка, префикс номера
//  Дата - дата документа
// Возвращаемое значение:
//  строка
//
Функция ПолучитьНовыйНомерПоДокументам(СписокДокументов, Префикс, Дата)
	
	Запрос = Новый Запрос;
	
	Результат = Новый СписокЗначений;
	
	Для Каждого Документ из СписокДокументов Цикл
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номер
		|ИЗ
		|	Документ."+Документ+"
		|ГДЕ Номер Подобно """ + Префикс + "%""
		|  И Дата>=&НачалоГода
		|  И Дата<=&КонецГода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		
		// поддерживается "годовая" кадровая нумерация
		Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Дата));
		Запрос.УстановитьПараметр("КонецГода", КонецГода(Дата));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Добавить(Выборка.Номер);
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		// выберем наибольший
		Результат.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		// получим новый номер
		НовыйНомер = ПолучитьСледующийНомер(СокрП(Результат[0].Значение));
	Иначе
		НовыйНомер = "";
	КонецЕсли;
	Возврат НовыйНомер;
	
КонецФункции		

// Увеличивает номер в переданной строке на 1
//
// Параметры
//  ПоследнийНомер - строка - представляет собой номер (документа, табельный и т.п.)
//
// Возвращаемое значение:
//  строка  - следующий по порядку номер
//
Функция ПолучитьСледующийНомер(ПоследнийНомер, Знач ДлинаНомера = 0) Экспорт
	
	Если ДлинаНомера = 0 Тогда
		ДлинаНомера = СтрДлина(ПоследнийНомер);
	КонецЕсли;
	Если ДлинаНомера = 0 Тогда
		Возврат "1"
	КонецЕсли;
	СчетчикСимв = ДлинаНомера;
	Пока СчетчикСимв > 0 Цикл
		Если Не ПустаяСтрока(Сред(ПоследнийНомер, СчетчикСимв, 1)) и ОбщегоНазначения.ТолькоЦифрыВСтроке(Сред(ПоследнийНомер, СчетчикСимв, 1)) Тогда
			СчетчикСимв = СчетчикСимв - 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СчетчикСимв = ДлинаНомера Тогда
		НомерЧисловой = 1
	Иначе
		НомерЧисловой = Число(Сред(ПоследнийНомер, СчетчикСимв + 1));
	КонецЕсли;
	Если НомерЧисловой < Pow(10, ДлинаНомера - СчетчикСимв) - 1 Тогда
		СледующийНомер = НомерЧисловой + 1;
	Иначе
		СледующийНомер = НомерЧисловой;
	КонецЕсли;
	НовыйНомер = Лев(ПоследнийНомер,  СчетчикСимв) + Формат(СледующийНомер,"ЧЦ=" + (ДлинаНомера - СчетчикСимв) + "; ЧВН=; ЧГ=0");
	Возврат НовыйНомер
	
КонецФункции // ПолучитьСледующийНомер()

// проверяет уникальность кадрового номера
// если не уникален - возвращает Ложь
// Параметры:
//  ЕдиныйНумераторКадровыхДокументов - сведения по учетной политике ведения единого нумератора кадровых документов
//  Организация
//  Номер - проверяемый номер
//  Дата - дата проверяемого документа
//  Ссылка - ссылка на документ, для которого выпорлняется проверка
//
// Вызывает исключение! 
// Должна использоваться, например, при записи документа.
//
Функция ПроверкаУникальностиНомераКадровогоДокумента(ЕдиныйНумераторКадровыхДокументов, Номер, Дата, Ссылка) Экспорт
	// проверка учетной политики
	Если ЕдиныйНумераторКадровыхДокументов Тогда
		СписокДокументов = Новый Массив;
		СписокДокументов.Добавить("КадровоеПеремещениеОрганизаций");
		СписокДокументов.Добавить("ПриемНаРаботуВОрганизацию");
		СписокДокументов.Добавить("УвольнениеИзОрганизаций");
		//О.Т. Аверсон 02.02.2016
		СписокДокументов.Добавить("ИзменениеПериодическихРеквизитов");
		СписокДокументов.Добавить("УстановкаКоличестваДнейОтпуска");
		//О.Т. Аверсон 02.02.2016
		
		Если Не ПроверкаУникальностиНомераПоДокументам(СписокДокументов, Номер, Дата, Ссылка) Тогда
			ВызватьИсключение "Неуникальный номер кадрового документа! (" + Номер + ")";
		КонецЕсли;
	КонецЕсли;
КонецФункции

// используется в ПроверкаУникальностиНомераКадровогоДокумента
Функция ПроверкаУникальностиНомераПоДокументам(СписокДокументов, Номер, Дата, Ссылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Номер", Номер);
	// поддерживается "годовая" кадровая нумерация
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(Дата));
	
	Для Каждого Документ из СписокДокументов Цикл
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номер
		|ИЗ
		|	Документ." + Документ+"
		|ГДЕ Ссылка <> &Ссылка 
		|   И Номер = &Номер 
		|   И Дата>=&НачалоГода 
		|   И Дата<=&КонецГода";
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ВЫПОЛНЯЮЩИЕ ВКЛЮЧЕНИЕ (ВЫКЛЮЧЕНИЕ) ПОДДЕРЖКИ ВНУТРЕННОГО СОВМЕСТИТЕЛЬСТВА

// Функция проверяет можно ли отключать поддержку внутренних совместителей
//
// Параметры: 
//	нет
//
// Возвращаемое значение:
//  Истина - можно отключать, Ложь - существуют внутренние совместители =>
//	отключение невозможно
//
// Описание:
//  Проверяет, есть ли внутренние совместители 
//
Функция МожноОтключатьВнутреннееСовместительство(Организация) Экспорт
	
	#Если Клиент Тогда
		Состояние("Выполняется поиск внутренних совместителей");
	#КонецЕсли
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|ГДЕ
	|	РаботникиОрганизации.Организация = &Организация
	|	И РаботникиОрганизации.Сотрудник.ВидЗанятости = &ВнутреннееСовместительство");
	
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("ВнутреннееСовместительство",	Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Отключить поддержку внутреннего совместительства невозможно, т.к. некоторые работники заняты на нескольких местах работы!");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // МожноОтключатьВнутреннееСовместительство()

// Проверяет уникальность кадровых номеров
//
// Параметры: 
//	Организация - нет
//
// Возвращаемое значение:
//  Истина	- если номера уникальные
//	Ложь	- если номера не уникальные
Функция НомераКадровыхДокументовУникальны(Организация) Экспорт
	
	Отказ = Ложь;
	ЗаголовокСообщения = "Изменить поддержку внутреннего совместительства невозможно, т.к. следующие номера используются в нескольких кадровых документах:";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыОрганизации.Номер
	|ИЗ
	|	(ВЫБРАТЬ
	|		ГОД(КадровоеПеремещениеОрганизаций.Дата) КАК Год,
	|		КадровоеПеремещениеОрганизаций.Номер КАК Номер,
	|		КадровоеПеремещениеОрганизаций.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
	|	ГДЕ
	|		КадровоеПеремещениеОрганизаций.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГОД(ПриемНаРаботуВОрганизацию.Дата),
	|		ПриемНаРаботуВОрганизацию.Номер,
	|		ПриемНаРаботуВОрганизацию.Ссылка
	|	ИЗ
	|		Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
	|	ГДЕ
	|		ПриемНаРаботуВОрганизацию.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГОД(УвольнениеИзОрганизаций.Дата),
	|		УвольнениеИзОрганизаций.Номер,
	|		УвольнениеИзОрганизаций.Ссылка
	|	ИЗ
	|		Документ.УвольнениеИзОрганизаций КАК УвольнениеИзОрганизаций
	|	ГДЕ
	|		УвольнениеИзОрганизаций.Организация = &Организация) КАК ДокументыОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГОД(КадровоеПеремещениеОрганизаций.Дата) КАК Год,
	|			КадровоеПеремещениеОрганизаций.Номер КАК Номер,
	|			КадровоеПеремещениеОрганизаций.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.КадровоеПеремещениеОрганизаций КАК КадровоеПеремещениеОрганизаций
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ГОД(ПриемНаРаботуВОрганизацию.Дата),
	|			ПриемНаРаботуВОрганизацию.Номер,
	|			ПриемНаРаботуВОрганизацию.Ссылка
	|		ИЗ
	|			Документ.ПриемНаРаботуВОрганизацию КАК ПриемНаРаботуВОрганизацию
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ГОД(УвольнениеИзОрганизаций.Дата),
	|			УвольнениеИзОрганизаций.Номер,
	|			УвольнениеИзОрганизаций.Ссылка
	|		ИЗ
	|			Документ.УвольнениеИзОрганизаций КАК УвольнениеИзОрганизаций) КАК ВсеКадровыеДокументы
	|		ПО ДокументыОрганизации.Год = ВсеКадровыеДокументы.Год
	|			И ДокументыОрганизации.Номер = ВсеКадровыеДокументы.Номер
	|			И ДокументыОрганизации.Ссылка <> ВсеКадровыеДокументы.Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация",Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьОбОшибке(Выборка.Номер,Отказ,ЗаголовокСообщения);
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции //НомераКадровыхДокументовУникальны()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ, ПРОВЕРЯЮЩИЕ ВОЗМОЖНОСТЬ ОТКЛЮЧЕНИЯ ВЕДЕНИЯ УЧЕТА В ВАЛЮТЕ

// Функция проверяет можно ли отключать поддержку учета в валюте
//
// Параметры: 
//	нет
//
// Возвращаемое значение:
//  Истина - можно отключать, Ложь - нельзя отключать, есть начисления (удержания) в валюте
//
// Описание:
//  Проверяет, есть действующие начисления (удержания) в валюте 
//
Функция МожноОтключатьУчетВВалюте(Организация) Экспорт
	
	ПарамРубли = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ПарамРубли.Пустая() Тогда
		ПарамРубли = Справочники.Валюты.НайтиПоКоду("810")
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеНачисленияРаботниковОрганизаций.Валюта1 <> &ПарамРубли
	|	И ПлановыеНачисленияРаботниковОрганизаций.Валюта1 <> &ПарамПустаяВалюта
	|	И ПлановыеНачисленияРаботниковОрганизаций.Валюта2 <> &ПарамПустаяВалюта
	|	И ПлановыеНачисленияРаботниковОрганизаций.Валюта3 <> &ПарамПустаяВалюта
	|	И ПлановыеНачисленияРаботниковОрганизаций.Валюта4 <> &ПарамПустаяВалюта
	|	И ПлановыеНачисленияРаботниковОрганизаций.Действие <> &ПарамПрекратить
	|	И ПлановыеНачисленияРаботниковОрганизаций.Организация = &парамОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПлановыеУдержанияРаботниковОрганизаций.ФизЛицо
	|ИЗ
	|	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций КАК ПлановыеУдержанияРаботниковОрганизаций
	|ГДЕ
	|	ПлановыеУдержанияРаботниковОрганизаций.Валюта <> &ПарамРубли
	|	И ПлановыеУдержанияРаботниковОрганизаций.Валюта <> &ПарамПустаяВалюта
	|	И ПлановыеУдержанияРаботниковОрганизаций.Действие <> &ПарамПрекратить
	|	И ПлановыеУдержанияРаботниковОрганизаций.Организация <> &парамОрганизация";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ПарамОрганизация", Организация);
	Запрос.УстановитьПараметр("ПарамРубли", ПарамРубли);
	Запрос.УстановитьПараметр("ПарамПустаяВалюта", Справочники.Валюты.ПустаяСсылка());	
	Запрос.УстановитьПараметр("ПарамПрекратить", Перечисления.ВидыДействияСНачислением.Прекратить);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции //МожноОтключатьУчетВВалюте

// Получение значения учетной политики по персоналу
// Если в соответствии по данной организации нет политики - пытаемся прочитать ее из ИБ, если там нет - 
// она добавляется как политика по умолчанию
//
// Параметры:
//
//  УчетнаяПолитика - соответствие политик по организациям
//  Организация - ссылка на организацию
//  ИмяПолитики - название получаемой учетной политики
//
Функция ЗначениеУчетнойПолитикиПоПерсоналуОрганизации(УчетнаяПолитика, Организация, ИмяПолитики) Экспорт
	
	Если УчетнаяПолитика[Организация] = Неопределено Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ПроверкаПериодовНачисления, ЛОЖЬ) КАК ПроверкаПериодовНачисления,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ПоддержкаВнутреннегоСовместительства, ЛОЖЬ) КАК ПоддержкаВнутреннегоСовместительства,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ЕдиныйНумераторКадровыхДокументов, ЛОЖЬ) КАК ЕдиныйНумераторКадровыхДокументов,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ПроверкаШтатногоРасписания, ЛОЖЬ) КАК ПроверкаШтатногоРасписания,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.РасчетЗарплатыОрганизацииПоОтветственным, ЛОЖЬ) КАК РасчетЗарплатыОрганизацииПоОтветственным,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ИспользуютсяНачисленияВВалюте, ЛОЖЬ) КАК ИспользуютсяНачисленияВВалюте,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.УпрощенныйУчетНДФЛ, ЛОЖЬ) КАК УпрощенныйУчетНДФЛ,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ПоказыватьТабельныеНомераВДокументах, ЛОЖЬ) КАК ПоказыватьТабельныеНомераВДокументах,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.УчетЗадолженностиПоМесяцам, ИСТИНА) КАК УчетЗадолженностиПоМесяцам,
		|	ЕСТЬNULL(УчетнаяПолитикаПоПерсоналуОрганизаций.ВыплатаАвансаПроцентом, ЛОЖЬ) КАК ВыплатаАвансаПроцентом
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
		|		ПО (ВЫБОР
		|				КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|					ТОГДА Организации.Ссылка
		|				ИНАЧЕ Организации.ГоловнаяОрганизация
		|			КОНЕЦ = УчетнаяПолитикаПоПерсоналуОрганизаций.Организация)
		|ГДЕ
		|	Организации.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УчетнаяПолитика.Вставить(Организация, 
			Новый Структура(
			"ПоддержкаВнутреннегоСовместительства,
			|ЕдиныйНумераторКадровыхДокументов,
			|ПроверкаШтатногоРасписания,
			|РасчетЗарплатыОрганизацииПоОтветственным,
			|УпрощенныйУчетНДФЛ,
			|ИспользуютсяНачисленияВВалюте,
			|ПоказыватьТабельныеНомераВДокументах,
			|УчетЗадолженностиПоМесяцам,
			|ПроверкаПериодовНачисления,
			|ВыплатаАвансаПроцентом",
			Выборка.ПоддержкаВнутреннегоСовместительства,
			Выборка.ЕдиныйНумераторКадровыхДокументов,
			Выборка.ПроверкаШтатногоРасписания,
			Выборка.РасчетЗарплатыОрганизацииПоОтветственным,
			Выборка.УпрощенныйУчетНДФЛ,
			Выборка.ИспользуютсяНачисленияВВалюте,
			Выборка.ПоказыватьТабельныеНомераВДокументах,
			Выборка.УчетЗадолженностиПоМесяцам,
			Выборка.ПроверкаПериодовНачисления,
			Выборка.ВыплатаАвансаПроцентом));
		Иначе 
			УчетнаяПолитика.Вставить(Организация, 
			Новый Структура(
			"ПоддержкаВнутреннегоСовместительства,
			|ЕдиныйНумераторКадровыхДокументов,
			|ПроверкаШтатногоРасписания,
			|РасчетЗарплатыОрганизацииПоОтветственным,
			|УпрощенныйУчетНДФЛ,
			|ИспользуютсяНачисленияВВалюте,
			|ПоказыватьТабельныеНомераВДокументах,
			|УчетЗадолженностиПоМесяцам,
			|ПроверкаПериодовНачисления,
			|ВыплатаАвансаПроцентом",
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Ложь,
			Истина,
			Ложь,
			Ложь));
		КонецЕсли;		
	КонецЕсли;
	
	Возврат УчетнаяПолитика[Организация][ИмяПолитики];
	
КонецФункции // ЗначениеУчетнойПолитикиПоПерсоналуОрганизации()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ формирования движений кадровых документов по плановым начислениям работников организации

Функция СформироватьЗапросПоПлановымНачислениям(ДанныеОНачислениях, ПроверкаШтатногоРасписания, ДанныеПлановыхНачислений = Неопределено,Регистратор = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДанныеОНачислениях", ДанныеОНачислениях);
	Если Регистратор <> Неопределено Тогда
		ПоВалюте = " ТЧНачисления.Показатель1ВВалюте, ";
	иначе
		ПоВалюте = "";
	КонецЕсли;
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|	ТЧНачисления.Ссылка,
	|	ТЧНачисления.Сотрудник, "+
	//толик временные перемещения 
	?(ДанныеОНачислениях.Колонки.Найти("Временно")=Неопределено, "Ложь Как Временно, Ложь КАК ДругоеПеремещение, ", "ТЧНачисления.Временно Как Временно, ТЧНачисления.ДругоеПеремещение Как ДругоеПеремещение, ")+"
	|	ТЧНачисления.ПодразделениеОрганизации,
	|	ТЧНачисления.Должность,
	|	ТЧНачисления.ЗанимаемыхСтавок,
	|	ТЧНачисления.ГрафикРаботы,
	|	ТЧНачисления.Период,
	|	ТЧНачисления.Действие,
	|	ТЧНачисления.ПериодЗавершения,
	|	ТЧНачисления.ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета,
	|	ТЧНачисления.ВидРасчетаИзмерение,
	|	ТЧНачисления.СпособРасчета,
	|	ТЧНачисления.ЗачетОтработанногоВремени,
	|	ТЧНачисления.ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ПроизвольнаяФормулаРасчета,
	|	ТЧНачисления.Показатель1,"+ПоВалюте+"
	|	ТЧНачисления.Валюта1,
	|	ТЧНачисления.ТарифныйРазряд1,
	|	ТЧНачисления.Показатель2,
	|	ТЧНачисления.Валюта2,
	|	ТЧНачисления.ТарифныйРазряд2,
	|	ТЧНачисления.Показатель3,
	|	ТЧНачисления.Валюта3,
	|	ТЧНачисления.ТарифныйРазряд3,
	|	ТЧНачисления.Показатель4,
	|	ТЧНачисления.Валюта4,
	|	ТЧНачисления.ТарифныйРазряд4,
	|	ТЧНачисления.Показатель5,
	|	ТЧНачисления.Валюта5,
	|	ТЧНачисления.ТарифныйРазряд5,
	|	ТЧНачисления.Показатель6,
	|	ТЧНачисления.Валюта6,
	|	ТЧНачисления.ТарифныйРазряд6
	|ПОМЕСТИТЬ ВТДанныеОНачислениях
	|ИЗ
	|	&ДанныеОНачислениях КАК ТЧНачисления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";
	Запрос.Выполнить();	
	
	// временная таблица с результатами проверки штатного расписания
	Если ПроверкаШтатногоРасписания Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
		//толик
		//|	ВЫБОР
		//|		КОГДА ТЧНачисления.ЗанимаемыхСтавок <> 1
		//|			ТОГДА ИСТИНА
		//|		КОГДА ТЧНачисления.ЗачетОтработанногоВремени
		//|				И ТЧНачисления.Действие В (ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать), ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить))
		//|			ТОГДА ВЫБОР
		//|					КОГДА ТЧНачисления.СпособРасчета В (ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням), ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам))
		//|							И ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Месячная)
		//|						ТОГДА ВЫБОР
		//|								КОГДА ТЧНачисления.ТребуетВводаТарифногоРазряда
		//|									ТОГДА ВЫБОР
		//|											КОГДА РазмерТарифныхСтавок.Размер < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											КОГДА РазмерТарифныхСтавок.Размер > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											ИНАЧЕ ИСТИНА
		//|										КОНЕЦ
		//|								ИНАЧЕ ВЫБОР
		//|										КОГДА ТЧНачисления.Показатель1 < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										КОГДА ТЧНачисления.Показатель1 > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										ИНАЧЕ ИСТИНА
		//|									КОНЕЦ
		//|							КОНЕЦ
		//|					КОГДА ТЧНачисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке)
		//|							И ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Дневная)
		//|						ТОГДА ВЫБОР
		//|								КОГДА ТЧНачисления.ТребуетВводаТарифногоРазряда
		//|									ТОГДА ВЫБОР
		//|											КОГДА РазмерТарифныхСтавок.Размер < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											КОГДА РазмерТарифныхСтавок.Размер > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											ИНАЧЕ ИСТИНА
		//|										КОНЕЦ
		//|								ИНАЧЕ ВЫБОР
		//|										КОГДА ТЧНачисления.Показатель1 < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										КОГДА ТЧНачисления.Показатель1 > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										ИНАЧЕ ИСТИНА
		//|									КОНЕЦ
		//|							КОНЕЦ
		//|					КОГДА ТЧНачисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке)
		//|							И ШтатноеРасписаниеОрганизаций.ВидТарифнойСтавки = ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.Часовая)
		//|						ТОГДА ВЫБОР
		//|								КОГДА ТЧНачисления.ТребуетВводаТарифногоРазряда
		//|									ТОГДА ВЫБОР
		//|											КОГДА РазмерТарифныхСтавок.Размер < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											КОГДА РазмерТарифныхСтавок.Размер > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|												ТОГДА ЛОЖЬ
		//|											ИНАЧЕ ИСТИНА
		//|										КОНЕЦ
		//|								ИНАЧЕ ВЫБОР
		//|										КОГДА ТЧНачисления.Показатель1 < ШтатноеРасписаниеОрганизаций.МинимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										КОГДА ТЧНачисления.Показатель1 > ШтатноеРасписаниеОрганизаций.МаксимальнаяТарифнаяСтавка
		//|											ТОГДА ЛОЖЬ
		//|										ИНАЧЕ ИСТИНА
		//|									КОНЕЦ
		//|							КОНЕЦ
		//|					ИНАЧЕ ИСТИНА
		//|				КОНЕЦ
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ КАК РазмерСоответствуетШТР
		|	ИСТИНА КАК РазмерСоответствуетШТР
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписания
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТЧНачисления.НомерСтроки КАК НомерСтроки,
		|		ТЧНачисления.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|		ТЧНачисления.Должность КАК Должность,
		|		ТЧНачисления.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
		|		ТЧНачисления.ТарифныйРазряд1 КАК ТарифныйРазряд1,
		|		ТЧНачисления.ТарифныйРазряд2 КАК ТарифныйРазряд2,
		|		ТЧНачисления.ТарифныйРазряд3 КАК ТарифныйРазряд3,
		|		ТЧНачисления.ТарифныйРазряд4 КАК ТарифныйРазряд4,
		|		ТЧНачисления.ТарифныйРазряд5 КАК ТарифныйРазряд5,
		|		ТЧНачисления.ТарифныйРазряд6 КАК ТарифныйРазряд6,
		|		ТЧНачисления.Показатель1 КАК Показатель1,"+ПоВалюте+"
		|		ТЧНачисления.ЗачетОтработанногоВремени КАК ЗачетОтработанногоВремени,
		|		ТЧНачисления.ТребуетВводаТарифногоРазряда КАК ТребуетВводаТарифногоРазряда,
		|		ТЧНачисления.СпособРасчета КАК СпособРасчета,
		|		ТЧНачисления.Действие КАК Действие,
		|		МАКСИМУМ(ШтатноеРасписаниеОрганизаций.Период) КАК ПериодШтР,
		|		МАКСИМУМ(РазмерТарифныхСтавок.Период) КАК ПериодРазряда
		|	ИЗ
		|		ВТДанныеОНачислениях КАК ТЧНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
		|			ПО ТЧНачисления.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
		|				И ТЧНачисления.Должность = ШтатноеРасписаниеОрганизаций.Должность
		|				И ТЧНачисления.Период >= ШтатноеРасписаниеОрганизаций.Период
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
		|			ПО ТЧНачисления.Период >= РазмерТарифныхСтавок.Период
		|				И ТЧНачисления.ТарифныйРазряд1 = РазмерТарифныхСтавок.ТарифныйРазряд
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТЧНачисления.ПодразделениеОрганизации,
		|		ТЧНачисления.Должность,
		|		ТЧНачисления.ЗанимаемыхСтавок,
		|		ТЧНачисления.ТарифныйРазряд1,
		|		ТЧНачисления.ТарифныйРазряд2,
		|		ТЧНачисления.ТарифныйРазряд3,
		|		ТЧНачисления.ТарифныйРазряд4,
		|		ТЧНачисления.ТарифныйРазряд5,
		|		ТЧНачисления.ТарифныйРазряд6,
		|		ТЧНачисления.Показатель1,"+ПоВалюте+"
		|		ТЧНачисления.ЗачетОтработанногоВремени,
		|		ТЧНачисления.ТребуетВводаТарифногоРазряда,
		|		ТЧНачисления.СпособРасчета,
		|		ТЧНачисления.Действие,
		|		ТЧНачисления.НомерСтроки) КАК ТЧНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
		|		ПО ТЧНачисления.ПериодШтР = ШтатноеРасписаниеОрганизаций.Период
		|			И ТЧНачисления.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
		|			И ТЧНачисления.Должность = ШтатноеРасписаниеОрганизаций.Должность
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерТарифныхСтавок КАК РазмерТарифныхСтавок
		|		ПО ТЧНачисления.ПериодРазряда = РазмерТарифныхСтавок.Период
		|			И (ТЧНачисления.ТарифныйРазряд1 = РазмерТарифныхСтавок.ТарифныйРазряд
		|				ИЛИ ТЧНачисления.ТарифныйРазряд2 = РазмерТарифныхСтавок.ТарифныйРазряд
		|				ИЛИ ТЧНачисления.ТарифныйРазряд3 = РазмерТарифныхСтавок.ТарифныйРазряд
		|				ИЛИ ТЧНачисления.ТарифныйРазряд4 = РазмерТарифныхСтавок.ТарифныйРазряд
		|				ИЛИ ТЧНачисления.ТарифныйРазряд5 = РазмерТарифныхСтавок.ТарифныйРазряд
		|				ИЛИ ТЧНачисления.ТарифныйРазряд6 = РазмерТарифныхСтавок.ТарифныйРазряд)
		|
		| СГРУППИРОВАТЬ ПО
		|ТЧНачисления.НомерСтроки //О.Т. Аверсон 26.09.2016 № 1463
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНачисления.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК РазмерСоответствуетШТР
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписания
		|ИЗ
		|	ВТДанныеОНачислениях КАК ТЧНачисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
	КонецЕсли;
	Запрос.Выполнить();	
	
	// временная таблица с данными плановых начислений по состоянию до изменения
	Если ДанныеПлановыхНачислений = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧНачисления.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТДанныеОНачислениях КАК ТЧНачисления
		|ГДЕ
		|	(ТЧНачисления.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
		|			ИЛИ ТЧНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить))";
		Если Запрос.Выполнить().Пустой() Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|	ТЧОсновныеНачисления.ВидРасчета КАК ПрежнийВидРасчета,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд1,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель1,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта1,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд2,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель2,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта2,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд3,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель3,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта3,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд4,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель4,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта4,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд5,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель5,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта5,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийТарифныйРазряд6,
			|	НЕОПРЕДЕЛЕНО КАК ПрежнийПоказатель6,
			|	НЕОПРЕДЕЛЕНО КАК ПрежняяВалюта6,
			|	НЕОПРЕДЕЛЕНО КАК КонфликтныйДокумент,
			|	НЕОПРЕДЕЛЕНО КАК ДатаДвижения
			|ПОМЕСТИТЬ ВТДанныеОПрежнихНачислениях
			|ИЗ
			|	ВТДанныеОНачислениях КАК ТЧОсновныеНачисления
			|ГДЕ
			|	(ТЧОсновныеНачисления.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
			|			ИЛИ ТЧОсновныеНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НомерСтроки";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыНачислений.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
			|	КОНЕЦ КАК ПрежнийВидРасчета,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд1
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд1,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель1Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель1
			|	КОНЕЦ КАК ПрежнийПоказатель1,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта1Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта1
			|	КОНЕЦ КАК ПрежняяВалюта1,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд2
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд2,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель2Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель2
			|	КОНЕЦ КАК ПрежнийПоказатель2,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта2Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта2
			|	КОНЕЦ КАК ПрежняяВалюта2,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд3
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд3,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель3Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель3
			|	КОНЕЦ КАК ПрежнийПоказатель3,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта3Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта3
			|	КОНЕЦ КАК ПрежняяВалюта3,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд4
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд4,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель4Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель4
			|	КОНЕЦ КАК ПрежнийПоказатель4,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта4Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта4
			|	КОНЕЦ КАК ПрежняяВалюта4,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд5
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд5,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель5Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель5
			|	КОНЕЦ КАК ПрежнийПоказатель5,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта5Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта5
			|	КОНЕЦ КАК ПрежняяВалюта5,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ТарифныйРазряд6
			|	КОНЕЦ КАК ПрежнийТарифныйРазряд6,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Показатель6Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Показатель6
			|	КОНЕЦ КАК ПрежнийПоказатель6,
			|	ВЫБОР
			|		КОГДА ДатыНачислений.Период >= ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|				И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Валюта6Завершения
			|		ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Валюта6
			|	КОНЕЦ КАК ПрежняяВалюта6,
			|	ПРЕДСТАВЛЕНИЕ(ПлановыеНачисленияРаботниковОрганизаций.Регистратор) КАК КонфликтныйДокумент,
			|	ДатыНачислений.ПериодНачислений КАК ДатаДвижения
			|ПОМЕСТИТЬ ВТДанныеОПрежнихНачислениях
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|		ТЧОсновныеНачисления.Период КАК Период,
			|		ТЧОсновныеНачисления.Сотрудник КАК Сотрудник,
			|		ВЫБОР
			|			КОГДА ТЧОсновныеНачисления.ВидРасчетаИзмерение = """"
			|				ТОГДА НЕОПРЕДЕЛЕНО
			|			ИНАЧЕ ТЧОсновныеНачисления.ВидРасчетаИзмерение
			|		КОНЕЦ КАК ВидРасчетаИзмерение,
			|		МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизаций.Период) КАК ПериодНачислений
			|	ИЗ
			|		ВТДанныеОНачислениях КАК ТЧОсновныеНачисления
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
			|			ПО ТЧОсновныеНачисления.Период >= ПлановыеНачисленияРаботниковОрганизаций.Период
			|				И ТЧОсновныеНачисления.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
			|				И (ВЫБОР
			|					КОГДА ТЧОсновныеНачисления.ВидРасчетаИзмерение = """"
			|						ТОГДА НЕОПРЕДЕЛЕНО
			|					ИНАЧЕ ТЧОсновныеНачисления.ВидРасчетаИзмерение
			|				КОНЕЦ = ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение)
			|	ГДЕ
			|		(ТЧОсновныеНачисления.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать)
			|				ИЛИ ТЧОсновныеНачисления.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Изменить))
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ТЧОсновныеНачисления.НомерСтроки,
			|		ТЧОсновныеНачисления.ВидРасчета,
			|		ТЧОсновныеНачисления.Период,
			|		ТЧОсновныеНачисления.Сотрудник,
			|		ВЫБОР
			|			КОГДА ТЧОсновныеНачисления.ВидРасчетаИзмерение = """"
			|				ТОГДА НЕОПРЕДЕЛЕНО
			|			ИНАЧЕ ТЧОсновныеНачисления.ВидРасчетаИзмерение
			|		КОНЕЦ) КАК ДатыНачислений
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
			|		ПО ДатыНачислений.ПериодНачислений = ПлановыеНачисленияРаботниковОрганизаций.Период
			|			И ДатыНачислений.ВидРасчетаИзмерение = ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение
			|			И ДатыНачислений.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НомерСтроки";
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("ДанныеПлановыхНачислений", ДанныеПлановыхНачислений);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ТЧОсновныеНачисления.ПрежнийВидРасчета,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд1,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель1,
		|	ТЧОсновныеНачисления.ПрежняяВалюта1,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд2,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель2,
		|	ТЧОсновныеНачисления.ПрежняяВалюта2,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд3,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель3,
		|	ТЧОсновныеНачисления.ПрежняяВалюта3,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд4,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель4,
		|	ТЧОсновныеНачисления.ПрежняяВалюта4,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд5,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель5,
		|	ТЧОсновныеНачисления.ПрежняяВалюта5,
		|	ТЧОсновныеНачисления.ПрежнийТарифныйРазряд6,
		|	ТЧОсновныеНачисления.ПрежнийПоказатель6,
		|	ТЧОсновныеНачисления.ПрежняяВалюта6,
		|	ТЧОсновныеНачисления.КонфликтныйДокумент,
		|	ТЧОсновныеНачисления.ДатаДвижения
		|ПОМЕСТИТЬ ВТДанныеОПрежнихНачислениях
		|ИЗ
		|	&ДанныеПлановыхНачислений КАК ТЧОсновныеНачисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	Запрос.Выполнить();	
	
	// временная таблица с описанием показателей
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный,
	|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.ТарифнаяСтавка КАК Показатель1ТарифнаяСтавка,
	|	Показатели2.Показатель.ТарифнаяСтавка КАК Показатель2ТарифнаяСтавка,
	|	Показатели3.Показатель.ТарифнаяСтавка КАК Показатель3ТарифнаяСтавка,
	|	Показатели4.Показатель.ТарифнаяСтавка КАК Показатель4ТарифнаяСтавка,
	|	Показатели5.Показатель.ТарифнаяСтавка КАК Показатель5ТарифнаяСтавка,
	|	Показатели6.Показатель.ТарифнаяСтавка КАК Показатель6ТарифнаяСтавка
	|ПОМЕСТИТЬ ВТПоказатели
	|ИЗ
	|	ВТДанныеОНачислениях КАК ТЧОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели1
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели2
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели3
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели4
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели5
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели6
	|		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧОсновныеНачисления.НомерСтроки,
	|	Показатели1.Показатель,
	|	Показатели2.Показатель,
	|	Показатели3.Показатель,
	|	Показатели4.Показатель,
	|	Показатели5.Показатель,
	|	Показатели6.Показатель,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки";		
	Запрос.Выполнить();	
	
	// в основном запросе собираем в единой выборке подготовленные ранее данные
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧНачисления.Ссылка,
	|	ТЧНачисления.НомерСтроки,
	|	ТЧНачисления.Сотрудник,
	|	ТЧНачисления.Период,
	|	ТЧНачисления.ПериодЗавершения,
	|	ТЧНачисления.Действие,
	|	ТЧНачисления.ДействиеЗавершения,
	|	ТЧНачисления.ВидРасчета,
	|	ТЧНачисления.ЗачетОтработанногоВремени,
	|	ТЧНачисления.СпособРасчета КАК СпособРасчета,
	|	ЕСТЬNULL(ТЧНачисления.ПроизвольнаяФормулаРасчета, ЛОЖЬ) КАК ПроизвольнаяФормулаРасчета,
	|	ЕСТЬNULL(ТЧНачисления.ЗачетОтработанногоВремени, ЛОЖЬ) КАК ОсновноеНачисление,
	|	ЕСТЬNULL(ТЧНачисления.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
	|	ТЧНачисления.ТарифныйРазряд1,
	|	ТЧНачисления.Показатель1,"+ПоВалюте+"
	|	ТЧНачисления.Валюта1,
	|	ТЧНачисления.ТарифныйРазряд2,
	|	ТЧНачисления.Показатель2,
	|	ТЧНачисления.Валюта2,
	|	ТЧНачисления.ТарифныйРазряд3,
	|	ТЧНачисления.Показатель3,
	|	ТЧНачисления.Валюта3,
	|	ТЧНачисления.ТарифныйРазряд4,
	|	ТЧНачисления.Показатель4,
	|	ТЧНачисления.Валюта4,
	|	ТЧНачисления.ТарифныйРазряд5,
	|	ТЧНачисления.Показатель5,
	|	ТЧНачисления.Валюта5,
	|	ТЧНачисления.ТарифныйРазряд6,
	|	ТЧНачисления.Показатель6,
	|	ТЧНачисления.Валюта6,
	//толик
	|	ТЧНачисления.Временно,
	|	ТЧНачисления.ДругоеПеремещение,
	//енд
	|	ДанныеШтатногоРасписания.РазмерСоответствуетШТР,
	|	ДанныеОПрежнихНачислениях.ПрежнийВидРасчета КАК ВидРасчетаЗавершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийВидРасчета.СпособРасчета КАК СпособРасчетаЗавершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд1 КАК ТарифныйРазряд1Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель1 КАК Показатель1Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта1 КАК Валюта1Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд2 КАК ТарифныйРазряд2Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель2 КАК Показатель2Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта2 КАК Валюта2Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд3 КАК ТарифныйРазряд3Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель3 КАК Показатель3Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта3 КАК Валюта3Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд4 КАК ТарифныйРазряд4Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель4 КАК Показатель4Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта4 КАК Валюта4Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд5 КАК ТарифныйРазряд5Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель5 КАК Показатель5Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта5 КАК Валюта5Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийТарифныйРазряд6 КАК ТарифныйРазряд6Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежнийПоказатель6 КАК Показатель6Завершения,
	|	ДанныеОПрежнихНачислениях.ПрежняяВалюта6 КАК Валюта6Завершения,
	|	ДанныеОПрежнихНачислениях.КонфликтныйДокумент,
	|	ДанныеОПрежнихНачислениях.ДатаДвижения,
	|	ЕСТЬNULL(Показатели.КоличествоПоказателей, 0) КАК КоличествоПоказателей,
	|	Показатели.Показатель1Предопределенный,
	|	Показатели.Показатель1Наименование,
	|	Показатели.Показатель1ТипПоказателя,
	|	Показатели.Показатель1ВозможностьИзменения,
	|	Показатели.Показатель2Предопределенный,
	|	Показатели.Показатель2Наименование,
	|	Показатели.Показатель2ТипПоказателя,
	|	Показатели.Показатель2ВозможностьИзменения,
	|	Показатели.Показатель3Предопределенный,
	|	Показатели.Показатель3Наименование,
	|	Показатели.Показатель3ТипПоказателя,
	|	Показатели.Показатель3ВозможностьИзменения,
	|	Показатели.Показатель4Предопределенный,
	|	Показатели.Показатель4Наименование,
	|	Показатели.Показатель4ТипПоказателя,
	|	Показатели.Показатель4ВозможностьИзменения,
	|	Показатели.Показатель5Предопределенный,
	|	Показатели.Показатель5Наименование,
	|	Показатели.Показатель5ТипПоказателя,
	|	Показатели.Показатель5ВозможностьИзменения,
	|	Показатели.Показатель6Предопределенный,
	|	Показатели.Показатель6Наименование,
	|	Показатели.Показатель6ТипПоказателя,
	|	Показатели.Показатель6ВозможностьИзменения,
	|	Показатели.Показатель1ТарифнаяСтавка,
	|	Показатели.Показатель2ТарифнаяСтавка,
	|	Показатели.Показатель3ТарифнаяСтавка,
	|	Показатели.Показатель4ТарифнаяСтавка,
	|	Показатели.Показатель5ТарифнаяСтавка,
	|	Показатели.Показатель6ТарифнаяСтавка,
	|	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	ДвойныеСтроки.КонфликтнаяСтрокаНомер КАК ДвойнаяСтрока
	|ИЗ
	|	ВТДанныеОНачислениях КАК ТЧНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеШтатногоРасписания КАК ДанныеШтатногоРасписания
	|		ПО ТЧНачисления.НомерСтроки = ДанныеШтатногоРасписания.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПрежнихНачислениях КАК ДанныеОПрежнихНачислениях
	|		ПО ТЧНачисления.НомерСтроки = ДанныеОПрежнихНачислениях.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказатели КАК Показатели
	|		ПО ТЧНачисления.НомерСтроки = Показатели.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧНачисления.НомерСтроки КАК НомерСтроки,
	|			МИНИМУМ(ТЧНачисления2.НомерСтроки) КАК КонфликтнаяСтрокаНомер
	|		ИЗ
	|			ВТДанныеОНачислениях КАК ТЧНачисления
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеОНачислениях КАК ТЧНачисления2
	|				ПО (ТЧНачисления.ВидРасчета = ТЧНачисления2.ВидРасчета
	|						ИЛИ ТЧНачисления.ВидРасчета.ЗачетОтработанногоВремени
	|							И ТЧНачисления2.ВидРасчета.ЗачетОтработанногоВремени)
	|					И ТЧНачисления.НомерСтроки < ТЧНачисления2.НомерСтроки
	|					И ТЧНачисления.Сотрудник = ТЧНачисления2.Сотрудник
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧНачисления.НомерСтроки) КАК ДвойныеСтроки
	|		ПО ТЧНачисления.НомерСтроки = ДвойныеСтроки.НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоНачисления()

Процедура СформироватьДвижениеПоПлановымНачислениям(Движение, ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса) Экспорт
	
	Движение.Организация = ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Если НЕ ВыборкаСтрокЗапроса.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение = ВыборкаСтрокЗапроса.ВидРасчета;
	КонецЕсли;
	
	СтрокаПолей = "Период,Сотрудник,Действие,ВидРасчета,ПериодЗавершения,ДействиеЗавершения,ВидРасчетаЗавершения";
	
	Если ВыборкаСтрокЗапроса.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		
		Для Сч = 1 По 6 Цикл
			Если ВыборкаСтрокЗапроса.ПроизвольнаяФормулаРасчета Тогда
				Если Сч <= ВыборкаСтрокЗапроса.КоличествоПоказателей Тогда
					Если ВыборкаСтрокЗапроса["Показатель" + Сч + "ЗапрашиватьПриКадровыхПеремещениях"]
						Или ВыборкаСтрокЗапроса.ОсновноеНачисление И ВыборкаСтрокЗапроса["Показатель" + Сч + "ТарифнаяСтавка"] Тогда
						СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + ",Валюта"+ Сч + ",ТарифныйРазряд"+ Сч;
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + ",Валюта"+ Сч;
				Если ВыборкаСтрокЗапроса.ТребуетВводаТарифногоРазряда Тогда
					СтрокаПолей = СтрокаПолей + ",ТарифныйРазряд"+ Сч;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//Аверсон 17.12.2025 ПСА СВФР-017531+++ 
	ЗаполнитьЗавершение = Истина;
	Если ТипЗнч(ВыборкаПоШапкеДокумента.Ссылка) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
		Если ВыборкаПоШапкеДокумента.Ссылка.НеВозобновлятьПлановыеНачисления
			или ВыборкаСтрокЗапроса.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Начать Тогда   
			ЗаполнитьЗавершение = Ложь;
			СтрокаПолей = СтрЗаменить(СтрокаПолей, ",ПериодЗавершения,ДействиеЗавершения,ВидРасчетаЗавершения", "");
		КонецЕсли;	
	КонецЕсли;
	Если ЗаполнитьЗавершение Тогда
	//+++Аверсон 17.12.2025 ПСА СВФР-017531	
	// Движения на дату завершения
	Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.ПериодЗавершения) И ВыборкаСтрокЗапроса.ДействиеЗавершения <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		
		Для Сч = 1 По 6 Цикл
			Если ВыборкаСтрокЗапроса.ПроизвольнаяФормулаРасчета Тогда
				Если Сч <= ВыборкаСтрокЗапроса.КоличествоПоказателей Тогда
					Если ВыборкаСтрокЗапроса["Показатель" + Сч + "ЗапрашиватьПриКадровыхПеремещениях"]
						Или ВыборкаСтрокЗапроса.ОсновноеНачисление И ВыборкаСтрокЗапроса["Показатель" + Сч + "ТарифнаяСтавка"] Тогда
						СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + "Завершения,Валюта"+ Сч + "Завершения,ТарифныйРазряд"+ Сч + "Завершения";
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтрокаПолей = СтрокаПолей + ",Показатель" + Сч + "Завершения,Валюта"+ Сч + "Завершения,ТарифныйРазряд"+ Сч + "Завершения";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаСтрокЗапроса, СтрокаПолей);
	
	//Аверсон 17.09.2021 КВВ СВФР-008080 (
	Если ТипЗнч(ВыборкаПоШапкеДокумента.Ссылка) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
		Если ВыборкаСтрокЗапроса.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Начать 
			и ЗаполнитьЗавершение Тогда //Аверсон 17.12.2025 ПСА СВФР-017531+++
			Если ЗначениеЗаполнено(ВыборкаСтрокЗапроса.Ссылка.ДатаОкончанияФакт) Тогда
				Движение.ПериодЗавершения = КонецДня(ВыборкаСтрокЗапроса.Ссылка.ДатаОкончанияФакт)+ 1;
			КонецЕсли;   
			
			//Аверсон 17.12.2025 ПСА СВФР-017531+++
			
			//+++Аверсон 17.12.2025 ПСА СВФР-017531
		КонецЕсли;
		
	КонецЕсли;
	//Аверсон 17.09.2021 КВВ СВФР-008080 )
	
КонецПроцедуры


Функция ПроверкаНаЛатинскиеБуквы(ИсходнаяСтрока)
	//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 2) (
	ЕстьЛатинскиеБуквы = Ложь;
	Для Сч = 1 по СтрДлина(ИсходнаяСтрока) Цикл
		Символ = НРег(Сред(ИсходнаяСтрока, Сч, 1));
		Если Найти("abcdefghijklmnopqrstuvwxyz", Символ) Тогда
			ЕстьЛатинскиеБуквы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьЛатинскиеБуквы;
	//СВЭЙ 12.11.2023 КВВ СВФР-011792 (пункт 2) )
КонецФункции


