
Процедура Печать(Имя) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.УплаченоВзносовНаППС.ПолучитьМакет("Печать");
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ОбластьИтог = Макет.ПолучитьОбласть("РаботникиИтог");
	ТабДок.Вывести(Область);
	// РаботникиОрганизации
	Область = Макет.ПолучитьОбласть("РаботникиОрганизацииШапка");
	ТабДок.Вывести(Область);
	СуммаИтог = 0;
	ОбластьРаботникиОрганизации = Макет.ПолучитьОбласть("РаботникиОрганизации");
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		ОбластьРаботникиОрганизации.Параметры.Заполнить(ТекСтрокаРаботникиОрганизации);
		СуммаИтог = СуммаИтог + ТекСтрокаРаботникиОрганизации.Результат;
		ТабДок.Вывести(ОбластьРаботникиОрганизации);
	КонецЦикла;
	// Подвал
	ОбластьИтог.Параметры.РезультатИтог = СуммаИтог;	
	ТабДок.Вывести(ОбластьИтог);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(); 	
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	СтруктураПечатныхФорм.Вставить("Макет",	"Макет");	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция Автозаполнение(ПостроительЗапроса = Неопределено) Экспорт
	ПостроительЗапроса.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПостроительЗапроса.Выполнить();
	
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	ВТСотрудники.Сотрудник,
	|	СУММА(ЕСНСведенияОДоходахППС.ППС) КАК ППС
	|ИЗ
	|	РегистрНакопления.ЕСНСведенияОДоходахППС КАК ЕСНСведенияОДоходахППС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокРаботников КАК ВТСотрудники
	|		ПО ЕСНСведенияОДоходахППС.ФизЛицо = ВТСотрудники.ФизЛицо
	|ГДЕ
	|	ЕСНСведенияОДоходахППС.Период МЕЖДУ &Период И &Период1
	|   И ВТСотрудники.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство) //Аверсон 22.07.2020 КВВ СВФР-006321
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСотрудники.Сотрудник";
	ПостроительЗапроса.УстановитьПараметр("Период",ПериодС);
	ПостроительЗапроса.УстановитьПараметр("Период1",ПериодПо);
	РезультатЗапроса = ПостроительЗапроса.Выполнить().Выгрузить();
	Для Каждого стр из РезультатЗапроса Цикл 
		СтрРаботникиОрганизации = РаботникиОрганизации.Добавить();
		СтрРаботникиОрганизации.Сотрудник = стр.Сотрудник;
		СтрРаботникиОрганизации.Результат = стр.ППС;
	КонецЦикла;

	
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УплаченоВзносовНаППС
	Движения.УплаченоВзносовНаППС.Записывать = Истина;
	Движения.УплаченоВзносовНаППС.Очистить();
	Для Каждого ТекСтрокаРаботникиОрганизации Из РаботникиОрганизации Цикл
		Движение = Движения.УплаченоВзносовНаППС.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПериодС = ПериодС;
		Движение.ПериодПо = ПериодПо;
		Движение.Сотрудник = ТекСтрокаРаботникиОрганизации.Сотрудник;
		Движение.ФизЛицо = ТекСтрокаРаботникиОрганизации.Сотрудник.ФизЛицо;
		Движение.Результат = ТекСтрокаРаботникиОрганизации.Результат;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

