Перем мСоответствиеНазначений Экспорт;

Перем мСтруктураДляОтбораПоКатегориям;

#Если Клиент Тогда
	
	Процедура ЗаполнитьНачальныеНастройки(НачальноеЗаполнение = Истина,ИзменениеТарифнойСтавки = Ложь,СортироватьПоПодразделению = Ложь, ИменаСтраницФормы = Неопределено) Экспорт //Аверсон ЕАЕ 15.10.2021 СВФР-008217 параметр ИменаСтраницФормы 
		
		// структура представлений полей
		СтруктураПредставлениеПолей = Новый Структура();
		СтруктураФорматаПолей = Новый Структура();
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		// Для использования свойств и категорий в текст запроса добавляются дополнительные поля
		
		ТаблицаПолей = Новый ТаблицаЗначений;
		ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
		ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
		ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
		ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
		ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта
		
		мСоответствиеНазначений = Новый Соответствие;
		
		// здесь добавим свойства сотрудника
		НоваяСтрока = ТаблицаПолей.Добавить();
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
		НоваяСтрока.Представление = "физического лица";
		
		Если ИмяРегистра = "РаботникиОрганизаций" Тогда
			
			Если ВыбиратьСотрудника Тогда
				
				// теперь добавим свойства физлица
				НоваяСтрока = ТаблицаПолей.Добавить();
				НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_СотрудникиОрганизаций;
				НоваяСтрока.Представление = "работника";
				
				//Аверсон ЕАЕ 09.07.2021 СВФР-007834
				Если ЗаПериод Тогда
					ЗапросСписокРаботников = "
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|РаботникиОрганизации.Сотрудник,
					|РаботникиОрганизации.ФИО,
					|РаботникиОрганизации.Физлицо,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
					|	КОНЕЦ КАК ГрафикРаботы,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
					|	КОНЕЦ КАК ЗанимаемыхСтавок,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
					|		ИНАЧЕ РаботникиОрганизации.Должность
					|	КОНЕЦ КАК Должность,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Наименование
					|		ИНАЧЕ РаботникиОрганизации.Должность.Наименование
					|	КОНЕЦ КАК ДолжностьНаименование,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Приоритет
					|		ИНАЧЕ РаботникиОрганизации.Должность.Приоритет
					|	КОНЕЦ КАК ДолжностьПриоритет,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
					|	КОНЕЦ КАК Подразделение,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Наименование
					|	КОНЕЦ КАК ПодразделениеНаименование,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаНач
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Приоритет
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Приоритет
					|	КОНЕЦ КАК ПодразделениеПриоритет,
					|РаботникиОрганизации.ТекущаяДата КАК ТекущаяДата,
					|РаботникиОрганизации.Код КАК Код, 
					|ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, 
					|РаботникиОрганизации.Пол,
					
					//Аверсон ЕАЕ 09.09.2021 СВФР-008114
					|РаботникиОрганизации.Период
					//Аверсон СВФР-008114
					
					|ПОМЕСТИТЬ ВТСписокРаботников
					|ИЗ
					|(ВЫБРАТЬ
					|	РаботникиОрганизацииНаДату.Сотрудник КАК Сотрудник,
					|	РаботникиОрганизацииНаДату.Сотрудник.Наименование КАК ФИО,
					|	РаботникиОрганизацииНаДату.Сотрудник.Физлицо КАК Физлицо,
					|	РаботникиОрганизацииНаДату.ГрафикРаботы,
					|	РаботникиОрганизацииНаДату.ЗанимаемыхСтавок,
					|	РаботникиОрганизацииНаДату.Должность,
					|	РаботникиОрганизацииНаДату.Должность.Наименование КАК ДолжностьНаименование,
					|	РаботникиОрганизацииНаДату.Должность.Приоритет КАК ДолжностьПриоритет,
					|   РаботникиОрганизацииНаДату.ПодразделениеОрганизации КАК Подразделение,
					|	РаботникиОрганизацииНаДату.ПодразделениеОрганизации.Наименование КАК ПодразделениеНаименование,
					|	РаботникиОрганизацииНаДату.ПодразделениеОрганизации.Приоритет КАК ПодразделениеПриоритет,
					|	&ДатаНач КАК ТекущаяДата,
					|	РаботникиОрганизацииНаДату.Сотрудник.Код КАК Код, 
					|   РаботникиОрганизацииНаДату.Сотрудник.ФизЛицо.Пол как Пол,
					|	РаботникиОрганизацииНаДату.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
					|   РаботникиОрганизацииНаДату.ОбособленноеПодразделениеЗавершения,
					|	РаботникиОрганизацииНаДату.ДляПечати,
					|  РаботникиОрганизацииНаДату.ПериодЗавершения,
					|  РаботникиОрганизацииНаДату.ДолжностьЗавершения,
					|  РаботникиОрганизацииНаДату.ГрафикРаботыЗавершения,
					|  РаботникиОрганизацииНаДату.ЗанимаемыхСтавокЗавершения,
					|  РаботникиОрганизацииНаДату.ПодразделениеОрганизации,
					|  РаботникиОрганизацииНаДату.ПодразделениеОрганизацииЗавершения,
					
					//Аверсон ЕАЕ 09.09.2021 СВФР-008114
					|  &ДатаНач КАК Период
					//Аверсон СВФР-008114
					
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНач, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизацииНаДату
					
					//Аверсон ЕАЕ 10.05.2024 СВФР-012983
					|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПрием
					|ПО РаботникиОрганизацийПрием.Сотрудник = РаботникиОрганизацииНаДату.Сотрудник
					|И РаботникиОрганизацийПрием.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
					//|ГДЕ ВЫБОР
					//|    КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
					//|    ТОГДА ИСТИНА
					//|    ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
					//|    КОНЕЦ
					|%УСЛОВИЕПРИЕМ%
					//Аверсон СВФР-012983
					
					//Аверсон ЕАЕ 16.08.2021 СВФР-007946
					//|ОБЪЕДИНИТЬ ВСЕ
					|ОБЪЕДИНИТЬ
					//Аверсон СВФР-007946
					
					|ВЫБРАТЬ
					|	РаботникиОрганизацийЗаПериод.Сотрудник КАК Сотрудник,
					|	РаботникиОрганизацийЗаПериод.Сотрудник.Наименование КАК ФИО,
					|	РаботникиОрганизацийЗаПериод.Сотрудник.Физлицо КАК Физлицо,
					|	РаботникиОрганизацийЗаПериод.ГрафикРаботы,
					|	РаботникиОрганизацийЗаПериод.ЗанимаемыхСтавок,
					|	РаботникиОрганизацийЗаПериод.Должность,
					|	РаботникиОрганизацийЗаПериод.Должность.Наименование КАК ДолжностьНаименование,
					|	РаботникиОрганизацийЗаПериод.Должность.Приоритет КАК ДолжностьПриоритет,
					|   РаботникиОрганизацийЗаПериод.ПодразделениеОрганизации КАК Подразделение,
					|	РаботникиОрганизацийЗаПериод.ПодразделениеОрганизации.Наименование КАК ПодразделениеНаименование,
					|	РаботникиОрганизацийЗаПериод.ПодразделениеОрганизации.Приоритет КАК ПодразделениеПриоритет,
					|	&ДатаНач КАК ТекущаяДата,
					|	РаботникиОрганизацийЗаПериод.Сотрудник.Код КАК Код, 
					|   РаботникиОрганизацийЗаПериод.Сотрудник.ФизЛицо.Пол как Пол,
					|	РаботникиОрганизацийЗаПериод.ОбособленноеПодразделение,
					|   РаботникиОрганизацийЗаПериод.ОбособленноеПодразделениеЗавершения,
					|  РаботникиОрганизацийЗаПериод.ДляПечати,
					|  РаботникиОрганизацийЗаПериод.ПериодЗавершения,
					|  РаботникиОрганизацийЗаПериод.ДолжностьЗавершения,
					|	РаботникиОрганизацийЗаПериод.ГрафикРаботыЗавершения,
					|  РаботникиОрганизацийЗаПериод.ЗанимаемыхСтавокЗавершения,
					|  РаботникиОрганизацийЗаПериод.ПодразделениеОрганизации,
					|  РаботникиОрганизацийЗаПериод.ПодразделениеОрганизацииЗавершения,
					
					//Аверсон ЕАЕ 09.09.2021 СВФР-008114
					|  РаботникиОрганизацийЗаПериод.Период
					//Аверсон СВФР-008114
					
					|ИЗ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийЗаПериод
					
					//Аверсон ЕАЕ 10.05.2024 СВФР-012983
					|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПрием
					|ПО РаботникиОрганизацийПрием.Сотрудник = РаботникиОрганизацийЗаПериод.Сотрудник
					|И РаботникиОрганизацийПрием.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
					//Аверсон СВФР-012983
					
					|ГДЕ РаботникиОрганизацийЗаПериод.Организация = &ГоловнаяОрганизация
					|И РаботникиОрганизацийЗаПериод.Период МЕЖДУ &ДатаНач И &ДатаКон
					
					//Аверсон ЕАЕ 10.05.2024 СВФР-012983
					//|И ВЫБОР
					//|  КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
					//|  ТОГДА ИСТИНА
					//|  ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
					//|  КОНЕЦ
					|%УСЛОВИЕПРИЕМ1%
					//Аверсон СВФР-012983
					
					|) КАК РаботникиОрганизации
					|";
				Иначе
					ЗапросСписокРаботников = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
					|	РаботникиОрганизации.Сотрудник.Наименование КАК ФИО,
					|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
					|	КОНЕЦ КАК ГрафикРаботы,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
					|	КОНЕЦ КАК ЗанимаемыхСтавок,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
					|		ИНАЧЕ РаботникиОрганизации.Должность
					|	КОНЕЦ КАК Должность,
					//О.Т. Аверсон 22.11.2017 № 1283
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Наименование
					|		ИНАЧЕ РаботникиОрганизации.Должность.Наименование
					|	КОНЕЦ КАК ДолжностьНаименование,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Приоритет
					|		ИНАЧЕ РаботникиОрганизации.Должность.Приоритет
					|	КОНЕЦ КАК ДолжностьПриоритет,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
					|	КОНЕЦ КАК Подразделение,
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Наименование
					|	КОНЕЦ КАК ПодразделениеНаименование,//О.Т. Аверсон 22.11.2017 № 1283
					|	ВЫБОР
					|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
					|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
					|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Приоритет
					|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Приоритет
					|	КОНЕЦ КАК ПодразделениеПриоритет,
					//О.Т. Аверсон 22.11.2017 № 1283
					|	&ДатаАктуальности КАК ТекущаяДата,
					|	РаботникиОрганизации.Сотрудник.Код КАК Код, 
					|	ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, 
					|   РаботникиОрганизации.Сотрудник.ФизЛицо.Пол как Пол
					|ПОМЕСТИТЬ ВТСписокРаботников
					|ИЗ
					|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизации
					
					//Аверсон ЕАЕ 10.05.2024 СВФР-012983
					|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПрием
					|ПО РаботникиОрганизацийПрием.Сотрудник = РаботникиОрганизации.Сотрудник
					|И РаботникиОрганизацийПрием.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
					//|ГДЕ ВЫБОР
					//|    КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
					//|    ТОГДА ИСТИНА
					//|    ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
					//|    КОНЕЦ
					|%УСЛОВИЕПРИЕМ%
					//Аверсон СВФР-012983
					
					|";
				КонецЕсли;
				
				//Островская Татьяна 14.02.2014 № 17118
				ТекстЗапроса = ЗапросСписокРаботников + 
				//"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				//|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
				//|	РаботникиОрганизации.Сотрудник.Наименование КАК ФИО,
				//|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
				//|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
				//|	КОНЕЦ КАК ГрафикРаботы,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
				//|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
				//|	КОНЕЦ КАК ЗанимаемыхСтавок,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
				//|		ИНАЧЕ РаботникиОрганизации.Должность
				//|	КОНЕЦ КАК Должность,
				////О.Т. Аверсон 22.11.2017 № 1283
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Наименование
				//|		ИНАЧЕ РаботникиОрганизации.Должность.Наименование
				//|	КОНЕЦ КАК ДолжностьНаименование,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения.Приоритет
				//|		ИНАЧЕ РаботникиОрганизации.Должность.Приоритет
				//|	КОНЕЦ КАК ДолжностьПриоритет,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
				//|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
				//|	КОНЕЦ КАК Подразделение,
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Наименование
				//|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Наименование
				//|	КОНЕЦ КАК ПодразделениеНаименование,//О.Т. Аверсон 22.11.2017 № 1283
				//|	ВЫБОР
				//|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				//|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				//|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения.Приоритет
				//|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации.Приоритет
				//|	КОНЕЦ КАК ПодразделениеПриоритет,
				////О.Т. Аверсон 22.11.2017 № 1283
				//|	&ДатаАктуальности КАК ТекущаяДата,
				//|	РаботникиОрганизации.Сотрудник.Код КАК Код, 
				//|	ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, 
				//|   РаботникиОрганизации.Сотрудник.ФизЛицо.Пол как Пол 
				//|ПОМЕСТИТЬ ВТСписокРаботников
				//|ИЗ
				//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизации
				"
				//Аверсон СВФР-007834
				
				|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ  //О.Т. Аверсон 26.10.2017 № 1170
				|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(Работники.Период) КАК Период,
				|			РегистрРаботники.Сотрудник КАК Сотрудник
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РегистрРаботники
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
				|				ПО (Работники.Период <= РегистрРаботники.Период)
				|					И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
				|					И РегистрРаботники.Сотрудник = Работники.Сотрудник
				|		{ГДЕ
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ДолжностьЗавершения
				|					ИНАЧЕ РегистрРаботники.Должность
				|				КОНЕЦ) КАК Должность,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ГрафикРаботыЗавершения
				|					ИНАЧЕ РегистрРаботники.ГрафикРаботы
				|				КОНЕЦ) КАК ГрафикРаботы,
				|			РегистрРаботники.Сотрудник.Код КАК ТабельныйНомер,
				|		 РегистрРаботники.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
				|			РегистрРаботники.Сотрудник.ТипРаботника КАК ТипРаботника,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ЗанимаемыхСтавокЗавершения
				|					ИНАЧЕ РегистрРаботники.ЗанимаемыхСтавок
				|				КОНЕЦ) КАК ЗанимаемыхСтавок,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ОбособленноеПодразделениеЗавершения
				|					ИНАЧЕ РегистрРаботники.ОбособленноеПодразделение
				|				КОНЕЦ) КАК ОбособленноеПодразделение,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ПодразделениеОрганизацииЗавершения
				|					ИНАЧЕ РегистрРаботники.ПодразделениеОрганизации
				|				КОНЕЦ) КАК Подразделение}
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РегистрРаботники.Сотрудник) КАК ПриказыОПриеме
				|		ПО РаботникиОрганизации.Сотрудник = ПриказыОПриеме.Сотрудник}
				
				//Островская Татьяна 17.02.2014 № 17118
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				|	
				|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|					  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета КАК ВидРасчетаОклад,
				|					  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				
				//Аверсон ЕАЕ 22.07.2025 СВФР-016305
				|                     ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ОсвобождатьСтавку КАК ОсвобождатьСтавку
				//Аверсон СВФР-016305
				
				|					  ИЗ
				|					  РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|					  ГДЕ
				|					  &ДатаАктуальности МЕЖДУ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения) КАК ОтпускПоУходу
				|   ПО РаботникиОрганизации.Сотрудник = ОтпускПоУходу.Сотрудник";
				Если ИсключитьБЛПоБеременностиИРодам Тогда 
					ТекстЗапроса = ТекстЗапроса +"
					
					|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчетаОклад,
					|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
					|ИЗ
					|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
					|	ПО ОсновныеНачисленияРаботниковОрганизаций.Регистратор = НачислениеПоБольничномуЛисту.Ссылка //О.Т. Аверсон 03.04.2019 № 4191 поставила для оптимизации кода. Очень долго отбирает записи. Если что, то использовать базу.ФактическийПериодДействия
					|ГДЕ
					|	&ДатаАктуальности МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
					|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)) КАК ОтпускПоБеременности
					|ПО РаботникиОрганизации.Сотрудник = ОтпускПоБеременности.Сотрудник";
				КонецЕсли; 
				ТекстЗапроса = ТекстЗапроса +"
				//О.Т. Аверсон 21.12.2017 № 1363
				|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчетаОклад
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&ДатаАктуальности,
				|			Организация = &ГоловнаяОрганизация
				|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
				|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ОсновныеНачисленияОрганизаций.Ссылка
				|ГДЕ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчетаОклады)
				|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций) КАК ПлановыеНачислениия
				|ПО РаботникиОрганизации.Сотрудник = ПлановыеНачислениия.Сотрудник
				//О.Т. Аверсон 21.12.2017 № 1363
				|ГДЕ
				|	ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|	И ВЫБОР //О.Т. Аверсон 12.07.2016 № 1311
				|	КОГДА НЕ &ВключатьВалютныхСотрудников и не &ВключатьТолькоВалютныхСотрудников
				|		ТОГДА не РаботникиОрганизации.ДляПечати
				|	когда &ВключатьТолькоВалютныхСотрудников тогда
				|	     РаботникиОрганизации.ДляПечати	
				|	ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|			
				|	И ВЫБОР
				|		КОГДА &ИсключитьДекретников
				
				//Аверсон ЕАЕ 22.07.2025 СВФР-016305
				//|			ТОГДА ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1
				|           ТОГДА ВЫБОР
				|                 КОГДА &ИсключитьТолькоСОсвобожденнойСтавкой
				|                 ТОГДА ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1 ИЛИ ОтпускПоУходу.ОсвобождатьСтавку = Ложь
				|                 ИНАЧЕ ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1
				|                 КОНЕЦ
				//Аверсон СВФР-016305
				
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ";
				Если ИсключитьБЛПоБеременностиИРодам Тогда
					ТекстЗапроса = ТекстЗапроса + "
					|	И ЕСТЬNULL(ОтпускПоБеременности.ВидРасчетаОклад, 1) = 1";
				КонецЕсли;
				
				если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
					ТекстЗапроса = ТекстЗапроса + " И НЕ РаботникиОрганизации.Сотрудник.Физлицо.Наименование В (&Наименование)";
					СписокВакансий = Новый СписокЗначений;
					СписокВакансий.Добавить("Вакансия");
					СписокВакансий.Добавить("вакансия");
					СписокВакансий.Добавить("ВАКАНСИЯ");
					СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
					СписокВакансий.Добавить("вакансия 1 1");
					//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
				КонецЕсли;
				
				//Островская Татьяна 17.02.2014 № 17118
				ТекстЗапроса = ТекстЗапроса+" {ГДЕ
				|	РаботникиОрганизации.Сотрудник КАК Работник,
				|	РаботникиОрганизации.Сотрудник.Родитель КАК Группа,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ДолжностьЗавершения
				|			ИНАЧЕ РаботникиОрганизации.Должность
				|		КОНЕЦ).* КАК Должность,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
				|		КОНЕЦ).* КАК ГрафикРаботы,
				|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер, 
				|	ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, РаботникиОрганизации.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
				|	РаботникиОрганизации.Сотрудник.ТипРаботника КАК ТипРаботника,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
				|		КОНЕЦ) КАК ЗанимаемыхСтавок,
				|	ПриказыОПриеме.Период КАК ДатаПриема,
				|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
				|	(ВЫБОР 
				|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности 
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) 
				|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения 
				|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации 
				|		КОНЕЦ).* КАК Подразделение,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
				|		КОНЕЦ).* КАК ОбособленноеПодразделение
				|	//КАТЕГОРИИ}";
				//Островская Татьяна 14.02.2014 № 17118
				УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Сотрудник.Физлицо");
				
				// Добавим строки запроса, необходимые для использования свойств и категорий
				ТаблицаПолей[0].ПутьКДанным = "РаботникиОрганизации.Сотрудник.Физлицо";
				ТаблицаПолей[1].ПутьКДанным = "РаботникиОрганизации.Сотрудник";
				ТекстПоляКатегорий = "";
				ТекстПоляСвойств = "";
				УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
				
				//Аверсон 22.07.2020 КВВ СВФР-006327 (
				ТекстЗапроса = ТекстЗапроса + "
				|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
				|РаботникиОрганизации.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
				|ИНАЧЕ
				|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
				|НЕ РаботникиОрганизации.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
				|ИНАЧЕ ИСТИНА
				|КОНЕЦ КОНЕЦ";
				//Аверсон 22.07.2020 КВВ СВФР-006327 )
				
				//Аверсон ЕАЕ 03.06.2024 СВФР-012983
				//ТекстЗапроса = ТекстЗапроса + "
				//|И ВЫБОР
				//|  КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
				//|  ТОГДА ИСТИНА
				//|  ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
				//|  КОНЕЦ
				//|";
				Если ИсключатьПринятыхПосле И ЗначениеЗаполнено(ИсключатьПринятыхПослеДата) Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УСЛОВИЕПРИЕМ%","ГДЕ ВЫБОР
					|    КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
					|    ТОГДА ИСТИНА
					|    ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
					|    КОНЕЦ");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УСЛОВИЕПРИЕМ1%","И ВЫБОР
					|    КОГДА НЕ &ИсключатьПринятыхПосле ИЛИ &ИсключатьПринятыхПослеДата = ДатаВремя(1,1,1) 
					|    ТОГДА ИСТИНА
					|    ИНАЧЕ РаботникиОрганизацийПрием.Период < &ИсключатьПринятыхПослеДата
					|    КОНЕЦ");
				Иначе
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УСЛОВИЕПРИЕМ%","");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%УСЛОВИЕПРИЕМ1%","");
				КонецЕсли;
				//Аверсон СВФР-012983
				
				Если ВключатьДоговорников Тогда
					
					Если Не ВключатьУволенных Тогда
						ТекстЗапроса = ТекстЗапроса + "
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
						|	NULL,
						|	NULL,
						|	NULL,
						|	NULL,
						|	NULL,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.Наименование, //О.Т. Аверсон 22.11.2017 № 1283
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.Приоритет,//О.Т. Аверсон 22.11.2017 № 1283
						|	NULL,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код, &ПустойВидРасчета, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол"
						// ПСА 20.09.2021 СВФР-008114 +++
						+?(ЗаПериод,", NULL", "") + "
						// ПСА 20.09.2021 СВФР-008114 +++
						|ИЗ
						|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
						|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
						|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
						|
						|ГДЕ
						//Аверсон 04.05.2021 КВВ СВФР-007508 (
						//|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
						//|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаАктуальности
						|	(
						|	(
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаАктуальности,КВАРТАЛ) И КОНЕЦПЕРИОДА(&ДатаАктуальности,КВАРТАЛ)
						|	ИЛИ
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаАктуальности,КВАРТАЛ) И КОНЕЦПЕРИОДА(&ДатаАктуальности,КВАРТАЛ)
						|	)
						|	ИЛИ
						|	(
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= НАЧАЛОПЕРИОДА(&ДатаАктуальности,КВАРТАЛ) 
						|	И 
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= КОНЕЦПЕРИОДА(&ДатаАктуальности,КВАРТАЛ)
						|	)
						|	)
						//Аверсон 04.05.2021 КВВ СВФР-007508 )
						|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
						
						//Аверсон 22.07.2020 КВВ СВФР-006327 (
						ТекстЗапроса = ТекстЗапроса + "
						|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
						|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ
						|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
						|НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ ИСТИНА
						|КОНЕЦ КОНЕЦ";
						//Аверсон 22.07.2020 КВВ СВФР-006327 )
						
						если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
							ТекстЗапроса = ТекстЗапроса + " И НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование В (&Наименование)";
							СписокВакансий = Новый СписокЗначений;
							СписокВакансий.Добавить("Вакансия");
							СписокВакансий.Добавить("вакансия");
							СписокВакансий.Добавить("ВАКАНСИЯ");
							СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
							СписокВакансий.Добавить("вакансия 1 1");
							//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
						КонецЕсли;
						ТекстЗапроса = ТекстЗапроса + "
						|{ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер, &ПустойВидРасчета как ВидРасчетаОклад, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника КАК ТипРаботника,
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
						|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
						|	//СВОЙСТВА
						|	//КАТЕГОРИИ
						|}";
						
					Иначе
						
						ТекстЗапроса = ТекстЗапроса + "
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
						|	NULL,
						|	NULL,
						|	NULL,
						|	NULL,
						|	NULL,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.наименование,//О.Т. Аверсон 22.11.2017 № 1283
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.Приоритет,//О.Т. Аверсон 22.11.2017 № 1283
						|	NULL,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код, &ПустойВидРасчета, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол"
						// ПСА 20.09.2021 СВФР-008114 +++
						+?(ЗаПериод,", NULL", "") + "
						// ПСА 20.09.2021 СВФР-008114 +++
						|ИЗ
						|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
						|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
						|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
						|ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
						|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаУволенных
						|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
						
						//Аверсон 22.07.2020 КВВ СВФР-006327 (
						ТекстЗапроса = ТекстЗапроса + "
						|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
						|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ
						|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
						|НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ ИСТИНА
						|КОНЕЦ КОНЕЦ";
						//Аверсон 22.07.2020 КВВ СВФР-006327 )
						
						если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
							ТекстЗапроса = ТекстЗапроса + " И НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование В (&Наименование)";
							СписокВакансий = Новый СписокЗначений;
							СписокВакансий.Добавить("Вакансия");
							СписокВакансий.Добавить("вакансия");
							СписокВакансий.Добавить("ВАКАНСИЯ");
							СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
							СписокВакансий.Добавить("вакансия 1 1");
							//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
						КонецЕсли;
						ТекстЗапроса = ТекстЗапроса + "
						|{ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер, &ПустойВидРасчета как ВидРасчетаОклад, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника КАК ТипРаботника,
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
						|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
						|	//СВОЙСТВА
						|	//КАТЕГОРИИ
						|}";
						
					КонецЕсли;
					
					УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "ДоговорНаВыполнениеРаботСФизЛицом", "Сотрудник.Физлицо");
					
					// Добавим строки запроса, необходимые для использования свойств и категорий
					ТаблицаПолей[0].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо";
					ТаблицаПолей[1].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник";
					ТекстПоляКатегорий = "";
					ТекстПоляСвойств = "";
					УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
					
				КонецЕсли;
				
			Иначе
				//О.Т. Аверсон 26.10.2017 № 1170
				НоваяСтрока = ТаблицаПолей.Добавить();
				НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_СотрудникиОрганизаций;
				НоваяСтрока.Представление = "работника";
				//О.Т. Аверсон 26.10.2017 № 1170
				
				//Островская Татьяна 14.02.2014 № 17118
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
				|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФИО,
				|	РаботникиОрганизации.Сотрудник.Код КАК Код, 
				|	ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, РаботникиОрганизации.Сотрудник.ФизЛицо.Пол КАК Пол
				|ПОМЕСТИТЬ ВТСписокРаботников
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизации
				|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ  //О.Т. Аверсон 26.10.2017 № 1170
				|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(Работники.Период) КАК Период,
				|			РегистрРаботники.Сотрудник.Физлицо КАК Физлицо
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РегистрРаботники
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
				|				ПО (Работники.Период <= РегистрРаботники.Период)
				|					И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
				|					И РегистрРаботники.Сотрудник = Работники.Сотрудник
				|		{ГДЕ
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ДолжностьЗавершения
				|					ИНАЧЕ РегистрРаботники.Должность
				|				КОНЕЦ) КАК Должность,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ГрафикРаботыЗавершения
				|					ИНАЧЕ РегистрРаботники.ГрафикРаботы
				|				КОНЕЦ) КАК ГрафикРаботы,
				|			РегистрРаботники.Сотрудник.Код КАК ТабельныйНомер, РегистрРаботники.Сотрудник.ФизЛицо.Пол КАК Пол, //О.Т. Аверсон 19.04.2017 № 560
				|			РегистрРаботники.Сотрудник.ТипРаботника КАК ТипРаботника,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ЗанимаемыхСтавокЗавершения
				|					ИНАЧЕ РегистрРаботники.ЗанимаемыхСтавок
				|				КОНЕЦ) КАК ЗанимаемыхСтавок,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ОбособленноеПодразделениеЗавершения
				|					ИНАЧЕ РегистрРаботники.ОбособленноеПодразделение
				|				КОНЕЦ) КАК ОбособленноеПодразделение,
				|			(ВЫБОР
				|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
				|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|						ТОГДА РегистрРаботники.ПодразделениеОрганизацииЗавершения
				|					ИНАЧЕ РегистрРаботники.ПодразделениеОрганизации
				|				КОНЕЦ) КАК Подразделение}
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РегистрРаботники.Сотрудник.Физлицо) КАК ПриказыОПриеме
				|		ПО РаботникиОрганизации.Сотрудник.Физлицо = ПриказыОПриеме.Физлицо}
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
				|			РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|			УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				|		ИЗ
				|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, НЕ Регистратор ССЫЛКА Документ.ПлановоеШтатноеРасписаниеОрганизаций) КАК РаботникиОрганизацийСрезПоследних
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				|				ПО РаботникиОрганизацийСрезПоследних.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				|		ГДЕ
				|			РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК Увольнение
				|		ПО РаботникиОрганизации.Сотрудник = Увольнение.Сотрудник
				
				
				|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|					  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета КАК ВидРасчетаОклад,
				|					  ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				
				//Аверсон ЕАЕ 22.07.2025 СВФР-016305
				|                     ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.ОсвобождатьСтавку КАК ОсвобождатьСтавку
				//Аверсон СВФР-016305
				
				|					  ИЗ
				|					  РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|					  ГДЕ
				|	                  &ДатаАктуальности МЕЖДУ ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Период И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ПериодЗавершения) КАК ОтпускПоУходу
				|   ПО РаботникиОрганизации.Сотрудник = ОтпускПоУходу.Сотрудник";
				Если ИсключитьБЛПоБеременностиИРодам Тогда 
					ТекстЗапроса = ТекстЗапроса +"	
					|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
					|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчетаОклад,
					|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник
					|ИЗ
					|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
					|	ПО ОсновныеНачисленияРаботниковОрганизаций.Регистратор = НачислениеПоБольничномуЛисту.Ссылка //О.Т. Аверсон 03.04.2019 № 4191 поставила для оптимизации кода. Очень долго отбирает записи. Если что, то использовать базу.ФактическийПериодДействия
					|ГДЕ
					|	&ДатаАктуальности МЕЖДУ ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
					|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам)) КАК ОтпускПоБеременности
					|ПО РаботникиОрганизации.Сотрудник = ОтпускПоБеременности.Сотрудник";
				КонецЕсли;
				ТекстЗапроса = ТекстЗапроса +"
				
				//О.Т. Аверсон 21.12.2017 № 1363
				|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
				|	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчетаОклад
				|ИЗ
				|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				|			&ДатаАктуальности,
				|			Организация = &ГоловнаяОрганизация
				|				И ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
				|		ПО ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета = ОсновныеНачисленияОрганизаций.Ссылка
				|ГДЕ
				|	ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета В(&ВидРасчетаОклады)
				|	И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета ССЫЛКА ПланВидовРасчета.ОсновныеНачисленияОрганизаций) КАК ПлановыеНачислениия
				|ПО РаботникиОрганизации.Сотрудник = ПлановыеНачислениия.Сотрудник
				//О.Т. Аверсон 21.12.2017 № 1363
				
				|ГДЕ
				|	ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1
				|	И ВЫБОР //О.Т. Аверсон 12.07.2016 № 1311
				|	КОГДА НЕ &ВключатьВалютныхСотрудников и не &ВключатьТолькоВалютныхСотрудников
				|		ТОГДА не РаботникиОрганизации.ДляПечати
				|	когда &ВключатьТолькоВалютныхСотрудников тогда
				|	     РаботникиОрганизации.ДляПечати	
				|	ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|			
				|	И ВЫБОР
				|		КОГДА &ИсключитьДекретников
				
				//Аверсон ЕАЕ 22.07.2025 СВФР-016305
				//|			ТОГДА ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1
				|           ТОГДА ВЫБОР
				|                 КОГДА &ИсключитьТолькоСОсвобожденнойСтавкой
				|                 ТОГДА ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1 ИЛИ ОтпускПоУходу.ОсвобождатьСтавку = Ложь
				|                 ИНАЧЕ ЕСТЬNULL(ОтпускПоУходу.ВидРасчетаОклад, 1) = 1
				|                 КОНЕЦ
				//Аверсон СВФР-016305
				
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ";
				Если ИсключитьБЛПоБеременностиИРодам Тогда
					ТекстЗапроса = ТекстЗапроса + "
					|	И ЕСТЬNULL(ОтпускПоБеременности.ВидРасчетаОклад, 1) = 1";
				КонецЕсли;
				если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
					ТекстЗапроса = ТекстЗапроса + " И НЕ РаботникиОрганизации.Сотрудник.Физлицо.Наименование В (&Наименование)";
					СписокВакансий = Новый СписокЗначений;
					СписокВакансий.Добавить("Вакансия");
					СписокВакансий.Добавить("вакансия");
					СписокВакансий.Добавить("ВАКАНСИЯ");
					СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
					СписокВакансий.Добавить("вакансия 1 1");
					//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
				КонецЕсли;
				//Островская Татьяна 14.02.2014 № 17118
				ТекстЗапроса = ТекстЗапроса + "
				|{ГДЕ
				|	РаботникиОрганизации.Сотрудник КАК Работник,
				|	РаботникиОрганизации.Сотрудник.Родитель КАК Группа,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ДолжностьЗавершения
				|			ИНАЧЕ РаботникиОрганизации.Должность
				|		КОНЕЦ).* КАК Должность,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
				|		КОНЕЦ).* КАК ГрафикРаботы,
				|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер, 
				|	ПлановыеНачислениия.ВидРасчетаОклад как ВидРасчетаОклад, РаботникиОрганизации.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
				|	РаботникиОрганизации.Сотрудник.ТипРаботника КАК ТипРаботника,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
				|		КОНЕЦ) КАК ЗанимаемыхСтавок,
				|	ПриказыОПриеме.Период КАК ДатаПриема,
				|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
				|	(ВЫБОР 
				|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности 
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения 
				|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации 
				|		КОНЕЦ).* КАК Подразделение,
				|	(ВЫБОР
				|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
				|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
				|		КОНЕЦ).* КАК ОбособленноеПодразделение
				|		//КАТЕГОРИИ}"; //О.Т. Аверсон 26.10.2017 № 1170
				
				УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Сотрудник.Физлицо");
				
				// Добавим строки запроса, необходимые для использования свойств и категорий
				ТаблицаПолей[0].ПутьКДанным = "РаботникиОрганизации.Сотрудник.Физлицо";
				ТаблицаПолей[1].ПутьКДанным = "РаботникиОрганизации.Сотрудник"; //О.Т. Аверсон 26.10.2017 № 1170
				
				ТекстПоляКатегорий = "";
				ТекстПоляСвойств = "";
				УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
				
				//Аверсон 22.07.2020 КВВ СВФР-006327 (
				ТекстЗапроса = ТекстЗапроса + "
				|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
				|РаботникиОрганизации.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
				|ИНАЧЕ
				|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
				|НЕ РаботникиОрганизации.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
				|ИНАЧЕ ИСТИНА
				|КОНЕЦ КОНЕЦ";
				//Аверсон 22.07.2020 КВВ СВФР-006327 )
				
				Если ВключатьДоговорников Тогда
					
					Если Не ВключатьУволенных Тогда
						
						ТекстЗапроса = ТекстЗапроса + "
						|
						|ОБЪЕДИНИТЬ
						|
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код, &ПустойВидРасчета, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол
						|ИЗ
						|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
						|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
						|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
						|ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
						|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаАктуальности
						|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
						
						//Аверсон 22.07.2020 КВВ СВФР-006327 (
						ТекстЗапроса = ТекстЗапроса + "
						|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
						|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ
						|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
						|НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ ИСТИНА
						|КОНЕЦ КОНЕЦ";
						//Аверсон 22.07.2020 КВВ СВФР-006327 )
						
						если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
							ТекстЗапроса = ТекстЗапроса + " И НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование В (&Наименование)";
							СписокВакансий = Новый СписокЗначений;
							СписокВакансий.Добавить("Вакансия");
							СписокВакансий.Добавить("вакансия");
							СписокВакансий.Добавить("ВАКАНСИЯ");
							СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
							СписокВакансий.Добавить("вакансия 1 1");
							//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
						КонецЕсли;
						ТекстЗапроса = ТекстЗапроса + "
						|{ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,  &ПустойВидРасчета как ВидРасчетаОклад, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника КАК ТипРаботника,
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
						|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
						|	//СВОЙСТВА
						|	//КАТЕГОРИИ
						|}";
						
					Иначе
						
						ТекстЗапроса = ТекстЗапроса + "
						|
						|ОБЪЕДИНИТЬ
						|
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код,  &ПустойВидРасчета, ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол
						|ИЗ
						|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
						|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
						|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
						|ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
						|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаУволенных
						|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
						
						//Аверсон 22.07.2020 КВВ СВФР-006327 (
						ТекстЗапроса = ТекстЗапроса + "
						|И ВЫБОР КОГДА &ТолькоИнвалиды = ИСТИНА ТОГДА
						|ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ
						|ВЫБОР КОГДА &БезИнвалидов = ИСТИНА ТОГДА
						|НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо В (&ТЗИнвалидов)
						|ИНАЧЕ ИСТИНА
						|КОНЕЦ КОНЕЦ";
						//Аверсон 22.07.2020 КВВ СВФР-006327 )
						
						если Организация.ИНН = "100765738" и не ИзменениеТарифнойСтавки Тогда 
							ТекстЗапроса = ТекстЗапроса + " И НЕ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование В (&Наименование)";
							СписокВакансий = Новый СписокЗначений;
							СписокВакансий.Добавить("Вакансия");
							СписокВакансий.Добавить("вакансия");
							СписокВакансий.Добавить("ВАКАНСИЯ");
							СписокВакансий.Добавить("ВАКАНСИЯ 1 1");
							СписокВакансий.Добавить("вакансия 1 1");
							//Запрос.УстановитьПараметр("Наименование",СписокВакансий);
						КонецЕсли;
						ТекстЗапроса = ТекстЗапроса + "
						
						|{ГДЕ
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,  &ПустойВидРасчета как ВидРасчетаОклад , ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ФизЛицо.Пол КАК Пол,//О.Т. Аверсон 19.04.2017 № 560
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ТипРаботника КАК ТипРаботника,
						//
						|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
						|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
						|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
						|	//СВОЙСТВА
						|	//КАТЕГОРИИ
						|}";
						
					КонецЕсли;
					
					УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "ДоговорНаВыполнениеРаботСФизЛицом", "Сотрудник.Физлицо");
					
					// Добавим строки запроса, необходимые для использования свойств и категорий
					ТаблицаПолей[0].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо";
					ТаблицаПолей[1].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник";//О.Т. Аверсон 26.10.2017 № 1170
					ТекстПоляКатегорий = "";
					ТекстПоляСвойств = "";
					УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ВключатьУволенных Тогда
				СтрокаУсловия =
				"ГДЕ
				|	ВЫБОР
				|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
				|		ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
				|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|";
				если Организация.ИНН = "100765738" Тогда 
					СтрокаУсловия = СтрокаУсловия + " И НЕ РаботникиОрганизации.Сотрудник.Физлицо.Наименование В (&Наименование)";
				КонецЕсли;  
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			ИначеЕсли ЗначениеЗаполнено(ДатаУволенных) Тогда
				СтрокаУсловия =
				"ГДЕ
				|	(ВЫБОР
				|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
				|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|			ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
				|		ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
				|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) ИЛИ (РаботникиОрганизации.Период > &ДатаУволенных)
				|";
				если Организация.ИНН = "100765738" Тогда 
					СтрокаУсловия = СтрокаУсловия + " И НЕ РаботникиОрганизации.Сотрудник.Физлицо.Наименование В (&Наименование)";
				КонецЕсли;
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			иначе
				если Организация.ИНН = "100765738" Тогда 
					СтрокаУсловия = СтрокаУсловия + " ГДЕ НЕ РаботникиОрганизации.Сотрудник.Физлицо.Наименование В (&Наименование)";
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Если ВыбиратьСотрудника Тогда
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	Сотрудники.Сотрудник КАК Сотрудник,
				|	Сотрудники.Сотрудник.Наименование КАК ФИО,
				|	РаботникиОрганизации.ФизЛицо КАК Физлицо,
				|	РаботникиОрганизации.ГрафикРаботы,
				|	РаботникиОрганизации.ЗанимаемыхСтавок,
				|	РаботникиОрганизации.Должность,
				|	РаботникиОрганизации.Подразделение КАК Подразделение,
				|	0 КАК Код
				|ПОМЕСТИТЬ ВТСписокРаботников
				|ИЗ
				|	РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РаботникиОрганизации
				|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(Работники.Период) КАК Период,
				|			РегистрРаботники.ФизЛицо КАК Физлицо
				|		ИЗ
				|			РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РегистрРаботники
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
				|				ПО РегистрРаботники.ФизЛицо = Работники.ФизЛицо
				|					И (Работники.Период <= РегистрРаботники.Период)
				|					И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
				|		{ГДЕ
				|			РегистрРаботники.Должность КАК Должность,
				|			РегистрРаботники.ГрафикРаботы КАК ГрафикРаботы,
				|			РегистрРаботники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
				|			РегистрРаботники.Подразделение КАК Подразделение}
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РегистрРаботники.ФизЛицо) КАК ПриказыОПриеме
				|		ПО (ПриказыОПриеме.Физлицо = РаботникиОрганизации.ФизЛицо)}
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СписокСотрудников.Сотрудник КАК Сотрудник,
				|			СписокСотрудников.Физлицо КАК Физлицо
				|		ИЗ
				|			(ВЫБРАТЬ
				|				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
				|				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
				|				1 КАК Приоритет
				|			ИЗ
				|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
				|			ГДЕ
				|				ВЫБОР
				|						КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
				|								И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|							ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
				|						ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
				|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|			
				|			СГРУППИРОВАТЬ ПО
				|				РаботникиОсновноеМесто.Сотрудник.Физлицо
				|			
				|			ОБЪЕДИНИТЬ
				|			
				|			ВЫБРАТЬ
				|				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
				|				РаботникиСовместительство.Сотрудник.Физлицо,
				|				2
				|			ИЗ
				|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
				|			ГДЕ
				|				ВЫБОР
				|						КОГДА РаботникиСовместительство.ПериодЗавершения <= &ДатаАктуальности
				|								И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|							ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
				|						ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
				|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|			
				|			СГРУППИРОВАТЬ ПО
				|				РаботникиСовместительство.Сотрудник.Физлицо
				|			
				|			ОБЪЕДИНИТЬ
				|			
				|			ВЫБРАТЬ
				|				МАКСИМУМ(СотрудникиДУ.Ссылка),
				|				СотрудникиДУ.Физлицо,
				|				ВЫБОР
				|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
				|						ТОГДА 3
				|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				|						ТОГДА 4
				|					ИНАЧЕ 5
				|				КОНЕЦ
				|			ИЗ
				|				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
				|			
				|			СГРУППИРОВАТЬ ПО
				|				СотрудникиДУ.Физлицо,
				|				ВЫБОР
				|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
				|						ТОГДА 3
				|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				|						ТОГДА 4
				|					ИНАЧЕ 5
				|				КОНЕЦ) КАК СписокСотрудников
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|					СписокФизическихЛиц.Физлицо КАК Физлицо,
				|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
				|				ИЗ
				|					(ВЫБРАТЬ
				|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
				|						1 КАК Приоритет
				|					ИЗ
				|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|								&ДатаАктуальности,
				|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
				|					ГДЕ
				|						ВЫБОР
				|								КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
				|										И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|									ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
				|								ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния
				|							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|					
				|					ОБЪЕДИНИТЬ
				|					
				|					ВЫБРАТЬ
				|						РаботникиСовместительство.Сотрудник.Физлицо,
				|						2
				|					ИЗ
				|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
				|								&ДатаАктуальности,
				|								Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				|									И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
				|					ГДЕ
				|						ВЫБОР
				|								КОГДА РаботникиСовместительство.ПериодЗавершения <= &ДатаАктуальности
				|										И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|									ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
				|								ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния
				|							КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|					
				|					ОБЪЕДИНИТЬ
				|					
				|					ВЫБРАТЬ
				|						СотрудникиДУ.Физлицо,
				|						ВЫБОР
				|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
				|								ТОГДА 3
				|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				|								ТОГДА 4
				|							ИНАЧЕ 5
				|						КОНЕЦ
				|					ИЗ
				|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
				|				
				|				СГРУППИРОВАТЬ ПО
				|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
				|				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
				|					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
				|		ПО РаботникиОрганизации.ФизЛицо = Сотрудники.Физлицо
				|{ГДЕ
				|	Сотрудники.Сотрудник КАК Работник,
				|	Сотрудники.Сотрудник.Родитель КАК Группа,
				|	РаботникиОрганизации.Должность.* КАК Должность,
				|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
				|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
				|	ПриказыОПриеме.Период КАК ДатаПриема,
				|	РаботникиОрганизации.Подразделение КАК Подразделение}";
				
			Иначе
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаботникиОрганизации.ФизЛицо КАК Физлицо,
				|	РаботникиОрганизации.ФизЛицо.Наименование КАК ФИО,
				|	0 КАК Код
				|ПОМЕСТИТЬ ВТСписокРаботников
				|ИЗ
				|	РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РаботникиОрганизации
				|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(Работники.Период) КАК Период,
				|			РегистрРаботники.ФизЛицо КАК Физлицо
				|		ИЗ
				|			РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РегистрРаботники
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
				|				ПО РегистрРаботники.ФизЛицо = Работники.ФизЛицо
				|					И (Работники.Период <= РегистрРаботники.Период)
				|					И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
				|		{ГДЕ
				|			РегистрРаботники.Должность КАК Должность,
				|			РегистрРаботники.ГрафикРаботы КАК ГрафикРаботы,
				|			РегистрРаботники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
				|			РегистрРаботники.Подразделение КАК Подразделение}
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РегистрРаботники.ФизЛицо) КАК ПриказыОПриеме
				|		ПО (ПриказыОПриеме.Физлицо = РаботникиОрганизации.ФизЛицо)}
				|{ГДЕ
				|	РаботникиОрганизации.ФизЛицо КАК Работник,
				|	РаботникиОрганизации.ФизЛицо.Родитель КАК Группа,
				|	РаботникиОрганизации.Должность.* КАК Должность,
				|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
				|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
				|	ПриказыОПриеме.Период КАК ДатаПриема,
				|	РаботникиОрганизации.Подразделение КАК Подразделение}";
				
			КонецЕсли;
			
			Если Не ВключатьУволенных Тогда
				СтрокаУсловия =
				"ГДЕ
				|	РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
				|";
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
				
			ИначеЕсли ЗначениеЗаполнено(ДатаУволенных) Тогда
				СтрокаУсловия =
				"ГДЕ
				|	(РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) ИЛИ (РаботникиОрганизации.Период > &ДатаУволенных)
				|";
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
				
			КонецЕсли;
			
			// Преобразуем текст запроса для получения полной информации о физлице
			УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Физлицо");
			
			Если ВыбиратьСотрудника Тогда  // здесь добавим свойства сотрудника
				НоваяСтрока.ПутьКДанным = "Сотрудники.Сотрудник";
				НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_СотрудникиОрганизаций;
				НоваяСтрока = ТаблицаПолей.Добавить();
				НоваяСтрока.Представление = "физического лица";
			КонецЕсли;
			// теперь добавим свойства физлица
			НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Физлицо";
			НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
			
			// Добавим строки запроса, необходимые для использования свойств и категорий
			ТекстПоляКатегорий = "";
			ТекстПоляСвойств = "";
			УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
			
		КонецЕсли;
		
		Если ИсполнятьЗапрос Тогда
			//ПСА 22.02.2021 СВФР-007241 +++
			//Если СортироватьПоПодразделению Тогда //О.Т. Аверсон 22.11.2017 № 1283
			Если СортироватьПоПодразделению 
				и ИмяРегистра = "РаботникиОрганизаций" 
				и ВыбиратьСотрудника Тогда
				//+++ПСА 22.02.2021 СВФР-007241
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ВТСписокРаботников","") + "
				|
				|УПОРЯДОЧИТЬ ПО ПодразделениеПриоритет, ПодразделениеНаименование, ДолжностьПриоритет, ДолжностьНаименование";//Островская Татьяна 22.01.2014 № 17059
			иначе                                                           			
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ВТСписокРаботников","") + "
				|
				|УПОРЯДОЧИТЬ ПО Код";//Островская Татьяна 22.01.2014 № 17059
			КонецЕсли;
		ИначеЕсли ВыбиратьСотрудника Тогда
			Если НЕ ЗаПериод Тогда //Аверсон 10.08.2021 КВВ СВФР-007858
				ТекстЗапроса = ТекстЗапроса + "
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Сотрудник";
			КонецЕсли;
		Иначе 
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Физлицо";
		КонецЕсли;
		//Островская Татьяна 03.05.2014 № 17118
		если ВключатьУволенных Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1","(ЕСТЬNULL(Увольнение.ДатаУвольнения, 1) = 1 ИЛИ ЕСТЬNULL(Увольнение.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) >= &ДатаУволенных)");
		КонецЕсли;
		//Островская Татьяна 03.05.2014 № 17118
		
		ПостроительОтчета.Текст = ТекстЗапроса;         
		
		УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, мСоответствиеНазначений, СтруктураПредставлениеПолей);
		
		//представление полей запроса
		СтруктураПредставлениеПолей.Вставить("Группа",						"Группа сотрудников");
		СтруктураПредставлениеПолей.Вставить("ОбособленноеПодразделение",	"Организация");
		СтруктураПредставлениеПолей.Вставить("ДатаПриема",					"Дата приема");
		СтруктураПредставлениеПолей.Вставить("ГрафикРаботы",				"График работы");
		СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавок",			"Занимаемых ставок");
		Если ИмяРегистра = "РаботникиОрганизаций" Тогда 
			СтруктураПредставлениеПолей.Вставить("ВидЗанятости",			"Вид занятости");
		КонецЕсли;
		СтруктураПредставлениеПолей.Вставить("ТипРаботника",			"Тип работника");
		
		УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
		
		Если НачальноеЗаполнение Тогда
			
			//Аверсон ЕАЕ 15.10.2021 СВФР-008217
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
			//Аверсон СВФР-008217
			
			// отборы по умолчанию
			МассивОтбора = Новый Массив;
			Если ИмяРегистра = "РаботникиОрганизаций" Тогда
				МассивОтбора.Добавить("ОбособленноеПодразделение");
			КонецЕсли;
			МассивОтбора.Добавить("Подразделение");
			
			Если ИменаСтраницФормы <> "СведенияОДоходахФизлиц2024" Тогда //СВЭЙ 11.02.2024 КВВ СВФР-012275 
				
				//ПСА 05.03.2021 СВФР-007293+++
				//МассивОтбора.Добавить("Должность");
				МассивОтбора.Добавить("Должность.Категория");
				//+++ПСА 05.03.2021 СВФР-007293
				МассивОтбора.Добавить("Работник");
				//Островская Татьяна 11.01.2013 № 16066
				Если ИмяРегистра = "РаботникиОрганизаций" Тогда //Островская Татьяна 12.05.2014 № 17356
					МассивОтбора.Добавить("ТабельныйНомер");
					Если Организация.ИНН = "100074549" Тогда 
						МассивОтбора.Добавить("Категории1Категория"); //О.Т. Аверсон 26.10.2017 № 1170
					КонецЕсли;
					МассивОтбора.Добавить("ВидРасчетаОклад");//О.Т. Аверсон 20.12.2017 № 1363
					
					//Аверсон ЕАЕ 15.10.2021 СВФР-008217
					Если Организация.ИНН = "700067572" И ИменаСтраницФормы = "ЗарплатаКВыплатеОрганизаций" Тогда
						МассивОтбора.Добавить("ВидЗанятости");
						МассивОтбора.Добавить("ТипРаботника");
					КонецЕсли;
					//Аверсон СВФР-008217
					
					//Аверсон ЕАЕ 18.10.2021 СВФР-008256
					Если ИменаСтраницФормы = "СписокНаАванс" Тогда
						МассивОтбора.Добавить("ВидЗанятости");	
					КонецЕсли;
					//Аверсон СВФР-008256
				КонецЕсли;
				//Островская Татьяна 11.01.2013 № 16066
				УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
				ПостроительОтчета.Отбор.ВидРасчетаОклад.ТипЗначения.СодержитТип(Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"));// = Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций");//
				//Островская Татьяна 16.12.2013 № 16983
				
				//Аверсон ЕАЕ 15.10.2021 СВФР-008217
				//Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
				//Аверсон СВФР-008217
				
				если Организация.ИНН = "100765738" Тогда 
					ПостроительОтчета.Отбор.Работник.ВидСравнения = ВидСравнения.ВИерархии;
				иначе
					ПостроительОтчета.Отбор.Работник.ВидСравнения = ВидСравнения.ВСписке;
				КонецЕсли;
				//Островская Татьяна 16.12.2013 № 16983
				//Островская Татьяна 11.01.2013 № 16066
				Если ИмяРегистра = "РаботникиОрганизаций" Тогда //Островская Татьяна 12.05.2014 № 17356
					ПостроительОтчета.Отбор.ТабельныйНомер.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
					Если Организация.ИНН = "100074549" Тогда 
						ПостроительОтчета.Отбор.Категории1Категория.ВидСравнения = ВидСравнения.Равно; //О.Т. Аверсон 26.10.2017 № 1170
					КонецЕсли;
					ПостроительОтчета.Отбор.ВидРасчетаОклад.ВидСравнения = ВидСравнения.Равно;//О.Т. Аверсон 20.12.2017 № 1363
					
					
				КонецЕсли;
				//Островская Татьяна 11.01.2013 № 16066
				ПостроительОтчета.Отбор.ДолжностьКатегория.ВидСравнения = ВидСравнения.НеРавно; //ПСА 05.03.2021 СВФР-007293
				
				//Аверсон ЕАЕ 18.10.2021 СВФР-008256
				Если ИменаСтраницФормы = "СписокНаАванс" Тогда
					ПостроительОтчета.Отбор.ВидЗанятости.ВидСравнения = ВидСравнения.Равно;
					ПостроительОтчета.Отбор.ВидЗанятости.Значение = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
					ПостроительОтчета.Отбор.ВидЗанятости.Использование = Истина;
				КонецЕсли;
				//Аверсон СВФР-008256
				
				//СВЭЙ 11.02.2024 КВВ СВФР-012275 (
			Иначе         
				МассивОтбора.Добавить("Работник");    
				
				Если ИмяРегистра = "РаботникиОрганизаций" Тогда 
					МассивОтбора.Добавить("ТабельныйНомер"); 
				КонецЕсли; 
				
				УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);  
				
				Если Организация.ИНН = "100765738" Тогда 
					ПостроительОтчета.Отбор.Работник.ВидСравнения = ВидСравнения.ВИерархии;
				Иначе
					ПостроительОтчета.Отбор.Работник.ВидСравнения = ВидСравнения.ВСписке;
				КонецЕсли;
				
				Если ИмяРегистра = "РаботникиОрганизаций" Тогда
					ПостроительОтчета.Отбор.ТабельныйНомер.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
				КонецЕсли;
			КонецЕсли;
			//СВЭЙ 11.02.2024 КВВ СВФР-012275 )
		КонецЕсли;
		
	КонецПроцедуры
	
	
	Функция ПолучитьСписокРаботников() Экспорт
		
		Если НЕ УправлениеОтчетами.ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
			//повторные отборы по категориям
			Возврат Новый Структура("Команда,Данные,Реквизиты","ЗаполнитьСписокРаботников");
		КонецЕсли;
		
		ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ДатаАктуальности);
		ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ДатаАктуальности));
		ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ДатаАктуальности));
		ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ДатаАктуальности));
		ПостроительОтчета.Параметры.Вставить("ВключатьУволенных", ВключатьУволенных); //+ СВЭЙ КДЯ 02.03.20 СВФР-005593
		ПостроительОтчета.Параметры.Вставить("ДатаУволенных", ДатаУволенных);
		ПостроительОтчета.Параметры.Вставить("ВключатьВалютныхСотрудников", ВключатьВалютныхСотрудников);//О.Т. Аверсон 12.07.2016 № 1311
		ПостроительОтчета.Параметры.Вставить("ВключатьТолькоВалютныхСотрудников", ВключатьТолькоВалютныхСотрудников);//О.Т. Аверсон 22.07.2016 № 1311
		ПостроительОтчета.Параметры.Вставить("ИсключитьДекретников", ИсключитьДекретников);
		
		//Аверсон ЕАЕ 22.07.2025 СВФР-016305
		ПостроительОтчета.Параметры.Вставить("ИсключитьТолькоСОсвобожденнойСтавкой", ИсключитьТолькоСОсвобожденнойСтавкой);
		//Аверсон СВФР-016305
		
		ПостроительОтчета.Параметры.Вставить("ИсключитьБЛПоБеременностиИРодам", ИсключитьБЛПоБеременностиИРодам);    
		ПостроительОтчета.Параметры.Вставить("ЗаПериод", ЗаПериод); //Аверсон 10.08.2021 КВВ СВФР-007858
		//Аверсон 22.07.2020 КВВ СВФР-006327 (
		ПостроительОтчета.Параметры.Вставить("ТолькоИнвалиды", ТолькоИнвалиды);     
		ПостроительОтчета.Параметры.Вставить("БезИнвалидов", БезИнвалидов);
		
		ЗапросИнвалиды = Новый Запрос;
		ЗапросИнвалиды.Текст = "ВЫБРАТЬ 
		|СведенияОбИнвалидностиФизлиц.ФизЛицо
		|ИЗ РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&ДатаАктуальности) КАК СведенияОбИнвалидностиФизлиц
		|ГДЕ
		|СведенияОбИнвалидностиФизлиц.Инвалидность = Истина
		|И СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = ""II"" ИЛИ СведенияОбИнвалидностиФизлиц.ГруппаИнвалидности = ""I"""; 
		ЗапросИнвалиды.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		ТЗИнвалидов = ЗапросИнвалиды.Выполнить().Выгрузить();
		ПостроительОтчета.Параметры.Вставить("ТЗИнвалидов", ТЗИнвалидов);
		//Аверсон 22.07.2020 КВВ СВФР-006327 )
		
		//О.Т. Аверсон 21.12.2017 № 1363
		ВидРасчетаОклады = Новый СписокЗначений;
		ВидРасчетаОклады.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
		ВидРасчетаОклады.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);	
		ВидРасчетаОклады.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
		ВидРасчетаОклады.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
		
		ПостроительОтчета.Параметры.Вставить("ВидРасчетаОклады", ВидРасчетаОклады);
		ПостроительОтчета.Параметры.Вставить("ПустойВидРасчета", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка());
		
		//Аверсон ЕАЕ 09.07.2021 СВФР-007834
		ПостроительОтчета.Параметры.Вставить("ДатаНач", НачалоМесяца(ДатаАктуальности));
		ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецМесяца(ДатаАктуальности));
		//Аверсон СВФР-007834
		
		//Аверсон ЕАЕ 10.05.2024 СВФР-012983
		ПостроительОтчета.Параметры.Вставить("ИсключатьПринятыхПосле", ИсключатьПринятыхПосле);
		ПостроительОтчета.Параметры.Вставить("ИсключатьПринятыхПослеДата", ИсключатьПринятыхПослеДата);
		//Аверсон СВФР-012983
		
		//О.Т. Аверсон 21.12.2017 № 1363
		Если ИсполнятьЗапрос Тогда
			
			ПостроительОтчета.Выполнить();
			РезультатОтбора = ПостроительОтчета.Результат;
			Если РезультатОтбора.Пустой() Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не обнаружено работников, удовлетворяющих указанным условиям!");
			КонецЕсли;
			
			//СВЭЙ 21.06.2024 КВВ СВФР-012992 (
			//Возврат Новый Структура("Команда,Данные,Реквизиты","ЗаполнитьСписокРаботников",РезультатОтбора,Реквизиты)
			Возврат Новый Структура("Команда,Данные,Реквизиты,Запрос","ЗаполнитьСписокРаботников",РезультатОтбора,Реквизиты,ПостроительОтчета.ПолучитьЗапрос());
			//СВЭЙ 21.06.2024 КВВ СВФР-012992 )
		Иначе
			Возврат Новый Структура("Команда,Запрос,Реквизиты","ИсполнитьПодготовленныйЗапрос",ПостроительОтчета.ПолучитьЗапрос(),Реквизиты);
		КонецЕсли;
		
	КонецФункции // ПолучитьСписокРаботников()
	
#КонецЕсли
