
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсновныеНачисленияРаботниковОрганизаций
	
	ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(ВидРасчета.СпособРасчета,ВидРасчета.ВидВремени);

	Движения.ОсновныеНачисленияРаботниковОрганизаций.Записывать = Истина;
	Движения.ОсновныеНачисленияРаботниковОрганизаций.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.СуммаКДоплате <> 0 Тогда 
			Движение = Движения.ОсновныеНачисленияРаботниковОрганизаций.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ВидРасчета;
			Движение.ПериодДействияНачало = НачалоДня(Дата);
			Движение.ПериодДействияКонец = КонецДня(Дата);
			Движение.ПериодРегистрации = ПериодРегистрации;
			Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
			Движение.ФизЛицо = ТекСтрокаНачисления.Сотрудник.ФизЛицо;
			Движение.Организация = Организация;
			Движение.Результат = ТекСтрокаНачисления.СуммаКДоплате;   
			Движение.ГрафикРаботы = ТекСтрокаНачисления.Сотрудник;
			РаботникиОрганизации = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Сотрудник",ТекСтрокаНачисления.Сотрудник)); 
			Движение.ГрафикРаботыНорма = РаботникиОрганизации.ГрафикРаботы;
			Движение.ВидУчетаВремени = ВидУчетаВремени;
			Движение.ПодразделениеОрганизации = РаботникиОрганизации.ПодразделениеОрганизации;
			Движение.ДатаНачалаСобытия = ПериодРегистрации;
			Движение.ОбособленноеПодразделение = Организация;
			Движение.Авторасчет = истина;
			Движение.Категория = РаботникиОрганизации.Должность.Категория;
			Движение.Должность = РаботникиОрганизации.Должность;
		КонецЕсли;
	КонецЦикла;

	// регистр ВзаиморасчетыСРаботникамиОрганизаций Приход
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Записывать = Истина;
	Движения.ВзаиморасчетыСРаботникамиОрганизаций.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.СуммаКДоплате <> 0 Тогда
			Движение = Движения.ВзаиморасчетыСРаботникамиОрганизаций.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Физлицо = ТекСтрокаНачисления.Сотрудник.ФизЛицо;
			Движение.Организация = Организация;
			Движение.ПериодВзаиморасчетов = ПериодРегистрации;
			//Аверсон ЕАЕ 09.10.2017
			Движение.СуммаВзаиморасчетов = ТекСтрокаНачисления.СуммаКДоплате;
			//Аверсон
		КонецЕсли;
	КонецЦикла;

	// регистр НДФЛСведенияОДоходах 
	Движения.НДФЛСведенияОДоходах.Записывать = Истина;
	Движения.НДФЛСведенияОДоходах.Очистить();
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.СуммаКДоплате <> 0 Тогда
			Движение = Движения.НДФЛСведенияОДоходах.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ФизЛицо = ТекСтрокаНачисления.Сотрудник.ФизЛицо;
			Движение.КодДохода = ВидРасчета.КодДоходаНДФЛ;
			Движение.ПериодРегистрации = ПериодРегистрации;
			Движение.СуммаДохода = ТекСтрокаНачисления.СуммаКДоплате;
			Движение.ОбособленноеПодразделение = Организация;
			Движение.ПодразделениеОрганизации = 1;
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
