
// <Описание процедуры>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СформироватьОтчет() Экспорт
	Если ТипЗаполнения <> 4 Тогда
		Если ДатаПриказа = Дата(1,1,1) Тогда
			Предупреждение("Не указана дата приказа!");
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(НомерПриказа) Тогда
			Предупреждение("Не указан номер приказа!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого НоваяСтр Из ТабличнаяЧасть Цикл
		Если Не ЗначениеЗаполнено(НоваяСтр.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		
		СпрСотрудники = НоваяСтр.Сотрудник.ПолучитьОбъект();
		РезультатПоискаСотрудник = СпрСотрудники.Физлицо.ПолучитьОбъект();

		Если ТипЗаполнения = 1 Тогда  //поощрения
			НоваяСтрТабл  = РезультатПоискаСотрудник.Поощрения.Добавить();
			НоваяСтрТабл.ДатаПоощрения = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаПоощрения = НомерПриказа;
			НоваяСтрТабл.ТекстПоощрения = ?(ПустаяСтрока(НоваяСтр.Текст), Текст, НоваяСтр.Текст);
			НоваяСтрТабл.ТипПоощрения = ?(ЗначениеЗаполнено(НоваяСтр.ТипПоощрения), ТипПоощрения, НоваяСтр.ТипПоощрения);
			НоваяСтрТабл.ПримечаниеПоощрения = ?(ПустаяСтрока(НоваяСтр.Примечание), Примечание, НоваяСтр.Примечание);	
		ИначеЕсли ТипЗаполнения = 2 Тогда //взыскания
			НоваяСтрТабл  = РезультатПоискаСотрудник.Взыскания.Добавить();
			НоваяСтрТабл.ДатаВзыскания = ДатаПриказа;
			НоваяСтрТабл.НомерПриказаВзыскания = НомерПриказа;
			НоваяСтрТабл.ТекстВзыскания = ?(ПустаяСтрока(НоваяСтр.Текст), Текст, НоваяСтр.Текст);
			НоваяСтрТабл.ТипВзыскания = ?(ЗначениеЗаполнено(НоваяСтр.ТипВзыскания), ТипВзыскания, НоваяСтр.ТипВзыскания);
			НоваяСтрТабл.ПримечаниеВзыскания = ?(ПустаяСтрока(НоваяСтр.Примечание), Примечание, НоваяСтр.Примечание);				
		ИначеЕсли ТипЗаполнения = 3 Тогда //профессии
			НоваяСтрТабл  = РезультатПоискаСотрудник.Профессии.Добавить();
			НоваяСтрТабл.Профессия = ?(ПустаяСтрока(НоваяСтр.Профессия), ПрофессияСпр, НоваяСтр.Профессия);
			НоваяСтрТабл.ТипПрофессии = ?(ПустаяСтрока(НоваяСтр.ТипПрофессии), ТипПрофессии, НоваяСтр.ТипПрофессии);
			НоваяСтрТабл.Разряд = ?(ПустаяСтрока(НоваяСтр.Разряд), Разряд, НоваяСтр.Разряд);
			НоваяСтрТабл.НомерПриказа = НомерПриказа;
			НоваяСтрТабл.ДатаПриказа = ДатаПриказа;	
		КонецЕсли;
		
		Если ТипЗаполнения = 1 Тогда  //поощрения
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ПООЩРЕНИЕ");
		ИначеЕсли ТипЗаполнения = 2 Тогда //взыскания
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ВЗЫСКАНИЕ");
		ИначеЕсли ТипЗаполнения = 3 Тогда //профессии
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили ПРОФЕССИЮ");
		ИначеЕсли ТипЗаполнения = 4 Тогда //аттестация
			Сообщить("По сотруднику ТН " + СокрЛП(НоваяСтр.ТН) + " " + СокрЛП(НоваяСтр.Сотрудник.Наименование) + " - заполнили АТТЕСТАЦИЮ");
		КонецЕсли;
		
		РезультатПоискаСотрудник.Записать();
	КонецЦикла;
КонецПроцедуры // ()

