
// Возвращает Истина, если клиентское приложение подключено к базе через веб-сервер.
//
Функция КлиентПодключенЧерезВебСервер() Экспорт
	
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы()), "WS=") = 1;
	
КонецФункции

// Записывает очередное сообщение в глобальный массив сообщений.
// Параметры : 
// ИмяСобытия - строка, имя события для журнала регистрации
// ПредставлениеУровня - строка, описание уровня события, по нему будет определен уровень события при записи на сервере
// ОбъектМетаданных - ОбъектМетаданных(подробнее см. синтакс-помощник по "ЗаписьЖурналаРегистрации")
// Данные - Произвольный, данные, с которыми связано событие (например, ссылки на объект)
// Комментарий - строка, комментарий для события журнала
// ПредставлениеРежима - строка, представление режима транзакции для данного события
// ДатаСобытия - дата, точная дата возникновения события, описанного в сообщении. Будет добавлена в начало комментария.
// ЗаписатьСобытия - булево, признак вызова процедуры непосредственной записи накопленных сообщений после добавления.
Процедура ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня = "Информация", 
	Комментарий = "", ДатаСобытия = "", ЗаписатьСобытия = Ложь) Экспорт
	
	// В случае необходимости выполним инициализацию глобального списка сообщений для журнала регистрации.
	Если СообщенияДляЖурналаРегистрации = Неопределено Тогда
		СообщенияДляЖурналаРегистрации = Новый СписокЗначений;
	КонецЕсли;
	
	Если ДатаСобытия = "" Тогда
		ДатаСобытия = ТекущаяДата();
	КонецЕсли;
	
	КомментарийСДатой = Строка(ДатаСобытия) +" " + Комментарий;
	СтруктураСообщения = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий", 
		ИмяСобытия, ПредставлениеУровня, КомментарийСДатой);
	СообщенияДляЖурналаРегистрации.Добавить(СтруктураСообщения);
	
	Если ЗаписатьСобытия Тогда
		ОбщегоНазначения.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурналаРегистрации);
	КонецЕсли;
		
КонецПроцедуры

