Процедура ВыгрузкаДокументовВДБФОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
    
    ТекущееСобытие = "Запись";
	Если ВыполнитьВыгрузку(источник,ТекущееСобытие) = Ложь Тогда
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаДокументовВДБФПриУдаленииПередУдалением(Источник, Отказ)    Экспорт
    
	ТекущееСобытие = "Удаление";
	Если ВыполнитьВыгрузку(источник,ТекущееСобытие) = Ложь Тогда
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьВыгрузку(источник,ТекущееСобытие)
    Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(УправлениеПользователями.ОпределитьТекущегоПользователя(),"ОсновнаяОрганизация");
    Попытка
        Если Организация.ИНН <> "100092167" Тогда
            Возврат Истина;
        КонецЕсли;
    Исключение
        Возврат Истина;
    КонецПопытки;

	КаталогВыгрузки = СокрЛП(Константы.КаталогВыгрузкиДляПодпискиНаСобытия.Получить());
	Если НЕ ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		КаталогВыгрузки = КаталогВременныхФайлов();
		Константы.КаталогВыгрузкиДляПодпискиНаСобытия = КаталогВременныхФайлов();
		Сообщить("Установлен каталог для выгрузки файдов: " + КаталогВременныхФайлов());
	КонецЕсли;
	
	ВыбранныйВидДокумента = источник.Метаданные().Имя;
	Если ВыбранныйВидДокумента = "ПриемНаРаботуВОрганизацию" Тогда
		ИмяФайлаБазы = "\DPriem.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "КадровоеПеремещениеОрганизаций" Тогда
		ИмяФайлаБазы = "\DPerem.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "ПриказНаПрисвоениеРазряда" Тогда
		ИмяФайлаБазы = "\DRazrad.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "ИзменениеПериодическихРеквизитов" Тогда
		ИмяФайлаБазы = "\DIzmPRek.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "УвольнениеИзОрганизаций" Тогда
		ИмяФайлаБазы = "\DUvoln.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "КомандировкиОрганизаций" Тогда
		ИмяФайлаБазы = "\DKomand.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "ОтпускаОрганизаций" Тогда
		ИмяФайлаБазы = "\DOtpusk.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "НачислениеПоБольничномуЛисту" Тогда
		ИмяФайлаБазы = "\DBolnich.dbf";
		
	ИначеЕсли ВыбранныйВидДокумента = "НевыходыВОрганизациях" Тогда
		ИмяФайлаБазы = "\Nevychod.dbf";
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтпускПоУходуЗаРебенком" Тогда
		ИмяФайлаБазы = "\DUchod.dbf";
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтзывИзОтпуска" Тогда
		ИмяФайлаБазы = "\DOtzyv.dbf";
		
	КонецЕсли;
	
	БазаВыгрузки = Новый xBase; 
	БазаВыгрузки.Кодировка = КодировкаXBase.ANSI;
	
	ПолноеИмяФайла = КаталогВыгрузки + ИмяФайлаБазы;
	ФайлБазы = Новый Файл(ПолноеИмяФайла);
	Если НЕ ФайлБазы.Существует() Тогда
		Если СоздатьНовыйФайлДлявыгрузки(ВыбранныйВидДокумента,БазаВыгрузки,ПолноеИмяФайла) = Ложь Тогда
			//Предупреждение("В данный момент операция не может быть выполнена! Повторите попытку позднее");
			Сообщить("В данный момент операция не может быть выполнена! Повторите попытку позднее");
			Возврат ложь;
		Конецесли;
		
	Иначе
		Попытка
			БазаВыгрузки.ОткрытьФайл(ПолноеИмяФайла);
		Исключение
			//Предупреждение("В данный момент операция не может быть выполнена! Повторите попытку позднее");
			Сообщить("В данный момент операция не может быть выполнена! Повторите попытку позднее");
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
    
    Если Не БазаВыгрузки.Открыта() Тогда
        Сообщить("Не смог открыть файл для записи");
        Возврат Ложь;
    КонецЕсли;
    
    Разрещно = Истина;
	Если ВыбранныйВидДокумента = "ПриемНаРаботуВОрганизацию" Тогда
        Разрещно = ВыгрузитьДокументПриема(Источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "КадровоеПеремещениеОрганизаций" Тогда
        Разрещно = ВыгрузитьДокументКадровыхПеремещений(источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "ПриказНаПрисвоениеРазряда" Тогда
         Разрешено = ВыгрузитьДокументПриказНаПрисвоениеРазряда(Источник,БазаВыгрузки,ТекущееСобытие);
		
    ИначеЕсли ВыбранныйВидДокумента = "ИзменениеПериодическихРеквизитов" Тогда
         Разрешено = ВыгрузитьДокументИзменениеПериодическихРеквизитов(Источник,БазаВыгрузки,ТекущееСобытие);
         
	ИначеЕсли ВыбранныйВидДокумента = "УвольнениеИзОрганизаций" Тогда
         Разрешено = ВыгрузитьДокументУвольнениеИзОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "КомандировкиОрганизаций" Тогда
         Разрешено = ВыгрузитьДокументКомандировкиОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "ОтпускаОрганизаций" Тогда
         Разрешено = ВыгрузитьДокументОтпускаОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "НачислениеПоБольничномуЛисту" Тогда
         Разрешено =  ВыгрузитьДокументНачислениеПоБольничномуЛисту(Источник,БазаВыгрузки,ТекущееСобытие);
        
	ИначеЕсли ВыбранныйВидДокумента = "НевыходыВОрганизациях" Тогда
         Разрешено =  ВыгрузитьДокументНевыходыВОрганизациях(Источник,БазаВыгрузки,ТекущееСобытие);
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтпускПоУходуЗаРебенком" Тогда
         Разрешено =  ВыгрузитьДокументОтпускПоУходуЗаРебенком(Источник,БазаВыгрузки,ТекущееСобытие);
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтзывИзОтпуска" Тогда
         Разрешено =  ВыгрузитьДокументОтзывИзОтпуска(Источник,БазаВыгрузки,ТекущееСобытие);
		
	КонецЕсли;
    
	БазаВыгрузки.ЗакрытьФайл();

	Возврат Разрещно;
КонецФункции

Функция СоздатьНовыйФайлДлявыгрузки(ВыбранныйВидДокумента,БазаВыгрузки,ПолноеИмяФайла)
	
	БазаВыгрузки.поля.Добавить("GUID", "S", 40);            // GUID элемента справочника
    БазаВыгрузки.поля.Добавить("NomerDoc", "S", 15);        // номер документа
    БазаВыгрузки.поля.Добавить("DataDoc", "S", 40);         // дата документа
    БазаВыгрузки.поля.Добавить("NomPrik", "S", 40);         // номер приказа
    БазаВыгрузки.поля.Добавить("DataPrik", "S", 10);        // дата приказа
    БазаВыгрузки.поля.Добавить("GUIDSotr", "S", 40);        // ГУИД сотрудника
    БазаВыгрузки.поля.Добавить("VsegoStr", "N", 6,0);       // общее количество строк документа
    БазаВыгрузки.поля.Добавить("TekStr", "N", 6,0);         // текущая строка документа
    
	Если ВыбранныйВидДокумента = "ПриемНаРаботуВОрганизацию" Тогда
         БазаВыгрузки.поля.Добавить("DataPrS", "S", 10);    // дата приема с
         БазаВыгрузки.поля.Добавить("DataPrPo", "S", 10);   // дата приема по
         БазаВыгрузки.поля.Добавить("GUIDPodr", "S", 40);   // ГУИД подразделения
         БазаВыгрузки.поля.Добавить("GUIDDolg", "S", 40);   // ГУИД должности
         //БазаВыгрузки.поля.Добавить("GUIDKat", "S", 40);    // ГУИД категории
         БазаВыгрузки.поля.Добавить("NAIMKat", "S", 50);    // наименование категории
         БазаВыгрузки.поля.Добавить("Stavka", "N", 10, 2);  // ставка
         БазаВыгрузки.поля.Добавить("RazrETS", "N", 10, 0); // разряд ЕТС
         БазаВыгрузки.поля.Добавить("MTS", "N", 19, 2);     // месячная тарифная ставка
         
	ИначеЕсли ВыбранныйВидДокумента = "КадровоеПеремещениеОрганизаций" Тогда
         БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
         БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
         БазаВыгрузки.поля.Добавить("NewStav", "S", 40);    // ставка  новая
         БазаВыгрузки.поля.Добавить("NewPodr", "S", 40);    // ГУИД подразделения  нового
         БазаВыгрузки.поля.Добавить("NewDolg", "S", 40);    // ГУИД должности  новой
         БазаВыгрузки.поля.Добавить("NewKat", "S", 50);     // наименование категории  новая
         БазаВыгрузки.поля.Добавить("NewETS", "N", 10, 0);  // разряд ЕТС   новый
         БазаВыгрузки.поля.Добавить("NewMTS", "N", 19, 2);  // месячная тарифная ставка  новая
         
	ИначеЕсли ВыбранныйВидДокумента = "ПриказНаПрисвоениеРазряда" Тогда
         БазаВыгрузки.поля.Добавить("GUIDPodr", "S", 40);   // ГУИД подразделения
         БазаВыгрузки.поля.Добавить("GUIDDolg", "S", 40);   // ГУИД должности
         БазаВыгрузки.поля.Добавить("RazrETS", "N", 10, 0); // разряд ЕТС
         БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
         БазаВыгрузки.поля.Добавить("MTS", "N", 19, 2);     // месячная тарифная ставка
         БазаВыгрузки.поля.Добавить("Osnovan", "S", 250);    // основание присвоение разряда
		
     ИначеЕсли ВыбранныйВидДокумента = "ИзменениеПериодическихРеквизитов" Тогда
         БазаВыгрузки.поля.Добавить("GUIDPodr", "S", 40);   // ГУИД подразделения
         БазаВыгрузки.поля.Добавить("GUIDDolg", "S", 40);   // ГУИД должности
         БазаВыгрузки.поля.Добавить("RazrETS", "N", 10, 0); // разряд ЕТС
         БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
         БазаВыгрузки.поля.Добавить("MTS", "N", 19, 2);     // месячная тарифная ставка
         БазаВыгрузки.поля.Добавить("Osnovan", "S", 250);    // основание присвоение разряда
         
	ИначеЕсли ВыбранныйВидДокумента = "УвольнениеИзОрганизаций" Тогда
         БазаВыгрузки.поля.Добавить("DataUvol", "S", 10);   // дата увольнения
         БазаВыгрузки.поля.Добавить("StTKRB", "S", 150);    // статья ТК РБ
         БазаВыгрузки.поля.Добавить("Osnovan", "S", 250);   // основание увольнения
         БазаВыгрузки.поля.Добавить("DKDnei", "N", 10, 0);  // ден.компенсация за количество дней
         
	ИначеЕсли ВыбранныйВидДокумента = "КомандировкиОрганизаций" Тогда
         //БазаВыгрузки.поля.Добавить("GUIDPodr", "S", 40);   // ГУИД подразделения
         БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
         БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
         БазаВыгрузки.поля.Добавить("CelKom", "S", 100);    // цель командировки
         БазаВыгрузки.поля.Добавить("OtKuda1", "S", 40);    // место отправления  (иерархия)
         БазаВыгрузки.поля.Добавить("OtKuda2", "S", 40);    // место отправления
         БазаВыгрузки.поля.Добавить("Kuda", "S", 40);       // место назначения
         БазаВыгрузки.поля.Добавить("Vid", "N", 1, 0);      // 1 - командировать, 2 - отозвать, 3 - продлить
         
	ИначеЕсли ВыбранныйВидДокумента = "ОтпускаОрганизаций" Тогда
         БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
         БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
         БазаВыгрузки.поля.Добавить("DKDnei", "N", 10, 0);  // ден.компенсация за количество дней
         БазаВыгрузки.поля.Добавить("RGodS", "S", 10);      // рабочий год с
         БазаВыгрузки.поля.Добавить("RGodPo", "S", 10);     // рабочий год по 
         БазаВыгрузки.поля.Добавить("VidOtp", "N", 2);      // вид отпуска (числовое значение)
         БазаВыгрузки.поля.Добавить("DniOtp", "N", 4);      // количество дней отпуска
         БазаВыгрузки.поля.Добавить("RGodSv", "S", 10);     // рабочий год с (по видам отпусков)
         БазаВыгрузки.поля.Добавить("RGodPov", "S", 10);    // рабочий год по  (по видам отпусков)
         
	ИначеЕсли ВыбранныйВидДокумента = "НачислениеПоБольничномуЛисту" Тогда
        БазаВыгрузки.поля.Добавить("SeriaBol", "S", 14);   // серия документа б\л
        БазаВыгрузки.поля.Добавить("NomerBol", "S", 14);   // номер документа б\л
        БазаВыгрузки.поля.Добавить("VidBol", "N", 2);      // вид нетрудоспособности (числовое значение)
        БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
        БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
        
	ИначеЕсли ВыбранныйВидДокумента = "НевыходыВОрганизациях" Тогда
        БазаВыгрузки.поля.Добавить("Vid", "N", 2);         // вид невыхода (числовое значение)
        БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
        БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтпускПоУходуЗаРебенком" Тогда
        БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
        БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
        
    ИначеЕсли ВыбранныйВидДокумента = "ОтзывИзОтпуска" Тогда
        БазаВыгрузки.поля.Добавить("DataS", "S", 10);      // дата с
        БазаВыгрузки.поля.Добавить("DataPo", "S", 10);     // дата по
        БазаВыгрузки.поля.Добавить("Vid", "N", 2);         // вид отзыва компенсация - 1, перенос - 2 , продление - 3
        БазаВыгрузки.поля.Добавить("DKDnei", "N", 10, 0);  // ден.компенсация за количество дней
        БазаВыгрузки.поля.Добавить("DniOtp", "N", 4);      // количество дней отпуска переноса или продления
        
	КонецЕсли;
    
    БазаВыгрузки.поля.Добавить("Prov", "N", 2);			  // пометка на удаление
	БазаВыгрузки.СоздатьФайл(ПолноеИмяФайла);
	
	Возврат БазаВыгрузки.открыта();
КонецФункции

Функция ВыгрузитьДокументПриема(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерД;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrS",Формат(СтрокаДок.ДатаПриема, "ДФ=dd.MM.yyyy"));
        //БазаВыгрузки.УстановитьЗначениеПоля("DataPrPo",Формат(СтрокаДок.ДатаУвольнения, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDPodr", СтрокаДок.ПодразделениеОрганизации.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDDolg", СтрокаДок.Должность.УникальныйИдентификатор());
        //БазаВыгрузки.УстановитьЗначениеПоля("GUIDKat", СтрокаДок.Категория.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("NAIMKat", СтрокаДок.Категория.Наименование);
        БазаВыгрузки.УстановитьЗначениеПоля("Stavka", СтрокаДок.ЗанимаемыхСтавок);
        БазаВыгрузки.УстановитьЗначениеПоля("RazrETS", Число(СтрокаДок.РазрядЕТС));
        БазаВыгрузки.УстановитьЗначениеПоля("MTS", СтрокаДок.МесячнаяТарифнаяСтавка);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументПриема()

Функция ВыгрузитьДокументКадровыхПеремещений(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерПриказа;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачала, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(СтрокаДок.ДатаОкончания, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("NewPodr", СтрокаДок.ПодразделениеОрганизации.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("NewDolg", СтрокаДок.Должность.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("NewKat", СтрокаДок.Категория.Наименование);
        БазаВыгрузки.УстановитьЗначениеПоля("NewStav", СтрокаДок.ЗанимаемыхСтавок);
        БазаВыгрузки.УстановитьЗначениеПоля("NewETS", Число(СтрокаДок.РазрядЕТС));
        БазаВыгрузки.УстановитьЗначениеПоля("NewMTS", СтрокаДок.МесячнаяТарифнаяСтавка);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументКадровыхПеремещений()

Функция ВыгрузитьДокументПриказНаПрисвоениеРазряда(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерД;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    Osnovan = Источник.ОснованиеПеремещения;
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDPodr", СтрокаДок.ПодразделениеОрганизации.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDDolg", СтрокаДок.Должность.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("RazrETS", Число(СтрокаДок.РазрядЕТСНовый));
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачалаНовый, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("MTS", СтрокаДок.МесячнаяТарифнаяСтавкаНовый);
        Базавыгрузки.УстановитьЗначениеПоля("Osnovan",Osnovan);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументПриказНаПрисвоениеРазряда()

Функция ВыгрузитьДокументИзменениеПериодическихРеквизитов(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерД;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDPodr", СтрокаДок.ПодразделениеОрганизации.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDDolg", СтрокаДок.Должность.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("RazrETS", Число(СтрокаДок.РазрядЕТС));
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачала, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("MTS", СтрокаДок.МесячнаяТарифнаяСтавка);
        Базавыгрузки.УстановитьЗначениеПоля("Osnovan",СтрокаДок.Основание);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументИзменениеПериодическихРеквизитов()

Функция ВыгрузитьДокументУвольнениеИзОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерД;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли;
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("DataUvol",Формат(СтрокаДок.ДатаУвольнения, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("StTKRB", СтрокаДок.СтатьяТКРФ.Наименование);
        //Базавыгрузки.УстановитьЗначениеПоля("Osnovan",СтрокаДок.ОснованиеУвольнения.УникальныйИдентификатор()); 
        Базавыгрузки.УстановитьЗначениеПоля("Osnovan",СтрокаДок.ДополнительноОснованиеУвольнение);
        Базавыгрузки.УстановитьЗначениеПоля("DKDnei",СтрокаДок.ДнейКомпенсации);

        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументУвольнениеИзОрганизаций()

Функция ВыгрузитьДокументКомандировкиОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерПриказа;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    //GUIDPodr = Источник.ПодразделениеОрганизации.УникальныйИдентификатор();
    CelKom = Источник.ОрганизацияНазначения.Наименование;
    Vid = Источник.ВидКомандирования;
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        //БазаВыгрузки.УстановитьЗначениеПоля("GUIDPodr", GUIDPodr);
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачала, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(СтрокаДок.ДатаОкончания, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("CelKom", CelKom);
        Если Vid = 1 Тогда
            МестоОтправленияИерархия = СтрокаДок.МестоОтправленияИерархия.УникальныйИдентификатор();
        	МестоОтправления         = СтрокаДок.МестоОтправления.УникальныйИдентификатор();
        Иначе
            МестоОтправленияИерархия = "";
        	МестоОтправления         = "";
        КонецЕсли; 
        БазаВыгрузки.УстановитьЗначениеПоля("OtKuda1", МестоОтправленияИерархия);
        БазаВыгрузки.УстановитьЗначениеПоля("OtKuda2", МестоОтправления);
        БазаВыгрузки.УстановитьЗначениеПоля("Kuda", СтрокаДок.МестоНазначения.УникальныйИдентификатор());
        БазаВыгрузки.УстановитьЗначениеПоля("Vid", Vid);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументУвольнениеИзОрганизаций()

Процедура ДобавитьЗаписьПоОсновномуОтпуску(Источник,БазаВыгрузки,Сотрудник = Неопределено,КоличествоДопДней = 0,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерПриказа;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.РаботникиОрганизации.Количество();
    Для каждого СтрокаДок Из Источник.РаботникиОрганизации Цикл
        Если Сотрудник <> Неопределено Тогда
            Если СтрокаДок.Сотрудник <> Сотрудник Тогда
                Продолжить;
            КонецЕсли;
        КонецЕсли; 
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", 0);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", 0);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        ДнейОтпуска = СтрокаДок.КоличествоДней - КоличествоДопДней;
        Компенсация = СтрокаДок.КоличествоДнейКомпенсации;
        ПричинаОтсутствия = СтрокаДок.ПричинаОтсутствия;
        ВидОтпуска = 2; // ОсновнойОтпуск
        Если ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.Компенсация Тогда
            Продолжить;
            Компенсация = Компенсация + ДнейОтпуска;
            ДнейОтпуска = 0;
        Иначе
            Если ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыСемейноБытовыеПричины
                 или  ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускБезСохраненияЗарплатыУчебныеСборы
                 или  ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускПоУходуЗаРебенком
                 или  ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебный
                 или  ПричинаОтсутствия = Перечисления.ПричиныОтсутствияНаРаботеВОрганизации.ОтпускУчебныйНеоплачиваемый
                Тогда
                Продолжить;
                 ВидОтпуска = 10; //По колл. договору
             КонецЕсли; 
        КонецЕсли;
        
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачала, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(СтрокаДок.ДатаОкончания, "ДФ=dd.MM.yyyy"));
        Базавыгрузки.УстановитьЗначениеПоля("DKDnei",Компенсация);
        БазаВыгрузки.УстановитьЗначениеПоля("RGodS", Формат(СтрокаДок.РабочийГодС, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("RGodPo", Формат(СтрокаДок.РабочийГодПо, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("VidOtp", ВидОтпуска);
        БазаВыгрузки.УстановитьЗначениеПоля("DniOtp", ДнейОтпуска);
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
КонецПроцедуры
 
Функция ВыгрузитьДокументОтпускаОрганизаций(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерПриказа;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    Если Источник.Отпуска.Количество() > 0 Тогда
        ТекСотрудник = Неопределено;
        КоличествоДопДней = 0;
        ПервыйОбход = 1;
        ВсегоСтрок = Источник.Отпуска.Количество();
        Для каждого СтрокаДок Из Источник.Отпуска Цикл
            Сотрудник = СтрокаДок.Сотрудник;
            Если Сотрудник <> ТекСотрудник Тогда
                 Если ПервыйОбход = 1 Тогда
                     ТекСотрудник = Сотрудник;
                     ПервыйОбход = 0;
                 Иначе	
                     ДобавитьЗаписьПоОсновномуОтпуску(Источник,БазаВыгрузки,ТекСотрудник,КоличествоДопДней,ТекущееСобытие);
                     ТекСотрудник = Сотрудник;
                     ПервыйОбход = 0;
                     КоличествоДопДней = 0;
                 КонецЕсли;
            КонецЕсли;
            
            БазаВыгрузки.Добавить();
            БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
            БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
            БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
            БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
            БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
            БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
            БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
            БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
            
            БазаВыгрузки.УстановитьЗначениеПоля("VidOtp", Число(СтрокаДок.ВидОтпуска.Код));
            БазаВыгрузки.УстановитьЗначениеПоля("DniOtp", СтрокаДок.КоличествоДней);
            БазаВыгрузки.УстановитьЗначениеПоля("RGodSv", Формат(СтрокаДок.РабочийГодС, "ДФ=dd.MM.yyyy"));
            БазаВыгрузки.УстановитьЗначениеПоля("RGodPov", Формат(СтрокаДок.РабочийГодПо, "ДФ=dd.MM.yyyy"));
            
            Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
            БазаВыгрузки.Записать();
            КоличествоДопДней = КоличествоДопДней + СтрокаДок.КоличествоДней;
        КонецЦикла;
        ДобавитьЗаписьПоОсновномуОтпуску(Источник,БазаВыгрузки,ТекСотрудник,КоличествоДопДней,ТекущееСобытие);
    Иначе
        ДобавитьЗаписьПоОсновномуОтпуску(Источник,БазаВыгрузки,,,ТекущееСобытие);
    КонецЕсли;

    Возврат Истина;
КонецФункции // ВыгрузитьДокументОтпускаОрганизаций()

Функция ВыгрузитьДокументНачислениеПоБольничномуЛисту(Источник,БазаВыгрузки,ТекущееСобытие)
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    БазаВыгрузки.Добавить();
    БазаВыгрузки.УстановитьЗначениеПоля("GUID", Источник.Ссылка.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc", Источник.Номер);
    БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  Источник.Дата);
    БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", Источник.Сотрудник.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("SeriaBol", Источник.СерияВходящегоДокумента);
    БазаВыгрузки.УстановитьЗначениеПоля("NomerBol", Источник.НомерВходящегоДокумента);
    БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", 0);
    БазаВыгрузки.УстановитьЗначениеПоля("TekStr", 0);
        
    ВидБольничного = Источник.ПричинаНетрудоспособности;
    ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности;
    Если ВидБольничного = ПричинаНетрудоспособности.ОбщееЗаболевание Тогда
        ВидБЛ = 1;
    //ИначеЕсли ВидБольничного = ПричинаНетрудоспособности.ПоУходу Тогда
    //    ВидБЛ = 2;
    ИначеЕсли ВидБольничного = ПричинаНетрудоспособности.ПоБеременностиИРодам Тогда
        ВидБЛ = 3;
    ИначеЕсли ВидБольничного = ПричинаНетрудоспособности.ТравмаНаПроизводстве Тогда
        ВидБЛ = 4;
    ИначеЕсли ВидБольничного = ПричинаНетрудоспособности.ТравмаВБыту Тогда
        ВидБЛ = 5;
    ИначеЕсли ВидБольничного = ПричинаНетрудоспособности.БольничныйЛистАлкоголь Тогда
        ВидБЛ = 6;
    Иначе
        ВидБЛ = 2;
    КонецЕсли; 
    Базавыгрузки.УстановитьЗначениеПоля("VidBol",ВидБЛ);
    БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(Источник.ДатаНачала, "ДФ=dd.MM.yyyy"));
    БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(Источник.ДатаОкончания, "ДФ=dd.MM.yyyy"));
    
    Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
    БазаВыгрузки.Записать();
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументНачислениеПоБольничномуЛисту()

Функция ВыгрузитьДокументНевыходыВОрганизациях(Источник,БазаВыгрузки,ТекущееСобытие)

    GUID = Источник.Ссылка.УникальныйИдентификатор();
	NomerDoc = Источник.Номер;
    DataDoc = Источник.Дата;
    NomPrik = Источник.НомерПриказа;
    DataPrik = Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy");
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    ВсегоСтрок = Источник.Начисления.Количество();
    Для каждого СтрокаДок Из Источник.Начисления Цикл
        БазаВыгрузки.Добавить();
        БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", ВсегоСтрок);
        БазаВыгрузки.УстановитьЗначениеПоля("TekStr", СтрокаДок.НомерСтроки);
        БазаВыгрузки.УстановитьЗначениеПоля("GUID", GUID);
        БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc",  NomerDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  DataDoc);
        БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  NomPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  DataPrik);
        БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", СтрокаДок.Сотрудник.УникальныйИдентификатор());
        Vid = 5;
        НаименованиеВида = Врег(СокрЛП(СтрокаДок.ВидРасчета.Наименование));
        Если НаименованиеВида = "ОТПУСК ЗА СВОЙ СЧЕТ" Тогда
            Vid = 1;
        ИначеЕсли НаименованиеВида = Врег("Дополнительный учебный отпуск без оплаты") Тогда
            Vid = 2;
        ИначеЕсли НаименованиеВида = Врег("Отпуск без оплаты") Тогда
            Vid = 3;
        ИначеЕсли НаименованиеВида = Врег("Отпуск по инициативе нанимателя") Тогда
            Vid = 4;
        КонецЕсли;
        
        БазаВыгрузки.УстановитьЗначениеПоля("Vid", Vid);
        БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(СтрокаДок.ДатаНачала, "ДФ=dd.MM.yyyy"));
        БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(СтрокаДок.ДатаОкончания, "ДФ=dd.MM.yyyy"));
        
        
        Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
        БазаВыгрузки.Записать();
    КонецЦикла;
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументНевыходыВОрганизациях()

Функция ВыгрузитьДокументОтпускПоУходуЗаРебенком(Источник,БазаВыгрузки,ТекущееСобытие)
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    БазаВыгрузки.Добавить();
    БазаВыгрузки.УстановитьЗначениеПоля("GUID", Источник.Ссылка.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc", Источник.Номер);
    БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  Источник.Дата);
    БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  Источник.НомерПриказаОбОкончанииОтпускаПл);
    БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  Формат(Источник.ДатаПриказаОбОкончанииОтпускаПл, "ДФ=dd.MM.yyyy"));
    БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", Источник.Сотрудник.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", 0);
    БазаВыгрузки.УстановитьЗначениеПоля("TekStr", 0);
        
    БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(Источник.ДатаНачала, "ДФ=dd.MM.yyyy"));
    БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(Источник.ДатаОкончания, "ДФ=dd.MM.yyyy"));
    
    Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
    БазаВыгрузки.Записать();
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументОтпускПоУходуЗаРебенком()

Функция ВыгрузитьДокументОтзывИзОтпуска(Источник,БазаВыгрузки,ТекущееСобытие)
    
    Если Источник.Проведен и ТекущееСобытие = "Запись" Тогда
        Пометка = 1;
    ИначеЕсли Источник.ПометкаУдаления и ТекущееСобытие = "Удаление" Тогда
        Пометка = -1;
    Иначе
        Пометка = -2;
    КонецЕсли; 
    
    БазаВыгрузки.Добавить();
    БазаВыгрузки.УстановитьЗначениеПоля("GUID", Источник.Ссылка.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("NomerDoc", Источник.Номер);
    БазаВыгрузки.УстановитьЗначениеПоля("DataDoc",  Источник.Дата);
    БазаВыгрузки.УстановитьЗначениеПоля("NomPrik",  Источник.НомерПриказа);
    БазаВыгрузки.УстановитьЗначениеПоля("DataPrik",  Формат(Источник.ДатаПриказа, "ДФ=dd.MM.yyyy"));
    БазаВыгрузки.УстановитьЗначениеПоля("GUIDSotr", Источник.Сотрудник.УникальныйИдентификатор());
    БазаВыгрузки.УстановитьЗначениеПоля("VsegoStr", 0);
    БазаВыгрузки.УстановитьЗначениеПоля("TekStr", 0);
    
    БазаВыгрузки.УстановитьЗначениеПоля("DataS",Формат(Источник.ДатаНачала, "ДФ=dd.MM.yyyy"));
    БазаВыгрузки.УстановитьЗначениеПоля("DataPo",Формат(Источник.ДатаОкончания, "ДФ=dd.MM.yyyy"));
    
    ТипыОтзыва = Перечисления.ТипыОтзываИзОтпуска;
    ТекТип = Источник.ТипОтзыва;
    Если ТекТип = ТипыОтзыва.Компенсация Тогда
        Вид = 1;
    ИначеЕсли ТекТип = ТипыОтзыва.Перенос Тогда
        Вид = 2;
    Иначе
        Вид = 3;
    КонецЕсли;
    
    БазаВыгрузки.УстановитьЗначениеПоля("Vid", Вид);
    БазаВыгрузки.УстановитьЗначениеПоля("DKDnei", Источник.Компенсация);
    БазаВыгрузки.УстановитьЗначениеПоля("DniOtp", Источник.НеиспольуемаяЧасть);
    
    Базавыгрузки.УстановитьЗначениеПоля("Prov",Пометка);
    БазаВыгрузки.Записать();
    
    Возврат Истина;
КонецФункции // ВыгрузитьДокументОтзывИзОтпуска()

