//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
Перем мДлинаСуток;
//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение(ПостроительЗапроса = Неопределено, Знач ФизЛицо = Неопределено) Экспорт

	//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
	ВР_СправкаПоУходу = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Справка по уходу", Истина );
	ВР_НеОплачиваемыйБольничный = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Неоплачиваемый больничный", Истина );
	ВР_Не_ОплачиваемыйБольничный = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Не оплачиваемый больничный", Истина );
	ВР_БольничныйБезОплаты = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НайтиПоНаименованию( "Больничный без оплаты", Истина );
	МассивКод15 = Новый Массив(4);
	МассивКод15[0] = ВР_СправкаПоУходу; МассивКод15[1] = ВР_НеОплачиваемыйБольничный; МассивКод15[2] = ВР_БольничныйБезОплаты;
	МассивКод15[3] = ВР_Не_ОплачиваемыйБольничный;
	//- СВЭЙ КДЯ 07.06.19 СВФР-004424
	
	Сч1 = 0;
	СписокПустыхНомеровПФР = Новый СписокЗначений;
	СписокПустыхНомеровПФР.Добавить("");
	СписокПустыхНомеровПФР.Добавить("              ");
	
	СписокПричин = Новый СписокЗначений;
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.Увольнение);
	СписокПричин.Добавить(Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ГоловнаяОрганизация",				ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	//Запрос.УстановитьПараметр("Организация",				Организация);
	//Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Договор = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ДОГОВОР");
	Если Договор.Пустая() тогда
		ДоговорОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		ДоговорОбъект.Код = "ДОГОВОР";
		ДоговорОбъект.Наименование = "Работа, выполняемая на основе гражданско-правовых договоров (предметом которых являются оказание услуг, выполнение работ и создание объектов интеллектуальной собственности) у юридических лиц и индивидуальных предпринимателей";
		ДоговорОбъект.Записать();
		Договор = ДоговорОбъект.Ссылка;
	КонецЕсли;
	Дети = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ДЕТИ");
	Если Дети.Пустая() тогда
		ДетиОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		ДетиОбъект.Код = "ДЕТИ";
		ДетиОбъект.Наименование = "Период отпуска по уходу за ребенком и ухода за детьми до достижения ими возраста 3 лет";
		ДетиОбъект.Записать();
		Дети = ДетиОбъект.Ссылка;
	КонецЕсли;
	//Островская Татьяна 05.03.2014 № 17172
	Пособие = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПОСОБИЕ");
	Если Пособие.Пустая() тогда
		ПособиеОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		ПособиеОбъект.Код = "ПОСОБИЕ";
		ПособиеОбъект.Наименование = "Пособие";
		ПособиеОбъект.Записать();
		Пособие = ПособиеОбъект.Ссылка;
	КонецЕсли;
	
	ВзносыВрем = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ВЗНОСЫВРЕМ");
	Если ВзносыВрем.Пустая() тогда
		ВзносыВремОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		ВзносыВремОбъект.Код = "ВЗНОСЫВРЕМ";
		ВзносыВремОбъект.Наименование = "Вносы врем.";
		ВзносыВремОбъект.Записать();
		ВзносыВрем = ВзносыВремОбъект.Ссылка;
	КонецЕсли;
	
	Премия = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПРЕМИЯ");
	Если Премия.Пустая() тогда
		ПремияОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		ПремияОбъект.Код = "ПРЕМИЯ";
		ПремияОбъект.Наименование = "Премия";
		ПремияОбъект.Записать();
		Премия = ПремияОбъект.Ссылка;
	КонецЕсли;
	//О.Т. Аверсон 18.05.2018 № 1985
	СТРАХСЛУЧ = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("СТРАХСЛУЧ");
	Если СТРАХСЛУЧ.Пустая() тогда
		СТРАХСЛУЧОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		СТРАХСЛУЧОбъект.Код = "СТРАХСЛУЧ";
		СТРАХСЛУЧОбъект.Наименование = "СтрахСлуч";
		СТРАХСЛУЧОбъект.Записать();
		СТРАХСЛУЧ = СТРАХСЛУЧОбъект.Ссылка;
	КонецЕсли;
	//О.Т. Аверсон 18.05.2018 № 1985

	//О.Т. Аверсон 14.05.2019 № 4328
	НеоплДог = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("НЕОПЛДОГ");
	Если НеоплДог.Пустая() тогда
		НеоплДогОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
		НеоплДогОбъект.Код = "НЕОПЛДОГ";
		НеоплДогОбъект.Наименование = "Неопл.дог";
		НеоплДогОбъект.Записать();
		НеоплДог = НеоплДогОбъект.Ссылка;
	КонецЕсли;
	
	//О.Т. Аверсон 14.05.2019 № 4328
	
	//Островская Татьяна 05.03.2014 № 17172
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	Запрос.УстановитьПараметр( "Организация", ЭтотОбъект.Организация );
	Запрос.УстановитьПараметр( "ПоВсемФизЛицам", ФизЛицо = Неопределено );
	Запрос.УстановитьПараметр( "ФизЛицо", ФизЛицо );
	Запрос.УстановитьПараметр( "ВсеСотрудники", ЭтотОбъект.ВсеСотрудники );
	Запрос.УстановитьПараметр( "Основные", ЭтотОбъект.Основные );
	Запрос.УстановитьПараметр( "ДогПодряда", ЭтотОбъект.ДогПодряда );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	//О.Т. Аверсон 17.01.2018 № 1455
	Если ПостроительЗапроса = Неопределено Тогда
		
		// кнопка "Заполнить по всем работникам" и кнопка "Добавить (+)"
		
		Запрос.Текст = "ВЫБРАТЬ
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		//|	РаботникиОрганизаций.Физлицо КАК Ссылка
		//|ИЗ
		//|	Справочник.СотрудникиОрганизаций КАК РаботникиОрганизаций
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ТипРаботника КАК ТипРаботника,
		|	Сотрудники.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК Сотрудники
		|ГДЕ
		|	( &ВсеСотрудники
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		//|	ИЛИ &Основные И Сотрудники.ТипРаботника <> ЗНАЧЕНИЕ( Перечисление.ТипыРаботников.ДоговорПодряда )
		//|	ИЛИ &ДогПодряда И Сотрудники.ТипРаботника = ЗНАЧЕНИЕ( Перечисление.ТипыРаботников.ДоговорПодряда ) )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|	ИЛИ &Основные И Сотрудники.ВидДоговора <> ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.Подряда )
		|	ИЛИ &ДогПодряда И Сотрудники.ВидДоговора = ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.Подряда ) )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|   И ( &ПоВсемФизЛицам ИЛИ ФизЛицо = &ФизЛицо )
		|	И Сотрудники.Организация = &Организация
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование	
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|";
		
		// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		//СписокСотрудников = Запрос.Выполнить().Выгрузить();
		// - СВЭЙ КДЯ 29.07.19 СВФР-004561
		
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		//// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		//МассивФизическихЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "Ссылка" );
		//// - СВЭЙ КДЯ 29.07.19 СВФР-004561
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
		ТЗ_Сотрудников = Запрос.Выполнить().Выгрузить();
		МассивФизическихЛиц = ТЗ_Сотрудников.ВыгрузитьКолонку( "ФизЛицо" );
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) - 
		//МассивСотрудников = ТЗ_Сотрудников.ВыгрузитьКолонку( "Сотрудник" );
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		
	Иначе
		
		ИсходныйТекстПостроителя = ПостроительЗапроса.Текст;
		ТекстЗапросаПоСпискуРаботников = СтрЗаменить(ИсходныйТекстПостроителя,"РАЗРЕШЕННЫЕ","");
		ПостроительЗапроса.Текст = ТекстЗапросаПоСпискуРаботников;
		ПостроительЗапроса.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ПостроительЗапроса.Выполнить();
		СотрудникиТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		//|	СписокРаботников.ФизЛицо КАК Ссылка
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|	СписокРаботников.Сотрудник КАК Сотрудник,
		|	СписокРаботников.Сотрудник.ТипРаботника КАК ТипРаботника,
		|	СписокРаботников.ФизЛицо КАК ФизЛицо
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|ИЗ
		|	ВТСписокРаботников КАК СписокРаботников
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|ГДЕ
		|	&ВсеСотрудники
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		//|	ИЛИ &Основные И СписокРаботников.Сотрудник.ТипРаботника <> ЗНАЧЕНИЕ( Перечисление.ТипыРаботников.ДоговорПодряда )
		//|	ИЛИ &ДогПодряда И СписокРаботников.Сотрудник.ТипРаботника = ЗНАЧЕНИЕ( Перечисление.ТипыРаботников.ДоговорПодряда )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|	ИЛИ &Основные И СписокРаботников.Сотрудник.ВидДоговора <> ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.Подряда )
		|	ИЛИ &ДогПодряда И СписокРаботников.Сотрудник.ВидДоговора = ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.Подряда )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|УПОРЯДОЧИТЬ ПО
		|	СписокРаботников.Сотрудник.Наименование	
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|";
		ПостроительЗапроса.Текст = СотрудникиТекст;
		
		// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		//ПостроительЗапроса.Выполнить();
		//СписокСотрудников = ПостроительЗапроса.Выполнить().Выгрузить();
		// - СВЭЙ КДЯ 29.07.19 СВФР-004561
		// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		//МассивФизическихЛиц = ПостроительЗапроса.Выполнить().Выгрузить().ВыгрузитьКолонку( "Ссылка" );
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		ПостроительЗапроса.УстановитьПараметр( "ВсеСотрудники", ЭтотОбъект.ВсеСотрудники );
		ПостроительЗапроса.УстановитьПараметр( "Основные", ЭтотОбъект.Основные );
		ПостроительЗапроса.УстановитьПараметр( "ДогПодряда", ЭтотОбъект.ДогПодряда );
		ТЗ_Сотрудников = ПостроительЗапроса.Выполнить().Выгрузить();
		//МассивСотрудников = ТЗ_Сотрудников.ВыгрузитьКолонку( "Сотрудник" );
		МассивФизическихЛиц = ТЗ_Сотрудников.ВыгрузитьКолонку( "ФизЛицо" );
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
		Если МассивФизическихЛиц.Количество() = 0 Тогда
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
		//Если МассивСотрудников.Количество() = 0 Тогда
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			Сообщить( "Не найдено ни одного сотрудника, соответствующего отбору!", СтатусСообщения.Важное );
			Возврат Истина;
		КонецЕсли; 
		// - СВЭЙ КДЯ 29.07.19 СВФР-004561
		
	КонецЕсли;
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
	Запрос.УстановитьПараметр( "СписокФизЛиц", МассивФизическихЛиц );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
	//Запрос.УстановитьПараметр( "МассивСотрудников", МассивСотрудников );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	ЗапросПособие = Новый Запрос;
	Если ФизЛицо = Неопределено Тогда 
		ПолучитьТаблицуПособий(ЗапросПособие);
	КонецЕсли;

	//О.Т. Аверсон 17.01.2018 № 1455
	
	//Островская Татьяна 20.01.2014 № 17051
	Запрос.УстановитьПараметр("КонецПрошлогоГода", НачалоГода(ДатаНачала)-1);//НачалоМесяца(ДатаРегистрации)-1);
	Запрос.УстановитьПараметр("НачалоГода", ДатаНачала);//НачалоГода(ДобавитьМесяц(НачалоКвартала(ДатаРегистрации),-1)));
	Запрос.УстановитьПараметр("КонецГода", конецГода(ДатаОкончания)); //конецГода(ДатаРегистрации)
	Запрос.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ВнСовместитель", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	Запрос.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
	// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. ) +
	Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
	// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. )
	Запрос.УстановитьПараметр("ДатаПодачиСведений", ДатаОкончания);//ДатаРегистрации);// дата акуальности сведений о доходах и налогах
	Запрос.УстановитьПараметр("Договор",Договор);  
	Запрос.УстановитьПараметр("Дети",Дети);
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) перенесено вверх
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("ПоВсемФизЛицам", ФизЛицо = Неопределено);
	//Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	Запрос.УстановитьПараметр("ПустойДоговор", Документы.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписокПустыхНомеровПФР",		СписокПустыхНомеровПФР);
	//Запрос.УстановитьПараметр("Увольнение",		СписокПричин);
	Запрос.УстановитьПараметр("ДатаНачала" , 		НачалоКвартала(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаАктуальности" , 	КонецКвартала(ДатаНачала));
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , 	Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , 	Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , 	Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	Запрос.УстановитьПараметр("ТипТелефон" , 	Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТипАдрес" , 	Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.НайтиПоКоду("112"));
	Запрос.УстановитьПараметр("ДоговораПодряда" , Справочники.КатегорииЗастрахованныхЛиц.НайтиПоРеквизиту("КодПФР","03"));
	Запрос.УстановитьПараметр("ПериодВзаиморасчетов" , ДатаОкончания);//КонецМесяца(ДобавитьМесяц(НачалоКвартала(ДатаРегистрации),-1)));
	Запрос.УстановитьПараметр("СотрудникПустоеЗначение" , Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	СписокВидРасчета = Новый СписокЗначений;
	СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	Запрос.УстановитьПараметр("ВидРасчета" , СписокВидРасчета);

	//О.Т. Аверсон 28.02.2019 № 3224
	СпособыПособия = Новый СписокЗначений;
	СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
		СпособыПособия.Добавить(стрПособ.ВидРасчета);
	КонецЦикла;  
	//О.Т. Аверсон 28.02.2019 № 3224
	
	Запрос.УстановитьПараметр("СпособРасчета" , СпособыПособия);
	
	//О.Т. Аверсон 28.02.2019 № 3224
	ВидыРасчетаПремия = Новый СписокЗначений;
	ВидыРасчетаПремия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
	для Каждого стрПособ из Справочники.ГруппыРасчетов.ПремияДляПУ.Основные Цикл 
		ВидыРасчетаПремия.Добавить(стрПособ.ВидРасчета);
	КонецЦикла;  
	//О.Т. Аверсон 28.02.2019 № 3224
	
	Запрос.УстановитьПараметр("ВидРасчетаПремия" , ВидыРасчетаПремия);
	Запрос.УстановитьПараметр("ОснНачисление_ОплатаБЛПоТравмеНаПроизводстве" , ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве); //ПСА 08.07.2019 СВФР-004373

	
	ДанныеОПравеНаПенсиюТекст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Периоды.Период,МЕСЯЦ) КАК Месяц,
	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО (ГражданствоФизЛиц.Период = Периоды.ПериодРегистра)
	|			И (ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо)
	|			И (ГражданствоФизЛиц.НеИмеетПравоНаПенсию)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц";
	Если ВыгрузкаДоговоровПодрядаБезОграничения Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСНИсчисленный.ПроцентФСЗН = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
		|		КОНЕЦ) КАК ПроцентФСЗН,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ВЫРАЗИТЬ((ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН) / 10000 КАК ЧИСЛО(15, 2))
		|			ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН
		|		КОНЕЦ) КАК Взносы
		|ПОМЕСТИТЬ ВТФСЗНИсчисленный
		|ИЗ
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
		|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) - 
		//|	РегистрНакопления.ЕСНИсчисленныйПоСотрудникам КАК ЕСНИсчисленный
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|ГДЕ
		|	ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
		|	И ЕСНИсчисленный.Период <= &ДатаПодачиСведений
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
		|	И ВЫБОР
		|		КОГДА &ПоВсемФизЛицам
		|			ТОГДА ЕСНИсчисленный.ФизЛицо В (&СписокФизЛиц)
		|			ИНАЧЕ ЕСНИсчисленный.ФизЛицо = &ФизЛицо
		|	КОНЕЦ
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
		//|	И ЕСНИсчисленный.Сотрудник В ( &МассивСотрудников )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|	И ЕСНИсчисленный.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСНИсчисленный.ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо,
		|	ПериодВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ
		|	Сумма(ВложЗапрос.Выплаты) КАК Выплаты,
		|	ВложЗапрос.ФизЛицо,
		|	ВложЗапрос.ПериодВзаиморасчетов,
		|	ВложЗапрос.Категория,
		|	ВложЗапрос.ДокументОснование,
		|	ВложЗапрос.ВидРасчетаОклад
		|	ПОМЕСТИТЬ ВТФСЗНДоходы
		|	ИЗ
		|	(ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
		|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ) КАК Выплаты,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Флаг
		|			ТОГДА &ДоговораПодряда
		|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.СтатусКатегория
		|	КОНЕЦ КАК Категория,
		|	ВложенныйЗапрос.Регистратор КАК ДокументОснование,
		|	СведДоходыОклад.ВидРасчета КАК ВидРасчетаОклад
		
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
		|			ВЫБОР
		|				КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ КАК Флаг
		|		ИЗ
		|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
		|		ГДЕ
		|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом
		|			И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация) КАК ВложенныйЗапрос
		|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ДокументОснование = ВложенныйЗапрос.Регистратор
		|			И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		|			НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|			""Оклад"" КАК ВидРасчета
		|		ИЗ
		|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ГДЕ
		|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
		|			И НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ) = &ПериодВзаиморасчетов
		|			И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|			НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)) КАК СведДоходыОклад
		|		ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = СведДоходыОклад.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведДоходыОклад.ПериодВзаиморасчетов, МЕСЯЦ))
		|ГДЕ
		|	ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоГода И &КонецГода
		|	//И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации <= &ДатаПодачиСведений
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
		|	И ВЫБОР
		|			КОГДА &ПоВсемФизЛицам
		|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо В (&СписокФизЛиц)
		|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|		КОНЕЦ
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
		//|	И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник В ( &МассивСотрудников )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|	И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
		|	И ДополнительныеНачисленияРаботниковОрганизаций.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Регистратор,
		|	СведДоходыОклад.ВидРасчета,
		|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ),
		|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Флаг
		|			ТОГДА &ДоговораПодряда
		|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо.СтатусКатегория
		|	КОНЕЦ ) КАК ВложЗапрос

		|	СГРУППИРОВАТЬ ПО
		|ВложЗапрос.ФизЛицо,
		|ВложЗапрос.ВидРасчетаОклад,
		|ВложЗапрос.ДокументОснование,
		|ВложЗапрос.Категория,
		|ВложЗапрос.ПериодВзаиморасчетов
		
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВложЗапрос.ФизЛицо,
		|	ВложЗапрос.ПериодВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|	ДанныеПоПособиям.ПериодВзаиморасчетов,
		|	ДанныеПоПособиям.ФизЛицо,
		|	СУММА(ДанныеПоПособиям.Пособия) КАК Пособия,
		|	ДанныеПоПособиям.Регистратор,
		|	ДанныеПоПособиям.ДокументОснованиеДатаОкончания
		|ПОМЕСТИТЬ ВТФСЗНПособия
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат * 10000
		|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ КАК Пособия,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор КАК Регистратор,
		|		МАКСИМУМ(ВТФСЗНДоходы.ДокументОснование.ДатаОкончания) КАК ДокументОснованиеДатаОкончания
		|	ИЗ
		|		ВТФСЗНДоходы КАК ВТФСЗНДоходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|			ПО ВТФСЗНДоходы.ФизЛицо = ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо
		|				И (ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ВТФСЗНДоходы.ДокументОснование.ДатаОкончания
		|					ИЛИ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ВТФСЗНДоходы.ДокументОснование.ДатаНачала
		|						И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало <= ВТФСЗНДоходы.ДокументОснование.ДатаОкончания)
		|	ГДЕ
		|		ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоГода И &КонецГода
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
		|		И ВЫБОР
		|				КОГДА &ПоВсемФизЛицам
		|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо В (&СписокФизЛиц)
		|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
		|			КОНЕЦ
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
		//|		И ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник В ( &МассивСотрудников )
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
		|		И ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
		|		И ДополнительныеНачисленияРаботниковОрганизаций.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛистуПоДоговорамПодряда
		|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СпособРасчета)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ),
		|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|		ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
		|			КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало < ДАТАВРЕМЯ(2016, 7, 1)
		|					И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации >= ДАТАВРЕМЯ(2016, 7, 1)
		|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат * 10000
		|			ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		|		КОНЕЦ) КАК ДанныеПоПособиям

		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоПособиям.ПериодВзаиморасчетов,
		|	ДанныеПоПособиям.ФизЛицо,
		|	ДанныеПоПособиям.Регистратор,
		|	ДанныеПоПособиям.ДокументОснованиеДатаОкончания

		|;
		|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		//|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
		//|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		Периоды.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		//|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
		//|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
		//|	ИЗ
		//|		ВТФСЗНДоходы КАК Периоды
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		//|			ПО Периоды.ПериодВзаиморасчетов >= ГражданствоФизЛиц.Период
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		ГражданствоФизЛиц.ФизЛицо,
		//|		Периоды.ПериодВзаиморасчетов) КАК Периоды
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		//|		ПО (ГражданствоФизЛиц.Период = Периоды.ПериодВзаиморасчетов)
		//|			И (ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ГражданствоФизЛиц.ФизЛицо,
		//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ)
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Физлицо,
		//|	ПериодВзаиморасчетов
		//|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТФСЗНДоходы.ФизЛицо КАК ФизЛицо,
		|	ВТФСЗНДоходы.ПериодВзаиморасчетов КАК Месяц,
		|	ЕСТЬNULL(ВТФСЗНИсчисленный.Взносы, 0) КАК Взносы,
		|	ЕСТЬNULL(ВТФСЗНИсчисленный.ПроцентФСЗН, 35) КАК ТарифВзносов,
		|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
		|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
		|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
		|	ДомашниеТелефоны.Поле3 КАК Телефоны,
		|	ВЫБОР
		|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
		|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
		|			ТОГДА &СтранаПоУмолчанию
		|		ИНАЧЕ ГражданствоФизЛиц.Страна
		|	КОНЕЦ КАК Гражданство,
		|	ВТФСЗНДоходы.ФизЛицо.Пол КАК Пол,
		|	ВТФСЗНДоходы.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ВТФСЗНДоходы.ФизЛицо.МестоРождения КАК МестоРождения,
		|	ВТФСЗНДоходы.Категория,
		|	ЕСТЬNULL(ВТФСЗНДоходы.Выплаты, 0) КАК Выплаты,
		|	ЕСТЬNULL(ВТФСЗНПособия.Пособия, 0) КАК Пособия,
		|	ВТФСЗНДоходы.ДокументОснование КАК Договор,
		|	ЕСТЬNULL(ВТФСЗНДоходы.ВидРасчетаОклад, 1) КАК ВидРасчетаОклад,
		|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
		|	ВТФСЗНПособия.ФизЛицо КАК ФизЛицо1
		|ИЗ
		|	ВТФСЗНДоходы КАК ВТФСЗНДоходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФСЗНИсчисленный КАК ВТФСЗНИсчисленный
		|		ПО ВТФСЗНДоходы.ФизЛицо = ВТФСЗНИсчисленный.ФизЛицо
		|			И ВТФСЗНДоходы.ПериодВзаиморасчетов = ВТФСЗНИсчисленный.ПериодВзаиморасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
		|		ПО ВТФСЗНДоходы.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаРегистрации.Объект
		|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
		|			И (АдресаРегистрации.Тип = &ТипАдрес)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаФактические.Объект
		|			И (АдресаФактические.Тип = &ТипАдрес)
		|			И (АдресаФактические.Вид = &ВидАдресаФактический)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
		|		ПО ВТФСЗНДоходы.ФизЛицо = ДомашниеТелефоны.Объект
		|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
		|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО ВТФСЗНДоходы.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаПодачиСведений, ) КАК ГражданствоФизЛиц
		|		ПО ВТФСЗНДоходы.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФСЗНПособия КАК ВТФСЗНПособия
		|		ПО ВТФСЗНДоходы.ФизЛицо = ВТФСЗНПособия.ФизЛицо
		|			И ВТФСЗНДоходы.ДокументОснование.ДатаОкончания = ВТФСЗНПособия.ДокументОснованиеДатаОкончания
		|ГДЕ
		|	ВТФСЗНДоходы.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов
		|	И ВТФСЗНДоходы.ДокументОснование <> &ПустойДоговор
		|	И (ЕСТЬNULL(ВТФСЗНДоходы.ВидРасчетаОклад, 1) = 1
		|			ИЛИ ЕСТЬNULL(ВТФСЗНДоходы.ДокументОснование, 1) <> 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТФСЗНДоходы.ФизЛицо.Наименование,
		//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
		|	ВТФСЗНДоходы.ФизЛицо.Код,
		//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
		|	Месяц
		|ИТОГИ
		|	СУММА(Выплаты)
		|ПО
		|	ФизЛицо,
		|	Месяц";
		//О.Т. Аверсон 04.03.2016 № 940
		Если ОтборПоПериодуВзаиморасчетов Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации <= &ДатаПодачиСведений","");
		иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации <= &ДатаПодачиСведений","И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации <= &ДатаПодачиСведений");
		КонецЕсли;
		//О.Т. Аверсон 04.03.2016 № 940
		Результат = Запрос.Выполнить();
		
	иначе
		
		если ДогПодряда или ВсеСотрудники Тогда 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСНИсчисленный.ПроцентФСЗН = 0
			|				ТОГДА 1
			|			ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
			|		КОНЕЦ) КАК ПроцентФСЗН,
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|				И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|			ТОГДА ВЫРАЗИТЬ((ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН) / 10000 КАК ЧИСЛО(15, 2))
			|		ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН
			|	КОНЕЦ) КАК Взносы
			|ПОМЕСТИТЬ ВТФСЗНИсчисленный
			|ИЗ
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	РегистрНакопления.ЕСНИсчисленныйПоСотрудникам КАК ЕСНИсчисленный
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|ГДЕ
			|	ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	И ЕСНИсчисленный.Период <= &ДатаПодачиСведений
			|	И ЕСНИсчисленный.Организация = &Организация
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	И (выбор когда &ПоВсемФизЛицам тогда ЕСНИсчисленный.ФизЛицо в (&СписокФизЛиц) иначе ЕСНИсчисленный.ФизЛицо = &ФизЛицо конец)
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	И ЕСНИсчисленный.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСНИсчисленный.ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизЛицо,
			|	ПериодВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|	ВЫБРАТЬ
			|	Сумма(ВложЗапрос.Пособия) как Пособия,
			|	Сумма(ВложЗапрос.Выплаты) как Выплаты,
			|	ВложЗапрос.ФизЛицо,
			|	ВложЗапрос.ПериодВзаиморасчетов,
			|	ВложЗапрос.Категория,
			|	ВложЗапрос.ДокументОснование,
			|	ВложЗапрос.ВидРасчетаОклад
			|ПОМЕСТИТЬ ВТФСЗНДоходы
			|	ИЗ
			|	(ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
			|				И НЕ ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций
			|				И НЕ ЕСНСведенияОДоходах.ВидРасчета = &ОснНачисление_ОплатаБЛПоТравмеНаПроизводстве  // ПСА 08.07.2019 СВФР-004373
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					КОГДА ЕСНСведенияОДоходах.ПериодВзаиморасчетов < ДАТАВРЕМЯ(2016, 7, 1) //О.Т. Аверсон 01.02.2017 № 234
			|							И ЕСНСведенияОДоходах.Период >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ЕСНСведенияОДоходах.Результат * 10000
			|					ИНАЧЕ ЕСНСведенияОДоходах.Результат
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК Пособия,
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ЕСНСведенияОДоходах.Результат
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК Выплаты,
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	СУММА(
			//|			ВЫБОР
			//|				КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			//|						И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			//|					ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			//|				ИНАЧЕ ЕСНСведенияОДоходах.Результат
			//|			КОНЕЦ
			//|		) КАК Выплаты,
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|	КОНЕЦ КАК ПериодВзаиморасчетов,
			//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Флаг
			|			ТОГДА &ДоговораПодряда
			|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|	КОНЕЦ КАК Категория,
			|	ВложенныйЗапрос.Регистратор КАК ДокументОснование,
			|	СведДоходыОклад.ВидРасчета КАК ВидРасчетаОклад
			
			|ИЗ
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация,
			|			ВЫБОР
			|				КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
			|					ТОГДА ЛОЖЬ
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ КАК Флаг
			|		ИЗ
			|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ГДЕ
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом
			|			И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация) КАК ВложенныйЗапрос
			|		ПО ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
			|			И (ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ ВложенныйЗапрос.Регистратор.ДатаНачала И ВложенныйЗапрос.Регистратор.ДатаОкончания) //О.Т. Аверсон 14.03.2019 № 4084(убрала нач и кон мес)
			|			И ЕСНСведенияОДоходах.Организация = ВложенныйЗапрос.Организация
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	СведенияОДоходах1.ФизЛицо КАК ФизЛицо,
			|	СведенияОДоходах1.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СведенияОДоходах1.ВидРасчета КАК ВидРасчета
			|ИЗ
			|	( ВЫБРАТЬ
			|		ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|		ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|		КОНЕЦ КАК ПериодВзаиморасчетов,   
			//|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|		""Оклад"" КАК ВидРасчета //О.Т. 30.09.2015 № 616
			|	ИЗ
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|		РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|	ГДЕ
			|		ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчета)
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561
			|		И ЕСНСведенияОДоходах.Организация = &Организация
			// - СВЭЙ КДЯ 22.07.19 СВФР-004561
			//О.Т. Аверсон 24.04.2019 № 4274
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|		И ВЫБОР
			|			КОГДА &ПоВсемФизЛицам
			|				ТОГДА ЕСНСведенияОДоходах.ФизЛицо В (&СписокФизЛиц)
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|		КОНЕЦ
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|		И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|		И ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия)
			|				ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоГода И &КонецГода
			|				ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|		КОНЕЦ
			//О.Т. Аверсон 24.04.2019 № 4274
					
			|		
			|	СГРУППИРОВАТЬ ПО
			|		ЕСНСведенияОДоходах.ФизЛицо,
			|		НАЧАЛОПЕРИОДА( ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ ),
			|		НАЧАЛОПЕРИОДА( ЕСНСведенияОДоходах.Период, МЕСЯЦ ),
			|		ЕСНСведенияОДоходах.ВидРасчета,
			|		ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|		КОНЕЦ,

			|		""Оклад"" ) КАК СведенияОДоходах1
			
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах1.ФизЛицо,
			|	СведенияОДоходах1.ПериодВзаиморасчетов,
			|	СведенияОДоходах1.ВидРасчета ) КАК СведДоходыОклад //О.Т. 30.09.2015 № 616
			|		ПО ЕСНСведенияОДоходах.ФизЛицо = СведДоходыОклад.ФизЛицо
			|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведДоходыОклад.ПериодВзаиморасчетов, МЕСЯЦ))
			|ГДЕ
			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоГода И &КонецГода
			|		ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	КОНЕЦ

			//|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	И (ВЫБОР
			|	КОГДА &ПоВсемФизЛицам
			|		ТОГДА ЕСНСведенияОДоходах.ФизЛицо В (&СписокФизЛиц)
			|	ИНАЧЕ
			|		 ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо КОНЕЦ)
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|   И ЕСНСведенияОДоходах.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСНСведенияОДоходах.ФизЛицо,
			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|	КОНЕЦ,
			//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ),
			|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|	ЕСНСведенияОДоходах.ВидРасчета,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Флаг
			|			ТОГДА &ДоговораПодряда
			|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|	КОНЕЦ,
			|	ВложенныйЗапрос.Регистратор,
			|	СведДоходыОклад.ВидРасчета,
			|	ЕСНСведенияОДоходах.ВидРасчета ) КАК ВложЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложЗапрос.ФизЛицо,
			|	ВложЗапрос.ВидРасчетаОклад,
			|	ВложЗапрос.ДокументОснование,
			|	ВложЗапрос.Категория,
			|	ВложЗапрос.ПериодВзаиморасчетов
			//|ВложЗапрос.Пособия
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВложЗапрос.ФизЛицо,
			|	ВложЗапрос.ПериодВзаиморасчетов
			|;

			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			//|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
			//|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
			//|ИЗ
			//|	(ВЫБРАТЬ
			//|		Периоды.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			//|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
			//|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
			//|	ИЗ
			//|		ВТФСЗНДоходы КАК Периоды
			//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
			//|			ПО Периоды.ПериодВзаиморасчетов >= ГражданствоФизЛиц.Период
			//|	
			//|	СГРУППИРОВАТЬ ПО
			//|		ГражданствоФизЛиц.ФизЛицо,
			//|		Периоды.ПериодВзаиморасчетов) КАК Периоды
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
			//|		ПО (ГражданствоФизЛиц.Период = Периоды.ПериодВзаиморасчетов)
			//|			И (ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо)
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ГражданствоФизЛиц.ФизЛицо,
			//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ)
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Физлицо,
			//|	ПериодВзаиморасчетов
			//|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТФСЗНДоходы.ФизЛицо КАК ФизЛицо,
			|	ВТФСЗНДоходы.ПериодВзаиморасчетов КАК Месяц,
			|	ЕСТЬNULL(ВТФСЗНИсчисленный.Взносы, 0) КАК Взносы,
			|	ЕСТЬNULL(ВТФСЗНИсчисленный.ПроцентФСЗН, 35) КАК ТарифВзносов,
			|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
			|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
			|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
			|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
			|	ДомашниеТелефоны.Поле3 КАК Телефоны,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ КАК Гражданство,
			|	ВТФСЗНДоходы.ФизЛицо.Пол КАК Пол,
			|	ВТФСЗНДоходы.ФизЛицо.ДатаРождения КАК ДатаРождения,
			|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
			|	ВТФСЗНДоходы.ФизЛицо.МестоРождения КАК МестоРождения,
			|	ВТФСЗНДоходы.Категория,
			|	ЕСТЬNULL(ВТФСЗНДоходы.Выплаты, 0) КАК Выплаты,
			|	ЕСТЬNULL(ВТФСЗНДоходы.Пособия, 0) КАК Пособия,
			|	ВТФСЗНДоходы.ДокументОснование КАК Договор,
			|	ЕСТЬNULL(ВТФСЗНДоходы.ВидРасчетаОклад, 1) КАК ВидРасчетаОклад,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
			|ИЗ
			|	ВТФСЗНДоходы КАК ВТФСЗНДоходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФСЗНИсчисленный КАК ВТФСЗНИсчисленный
			|		ПО ВТФСЗНДоходы.ФизЛицо = ВТФСЗНИсчисленный.ФизЛицо
			|			И ВТФСЗНДоходы.ПериодВзаиморасчетов = ВТФСЗНИсчисленный.ПериодВзаиморасчетов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
			|		ПО ВТФСЗНДоходы.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
			|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаРегистрации.Объект
			|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
			|			И (АдресаРегистрации.Тип = &ТипАдрес)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
			|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаФактические.Объект
			|			И (АдресаФактические.Тип = &ТипАдрес)
			|			И (АдресаФактические.Вид = &ВидАдресаФактический)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
			|		ПО ВТФСЗНДоходы.ФизЛицо = ДомашниеТелефоны.Объект
			|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
			|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			|		ПО ВТФСЗНДоходы.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаПодачиСведений, ) КАК ГражданствоФизЛиц
			|		ПО ВТФСЗНДоходы.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
			|ГДЕ
			|	ВТФСЗНДоходы.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов
			|	И ВТФСЗНДоходы.ДокументОснование <> &ПустойДоговор
			|	И (ЕСТЬNULL(ВТФСЗНДоходы.ВидРасчетаОклад, 1) = 1 ИЛИ ЕСТЬNULL(ВТФСЗНДоходы.ДокументОснование, 1) <> 1)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТФСЗНДоходы.ФизЛицо.Наименование,
			//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
			|	ВТФСЗНДоходы.ФизЛицо.Код,
			//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
			|	Месяц
			|ИТОГИ
			|	СУММА(Выплаты)
			|ПО
			|	ФизЛицо,
			|	Месяц";
			//О.Т. Аверсон 04.03.2016 № 940
			Если ОтборПоПериодуВзаиморасчетов Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","");
			иначе                      
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений");
			КонецЕсли;
			//О.Т. Аверсон 04.03.2016 № 940
			Результат = Запрос.Выполнить();
		КонецЕсли;
		
		Если Основные или ВсеСотрудники Тогда 
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСНИсчисленный.ПроцентФСЗН = 0
			|				ТОГДА 1
			|			ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
			|		КОНЕЦ) КАК ПроцентФСЗН,
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНИсчисленный.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|				И ЕСНИсчисленный.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|			ТОГДА ВЫРАЗИТЬ((ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН) / 10000 КАК ЧИСЛО(15, 2))
			|		ИНАЧЕ ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН
			|	КОНЕЦ) КАК Взносы
			|ПОМЕСТИТЬ ВТФСЗНИсчисленный1
			|ИЗ
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	РегистрНакопления.ЕСНИсчисленныйПоСотрудникам КАК ЕСНИсчисленный
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|ГДЕ
			|	ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	И ЕСНИсчисленный.Период <= &ДатаПодачиСведений
			|	И ЕСНИсчисленный.Организация = &Организация
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	И (ВЫБОР
			|	КОГДА &ПоВсемФизЛицам
			|		ТОГДА ЕСНИсчисленный.ФизЛицо В (&СписокФизЛиц)
			|	ИНАЧЕ
			|		ЕСНИсчисленный.ФизЛицо = &ФизЛицо КОНЕЦ)
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	И ЕСНИсчисленный.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСНИсчисленный.ФизЛицо,
			|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизЛицо,
			|	ПериодВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Сумма(ВложЗапрос.Пособия) как Пособия,
			|	Сумма(ВложЗапрос.Выплаты) как Выплаты,
			|	ВложЗапрос.ФизЛицо,
			|	ВложЗапрос.ПериодВзаиморасчетов,
			|	ВложЗапрос.Категория,
			|	ВложЗапрос.ДокументОснование,
			|	ВложЗапрос.ВидРасчетаОклад
			|ПОМЕСТИТЬ ВТФСЗНДоходы1
			|	ИЗ
			|	(ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
			|				И НЕ ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций
			|				И НЕ ЕСНСведенияОДоходах.ВидРасчета = &ОснНачисление_ОплатаБЛПоТравмеНаПроизводстве // ПСА 08.07.2019 СВФР-004373
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					КОГДА ЕСНСведенияОДоходах.ПериодВзаиморасчетов < ДАТАВРЕМЯ(2016, 7, 1) //О.Т. Аверсон 01.02.2017 № 234
			|							И ЕСНСведенияОДоходах.Период >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ЕСНСведенияОДоходах.Результат * 10000
			|					ИНАЧЕ ЕСНСведенияОДоходах.Результат
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК Пособия,
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	СУММА(ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ЕСНСведенияОДоходах.Результат
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК Выплаты,
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	СУММА(
			//|			ВЫБОР
			//|				КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
			//|						И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
			//|					ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
			//|				ИНАЧЕ ЕСНСведенияОДоходах.Результат
			//|			КОНЕЦ
			//|		) КАК Выплаты,
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|	КОНЕЦ КАК ПериодВзаиморасчетов,
			//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Флаг
			|			ТОГДА &ДоговораПодряда
			|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|	КОНЕЦ КАК Категория,
			|	ВложенныйЗапрос.Регистратор КАК ДокументОснование,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СведДоходыОклад.ВидРасчета, 1) = 1
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК ВидРасчетаОклад
			
			|ИЗ
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|	РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация,
			|			ВЫБОР
			|				КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
			|					ТОГДА ЛОЖЬ
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ КАК Флаг
			|		ИЗ
			|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|		ГДЕ
			|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом) КАК ВложенныйЗапрос
			|		ПО ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
			|			И (ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ ВложенныйЗапрос.Регистратор.ДатаНачала И ВложенныйЗапрос.Регистратор.ДатаОкончания) //О.Т. Аверсон 14.03.2019 № 4084(убрала нач и кон мес)
			|			И ЕСНСведенияОДоходах.Организация = ВложенныйЗапрос.Организация
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	СведенияОДоходах1.ФизЛицо КАК ФизЛицо,
			|	СведенияОДоходах1.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СведенияОДоходах1.ВидРасчета КАК ВидРасчета
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|		ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|		КОНЕЦ КАК ПериодВзаиморасчетов,
			
			//|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,//О.Т. Аверсон 02.02.2016 № (Началопериода. Меняется оклад в середине месяца.Цифра задваивается)
			|		""Оклад"" КАК ВидРасчета //О.Т. 30.09.2015 № 616
			|	ИЗ
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|		РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|	ГДЕ
			|		ЕСНСведенияОДоходах.ВидРасчета В( &ВидРасчета )
			//О.Т. Аверсон 24.04.2019 № 4274
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561
			|		И ЕСНСведенияОДоходах.Организация = &Организация
			// - СВЭЙ КДЯ 22.07.19 СВФР-004561
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|		И ВЫБОР
			|			КОГДА &ПоВсемФизЛицам
			|				ТОГДА ЕСНСведенияОДоходах.ФизЛицо В (&СписокФизЛиц)
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|		КОНЕЦ
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|		И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|		И ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия)
			|				ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоГода И &КонецГода
			|				ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|		КОНЕЦ

			//О.Т. Аверсон 24.04.2019 № 4274

			|		
			|	СГРУППИРОВАТЬ ПО
			|		ЕСНСведенияОДоходах.ФизЛицо,
			|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ),
			|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),

			|		ЕСНСведенияОДоходах.ВидРасчета,

			|		ВЫБОР
			|			КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|		КОНЕЦ,
			//|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|		""Оклад"" ) КАК СведенияОДоходах1
			
			|СГРУППИРОВАТЬ ПО
			|	СведенияОДоходах1.ФизЛицо,
			|	СведенияОДоходах1.ПериодВзаиморасчетов,
			|	СведенияОДоходах1.ВидРасчета ) КАК СведДоходыОклад //О.Т. 30.09.2015 № 616
			|		ПО ЕСНСведенияОДоходах.ФизЛицо = СведДоходыОклад.ФизЛицо
			|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведДоходыОклад.ПериодВзаиморасчетов, МЕСЯЦ))
			|ГДЕ
			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоГода И &КонецГода
			|		ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	КОНЕЦ
			//|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|	//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) +
			|	И (ВЫБОР
			|		КОГДА &ПоВсемФизЛицам
			|			ТОГДА ЕСНСведенияОДоходах.ФизЛицо В (&СписокФизЛиц)
			|			ИНАЧЕ
			|				ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо КОНЕЦ)
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
			//|	И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
			|   И ЕСНСведенияОДоходах.Организация = &Организация
			
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСНСведенияОДоходах.ФизЛицо,
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ),
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),

			|			ЕСНСведенияОДоходах.ВидРасчета,

			|	ВЫБОР
			|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
			|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
			|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
			|	КОНЕЦ,
			//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Флаг
			|			ТОГДА &ДоговораПодряда
			|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|	КОНЕЦ,
			|	ВложенныйЗапрос.Регистратор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СведДоходыОклад.ВидРасчета, 1) = 1
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ ) КАК ВложЗапрос
			|		
			| СГРУППИРОВАТЬ ПО
			|ВложЗапрос.ФизЛицо,
			|ВложЗапрос.ВидРасчетаОклад,
			|ВложЗапрос.ДокументОснование,
			|ВложЗапрос.Категория,
			|ВложЗапрос.ПериодВзаиморасчетов
			//|ВложЗапрос.Пособия
			
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВложЗапрос.ФизЛицо,
			|	ВложЗапрос.ПериодВзаиморасчетов

			|;
			|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			//|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
			//|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию1
			//|ИЗ
			//|	(ВЫБРАТЬ
			//|		Периоды.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			//|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
			//|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
			//|	ИЗ
			//|		ВТФСЗНДоходы1 КАК Периоды
			//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
			//|			ПО Периоды.ПериодВзаиморасчетов >= ГражданствоФизЛиц.Период
			//|	
			//|	СГРУППИРОВАТЬ ПО
			//|		ГражданствоФизЛиц.ФизЛицо,
			//|		Периоды.ПериодВзаиморасчетов) КАК Периоды
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
			//|		ПО (ГражданствоФизЛиц.Период = Периоды.ПериодВзаиморасчетов)
			//|			И (ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо)
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ГражданствоФизЛиц.ФизЛицо,
			//|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ)
			//|
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Физлицо,
			//|	ПериодВзаиморасчетов
			//|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТФСЗНДоходы1.ФизЛицо КАК ФизЛицо,
			|	ВТФСЗНДоходы1.ПериодВзаиморасчетов КАК Месяц,
			|	ЕСТЬNULL(ВТФСЗНИсчисленный1.Взносы, 0) КАК Взносы,
			|	ЕСТЬNULL(ВТФСЗНИсчисленный1.ПроцентФСЗН, 35) КАК ТарифВзносов,
			|	ВТФСЗНДоходы1.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
			|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
			|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
			|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
			|	ДомашниеТелефоны.Поле3 КАК Телефоны,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ КАК Гражданство,
			|	ВТФСЗНДоходы1.ФизЛицо.Пол КАК Пол,
			|	ВТФСЗНДоходы1.ФизЛицо.ДатаРождения КАК ДатаРождения,
			|	ВТФСЗНДоходы1.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
			|	ВТФСЗНДоходы1.ФизЛицо.МестоРождения КАК МестоРождения,
			|	ВТФСЗНДоходы1.Категория,
			|	ЕСТЬNULL(ВТФСЗНДоходы1.Выплаты, 0) КАК Выплаты,
			|	ЕСТЬNULL(ВТФСЗНДоходы1.Пособия, 0) КАК Пособия,
			|	ЕСТЬNULL(ВТФСЗНДоходы1.ДокументОснование, 1) КАК Договор,
			|	ЕСТЬNULL(ВТФСЗНДоходы1.ВидРасчетаОклад, 1) КАК ВидРасчетаОклад,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
			|ИЗ
			|	ВТФСЗНДоходы1 КАК ВТФСЗНДоходы1
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФСЗНИсчисленный1 КАК ВТФСЗНИсчисленный1
			|		ПО ВТФСЗНДоходы1.ФизЛицо = ВТФСЗНИсчисленный1.ФизЛицо
			|			И ВТФСЗНДоходы1.ПериодВзаиморасчетов = ВТФСЗНИсчисленный1.ПериодВзаиморасчетов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
			|		ПО ВТФСЗНДоходы1.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
			|		ПО ВТФСЗНДоходы1.ФизЛицо = АдресаРегистрации.Объект
			|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
			|			И (АдресаРегистрации.Тип = &ТипАдрес)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
			|		ПО ВТФСЗНДоходы1.ФизЛицо = АдресаФактические.Объект
			|			И (АдресаФактические.Тип = &ТипАдрес)
			|			И (АдресаФактические.Вид = &ВидАдресаФактический)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
			|		ПО ВТФСЗНДоходы1.ФизЛицо = ДомашниеТелефоны.Объект
			|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
			|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			|		ПО ВТФСЗНДоходы1.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаПодачиСведений, ) КАК ГражданствоФизЛиц
			|		ПО ВТФСЗНДоходы1.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
			|ГДЕ
			|	ВТФСЗНДоходы1.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов";
			//если Основные Тогда 
			//	Запрос.Текст = Запрос.Текст + " и ЕСТЬNULL(ВТФСЗНДоходы1.ДокументОснование, 1) = 1 ";
			//КонецЕсли;
			
			Запрос.Текст = Запрос.Текст+"
			|	И ВЫБОР
			|			КОГДА ЕСТЬNULL(ВТФСЗНДоходы1.ВидРасчетаОклад, 1) = 1
			|				ТОГДА ЕСТЬNULL(ВТФСЗНДоходы1.ДокументОснование, 1) = 1
			|			КОГДА ЕСТЬNULL(ВТФСЗНДоходы1.ВидРасчетаОклад, 1) <> 1
			|				ТОГДА ЕСТЬNULL(ВТФСЗНДоходы1.ДокументОснование, 1) <> 3
			|		КОНЕЦ
			
			|	И ЕСТЬNULL(ВТФСЗНДоходы1.ДокументОснование, 1) = 1
			
			|	УПОРЯДОЧИТЬ ПО
			|		ВТФСЗНДоходы1.ФизЛицо.Наименование,
			//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
			|		ВТФСЗНДоходы1.ФизЛицо.Код,
			//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
			|		Месяц
			|ИТОГИ
			|	СУММА(Выплаты)
			|ПО
			|	ФизЛицо,
			|	Месяц";
			//О.Т. Аверсон 04.03.2016 № 940
			Если ОтборПоПериодуВзаиморасчетов Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","");
			иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений");
			КонецЕсли;
			//О.Т. Аверсон 04.03.2016 № 940
			Результат1 = Запрос.Выполнить();
		КонецЕсли;
	КонецЕсли;
	
	//Если ВсеСотрудники Тогда 
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
	//	|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ЕСНИсчисленный.ПроцентФСЗН = 0
	//	|				ТОГДА 1
	//	|			ИНАЧЕ ЕСНИсчисленный.ПроцентФСЗН
	//	|		КОНЕЦ) КАК ПроцентФСЗН,
	//	|	СУММА(ЕСНИсчисленный.ПенсионныйФонд + ЕСНИсчисленный.ФСЗН) КАК Взносы
	//	|ПОМЕСТИТЬ ВТФСЗНИсчисленный
	//	|ИЗ
	//	|	РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
	//	|ГДЕ
	//	|	ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
	//	|	И ЕСНИсчисленный.Период <= &ДатаПодачиСведений
	//	|	И ЕСНИсчисленный.Организация = &Организация
	//	|	И (&ПоВсемФизЛицам
	//	|			ИЛИ ЕСНИсчисленный.ФизЛицо = &ФизЛицо)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЕСНИсчисленный.ФизЛицо,
	//	|	НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	ФизЛицо,
	//	|	ПериодВзаиморасчетов
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
	//	|				ТОГДА ЕСНСведенияОДоходах.Результат
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК Пособия,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
	//	|				ТОГДА ЕСНСведенияОДоходах.Результат
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК Выплаты,
	//	|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
	//	|	ВЫБОР
	//	|		КОГДА ВложенныйЗапрос.Флаг
	//	|			ТОГДА &ДоговораПодряда
	//	|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
	//	|	КОНЕЦ КАК Категория,
	//	|	ВложенныйЗапрос.Регистратор КАК ДокументОснование
	//	|ПОМЕСТИТЬ ВТФСЗНДоходы
	//	|ИЗ
	//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
	//	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
	//	|			ВЫБОР
	//	|				КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
	//	|					ТОГДА ЛОЖЬ
	//	|				ИНАЧЕ ИСТИНА
	//	|			КОНЕЦ КАК Флаг
	//	|		ИЗ
	//	|			РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	//	|		ГДЕ
	//	|			ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом) КАК ВложенныйЗапрос
	//	|		ПО ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
	//	|			И (ЕСНСведенияОДоходах.Период МЕЖДУ ВложенныйЗапрос.Регистратор.ДатаНачала И ВложенныйЗапрос.Регистратор.ДатаОкончания)
	//	|ГДЕ
	//	|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
	//	|	И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений
	//	|	И (&ПоВсемФизЛицам
	//	|			ИЛИ ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЕСНСведенияОДоходах.ФизЛицо,
	//	|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
	//	|	ВЫБОР
	//	|		КОГДА ВложенныйЗапрос.Флаг
	//	|			ТОГДА &ДоговораПодряда
	//	|		ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
	//	|	КОНЕЦ,
	//	|	ВложенныйЗапрос.Регистратор
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	ФизЛицо,
	//	|	ПериодВзаиморасчетов
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
	//	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо
	//	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		Периоды.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	//	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	//	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	//	|	ИЗ
	//	|		ВТФСЗНДоходы КАК Периоды
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	//	|			ПО Периоды.ПериодВзаиморасчетов >= ГражданствоФизЛиц.Период
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		ГражданствоФизЛиц.ФизЛицо,
	//	|		Периоды.ПериодВзаиморасчетов) КАК Периоды
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	//	|		ПО (ГражданствоФизЛиц.Период = Периоды.ПериодВзаиморасчетов)
	//	|			И (ГражданствоФизЛиц.ФизЛицо = Периоды.Физлицо)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ГражданствоФизЛиц.ФизЛицо,
	//	|	НАЧАЛОПЕРИОДА(Периоды.ПериодВзаиморасчетов, МЕСЯЦ)
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Физлицо,
	//	|	ПериодВзаиморасчетов
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТФСЗНДоходы.ФизЛицо КАК ФизЛицо,
	//	|	ВТФСЗНДоходы.ПериодВзаиморасчетов КАК Месяц,
	//	|	ЕСТЬNULL(ВТФСЗНИсчисленный.Взносы, 0) КАК Взносы,
	//	|	ЕСТЬNULL(ВТФСЗНИсчисленный.ПроцентФСЗН, 35) КАК ТарифВзносов,
	//	|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
	//	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	//	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	//	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	//	|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
	//	|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
	//	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
	//	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
	//	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
	//	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
	//	|	ДомашниеТелефоны.Поле3 КАК Телефоны,
	//	|	ВЫБОР
	//	|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
	//	|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
	//	|			ТОГДА &СтранаПоУмолчанию
	//	|		ИНАЧЕ ГражданствоФизЛиц.Страна
	//	|	КОНЕЦ КАК Гражданство,
	//	|	ВТФСЗНДоходы.ФизЛицо.Пол КАК Пол,
	//	|	ВТФСЗНДоходы.ФизЛицо.ДатаРождения КАК ДатаРождения,
	//	|	ВТФСЗНДоходы.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	//	|	ВТФСЗНДоходы.ФизЛицо.МестоРождения КАК МестоРождения,
	//	|	ВТФСЗНДоходы.Категория,
	//	|	ЕСТЬNULL(ВТФСЗНДоходы.Выплаты, 0) КАК Выплаты,
	//	|	ЕСТЬNULL(ВТФСЗНДоходы.Пособия, 0) КАК Пособия,
	//	|	ВТФСЗНДоходы.ДокументОснование КАК Договор,
	//	|	NULL КАК ВидРасчетаОклад
	//	|ИЗ
	//	|	ВТФСЗНДоходы КАК ВТФСЗНДоходы
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФСЗНИсчисленный КАК ВТФСЗНИсчисленный
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ВТФСЗНИсчисленный.ФизЛицо
	//	|			И ВТФСЗНДоходы.ПериодВзаиморасчетов = ВТФСЗНИсчисленный.ПериодВзаиморасчетов
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК ДанныеОПравеНаПенсию
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ДанныеОПравеНаПенсию.Физлицо
	//	|			И ВТФСЗНДоходы.ПериодВзаиморасчетов = ДанныеОПравеНаПенсию.ПериодВзаиморасчетов
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаРегистрации.Объект
	//	|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
	//	|			И (АдресаРегистрации.Тип = &ТипАдрес)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = АдресаФактические.Объект
	//	|			И (АдресаФактические.Тип = &ТипАдрес)
	//	|			И (АдресаФактические.Вид = &ВидАдресаФактический)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ДомашниеТелефоны.Объект
	//	|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
	//	|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних КАК ГражданствоФизЛиц
	//	|		ПО ВТФСЗНДоходы.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
	//	|ГДЕ
	//	|	ДанныеОПравеНаПенсию.Физлицо ЕСТЬ NULL 
	//	|	И ВТФСЗНДоходы.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов
	//	|ИТОГИ
	//	|	СУММА(Выплаты)
	//	|ПО
	//	|	ФизЛицо,
	//	|	Месяц";
	//	
	//КонецЕсли;
	если ФизЛицо = Неопределено Тогда 
		СведенияОВзносах.Очистить();
		СведенияОСтаже.Очистить();
		РаботникиОрганизации.Очистить();
	КонецЕсли;
	
	
	
	ЗапросРабОрг = Новый Запрос;
	ЗапросРабОрг.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДатаНач = ДатаНачала;
	ДатаКон = ДатаОкончания;
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
	// + СВЭЙ КДЯ 29.07.19 СВФР-004561
	Если ФизЛицо <> Неопределено Тогда
		ЗапросРабОрг.УстановитьПараметр( "ФизЛицо", ФизЛицо );
	Иначе
		ЗапросРабОрг.УстановитьПараметр( "СписокФизЛиц", МассивФизическихЛиц );
	КонецЕсли;
	// - СВЭЙ КДЯ 29.07.19 СВФР-004561
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
	//ЗапросРабОрг.УстановитьПараметр( "МассивСотрудников", МассивСотрудников );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	Пока ДатаНач <= ДатаКон Цикл 
		
		ЗапросРабОрг.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок,
		|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо
		|	ПОМЕСТИТЬ ВТЗанимаемыеСтавки" + Строка( Месяц( ДатаНач ) ) + "
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних( &Период 
		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
		//|						, Сотрудник В ( &МассивСотрудников )
		//|					) КАК РаботникиОрганизацийСрезПоследних
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
		|";

		// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
		если не ФизЛицо = Неопределено Тогда
			ЗапросРабОрг.Текст = ЗапросРабОрг.Текст + ", Сотрудник.ФизЛицо = &ФизЛицо";
		// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		Иначе
			ЗапросРабОрг.Текст = ЗапросРабОрг.Текст + ", Сотрудник.ФизЛицо В (&СписокФизЛиц) ";
		// - СВЭЙ КДЯ 29.07.19 СВФР-004561		
		КонецЕсли;
		ЗапросРабОрг.Текст = ЗапросРабОрг.Текст + ") КАК РаботникиОрганизацийСрезПоследних";
		// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			
	
		ЗапросРабОрг.УстановитьПараметр( "Период", КонецМесяца( ДатаНач ) );
		
		// + СВЭЙ КДЯ 29.07.19 СВФР-004561
		//ЗапросРабОрг.УстановитьПараметр( "ФизЛицо", ФизЛицо );
		// - СВЭЙ КДЯ 29.07.19 СВФР-004561		
		
		ДатаНач = ДобавитьМесяц(ДатаНач,1);
		ЗапросРабОрг.Выполнить();
		
	КонецЦикла;
	
	ЗапросПрием = Новый Запрос;
	ЗапросПрием.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросПрием.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизаций.Регистратор,
	|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
	|	РаботникиОрганизаций.Период
	|	ПОМЕСТИТЬ ВТПрием	
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	(РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
	|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций)
	|	И РаботникиОрганизаций.Период <= &ПериодОкончания
	|	И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)"; //О.Т. Аверсон 29.01.2018 № 1511 Доб условие на внутр совм";
	// + СВЭЙ КДЯ 29.07.19 СВФР-004561
	//если не ФизЛицо = Неопределено Тогда
	//	ЗапросРабОрг.Текст = " И РаботникиОрганизаций.ФизЛицо = &ФизЛицо";
	// - СВЭЙ КДЯ 29.07.19 СВФР-004561		
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
	// + СВЭЙ КДЯ 29.07.19 СВФР-004561
	Если ФизЛицо <> Неопределено Тогда
		ЗапросПрием.Текст = ЗапросПрием.Текст + "
					|	И РаботникиОрганизаций.Сотрудник.ФизЛицо = &ФизЛицо";
		ЗапросПрием.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Иначе
		ЗапросПрием.Текст = ЗапросПрием.Текст + "
					|	И РаботникиОрганизаций.Сотрудник.ФизЛицо В (&СписокФизЛиц)";
		ЗапросПрием.УстановитьПараметр( "СписокФизЛиц", МассивФизическихЛиц );
	// - СВЭЙ КДЯ 29.07.19 СВФР-004561		
	КонецЕсли;
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
	//ЗапросПрием.Текст = ЗапросПрием.Текст + "
	//			|	И РаботникиОрганизаций.Сотрудник В ( &МассивСотрудников )";
	//ЗапросПрием.УстановитьПараметр( "МассивСотрудников", МассивСотрудников );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )

	ТЗПриемУвольнениеСотрудника = Новый ТаблицаЗначений;
	ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаПриема");
	ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаУвольнения");
	
	ЗапросПрием.УстановитьПараметр("ПериодОкончания", КонецМесяца(ДатаОкончания));

	ЗапросПрием.Выполнить();
	
	ДатаНач = ДатаНачала; 
	ДатаКон = ДатаОкончания;
	Сч = 1; 
	ЗапросРабОрг.Текст = "";
	Пока ДатаНач <= ДатаКон Цикл
		Если сч <> 1 Тогда
			ЗапросРабОрг.Текст = ЗапросРабОрг.Текст + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли;
		ЗапросРабОрг.Текст =ЗапросРабОрг.Текст +  
		"ВЫБРАТЬ
		|	&Дата"+Строка(Месяц(ДатаНач))+" как Месяц,
		|	РаботникиОрганизацийСрезПоследних.ФизЛицо,
		|	РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок
		|ИЗ
		|	ВТЗанимаемыеСтавки"+Строка(Месяц(ДатаНач))+" КАК РаботникиОрганизацийСрезПоследних";
		
		ЗапросРабОрг.УстановитьПараметр("Дата"+Строка(Месяц(ДатаНач)),ДатаНач);
		ДатаНач = ДобавитьМесяц(ДатаНач,1);
		Сч = Сч+1;
	КонецЦикла;
	
	ТаблицаЗанимаемыеСтавки = ЗапросРабОрг.Выполнить().Выгрузить();



	
	ТаблЗначений = Новый ТаблицаЗначений;
	ТаблЗначений.Колонки.Добавить("Таблица",,"Таблица");
	если ДогПодряда или ВсеСотрудники Тогда
		СтрЗначений = ТаблЗначений.Добавить();
		СтрЗначений.Таблица = Результат;
	КонецЕсли;
	если Основные или ВсеСотрудники Тогда
		Если не Результат1 = Неопределено Тогда 
			СтрЗначений = ТаблЗначений.Добавить();
			СтрЗначений.Таблица = Результат1;
		КонецЕсли;
	КонецЕсли;
	сч = 0;
	ДоговорПрошл="";
	ФизПрошл = "";
	ДоговорПрошл1 = "";
	КатегорияПрошл = "";
	для Каждого Таблица из ТаблЗначений Цикл
		Результат = Таблица.Таблица;
		СтруктураПоискаВзносы = Новый Структура;
		СтруктураПоискаВзносы.Вставить("ФизЛицо");
		СтруктураПоискаВзносы.Вставить("Месяц");	
		СтруктураПоискаВзносы.Вставить("Выплаты");
		СтруктураПоискаВзносы.Вставить("Пособия");
		СтруктураПоискаВзносы.Вставить("Взносы");	
		СтруктураПоискаВзносы.Вставить("ТарифВзносов");
		СтруктураПоискаВзносы.Вставить("Договор");	
		СтруктураПоискаВзносы.Вставить("Категория");
		если не ОбъединятьОсновные Тогда 
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ФизЛицо");
			СтруктураПоиска.Вставить("Категория");
			СтруктураПоиска.Вставить("ВидДоговора");
		иначе
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Фамилия");
			СтруктураПоиска.Вставить("Имя");
			СтруктураПоиска.Вставить("Отчество");
			СтруктураПоиска.Вставить("Категория");
			СтруктураПоиска.Вставить("ВидДоговора");
		КонецЕсли;
		
		СтруктураПоискаПособие = Новый Структура; 
		
		СтруктураПоискаПособие.Вставить("ФизЛицо");
		СтруктураПоискаПособие.Вставить("ВидДеятельности");	
		СтруктураПоискаПособие.Вставить("ДатаНачалаРабот");
		СтруктураПоискаПособие.Вставить("ДатаОкончанияРабот");
		
		
		//О.Т. Аверсон 14.05.2019 № 4328
		Если сч1 <> 0 и ЗначениеЗаполнено(ДоговорПрошл1) и ДоговорПрошл1 <> 1 Тогда 
			ДатаНачДО = ДатаНачала;
			ДатаКонДО = ДатаОкончания;
			Пока ДатаНачДО <= ДатаКонДО Цикл
				
				
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				ЗапросДоговора = Новый Запрос;
				ЗапросДоговора.Текст = 
				"ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо = &ФизЛицо
				|	И (&Месяц МЕЖДУ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ)
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ))
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
				
				ЗапросДоговора.УстановитьПараметр("Месяц", ДатаНачДО);
				ЗапросДоговора.УстановитьПараметр("ФизЛицо", ФизПрошл);
				
				ВыборкаДетальныеЗаписи = ЗапросДоговора.Выполнить().Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,Договор",ФизПрошл,ВыборкаДетальныеЗаписи.Ссылка));
					Если ЗначСведенияОСтаже.Количество()> 0 Тогда 
						ЗначениеЕсть = Ложь;
						Для Каждого стрСведенияОстаже из ЗначСведенияОСтаже Цикл 
							Если ((стрСведенияОстаже.ДатаНачалаРабот >= ВыборкаДетальныеЗаписи.ДатаНачала И стрСведенияОстаже.ДатаНачалаРабот <= ВыборкаДетальныеЗаписи.ДатаОкончания) или
								(ВыборкаДетальныеЗаписи.ДатаНачала >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаНачала <= стрСведенияОстаже.ДатаОкончанияРабот) или
								(ВыборкаДетальныеЗаписи.ДатаОкончания >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаОкончания <= стрСведенияОстаже.ДатаОкончанияРабот)) и
								(ДатаНачДО >= НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот) и ДатаНачДО <= КонецМесяца(стрСведенияОстаже.ДатаОкончанияРабот)) Тогда 
								Дата1 = НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот);
								Дата2 = НачалоМесяца(стрСведенияОстаже.ДатаОкончанияРабот);    
								ВзносыЕсть = Ложь; 
								Пока Дата1 <= Дата2 Цикл
									
									ПроверкаВзносов = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,Дата1)); 
									Если ПроверкаВзносов.Количество()>0 Тогда 
										ВзносыЕсть = ПроверкаВзносов[0].Выплаты >0;
										// + СВЭЙ КДЯ 22.07.19 СВФР-004561
										Если ВзносыЕсть Тогда
											Прервать;	
										КонецЕсли; 
										// - СВЭЙ КДЯ 22.07.19 СВФР-004561
									КонецЕсли;   																		
									Дата1 = ДобавитьМесяц(Дата1,1);
									
								КонецЦикла;
								Если не ВзносыЕсть Тогда 
									стрСведенияОстаже.ВидДеятельности = НеоплДог;
								КонецЕсли;   								
								ЗначениеЕсть = Истина;
							КонецЕсли;
						КонецЦикла;
						Если не ЗначениеЕсть Тогда  
							СтрокаСтажа = СведенияОСтаже.Добавить();
							СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
							СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
							
							//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							СтрокаСтажа.Категория = КатегорияПрошл;
							//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							
							СтрокаСтажа.ФизЛицо = ФизПрошл;
							СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
							СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
							СтрокаСтажа.ВидДеятельности = НеоплДог;
						КонецЕсли;
					иначе
						СтрокаСтажа = СведенияОСтаже.Добавить();
						СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						
						//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						СтрокаСтажа.Категория = КатегорияПрошл;
						//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						
						СтрокаСтажа.ФизЛицо = ФизПрошл;
						СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
						СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
						СтрокаСтажа.ВидДеятельности = НеоплДог;
					КонецЕсли;
					
					ЗначСведенияОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,ДатаНачДО));
					если ЗначСведенияОВзносах.Количество()=0 Тогда   
						СтрокаВзносов = СведенияОВзносах.Добавить();
						СтрокаВзносов.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаВзносов.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						СтрокаВзносов.Категория = КатегорияПрошл;
						СтрокаВзносов.ФизЛицо = ФизПрошл;
						СтрокаВзносов.Месяц = ДатаНачДО;
					КонецЕсли;
					
				КонецЦикла;
				
				
				ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
			КонецЦикла;
			ДоговорПрошл="";
			ФизПрошл = "";
			ДоговорПрошл1 = "";
			КатегорияПрошл = "";
		КонецЕсли;
		
		//О.Т. Аверсон 14.05.2019 № 4328
		
		
		СтокаПрошлая = Дата("00010101000000");
		СтокаПрошлаяВр = Дата("00010101000000");
		СтокаПрошлаяТравма = 0;
		СтрокаПособие = СведенияОСтаже;
		СтрокаВзносыВР = СведенияОСтаже;
		СтруктураПоиска1 = Новый Структура; 
		
		СтруктураПоиска1.Вставить("ФизЛицо");
		СтруктураПоиска1.Вставить("Категория");	
		СтруктураПоиска1.Вставить("Договор");	
		СтруктураПоиска1.Вставить("ДатаНачалаРабот");
		СтруктураПоиска1.Вставить("ДатаОкончанияРабот");
		ВыборкаПоФизЛицу = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ДоговорПрошл="";
		Пока ВыборкаПоФизЛицу.Следующий() Цикл
			СтокаПрошлаяВр = Дата("00010101000000");
			СтокаПрошлая = Дата("00010101000000");
			СтокаПрошлаяТравма = 0;//О.Т. Аверсон 18.05.2018 № 1985

			
			//О.Т. Аверсон 14.05.2019 № 4328
			Если сч1 <> 0 и ЗначениеЗаполнено(ДоговорПрошл1) и ДоговорПрошл1 <> 1 Тогда 
				ДатаНачДО = ДатаНачала;
				ДатаКонДО = ДатаОкончания;
				Пока ДатаНачДО <= ДатаКонДО Цикл
					
					
					//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
					// Данный фрагмент построен конструктором.
					// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
					
					ЗапросДоговора = Новый Запрос;
					ЗапросДоговора.Текст = 
					"ВЫБРАТЬ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
					|ИЗ
					|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
					|ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо = &ФизЛицо
					|	И (&Месяц МЕЖДУ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
					|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ)
					|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ))
					|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
					
					ЗапросДоговора.УстановитьПараметр("Месяц", ДатаНачДО);
					ЗапросДоговора.УстановитьПараметр("ФизЛицо", ФизПрошл);
					
					ВыборкаДетальныеЗаписи = ЗапросДоговора.Выполнить().Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,Договор",ФизПрошл,ВыборкаДетальныеЗаписи.Ссылка));
						Если ЗначСведенияОСтаже.Количество()> 0 Тогда 
							ЗначениеЕсть = Ложь;
							Для Каждого стрСведенияОстаже из ЗначСведенияОСтаже Цикл 
								Если ((стрСведенияОстаже.ДатаНачалаРабот >= ВыборкаДетальныеЗаписи.ДатаНачала И стрСведенияОстаже.ДатаНачалаРабот <= ВыборкаДетальныеЗаписи.ДатаОкончания) или
									(ВыборкаДетальныеЗаписи.ДатаНачала >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаНачала <= стрСведенияОстаже.ДатаОкончанияРабот) или
									(ВыборкаДетальныеЗаписи.ДатаОкончания >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаОкончания <= стрСведенияОстаже.ДатаОкончанияРабот)) и
									(ДатаНачДО >= НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот) и ДатаНачДО <= КонецМесяца(стрСведенияОстаже.ДатаОкончанияРабот)) Тогда 
									Дата1 = НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот);
									Дата2 = НачалоМесяца(стрСведенияОстаже.ДатаОкончанияРабот);    
									ВзносыЕсть = Ложь; 
									Пока Дата1 <= Дата2 Цикл
										
										ПроверкаВзносов = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,Дата1)); 
										Если ПроверкаВзносов.Количество()>0 Тогда 
											ВзносыЕсть = ПроверкаВзносов[0].Выплаты >0;
											// + СВЭЙ КДЯ 22.07.19 СВФР-004561
											Если ВзносыЕсть Тогда
												Прервать;	
											КонецЕсли; 
											// - СВЭЙ КДЯ 22.07.19 СВФР-004561
										КонецЕсли;   																		
										Дата1 = ДобавитьМесяц(Дата1,1);
										
									КонецЦикла;
									Если не ВзносыЕсть Тогда 
										стрСведенияОстаже.ВидДеятельности = НеоплДог;
									КонецЕсли;   								
									ЗначениеЕсть = Истина;
								КонецЕсли;
							КонецЦикла;
							Если не ЗначениеЕсть Тогда  
								СтрокаСтажа = СведенияОСтаже.Добавить();
								СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
								СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
								
								//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
								СтрокаСтажа.Категория = КатегорияПрошл;
								//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
								
								СтрокаСтажа.ФизЛицо = ФизПрошл;
								СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
								СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
								СтрокаСтажа.ВидДеятельности = НеоплДог;
							КонецЕсли;
						иначе
							СтрокаСтажа = СведенияОСтаже.Добавить();
							СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
							СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
							
							//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							СтрокаСтажа.Категория = КатегорияПрошл;
							//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							
							СтрокаСтажа.ФизЛицо = ФизПрошл;
							СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
							СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
							СтрокаСтажа.ВидДеятельности = НеоплДог;
						КонецЕсли;
						
						ЗначСведенияОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,ДатаНачДО));
						если ЗначСведенияОВзносах.Количество()=0 Тогда   
							СтрокаВзносов = СведенияОВзносах.Добавить();
							СтрокаВзносов.Договор = ВыборкаДетальныеЗаписи.Ссылка;
							СтрокаВзносов.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
							СтрокаВзносов.Категория = КатегорияПрошл;
							СтрокаВзносов.ФизЛицо = ФизПрошл;
							СтрокаВзносов.Месяц = ДатаНачДО;
						КонецЕсли;
						
					КонецЦикла;
					
					
					ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
				КонецЦикла;
			КонецЕсли;
			сч1 = 1;
			//О.Т. Аверсон 14.05.2019 № 4328  			
			
			
			//Островская Татьяна 06.03.2014 № 17172
			если не ФизЛицо = Неопределено Тогда
				СтруктураПоискаУдалить = Новый Структура("ФизЛицо", ФизЛицо);
				
				МассивСтрок = СведенияОСтаже.НайтиСтроки(СтруктураПоискаУдалить);
				Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
					СведенияОСтаже.Удалить(СтрокаТабличнойЧасти);
				КонецЦикла;
				МассивСтрок = СведенияОВзносах.НайтиСтроки(СтруктураПоискаУдалить);
				Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
					СведенияОВзносах.Удалить(СтрокаТабличнойЧасти);
				КонецЦикла;
			КонецЕсли;
			//Островская Татьяна 06.03.2014 № 17172
			ВыборкаПоМесяцам = ВыборкаПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоМесяцам.Следующий() Цикл
				
				
				ВсегоВыплат = ВыборкаПоМесяцам.Выплаты;
				ВыборкаПоДоговорам = ВыборкаПоМесяцам.Выбрать();
				Пока ВыборкаПоДоговорам.Следующий() Цикл
					если ВыборкаПоДоговорам.НеИмеетПравоНаПенсию = истина Тогда 
						Продолжить;	
					КонецЕсли;
					если ВыборкаПоДоговорам.Выплаты = 0  и ВыборкаПоДоговорам.Пособия = 0 Тогда  //Островская Татьяна 25.02.2014 № 17147
						Продолжить;
					КонецЕсли;
					
					ФизПрошл = ВыборкаПоДоговорам.ФизЛицо;//О.Т. Аверсон 14.05.2019 № 4328
					ДоговорПрошл1 = ВыборкаПоДоговорам.Договор;//О.Т. Аверсон 14.05.2019 № 4328
					КатегорияПрошл = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 14.05.2019 № 4328
					
					//если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда 
					//	СтруктураПоиска = Новый Структура;
					//	СтруктураПоиска.Вставить("Фамилия");
					//	СтруктураПоиска.Вставить("Имя");
					//	СтруктураПоиска.Вставить("Отчество");
					//	СтруктураПоиска.Вставить("Категория");
					//	СтруктураПоиска.Вставить("ВидДоговора");
					//иначе 
						СтруктураПоиска = Новый Структура;
						СтруктураПоиска.Вставить("ФизЛицо");
						СтруктураПоиска.Вставить("Категория");
						СтруктураПоиска.Вставить("ВидДоговора");
						
					//КонецЕсли;
					
					//если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда 
					//	СтруктураПоиска.Фамилия = ВыборкаПоДоговорам.Фамилия;
					//	СтруктураПоиска.Имя = ВыборкаПоДоговорам.Имя;
					//	СтруктураПоиска.Отчество = ВыборкаПоДоговорам.Отчество;
					//иначе
						СтруктураПоиска.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
					//КонецЕсли;
					СтруктураПоиска.Категория =ВыборкаПоДоговорам.Категория; 
					если ВыборкаПоДоговорам.Договор = 1 Тогда 
						СтруктураПоиска.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
					иначе
						СтруктураПоиска.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
					КонецЕсли;
					НайденныеСтроки = РаботникиОрганизации.НайтиСтроки(СтруктураПоиска);
					Если НайденныеСтроки.Количество() = 0 Тогда
						если не ФизЛицо = Неопределено Тогда 
							если ВыборкаПоДоговорам.Договор <> 1 и Основные Тогда 
								
								СтрокаРаботник = РаботникиОрганизации.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаРаботник,ВыборкаПоДоговорам);
								если не ВыборкаПоДоговорам.Договор = 1 Тогда 
									СтрокаРаботник.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
								Иначе 
									СтрокаРаботник.ВидДоговора =  Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
									
								КонецЕсли;
							КонецЕсли;
							если не Основные и ВыборкаПоДоговорам.Договор <> 1 Тогда 
								СтруктураПоискаДог = Новый Структура;
								СтруктураПоискаДог.Вставить("ФизЛицо");
								СтруктураПоискаДог.Вставить("Категория");
								
								//если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда 
								//	СтруктураПоискаДог.Фамилия = ВыборкаПоДоговорам.Фамилия;
								//	СтруктураПоискаДог.Имя = ВыборкаПоДоговорам.Имя;
								//	СтруктураПоискаДог.Отчество = ВыборкаПоДоговорам.Отчество;
								//иначе
									СтруктураПоискаДог.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
								//КонецЕсли;
								СтруктураПоискаДог.Категория =ВыборкаПоДоговорам.Категория; 
								НайденныеСтрокиДог = РаботникиОрганизации.НайтиСтроки(СтруктураПоискаДог);
								Если НайденныеСтрокиДог.Количество()>0 Тогда 
									НайденныеСтрокиДог[0].ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
								КонецЕсли;
							КонецЕсли;
						иначе
							если ВыборкаПоДоговорам.Договор <> 1 и Основные Тогда 
							иначе
								
								СтрокаРаботник = РаботникиОрганизации.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаРаботник,ВыборкаПоДоговорам);
								если не ВыборкаПоДоговорам.Договор = 1 Тогда 
									СтрокаРаботник.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
								Иначе 
									СтрокаРаботник.ВидДоговора =  Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
									
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					//Островская Татьяна 05.03.2014 № 17172
					ДобавлениеСтрокДата = Новый ТаблицаЗначений;
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаНачала");
					ДобавлениеСтрокДата.Колонки.Добавить("ДатаОкончания");
					
					ЗапросПрием.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизаций.Регистратор,
					|	РаботникиОрганизаций.Период КАК Период
					|ИЗ
					|	ВТПрием КАК РаботникиОрганизаций
					|ГДЕ
					|	РаботникиОрганизаций.Физлицо = &Физлицо
					//+ СВЭЙ КДЯ 22.07.19 СВФР-004561 
					|УПОРЯДОЧИТЬ ПО
					|	Период	
					//- СВЭЙ КДЯ 22.07.19 СВФР-004561
					|";
					ТЗПриемУвольнениеСотрудника = Новый ТаблицаЗначений;
					ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаПриема");
					ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаУвольнения");
					
					ЗапросПрием.УстановитьПараметр("ПериодОкончания", КонецМесяца(ДатаОкончания));
					ЗапросПрием.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);

					
					РезультПрием = ЗапросПрием.Выполнить().Выбрать();
					ДатаПриема = Дата(1,1,1);
					СтрТЗПриемУвольнениеСотрудника = Неопределено;
					Пока РезультПрием.Следующий() Цикл
						если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
							если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда
								СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
								СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период;
							ИначеЕсли не СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = Неопределено Тогда 
								СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
								СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период; 
							КонецЕсли;
						КонецЕсли;
						если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда 
							если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда 
								СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
							КонецЕсли;
							СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = РезультПрием.Период-86400;
							
						КонецЕсли;
						
					КонецЦикла;
					// Для Сотрудников, когда Дата Увольнения и следом дата приема в одном месяце
					СчКол = 0;
					Для Каждого СтрДата из ТЗПриемУвольнениеСотрудника Цикл
						если СчКол = 0 Тогда 
							если ?(СтрДата.ДатаУвольнения=Неопределено, Дата(1,1,1),СтрДата.ДатаУвольнения) > НачалоМесяца(НачалоМесяца(ВыборкаПоДоговорам.Месяц)-1) и ?(СтрДата.ДатаУвольнения=Неопределено, Дата(1,1,1),СтрДата.ДатаУвольнения) <= НачалоМесяца(ВыборкаПоДоговорам.Месяц)-1 Тогда 
								СчКол = СчКол+1;
							КонецЕсли;
						иначе
							если СтрДата.ДатаПриема > НачалоМесяца(НачалоМесяца(ВыборкаПоДоговорам.Месяц)-1) и СтрДата.ДатаПриема <= НачалоМесяца(ВыборкаПоДоговорам.Месяц)-1 Тогда 
								СчКол = СчКол+1;
							КонецЕсли;
						КонецЕсли;
						
						
					КонецЦикла;
					//
					
					
					
					ДатаПриема = Дата(1,1,1);
					ДатаУвольнения = Дата(1,1,1);
					ДатаУвПрСовпадают = Ложь;
					КолПр = 0;
					Для Каждого СтрДата из ТЗПриемУвольнениеСотрудника Цикл
						если ДатаПриема = Дата(1,1,1) и ДатаУвольнения = Дата(1,1,1) Тогда 
							ДатаПриема = СтрДата.ДатаПриема;
							ДатаУвольнения = СтрДата.ДатаУвольнения;
						КонецЕсли;
						
						если ?(СтрДата.ДатаПриема = Неопределено,КонецМесяца(ВыборкаПоДоговорам.Месяц),СтрДата.ДатаПриема) <= КонецМесяца(ВыборкаПоДоговорам.Месяц) и
							?(СтрДата.ДатаУвольнения = Неопределено,НачалоМесяца(ВыборкаПоДоговорам.Месяц),СтрДата.ДатаУвольнения) >= НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
							
							ДатаПриема = ?(СтрДата.ДатаПриема = Неопределено,Дата(1,1,1),СтрДата.ДатаПриема);
							если ЗначениеЗаполнено(ДатаУвольнения) и ЗначениеЗаполнено(ДатаПриема) Тогда 
								если КонецДня(ДатаУвольнения)+1 = ДатаПриема или НачалоМесяца(ДатаУвольнения) = НачалоМесяца(ДатаПриема) Тогда 
									ДатаУвПрСовпадают = Истина;
								КонецЕсли;
							КонецЕсли;
							
							если не  КолПр = 1 Тогда 
								ДатаУвольнения = ?(СтрДата.ДатаУвольнения = Неопределено,Дата(1,1,1),СтрДата.ДатаУвольнения);
							КонецЕсли;
							
							КолПр = КолПр+1;
						КонецЕсли;
						
					КонецЦикла;
					если ЗначениеЗаполнено(ВыборкаПоДоговорам.Договор) и ВыборкаПоДоговорам.Договор<>1 Тогда 
						ДатаПриема = Дата(1,1,1);
						ДатаУвольнения = Дата(1,1,1);
					КонецЕсли;
					
					//ЗапросПриемПоРегистрации = Новый Запрос;
					//ЗапросПриемПоРегистрации.Текст = 
					//"ВЫБРАТЬ
					//|	РаботникиОрганизацийСрезПоследних.Период
					//|ИЗ
					//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
					//|			&Период,
					//|			Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
					//|				И Сотрудник.Физлицо = &ФизЛицо) КАК РаботникиОрганизацийСрезПоследних";
					//
					//ЗапросПриемПоРегистрации.УстановитьПараметр("Период", КонецМесяца(ДатаОкончания));
					//ЗапросПриемПоРегистрации.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
					//
					//РезультПриемПоРегитрации = ЗапросПриемПоРегистрации.Выполнить().Выбрать();
					//ДатаПриемаПоРегистрации = Дата(1,1,1);							
					//Пока РезультПриемПоРегитрации.Следующий() Цикл
					//	ДатаПриемаПоРегистрации = РезультПриемПоРегитрации.Период;
					//КонецЦикла;
					//
					//ЗапросУвольн = Новый Запрос;
					//ЗапросУвольн.Текст = 
					//"ВЫБРАТЬ
					//|	РаботникиОрганизацийСрезПоследних.Период
					//|ИЗ
					//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
					//|			&Период,
					//|			Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
					//|				И Сотрудник.Физлицо = &ФизЛицо) КАК РаботникиОрганизацийСрезПоследних";
					//
					//ЗапросУвольн.УстановитьПараметр("Период", КонецМесяца(ВыборкаПоДоговорам.Месяц));
					//ЗапросУвольн.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
					//
					//РезультУв = ЗапросУвольн.Выполнить().Выбрать();
					//ДатаУвольнения = Дата(1,1,1);							
					//Пока РезультУв.Следующий() Цикл
					//	ДатаУвольнения = РезультУв.Период-86400;
					//КонецЦикла;
					//
					//ЗапросУвольнПоРегистрации = Новый Запрос;
					//ЗапросУвольнПоРегистрации.Текст = 
					//"ВЫБРАТЬ
					//|	РаботникиОрганизацийСрезПоследних.Период
					//|ИЗ
					//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
					//|			&Период,
					//|			Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
					//|				И Сотрудник.Физлицо = &ФизЛицо) КАК РаботникиОрганизацийСрезПоследних";
					//
					//ЗапросУвольнПоРегистрации.УстановитьПараметр("Период", КонецМесяца(ДатаОкончания));
					//ЗапросУвольнПоРегистрации.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
					//
					//РезультУвПоРегитрации = ЗапросУвольнПоРегистрации.Выполнить().Выбрать();
					//ДатаУвольнПоРегистрации = Дата(1,1,1);							
					//Пока РезультУвПоРегитрации.Следующий() Цикл
					//	ДатаУвольнПоРегистрации = РезультУвПоРегитрации.Период;
					//КонецЦикла;
					
					
					
					если ДатаНачала >= Дата("20140101000000") и ?(ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда, истина,ВыборкаПоДоговорам.Пособия > 0) Тогда  //ДатаРегистрации
						Если не ФизЛицо = Неопределено Тогда 
							ПолучитьТаблицуПособий(ЗапросПособие,ФизЛицо,ВыборкаПоДоговорам.Месяц);
						КонецЕсли;
						Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда
							ЗапросПособие.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);						
							ЗапросПособие.Текст = "Выбрать 
							|	Сумма(ВТПособие.Пособия) как Пособия,
							|	ВТПособие.ПериодДействияНачало,
							|	ВТПособие.ПериодВзаиморасчетов,
							|	ВТПособие.ПериодДействияКонец,
							|	ВТПособие.НомерДоговора,
							|	ВТПособие.ДатаДоговора
							|	ИЗ ВТДанныеОПособии"+Строка(Месяц(ВыборкаПоДоговорам.Месяц))+" как ВТПособие
							|	ГДЕ ВТПособие.ФизЛицо = &ФизЛицо 						
							|	СГРУППИРОВАТЬ ПО
							|	ВТПособие.ПериодДействияНачало,
							|	ВТПособие.ПериодВзаиморасчетов,
							|	ВТПособие.ПериодДействияКонец,
							|	ВТПособие.НомерДоговора,
							|	ВТПособие.ДатаДоговора
							|УПОРЯДОЧИТЬ ПО
							|	ПериодДействияНачало";
						иначе
							ЗапросПособие.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);						
							ЗапросПособие.Текст = "Выбрать 
							|	Сумма(ВТПособие.Пособия) как Пособия,
							|	ВТПособие.ПериодДействияНачало,
							|	ВТПособие.ПериодВзаиморасчетов,
							|	Сумма(ВТПособие.Выплаты) как Выплаты,
							|	ВТПособие.ПериодДействияКонец,
							|	ВТПособие.ПериодДействияНачало1
							|	ИЗ ВТДанныеОПособии"+Строка(Месяц(ВыборкаПоДоговорам.Месяц))+" как ВТПособие
							|	ГДЕ ВТПособие.ФизЛицо = &ФизЛицо 						
							|	СГРУППИРОВАТЬ ПО
							|	ВТПособие.ПериодДействияНачало,
							|	ВТПособие.ПериодВзаиморасчетов,
							|	ВТПособие.ПериодДействияКонец,
							|	ВТПособие.ПериодДействияНачало1						
							|УПОРЯДОЧИТЬ ПО
							|	ПериодДействияНачало";  
						КонецЕсли;
						
						
						РезЗапросПособие = ЗапросПособие.Выполнить().Выбрать();
						
						ПрошлДатаКон = "";
						ПрошлДатаНач = "";
						ПрошлДействиеКонец = "";
						Пока РезЗапросПособие.Следующий() Цикл 
							если РезЗапросПособие.Пособия > 0 Тогда //или (РезЗапросПособие.Пособия = 0 и РезЗапросПособие.Выплаты = 0)  Тогда
								Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда
									Если (РезЗапросПособие.ПериодДействияНачало >= ВыборкаПоДоговорам.Договор.ДатаНачала и РезЗапросПособие.ПериодДействияНачало <= ВыборкаПоДоговорам.Договор.ДатаОкончания) 
										или (РезЗапросПособие.ПериодДействияКонец >= ВыборкаПоДоговорам.Договор.ДатаНачала и РезЗапросПособие.ПериодДействияКонец <= ВыборкаПоДоговорам.Договор.ДатаОкончания)
										или (ВыборкаПоДоговорам.Договор.ДатаНачала >= РезЗапросПособие.ПериодДействияНачало и ВыборкаПоДоговорам.Договор.ДатаНачала <= РезЗапросПособие.ПериодДействияКонец) Тогда 
										
										СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
										СтрокаДобавлениеСтрокДата.ДатаНачала = РезЗапросПособие.ПериодДействияНачало;
										СтрокаДобавлениеСтрокДата.ДатаОкончания = РезЗапросПособие.ПериодДействияКонец;
									КонецЕсли;
									
								иначе
									СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
									СтрокаДобавлениеСтрокДата.ДатаНачала = РезЗапросПособие.ПериодДействияНачало;
									СтрокаДобавлениеСтрокДата.ДатаОкончания = РезЗапросПособие.ПериодДействияКонец;
								КонецЕсли;
								//если РезЗапросПособие.ПериодДействияНачало > НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ПрошлДатаНач = "" Тогда 
								//	
								//	СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
								//	СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
								//	СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(РезЗапросПособие.ПериодДействияНачало-86400);
								//	ПрошлДатаКон =СтрокаДобавлениеСтрокДата.ДатаОкончания; 
								//	ПрошлДатаНач =СтрокаДобавлениеСтрокДата.ДатаНачала; 
								//										
								//ИначеЕсли ПрошлДатаНач <> "" Тогда 
								//	если НачалоДня(ПрошлДатаКон+86400) = НачалоДня(РезЗапросПособие.ПериодДействияНачало) Тогда
								//		//СтрокаДобавлениеСтрокДата.ДатаОкончания = РезЗапросПособие.ПериодДействияКонец;
								//		ПрошлДатаКон =РезЗапросПособие.ПериодДействияКонец;
								//	иначе
								//		
								//		если ПрошлДатаКон <> "" Тогда 
								//			если не НачалоДня(ПрошлДействиеКонец+86400) = РезЗапросПособие.ПериодДействияНачало Тогда  
								//				СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
								//				СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ПрошлДействиеКонец+86400);
								//				СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(РезЗапросПособие.ПериодДействияНачало-86400); 
								//			КонецЕсли;
								//		КонецЕсли;
								//		ПрошлДатаКон =СтрокаДобавлениеСтрокДата.ДатаОкончания; 
								//		ПрошлДатаНач =СтрокаДобавлениеСтрокДата.ДатаНачала; 
								//	КонецЕсли;
								//	
								//КонецЕсли;
								//ПрошлДействиеКонец = РезЗапросПособие.ПериодДействияКонец;
								если РезЗапросПособие.Пособия > 0 и ?(ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда,ВыборкаПоДоговорам.Пособия >0,истина)  Тогда	
									ДанныеЕстьВТЧ = Ложь;
									ПрошлДатаКон1 = "";
									ПрошлДатаНач1 = "";
									ДатаНачПособие = РезЗапросПособие.ПериодДействияНачало;
									СтруктураПоискаПособие.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
									СтруктураПоискаПособие.ДатаНачалаРабот = РезЗапросПособие.ПериодДействияНачало;
									СтруктураПоискаПособие.ДатаОкончанияРабот = НачалоДня(РезЗапросПособие.ПериодДействияКонец);
									СтруктураПоискаПособие.ВидДеятельности = Пособие;
									НайденныеСтрокиПособие =  СведенияОСтаже.НайтиСтроки(СтруктураПоискаПособие);
									Если НайденныеСтрокиПособие.Количество() = 0 Тогда
										//О.Т. Аверсон 06.03.2019 № 4054
										НайденныеСтрокиПособие =  СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ВидДеятельности",ВыборкаПоДоговорам.ФизЛицо,Пособие));        										
										Если НайденныеСтрокиПособие.Количество()>0 Тогда 
											Для Каждого стрПособие из НайденныеСтрокиПособие Цикл 
												Если РезЗапросПособие.ПериодДействияНачало >= стрПособие.ДатаНачалаРабот и РезЗапросПособие.ПериодДействияНачало <= стрПособие.ДатаОкончанияРабот Тогда 
													ДанныеЕстьВТЧ = Истина;
												КонецЕсли;												
											КонецЦикла;   											
										КонецЕсли;
										//О.Т. Аверсон 06.03.2019 № 4054
										Если не ДанныеЕстьВТЧ Тогда    										
											
											если НачалоДня(СтокаПрошлая+86400) = НачалоДня(РезЗапросПособие.ПериодДействияНачало) Тогда
												если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < РезЗапросПособие.ПериодДействияКонец Тогда 
													СтрокаПособие.ДатаОкончанияРабот = ДатаУвольнения;
												иначе
													СтрокаПособие.ДатаОкончанияРабот = РезЗапросПособие.ПериодДействияКонец;
												КонецЕсли;
												если ДатаПриема <> Дата(1,1,1) и ДатаПриема > РезЗапросПособие.ПериодДействияНачало и не (ДатаУвольнения >РезЗапросПособие.ПериодДействияНачало и ДатаУвольнения>РезЗапросПособие.ПериодДействияКонец) Тогда 
													СтрокаПособие.ДатаНачалаРабот = ДатаПриема;
												КонецЕсли;											
												
												
												СтокаПрошлая = СтрокаПособие.ДатаОкончанияРабот;
												если ПрошлДатаНач = "" Тогда 
													ПрошлДатаНач1 =РезЗапросПособие.ПериодДействияНачало;
												КонецЕсли;
												ПрошлДатаКон1 =СтрокаПособие.ДатаОкончанияРабот;
												
											иначе
												если (ДатаПриема <= РезЗапросПособие.ПериодДействияКонец или ДатаПриема = Дата(1,1,1)) и (ДатаУвольнения >= РезЗапросПособие.ПериодДействияНачало или ДатаУвольнения = Дата(1,1,1)) Тогда 
													СтрокаПособие = СведенияОСтаже.Добавить();
													//если ВыгрузкаДоговоровПодрядаБезОграничнеия и ДогПодряда Тогда //О.Т. Аверсон 23.08.2018 № 2335
													если не ВыборкаПоДоговорам.Договор = 1 Тогда //О.Т. Аверсон 24.04.2019 4289
														СтрокаПособие.Договор = ВыборкаПоДоговорам.Договор;
														СтрокаПособие.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
													КонецЕсли;
													//КонецЕсли;
													СтрокаПособие.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
													если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(РезЗапросПособие.ПериодДействияНачало) и Месяц(ДатаПриема) = Месяц(РезЗапросПособие.ПериодДействияНачало) и День(ДатаПриема) > День(РезЗапросПособие.ПериодДействияНачало) Тогда 
														СтрокаПособие.ДатаНачалаРабот = ДатаПриема;
													ИначеЕсли СчКол > 1 Тогда 
														СтрокаПособие.ДатаНачалаРабот = ДатаПриема;
													иначе
														
														СтрокаПособие.ДатаНачалаРабот = РезЗапросПособие.ПериодДействияНачало;
													КонецЕсли;
													если не (ДатаУвольнения >РезЗапросПособие.ПериодДействияНачало и ДатаУвольнения>РезЗапросПособие.ПериодДействияКонец) Тогда
														СтрокаПособие.ДатаНачалаРабот = РезЗапросПособие.ПериодДействияНачало;
													КонецЕсли;
													
													
													если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < РезЗапросПособие.ПериодДействияКонец Тогда 
														СтрокаПособие.ДатаОкончанияРабот = ДатаУвольнения;
													иначе
														СтрокаПособие.ДатаОкончанияРабот = РезЗапросПособие.ПериодДействияКонец;
													КонецЕсли;
													
													СтрокаПособие.ВидДеятельности = Пособие;
													
													СтокаПрошлая = СтрокаПособие.ДатаОкончанияРабот;
													ПрошлДатаНач1 =СтрокаПособие.ДатаНачалаРабот;
													ПрошлДатаКон1 =СтрокаПособие.ДатаОкончанияРабот;
												КонецЕсли;
												
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						//если ПрошлДатаКон1 <> "" Тогда 
						//	если КонецДня(ПрошлДатаКон1) < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//		СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата.Добавить();
						//		СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ПрошлДатаКон1+86400);
						//		СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецМесяца(ВыборкаПоДоговорам.Месяц);
						//	КонецЕсли;
						//КонецЕсли;
						
						
						
						
					КонецЕсли;
					
					
					Если ЗначениеЗаполнено(ВыборкаПоДоговорам.Договор)  Тогда
						//если ВыборкаПоДоговорам.ВидРасчетаОклад = 1 или ВыборкаПоДоговорам.ВидРасчетаОклад = null Тогда 
						если не ВыборкаПоДоговорам.Договор = 1 Тогда
							если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда
								Если НайденныеСтроки.Количество() > 0 Тогда
									СтруктураПоиска1.ФизЛицо = НайденныеСтроки[0].ФизЛицо;
								иначе
									СтруктураПоиска1.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
								КонецЕсли;
							иначе
								СтруктураПоиска1.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
							КонецЕсли;
							СтруктураПоиска1.Категория = ВыборкаПоДоговорам.Категория;
							
							СтруктураПоиска1.Договор = ВыборкаПоДоговорам.Договор;
							СтруктураПоиска1.ДатаНачалаРабот = ВыборкаПоДоговорам.Договор.ДатаНачала;
							СтруктураПоиска1.ДатаОкончанияРабот = ВыборкаПоДоговорам.Договор.ДатаОкончания;
							
							ЗапроcПроверкаДоговоров = Новый Запрос;
							ЗапроcПроверкаДоговоров.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
							ЗапроcПроверкаДоговоров.Текст = 
							"ВЫБРАТЬ
							|	СведенияОСтаже.ФизЛицо
							|	ПОМЕСТИТЬ ВТСведОСтаже
							|	ИЗ &СведенияОСтаже КАК СведенияОСтаже
							|	ГДЕ СведенияОСтаже.ФизЛицо = &ФизЛицо
							|	И СведенияОСтаже.Категория = &Категория
							|	И СведенияОСтаже.Договор = &Договор
							|	И СведенияОСтаже.ВидДеятельности = &ВидДеятельности //О.Т. Аверсон 24.04.2019 № 4289
							|	И СведенияОСтаже.ДатаНачалаРабот между &ДатаНачалаРабот и &ДатаОкончанияРабот";
							ЗапроcПроверкаДоговоров.УстановитьПараметр("ФизЛицо",СтруктураПоиска1.ФизЛицо);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("Категория",СтруктураПоиска1.Категория);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("Договор",СтруктураПоиска1.Договор);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("ДатаНачалаРабот",СтруктураПоиска1.ДатаНачалаРабот);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("ДатаОкончанияРабот",СтруктураПоиска1.ДатаОкончанияРабот);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("СведенияОСтаже",СведенияОСтаже);
							ЗапроcПроверкаДоговоров.УстановитьПараметр("ВидДеятельности",Договор);//О.Т. Аверсон 24.04.2019 4289

							ЗапроcПроверкаДоговоров.Выполнить();
							ЗапроcПроверкаДоговоров.Текст = 
							"ВЫБРАТЬ
							|	СведенияОСтаже.ФизЛицо
							|	ИЗ ВТСведОСтаже КАК СведенияОСтаже"; 						
							НайденныеСтрокиСтажа = ЗапроcПроверкаДоговоров.Выполнить().Выгрузить();
							
							
							//НайденныеСтрокиСтажа =  СведенияОСтаже.НайтиСтроки(СтруктураПоиска1);
							Если НайденныеСтрокиСтажа.Количество() = 0 Тогда
								если ТипЗнч(ВыборкаПоДоговорам.Договор) = Тип("ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом") Тогда 
									если ВсеСотрудники или ДогПодряда Тогда 
										СтрокаСтажа = СведенияОСтаже.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаСтажа,ВыборкаПоДоговорам);
										если не ВыборкаПоДоговорам.Договор = 1 Тогда 
											СтрокаСтажа.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
										Иначе 
											СтрокаСтажа.ВидДоговора =  Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
											
										КонецЕсли;
										СтрокаСтажа.ДатаНачалаРабот = ВыборкаПоДоговорам.Договор.ДатаНачала;
										СтрокаСтажа.ДатаОкончанияРабот = ВыборкаПоДоговорам.Договор.ДатаОкончания;
										СтрокаСтажа.ВидДеятельности = Договор;
										//О.Т. Аверсон 04.04.2019 № 4187
										Если Год(ВыборкаПоДоговорам.Договор.ДатаНачала) < Год(ВыборкаПоДоговорам.Месяц) Тогда 
											ЗаписьГод =Год(ВыборкаПоДоговорам.Договор.ДатаНачала); 
											Пока ЗаписьГод<Год(ВыборкаПоДоговорам.Месяц) Цикл  
												СтрокаСтажа1 = СведенияОСтаже.Добавить();
												ЗаполнитьЗначенияСвойств(СтрокаСтажа1,СтрокаСтажа);
												если ЗаписьГод =Год(ВыборкаПоДоговорам.Договор.ДатаНачала) Тогда 
													СтрокаСтажа1.ДатаНачалаРабот = ВыборкаПоДоговорам.Договор.ДатаНачала;
												Иначе
													СтрокаСтажа1.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
												КонецЕсли;
												СтрокаСтажа1.ДатаОкончанияРабот = Дата(ЗаписьГод,12,31);
												СтрокаСтажа1.ВидДеятельности = Договор;
												СтрокаСтажа1.Категория = ВыборкаПоДоговорам.Категория;
												
												ЗаписьГод = ЗаписьГод+1;
											КонецЦикла;
											СтрокаСтажа.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
										КонецЕсли;													
										//О.Т. Аверсон 04.04.2019 № 4187
									КонецЕсли;
								иначе
									
									СтрокаСтажа = СведенияОСтаже.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСтажа,ВыборкаПоДоговорам);
									если не ВыборкаПоДоговорам.Договор = 1 Тогда 
										СтрокаСтажа.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
									Иначе 
										СтрокаСтажа.ВидДоговора =  Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
										
									КонецЕсли;
									СтрокаСтажа.ДатаНачалаРабот = ВыборкаПоДоговорам.Договор.ДатаНачала;
									СтрокаСтажа.ДатаОкончанияРабот = ВыборкаПоДоговорам.Договор.ДатаОкончания;
									СтрокаСтажа.ВидДеятельности = Договор;
									//О.Т. Аверсон 04.04.2019 № 4187
									Если Год(ВыборкаПоДоговорам.Договор.ДатаНачала) < Год(ВыборкаПоДоговорам.Месяц) Тогда 
										ЗаписьГод =Год(ВыборкаПоДоговорам.Договор.ДатаНачала); 
										Пока ЗаписьГод<Год(ВыборкаПоДоговорам.Месяц) Цикл  
											СтрокаСтажа1 = СведенияОСтаже.Добавить();
											ЗаполнитьЗначенияСвойств(СтрокаСтажа1,СтрокаСтажа);
											если ЗаписьГод =Год(ВыборкаПоДоговорам.Договор.ДатаНачала) Тогда 
												СтрокаСтажа1.ДатаНачалаРабот = ВыборкаПоДоговорам.Договор.ДатаНачала;
											Иначе
												СтрокаСтажа1.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
											КонецЕсли;
											СтрокаСтажа1.ДатаОкончанияРабот = Дата(ЗаписьГод,12,31);
											СтрокаСтажа1.ВидДеятельности = Договор;
											СтрокаСтажа1.Категория = ВыборкаПоДоговорам.Категория;
											
											ЗаписьГод = ЗаписьГод+1;
										КонецЦикла;
										СтрокаСтажа.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
									КонецЕсли;													
									//О.Т. Аверсон 04.04.2019 № 4187
								КонецЕсли;
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли;
					
					//Если ВыборкаПоДоговорам.Договор=1  Тогда
					если ВыборкаПоДоговорам.Выплаты > 0 Тогда 
						ЗапросИскл = Новый Запрос;
						ЗапросИскл.Текст = 
						"ВЫБРАТЬ
						|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
						|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
						|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
						|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ПериодДействияКонец
						|ИЗ
						|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
						|ГДЕ
						|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
						|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
						|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
						|
						|УПОРЯДОЧИТЬ ПО
						|	ПериодДействияНачало";
						ВидыРасчета = Новый СписокЗначений;
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ);
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.РождениеРебенка);//О.Т. Аверсон 16.08.2018 № 2307
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СмертьБлизкогоРодственника);//О.Т. Аверсон 16.08.2018 № 2307
						//О.Т. Аверсон 17.02.2016 № 884
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Невыход);
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул);
						//О.Т. Аверсон 17.02.2016 № 884
						
						//ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛЛиквидаторамЧАЭС);
						//ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеВБыту);
						//ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ);
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам);
						ВидыРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве);//О.Т. Аверсон 18.05.2018 № 1985
						ЗапросИскл.УстановитьПараметр("ВидРасчета", ВидыРасчета);
						ЗапросИскл.УстановитьПараметр("ПериодДействия", НачалоМесяца(ВыборкаПоДоговорам.Месяц));
						ЗапросИскл.УстановитьПараметр("ПериодДействия1", КонецМесяца(ВыборкаПоДоговорам.Месяц));
						ЗапросИскл.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
						
						РезультатИсклТЗ = ЗапросИскл.Выполнить().Выгрузить();
						МесяцНачало = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						МесяцКонец = КонецМесяца(ВыборкаПоДоговорам.Месяц);
						ДобавлениеСтрокДата1 = Новый ТаблицаЗначений;
						ДобавлениеСтрокДата1.Колонки.Добавить("ДатаНачала");
						ДобавлениеСтрокДата1.Колонки.Добавить("ДатаОкончания");
						ДобавлениеСтрокДата1.Колонки.Добавить("Травма");//О.Т. Аверсон 18.05.2018 № 1985

						ПрошлДатаНач2 = "";
						ПрошлДатаКон2 = "";
						ПрошлДействиеКонец1 = "";
						ПрошлДействиеКонец = "";
						СчИскл = 1;
						ТаблицаОбщаяяИскл = Новый ТаблицаЗначений;
						ТаблицаОбщаяяИскл.Колонки.Добавить("ПериодДействияНачало");
						ТаблицаОбщаяяИскл.Колонки.Добавить("ПериодДействияКонец");
						
						Для Каждого  РезультатИскл из РезультатИсклТЗ Цикл
							СтрДата = РезультатИскл.ПериодДействияНачало;
							Пока СтрДата <= РезультатИскл.ПериодДействияКонец Цикл
								СтрТаблицаОбщаяяИскл = ТаблицаОбщаяяИскл.Добавить();
								СтрТаблицаОбщаяяИскл.ПериодДействияНачало = СтрДата;
								СтрТаблицаОбщаяяИскл.ПериодДействияКонец = КонецДня(СтрДата);
								СтрДата = СтрДата+86400;
							КонецЦикла; 
						КонецЦикла;
						Для Каждого  РезультатИскл из ДобавлениеСтрокДата Цикл
							СтрДата = РезультатИскл.ДатаНачала;
							Пока СтрДата <= РезультатИскл.ДатаОкончания Цикл
								СтрТаблицаОбщаяяИскл = ТаблицаОбщаяяИскл.Добавить();
								СтрТаблицаОбщаяяИскл.ПериодДействияНачало = СтрДата;
								СтрТаблицаОбщаяяИскл.ПериодДействияКонец = КонецДня(СтрДата);
								СтрДата = СтрДата +86400;
							КонецЦикла; 
						КонецЦикла;
						ТаблицаОбщаяяИскл.Сортировать("ПериодДействияНачало");
						ТаблицаОбщаяяИскл.Свернуть("ПериодДействияНачало,ПериодДействияКонец");
						Первый = Истина;
						для Каждого стрДобавлениеСтрок из ТаблицаОбщаяяИскл Цикл 
							
							если Первый Тогда
								если стрДобавлениеСтрок.ПериодДействияНачало > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
									Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда //О.Т. Аверсон 22.08.2018 № 2335
										Если стрДобавлениеСтрок.ПериодДействияНачало > ВыборкаПоДоговорам.Договор.ДатаНачала Тогда
											СтрокаДобавлениеСтрокДата1.ДатаНачала = ВыборкаПоДоговорам.Договор.ДатаНачала;
										иначе
											СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
										КонецЕсли;
									иначе
										СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
									КонецЕсли;
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ПериодДействияНачало-86400);
									СтрокаДобавлениеСтрокДата1.Травма = 0;
								КонецЕсли;
								ПрошлДействиеКонец1 = стрДобавлениеСтрок.ПериодДействияКонец;
							иначе
								если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ПериодДействияНачало Тогда
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
									СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ПериодДействияНачало-86400);
									СтрокаДобавлениеСтрокДата1.Травма = 0;
								КонецЕсли;
								ПрошлДействиеКонец1 = стрДобавлениеСтрок.ПериодДействияКонец;
								
								
							КонецЕсли;
							Первый = Ложь;
							
						КонецЦикла;
						//О.Т. Аверсон 18.05.2018 № 1985
						МассивРезультатИсклТЗ = РезультатИсклТЗ.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве)); 
						Для Каждого стр из МассивРезультатИсклТЗ Цикл 
							СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();	
							СтрокаДобавлениеСтрокДата1.ДатаНачала = стр.ПериодДействияНачало;
							СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стр.ПериодДействияКонец);
							СтрокаДобавлениеСтрокДата1.Травма = 1;
						КонецЦикла;
						ДобавлениеСтрокДата1.Сортировать("ДатаНачала");
						//О.Т. Аверсон 18.05.2018 № 1985
						
						
						
						
						
						//	для Каждого стрДобавлениеСтрок из ДобавлениеСтрокДата Цикл 
						//		ДобавлятьНеНадо = Ложь;
						//		если РезультатИскл.ПериодДействияНачало < стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияКонец < стрДобавлениеСтрок.ДатаОкончания Тогда 
						//			
						//			если Первый Тогда
						//				если РезультатИскл.ПериодДействияНачало > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();	
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//					
						//				КонецЕсли;
						//				ПрошлДействиеКонец1 = РезультатИскл.ПериодДействияКонец;
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();	
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//				ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//			иначе
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//				ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//			КонецЕсли; 
						//			
						//			
						//		КонецЕсли;
						//		если РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияНачало >= стрДобавлениеСтрок.ДатаОкончания Тогда
						//			
						//			если Первый  Тогда
						//				если стрДобавлениеСтрок.ДатаНачала > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//					
						//				КонецЕсли;
						//				ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//				
						//				стрДобавлениеСтрокСлед = ДобавлениеСтрокДата[Мин(СчИскл,ДобавлениеСтрокДата.Количество()-1)];
						//				если РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрокСлед.ДатаНачала Тогда 
						//					
						//				иначе
						//					если НачалоДня(ПрошлДействиеКонец1+86400)<> РезультатИскл.ПериодДействияНачало Тогда 
						//						СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//						СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//						СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//					КонецЕсли;
						//					ПрошлДействиеКонец1 = РезультатИскл.ПериодДействияКонец;
						//				КонецЕсли;
						//				
						//			иначе
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//				ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//			КонецЕсли; 
						//			
						//		КонецЕсли;
						//		
						//		если РезультатИскл.ПериодДействияНачало >= стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияНачало <= стрДобавлениеСтрок.ДатаОкончания Тогда
						//			
						//			если Первый  Тогда 
						//				если стрДобавлениеСтрок.ДатаНачала > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//			иначе
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//			КонецЕсли;
						//			ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//			
						//		КонецЕсли;
						//		
						//		
						//		если РезультатИскл.ПериодДействияНачало < стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияКонец <= стрДобавлениеСтрок.ДатаОкончания Тогда
						//			если Первый  Тогда
						//				если РезультатИскл.ПериодДействияНачало > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//				КонецЕсли;
						//			иначе
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> РезультатИскл.ПериодДействияНачало Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//				КонецЕсли;
						//			КонецЕсли;
						//			ПрошлДействиеКонец1 = РезультатИскл.ПериодДействияКонец;
						//		КонецЕсли;
						//		
						//		если РезультатИскл.ПериодДействияНачало >= стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияНачало < стрДобавлениеСтрок.ДатаОкончания и РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаОкончания Тогда
						//			если Первый  Тогда
						//				если стрДобавлениеСтрок.ДатаНачала > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//				
						//			иначе
						//				если НачалоДня(ПрошлДействиеКонец1+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда
						//					СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
						//					СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
						//					СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//				КонецЕсли;
						//			КонецЕсли;
						//			ПрошлДействиеКонец1 = стрДобавлениеСтрок.ДатаОкончания;
						//		КонецЕсли;
						//		
						//		
						//		
						//		
						//		
						//		
						//		
						//		
						//		//если РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияНачало<стрДобавлениеСтрок.ДатаОкончания тогда 
						//		//	СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();  
						//		//	если Первый Тогда
						//		//		СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//		//	иначе
						//		//		СтрокаДобавлениеСтрокДата1.ДатаНачала = стрДобавлениеСтрок.ДатаНачала;
						//		//	КонецЕсли;
						//		//	СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//		//	ДобавлятьНеНадо = Истина;
						//		//	ПрошлДействиеКонец1 = СтрокаДобавлениеСтрокДата1.ДатаОкончания;
						//		//КонецЕсли;
						//		//если РезультатИскл.ПериодДействияКонец < стрДобавлениеСтрок.ДатаОкончания и РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаНачала  тогда //и РезультатИсклТЗ[Мин(СчИскл,РезультатИсклТЗ.Количество()-1)].ПериодДействияНачало > стрДобавлениеСтрок.ДатаОкончания
						//		//	СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();  
						//		//	СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(РезультатИскл.ПериодДействияКонец+86400);
						//		//	СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
						//		//	ДобавлятьНеНадо = Истина;
						//		//	ПрошлДействиеКонец1 = СтрокаДобавлениеСтрокДата1.ДатаОкончания;
						//		//КонецЕсли;
						//		////если РезультатИсклТЗ[Мин(СчИскл,РезультатИсклТЗ.Количество()-1)].ПериодДействияНачало < стрДобавлениеСтрок.ДатаОкончания тогда
						//		////	ДобавлятьНеНадо = Истина;
						//		////КонецЕсли;
						//		//
						//		////Если РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаНачала и не РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаОкончания и не Первый тогда
						//		////	СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();  
						//		////	СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(РезультатИскл.ПериодДействияКонец);
						//		////	СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаОкончания);
						//		////	
						//		////КонецЕсли;
						//		//если (РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаОкончания и
						//		//	РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаНачала и РезультатИскл.ПериодДействияКонец > стрДобавлениеСтрок.ДатаОкончания) или
						//		//	РезультатИскл.ПериодДействияНачало > стрДобавлениеСтрок.ДатаОкончания или РезультатИскл.ПериодДействияНачало < стрДобавлениеСтрок.ДатаНачала Тогда 
						//		//	если не ДобавлятьНеНадо Тогда 
						//		//		если Первый и стрДобавлениеСтрок.ДатаНачала > НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//		//			СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить(); 
						//		//			
						//		//			СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//		//			
						//		//			
						//		//			
						//		//			СтрокаДобавлениеСтрокДата1.ДатаНачала = стрДобавлениеСтрок.ДатаНачала;
						//		//			СтрокаДобавлениеСтрокДата1.ДатаОкончания = стрДобавлениеСтрок.ДатаОкончания;
						//		//			ПрошлДействиеКонец1 = СтрокаДобавлениеСтрокДата1.ДатаОкончания;
						//		//		иначе
						//		//			Первый = Ложь;
						//		//		КонецЕсли;
						//		//	КонецЕсли;
						//		//	
						//		//иначе
						//		//	Первый = Ложь;
						//		//	
						//		//КонецЕсли;
						//		
						//		Первый = Ложь;
						//		
						//		СчИскл = СчИскл + 1;
						//		
						//		
						//	КонецЦикла;
						//	
						//	
						//	если ДобавлениеСтрокДата.Количество() = 0 Тогда 
						//		если РезультатИскл.ПериодДействияНачало > НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ПрошлДатаНач2 = "" Тогда 
						//			//если НачалоДня(ПрошлДатаКон+86400) = НачалоДня(РезЗапросПособие.ПериодДействияНачало) Тогда
						//			//	//СтрокаДобавлениеСтрокДата.ДатаОкончания = РезЗапросПособие.ПериодДействияКонец;
						//			//	ПрошлДатаКон =РезЗапросПособие.ПериодДействияКонец;
						//			//иначе
						//			СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//			СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//			СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400);
						//			ПрошлДатаКон2 =СтрокаДобавлениеСтрокДата.ДатаОкончания; 
						//			ПрошлДатаНач2 =СтрокаДобавлениеСтрокДата.ДатаНачала; 
						//			//КонецЕсли;
						//			
						//		ИначеЕсли ПрошлДатаНач2 <> "" Тогда 
						//			если НачалоДня(ПрошлДатаКон2+86400) = НачалоДня(РезультатИскл.ПериодДействияНачало) Тогда
						//				//СтрокаДобавлениеСтрокДата.ДатаОкончания = РезЗапросПособие.ПериодДействияКонец;
						//				ПрошлДатаКон2 =РезультатИскл.ПериодДействияКонец;
						//			иначе
						//				
						//				если ПрошлДатаКон2 <> "" Тогда 
						//					если не НачалоДня(ПрошлДействиеКонец+86400) = РезЗапросПособие.ПериодДействияНачало Тогда  
						//						СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//						СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ПрошлДействиеКонец+86400);
						//						СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(РезультатИскл.ПериодДействияНачало-86400); 
						//					КонецЕсли;
						//				КонецЕсли;
						//				ПрошлДатаКон2 =СтрокаДобавлениеСтрокДата.ДатаОкончания; 
						//				ПрошлДатаНач2 =СтрокаДобавлениеСтрокДата.ДатаНачала; 
						//			КонецЕсли;
						//			
						//		КонецЕсли;
						//		ПрошлДействиеКонец = РезультатИскл.ПериодДействияКонец;
						//	КонецЕсли;
						//	
						//	СчИскл = СчИскл+1;		
						//КонецЦикла;
						если ТаблицаОбщаяяИскл.Количество() > 0 Тогда
							если КонецДня(ПрошлДействиеКонец1) < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
								
								Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда //О.Т. Аверсон 22.08.2018 № 2335
									
									если КонецМесяца(ВыборкаПоДоговорам.Месяц) > ВыборкаПоДоговорам.Договор.ДатаОкончания  Тогда
										Если ВыборкаПоДоговорам.Договор.ДатаОкончания > ПрошлДействиеКонец1 Тогда 
											СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
											СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
											СтрокаДобавлениеСтрокДата1.ДатаОкончания = ВыборкаПоДоговорам.Договор.ДатаОкончания;
											СтрокаДобавлениеСтрокДата1.Травма = 0;
										КонецЕсли;
									иначе
										СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
										СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
										СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецМесяца(ВыборкаПоДоговорам.Месяц);
										СтрокаДобавлениеСтрокДата1.Травма = 0;
									КонецЕсли;
								иначе
									СтрокаДобавлениеСтрокДата1 = ДобавлениеСтрокДата1.Добавить();
									СтрокаДобавлениеСтрокДата1.ДатаНачала = НачалоДня(ПрошлДействиеКонец1+86400);
									СтрокаДобавлениеСтрокДата1.ДатаОкончания = КонецМесяца(ВыборкаПоДоговорам.Месяц);
									СтрокаДобавлениеСтрокДата1.Травма = 0;
								КонецЕсли;
								
							КонецЕсли;
							ДобавлениеСтрокДата1.Свернуть("ДатаНачала,ДатаОкончания,Травма");
						КонецЕсли;
						
						
						//если РезультатИсклТЗ.Количество() > 0 и ДобавлениеСтрокДата.Количество() = 0 Тогда
						//	если ПрошлДействиеКонец <> "" Тогда 
						//		если КонецДня(ПрошлДействиеКонец) < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//			СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//			СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ПрошлДействиеКонец+86400);
						//			СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецМесяца(ВыборкаПоДоговорам.Месяц);
						//		КонецЕсли;
						//	КонецЕсли;
						//КонецЕсли;
						//если РезультатИсклТЗ.Количество() = 0 Тогда 
						//	Первый = Истина;
						//	ДатаКонПрошл = "";
						//	для Каждого стрДобавлениеСтрок из ДобавлениеСтрокДата Цикл
						//		если Первый Тогда 
						//			если стрДобавлениеСтрок.ДатаНачала <> НачалоМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
						//				СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//				СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
						//				СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//			КонецЕсли;
						//			ДатаКонПрошл = стрДобавлениеСтрок.ДатаОкончания;
						//		иначе
						//			если НачалоДня(ДатаКонПрошл+86400)<> стрДобавлениеСтрок.ДатаНачала Тогда 
						//				СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//				СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ДатаКонПрошл+86400);
						//				СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецДня(стрДобавлениеСтрок.ДатаНачала-86400);
						//			КонецЕсли;
						//			ДатаКонПрошл = стрДобавлениеСтрок.ДатаОкончания;
						//		КонецЕсли;
						//		Первый = Ложь;
						//	КонецЦикла;
						//	если ДобавлениеСтрокДата.Количество()>0 Тогда 
						//		если КонецДня(ДатаКонПрошл) < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда
						//			СтрокаДобавлениеСтрокДата = ДобавлениеСтрокДата1.Добавить();
						//			СтрокаДобавлениеСтрокДата.ДатаНачала = НачалоДня(ДатаКонПрошл+86400);
						//			СтрокаДобавлениеСтрокДата.ДатаОкончания = КонецМесяца(ВыборкаПоДоговорам.Месяц);
						//		КонецЕсли;
						//		
						//	КонецЕсли;
						//	
						//КонецЕсли;
						
						
						СчСтрокДата = 0;
						ВзносыДобавлены = Ложь;
						для Каждого стрДобавлениеСтрок из ДобавлениеСтрокДата1 Цикл 
							Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
								Если стрДобавлениеСтрок.ДатаОкончания < ВыборкаПоДоговорам.Договор.ДатаНачала Тогда 
									Продолжить;
								КонецЕсли;
								
							КонецЕсли;
							
							СтруктураПоискаПособие.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
							СтруктураПоискаПособие.ДатаНачалаРабот = стрДобавлениеСтрок.ДатаНачала;
							СтруктураПоискаПособие.ДатаОкончанияРабот = НачалоДня(стрДобавлениеСтрок.ДатаОкончания);
							Если стрДобавлениеСтрок.Травма = 1 Тогда //О.Т. Аверсон 18.05.2018 № 1985 
								СтруктураПоискаПособие.ВидДеятельности = СТРАХСЛУЧ;
							иначе
								СтруктураПоискаПособие.ВидДеятельности = ВзносыВрем;
							КонецЕсли;
							НайденныеСтрокиПособие =  СведенияОСтаже.НайтиСтроки(СтруктураПоискаПособие);
							СтруктураПособие = Новый Структура("ВидДеятельности,ФизЛицо",Пособие,ВыборкаПоДоговорам.ФизЛицо);
							СтрокиПособия = СведенияОСтаже.НайтиСтроки(СтруктураПособие);
							Если НайденныеСтрокиПособие.Количество() = 0 Тогда
								если НачалоДня(СтокаПрошлаяВр+86400) = НачалоДня(стрДобавлениеСтрок.ДатаНачала) и СтокаПрошлаяТравма = стрДобавлениеСтрок.Травма Тогда
									если не (ДатаУвольнения >стрДобавлениеСтрок.ДатаНачала и ДатаУвольнения>стрДобавлениеСтрок.ДатаОкончания) Тогда 
										если ДатаПриема <> Дата(1,1,1) и ДатаПриема > стрДобавлениеСтрок.ДатаНачала и не ДатаПриема > стрДобавлениеСтрок.ДатаОкончания  Тогда 
											если КолПр = 1 Тогда  
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
											иначе
												СтрокаВзносыВР = СведенияОСтаже.Добавить();
												если не ВыборкаПоДоговорам.Договор=1 Тогда 
													СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
													СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
												КонецЕсли;
												СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
												если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(стрДобавлениеСтрок.ДатаНачала) и Месяц(ДатаПриема) = Месяц(стрДобавлениеСтрок.ДатаНачала) и День(ДатаПриема) > День(стрДобавлениеСтрок.ДатаНачала) Тогда 
													СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
												ИначеЕсли СчКол > 1 Тогда 
													СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
												иначе
													СтрокаВзносыВР.ДатаНачалаРабот = стрДобавлениеСтрок.ДатаНачала;
												КонецЕсли;
												
												если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < стрДобавлениеСтрок.ДатаОкончания Тогда 
													СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
												иначе
													СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
												КонецЕсли;
												
												Если стрДобавлениеСтрок.Травма = 1 Тогда //О.Т. Аверсон 18.05.2018 № 1985
													СтрокаВзносыВР.ВидДеятельности = СТРАХСЛУЧ;
												иначе
													СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
												КонецЕсли;
												
												СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
												
												
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;

									
									если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < стрДобавлениеСтрок.ДатаОкончания Тогда 
										СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
									иначе
										СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
									КонецЕсли;
																		
									СтокаПрошлаяВр = СтрокаВзносыВР.ДатаОкончанияРабот;
									СтокаПрошлаяТравма = стрДобавлениеСтрок.Травма;//О.Т. Аверсон 18.05.2018 № 1985

									ВзносыДобавлены = Истина;
								иначе
									ЕстьПособие = Ложь;
									для Каждого стрПособие из СтрокиПособия Цикл 
										если НачалоДня(СтокаПрошлаяВр+86400) = стрПособие.ДатаНачалаРабот и СтокаПрошлаяТравма = стрДобавлениеСтрок.Травма Тогда 
											если ВыборкаПоДоговорам.Договор <> 1 Тогда 
											//	ЕстьПособие = Истина;
											КонецЕсли;
										КонецЕсли;
										
									КонецЦикла;
									
									если (ДатаПриема <= стрДобавлениеСтрок.ДатаОкончания или ДатаПриема = Дата(1,1,1)) и (ДатаУвольнения >= стрДобавлениеСтрок.ДатаНачала или ДатаУвольнения = Дата(1,1,1)) Тогда
										если ЕстьПособие Тогда 
											если не (ДатаУвольнения >стрДобавлениеСтрок.ДатаНачала и ДатаУвольнения>стрДобавлениеСтрок.ДатаОкончания) Тогда
												если ДатаПриема <> Дата(1,1,1) и ДатаПриема > стрДобавлениеСтрок.ДатаНачала Тогда 
													если КолПр = 1 Тогда  
														СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
													иначе
														СтрокаВзносыВР = СведенияОСтаже.Добавить();
														если не ВыборкаПоДоговорам.Договор=1 Тогда 
															СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
															СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
														КонецЕсли;
														СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
														если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(стрДобавлениеСтрок.ДатаНачала) и Месяц(ДатаПриема) = Месяц(стрДобавлениеСтрок.ДатаНачала) и День(ДатаПриема) > День(стрДобавлениеСтрок.ДатаНачала) Тогда 
															СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
														ИначеЕсли СчКол > 1 Тогда 
															СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
														иначе
															СтрокаВзносыВР.ДатаНачалаРабот = стрДобавлениеСтрок.ДатаНачала;
														КонецЕсли;
														
														если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < стрДобавлениеСтрок.ДатаОкончания Тогда 
															СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
														иначе
															СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
														КонецЕсли;
														Если стрДобавлениеСтрок.Травма = 1 Тогда //О.Т. Аверсон 18.05.2018 № 1985
															СтрокаВзносыВР.ВидДеятельности = СТРАХСЛУЧ;
														иначе
															СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
														КонецЕсли;
														СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
														
													КонецЕсли;
													
												КонецЕсли;
											КонецЕсли;
											
											если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < стрДобавлениеСтрок.ДатаОкончания Тогда 
												СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
											иначе
												СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
											КонецЕсли;
											ВзносыДобавлены = Истина;
										иначе 
											СтрокаВзносыВР = СведенияОСтаже.Добавить();
											если не ВыборкаПоДоговорам.Договор=1 Тогда 
												СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
												СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
											КонецЕсли;
											СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
											если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(стрДобавлениеСтрок.ДатаНачала) и Месяц(ДатаПриема) = Месяц(стрДобавлениеСтрок.ДатаНачала) и День(ДатаПриема) > День(стрДобавлениеСтрок.ДатаНачала) Тогда 
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
											ИначеЕсли СчКол > 1 Тогда 
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
											иначе
												СтрокаВзносыВР.ДатаНачалаРабот = стрДобавлениеСтрок.ДатаНачала;
											КонецЕсли;
											
											если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < стрДобавлениеСтрок.ДатаОкончания Тогда 
												СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
											иначе
												СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
											КонецЕсли;
											Если стрДобавлениеСтрок.Травма = 1 Тогда //О.Т. Аверсон 18.05.2018 № 1985
												СтрокаВзносыВР.ВидДеятельности = СТРАХСЛУЧ;
											иначе
												СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
											КонецЕсли;
											СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
										КонецЕсли;   
										ВзносыДобавлены = Истина;
										СтокаПрошлаяВр = СтрокаВзносыВР.ДатаОкончанияРабот;
										СтокаПрошлаяТравма = стрДобавлениеСтрок.Травма;//О.Т. Аверсон 18.05.2018 № 1985
									ИначеЕсли ?(КолПр > 1,ДатаУвольнения >стрДобавлениеСтрок.ДатаНачала,Ложь) Тогда 
										СтрокаВзносыВР = СведенияОСтаже.Добавить();
										если не ВыборкаПоДоговорам.Договор=1 Тогда 
											СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
											СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
										КонецЕсли;
										СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
										СтрокаВзносыВР.ДатаНачалаРабот = стрДобавлениеСтрок.ДатаНачала;
										СтрокаВзносыВР.ДатаОкончанияРабот = стрДобавлениеСтрок.ДатаОкончания;
										Если стрДобавлениеСтрок.Травма = 1 Тогда //О.Т. Аверсон 18.05.2018 № 1985
											СтрокаВзносыВР.ВидДеятельности = СТРАХСЛУЧ;
										иначе
											СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
										КонецЕсли;
										СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
										
										СтокаПрошлаяВр = СтрокаВзносыВР.ДатаОкончанияРабот;	
										СтокаПрошлаяТравма = стрДобавлениеСтрок.Травма;//О.Т. Аверсон 18.05.2018 № 1985
										ВзносыДобавлены = Истина;
									иначе
										если не ВзносыДобавлены Тогда 
											если ЗначениеЗаполнено(СтрокаВзносыВР.ДатаОкончанияРабот) Тогда
												если КонецДня(СтрокаВзносыВР.ДатаОкончанияРабот) <> КонецДня(ДатаУвольнения) Тогда 
													если ЗначениеЗаполнено(ДатаУвольнения) Тогда 
														СтрокаВзносыВР = СведенияОСтаже.Добавить();
														если не ВыборкаПоДоговорам.Договор=1 Тогда 
															СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
															СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
														КонецЕсли;
														СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
														СтрокаВзносыВР.ДатаНачалаРабот = ДатаУвольнения;
														
														СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ДатаУвольнения);
														
														
														СтрокаВзносыВР.ВидДеятельности = Премия;
													КонецЕсли;
												КонецЕсли;
											иначе
												если ЗначениеЗаполнено(ДатаУвольнения) Тогда 
													СтрокаВзносыВР = СведенияОСтаже.Добавить();
													если не ВыборкаПоДоговорам.Договор=1 Тогда 
														СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
														СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
													КонецЕсли;
													СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
													СтрокаВзносыВР.ДатаНачалаРабот = ДатаУвольнения;
													
													СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ДатаУвольнения);
													
													
													СтрокаВзносыВР.ВидДеятельности = Премия;
												КонецЕсли;
											КонецЕсли;		
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							СчСтрокДата = СчСтрокДата+1;
							//ПСА 05.07.2019 СВФР-004373 +++     							
							Если СтрокаВзносыВР.ВидДеятельности = СТРАХСЛУЧ И СтрокиПособия.Количество()> 0 Тогда
								НомерИндексаСтрокиПособия = 0;
								Пока НомерИндексаСтрокиПособия <= СтрокиПособия.Количество()-1 Цикл
									СтрокаПособияПоИндексу = СтрокиПособия[НомерИндексаСтрокиПособия];
									
									Если СтрокаВзносыВР.ДатаНачалаРабот  = СтрокаПособияПоИндексу.ДатаНачалаРабот 
										И СтрокаВзносыВР.ДатаОкончанияРабот = СтрокаПособияПоИндексу.ДатаОкончанияРабот  Тогда
										СведенияОСтаже.Удалить(СтрокаПособияПоИндексу);
										СтрокиПособия.Удалить(НомерИндексаСтрокиПособия);
									Иначе	  										
										НомерИндексаСтрокиПособия= НомерИндексаСтрокиПособия + 1;
									КонецЕсли;
								КонецЦикла	  								
							КонецЕсли;	      							
							//+++ПСА 05.07.2019 СВФР-004373
						КонецЦикла;
						ВзносыДобавлены = Ложь;
						если ДобавлениеСтрокДата1.Количество() = 0 Тогда 
							СтруктураПоискаПособие.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;							
							СтруктураПоискаПособие.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
							СтруктураПоискаПособие.ДатаОкончанияРабот = НачалоДня(КонецМесяца(ВыборкаПоДоговорам.Месяц));
							СтруктураПоискаПособие.ВидДеятельности = ВзносыВрем;
							НайденныеСтрокиПособие =  СведенияОСтаже.НайтиСтроки(СтруктураПоискаПособие);
							СтруктураПособие = Новый Структура("ВидДеятельности,ФизЛицо",Пособие,ВыборкаПоДоговорам.ФизЛицо);
							СтрокиПособия = СведенияОСтаже.НайтиСтроки(СтруктураПособие);

							Если НайденныеСтрокиПособие.Количество() = 0 Тогда
								если НачалоДня(СтокаПрошлаяВр+86400) = НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ?(не ВыборкаПоДоговорам.Договор=1,ДоговорПрошл = ВыборкаПоДоговорам.Договор, Истина) Тогда
									если не (ДатаУвольнения >НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения>КонецМесяца(ВыборкаПоДоговорам.Месяц)) Тогда
										если ДатаПриема <> Дата(1,1,1) и ДатаПриема > ВыборкаПоДоговорам.Месяц Тогда 
											если ДатаУвПрСовпадают и ДатаУвольнения < ДатаПриема Тогда  
												СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
												СтрокаВзносыВР = СведенияОСтаже.Добавить();
												если не ВыборкаПоДоговорам.Договор=1 Тогда 
													СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
													СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
												КонецЕсли;
												СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
												
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
												СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
												СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
												СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
											иначе
												СтрокаВзносыВР = СведенияОСтаже.Добавить();
												если не ВыборкаПоДоговорам.Договор=1 Тогда 
													СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
													СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
												КонецЕсли;
												СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
												если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(ВыборкаПоДоговорам.Месяц) и Месяц(ДатаПриема) = Месяц(ВыборкаПоДоговорам.Месяц) и День(ДатаПриема) > День(ВыборкаПоДоговорам.Месяц) Тогда 
													СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
												ИначеЕсли СчКол > 1 Тогда 
													СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
												иначе
													Если ЗначениеЗаполнено(ВыборкаПоДоговорам.Договор) и ВыборкаПоДоговорам.Договор<>1 и ?(ДоговорПрошл = ВыборкаПоДоговорам.Договор,СтокаПрошлаяВр = Дата(1,1,1),Истина)  Тогда
														СтрокаВзносыВР.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
													Иначе 
														СтрокаВзносыВР.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
													КонецЕсли;
												КонецЕсли;
												
												//О.Т. Аверсон 04.04.2019 № 4187
												Если Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) < Год(ВыборкаПоДоговорам.Месяц) Тогда 
													ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))); 
													Пока ЗаписьГод<Год(ВыборкаПоДоговорам.Месяц) Цикл  
														СтрокаСтажа1 = СведенияОСтаже.Добавить();
														ЗаполнитьЗначенияСвойств(СтрокаСтажа1,СтрокаСтажа);
														если ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) Тогда 
															СтрокаСтажа1.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
														Иначе
															СтрокаСтажа1.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
														КонецЕсли;
														СтрокаСтажа1.ДатаОкончанияРабот = Дата(ЗаписьГод,12,31);
														СтрокаСтажа1.ВидДеятельности = ВзносыВрем;
														СтрокаСтажа1.Категория = ВыборкаПоДоговорам.Категория;
														
														ЗаписьГод = ЗаписьГод+1;
													КонецЦикла;
													СтрокаСтажа.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
												КонецЕсли;													
												//О.Т. Аверсон 04.04.2019 № 4187
												
												если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
													СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
												иначе
													СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
												КонецЕсли;
												//О.Т. Аверсон 22.08.2018 № 2335
												Если не ВыборкаПоДоговорам.Договор=1 Тогда
													Если СтрокаВзносыВР.ДатаОкончанияРабот > ВыборкаПоДоговорам.Договор.ДатаОкончания Тогда 
														СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ВыборкаПоДоговорам.Договор.ДатаОкончания);
													КонецЕсли;
												КонецЕсли;
												//О.Т. Аверсон 22.08.2018 № 2335
												
												СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
												СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
												
												
											КонецЕсли;
											
										КонецЕсли;
									КонецЕсли;
									если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < КонецМесяца(ВыборкаПоДоговорам.Месяц) и не(ДатаУвольнения<ДатаПриема) Тогда 
										СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
									иначе
										СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
									КонецЕсли;
									//О.Т. Аверсон 22.08.2018 № 2335
									Если не ВыборкаПоДоговорам.Договор=1 Тогда
										Если СтрокаВзносыВР.ДатаОкончанияРабот > ВыборкаПоДоговорам.Договор.ДатаОкончания Тогда 
											СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ВыборкаПоДоговорам.Договор.ДатаОкончания);
										КонецЕсли;
									КонецЕсли;
									//О.Т. Аверсон 22.08.2018 № 2335
									
									
									
									
									СтокаПрошлаяВр = СтрокаВзносыВР.ДатаОкончанияРабот;
								иначе
									ЕстьПособие = Ложь;
									для Каждого стрПособие из СтрокиПособия Цикл 
										если НачалоДня(СтокаПрошлаяВр+86400) = стрПособие.ДатаНачалаРабот Тогда 
											//ЕстьПособие = Истина;
										КонецЕсли;
										
									КонецЦикла;
									если (ДатаПриема <= КонецМесяца(ВыборкаПоДоговорам.Месяц) или ДатаПриема = Дата(1,1,1)) и (ДатаУвольнения >= НачалоМесяца(ВыборкаПоДоговорам.Месяц) или ДатаУвольнения = Дата(1,1,1)) Тогда
										если ЕстьПособие Тогда
											если не (ДатаУвольнения >НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения>КонецМесяца(ВыборкаПоДоговорам.Месяц)) Тогда
												если ДатаПриема <> Дата(1,1,1) и ДатаПриема > ВыборкаПоДоговорам.Месяц Тогда 
													если ДатаУвПрСовпадают и ДатаУвольнения < ДатаПриема Тогда  
														СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
														СтрокаВзносыВР = СведенияОСтаже.Добавить();
														если не ВыборкаПоДоговорам.Договор=1 Тогда 
															СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
															СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
														КонецЕсли;
														СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
														
														СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
														СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
														СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
														СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
														
													иначе
														СтрокаВзносыВР = СведенияОСтаже.Добавить();
														если не ВыборкаПоДоговорам.Договор=1 Тогда 
															СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
															СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
														КонецЕсли;
														СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
														если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(ВыборкаПоДоговорам.Месяц) и Месяц(ДатаПриема) = Месяц(ВыборкаПоДоговорам.Месяц) и День(ДатаПриема) > День(ВыборкаПоДоговорам.Месяц) Тогда 
															СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
														ИначеЕсли СчКол > 1 Тогда 
															СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
														иначе
															Если ЗначениеЗаполнено(ВыборкаПоДоговорам.Договор) и ВыборкаПоДоговорам.Договор<>1 и ?(ДоговорПрошл = ВыборкаПоДоговорам.Договор,СтокаПрошлаяВр = Дата(1,1,1),Истина)  Тогда
																СтрокаВзносыВР.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
															Иначе 
																СтрокаВзносыВР.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
															КонецЕсли;
														КонецЕсли;
														
														//О.Т. Аверсон 04.04.2019 № 4187
														Если Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) < Год(ВыборкаПоДоговорам.Месяц) Тогда 
															ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))); 
															Пока ЗаписьГод<Год(ВыборкаПоДоговорам.Месяц) Цикл  
																СтрокаСтажа1 = СведенияОСтаже.Добавить();
																ЗаполнитьЗначенияСвойств(СтрокаСтажа1,СтрокаСтажа);
																если ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) Тогда 
																	СтрокаСтажа1.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
																Иначе
																	СтрокаСтажа1.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
																КонецЕсли;
																СтрокаСтажа1.ДатаОкончанияРабот = Дата(ЗаписьГод,12,31);
																СтрокаСтажа1.ВидДеятельности = ВзносыВрем;
																СтрокаСтажа1.Категория = ВыборкаПоДоговорам.Категория;
																
																ЗаписьГод = ЗаписьГод+1;
															КонецЦикла;
															СтрокаСтажа.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
														КонецЕсли;													
														//О.Т. Аверсон 04.04.2019 № 4187
														
														если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
															СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
														иначе
															СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
														КонецЕсли;
														//О.Т. Аверсон 22.08.2018 № 2335
														Если не ВыборкаПоДоговорам.Договор=1 Тогда
															Если СтрокаВзносыВР.ДатаОкончанияРабот > ВыборкаПоДоговорам.Договор.ДатаОкончания Тогда 
																СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ВыборкаПоДоговорам.Договор.ДатаОкончания);
															КонецЕсли;
														КонецЕсли;
														//О.Т. Аверсон 22.08.2018 № 2335
														
														СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
														СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
														
														
													КонецЕсли;
												иначе
													СтрокаВзносыВР = СведенияОСтаже.Добавить();
													если не ВыборкаПоДоговорам.Договор=1 Тогда 
														СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
														СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
													КонецЕсли;
													СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
													СтрокаВзносыВР.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
													СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
													СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
												КонецЕсли;
											иначе
												СтрокаВзносыВР = СведенияОСтаже.Добавить();
												если не ВыборкаПоДоговорам.Договор=1 Тогда 
													СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
													СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
												КонецЕсли;
												СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
												СтрокаВзносыВР.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
												СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
												СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
											КонецЕсли;
											
											
											если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
												СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
											иначе
												СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
											КонецЕсли;
											//О.Т. Аверсон 22.08.2018 № 2335
											Если не ВыборкаПоДоговорам.Договор=1 Тогда
												Если СтрокаВзносыВР.ДатаОкончанияРабот > ВыборкаПоДоговорам.Договор.ДатаОкончания Тогда 
													СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ВыборкаПоДоговорам.Договор.ДатаОкончания);
												КонецЕсли;
											КонецЕсли;
											//О.Т. Аверсон 22.08.2018 № 2335
												
										иначе
											СтрокаВзносыВР = СведенияОСтаже.Добавить();
											если не ВыборкаПоДоговорам.Договор=1 Тогда 
												СтрокаВзносыВР.Договор = ВыборкаПоДоговорам.Договор;
												СтрокаВзносыВР.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
											КонецЕсли;
											СтрокаВзносыВР.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
											если ДатаПриема <> Дата(1,1,1) и Год(ДатаПриема) = Год(ВыборкаПоДоговорам.Месяц) и Месяц(ДатаПриема) = Месяц(ВыборкаПоДоговорам.Месяц) и День(ДатаПриема) > День(ВыборкаПоДоговорам.Месяц)
												 Тогда //и не (ДатаУвольнения >НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения>КонецМесяца(ВыборкаПоДоговорам.Месяц)) //О.Т. Аверсон 02.03.2016 № Убрала,т.к. в дата начала не заполняется дата приема
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
											ИначеЕсли СчКол > 1 Тогда 
												СтрокаВзносыВР.ДатаНачалаРабот = ДатаПриема;
											иначе
												Если ЗначениеЗаполнено(ВыборкаПоДоговорам.Договор) и ВыборкаПоДоговорам.Договор<>1 и ?(ДоговорПрошл = ВыборкаПоДоговорам.Договор,СтокаПрошлаяВр = Дата(1,1,1),Истина)  Тогда
													СтрокаВзносыВР.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
													//О.Т. Аверсон 04.04.2019 № 4187
													Если Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) < Год(ВыборкаПоДоговорам.Месяц) Тогда 
														ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))); 
														Пока ЗаписьГод<Год(ВыборкаПоДоговорам.Месяц) Цикл  
															СтрокаВзносыВР1 = СведенияОСтаже.Добавить();
															ЗаполнитьЗначенияСвойств(СтрокаВзносыВР1,СтрокаВзносыВР);
															если ЗаписьГод =Год(Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01))) Тогда 
																СтрокаВзносыВР1.ДатаНачалаРабот = Макс(ВыборкаПоДоговорам.Договор.ДатаНачала,Дата(2014,01,01));
															Иначе
																СтрокаВзносыВР1.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
															КонецЕсли;
															СтрокаВзносыВР1.ДатаОкончанияРабот = Дата(ЗаписьГод,12,31);
															СтрокаВзносыВР1.ВидДеятельности = ВзносыВрем;
															СтрокаВзносыВР1.Категория = ВыборкаПоДоговорам.Категория;
															
															ЗаписьГод = ЗаписьГод+1;
														КонецЦикла;
														СтрокаВзносыВР.ДатаНачалаРабот = Дата(ЗаписьГод,01,01);
													КонецЕсли;													
													//О.Т. Аверсон 04.04.2019 № 4187
												Иначе 
													СтрокаВзносыВР.ДатаНачалаРабот = НачалоМесяца(ВыборкаПоДоговорам.Месяц);
												КонецЕсли;
											КонецЕсли;
											
											если ДатаУвольнения <> Дата(1,1,1) и ДатаУвольнения < КонецМесяца(ВыборкаПоДоговорам.Месяц) Тогда 
												СтрокаВзносыВР.ДатаОкончанияРабот = ДатаУвольнения;
											иначе
												СтрокаВзносыВР.ДатаОкончанияРабот = КонецМесяца(ВыборкаПоДоговорам.Месяц);
											КонецЕсли;
											//О.Т. Аверсон 22.08.2018 № 2335
											Если не ВыборкаПоДоговорам.Договор=1 Тогда 
												Если СтрокаВзносыВР.ДатаОкончанияРабот > ВыборкаПоДоговорам.Договор.ДатаОкончания Тогда 
													СтрокаВзносыВР.ДатаОкончанияРабот = КонецДня(ВыборкаПоДоговорам.Договор.ДатаОкончания);
												КонецЕсли;
											КонецЕсли;
											//О.Т. Аверсон 22.08.2018 № 2335
											
											СтрокаВзносыВР.ВидДеятельности = ВзносыВрем;
											СтрокаВзносыВР.Категория = ВыборкаПоДоговорам.Категория;//О.Т. Аверсон 02.03.2016 (Чтоб попадала в отбор)
										КонецЕсли;
										ДоговорПрошл = ВыборкаПоДоговорам.Договор;
										СтокаПрошлаяВр = СтрокаВзносыВР.ДатаОкончанияРабот;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						 
						
					КонецЕсли;
					//КонецЕсли;
					
					//Островская Татьяна 05.03.2014 № 17172
					
					
					//КонецЕсли;
					//КонецЕсли;
					если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда
						Если НайденныеСтроки.Количество() > 0 Тогда
							СтруктураПоискаВзносы.ФизЛицо = НайденныеСтроки[0].ФизЛицо;
						иначе
							СтруктураПоискаВзносы.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
						КонецЕсли;
					иначе
						СтруктураПоискаВзносы.ФизЛицо = ВыборкаПоДоговорам.ФизЛицо;
					КонецЕсли;
					//О.Т. Аверсон 29.08.2018 № 2363
					Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
						ОсновнойВидНалогообл = ВидНалогообложения;
					иначе
						ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
					КонецЕсли;
					//О.Т. Аверсон 29.08.2018 № 2363
					СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоговорам.Месяц) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
					БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
					
					
					СтруктураПоискаВзносы.Месяц=ВыборкаПоДоговорам.Месяц;
					Если ВыборкаПоДоговорам.Выплаты > БазаОграниченияФСЗН Тогда 
						СтруктураПоискаВзносы.Выплаты = БазаОграниченияФСЗН;
					иначе
						СтруктураПоискаВзносы.Выплаты = ВыборкаПоДоговорам.Выплаты;
					КонецЕсли;
					СтруктураПоискаВзносы.Пособия=ВыборкаПоДоговорам.Пособия;
					СтруктураПоискаВзносы.Взносы=ВыборкаПоДоговорам.Взносы;	
					СтруктураПоискаВзносы.ТарифВзносов=ВыборкаПоДоговорам.ТарифВзносов;
					СтруктураПоискаВзносы.Договор=ВыборкаПоДоговорам.Договор;	
					СтруктураПоискаВзносы.Категория=ВыборкаПоДоговорам.Категория;
					НайденныеСтрокиВзносы =  СведенияОВзносах.НайтиСтроки(СтруктураПоискаВзносы);
					если НайденныеСтрокиВзносы.Количество() = 0 Тогда
						если не ВыборкаПоДоговорам.Договор = 1 и (ВсеСотрудники или ДогПодряда) Тогда
							//О.Т. Аверсон 11.04.2019 № 4221 Чтоб записи по нулевым значениям по премиям не задвоились
							МассивОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
							Если МассивОВзносах.Количество()=0 Тогда 
								СтрокаВзносов = СведенияОВзносах.Добавить();
							иначе
								СтрокаВзносов = МассивОВзносах[0];
							КонецЕсли;
							//О.Т. Аверсон 11.04.2019 № 4221
							
							ЗаполнитьЗначенияСвойств(СтрокаВзносов,ВыборкаПоДоговорам);
							
							//О.Т. Аверсон 17.04.2019 № 4246
							ЗапросЗаСвойСчет = Новый Запрос;
							ЗапросЗаСвойСчет.Текст = 
							"ВЫБРАТЬ
							|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) КАК ЭтоКод15,
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
							|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) КАК ЭтоКод16,
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
							|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) КАК ЭтоКод19,
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
							|ИЗ
							|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
							|ГДЕ
							|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
							|	И ( ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &ВидРасчета )
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) 
							|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В
							|					( ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) 
							|					 , ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) )
							|     )
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
							|
							|УПОРЯДОЧИТЬ ПО
							|	ПериодДействияНачало";
							ЗапросЗаСвойСчет.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);
							СписокВР = Новый СписокЗначений;
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный); //09
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул); //05
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							ЗапросЗаСвойСчет.УстановитьПараметр( "МассивКод15", МассивКод15 );
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							ЗапросЗаСвойСчет.УстановитьПараметр("ВидРасчета",СписокВР);
							ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
							РезЗаСвойСчет = ЗапросЗаСвойСчет.Выполнить().Выгрузить();
							
							МассивЗС = ТаблицаЗанимаемыеСтавки.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
							Если МассивЗС.Количество()>0 Тогда
								ЗанимаемыхСтавок = МассивЗС[0].ЗанимаемыхСтавок;
							иначе
								ЗанимаемыхСтавок = 0;	
							КонецЕсли;
							
							ЗапросПрочиеПричины = Новый Запрос;
							ЗапросПрочиеПричины.Текст = 
							"ВЫБРАТЬ
							|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ПричиныМинимальнойЗаработнойПлаты
							|ИЗ
							|	РегистрСведений.ПрочиеПричиныМинимальнойЗаработнойПлаты КАК ПрочиеПричиныМинимальнойЗаработнойПлаты
							|ГДЕ
							|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ФизЛицо = &ФизЛицо
							// + СВЭЙ КДЯ 22.07.19 СВФР-004561
							|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Организация = &Организация
							// - СВЭЙ КДЯ 22.07.19 СВФР-004561
							|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Период МЕЖДУ &Период И &Период1";
							
							// + СВЭЙ КДЯ 22.07.19 СВФР-004561
							ЗапросПрочиеПричины.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
							// - СВЭЙ КДЯ 22.07.19 СВФР-004561
							ЗапросПрочиеПричины.УстановитьПараметр("Период", НачалоМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросПрочиеПричины.УстановитьПараметр("Период1", КонецМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросПрочиеПричины.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
							
							РезПрочиеПричины = ЗапросПрочиеПричины.Выполнить().Выбрать();
							ПрочаяПричина = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
							Пока РезПрочиеПричины.Следующий() Цикл
								ПрочаяПричина = РезПрочиеПричины.ПричиныМинимальнойЗаработнойПлаты;								
							КонецЦикла;						
							
							РазмерМинЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
							Если ВыборкаПоДоговорам.Договор = 1 Тогда 
								Если ЗначениеЗаполнено(ПрочаяПричина) Тогда 
									СтрокаВзносов.ПричиныМинимальнойЗП = ПрочаяПричина;
								иначе
									Если ВыборкаПоДоговорам.Выплаты + ВыборкаПоДоговорам.Пособия <= РазмерМинЗП Тогда 
										Если (ДатаПриема > НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаПриема <= КонецМесяца(ВыборкаПоДоговорам.Месяц)) или
											(ДатаУвольнения <= КонецМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения <> Дата(1,1,1)) Тогда									
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяВСвязиСПриемомУвольнением;
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)).Количество()>0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам; 
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный)).Количество()>0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам;
										//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод15", Истина  ) ).Количество() > 0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособностиПоСправкеИлиНетПособия;
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод16", Истина  ) ).Количество() > 0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ИзРасчетаЧасовойМинимЗП;
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод19", Истина  ) ).Количество() > 0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОплачиваемыйОтпуск;
										//- СВЭЙ КДЯ 07.06.19 СВФР-004424
										ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)).Количество()>0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НарушениеТрудовоПроизводственноТехнологическойИсполнительскойДисциплины;
										ИначеЕсли ВыборкаПоДоговорам.Пособия > 0  Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособности;
										ИначеЕсли ЗанимаемыхСтавок < 1 и ЗанимаемыхСтавок>0 Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяПоСоглашениюМеждуРаботникомИНанимателем; 									
										КонецЕсли;
									иначе
										СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							//О.Т. Аверсон 17.04.2019 № 4246
							
							//О.Т. Аверсон 29.01.2018 № 1511
							Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
								СтрокаВзносов.Выплаты = ВыборкаПоДоговорам.Выплаты;
							иначе
								Если ВыборкаПоДоговорам.Выплаты > БазаОграниченияФСЗН Тогда 
									СтрокаВзносов.Выплаты = БазаОграниченияФСЗН;
								иначе
									СтрокаВзносов.Выплаты = ВыборкаПоДоговорам.Выплаты;
								КонецЕсли;
							КонецЕсли;
							//О.Т. Аверсон 29.01.2018 № 1511
							
							если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда
								СтрокаВзносов.ФизЛицо = СтруктураПоискаВзносы.ФизЛицо;
							КонецЕсли;
							
							если не ВыборкаПоДоговорам.Договор = 1 Тогда 
								СтрокаВзносов.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
							иначе
								СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
							КонецЕсли;
							//если Основные и ВыборкаПоДоговорам.Договор <> 1 Тогда
							//	СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
							//КонецЕсли;
							//О.Т. Аверсон 29.08.2018 № 2363
							Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
								ОсновнойВидНалогообл = ВидНалогообложения;
							иначе
								ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
							КонецЕсли;
							//О.Т. Аверсон 29.08.2018 № 2363
							Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда
								СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
								СтавкаФСЗН = СтруктураФСЗН.Размер;
								СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
								СтавкаПенс = СтруктураПенс.Размер;
								Взносы = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаПоДоговорам.Выплаты * СтавкаФСЗН/100,ДатаРегистрации)+ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаПоДоговорам.Выплаты * СтавкаПенс/100,ДатаРегистрации)
							иначе
								
								Если ВсегоВыплат <> 0 Тогда
									Взносы = ВыборкаПоДоговорам.Взносы*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
									//Выплаты = ВсегоВыплат*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
								Иначе
									Взносы = 0;
									//Выплаты = 0;
								КонецЕсли;
							КонецЕсли;
							СтрокаВзносов.Взносы = Взносы;  
							РезультатДоговор= 0;
							Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда 
								
								ЗапросДог = Новый Запрос;
								ЗапросДог.Текст = 
								"ВЫБРАТЬ
								|	ЕСНСведенияОДоходах.Результат
								|ИЗ
								|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
								|ГДЕ
								|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
								|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
								|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
								//|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета"; //О.Т. Аверсон 31.01.2017 № 244
								ЗапросДог.УстановитьПараметр("ФизЛицо",СтруктураПоискаВзносы.ФизЛицо);
								ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
								ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
								ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
								//ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
								РезДог = ЗапросДог.Выполнить().Выбрать();
								
								пока РезДог.Следующий() Цикл 
									РезультатДоговор =РезультатДоговор + РезДог.Результат; 
								КонецЦикла;
								Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
									СтрокаВзносов.Выплаты = РезультатДоговор;
								иначе
									Если РезультатДоговор > БазаОграниченияФСЗН Тогда 
										СтрокаВзносов.Выплаты = БазаОграниченияФСЗН;
									иначе
										СтрокаВзносов.Выплаты = РезультатДоговор;
									КонецЕсли;
								КонецЕсли;
								
								
							КонецЕсли;
							
						ИначеЕсли ВыборкаПоДоговорам.Договор = 1 и (ВсеСотрудники или Основные) Тогда
							//О.Т. Аверсон 11.04.2019 № 4221 Чтоб записи по нулевым значениям по премиям не задвоились
							МассивОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
							Если МассивОВзносах.Количество()=0 Тогда 
								СтрокаВзносов = СведенияОВзносах.Добавить();
							иначе
								СтрокаВзносов = МассивОВзносах[0];
							КонецЕсли;
							//О.Т. Аверсон 11.04.2019 № 4221
							ЗаполнитьЗначенияСвойств(СтрокаВзносов,ВыборкаПоДоговорам);
							
							//О.Т. Аверсон 17.04.2019 № 4246
							ЗапросЗаСвойСчет = Новый Запрос;
							ЗапросЗаСвойСчет.Текст = 
							"ВЫБРАТЬ
							|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) КАК ЭтоКод15,
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
							|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) КАК ЭтоКод16,
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
							|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) КАК ЭтоКод19,
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
							|ИЗ
							|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
							|ГДЕ
							|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
							|	И ( ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &ВидРасчета )
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) 
							|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В
							|					( ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) 
							|					 , ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) )
							|     )
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
							|
							|УПОРЯДОЧИТЬ ПО
							|	ПериодДействияНачало";
							ЗапросЗаСвойСчет.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);
							СписокВР = Новый СписокЗначений;
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный); //09
							СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул); //05
							//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
							ЗапросЗаСвойСчет.УстановитьПараметр( "МассивКод15", МассивКод15 );
							//- СВЭЙ КДЯ 07.06.19 СВФР-004424
							ЗапросЗаСвойСчет.УстановитьПараметр("ВидРасчета",СписокВР);
							ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
							РезЗаСвойСчет = ЗапросЗаСвойСчет.Выполнить().Выгрузить();
							МассивЗС = ТаблицаЗанимаемыеСтавки.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
							Если МассивЗС.Количество()>0 Тогда
								ЗанимаемыхСтавок = МассивЗС[0].ЗанимаемыхСтавок;
							иначе
								ЗанимаемыхСтавок = 0;	
							КонецЕсли;
							
							ЗапросПрочиеПричины = Новый Запрос;
							ЗапросПрочиеПричины.Текст = 
							"ВЫБРАТЬ
							|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ПричиныМинимальнойЗаработнойПлаты
							|ИЗ
							|	РегистрСведений.ПрочиеПричиныМинимальнойЗаработнойПлаты КАК ПрочиеПричиныМинимальнойЗаработнойПлаты
							|ГДЕ
							|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ФизЛицо = &ФизЛицо
							// + СВЭЙ КДЯ 22.07.19 СВФР-004561
							|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Организация = &Организация
							// - СВЭЙ КДЯ 22.07.19 СВФР-004561
							|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Период МЕЖДУ &Период И &Период1";
							
							// + СВЭЙ КДЯ 22.07.19 СВФР-004561
							ЗапросПрочиеПричины.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
							// - СВЭЙ КДЯ 22.07.19 СВФР-004561
							ЗапросПрочиеПричины.УстановитьПараметр("Период", НачалоМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросПрочиеПричины.УстановитьПараметр("Период1", КонецМесяца(ВыборкаПоДоговорам.Месяц));
							ЗапросПрочиеПричины.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
							
							РезПрочиеПричины = ЗапросПрочиеПричины.Выполнить().Выбрать();
							ПрочаяПричина = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
							Пока РезПрочиеПричины.Следующий() Цикл
								ПрочаяПричина = РезПрочиеПричины.ПричиныМинимальнойЗаработнойПлаты;								
							КонецЦикла;	

						
							РазмерМинЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
							
							Если ВыборкаПоДоговорам.Договор = 1 Тогда 
								Если ЗначениеЗаполнено(ПрочаяПричина) Тогда 
									СтрокаВзносов.ПричиныМинимальнойЗП = ПрочаяПричина;
								иначе
									Если ВыборкаПоДоговорам.Выплаты + ВыборкаПоДоговорам.Пособия <= РазмерМинЗП Тогда
										Если СтрокаВзносов.ПричиныМинимальнойЗП <> Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет Тогда
											Если (ДатаПриема > НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаПриема <= КонецМесяца(ВыборкаПоДоговорам.Месяц)) или
												(ДатаУвольнения <= КонецМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения <> Дата(1,1,1)) Тогда									
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяВСвязиСПриемомУвольнением;
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)).Количество()>0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам; 
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный)).Количество()>0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам;
											//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод15", Истина  ) ).Количество() > 0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособностиПоСправкеИлиНетПособия;
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод16", Истина  ) ).Количество() > 0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ИзРасчетаЧасовойМинимЗП;
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод19", Истина  ) ).Количество() > 0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОплачиваемыйОтпуск;
											//- СВЭЙ КДЯ 07.06.19 СВФР-004424
											ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)).Количество()>0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НарушениеТрудовоПроизводственноТехнологическойИсполнительскойДисциплины;
											ИначеЕсли ВыборкаПоДоговорам.Пособия > 0  Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособности;
											ИначеЕсли ЗанимаемыхСтавок < 1 и ЗанимаемыхСтавок>0 Тогда 
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяПоСоглашениюМеждуРаботникомИНанимателем; 									
											КонецЕсли;
										КонецЕсли;
									иначе
										СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							//О.Т. Аверсон 17.04.2019 № 4246
							
							
							//О.Т. Аверсон 29.01.2018 № 1511
							Если ВыборкаПоДоговорам.Выплаты > БазаОграниченияФСЗН Тогда 
								СтрокаВзносов.Выплаты = БазаОграниченияФСЗН;
							иначе
								СтрокаВзносов.Выплаты = ВыборкаПоДоговорам.Выплаты;
							КонецЕсли;
							//О.Т. Аверсон 29.01.2018 № 1511
							если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда
								СтрокаВзносов.ФизЛицо = СтруктураПоискаВзносы.ФизЛицо;
							КонецЕсли;
							
							если не ВыборкаПоДоговорам.Договор = 1 Тогда 
								СтрокаВзносов.ВидДоговора = ВыборкаПоДоговорам.Договор.Сотрудник.ВидДоговора;
							иначе
								СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
							КонецЕсли;
							//если Основные и ВыборкаПоДоговорам.Договор <> 1 Тогда
							//	СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
							//КонецЕсли;
							
							Если ВсегоВыплат <> 0 Тогда
								Взносы = ВыборкаПоДоговорам.Взносы*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
								//Выплаты = ВсегоВыплат*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
							Иначе
								Взносы = 0;
								//Выплаты = 0;
							КонецЕсли;
							СтрокаВзносов.Взносы = Взносы;
							
						КонецЕсли;
						
						
						//	СтрокаВзносов.Выплаты = Выплаты;
						если ВыборкаПоДоговорам.Договор <> 1 Тогда
							если ВыборкаПоДоговорам.ВидРасчетаОклад = 1 или ВыборкаПоДоговорам.ВидРасчетаОклад = null Тогда
							иначе
								если ВсеСотрудники или Основные Тогда 
									РезультатДоговор= 0;        
									
									ЗапросДог = Новый Запрос;
									ЗапросДог.Текст = 
									"ВЫБРАТЬ
									|	ЕСНСведенияОДоходах.Результат
									|ИЗ
									|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
									|ГДЕ
									|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
									|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
									|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
									//|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета"; //О.Т. Аверсон 31.01.2017 № 244
									ЗапросДог.УстановитьПараметр("ФизЛицо",СтруктураПоискаВзносы.ФизЛицо);
									ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
									ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
									ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
									//ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
									РезДог = ЗапросДог.Выполнить().Выбрать();
									пока РезДог.Следующий() Цикл 
										РезультатДоговор =РезультатДоговор+РезДог.Результат; 
									КонецЦикла;
									
									
									
									//О.Т. Аверсон 11.04.2019 № 4221 Чтоб записи по нулевым значениям по премиям не задвоились
									МассивОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
									Если МассивОВзносах.Количество()=0 Тогда 
										СтрокаВзносов = СведенияОВзносах.Добавить();
									иначе
										СтрокаВзносов = МассивОВзносах[0];
									КонецЕсли;
									//О.Т. Аверсон 11.04.2019 № 4221
									ЗаполнитьЗначенияСвойств(СтрокаВзносов,ВыборкаПоДоговорам);
									
									//О.Т. Аверсон 17.04.2019 № 4246
									ЗапросЗаСвойСчет = Новый Запрос;
									ЗапросЗаСвойСчет.Текст = 
									"ВЫБРАТЬ
									|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
									//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
									|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) КАК ЭтоКод15,
									|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
									|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) КАК ЭтоКод16,
									|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета 
									|		= ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) КАК ЭтоКод19,
									//- СВЭЙ КДЯ 07.06.19 СВФР-004424
									|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета
									|ИЗ
									|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
									|ГДЕ
									|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &ПериодДействия И &ПериодДействия1
									|	И ( ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
									//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
									|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В ( &МассивКод15 ) 
									|		ИЛИ ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В
									|					( ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ДоплатаДоРазмераМинимальнойЗарплаты ) 
									|					 , ЗНАЧЕНИЕ( Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ) )
									|     )
									//- СВЭЙ КДЯ 07.06.19 СВФР-004424
									|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
									|
									|УПОРЯДОЧИТЬ ПО
									|	ПериодДействияНачало";
									ЗапросЗаСвойСчет.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);
									СписокВР = Новый СписокЗначений;
									СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
									СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный); //09
									СписокВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул); //05
									//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
									ЗапросЗаСвойСчет.УстановитьПараметр( "МассивКод15", МассивКод15 );
									//- СВЭЙ КДЯ 07.06.19 СВФР-004424
									ЗапросЗаСвойСчет.УстановитьПараметр("ВидРасчета",СписокВР);
									ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
									ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
									РезЗаСвойСчет = ЗапросЗаСвойСчет.Выполнить().Выгрузить();
									МассивЗС = ТаблицаЗанимаемыеСтавки.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ВыборкаПоДоговорам.Месяц)); 
									Если МассивЗС.Количество()>0 Тогда
										ЗанимаемыхСтавок = МассивЗС[0].ЗанимаемыхСтавок;
									иначе
										ЗанимаемыхСтавок = 0;	
									КонецЕсли;
									ЗапросПрочиеПричины = Новый Запрос;
									ЗапросПрочиеПричины.Текст = 
									"ВЫБРАТЬ
									|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ПричиныМинимальнойЗаработнойПлаты
									|ИЗ
									|	РегистрСведений.ПрочиеПричиныМинимальнойЗаработнойПлаты КАК ПрочиеПричиныМинимальнойЗаработнойПлаты
									|ГДЕ
									|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ФизЛицо = &ФизЛицо
									// + СВЭЙ КДЯ 22.07.19 СВФР-004561
									|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Организация = &Организация
									// - СВЭЙ КДЯ 22.07.19 СВФР-004561
									|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Период МЕЖДУ &Период И &Период1";
									
	
									// + СВЭЙ КДЯ 22.07.19 СВФР-004561
									ЗапросПрочиеПричины.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
									// - СВЭЙ КДЯ 22.07.19 СВФР-004561
									ЗапросПрочиеПричины.УстановитьПараметр("Период", НачалоМесяца(ВыборкаПоДоговорам.Месяц));
									ЗапросПрочиеПричины.УстановитьПараметр("Период1", КонецМесяца(ВыборкаПоДоговорам.Месяц));
									ЗапросПрочиеПричины.УстановитьПараметр("ФизЛицо", ВыборкаПоДоговорам.ФизЛицо);
									
									РезПрочиеПричины = ЗапросПрочиеПричины.Выполнить().Выбрать();
									ПрочаяПричина = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
									Пока РезПрочиеПричины.Следующий() Цикл
										ПрочаяПричина = РезПрочиеПричины.ПричиныМинимальнойЗаработнойПлаты;								
									КонецЦикла;	
									
									РазмерМинЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
									Если ВыборкаПоДоговорам.Договор = 1 Тогда
										Если ЗначениеЗаполнено(ПрочаяПричина) Тогда 
											СтрокаВзносов.ПричиныМинимальнойЗП = ПрочаяПричина;
										иначе
											Если ВыборкаПоДоговорам.Выплаты + ВыборкаПоДоговорам.Пособия <= РазмерМинЗП Тогда
												Если СтрокаВзносов.ПричиныМинимальнойЗП <> Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет Тогда
													Если (ДатаПриема > НачалоМесяца(ВыборкаПоДоговорам.Месяц) и ДатаПриема <= КонецМесяца(ВыборкаПоДоговорам.Месяц)) или
														(ДатаУвольнения <= КонецМесяца(ВыборкаПоДоговорам.Месяц) и ДатаУвольнения <> Дата(1,1,1)) Тогда									
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяВСвязиСПриемомУвольнением;
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет)).Количество()>0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам; 
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный)).Количество()>0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам;
													//+ СВЭЙ КДЯ 07.06.19 СВФР-004424
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод15", Истина  ) ).Количество() > 0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособностиПоСправкеИлиНетПособия;
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод16", Истина  ) ).Количество() > 0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ИзРасчетаЧасовойМинимЗП;
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки( Новый Структура( "ЭтоКод19", Истина  ) ).Количество() > 0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОплачиваемыйОтпуск;
													//- СВЭЙ КДЯ 07.06.19 СВФР-004424
													ИначеЕсли РезЗаСвойСчет.НайтиСтроки(Новый Структура("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул)).Количество()>0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НарушениеТрудовоПроизводственноТехнологическойИсполнительскойДисциплины;
													ИначеЕсли ВыборкаПоДоговорам.Пособия > 0  Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодВременнойНетрудоспособности;
														
													ИначеЕсли ЗанимаемыхСтавок < 1 и ЗанимаемыхСтавок>0 Тогда 
														СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.НеполноеРабочееВремяПоСоглашениюМеждуРаботникомИНанимателем; 									
													КонецЕсли;	
												КонецЕсли;
											иначе
												СтрокаВзносов.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
											КонецЕсли; 
										КонецЕсли;
									КонецЕсли;
									//О.Т. Аверсон 17.04.2019 № 4246
									
									//О.Т. Аверсон 29.01.2018 № 1511
									Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда
										СтрокаВзносов.Выплаты = ВыборкаПоДоговорам.Выплаты;
									иначе
										Если ВыборкаПоДоговорам.Выплаты > БазаОграниченияФСЗН Тогда 
											СтрокаВзносов.Выплаты = БазаОграниченияФСЗН;
										иначе
											СтрокаВзносов.Выплаты = ВыборкаПоДоговорам.Выплаты;
										КонецЕсли;
									КонецЕсли;
									//О.Т. Аверсон 29.01.2018 № 1511
									если ОбъединятьОсновные и ВыборкаПоДоговорам.Договор = 1 Тогда
										СтрокаВзносов.ФизЛицо = СтруктураПоискаВзносы.ФизЛицо;
									КонецЕсли;
									
									СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
									
									//если Основные и ВыборкаПоДоговорам.Договор <> 1 Тогда
									//	СтрокаВзносов.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка();
									//КонецЕсли;
									//О.Т. Аверсон 29.08.2018 № 2363
									Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
										ОсновнойВидНалогообл = ВидНалогообложения;
									иначе
										ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
									КонецЕсли;
									//О.Т. Аверсон 29.08.2018 № 2363
									Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда
										СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
										СтавкаФСЗН = СтруктураФСЗН.Размер;
										СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(ВыборкаПоДоговорам.Месяц),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
										СтавкаПенс = СтруктураПенс.Размер;
										Взносы = ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаПоДоговорам.Выплаты * СтавкаФСЗН/100,ДатаРегистрации)+ОбщегоНазначения.ОкруглитьЗначение2016(ВыборкаПоДоговорам.Выплаты * СтавкаПенс/100,ДатаРегистрации)
									иначе
										
										Если ВсегоВыплат <> 0 Тогда
											Взносы = ВыборкаПоДоговорам.Взносы*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
											//Выплаты = ВсегоВыплат*ВыборкаПоДоговорам.Выплаты/ВсегоВыплат;
										Иначе
											Взносы = 0;
											//Выплаты = 0;
										КонецЕсли;
									КонецЕсли;
									СтрокаВзносов.Взносы = Взносы;
									СтрокаВзносов.Выплаты = СтрокаВзносов.Выплаты - РезультатДоговор;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						//О.Т. Аверсон 18.04.2019 № 4246
						ЗапросЗаСвойСчет = Новый Запрос;
						ЗапросЗаСвойСчет.Текст = 
						"ВЫБРАТЬ
						|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
						|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
						|	МИНИМУМ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало) КАК ПериодДействияНачало,
						|	МАКСИМУМ(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец) КАК ПериодДействияКонец
						|ИЗ
						|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
						|ГДЕ
						|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &ПериодДействия И &ПериодДействия1
						|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В(&ВидРасчета)
						|	И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо
						|
						|СГРУППИРОВАТЬ ПО
						|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
						|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета";
						ЗапросЗаСвойСчет.УстановитьПараметр("ФизЛицо",ВыборкаПоДоговорам.ФизЛицо);
						ЗапросЗаСвойСчет.УстановитьПараметр("ВидРасчета",ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
						ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия",НачалоМесяца(ВыборкаПоДоговорам.Месяц));
						ЗапросЗаСвойСчет.УстановитьПараметр("ПериодДействия1",КонецМесяца(ВыборкаПоДоговорам.Месяц));
						РезЗаСвойСчет = ЗапросЗаСвойСчет.Выполнить().Выгрузить();
						
						Для Каждого стрСвойСчет из РезЗаСвойСчет Цикл 
							ДатаНачДО = Макс(ДатаНачала,НачалоМесяца(стрСвойСчет.ПериодДействияНачало));
							ДатаКонДО = Мин(ДатаОкончания,НачалоМесяца(стрСвойСчет.ПериодДействияКонец));
							Пока ДатаНачДО <= ДатаКонДО Цикл
								МассивСвОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоДоговорам.ФизЛицо,ДатаНачДО)); 
								Если МассивСвОВзносах.Количество()=0 Тогда 
									СтрокаСтажа = СведенияОВзносах.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСтажа,ВыборкаПоДоговорам);
									СтрокаСтажа.Выплаты = 0;
									СтрокаСтажа.Взносы = 0;
									СтрокаСтажа.Пособия = 0;
									СтрокаСтажа.ТарифВзносов = 0;
									СтрокаСтажа.Месяц = ДатаНачДО; 
									СтрокаСтажа.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ОтпускБезСохраненияЗаработнойПлатыВСвязиСОбучениемПоСемейноБытовымИДругимУважительнымПричинам;
								КонецЕсли;					
								ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
							КонецЦикла;     							
						КонецЦикла;   					
						//О.Т. Аверсон 18.04.2019 № 4246
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		СведенияОВзносах.Свернуть("ФизЛицо,Месяц,Выплаты,Пособия,Взносы,ТарифВзносов,Сотрудник,Договор,Категория,ВидДоговора,ПричиныМинимальнойЗП");
		если ВсеСотрудники или Основные Тогда 
			ДатыОтпусковТекст = 
			//"ВЫБРАТЬ
			//|	Работники.ФизЛицо КАК ФизЛицо,
			//|	Работники.ДатаС КАК ДатаС,
			//|	Работники.Организация КАК Организация,
			//|	&Дети КАК ВидДеятельности,
			//|	Работники.ПериодЗавершения КАК ПериодЗавершения
			//|ПОМЕСТИТЬ ВТДатыОтпусков
			//|ИЗ
			//|	(ВЫБРАТЬ
			//|		СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
			//|		&НачалоГода КАК ДатаС,
			//|		СостояниеРаботниковОрганизацийСрезПоследних.Организация КАК Организация,
			//|		ДобавитьКДате(СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения, ДЕНЬ, -1) КАК ПериодЗавершения //О.Т. Аверсон 18.04.2019 № 4239 ДобКДате -1
			//|	ИЗ
			//|		РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(
			//|				&КонецПрошлогоГода,
			//|				Организация = &Организация
			//|				И НЕ Регистратор ССЫЛКА Документ.ОтсутствиеНаРаботеОрганизаций
			//|					И Сотрудник.ВидЗанятости <> &ВнСовместитель
			//|					И (ВЫБОР
			//|	КОГДА &ПоВсемФизЛицам
			//|		ТОГДА Сотрудник.Физлицо В (&СписокФизЛиц)
			//|	ИНАЧЕ
			//|		 Сотрудник.Физлицо = &ФизЛицо КОНЕЦ)) КАК СостояниеРаботниковОрганизацийСрезПоследних
			//|	ГДЕ
			//|		СостояниеРаботниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
			//|		И СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения >= &НачалоГода или СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения = ДатаВремя(1,1,1) ";

			"ВЫБРАТЬ
			|	Работники.ФизЛицо КАК ФизЛицо,
			|	Работники.ДатаС КАК ДатаС,
			|	Работники.Организация КАК Организация,
			|	&Дети КАК ВидДеятельности,
			|	Работники.ПериодЗавершения КАК ПериодЗавершения
			|ПОМЕСТИТЬ ВТДатыОтпусков
			|ИЗ
			|	(ВЫБРАТЬ
			|	ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.Физлицо как Физлицо,
			|	Выбор когда ПлановыеНачисленияРаботниковОрганизаций.Период < &НачалоГода тогда &НачалоГода иначе ПлановыеНачисленияРаботниковОрганизаций.Период конец как ДатаС,
			|	ПлановыеНачисленияРаботниковОрганизаций.Организация,
			|	ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения
			|ИЗ
			|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
			|ГДЕ

			|ВЫБОР
			|			КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &НачалоГода
			|					И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
			|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
			|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|	И ВЫБОР
			|			КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= &НачалоГода
			|					И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА ВЫБОР
			|						КОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения = ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
			|							ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
			|						ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
			|					КОНЕЦ
			|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
			|		КОНЕЦ = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)
			
			
			|	И (ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения >= &НачалоГода
			|	ИЛИ ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1))
			|	И ПлановыеНачисленияРаботниковОрганизаций.Организация = &Организация
			|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.ВидЗанятости <> &ВнСовместитель
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|	И ВЫБОР
			|			КОГДА &ПоВсемФизЛицам
			|				ТОГДА ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.Физлицо В (&СписокФизЛиц)
			|				ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.Физлицо = &ФизЛицо
			|	КОНЕЦ
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|	И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|	И ПлановыеНачисленияРаботниковОрганизаций.Период <= &ПериодВзаиморасчетов) КАК Работники
			|;

			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Работники.Сотрудник,
			|	Работники.ФизЛицо КАК ФизЛицо,
			|	Работники.ДатаС КАК ДатаС,
			|	Работники.Организация КАК Организация,
			|	Работники.ВидДеятельности КАК ВидДеятельности,
			|	Работники.КодПоОКПДТР КАК КодПоОКПДТР
			|ПОМЕСТИТЬ ВТДатыДвижений
			|ИЗ
			|	(ВЫБРАТЬ
			|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
			|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
			|		&НачалоГода КАК ДатаС,
			|		РаботникиОрганизацийСрезПоследних.Организация КАК Организация,
			|		РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение КАК ВидДеятельности,
			|		РаботникиОрганизацийСрезПоследних.Должность.КодПоОКПДТР КАК КодПоОКПДТР
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|				&КонецПрошлогоГода,
			|				Организация = &Организация
			|				И Сотрудник.ВидЗанятости <> &ВнСовместитель
			//|					И НЕ ВидДеятельностиИзмерение.ИспользуетсяВПУ6
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|				И (ВЫБОР
			|					КОГДА &ПоВсемФизЛицам
			|						ТОГДА Сотрудник.Физлицо В (&СписокФизЛиц)
			|						ИНАЧЕ
			|							Сотрудник.Физлицо = &ФизЛицо КОНЕЦ) 
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|				И Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|				  											) КАК РаботникиОрганизацийСрезПоследних
			|	ГДЕ
			|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> &Увольнение
			|		И Выбор когда РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение = Значение(справочник.ОсобыеУсловияТруда.ПустаяСсылка) 
			|			тогда ЛОЖЬ иначе не РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение.ИспользуетсяВПУ6 конец //О.Т. Аверсон 22.02.2018 № 1633 условие на пустую ссылку
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		РаботникиОрганизаций.Сотрудник,
			|		РаботникиОрганизаций.Сотрудник.Физлицо,
			|		РаботникиОрганизаций.Период,
			|		РаботникиОрганизаций.Организация,
			|		РаботникиОрганизаций.ВидДеятельностиИзмерение,
			|		РаботникиОрганизаций.Должность.КодПоОКПДТР
			|	ИЗ
			|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
			|	ГДЕ
			|		РаботникиОрганизаций.Организация = &Организация
			|		И РаботникиОрганизаций.Период МЕЖДУ &НачалоГода И &КонецГода
			|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> &Увольнение
			|		И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> &ВнСовместитель
			|		И Выбор когда РаботникиОрганизаций.ВидДеятельностиИзмерение = Значение(справочник.ОсобыеУсловияТруда.ПустаяСсылка) 
			|			тогда ЛОЖЬ иначе не РаботникиОрганизаций.ВидДеятельностиИзмерение.ИспользуетсяВПУ6 конец //О.Т. Аверсон 22.02.2018 № 1633 условие на пустую ссылку
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|		И (ВЫБОР
			|			КОГДА &ПоВсемФизЛицам
			|				ТОГДА РаботникиОрганизаций.Сотрудник.Физлицо В (&СписокФизЛиц)
			|				ИНАЧЕ
			|					РаботникиОрганизаций.Сотрудник.Физлицо = &ФизЛицо КОНЕЦ)
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|			И РаботникиОрганизаций.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|	) КАК Работники
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДатыНазначений1.ВидДеятельности КАК ВидДеятельности,
			|	ДатыНазначений1.ФизЛицо КАК ФизЛицо,
			|	ДатыНазначений1.ФизЛицо.СтатусКатегория КАК Категория,
			|	ДатыНазначений1.ДатаС КАК ДатаНачалаРабот,
			|	Выбор когда ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.ПериодЗавершения), &КонецГода)> &ПериодВзаиморасчетов тогда &ПериодВзаиморасчетов иначе ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.ПериодЗавершения), &КонецГода) конец КАК ДатаОкончанияРабот,
			|	ДатыНазначений1.ФизЛицо.СтраховойНомерПФР КАК ЛичныйНомер,
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество,
			|	ДатыНазначений1.КодПоОКПДТР КАК КодПоОКПДТР,
			|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
			|	ДомашниеТелефоны.Поле3 КАК Телефоны,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ КАК Гражданство,
			|	ДатыНазначений1.ФизЛицо.Пол КАК ФизЛицоПол,
			|	ДатыНазначений1.ФизЛицо.ДатаРождения КАК ФизЛицоДатаРождения,
			|	ДатыНазначений1.ФизЛицо.СтраховойНомерПФР КАК ФизЛицоСтраховойНомерПФР,
			|	ДатыНазначений1.ФизЛицо.МестоРождения КАК ФизЛицоМестоРождения,
			|	ВложенныйЗапрос.ДокументОснование,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
			|ИЗ
			|	ВТДатыДвижений КАК ДатыНазначений1
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДатыНазначений2
			|		ПО (ДатыНазначений2.Сотрудник = ДатыНазначений1.Сотрудник)
			|			И (ДатыНазначений2.Организация = ДатыНазначений1.Организация)
			|			И (ДатыНазначений2.Период > ДатыНазначений1.ДатаС)
			|			И (ДатыНазначений2.Период < &КонецГода)
			|			И (ДатыНазначений2.Сотрудник.ВидЗанятости <> &ВнСовместитель)
			|			И (НЕ ДатыНазначений2.ВидДеятельностиИзмерение.ИспользуетсяВПУ6)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
			|		ПО ДатыНазначений1.Сотрудник.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
			|		ПО ДатыНазначений1.ФизЛицо = АдресаРегистрации.Объект
			|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
			|			И (АдресаРегистрации.Тип = &ТипАдрес)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
			|		ПО ДатыНазначений1.ФизЛицо = АдресаФактические.Объект
			|			И (АдресаФактические.Тип = &ТипАдрес)
			|			И (АдресаФактические.Вид = &ВидАдресаФактический)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
			|		ПО ДатыНазначений1.ФизЛицо = ДомашниеТелефоны.Объект
			|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
			|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			|		ПО ДатыНазначений1.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних КАК ГражданствоФизЛиц
			|		ПО ДатыНазначений1.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СУММА(ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН 
			|							ИЛИ ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
			|						ТОГДА ЕСНСведенияОДоходах.Результат
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК Пособия,
			// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. ) +
			|			СУММА(ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
			|						ТОГДА ЕСНСведенияОДоходах.Результат
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК Выплаты,
			// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. ) -
			//|			СУММА( ЕСНСведенияОДоходах.Результат ) КАК Выплаты,
			// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. )
			|			ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|			ВЫБОР
			|				КОГДА ВложенныйЗапрос.Флаг
			|					ТОГДА &ДоговораПодряда
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|			КОНЕЦ КАК Категория,
			|			ВложенныйЗапрос.Регистратор КАК ДокументОснование
			|		ИЗ
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|			РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|			РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
			|					ВЫБОР
			|						КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
			|							ТОГДА ЛОЖЬ
			|						ИНАЧЕ ИСТИНА
			|					КОНЕЦ КАК Флаг
			|				ИЗ
			|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|				ГДЕ
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом) КАК ВложенныйЗапрос
			|				ПО ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
			|					И (ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ ВложенныйЗапрос.Регистратор.ДатаНачала И ВложенныйЗапрос.Регистратор.ДатаОкончания)
			|		ГДЕ
			|			ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|			//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|			И (ВЫБОР
			|				КОГДА &ПоВсемФизЛицам
			|					ТОГДА ЕСНСведенияОДоходах.Физлицо В ( &СписокФизЛиц )
			|					ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|			   КОНЕЦ)
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|			И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561
			|			И ЕСНСведенияОДоходах.Организация = &Организация
			// - СВЭЙ КДЯ 22.07.19 СВФР-004561
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЕСНСведенияОДоходах.ФизЛицо,
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|			ВЫБОР
			|				КОГДА ВложенныйЗапрос.Флаг
			|					ТОГДА &ДоговораПодряда
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|			КОНЕЦ,
			|			ВложенныйЗапрос.Регистратор) КАК ВложенныйЗапрос
			|		ПО ДатыНазначений1.ФизЛицо = ВложенныйЗапрос.ФизЛицо
			|ГДЕ
			|	ДатыНазначений1.ДатаС <= &ПериодВзаиморасчетов
			|
			|СГРУППИРОВАТЬ ПО
			|	ДатыНазначений1.ВидДеятельности,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
			|	АдресаРегистрации.Поле1,
			|	ДатыНазначений1.ФизЛицо,
			|	ДатыНазначений1.ДатаС,
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество,
			|	ДатыНазначений1.КодПоОКПДТР,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ,
			|	ДомашниеТелефоны.Поле3,
			|	ДатыНазначений1.ФизЛицо.СтатусКатегория,
			|	ДатыНазначений1.ФизЛицо.СтраховойНомерПФР,
			|	ДатыНазначений1.ФизЛицо.Пол,
			|	ДатыНазначений1.ФизЛицо.ДатаРождения,
			|	ДатыНазначений1.ФизЛицо.МестоРождения,
			|	ВложенныйЗапрос.ДокументОснование,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
			|	ДатыНазначений1.ФизЛицо.СтраховойНомерПФР
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДатыОстпусков1.ВидДеятельности,
			|	ДатыОстпусков1.ФизЛицо,
			|	ДатыОстпусков1.ФизЛицо.СтатусКатегория,
			|	ДатыОстпусков1.ДатаС,
			|	ВЫБОР
			|		КОГДА ДатыОстпусков1.ПериодЗавершения > Выбор когда ЕСТЬNULL(МИНИМУМ(ДОБАВИТЬКДАТЕ(ДатыОстпусков2.ПериодЗавершения, СЕКУНДА, -1)), &КонецГода)> &ПериодВзаиморасчетов тогда &ПериодВзаиморасчетов иначе ЕСТЬNULL(МИНИМУМ(ДОБАВИТЬКДАТЕ(ДатыОстпусков2.ПериодЗавершения, СЕКУНДА, -1)), &КонецГода) конец
			|			ТОГДА Выбор когда ЕСТЬNULL(МИНИМУМ(ДОБАВИТЬКДАТЕ(ДатыОстпусков2.ПериодЗавершения, СЕКУНДА, -1)), &КонецГода)> &ПериодВзаиморасчетов тогда &ПериодВзаиморасчетов иначе ЕСТЬNULL(МИНИМУМ(ДОБАВИТЬКДАТЕ(ДатыОстпусков2.ПериодЗавершения, СЕКУНДА, -1)), &КонецГода) конец
			|		ИНАЧЕ ДатыОстпусков1.ПериодЗавершения
			|	КОНЕЦ,
			|	ДатыОстпусков1.ФизЛицо.СтраховойНомерПФР,
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество,
			|	NULL,
			|	АдресаРегистрации.Поле1,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
			|	ДомашниеТелефоны.Поле3,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ,
			|	ДатыОстпусков1.ФизЛицо.Пол,
			|	ДатыОстпусков1.ФизЛицо.ДатаРождения,
			|	ДатыОстпусков1.ФизЛицо.СтраховойНомерПФР,
			|	ДатыОстпусков1.ФизЛицо.МестоРождения,
			|	NULL,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
			|ИЗ
			|	ВТДатыОтпусков КАК ДатыОстпусков1
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ДатыОстпусков2
			|		ПО (ДатыОстпусков2.Организация = ДатыОстпусков1.Организация)
			|			И (Выбор  когда ДатыОстпусков2.Период< &НачалоГода тогда &НачалоГода иначе ДатыОстпусков2.Период конец >= ДатыОстпусков1.ДатаС)
			|			И (ДатыОстпусков2.Период <= &КонецГода)
			|			И (ДатыОстпусков2.ПериодЗавершения >= &НачалоГода)
			|			И (ДатыОстпусков2.Сотрудник.ВидЗанятости <> &ВнСовместитель)
			|			И ДатыОстпусков1.ФизЛицо = ДатыОстпусков2.Сотрудник.Физлицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
			|		ПО ДатыОстпусков1.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
			|		ПО ДатыОстпусков1.ФизЛицо = АдресаРегистрации.Объект
			|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
			|			И (АдресаРегистрации.Тип = &ТипАдрес)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
			|		ПО ДатыОстпусков1.ФизЛицо = АдресаФактические.Объект
			|			И (АдресаФактические.Тип = &ТипАдрес)
			|			И (АдресаФактические.Вид = &ВидАдресаФактический)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
			|		ПО ДатыОстпусков1.ФизЛицо = ДомашниеТелефоны.Объект
			|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
			|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
			|		ПО ДатыОстпусков1.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних КАК ГражданствоФизЛиц
			|		ПО ДатыОстпусков1.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СУММА(ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
			|						ТОГДА ЕСНСведенияОДоходах.Результат
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК Пособия,
			// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. ) +
			|			СУММА(ВЫБОР
			|					КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
			|						ТОГДА ЕСНСведенияОДоходах.Результат
			|					ИНАЧЕ 0
			|				КОНЕЦ) КАК Выплаты,
			// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. ) -
			//|			СУММА( ЕСНСведенияОДоходах.Результат ) КАК Выплаты,
			// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 22. )
			|			ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|			ВЫБОР
			|				КОГДА ВложенныйЗапрос.Флаг
			|					ТОГДА &ДоговораПодряда
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|			КОНЕЦ КАК Категория,
			|			ВложенныйЗапрос.Регистратор КАК ДокументОснование
			|		ИЗ
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|			РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|			РегистрНакопления.ЕСНСведенияОДоходахПоСотрудникам КАК ЕСНСведенияОДоходах
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник.Физлицо КАК СотрудникФизлицо,
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка КАК Регистратор,
			|					ВЫБОР
			|						КОГДА ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор.Ссылка = &ПустойДоговор
			|							ТОГДА ЛОЖЬ
			|						ИНАЧЕ ИСТИНА
			|					КОНЕЦ КАК Флаг
			|				ИЗ
			|					РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
			|				ГДЕ
			|					ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.ДоговорНаВыполнениеРаботСФизЛицом) КАК ВложенныйЗапрос
			|				ПО ЕСНСведенияОДоходах.ФизЛицо = ВложенныйЗапрос.СотрудникФизлицо
			|					И (ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ ВложенныйЗапрос.Регистратор.ДатаНачала И ВложенныйЗапрос.Регистратор.ДатаОкончания)
			|		ГДЕ
			|			ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоГода И &КонецГода
			|			//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
			|			И (ВЫБОР
			|				КОГДА &ПоВсемФизЛицам
			|					ТОГДА ЕСНСведенияОДоходах.Физлицо В ( &СписокФизЛиц )
			|					ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
			|			   КОНЕЦ)
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
			//|			И ЕСНСведенияОДоходах.Сотрудник В ( &МассивСотрудников )
			// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561
			|			И ЕСНСведенияОДоходах.Организация = &Организация
			// - СВЭЙ КДЯ 22.07.19 СВФР-004561
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЕСНСведенияОДоходах.ФизЛицо,
			|			НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
			|			ВЫБОР
			|				КОГДА ВложенныйЗапрос.Флаг
			|					ТОГДА &ДоговораПодряда
			|				ИНАЧЕ ЕСНСведенияОДоходах.ФизЛицо.СтатусКатегория
			|			КОНЕЦ,
			|			ВложенныйЗапрос.Регистратор) КАК ВложенныйЗапрос
			|		ПО ДатыОстпусков1.ФизЛицо = ВложенныйЗапрос.ФизЛицо
			|ГДЕ
			|	ДатыОстпусков1.ДатаС <= &ПериодВзаиморасчетов
			|	И ДатыОстпусков2.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты)
			|
			|СГРУППИРОВАТЬ ПО
			|	АдресаРегистрации.Поле1,
			|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
			|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
			|	ДомашниеТелефоны.Поле3,
			|	ВЫБОР
			|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
			|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
			|			ТОГДА &СтранаПоУмолчанию
			|		ИНАЧЕ ГражданствоФизЛиц.Страна
			|	КОНЕЦ,
			|	ДатыОстпусков1.ВидДеятельности,
			|	ДатыОстпусков1.ФизЛицо,
			|	ДатыОстпусков1.ДатаС,
			|	ФИОФизЛицСрезПоследних.Фамилия,
			|	ФИОФизЛицСрезПоследних.Имя,
			|	ФИОФизЛицСрезПоследних.Отчество,
			|	ДатыОстпусков1.ФизЛицо.СтатусКатегория,
			|	ДатыОстпусков1.ФизЛицо.МестоРождения,
			|	ДатыОстпусков1.ФизЛицо.СтраховойНомерПФР,
			|	ДатыОстпусков1.ФизЛицо.ДатаРождения,
			|	ДатыОстпусков1.ФизЛицо.Пол,
			|	ДатыОстпусков1.ПериодЗавершения,
			|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
			|	ДатыОстпусков1.ФизЛицо.СтраховойНомерПФР
			|
			|УПОРЯДОЧИТЬ ПО
			|	ФизЛицо";
			//О.Т. Аверсон 04.03.2016 № 940
			Если ОтборПоПериодуВзаиморасчетов Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","");
			иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений","И ЕСНСведенияОДоходах.Период <= &ДатаПодачиСведений");
			КонецЕсли;
			//О.Т. Аверсон 04.03.2016 № 940
			если сч = 1 Тогда 
				ДатыОтпусковТекст = СтрЗаменить(ДатыОтпусковТекст,"ВТДатыДвижений","ВТДатыДвижений1");
				ДатыОтпусковТекст = СтрЗаменить(ДатыОтпусковТекст,"ВТДатыОтпусков","ВТДатыОтпусков1");
				
			КонецЕсли;
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ФизЛицо");
			СтруктураПоиска.Вставить("Категория");
			
			Запрос.Текст = ДатыОтпусковТекст;
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			//	СтруктураПоиска.Договор = Документы.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка();
			
			СтруктураПоиска1 = Новый Структура;
			СтруктураПоиска1.Вставить("ФизЛицо");
			СтруктураПоиска1.Вставить("Категория");	
			СтруктураПоиска1.Вставить("ВидДеятельности");	
			
			//О.Т. Аверсон 02.02.2017 № 244
			СтруктураПоискаВзносыВрем = Новый Структура;
			СтруктураПоискаВзносыВрем.Вставить("ФизЛицо");
			СтруктураПоискаВзносыВрем.Вставить("Категория");	
			СтруктураПоискаВзносыВрем.Вставить("ВидДеятельности");
			//О.Т. Аверсон 02.02.2017 № 244
			
			Пока Выборка.Следующий() Цикл
				если Выборка.НеИмеетПравоНаПенсию = истина Тогда 
					Продолжить;	
				КонецЕсли;
				СтруктураПоиска.ФизЛицо = Выборка.ФизЛицо;
				СтруктураПоиска.Категория = Выборка.Категория;
				//СтруктураПоиска.ВидДоговора  = Неопределено;
				НайденныеСтроки = РаботникиОрганизации.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					СтрокаРаботник = РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаРаботник,Выборка);
				КонецЕсли;
				//О.Т. Аверсон 02.02.2017 № 244
				СтруктураПоискаВзносыВрем.ФизЛицо = Выборка.ФизЛицо;
				СтруктураПоискаВзносыВрем.Категория = Выборка.Категория;
				СтруктураПоискаВзносыВрем.ВидДеятельности = ВзносыВрем;
				НайденныеСтрокиСтажа =  СведенияОСтаже.НайтиСтроки(СтруктураПоискаВзносыВрем);
				
				//О.Т. Аверсон 29.03.2019 № 4054
				МесяцПрошл = "";
				СведОСтажеПрошл = "";
				Для каждого СтрВзносыВрем Из НайденныеСтрокиСтажа Цикл
					если не МесяцПрошл = "" Тогда 
						Если МесяцПрошл >= СтрВзносыВрем.ДатаНачалаРабот и МесяцПрошл <= СтрВзносыВрем.ДатаОкончанияРабот	Тогда 
							СведОСтажеПрошл.ДатаОкончанияРабот = СтрВзносыВрем.ДатаНачалаРабот -1;
						КонецЕсли;          			
					КонецЕсли;
					МесяцПрошл = СтрВзносыВрем.ДатаОкончанияРабот;
					СведОСтажеПрошл = СтрВзносыВрем;
				КонецЦикла;
				//О.Т. Аверсон 29.03.2019 № 4054
				
				Для каждого СтрВзносыВрем Из НайденныеСтрокиСтажа Цикл
					Если Выборка.ДатаНачалаРабот	<= СтрВзносыВрем.ДатаНачалаРабот и Выборка.ДатаОкончанияРабот >= СтрВзносыВрем.ДатаОкончанияРабот Тогда 
						СтрВзносыВрем.ВидДеятельности = Премия;
						Дата1 = НачалоМесяца(СтрВзносыВрем.ДатаНачалаРабот);
						Дата2 = НачалоМесяца(СтрВзносыВрем.ДатаОкончанияРабот);
						сч1 = 1;
						Пока Дата1 <= Дата2 Цикл 
							Если не сч1 = 1 Тогда 
								СтрВзносыВрем1 = СведенияОСтаже.Добавить();
								ЗаполнитьЗначенияСвойств(СтрВзносыВрем1,СтрВзносыВрем);
								СтрВзносыВрем1.ДатаНачалаРабот = Дата1;
								
								СтрВзносыВрем1.ДатаОкончанияРабот = ?(НачалоМесяца(СтрВзносыВрем.ДатаОкончанияРабот) = Дата1,СтрВзносыВрем.ДатаОкончанияРабот,КонецМесяца(Дата1));
							КонецЕсли;
							
							Дата1 = ДобавитьМесяц(Дата1,1);
							сч1 = сч1+1;
						КонецЦикла;
						Если сч1>2 Тогда 
							СтрВзносыВрем.ДатаОкончанияРабот = КонецМесяца(СтрВзносыВрем.ДатаНачалаРабот);
						КонецЕсли; 					
					КонецЕсли;            				
				КонецЦикла;
				//О.Т. Аверсон 02.02.2017 № 244
				
				СтруктураПоиска1.ФизЛицо = Выборка.ФизЛицо;
				СтруктураПоиска1.Категория = Выборка.Категория;
				СтруктураПоиска1.ВидДеятельности = Выборка.ВидДеятельности;
				
				//О.Т. Аверсон 04.03.2019 № 4036
				ЗапросПрием.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Регистратор,
				|	РаботникиОрганизаций.Период КАК Период
				|ИЗ
				|	ВТПрием КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Физлицо = &Физлицо
				//+ СВЭЙ КДЯ 22.07.19 СВФР-004561 
				|УПОРЯДОЧИТЬ ПО
				|	Период	
				//- СВЭЙ КДЯ 22.07.19 СВФР-004561
				|";
				ТЗПриемУвольнениеСотрудника = Новый ТаблицаЗначений;
				ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаПриема");
				ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаУвольнения");
				
				ЗапросПрием.УстановитьПараметр("ПериодОкончания", КонецМесяца(ДатаОкончания));
				ЗапросПрием.УстановитьПараметр("ФизЛицо", Выборка.ФизЛицо);
				
				
				РезультПрием = ЗапросПрием.Выполнить().Выбрать();
				
				ДатаПриема = Дата(1,1,1);	
				Пока РезультПрием.Следующий() Цикл
					если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда 
						если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
							СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период;
						ИначеЕсли не СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
							СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период; 
						КонецЕсли; 
						если СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = ДатаОкончания;
						конецЕсли;
					КонецЕсли;
					если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда 
						если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
						КонецЕсли;
						СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = РезультПрием.Период-86400;
						
					КонецЕсли;
					
				КонецЦикла;
				ДатаПриема = Дата(1,1,1);
				ДатаУвольнения = ДатаОкончания;
				Для Каждого СтрДата из ТЗПриемУвольнениеСотрудника Цикл
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					//если СтрДата.ДатаПриема < ДатаНачала и СтрДата.ДатаУвольнения < ДатаНачала и СтрДата.ДатаУвольнения<>Дата(1,1,1) Тогда 
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					Если ЗначениеЗаполнено( СтрДата.ДатаПриема )
						 И ЗначениеЗаполнено( СтрДата.ДатаУвольнения )
						 И СтрДата.ДатаПриема < ДатаНачала 
						 И СтрДата.ДатаУвольнения < ДатаНачала Тогда
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
						Продолжить;
					КонецЕсли;
					Если не ЗначениеЗаполнено(ДатаПриема) Тогда 
						ДатаПриема = СтрДата.ДатаПриема;
					КонецЕсли;
					если СтрДата.ДатаУвольнения <>Дата(1,1,1) Тогда 
						ДатаУвольнения = СтрДата.ДатаУвольнения;
					КонецЕсли;
					
				КонецЦикла;
				
				НайденныеСтрокиСтажа =  СведенияОСтаже.НайтиСтроки(СтруктураПоиска1);
				
				Если НайденныеСтрокиСтажа.Количество() = 0 Тогда 
					
					СтрокаСтажа = СведенияОСтаже.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаСтажа,Выборка);
					СтрокаСтажа.ДатаОкончанияРабот = ?(СтрокаСтажа.ДатаОкончанияРабот>ДатаУвольнения,ДатаУвольнения,СтрокаСтажа.ДатаОкончанияРабот);
					СтрокаСтажа.ДатаНачалаРабот = ?(СтрокаСтажа.ДатаНачалаРабот<ДатаПриема,ДатаПриема,СтрокаСтажа.ДатаНачалаРабот);
					
					//О.Т. Аверсон 09.04.2019 № 4221
					ДатаНачДО = НачалоМесяца(СтрокаСтажа.ДатаНачалаРабот);
					ДатаКонДО = НачалоМесяца(СтрокаСтажа.ДатаОкончанияРабот);
					Пока  ДатаНачДО <= ДатаКонДО Цикл
						МассивСвОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",Выборка.ФизЛицо,ДатаНачДО)); 
						Если МассивСвОВзносах.Количество()=0 Тогда 
							СтрокаСтажа = СведенияОВзносах.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаСтажа,Выборка);
							СтрокаСтажа.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет;//О.Т. Аверсон 17.04.2019 № 4246
							
							СтрокаСтажа.Месяц = ДатаНачДО; 
						иначе
							РазмерМинЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаНачДО,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
							
							Если МассивСвОВзносах[0].Выплаты + МассивСвОВзносах[0].Пособия <= РазмерМинЗП Тогда 
								МассивСвОВзносах[0].ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет;//О.Т. Аверсон 17.04.2019 № 4246
							иначе
								МассивСвОВзносах[0].ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();	
							КонецЕсли;
						КонецЕсли;					
						ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
					КонецЦикла;  					
					//О.Т. Аверсон 09.04.2019 № 4221
				Иначе //О.Т. Аверсон 08.04.2019 № 4203
					ЗаписьЕстьВПериоде = Ложь;
					Для Каждого Стр из НайденныеСтрокиСтажа Цикл 
						Если (Выборка.ДатаНачалаРабот >= Стр.ДатаНачалаРабот и Выборка.ДатаНачалаРабот <= Стр.ДатаОкончанияРабот) или
							(Выборка.ДатаОкончанияРабот >= Стр.ДатаНачалаРабот и Выборка.ДатаОкончанияРабот <= Стр.ДатаОкончанияРабот) Тогда 
							
							//СтрокаСтажа.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет;//О.Т. Аверсон 17.04.2019 № 4246
							
							ЗаписьЕстьВПериоде = Истина;
						КонецЕсли;  						
					КонецЦикла;
					Если не ЗаписьЕстьВПериоде Тогда 
						СтрокаСтажа = СведенияОСтаже.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСтажа,Выборка);
						СтрокаСтажа.ДатаОкончанияРабот = ?(СтрокаСтажа.ДатаОкончанияРабот>ДатаУвольнения,ДатаУвольнения,СтрокаСтажа.ДатаОкончанияРабот);
						СтрокаСтажа.ДатаНачалаРабот = ?(СтрокаСтажа.ДатаНачалаРабот<ДатаПриема,ДатаПриема,СтрокаСтажа.ДатаНачалаРабот);
						
						//О.Т. Аверсон 09.04.2019 № 4221
						ДатаНачДО = НачалоМесяца(СтрокаСтажа.ДатаНачалаРабот);
						ДатаКонДО = НачалоМесяца(СтрокаСтажа.ДатаОкончанияРабот);
						Пока ДатаНачДО <= ДатаКонДО Цикл
							МассивСвОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",Выборка.ФизЛицо,ДатаНачДО)); 
							Если МассивСвОВзносах.Количество()=0 Тогда 
								СтрокаСтажа = СведенияОВзносах.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСтажа,Выборка);
								СтрокаСтажа.Месяц = ДатаНачДО; 
								СтрокаСтажа.ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет;//О.Т. Аверсон 17.04.2019 № 4246

							иначе
								РазмерМинЗП = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаНачДО,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.МинимальнаяЗарплатаРБ)).Размер;
								
								Если МассивСвОВзносах[0].Выплаты + МассивСвОВзносах[0].Пособия <= РазмерМинЗП Тогда 
									МассивСвОВзносах[0].ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПериодОтпускаПоУходуЗаРебенкомДоДостиженияИмВозраста3Лет;//О.Т. Аверсон 17.04.2019 № 4246
								иначе
									МассивСвОВзносах[0].ПричиныМинимальнойЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();	
								КонецЕсли;

							КонецЕсли;					
							ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
						КонецЦикла;  					
						//О.Т. Аверсон 09.04.2019 № 4221
					КонецЕсли;
					//О.Т. Аверсон 08.04.2019 № 4203
				КонецЕсли;				
				
				
				
			КонецЦикла;
			
		КонецЕсли;
		сч = сч+1;
	КонецЦикла;
	
	//О.Т. Аверсон 04.03.2019 № 4036
	
	//О.Т. Аверсон 14.05.2019 № 4328
	Если ФизПрошл <> "" Тогда
		Если сч1 <> 0 и ЗначениеЗаполнено(ДоговорПрошл1) и ДоговорПрошл1 <> 1 Тогда 
			ДатаНачДО = ДатаНачала;
			ДатаКонДО = ДатаОкончания;
			Пока ДатаНачДО <= ДатаКонДО Цикл
				
				
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				ЗапросДоговора = Новый Запрос;
				ЗапросДоговора.Текст = 
				"ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				|	ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо = &ФизЛицо
				|	И (&Месяц МЕЖДУ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ)
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ))
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
				
				ЗапросДоговора.УстановитьПараметр("Месяц", ДатаНачДО);
				ЗапросДоговора.УстановитьПараметр("ФизЛицо", ФизПрошл);
				
				ВыборкаДетальныеЗаписи = ЗапросДоговора.Выполнить().Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,Договор",ФизПрошл,ВыборкаДетальныеЗаписи.Ссылка));
					Если ЗначСведенияОСтаже.Количество()> 0 Тогда 
						ЗначениеЕсть = Ложь;
						Для Каждого стрСведенияОстаже из ЗначСведенияОСтаже Цикл 
							Если ((стрСведенияОстаже.ДатаНачалаРабот >= ВыборкаДетальныеЗаписи.ДатаНачала И стрСведенияОстаже.ДатаНачалаРабот <= ВыборкаДетальныеЗаписи.ДатаОкончания) или
								(ВыборкаДетальныеЗаписи.ДатаНачала >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаНачала <= стрСведенияОстаже.ДатаОкончанияРабот) или
								(ВыборкаДетальныеЗаписи.ДатаОкончания >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаОкончания <= стрСведенияОстаже.ДатаОкончанияРабот)) и
								(ДатаНачДО >= НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот) и ДатаНачДО <= КонецМесяца(стрСведенияОстаже.ДатаОкончанияРабот)) Тогда 
								Дата1 = НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот);
								Дата2 = НачалоМесяца(стрСведенияОстаже.ДатаОкончанияРабот);    
								ВзносыЕсть = Ложь; 
								Пока Дата1 <= Дата2 Цикл
									
									ПроверкаВзносов = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,Дата1)); 
									Если ПроверкаВзносов.Количество()>0 Тогда 
										ВзносыЕсть = ПроверкаВзносов[0].Выплаты >0;
										// + СВЭЙ КДЯ 22.07.19 СВФР-004561
										Если ВзносыЕсть Тогда
											Прервать;	
										КонецЕсли; 
										// - СВЭЙ КДЯ 22.07.19 СВФР-004561
									КонецЕсли;   																		
									Дата1 = ДобавитьМесяц(Дата1,1);
									
								КонецЦикла;
								Если не ВзносыЕсть Тогда 
									стрСведенияОстаже.ВидДеятельности = НеоплДог;
								КонецЕсли;   								
								ЗначениеЕсть = Истина;
							КонецЕсли;
						КонецЦикла;
						Если не ЗначениеЕсть Тогда  
							СтрокаСтажа = СведенияОСтаже.Добавить();
							СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
							СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
							
							//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							СтрокаСтажа.Категория = КатегорияПрошл;
							//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							
							СтрокаСтажа.ФизЛицо = ФизПрошл;
							СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
							СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
							СтрокаСтажа.ВидДеятельности = НеоплДог;
						КонецЕсли;
					иначе
						СтрокаСтажа = СведенияОСтаже.Добавить();
						СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						
						//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						СтрокаСтажа.Категория = КатегорияПрошл;
						//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						
						СтрокаСтажа.ФизЛицо = ФизПрошл;
						СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
						СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
						СтрокаСтажа.ВидДеятельности = НеоплДог;
					КонецЕсли;
					
					ЗначСведенияОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ФизПрошл,ДатаНачДО));
					если ЗначСведенияОВзносах.Количество()=0 Тогда   
						СтрокаВзносов = СведенияОВзносах.Добавить();
						СтрокаВзносов.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаВзносов.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						СтрокаВзносов.Категория = КатегорияПрошл;
						СтрокаВзносов.ФизЛицо = ФизПрошл;
						СтрокаВзносов.Месяц = ДатаНачДО;
					КонецЕсли;
					
				КонецЦикла;
				
				
				ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//О.Т. Аверсон 14.05.2019 № 4328
	
	//О.Т. Аверсон 16.05.2019 № 4328	
	Если ВсеСотрудники или ДогПодряда Тогда 
		Если ФизЛицо = Неопределено Тогда 
			ДобавлятьФизЛицо = Истина;
		иначе
			ЗначСведенияОРабОрг = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",ФизЛицо));
			ПроверкаВзносов = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо",ФизЛицо));
			ПроверкаОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо",ФизЛицо));
			Если ЗначСведенияОРабОрг.Количество()>0 и ПроверкаВзносов.Количество()=0 и ПроверкаОСтаже.Количество() = 0 Тогда
				ДобавлятьФизЛицо = Истина;
			иначе
				ДобавлятьФизЛицо = Ложь;
			КонецЕсли;			
		КонецЕсли;
		
		Если ДобавлятьФизЛицо Тогда 
			
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561
			ЭтоПерваяИтерация = Истина;
			// + СВЭЙ КДЯ 22.07.19 СВФР-004561

			ДатаНачДО = ДатаНачала;
			ДатаКонДО = ДатаОкончания;
			Пока ДатаНачДО <= ДатаКонДО Цикл
				
				
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				ЗапросДоговора = Новый Запрос;
				ЗапросДоговора.Текст = 
				"ВЫБРАТЬ
				|	ДоговорНаВыполнениеРаботСФизЛицом.Ссылка,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,
				|	ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо,
				|	&ДоговораПодряда как Категория
				|ИЗ
				|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
				|ГДЕ
				// + СВЭЙ КДЯ 22.07.19 СВФР-004561
				|	ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация";
				// - СВЭЙ КДЯ 22.07.19 СВФР-004561
				
				// + СВЭЙ КДЯ 22.07.19 СВФР-004561
				//Если Физлицо = Неопределено тогда 
				//	ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				//	|	НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (&СписокФизЛиц)";
				//иначе
				//	ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				//	|	ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В (&СписокФизЛиц)";
				//КонецЕсли;
				//ЗапросДоговора.УстановитьПараметр( "СписокФизЛиц", ?( ФизЛицо = Неопределено, РаботникиОрганизации.ВыгрузитьКолонку("ФизЛицо"), ФизЛицо ) );
				// - СВЭЙ КДЯ 22.07.19 СВФР-004561
				
				// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
				// + СВЭЙ КДЯ 22.07.19 СВФР-004561
				ЗапросДоговора.УстановитьПараметр( "СписокУжеЗаполненныхФизЛиц", РаботникиОрганизации.ВыгрузитьКолонку( "ФизЛицо" ) );
				Если Физлицо <> Неопределено тогда 
					ЗапросДоговора.УстановитьПараметр( "ФизЛицо", ФизЛицо );
					ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо = &ФизЛицо
					|	" + ?( ЭтоПерваяИтерация, "", "И НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &СписокУжеЗаполненныхФизЛиц )" );
				иначе
					ЗапросДоговора.УстановитьПараметр( "МассивФизическихЛиц", МассивФизическихЛиц );
					ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &МассивФизическихЛиц )
					|	И НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &СписокУжеЗаполненныхФизЛиц )";
				КонецЕсли;
				// - СВЭЙ КДЯ 22.07.19 СВФР-004561
				// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
				
				// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
				//// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
				//ЗапросДоговора.УстановитьПараметр( "СписокУжеЗаполненныхФизЛиц", РаботникиОрганизации.ВыгрузитьКолонку( "ФизЛицо" ) );
				//ЗапросДоговора.УстановитьПараметр( "МассивФизическихЛиц", МассивФизическихЛиц );
				//ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				//|	И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &МассивФизическихЛиц )
				//|	И НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &СписокУжеЗаполненныхФизЛиц )";
				//// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
				// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
				
				// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. ) -
				//ЗапросДоговора.УстановитьПараметр( "СписокУжеЗаполненныхФизЛиц", РаботникиОрганизации.ВыгрузитьКолонку( "ФизЛицо" ) );
				//ЗапросДоговора.УстановитьПараметр( "МассивСотрудников", МассивСотрудников );
				//ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				//|	И ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник В ( &МассивСотрудников )
				//|	И НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В ( &СписокУжеЗаполненныхФизЛиц )";
				// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
				
				ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				|	И (&Месяц МЕЖДУ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ)
				|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания МЕЖДУ НАЧАЛОПЕРИОДА(&Месяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Месяц, МЕСЯЦ))
				|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен";
				
				Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
					ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации В ИЕРАРХИИ (&МассивПодразделений)";
					МассивПодразделений = Новый Массив();
					МассивПодразделений.Добавить(ПодразделениеОрганизации);
					ЗапросДоговора.УстановитьПараметр("МассивПодразделений", МассивПодразделений); 					  
				КонецЕсли;
				
				
				// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
				ЗапросДоговора.Текст = ЗапросДоговора.Текст + "	
				|УПОРЯДОЧИТЬ ПО 
				|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование, 
				|	ВЫБОР КОГДА ДоговорНаВыполнениеРаботСФизЛицом.ДатаПУ <> ДАТАВРЕМЯ( 1, 1, 1 ) 
				|			ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.ДатаПУ
				|			ИНАЧЕ ДоговорНаВыполнениеРаботСФизЛицом.Дата
				|	КОНЕЦ 
				|";
				// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 22. )
				
				ЗапросДоговора.УстановитьПараметр( "Месяц", ДатаНачДО );
				ЗапросДоговора.УстановитьПараметр( "ДоговораПодряда" , Справочники.КатегорииЗастрахованныхЛиц.НайтиПоРеквизиту("КодПФР","03") );
				
				
				// + СВЭЙ КДЯ 22.07.19 СВФР-004561
				ЗапросДоговора.УстановитьПараметр( "Организация", ЭтотОбъект.Организация );
				// - СВЭЙ КДЯ 22.07.19 СВФР-004561
				
				ВыборкаДетальныеЗаписи = ЗапросДоговора.Выполнить().Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,Договор",ВыборкаДетальныеЗаписи.ФизЛицо,ВыборкаДетальныеЗаписи.Ссылка));
					Если ЗначСведенияОСтаже.Количество()> 0 Тогда 
						ЗначениеЕсть = Ложь;
						Для Каждого стрСведенияОстаже из ЗначСведенияОСтаже Цикл 
							Если ((стрСведенияОстаже.ДатаНачалаРабот >= ВыборкаДетальныеЗаписи.ДатаНачала И стрСведенияОстаже.ДатаНачалаРабот <= ВыборкаДетальныеЗаписи.ДатаОкончания) или
								(ВыборкаДетальныеЗаписи.ДатаНачала >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаНачала <= стрСведенияОстаже.ДатаОкончанияРабот) или
								(ВыборкаДетальныеЗаписи.ДатаОкончания >= стрСведенияОстаже.ДатаНачалаРабот И ВыборкаДетальныеЗаписи.ДатаОкончания <= стрСведенияОстаже.ДатаОкончанияРабот)) и
								(ДатаНачДО >= НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот) и ДатаНачДО <= КонецМесяца(стрСведенияОстаже.ДатаОкончанияРабот)) Тогда 
								Дата1 = НачалоМесяца(стрСведенияОстаже.ДатаНачалаРабот);
								Дата2 = НачалоМесяца(стрСведенияОстаже.ДатаОкончанияРабот);    
								ВзносыЕсть = Ложь; 
								Пока Дата1 <= Дата2 Цикл
									
									ПроверкаВзносов = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаДетальныеЗаписи.ФизЛицо,Дата1)); 
									Если ПроверкаВзносов.Количество()>0 Тогда 
										ВзносыЕсть = ПроверкаВзносов[0].Выплаты >0;
										// + СВЭЙ КДЯ 22.07.19 СВФР-004561
										Если ВзносыЕсть Тогда
											Прервать;	
										КонецЕсли; 
										// - СВЭЙ КДЯ 22.07.19 СВФР-004561
									КонецЕсли;   																		
									Дата1 = ДобавитьМесяц(Дата1,1);
									
								КонецЦикла;
								Если не ВзносыЕсть Тогда 
									стрСведенияОстаже.ВидДеятельности = НеоплДог;
								КонецЕсли;   								
								ЗначениеЕсть = Истина;
							КонецЕсли;
						КонецЦикла;
						Если не ЗначениеЕсть Тогда  
							СтрокаСтажа = СведенияОСтаже.Добавить();
							СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
							СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
							
							//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							СтрокаСтажа.Категория = ВыборкаДетальныеЗаписи.Категория;
							//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
							
							СтрокаСтажа.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
							СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
							СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
							СтрокаСтажа.ВидДеятельности = НеоплДог;
						КонецЕсли;
					иначе
						СтрокаСтажа = СведенияОСтаже.Добавить();
						СтрокаСтажа.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаСтажа.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						
						//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						СтрокаСтажа.Категория = ВыборкаДетальныеЗаписи.Категория;
						//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
						
						СтрокаСтажа.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
						СтрокаСтажа.ДатаНачалаРабот = Макс(ВыборкаДетальныеЗаписи.ДатаНачала,ДатаНачДО);
						СтрокаСтажа.ДатаОкончанияРабот = Мин(ВыборкаДетальныеЗаписи.ДатаОкончания,КонецМесяца(ДатаНачДО));  													
						СтрокаСтажа.ВидДеятельности = НеоплДог;
					КонецЕсли; // ЗначСведенияОСтаже.Количество()> 0
					
					ЗначСведенияОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаДетальныеЗаписи.ФизЛицо,ДатаНачДО));
					если ЗначСведенияОВзносах.Количество()=0 Тогда   
						СтрокаВзносов = СведенияОВзносах.Добавить();
						СтрокаВзносов.Договор = ВыборкаДетальныеЗаписи.Ссылка;
						СтрокаВзносов.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						СтрокаВзносов.Категория = ВыборкаДетальныеЗаписи.Категория;
						СтрокаВзносов.ФизЛицо = ВыборкаДетальныеЗаписи.ФизЛицо;
						СтрокаВзносов.Месяц = ДатаНачДО;
					КонецЕсли;
					
					ЗначСведенияОВзносах = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаДетальныеЗаписи.ФизЛицо));
					если ЗначСведенияОВзносах.Количество()=0 Тогда 
						
						
						ЗапросРабОрг = Новый Запрос;
						ЗапросРабОрг.Текст = 
						"ВЫБРАТЬ
						|	ВТФСЗНДоходы.Ссылка КАК Сотрудник,
						|	ВТФСЗНДоходы.Физлицо КАК ФизЛицо,
						|	ВТФСЗНДоходы.Физлицо.СтраховойНомерПФР КАК ЛичныйНомер,
						|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
						|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
						|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
						|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
						|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
						|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
						|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
						|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
						|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
						|	ДомашниеТелефоны.Поле3 КАК Телефоны,
						|	ВЫБОР
						|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL
						|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
						|			ТОГДА &СтранаПоУмолчанию
						|		ИНАЧЕ ГражданствоФизЛиц.Страна
						|	КОНЕЦ КАК Гражданство,
						|	ВТФСЗНДоходы.Физлицо.Пол КАК Пол,
						|	ВТФСЗНДоходы.Физлицо.ДатаРождения КАК ДатаРождения,
						|	ВТФСЗНДоходы.Физлицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
						|	ВТФСЗНДоходы.Физлицо.МестоРождения КАК МестоРождения,
						|	&ДоговораПодряда как Категория,
						|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
						|ИЗ
						|	Справочник.СотрудникиОрганизаций КАК ВТФСЗНДоходы
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&КонецГода, ) КАК ФИОФизЛицСрезПоследних
						|		ПО ВТФСЗНДоходы.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
						|		ПО ВТФСЗНДоходы.Физлицо = АдресаРегистрации.Объект
						|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
						|			И (АдресаРегистрации.Тип = &ТипАдрес)
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
						|		ПО ВТФСЗНДоходы.Физлицо = АдресаФактические.Объект
						|			И (АдресаФактические.Тип = &ТипАдрес)
						|			И (АдресаФактические.Вид = &ВидАдресаФактический)
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
						|		ПО ВТФСЗНДоходы.Физлицо = ДомашниеТелефоны.Объект
						|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
						|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
						|		ПО ВТФСЗНДоходы.Физлицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаПодачиСведений, ) КАК ГражданствоФизЛиц
						|		ПО ВТФСЗНДоходы.Физлицо = ГражданствоФизЛиц.ФизЛицо
						|ГДЕ
						|	ВТФСЗНДоходы.Физлицо = &Физлицо
						// + СВЭЙ КДЯ 22.07.19 СВФР-004561
						|	И ВТФСЗНДоходы.Организация = &Организация
						// + СВЭЙ КДЯ 09.09.19 СВФР-004631 ( Пункт 18. )
						//|	И НЕ ВТФСЗНДоходы.ПометкаУдаления
						//|	И ВТФСЗНДоходы.Актуальность
						// - СВЭЙ КДЯ 09.09.19 СВФР-004631 ( Пункт 18. )
						// - СВЭЙ КДЯ 22.07.19 СВФР-004561
						|";
						
						ЗапросРабОрг.УстановитьПараметр("ВидАдресаРегистрации" , 	Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
						ЗапросРабОрг.УстановитьПараметр("ВидАдресаФактический" , 	Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
						ЗапросРабОрг.УстановитьПараметр("ВидТелефонаДомашний" , 	Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
						ЗапросРабОрг.УстановитьПараметр("ТипТелефон" , 	Перечисления.ТипыКонтактнойИнформации.Телефон);
						ЗапросРабОрг.УстановитьПараметр("ТипАдрес" , 	Перечисления.ТипыКонтактнойИнформации.Адрес);
						ЗапросРабОрг.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
						ЗапросРабОрг.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.НайтиПоКоду("112"));
						ЗапросРабОрг.УстановитьПараметр("ДоговораПодряда" , Справочники.КатегорииЗастрахованныхЛиц.НайтиПоРеквизиту("КодПФР","03"));
						ЗапросРабОрг.УстановитьПараметр("ДатаПодачиСведений", ДатаОкончания);
						ЗапросРабОрг.УстановитьПараметр("КонецГода", КонецГода(ДатаОкончания));
						ЗапросРабОрг.УстановитьПараметр("Физлицо", ВыборкаДетальныеЗаписи.Физлицо);
						// + СВЭЙ КДЯ 22.07.19 СВФР-004561
						ЗапросРабОрг.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
						// - СВЭЙ КДЯ 22.07.19 СВФР-004561
						
						
						РезРабОрг = ЗапросРабОрг.Выполнить().Выбрать();
						
						Пока РезРабОрг.Следующий() Цикл
							СтрокаРабОрг = РаботникиОрганизации.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаРабОрг,РезРабОрг);
							СтрокаРабОрг.ВидДоговора = ВыборкаДетальныеЗаписи.Ссылка.Сотрудник.ВидДоговора;
						КонецЦикла;
						
					иначе
						ЗначСведенияОРабОрг = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаДетальныеЗаписи.ФизЛицо));
						Для Каждого стрСв из ЗначСведенияОРабОрг Цикл 
							стрСв.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
							стрСв.ВидДоговора1 = Перечисления.ВидыДоговоровСФизЛицами.Подряда;
						КонецЦикла;	
					КонецЕсли;
					
					// + СВЭЙ КДЯ 22.07.19 СВФР-004561
					ЭтоПерваяИтерация = Ложь;
					// + СВЭЙ КДЯ 22.07.19 СВФР-004561
					
				КонецЦикла; // ВыборкаДетальныеЗаписи.Следующий()
				
				ДатаНачДО = ДобавитьМесяц(ДатаНачДО,1);
			КонецЦикла; // ДатаНачДО <= ДатаКонДО
		КонецЕсли;
	КонецЕсли;
	//О.Т. Аверсон 16.05.2019 № 4328

	
	ЗапросПрочиеПричины = Новый Запрос;
	ЗапросПрочиеПричины.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеПричиныМинимальнойЗаработнойПлаты.Период,
	|	ПрочиеПричиныМинимальнойЗаработнойПлаты.Сотрудник,
	|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ФизЛицо,
	|	ПрочиеПричиныМинимальнойЗаработнойПлаты.ПричиныМинимальнойЗаработнойПлаты
	|ИЗ
	|	РегистрСведений.ПрочиеПричиныМинимальнойЗаработнойПлаты КАК ПрочиеПричиныМинимальнойЗаработнойПлаты
	|ГДЕ
	|	ПрочиеПричиныМинимальнойЗаработнойПлаты.Период МЕЖДУ &Период И &Период1
	// + СВЭЙ КДЯ 22.07.19 СВФР-004561
	|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Организация = &Организация
	// - СВЭЙ КДЯ 22.07.19 СВФР-004561
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
	|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.ФизЛицо В ( &СписокФизЛиц )
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
	//|	И ПрочиеПричиныМинимальнойЗаработнойПлаты.Сотрудник В ( &МассивСотрудников )
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )
	|";
	
	// + СВЭЙ КДЯ 22.07.19 СВФР-004561
	ЗапросПрочиеПричины.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	// - СВЭЙ КДЯ 22.07.19 СВФР-004561
	ЗапросПрочиеПричины.УстановитьПараметр("Период", НачалоМесяца(ДатаНачала));
	ЗапросПрочиеПричины.УстановитьПараметр("Период1", КонецМесяца(ДатаОкончания));
	
	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) +
	Если ФизЛицо = Неопределено Тогда
		ЗапросПрочиеПричины.УстановитьПараметр("СписокФизЛиц", МассивФизическихЛиц);
	иначе
		ЗапросПрочиеПричины.УстановитьПараметр("СписокФизЛиц", ФизЛицо);
	КонецЕсли;
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )

	// + СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. ) -
	//ЗапросПрочиеПричины.УстановитьПараметр( "МассивСотрудников", МассивСотрудников );
	// - СВЭЙ КДЯ 11.09.19 СВФР-004631 ( пункт 22. )

	
	РезПрочиеПричины = ЗапросПрочиеПричины.Выполнить().Выбрать();
	ПрочаяПричина = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
	Пока РезПрочиеПричины.Следующий() Цикл
		ПрочаяПричина = РезПрочиеПричины.ПричиныМинимальнойЗаработнойПлаты;
		
		МассивСвОВзносах = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",РезПрочиеПричины.ФизЛицо,РезПрочиеПричины.Период)); 
		Если МассивСвОВзносах.Количество() = 0 Тогда 
			СтрокаСтажа = СведенияОВзносах.Добавить();
			ЗначениеРабОрг = РаботникиОрганизации.НайтиСтроки(Новый Структура("ФизЛицо",РезПрочиеПричины.ФизЛицо));
			Если ЗначениеРабОрг.Количество() > 0 Тогда // СВЭЙ  КДЯ 23.07.19 СВФР-004561
				ЗаполнитьЗначенияСвойств(СтрокаСтажа,ЗначениеРабОрг[0]);
			КонецЕсли; // СВЭЙ  КДЯ 23.07.19 СВФР-004561
			СтрокаСтажа.Сотрудник = РезПрочиеПричины.Сотрудник;
			СтрокаСтажа.ФизЛицо = РезПрочиеПричины.ФизЛицо;
			СтрокаСтажа.Выплаты = 0;
			СтрокаСтажа.Взносы = 0;
			СтрокаСтажа.Пособия = 0;
			СтрокаСтажа.ТарифВзносов = 0;
			СтрокаСтажа.Месяц = РезПрочиеПричины.Период; 
			СтрокаСтажа.ПричиныМинимальнойЗП = ПрочаяПричина;
		КонецЕсли;
		
	КонецЦикла;		
	
	
	
	//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
	//если ФизЛицо = Неопределено Тогда 
	//	РаботникиОрганизации.Сортировать( "ФизЛицо" );
	//КонецЕсли;
	//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
	//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
	если ФизЛицо = Неопределено Тогда 
		РаботникиОрганизации.Сортировать( "Фамилия, Имя, Отчество" );
	КонецЕсли;
	//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
	
	//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
	//Для Каждого стр из РаботникиОрганизации Цикл 
	//	Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(стр.ФизЛицо.Наименование);
	//	стр.ВидДоговора1 = Сотрудник.ВидДоговора;
	//КонецЦикла;
	//- СВЭЙ КДЯ 22.10.19 СВФР-004948
	
	//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
	МасЗаполненныхФизЛиц = Новый Массив;
	Для Каждого Стр из РаботникиОрганизации Цикл
		Если ЗначениеЗаполнено( Стр.ВидДоговора ) ИЛИ МасЗаполненныхФизЛиц.Найти( Стр.ФизЛицо ) <> Неопределено  Тогда
			Продолжить;
		Иначе	
			МасЗаполненныхФизЛиц.Добавить( Стр.ФизЛицо );
		КонецЕсли; 
		НайдСтроки = СведенияОСтаже.НайтиСтроки( Новый Структура( "ФизЛицо", Стр.ФизЛицо ) );
		ТЗ_СведенияОСтажеФизЛица = СведенияОСтаже.Выгрузить( НайдСтроки );
		ТЗ_СведенияОСтажеФизЛица.Свернуть( "ВидДоговора" );
		ЭтоПервыйВид = Истина;
		Для каждого СтрВидДоговора Из ТЗ_СведенияОСтажеФизЛица Цикл
			Если ЭтоПервыйВид Тогда
				ЭтоПервыйВид = Ложь;
				НовСтр = Стр;
			Иначе
				НовСтр = РаботникиОрганизации.Добавить();
				ЗаполнитьЗначенияСвойств( НовСтр, Стр );
			КонецЕсли;
			НовСтр.ВидДоговора = СтрВидДоговора.ВидДоговора;
			НовСтр.ВидДоговора1 = НовСтр.ВидДоговора;
		КонецЦикла;
	КонецЦикла;
	//- СВЭЙ КДЯ 22.10.19 СВФР-004948
	
	СведенияОВзносах.Свернуть("ФизЛицо,Месяц,ТарифВзносов,Сотрудник,Договор,Категория,ВидДоговора,ПричиныМинимальнойЗП","Выплаты,Пособия,Взносы "); //О.Т. Аверсон 14.03.2019 № 4054 3п.
	
	//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	//УстановитьВидДеятельностиНеоплДог( Договор, ВзносыВрем, НеоплДог );
	МасОбъединяемыеВидыДеятельности = Новый Массив( 1 );
	МасОбъединяемыеВидыДеятельности[0] = НеоплДог;
	ОбъединитьХронологическиеЦепочкиСведенийОСтаже( МасОбъединяемыеВидыДеятельности );
	//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	
	//+ СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 4 )
	СтрокиНеоплДог = СведенияОСтаже.НайтиСтроки( Новый Структура( "ВидДеятельности", НеоплДог ) );
	СтрокиДоговор = СведенияОСтаже.НайтиСтроки( Новый Структура( "ВидДеятельности", Договор ) );
	СвернутьСтрокиДоговоровДублей( СтрокиНеоплДог, СтрокиДоговор, Договор );
	//- СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 4 )
	СведенияОСтаже.Сортировать( "ФизЛицо, ДатаНачалаРабот, ВидДеятельности" );
	
	//+ СВЭЙ КДЯ 16.08.19 СВФР-004631 ( пункт 5 )
	//удаляем строки - дубли
	СвернутьТабличнуюЧасть( "РаботникиОрганизации" );
	СвернутьТабличнуюЧасть( "СведенияОСтаже" );
	//- СВЭЙ КДЯ 16.08.19 СВФР-004631 ( пункт 5 )
	
	//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
	УстановитьВидДеятельностиНеоплДог( Договор, ВзносыВрем, НеоплДог );
	////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
	//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	
	//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
	//удаляем строки, которым соответствуют поддиапазоны других строк, т.е. образующие подмножества
	УдалитьВключаемыеСтрокиСведенийОСтаже();
	//склеиваем строки, образуюшие хронологические цепочки
	//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
	МасОбъединяемыеВидыДеятельности = Новый Массив( 3 );
	МасОбъединяемыеВидыДеятельности[0] = Договор;
	МасОбъединяемыеВидыДеятельности[1] = ВзносыВрем;
	МасОбъединяемыеВидыДеятельности[2] = НеоплДог;
	
	//+ СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
	//Новый формат Пачки ПУ-3 требует следующее:
	//1) Период по виду деятельности ПОСОБИЕ должен  входить в период вида деятельности ДОГОВОР
	//2) Период вида деятельности "ПОСОБИЕ" должен соответствовать месяцу, в котором сумма пособий по временной нетрудоспособности больше нуля
	//МасОбъединяемыеВидыДеятельности[3] = Пособие;
	//- СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
	
	//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
	ОбъединитьХронологическиеЦепочкиСведенийОСтаже(
				//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
				МасОбъединяемыеВидыДеятельности 
				//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
				);
	//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
	
	//+ СВЭЙ КДЯ 26.08.19 СВФР-004631 ( пункт 7 )
	СтрокиДети = СведенияОСтаже.НайтиСтроки( Новый Структура( "ВидДеятельности", Дети ) );
	СтрокиВзносыВрем = СведенияОСтаже.НайтиСтроки( Новый Структура( "ВидДеятельности", ВзносыВрем ) );
	УстановитьПремиюВСтажеДети( СтрокиДети, СтрокиВзносыВрем, Премия );
	//- СВЭЙ КДЯ 26.08.19 СВФР-004631 ( пункт 7 )
	
	//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
	ЗаполнитьДатыДоговоров_И_ВзносовВрем( Договор, ВзносыВрем );
	//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
	
	//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	СведенияОВзносах.Сортировать( "ФизЛицо, Месяц, Договор" );
	//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	
КонецФункции


//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
Процедура ЗаполнитьДатыДоговоров_И_ВзносовВрем( Договор, ВзносыВрем )
	Если НЕ ЗначениеЗаполнено( ЭтотОбъект.ДатаНачала ) ИЛИ НЕ ЗначениеЗаполнено( ЭтотОбъект.ДатаОкончания ) Тогда
		Сообщить( "Не заполнены поля ""Период С: ... по:"" !", СтатусСообщения.Важное );
		Возврат;
	КонецЕсли;	
	Если ЭтотОбъект.ДатаНачала > ЭтотОбъект.ДатаОкончания  Тогда
		Сообщить( "Некорректно заполнены поля ""Период С: ... по:"" - дата ПО больше даты С!", СтатусСообщения.Важное );
		Возврат;
	КонецЕсли;	
	
	КолонкиОтборов = "ВидДеятельности, Договор, ФизЛицо";
	ОтборДоговор = Новый Структура( КолонкиОтборов, Договор );
	ОтборВзносыВрем = Новый Структура( КолонкиОтборов, ВзносыВрем );
	СтрокиДоговор = СведенияОСтаже.НайтиСтроки( Новый Структура( "ВидДеятельности", Договор ) );
	Для каждого СтрокаДоговор Из СтрокиДоговор Цикл
		
		Если СтрокаДоговор.ДатаОкончанияРабот < ЭтотОбъект.ДатаНачала Тогда
			Продолжить;	
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств( ОтборДоговор, СтрокаДоговор, "Договор, ФизЛицо" );
		ВсеСтрокиДоговор =  СведенияОСтаже.НайтиСтроки( ОтборДоговор );
		Если ВсеСтрокиДоговор.Количество() > 1 Тогда
			
			ЭтоМаксимальнаяСтрокаДоговор = Истина;
			Для каждого ДругаяСтрокаДоговор Из ВсеСтрокиДоговор Цикл
				Если ДругаяСтрокаДоговор = СтрокаДоговор Тогда
					Продолжить;	
				КонецЕсли; 
				Если ДругаяСтрокаДоговор.ДатаОкончанияРабот > СтрокаДоговор.ДатаОкончанияРабот Тогда
					ЭтоМаксимальнаяСтрокаДоговор = Ложь;
					Прервать;	
				КонецЕсли; 
			КонецЦикла;
			Если НЕ ЭтоМаксимальнаяСтрокаДоговор Тогда
			
				Продолжить;	
			
			КонецЕсли; 
			
		КонецЕсли;
	
		СтрокаДоговор.ДатаОкончанияРабот = Мин( ЭтотОбъект.ДатаОкончания, СтрокаДоговор.ДатаОкончанияРабот );	
		ЗаполнитьЗначенияСвойств( ОтборВзносыВрем, СтрокаДоговор, "Договор, ФизЛицо" );
		СтрокиВзносыВремТекущегоДоговора = СведенияОСтаже.НайтиСтроки( ОтборВзносыВрем );
		МаксСтрокаВзносыВрем = Неопределено;
		МаксДатаОкончанияРаботВзносыВрем = Дата(1,1,1);
		Для каждого СтрокаВзносыВрем Из СтрокиВзносыВремТекущегоДоговора Цикл
		
			Если МаксСтрокаВзносыВрем = Неопределено
				 ИЛИ СтрокаВзносыВрем.ДатаОкончанияРабот > МаксДатаОкончанияРаботВзносыВрем Тогда
				 
				МаксСтрокаВзносыВрем = СтрокаВзносыВрем; 
				МаксДатаОкончанияРаботВзносыВрем = СтрокаВзносыВрем.ДатаОкончанияРабот;	
			
			КонецЕсли; 		
		
		КонецЦикла; // СтрокаВзносыВрем Из СтрокиВзносыВремТекущегоДоговора
		
		Если МаксСтрокаВзносыВрем <> Неопределено 
				И МаксСтрокаВзносыВрем.ДатаОкончанияРабот <> СтрокаДоговор.ДатаОкончанияРабот Тогда
		
			МаксСтрокаВзносыВрем.ДатаОкончанияРабот = СтрокаДоговор.ДатаОкончанияРабот;	
		
		КонецЕсли; 
		
	КонецЦикла; 
КонецПроцедуры // ЗаполнитьДатыДоговоров_И_ВзносовВрем
//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )


//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
Процедура УстановитьВидДеятельностиНеоплДог( Договор, ВзносыВрем, НеоплДог )
	
	//НулевыеСтрокиВзносов = СведенияОВзносах.НайтиСтроки( 
	//	Новый Структура( "Выплаты, Взносы, Пособия", 0, 0, 0 ) );
	//Для каждого НулеваяСтрокаВзносов Из НулевыеСтрокиВзносов Цикл
	//
	//	СведенияОВзносах.Удалить( НулеваяСтрокаВзносов );	
	//
	//КонецЦикла;
	
	СтрокиДоговоров = СведенияОСтаже.НайтиСтроки( 
		Новый Структура( "ВидДеятельности", Договор ) );
		
	Для каждого СтрокаДоговора Из СтрокиДоговоров Цикл
			
	    СтрокиВзносов = СведенияОВзносах.НайтиСтроки( Новый Структура( "ФизЛицо", СтрокаДоговора.ФизЛицо ) );
		ЕстьВзносы = Ложь;
		НомерДоговора = ПолучитьНомерДокументаДляПУ( СтрокаДоговора.Договор );
		ДатаДоговора = ПолучитьДатуДокументаДляПУ( СтрокаДоговора.Договор );
		Для каждого СтрокаВзносов Из СтрокиВзносов Цикл
		
			Если ( ПолучитьНомерДокументаДляПУ( СтрокаВзносов.Договор )
				 = НомерДоговора
				 И
				  ПолучитьДатуДокументаДляПУ( СтрокаВзносов.Договор )
				 = ДатаДоговора
				 //+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
				 ИЛИ
				  ПолучитьПересечениеДиапазонов( НачалоМесяца(СтрокаВзносов.Месяц), КонецМесяца(СтрокаВзносов.Месяц ), 
				  	СтрокаДоговора.ДатаНачалаРабот, СтрокаДоговора.ДатаОкончанияРабот ) <> Неопределено 
				 //- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
				 )
				 И СтрокаВзносов.Выплаты > 0
				Тогда
			
				ЕстьВзносы = Истина;
				Прервать;
			
			КонецЕсли; 	
		
		КонецЦикла;
		
		Если НЕ ЕстьВзносы Тогда
			СтрокаДоговора.ВидДеятельности = НеоплДог;
			СтрокаДоговора.ДатаНачалаРабот = ЭтотОбъект.ДатаНачала;
		    СтрокаДоговора.ДатаОкончанияРабот = ЭтотОбъект.ДатаОкончания;
			СтрокиВзносыВремТекДоговора = СведенияОСтаже.НайтиСтроки( 
				Новый Структура( "Договор, ВидДеятельности", СтрокаДоговора.Договор, ВзносыВрем ) );
			Для каждого СтрокаВзносыВрем Из СтрокиВзносыВремТекДоговора Цикл
			
				СведенияОСтаже.Удалить( СтрокаВзносыВрем );	
			
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЦикла;
	
	//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	СтрокиНеоплДог = СведенияОСтаже.НайтиСтроки( 
		Новый Структура( "ВидДеятельности", НеоплДог ) );
	Для каждого СтрокаНеоплДог Из СтрокиНеоплДог Цикл
			
	    СтрокиВзносов = СведенияОВзносах.НайтиСтроки( Новый Структура( "ФизЛицо", СтрокаНеоплДог.ФизЛицо ) );
		ЕстьВзносы = Ложь;
		НомерДоговора = ПолучитьНомерДокументаДляПУ( СтрокаНеоплДог.Договор );
		ДатаДоговора = ПолучитьДатуДокументаДляПУ( СтрокаНеоплДог.Договор );
		Для каждого СтрокаВзносов Из СтрокиВзносов Цикл
		
			Если //(
				 ПолучитьНомерДокументаДляПУ( СтрокаВзносов.Договор )
				 = НомерДоговора
				 И
				  ПолучитьДатуДокументаДляПУ( СтрокаВзносов.Договор )
				 = ДатаДоговора
				 //И
				 // ПолучитьПересечениеДиапазонов( НачалоМесяца(СтрокаВзносов.Месяц), КонецМесяца(СтрокаВзносов.Месяц ), 
				 // 	СтрокаНеоплДог.ДатаНачалаРабот, СтрокаНеоплДог.ДатаОкончанияРабот ) <> Неопределено 
				 //)
				Тогда
			
				ЕстьВзносы = Истина;
				Прервать;
			
			КонецЕсли; 	
		
		КонецЦикла;
		
		Если НЕ ЕстьВзносы Тогда
			НовСтрокаВзносов = СведенияОВзносах.Добавить();
			ЗаполнитьЗначенияСвойств( НовСтрокаВзносов, СтрокаНеоплДог );
			НовСтрокаВзносов.Месяц = НачалоМесяца( СтрокаНеоплДог.ДатаНачалаРабот );
		КонецЕсли; 
	КонецЦикла;
	//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	
	
КонецПроцедуры
//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )

//+ СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 4 )
Функция ПолучитьНомерДокументаДляПУ( Договор )
	Перем НомерДокументаДляПУ;
	Если ЗначениеЗаполнено( Договор.НомерДляПу ) Тогда
		НомерДокументаДляПУ	= СокрЛП( Договор.НомерДляПу );
	Иначе	
	    НомерДокументаДляПУ	= СокрЛП( Договор.Номер );
	КонецЕсли; 	
	Возврат НомерДокументаДляПУ;
КонецФункции // ПолучитьНомерДокументаДляПУ()
	
Функция ПолучитьДатуДокументаДляПУ( Договор )
	Перем ДатаДокументаДляПУ;
	Если ЗначениеЗаполнено( Договор.ДатаПУ ) Тогда
		ДатаДокументаДляПУ	= Договор.ДатаПУ;
	Иначе	
	    ДатаДокументаДляПУ	= Договор.ДатаНачала;
	КонецЕсли; 	
	Возврат ДатаДокументаДляПУ;
КонецФункции // ПолучитьДатуДокументаДляПУ()

Процедура СвернутьСтрокиДоговоровДублей( СтрокиНеоплДог, СтрокиДоговор, Договор )

	МассивСтрокКУдалению = Новый Массив; //строки к удалению
	ТЗ_СведенияОСтажеДоговор = СведенияОСтаже.Выгрузить( СтрокиДоговор );
	ОтборФЛ = Новый Структура( "ФизЛицо" );
	Для каждого Стр Из СтрокиНеоплДог Цикл
		Если ЗначениеЗаполнено( Стр.Договор ) И ЗначениеЗаполнено( Стр.ВидДоговора ) Тогда
			//ищем Договор
		Иначе
			Продолжить;
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств( ОтборФЛ, Стр );
		ЕстьДоговор = Ложь;
		Для каждого СтрДог Из ТЗ_СведенияОСтажеДоговор.НайтиСтроки( ОтборФЛ ) Цикл
			Если ЗначениеЗаполнено( СтрДог.Договор ) И ЗначениеЗаполнено( СтрДог.ВидДоговора )
				 И СтрДог.ВидДоговора = Стр.ВидДоговора 
				 // + СВЭЙ КДЯ 28.08.19 СВФР-004631 ( пункт 13. )
				 //И СтрДог.Договор <> Стр.Договор  //это договор - дубль
				 //И НачалоГода( СтрДог.ДатаНачалаРабот ) = НачалоГода( Стр.ДатаНачалаРабот )
				 // - СВЭЙ КДЯ 28.08.19 СВФР-004631 ( пункт 13. )
				 // + СВЭЙ КДЯ 28.08.19 СВФР-004631 ( пункт 13. )
				 И ПолучитьПересечениеДиапазонов( НачалоГода( СтрДог.ДатаНачалаРабот ), КонецГода( СтрДог.ДатаОкончанияРабот ),
				                                  Стр.ДатаНачалаРабот, Стр.ДатаОкончанияРабот ) <> Неопределено
				 // - СВЭЙ КДЯ 28.08.19 СВФР-004631 ( пункт 13. )
				 И ПолучитьНомерДокументаДляПУ( СтрДог.Договор ) = ПолучитьНомерДокументаДляПУ( Стр.Договор )
				 И ПолучитьДатуДокументаДляПУ( СтрДог.Договор ) =  ПолучитьДатуДокументаДляПУ( Стр.Договор ) Тогда
				ЕстьДоговор = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; // СтрДог Из ТЗ_СведенияОСтажеДоговор.НайтиСтроки( ОтборФЛ )
		
		Если ЕстьДоговор Тогда
			//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
			//МассивСтрокКУдалению.Добавить( Стр ); 	
			//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
			//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
			Стр.ВидДеятельности = Договор; 	
			//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
		КонецЕсли; 
		
	КонецЦикла; // Стр Из СведенияОСтаже	

	//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	//Для каждого СтрУдал Из МассивСтрокКУдалению Цикл
	//
	//	СведенияОСтаже.Удалить( СтрУдал );	
	//
	//КонецЦикла;
	//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 40. )
	
КонецПроцедуры
//- СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 4 )

//+ СВЭЙ КДЯ 26.08.19 СВФР-004631 ( пункт 7 )
Процедура УстановитьПремиюВСтажеДети( СтрокиДети, СтрокиВзносыВрем, ВидДеятельностиПремия )
	Перем ВерхняяГраницаПокрытия;
	
	ТЗ_СведенияОСтажеДети = СведенияОСтаже.Выгрузить( СтрокиДети );
	ТЗ_СведенияОСтажеДети.Сортировать( "ДатаНачалаРабот" );
	
	ОтборФизЛица = Новый Структура( "ФизЛицо" );
	Для каждого СтрВзнВрем Из СтрокиВзносыВрем Цикл
		
		ЗаполнитьЗначенияСвойств( ОтборФизЛица, СтрВзнВрем );
		
		ВерхняяГраницаПокрытия = Неопределено;
		
		Для каждого СтрДети Из ТЗ_СведенияОСтажеДети.НайтиСтроки( ОтборФизЛица ) Цикл
			
			ПересечениеДиапазонов = ПолучитьПересечениеДиапазонов( 
				СтрДети.ДатаНачалаРабот, СтрДети.ДатаОкончанияРабот, СтрВзнВрем.ДатаНачалаРабот, СтрВзнВрем.ДатаОкончанияРабот );
				
			Если ПересечениеДиапазонов = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			Если ВерхняяГраницаПокрытия = Неопределено Тогда
				//это первый диапазон
				Если СтрВзнВрем.ДатаНачалаРабот < СтрДети.ДатаНачалаРабот Тогда
				    //если диапазоны стажа ДЕТИ не покрывают полностью дипазон стажа ВзносыВрем, то Премию не устанавливаем
					Прервать;	
				КонецЕсли;
				ВерхняяГраницаПокрытия = СтрДети.ДатаОкончанияРабот;
			Иначе	
				Если НачалоДня( ВерхняяГраницаПокрытия + мДлинаСуток ) < СтрДети.ДатаНачалаРабот Тогда
				    //если диапазоны стажа ДЕТИ не покрывают полностью дипазон стажа ВзносыВрем, то Премию не устанавливаем
					Прервать;	
				КонецЕсли;
				ВерхняяГраницаПокрытия = Макс( ВерхняяГраницаПокрытия, СтрДети.ДатаОкончанияРабот );
			КонецЕсли;
			
			Если ВерхняяГраницаПокрытия >= СтрВзнВрем.ДатаОкончанияРабот Тогда
				
				СтрВзнВрем.ВидДеятельности = ВидДеятельностиПремия;
				Прервать;	
			
			КонецЕсли; 
			
		КонецЦикла; // СтрДог Из ТЗ_СведенияОСтажеДоговор.НайтиСтроки( ОтборФЛ )
		
	КонецЦикла; // Стр Из СведенияОСтаже	
	
КонецПроцедуры
//- СВЭЙ КДЯ 26.08.19 СВФР-004631 ( пункт 7 )


//+ СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 5 )
Процедура СвернутьТабличнуюЧасть( ИмяТЧ )
	ИменаСворачиваемыхКолонок = "";
	Для каждого Реквизит Из Ссылка.Метаданные().ТабличныеЧасти[ ИмяТЧ ].Реквизиты Цикл
		ИменаСворачиваемыхКолонок = ИменаСворачиваемыхКолонок
		+ ?( ИменаСворачиваемыхКолонок = "", "", ", " ) + Реквизит.Имя;
	КонецЦикла; 
	ЭтотОбъект[ ИмяТЧ ].Свернуть( ИменаСворачиваемыхКолонок, "" );
КонецПроцедуры // СвернутьТабличнуюЧасть
//- СВЭЙ КДЯ 15.08.19 СВФР-004631 ( пункт 5 )

//+ СВЭЙ КДЯ 29.08.19 СВФР-004631 ( пункт 13. )
Функция	ЕстьНеобъединяемыеВидыДеятельности( СтрокиДоговораВсехВидовДеятельности, ХроноПромежуток, МасОбъединяемыеВидыДеятельности )
	Перем ЕстьНеобъединяемыеВидыДеятельности, Стр;
	
	ЕстьНеобъединяемыеВидыДеятельности = Ложь;
	Для каждого Стр Из СтрокиДоговораВсехВидовДеятельности Цикл
		
		Если МасОбъединяемыеВидыДеятельности.Найти( Стр.ВидДеятельности ) <> Неопределено  Тогда
			Продолжить;	
		КонецЕсли; 	
		
		Если ПолучитьПересечениеДиапазонов( Стр.ДатаНачалаРабот, Стр.ДатаОкончанияРабот,
				ХроноПромежуток.ДатаНачала, ХроноПромежуток.ДатаОкончания ) <> Неопределено Тогда
			ЕстьНеобъединяемыеВидыДеятельности = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла; 
	Возврат ЕстьНеобъединяемыеВидыДеятельности;
КонецФункции // ЕстьНеобъединяемыеВидыДеятельности
//- СВЭЙ КДЯ 29.08.19 СВФР-004631 ( пункт 13. )

// + СВЭЙ КДЯ 31.07.19 СВФР-004561
Функция ПолучитьПересечениеДиапазонов( Знач Начало1, Знач Окончание1, Знач Начало2, Знач Окончание2
								//+ СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
								, ТочноеПересечение = Ложь
								//- СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
								)
	Перем Диапазон;
	
	//+ СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
	Если НЕ ТочноеПересечение Тогда
	//- СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
		
		Начало1 = НачалоМесяца( Начало1 ); 
		Окончание1 = КонецМесяца( Окончание1 ); 
		Начало2 = НачалоМесяца( Начало2 ); 
		Окончание2 = КонецМесяца( Окончание2 ); 
		
	//+ СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
	КонецЕсли;  
	//- СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
	
	Если Начало1 <= Окончание1 И Начало2 <= Окончание2 Тогда
	
		Если Начало1 <= Начало2 И Начало2 <= Окончание1
			 ИЛИ
			 Начало1 <= Окончание2 И Окончание2 <= Окончание1	
			 ИЛИ
			 Начало1 <= Начало2 И Окончание2 <= Окончание1	
			 ИЛИ
			 Начало2 <= Начало1 И Окончание1 <= Окончание2 Тогда	
			
			Диапазон = Новый Структура( "Начало, Окончание" );
			Диапазон.Начало = НачалоМесяца( Макс( Начало1, Начало2 ) );	
			Диапазон.Окончание = НачалоМесяца( Мин( Окончание1, Окончание2 ) );	
		
		КонецЕсли; 	
	
	КонецЕсли;
	
	Возврат Диапазон;
КонецФункции
// - СВЭЙ КДЯ 31.07.19 СВФР-004561


//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
Процедура УдалитьВключаемыеСтрокиСведенийОСтаже()
	Перем МассивСтрокКУдалению, Отбор, ЕстьВключение, СтрУдал;
	
	МассивСтрокКУдалению = Новый Массив; //строки к удалению
	//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
	//Отбор = Новый Структура( "ФизЛицо, Договор, ВидДоговора, ВидДеятельности" );
	//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
	//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
	Отбор = Новый Структура( "ФизЛицо, ВидДоговора, ВидДеятельности" );
	//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
	Для каждого Стр Из СведенияОСтаже Цикл
		Если ЗначениеЗаполнено( Стр.Договор ) И ЗначениеЗаполнено( Стр.ВидДоговора ) Тогда
			//ищем Договор
		Иначе
			Продолжить;
		КонецЕсли;
		НомерДокументаПУ = ПолучитьНомерДокументаДляПУ( Стр.Договор );
		ДатаДокументаПУ = ПолучитьДатуДокументаДляПУ( Стр.Договор );
		ЗаполнитьЗначенияСвойств( Отбор, Стр );
		ЕстьВключение = Ложь;
		Для каждого СтрДог Из СведенияОСтаже.НайтиСтроки( Отбор ) Цикл
			Если 
				//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 30. )
				//СтрДог.ДатаНачалаРабот <= Стр.ДатаНачалаРабот 
				//И СтрДог.ДатаОкончанияРабот >= Стр.ДатаОкончанияРабот
				//И Стр <> СтрДог
				//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 30. )
				 
				//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 30. )
				( СтрДог.ДатаНачалаРабот < Стр.ДатаНачалаРабот 
				И СтрДог.ДатаОкончанияРабот >= Стр.ДатаОкончанияРабот
				ИЛИ
				СтрДог.ДатаНачалаРабот <= Стр.ДатаНачалаРабот 
				И СтрДог.ДатаОкончанияРабот > Стр.ДатаОкончанияРабот
				ИЛИ
				СтрДог.ДатаНачалаРабот = Стр.ДатаНачалаРабот 
				И СтрДог.ДатаОкончанияРабот = Стр.ДатаОкончанияРабот
				И Стр.НомерСтроки > СтрДог.НомерСтроки )
				//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 30. )
				
				//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
				И НомерДокументаПУ = ПолучитьНомерДокументаДляПУ( СтрДог.Договор )
				И ДатаДокументаПУ = ПолучитьДатуДокументаДляПУ( СтрДог.Договор )
				//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40.) 
				
			Тогда
				ЕстьВключение = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; // СтрДог Из ТЗ_СведенияОСтажеДоговор.НайтиСтроки( ОтборФЛ )
		Если ЕстьВключение Тогда
			МассивСтрокКУдалению.Добавить( Стр ); 	
		КонецЕсли; 
	КонецЦикла; // Стр Из СведенияОСтаже	

	Для каждого СтрУдал Из МассивСтрокКУдалению Цикл
	
		СведенияОСтаже.Удалить( СтрУдал );	
	
	КонецЦикла;

КонецПроцедуры // УдалитьВключаемыеСтрокиСведенийОСтаже()

Процедура ОбъединитьХронологическиеЦепочкиСведенийОСтаже( 
				//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
				МасОбъединяемыеВидыДеятельности 
				//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
			)
	Перем ТЗ_ФизЛиц, Стр, СтрокаДубль, Отбор, СведенияОСтажеКопия, ОтборСтрокДоговора;
	Перем НеобходимоСвернуть, ДублиБылиОткорректированы;
	
	// сворачиваем строки, образующие хронологические звенья, в одну строку для каждого картежа ( ФизЛицо, ВидДеятельности, Договор )
	
	ТЗ_ФизЛиц = СведенияОСтаже.Выгрузить( Новый Структура( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.Подряда ) );
	ЦелевыеКолонки = "ФизЛицо, ВидДеятельности, ВидДоговора, Договор";
	ТЗ_ФизЛиц.Свернуть( ЦелевыеКолонки );
	ТЗ_ФизЛиц.Сортировать( ЦелевыеКолонки );
	
	//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
	ОтборСтрокДоговора = Новый Структура( "ФизЛицо, ВидДоговора, Договор" );
	//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
	
	СведенияОСтажеКопия = СведенияОСтаже.Выгрузить();
	СведенияОСтажеКопия.Сортировать( "ФизЛицо, ДатаНачалаРабот" );
	
	Отбор = Новый Структура( ЦелевыеКолонки );
	
	НеобходимоСвернуть = Ложь;
	Для каждого ЦелеваяСтрока Из ТЗ_ФизЛиц Цикл
		
		ЗаполнитьЗначенияСвойств( Отбор, ЦелеваяСтрока );
		СтрокиДоговора = СведенияОСтаже.НайтиСтроки( Отбор );
		Если СтрокиДоговора.Количество() <= 1 Тогда
			Продолжить;		
		КонецЕсли; 
		СтрокиДубли = СведенияОСтажеКопия.НайтиСтроки( Отбор );
		
		Для каждого Стр Из СтрокиДоговора Цикл
			
			Если Стр.ДатаНачалаРабот > Стр.ДатаОкончанияРабот Тогда
				ТекстОшибки = НСтр( "ru='В строке %1 дата начала работ превышает дату окончания работ!'" );
				ТекстОшибки =  СтрЗаменить( ТекстОшибки, "%1", Строка( Стр.НомерСтроки ) );
			    Сообщить( ТекстОшибки, СтатусСообщения.Важное );
				Продолжить;	
			КонецЕсли;
			
			//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
			ЭтоОбъединяемыйВидДеятельности = ( МасОбъединяемыеВидыДеятельности.Найти( Стр.ВидДеятельности ) <> Неопределено );
			//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
			
			ДублиБылиОткорректированы = Истина;
			Пока ДублиБылиОткорректированы Цикл
				
				ДублиБылиОткорректированы = Ложь;
					
				Для каждого СтрокаДубль Из СтрокиДубли Цикл
					
					Если Стр.НомерСтроки = СтрокаДубль.НомерСтроки ИЛИ СтрокаДубль.ДатаНачалаРабот > СтрокаДубль.ДатаОкончанияРабот Тогда
						Продолжить;	
					КонецЕсли;
					
					Если ( СтрокаДубль.ДатаОкончанияРабот + мДлинаСуток ) = Стр.ДатаНачалаРабот Тогда
						Стр.ДатаНачалаРабот	= СтрокаДубль.ДатаНачалаРабот;
						ДублиБылиОткорректированы = Истина;
						Продолжить;
					КонецЕсли;
					Если ( Стр.ДатаОкончанияРабот + мДлинаСуток ) = СтрокаДубль.ДатаНачалаРабот Тогда
						Стр.ДатаОкончанияРабот	= СтрокаДубль.ДатаОкончанияРабот;
						ДублиБылиОткорректированы = Истина;
						//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
						Продолжить;
						//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
					Если ЭтоОбъединяемыйВидДеятельности Тогда
						
						//+ СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
						//Даже если есть Необъединяемые ВидыДеятельности, все равно объединяем
						//ЕстьНеобъединяемыеВидыДеятельности = Ложь;
						//- СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
						
						Если ПолучитьПересечениеДиапазонов( Стр.ДатаНачалаРабот, Стр.ДатаОкончанияРабот,
								СтрокаДубль.ДатаНачалаРабот, СтрокаДубль.ДатаОкончанияРабот
											//+ СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
											, Истина
											//- СВЭЙ КДЯ 24.09.19 СВФР-004631 ( пункт 43. )
									) <> Неопределено Тогда
							
							//есть пересечение диапазонов
							Если СтрокаДубль.ДатаНачалаРабот < Стр.ДатаНачалаРабот Тогда
								Стр.ДатаНачалаРабот	= СтрокаДубль.ДатаНачалаРабот;
								ДублиБылиОткорректированы = Истина;
							КонецЕсли; 
							Если СтрокаДубль.ДатаОкончанияРабот > Стр.ДатаОкончанияРабот Тогда
								Стр.ДатаОкончанияРабот	= СтрокаДубль.ДатаОкончанияРабот;
								ДублиБылиОткорректированы = Истина;
							КонецЕсли; 
							Продолжить;
							
						Иначе
							
							//есть хронологический разрыв; нет пересечения диапазонов
							Если СтрокаДубль.ДатаОкончанияРабот < Стр.ДатаНачалаРабот Тогда
								
								ХроноПромежуток = Новый Структура( "ДатаНачала, ДатаОкончания",
									СтрокаДубль.ДатаОкончанияРабот, Стр.ДатаНачалаРабот	);
									
								ЗаполнитьЗначенияСвойств( ОтборСтрокДоговора, ЦелеваяСтрока );
								СтрокиДоговораВсехВидовДеятельности = СведенияОСтажеКопия.НайтиСтроки( ОтборСтрокДоговора );
								
								//+ СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
								//Даже если есть Необъединяемые ВидыДеятельности, все равно объединяем
								//ЕстьНеобъединяемыеВидыДеятельности = 
								//ЕстьНеобъединяемыеВидыДеятельности( СтрокиДоговораВсехВидовДеятельности, ХроноПромежуток, МасОбъединяемыеВидыДеятельности )
								//;
								//- СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
								
							ИначеЕсли СтрокаДубль.ДатаНачалаРабот > Стр.ДатаОкончанияРабот Тогда
								
								ХроноПромежуток = Новый Структура( "ДатаНачала, ДатаОкончания",
									Стр.ДатаОкончанияРабот, СтрокаДубль.ДатаНачалаРабот	);
									
								ЗаполнитьЗначенияСвойств( ОтборСтрокДоговора, ЦелеваяСтрока );
								СтрокиДоговораВсехВидовДеятельности = СведенияОСтажеКопия.НайтиСтроки( ОтборСтрокДоговора );
								
								//+ СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
								//Даже если есть Необъединяемые ВидыДеятельности, все равно объединяем
								//ЕстьНеобъединяемыеВидыДеятельности = 
								//ЕстьНеобъединяемыеВидыДеятельности( СтрокиДоговораВсехВидовДеятельности, ХроноПромежуток, МасОбъединяемыеВидыДеятельности )
								//;
								//- СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
								
							КонецЕсли; 
						
						КонецЕсли; // ПолучитьПересечениеДиапазонов( Стр.ДатаНачалаРабот, Стр.ДатаОкончанияРабот ... 
						
						//+ СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
						//Даже если есть Необъединяемые ВидыДеятельности, все равно объединяем
						//Если ЕстьНеобъединяемыеВидыДеятельности Тогда
						//	Продолжить;	
						//КонецЕсли; 
						//- СВЭЙ КДЯ 25.09.18 СВФР-004631 ( пункт 47. )
						
						Если СтрокаДубль.ДатаОкончанияРабот < Стр.ДатаНачалаРабот Тогда
							Стр.ДатаНачалаРабот	= СтрокаДубль.ДатаНачалаРабот;
							ДублиБылиОткорректированы = Истина;
							Продолжить;
						КонецЕсли;
						Если Стр.ДатаОкончанияРабот < СтрокаДубль.ДатаНачалаРабот Тогда
							Стр.ДатаОкончанияРабот	= СтрокаДубль.ДатаОкончанияРабот;
							ДублиБылиОткорректированы = Истина;
						КонецЕсли;
						Продолжить;
						
					КонецЕсли; // ЭтоОбъединяемыйВидДеятельности 
					//- СВЭЙ КДЯ 29.08.18 СВФР-004631 ( пункт 13. )
					
				КонецЦикла; // СтрокаДубль Из СтрокиДубли
					
				Если ДублиБылиОткорректированы Тогда
					НеобходимоСвернуть = Истина;
				КонецЕсли;
				
			КонецЦикла; // ДублиБылиОткорректированы
		КонецЦикла; // Стр Из СтрокиДоговора
		
	КонецЦикла; // СтрФЛ Из ТЗ_ФизЛиц
		
	Если НеобходимоСвернуть Тогда
		СвернутьТабличнуюЧасть( "СведенияОСтаже" );
	КонецЕсли;

КонецПроцедуры // ОбъединитьХронологическиеЦепочкиСведенийОСтаже()
//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )


//Островская Татьяна 30.11.2012 № 15958
Процедура УдалитьСтрокиНачисленийПоРаботнику(ФизЛицо) Экспорт
	
	СтруктураПоиска = Новый Структура("ФизЛицо", ФизЛицо);
	
	МассивСтрок = СведенияОСтаже.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		СведенияОСтаже.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	МассивСтрок = СведенияОВзносах.НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
		СведенияОВзносах.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры // УдалитьСтрокиНачисленийПоРаботнику()
//Островская Татьяна 30.11.2012 № 15958

#Если Клиент Тогда
	
	// Формирует файл, который можно будет записать на дискетку
	//
	// Параметры: 
	//  Нет
	//
	// Возвращаемое значение:
	//  Строка - содержимое файла
	//
	Функция СформироватьВыходнойФайл(Отказ) Экспорт
		
		мДлинаСуток = 86400;
		
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
			Отказ = Истина;
			Возврат "";
		КонецЕсли;	
		
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		Результат					=	СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации			=	Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
		ЗапросОрг = Новый Запрос;
		ЗапросОрг.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид
		|	И КонтактнаяИнформация.Объект.Код = &Код";
		ЗапросОрг.УстановитьПараметр("Объект", ВыборкаПоШапкеДокумента.Организация);
		ЗапросОрг.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		ЗапросОрг.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		ЗапросОрг.УстановитьПараметр("Код", ВыборкаПоШапкеДокумента.Организация.Код);
		РезОрг = ЗапросОрг.Выполнить().Выбрать();
		ТелефонОрганизации = "";
		Если РезОрг.Следующий() Тогда 
			ТелефонОрганизации = РезОрг.Представление;
		КонецЕсли;;
		
		
		
		//убрал за ненадобностью	
		//Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
		//КонецЕсли;	 
		
		СписокОбработанныхАнкет = Новый СписокЗначений;
		
		ТекстФайла	=	"";
		НомерДокументаВПачке = 0;
		
		//Формируем заголовок выходного файла
		ДатаФормирования = ВыборкаПоШапкеДокумента.Дата;
		ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
		МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
		ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
		ДатаЗаполнения   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		НомерПачки 				= ПроцедурыПерсонифицированогоУчета.НомерПачкиДокумента(ВыборкаПоШапкеДокумента.Номер);
		КоличествоДокументов 	= ВыборкаПоРаботникиОрганизации.Количество();
		
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
		Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
		Запрос.УстановитьПараметр("НачалоНП", НачалоГода(НачалоГода(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1))));  //ДатаРегистрации 1633
		Запрос.УстановитьПараметр("КонецНП", КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		Запрос.УстановитьПараметр("ДатаПодачиСведений", ВыборкаПоШапкеДокумента.ПериодРегистрации);// дата акуальности сведений о доходах и налогах
		//О.Т. Аверсон 28.02.2019 № 3224
		СпособыПособия = Новый СписокЗначений;
		СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
			СпособыПособия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		//О.Т. Аверсон 28.02.2019 № 3224
		
		Запрос.УстановитьПараметр("СпособРасчета" , СпособыПособия);

		
		// Выборка списка физлиц, для которых надо получать доходы
		СписокФизлицТекст = "ВЫБРАТЬ 
		|	ТЧРаботникиОрганизации.ФизЛицо
		|ИЗ
		|	Документ.СведенияОЗаработкеРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		
		ДоходыПоВидамЗаГод =
		//"ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК Больничные,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК СуммаДохода,
		//|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
		//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//|	34 КАК ПроцентФСЗН
		//|ИЗ
		//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		//|			34 КАК ПроцентФСЗН,
		//|			СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//|			СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН
		//|		ИЗ
		//|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|		ГДЕ
		//|			ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		//|			И ЕСНИсчисленный.Организация = &Организация
		//|			И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ЕСНИсчисленный.ФизЛицо,
		//|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)) КАК ЕСНИсчисленный
		//|		ПО ЕСНСведенияОДоходах.ФизЛицо = ЕСНИсчисленный.ФизЛицо
		//|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ЕСНИсчисленный.ПериодВзаиморасчетов)
		//|ГДЕ
		//|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		//|	И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЕСНСведенияОДоходах.ФизЛицо,
		//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//|	ЕСНИсчисленный.ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд";
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ВложенныйЗапрос.ВидДоговора,
		|	ВложенныйЗапрос.ДоговорНомер КАК НомерДокумента,
		|	ВложенныйЗапрос.ДоговорДата КАК ДатаДокумента
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ВЫБОР
		|				КОГДА ЕСНИсчисленный.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		|				ИНАЧЕ ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|			КОНЕЦ
		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ,
		|		34,
		|		NULL,
		|		NULL
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		|				ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|			КОНЕЦ
		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ФизЛицо КАК ФизЛицо,
		|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Месяц КАК Месяц,
		|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ВидДоговора КАК ВидДоговора,
		|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ПричиныМинимальнойЗП КАК ПричиныМинимальнойЗП, //О.Т. Аверсон 15.03.2019 № 4091
		//О.Т. Аверсон 31.01.2019 № 3056
		|		ВЫБОР
		|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу = """"
		|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.Номер
		|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу
		|		КОНЕЦ КАК ДоговорНомер,
		|		ВЫБОР
		|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаНачала
		|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ
		|		КОНЕЦ КАК ДоговорДата
		//О.Т. Аверсон 31.01.2019 № 3056
		|		ИЗ
		|			Документ.СведенияОЗаработкеРаботниковДПУ.СведенияОВзносах КАК СведенияОЗаработкеРаботниковДПУСведенияОВзносах
		|		ГДЕ
		|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Ссылка = &ДокументСсылка) КАК ВложенныйЗапрос
		|		ПО ОбщаяТаблицаФСЗН.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		|			И ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов = ВложенныйЗапрос.Месяц
		
		|
		|СГРУППИРОВАТЬ ПО                                           
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ВложенныйЗапрос.ВидДоговора,
		|	ВложенныйЗапрос.ДоговорНомер,
		|	ВложенныйЗапрос.ДоговорДата
		|	УПОРЯДОЧИТЬ ПО
		|	Период";	
		
		
		
		Запрос.Текст = ДоходыПоВидамЗаГод;
		ПромежуточнаяТаблица = Запрос.Выполнить().Выгрузить();
		ПромежуточнаяТаблица.Свернуть("ФизЛицо,Период,ВидДоговора,НомерДокумента,ДатаДокумента,ПроцентФСЗН","Больничные,СуммаДохода,ФСЗН,ПенсионныйФонд");
		
		ПТДопСведОстаже = ПолучитьДанныеДляЗаполненияСтажа(ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ПериодРегистрации);
		
		ТекстФайла = Новый ТекстовыйДокумент;
		текстФайла.ДобавитьСтроку("ЗГЛВ=1.5=");
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ДобавитьСтроку(Врег("<ПАЧК="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)= "", " ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)) +"="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)= ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР))+
		"="+?(СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное) = ""," ",СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное))+"="+Прав(ВыборкаПоШапкеДокумента.Номер,5)+"= = =1="));
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ДобавитьСтроку("ТИПД=ПУ-3=1= = = =>");
		
		//ТекстФайла.ДобавитьСтроку("<ПУ-3=И="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+"= = ="+СокрЛП(Строка(КоличествоДокументов))+"= = = = =");
		
		
		ТипЗаписи    = "<ПУ-3=И="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР) = ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)) +"=";
		
		ТекСтрока = 3;
		ИтогДохода = 0;
		ИтогБольн = 0;
		ИтогВзнос = 0;
		РаботДоходСлед =0;
		РаботБольнСлед = 0;
		РаботВзносСлед =0;
		РаботДоход = 0;
		РаботБольн = 0;
		РаботВзнос = 0;
		
		СтрокаЗамены = 3;
		
		//толик контрольный файл дбф
		
		Дбф=Новый XBase();
		Дбф.Кодировка=КодировкаXBase.OEM;
		Дбф.Поля.Добавить("FIO", "S", 50);
		Дбф.Поля.Добавить("Datr", "D");
		Дбф.Поля.Добавить("Dato", "D");
		Дбф.Поля.Добавить("Sm", "N", 12);
		Дбф.Поля.Добавить("Bl", "N", 12);
		Дбф.Поля.Добавить("Vz", "N", 12);
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьКФайламБанк;
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			Дбф.СоздатьФайл(ПутьКФайлу+"\VznosyF.DBF");
		иначе
			РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
			б = Сред(РабочийКаталог,7);
			в = Найти(б,Символ(34));
			путьИБ = Лев(б, в-1);
			
			Дбф.СоздатьФайл(путьИБ+"\VznosyF.DBF");
		КонецЕсли;
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		
		Пока ВыборкаПоРаботникиОрганизации.Следующий()	Цикл
			//Контроль дубля строк
			ТипЗаписиНач = "НЧСЛ=";
			Структура = Новый Структура;
			Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
			если ВыборкаПоРаботникиОрганизации.ВидДоговора = Неопределено Тогда 
				Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
			Иначе 
				Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
			КонецЕсли;
			СтрокиПоРаботнику = ПромежуточнаяТаблица.НайтиСтроки(Структура); 
			Если СтрокиПоРаботнику.Количество()<> 0 тогда
				РаботДоход = 0;
				РаботБольн = 0;
				РаботВзнос = 0;
				СтрокаФайла = ТипЗаписи;
				//Инициалы должны быть указаны
				Фамилия = ВРег(?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия)));
				Имя = Врег(?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Имя),1)));
				Отчество = Врег(?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество),1)));
				Категория =?(ВыборкаПоРаботникиОрганизации.Категория = "", "01", СокрЛП(ВыборкаПоРаботникиОрганизации.Категория));
				//толик			СтрокаФайла = СтрокаФайла+СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)+"="+Фамилия+"="+Имя+"="+Отчество+"="+Категория+"=";
				СтрокаЗар = "";
				//Островская Татьяна 02.11.2012 № 15
				если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ВидДоговора) Тогда 
					КатегорияВывод = "ДОГОВОР";
				ИНАЧЕ
					КатегорияВывод = "";
				КонецЕсли;
				Структура = Новый Структура;
				Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				если ВыборкаПоРаботникиОрганизации.ВидДоговора = Неопределено Тогда 
					Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
				Иначе 
					Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
				КонецЕсли;
				
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				ЕстьВидРасчета = Ложь;
				Для каждого СтрДог из СтрокиПоРаб цикл
					если не СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
						ЕстьВидРасчета = Истина;
					КонецЕсли;
				КонецЦикла;
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				Для каждого СтрДог из СтрокиПоРаб цикл 
					если ЕстьВидРасчета Тогда 
						если СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					
					если КатегорияВывод= "ДОГОВОР"  Тогда 
						
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"03"+"=";
					Иначе 
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
						
					КонецЕсли;
					
					Прервать;
					
				КонецЦикла;
				
				Если СтрокиПоРаб.Количество()=0 Тогда 
					СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
					Сообщить("Данные не найдены по сотруднику "+ВыборкаПоРаботникиОрганизации.ФизЛицо.Наименование);					
				КонецЕсли;

				//Островская Татьяна 02.11.2012 № 15
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;                     
				
				НомерДокументаВПачке = 	НомерДокументаВПачке + 1;
				
				//Берем запись с пустыми полями
				//Запись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
				
				НомерДокументаВПачке = НомерДокументаВПачке;
				ТекстФайла.ДобавитьСтроку(СтрокаФайла);
				ТекСтрока = ТекСтрока+1;
				СтрокаЗамены = ТекСтрока;
				
				КоличествоМес = 0;
				СтрокаДатаДокумента = "";
				СтрокаНомерДокумента = "";
				СтрМес = 1;
				СтрокаФайла1 = "";
				Сч =0;
				СтрокиПоРаботнику1 = ПромежуточнаяТаблица.НайтиСтроки(Структура);
				Колич = СтрокиПоРаботнику1.Количество();
				СтрокаЗамена = СтрокаФайла;
				Для Сч = 0 по Колич-1 цикл
					СтрокаМес = СтрокиПоРаботнику1[Сч];
					если ЗначениеЗаполнено(СтрокаДатаДокумента) и ЗначениеЗаполнено(СтрокаНомерДокумента) Тогда 
					иначе
						
						СтрокаДатаДокумента = СтрокаМес.ДатаДокумента;
						СтрокаНомерДокумента = СтрокаМес.НомерДокумента;
					КонецЕсли;
					если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
						СтрокаДатаДокументаСлед = СтрокиПоРаботнику1[Сч+1].ДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокиПоРаботнику1[Сч+1].НомерДокумента;
					иначе
						СтрокаДатаДокументаСлед = СтрокаДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокаНомерДокумента;
						
					КонецЕсли;
					Если Категория <> "03" тогда
						если КатегорияВывод= "ДОГОВОР" Тогда
							если  не СтрокаДатаДокументаСлед = "" Тогда  
								//если не СтрМес>1 Тогда
								ДеньДатыДоговора        = ?(День(СтрокаДатаДокументаСлед)<10,"0","")+День(СтрокаДатаДокументаСлед);
								МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокументаСлед)<10,"0","")+Месяц(СтрокаДатаДокументаСлед);
								ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокументаСлед), "ЧГ=0")));
								ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;    
								//иначе
								//	ДеньДатыДоговора        = ?(День(СтрокаДатаДокумента)<10,"0","")+День(СтрокаДатаДокумента);
								//	МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокумента)<10,"0","")+Месяц(СтрокаДатаДокумента);
								//	ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокумента), "ЧГ=0")));
								//	ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;
								//КонецЕсли;
							иначе
								ДатаДоговора = "";
							КонецЕсли;
							если не Сч > Колич-1 Тогда
								СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, Число(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"= = =";					
							иначе
								СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, Число(СтрокаНомерДокумента)) +"="+ДатаДоговора+"= = =";
							КонецЕсли;
						Иначе 
							если не СтрМес>1 Тогда
								СтрокаФайла = СтрокаФайла+" = = = =";
							КонецЕсли;
						КонецЕсли;
						
						
					КонецЕсли;
					//КонецЕсли;
					если СтрМес > 1 Тогда 
						если КатегорияВывод= "ДОГОВОР" Тогда
							если не Сч > Колич-1 Тогда
								ТекстФайла.ДобавитьСтроку(СтрокаФайла1);
							иначе
								ТекстФайла.ДобавитьСтроку(СтрокаФайла);
							КонецЕсли;
							ТекСтрока = ТекСтрока+1;
							ТипЗаписиНач = "НЧСЛ=";
							если Сч <= СтрокиПоРаботнику1.Количество()-1 Тогда 
								если не КатегорияВывод= "ДОГОВОР" Тогда
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
								иначе
									ИтогДохода = ИтогДохода + РаботДоходСлед;
									ИтогБольн = ИтогБольн + РаботБольнСлед;
									ИтогВзнос = ИтогВзнос + РаботВзносСлед;
								КонецЕсли;
							иначе
								если КатегорияВывод= "ДОГОВОР" Тогда
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									
								иначе
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									
								КонецЕсли;
							КонецЕсли;
							РаботДоход = 0;
							РаботБольн = 0;
							РаботВзнос = 0;
							КоличествоМес = 0;
							КоличествоДокументов 	= КоличествоДокументов+1;
						КонецЕсли;
					КонецЕсли;
					
					//толик 	добавил округление - ЧДЦ=0;
					//Если (ЗначениеЗаполнено(СтрокаМес.СуммаДохода) Или ЗначениеЗаполнено(СтрокаМес.Больничные) или ЗначениеЗаполнено(СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд)) Тогда
					//Островская Татьяна 31.10.2012 № 15958
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					СтрЗар = ?(СтрокаМес.СуммаДохода = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.СуммаДохода,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					если не КатегорияВывод= "ДОГОВОР" Тогда
						СтрБлн = ?(СтрокаМес.Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					иначе
						СтрБлн = ?(СтрокаМес.Больничные = 0, " ", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					КонецЕсли;
					СтрВзн = ?((СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд) = 0, "0", СокрЛП(Строка(Формат((СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					
					//Островская Татьяна 31.10.2012 № 15958
					НомерМесяца = Формат(Месяц(СтрокаМес.Период),"ЧГ=0");
					
					//+ СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					//изменился формат файла пачки ПУ-3 - незначащие нули не проходят проверку
					//если НомерМесяца = Лев(НомерМесяца,1) Тогда 
					//	НомерМесяца = "0"+НомерМесяца;
					//КонецЕсли;
					//- СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					
					
					//Островская Татьяна 30.11.2012 № 15958
					//Островская Татьяна 30.11.2012 № 15958
					//СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаМес.ФизЛицо));
					//Для каждого СтрДог из СтрокиПоРаб цикл 
					//	если КатегорияВывод= "ДОГОВОР" Тогда
					//		если Основные Тогда
					//		Иначе 
					//			если СтрБлн = "0" Тогда 
					//				СтрБлн = " ";
					//				Прервать;
					//			КонецЕсли;
					//		КонецЕсли;
					//	КонецЕсли;
					//	
					//КонецЦикла;
					
					
					//Островская Татьяна 30.11.2012 № 15958
					СтрокаЗар = ВРЕГ(ТипЗаписиНач+НомерМесяца+"="+СтрЗар+"="+СтрБлн+"="+СтрВзн+"= ="+СокрЛП(Строка(Формат(СтрокаМес.ПроцентФСЗН+1,"ЧГ=0")))+"="); //Островская Татьяна 17.01.2013 № 16153
					ТекстФайла.ДобавитьСтроку(СтрокаЗар);
					ТекСтрока = ТекСтрока+1;
					//толик формирование контрольного файла
					Дбф.Добавить();
					Дбф.УстановитьЗначениеПоля("FIO", СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо)));
					Дбф.УстановитьЗначениеПоля("Dato", СтрокаМес.Период);
					Дбф.УстановитьЗначениеПоля("Sm", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода, СтрокаМес.Период)); //О.Т. Аверсон 14.03.2016 № 949
					Дбф.УстановитьЗначениеПоля("Bl", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.Больничные, СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
					Дбф.УстановитьЗначениеПоля("Vz", ОбщегоНазначения.ОкруглитьЗначение2016((СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд),  СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
					Дбф.Записать();
					
					если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
						РаботДоходСлед = РаботДоход + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокиПоРаботнику1[Сч+1].СуммаДохода, СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						РаботБольнСлед = РаботБольн + СтрокиПоРаботнику1[Сч+1].Больничные;
						РаботВзносСлед = РаботВзнос + СтрокиПоРаботнику1[Сч+1].ФСЗН + СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд;
						РаботДоход = РаботДоход + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода, СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						РаботБольн = РаботБольн + СтрокаМес.Больничные;
						РаботВзнос = РаботВзнос + СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд;
						//если не КатегорияВывод= "ДОГОВОР" Тогда
						//	ИтогДохода = ИтогДохода + РаботДоход;
						//	ИтогБольн = ИтогБольн + РаботБольн;
						//	ИтогВзнос = ИтогВзнос + РаботВзнос;
						//иначе
						//	ИтогДохода = ИтогДохода + РаботДоходСлед;
						//	ИтогБольн = ИтогБольн + РаботБольнСлед;
						//	ИтогВзнос = ИтогВзнос + РаботВзносСлед;
						//КонецЕсли;
					иначе
						если КатегорияВывод= "ДОГОВОР" Тогда
							РаботДоход = РаботДоход + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокиПоРаботнику1[0].СуммаДохода, СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
							РаботБольн = РаботБольн + СтрокиПоРаботнику1[0].Больничные;
							РаботВзнос = РаботВзнос + СтрокиПоРаботнику1[0].ФСЗН + СтрокиПоРаботнику1[0].ПенсионныйФонд;
							//ИтогДохода = ИтогДохода + РаботДоход;
							//ИтогБольн = ИтогБольн + РаботБольн;
							//ИтогВзнос = ИтогВзнос + РаботВзнос;
							
						иначе
							РаботДоход = РаботДоход + ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода, СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
							РаботБольн = РаботБольн + СтрокаМес.Больничные;
							РаботВзнос = РаботВзнос + СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд;
							//ИтогДохода = ИтогДохода + РаботДоход;
							//ИтогБольн = ИтогБольн + РаботБольн;
							//ИтогВзнос = ИтогВзнос + РаботВзнос;
							
						КонецЕсли;
					КонецЕсли;
					КоличествоМес = КоличествоМес+1;
					//КонецЕсли;
					
					
					если КатегорияВывод= "ДОГОВОР" Тогда
						ТипЗаписиНач = "СТАЖ=";
						Структура = Новый Структура;
						Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
						если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							Структура.Вставить("ВидДоговора",null);
						Иначе 
							Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						КонецЕсли;
						
						СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура); 
						КоличествоЗаписейОСтаже = 0;
						ПредыдущийВидДейтельности = "";
						ПредыдущееОкончаниеРабот = "";
						ДатаНачалаРабот = "";
						Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.НачалоРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ОкончаниеРабот)) Тогда 
								Продолжить;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности) Тогда 
								Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда 
									ДатаФормирования = СтрокаСтаж.НачалоРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
									
									
									ДатаФормирования = СтрокаСтаж.ОкончаниеРабот;
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;

									СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+СокрЛП(СтрокаСтаж.ВидДейтельности)+"= = =");
									ТекстФайла.ДобавитьСтроку(СтрокаЗар);
									ТекСтрока = ТекСтрока+1;
									КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
									Если Категория = "03" тогда
										НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										СтрокаФайла = СтрокаФайла+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"= = =";
									КонецЕсли;
									ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
									ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					
					
					
					
					//Островская Татьяна 25.10.2012 № 15958
					//Островская Татьяна 17.01.2013 № 16153
					если не Сч > Колич-1 Тогда 
						если не КатегорияВывод= "ДОГОВОР" Тогда
							
						иначе
							СтрокаЗар = СтрокаЗар + ">";
							ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
							если не Сч > Колич-1 Тогда
								СтрокаФайла1 = ВРЕГ(СтрокаФайла+ ?(РаботДоходСлед = 0, " ", СокрЛП(Строка(Формат(РаботДоходСлед,"ЧГ=0"))))+"="+
								?(РаботБольнСлед = 0, " ", СокрЛП(Строка(Формат(РаботБольнСлед,"ЧГ=0"))))+"="+
								?(РаботВзносСлед = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед,"ЧГ=0"))))+"= ="+Формат(КоличествоМес,"ЧГ=0")+"="+?(КоличествоЗаписейОСтаже=0," ",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже,"ЧГ=0"))))+"="+ДатаЗаполнения+"= ="+Формат(ГОД(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1)),"ЧГ=0")+"="+СтрЗаменить(ТелефонОрганизации," ",""))+"=";
								
							КонецЕсли;	
						КонецЕсли;
					иначе
						если  КатегорияВывод= "ДОГОВОР" Тогда
							СтрокаЗар = СтрокаЗар + ">";
							ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 17.01.2013 № 16153
					//Островская Татьяна 25.10.2012 № 15958	
					
					
					
					СтрМес = СтрМес+1;
				КонецЦикла;
				//если не СтрМес>1 Тогда 
				если не КатегорияВывод= "ДОГОВОР" Тогда
					СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, "0", СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"= ="+Формат(КоличествоМес,"ЧГ=0")+"="+" "+"="+ДатаЗаполнения+"= ="+Формат(ГОД(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1)),"ЧГ=0")+"="+СтрЗаменить(ТелефонОрганизации," ",""))+"=";
				иначе
					
					//если не СтрМес>1 Тогда
					
					СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, " ", СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, " ", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, " ", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"= ="+Формат(КоличествоМес,"ЧГ=0")+"="+?(КоличествоЗаписейОСтаже=0," ",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже,"ЧГ=0"))))+"="+ДатаЗаполнения+"= ="+Формат(ГОД(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1)),"ЧГ=0")+"="+СтрЗаменить(ТелефонОрганизации," ",""))+"=";
					//КонецЕсли;	
				КонецЕсли;
				//КонецЕсли;
				ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, СтрокаФайла);
				если не КатегорияВывод= "ДОГОВОР" Тогда
					СтрокаЗар = СтрокаЗар + ">";
					ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
				КонецЕсли;
				
			КонецЕсли;
			если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
				если не КатегорияВывод= "ДОГОВОР" Тогда
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
				иначе
					ИтогДохода = ИтогДохода + РаботДоходСлед;
					ИтогБольн = ИтогБольн + РаботБольнСлед;
					ИтогВзнос = ИтогВзнос + РаботВзносСлед;
				КонецЕсли;
			иначе
				если КатегорияВывод= "ДОГОВОР" Тогда
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					
				иначе
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; 
		Дбф.ЗакрытьФайл();
		//Островская Татьяна 25.10.2012 № 15
		//Островская Татьяна 17.01.2013 № 16153
		если не КатегорияВывод= "ДОГОВОР" Тогда
			
			СтрокаФайла = "ТИПД=ПУ-3="+СокрЛП(Строка(КоличествоДокументов))+"="+ ?(ИтогДохода = 0, "0", СокрЛП(Строка(Формат(ИтогДохода,"ЧГ=0"))))+"="+
			?(ИтогБольн = 0, "0", СокрЛП(Строка(Формат(ИтогБольн,"ЧГ=0"))))+"="+
			?(ИтогВзнос = 0, "0", СокрЛП(Строка(Формат(ИтогВзнос,"ЧГ=0"))))+"=0=>";//Островская Татьяна 17.01.2013 № 16153
		Иначе 
			СтрокаФайла = "ТИПД=ПУ-3="+СокрЛП(Строка(КоличествоДокументов))+"="+ ?(ИтогДохода = 0, " ", СокрЛП(Строка(Формат(ИтогДохода,"ЧГ=0"))))+"="+
			?(ИтогБольн = 0, " ", СокрЛП(Строка(Формат(ИтогБольн,"ЧГ=0"))))+"="+
			?(ИтогВзнос = 0, " ", СокрЛП(Строка(Формат(ИтогВзнос,"ЧГ=0"))))+"=0=>"; //Островская Татьяна 17.01.2013 № 16153
		КонецЕсли;	
		
		//Островская Татьяна 17.01.2013 № 16153
		
		
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ЗаменитьСтроку(3, СтрокаФайла);
		
		//толик проверка ФСЗН дбф	
		//ДоходыПоВидамЗаГод =
		//"ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК Больничные,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК СуммаДохода,
		//|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//|	34 КАК ПроцентФСЗН,
		//|	ЕСНСведенияОДоходах.Период КАК ПериодРегистрации
		//|ИЗ
		//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|			34 КАК ПроцентФСЗН,
		//|			СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//|			СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//|			ЕСНИсчисленный.Период КАК Период
		//|		ИЗ
		//|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|		ГДЕ
		//|			ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		//|			И ЕСНИсчисленный.Организация = &Организация
		//|			И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ЕСНИсчисленный.ФизЛицо,
		//|			ЕСНИсчисленный.Период) КАК ЕСНИсчисленный
		//|		ПО ЕСНСведенияОДоходах.ФизЛицо = ЕСНИсчисленный.ФизЛицо
		//|			И ЕСНСведенияОДоходах.Период = ЕСНИсчисленный.Период
		//|ГДЕ
		//|	ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		//|	И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЕСНСведенияОДоходах.ФизЛицо,
		//|	ЕСНИсчисленный.ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд,
		//|	ЕСНИсчисленный.ПроцентФСЗН,
		//|	ЕСНСведенияОДоходах.Период";
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И (ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		|				ИЛИ ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		ЕСНИсчисленный.Период,
		|		ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ
		
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		|		КОНЕЦ,
		|		34,
		|		NULL,
		|		NULL,
		|		ЕСНСведенияОДоходах.Период
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И (ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		|				ИЛИ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП)
		|	СГРУППИРОВАТЬ ПО
		|	ЕСНСведенияОДоходах.ФизЛицо,
		|	ЕСНСведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		|	КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|	УПОРЯДОЧИТЬ ПО
		|	ПериодРегистрации";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		ПромежуточнаяТаблица = Запрос.Выполнить().Выгрузить();
		
		//формируем файл
		
		Дбф=Новый XBase();
		Дбф.Кодировка=КодировкаXBase.OEM;
		Дбф.Поля.Добавить("Tab_nom", "S", 10);
		Дбф.Поля.Добавить("FIO", "S", 50);
		Дбф.Поля.Добавить("Datr", "D");
		Дбф.Поля.Добавить("Dato", "D");
		Дбф.Поля.Добавить("Sm", "N", 12);
		Дбф.Поля.Добавить("Bl", "N", 12);
		Дбф.Поля.Добавить("Vz", "N", 12);
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьКФайламБанк;
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			Дбф.СоздатьФайл(ПутьКФайлу+"\Vznosy.DBF");
		иначе
			РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
			б = Сред(РабочийКаталог,7);
			в = Найти(б,Символ(34));
			путьИБ = Лев(б, в-1);
			
			Дбф.СоздатьФайл(путьИБ+"\Vznosy.DBF");
		КонецЕсли;
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		
		Для Каждого мСтрока из ПромежуточнаяТаблица Цикл
			Дбф.Добавить();
			Дбф.УстановитьЗначениеПоля("FIO", СокрЛП(Строка(мСтрока.ФизЛицо)));
			Дбф.УстановитьЗначениеПоля("Datr", мСтрока.ПериодРегистрации);
			Дбф.УстановитьЗначениеПоля("Dato", мСтрока.ПериодВзаиморасчетов);
			Дбф.УстановитьЗначениеПоля("Sm", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.СуммаДохода=Null, 0, мСтрока.СуммаДохода), мСтрока.ПериодРегистрации));//О.Т. Аверсон 14.03.2016 № 949
			Дбф.УстановитьЗначениеПоля("Bl", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.Больничные=Null, 0, мСтрока.Больничные), мСтрока.ПериодРегистрации)); //О.Т. Аверсон 14.03.2016 № 949
			Дбф.УстановитьЗначениеПоля("Vz", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.ФСЗН=Null, 0, мСтрока.ФСЗН) + ?(мСтрока.ПенсионныйФонд=Null, 0, мСтрока.ПенсионныйФонд), мСтрока.ПериодРегистрации));//О.Т. Аверсон 14.03.2016 № 949
			Дбф.Записать();
		КонецЦикла;
		Дбф.ЗакрытьФайл();
		Предупреждение("Данные сформированы !!!");
		
		
		
		Возврат ТекстФайла.ПолучитьТекст();
	КонецФункции 
	
	// + СВЭЙ КДЯ 31.07.19 СВФР-004561
	Функция ПолучитьРасшифрованнуюПромежуточнуюТаблицу( ПромежуточнаяТаблица, ТребуемыеРасшифровкиПересекающихсяДоговоров )
		Перем РасшифрованнаяПромежуточнаяТаблица;
		
		если ДогПодряда или ВсеСотрудники Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВЫРАЗИТЬ(ТаблицаРабот.ФизЛицо КАК Справочник.ФизическиеЛица) КАК ФизЛицо,
			               |	ВЫРАЗИТЬ(ТаблицаРабот.НачалоРабот КАК ДАТА) КАК НачалоРабот,
			               |	ВЫРАЗИТЬ(ТаблицаРабот.ОкончаниеРабот КАК ДАТА) КАК ОкончаниеРабот
			               |ПОМЕСТИТЬ ВТ_ТаблицаРабот
			               |ИЗ
			               |	&ТаблицаРабот КАК ТаблицаРабот
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВЫБОР
			               |		КОГДА НачисленияПоДоговорам.ДокументОснование.НомерДляПу = """"
			               |			ТОГДА НачисленияПоДоговорам.ДокументОснование.Номер
			               |		ИНАЧЕ НачисленияПоДоговорам.ДокументОснование.НомерДляПу
			               |	КОНЕЦ КАК НомерДокумента,
			               |	ВЫБОР
			               |		КОГДА НачисленияПоДоговорам.ДокументОснование.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
			               |			ТОГДА НачисленияПоДоговорам.ДокументОснование.Дата
			               |		ИНАЧЕ НачисленияПоДоговорам.ДокументОснование.ДатаПУ
			               |	КОНЕЦ КАК ДатаДокумента,
			               |	НАЧАЛОПЕРИОДА(НачисленияПоДоговорам.ДатаНачала, МЕСЯЦ) КАК Период,
			               |	НачисленияПоДоговорам.ДатаНачала КАК НачалоРабот,
			               |	НачисленияПоДоговорам.ДатаОкончания КАК ОкончаниеРабот,
			               |	СУММА( НачисленияПоДоговорам.Результат ) КАК СуммаДохода,
			               |	НачисленияПоДоговорам.Физлицо
			               |ИЗ
			               |	Документ.НачислениеЗарплатыРаботникамОрганизаций.ДоговорыНаВыполнениеРабот КАК НачисленияПоДоговорам
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРабот КАК ТаблицаРабот
			               |		ПО НачисленияПоДоговорам.Физлицо = ТаблицаРабот.ФизЛицо
			               |			И (НАЧАЛОПЕРИОДА(НачисленияПоДоговорам.ДатаНачала, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТаблицаРабот.НачалоРабот, МЕСЯЦ))
			               |			И (КОНЕЦПЕРИОДА(НачисленияПоДоговорам.ДатаОкончания, МЕСЯЦ) = КОНЕЦПЕРИОДА(ТаблицаРабот.ОкончаниеРабот, МЕСЯЦ))
			               |			И (НачисленияПоДоговорам.Ссылка.Проведен)
			               |			И (НачисленияПоДоговорам.Ссылка.Организация = &Организация)
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВЫБОР
			               |		КОГДА НачисленияПоДоговорам.ДокументОснование.НомерДляПу = """"
			               |			ТОГДА НачисленияПоДоговорам.ДокументОснование.Номер
			               |		ИНАЧЕ НачисленияПоДоговорам.ДокументОснование.НомерДляПу
			               |	КОНЕЦ,
			               |	ВЫБОР
			               |		КОГДА НачисленияПоДоговорам.ДокументОснование.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
			               |			ТОГДА НачисленияПоДоговорам.ДокументОснование.Дата
			               |		ИНАЧЕ НачисленияПоДоговорам.ДокументОснование.ДатаПУ
			               |	КОНЕЦ,
			               |	НАЧАЛОПЕРИОДА(НачисленияПоДоговорам.ДатаНачала, МЕСЯЦ),
			               |	НачисленияПоДоговорам.ДатаНачала,
			               |	НачисленияПоДоговорам.ДатаОкончания,
			               |	НачисленияПоДоговорам.Физлицо";
			
			Запрос.УстановитьПараметр( "Организация", Организация );
			Запрос.УстановитьПараметр( "ТаблицаРабот", ТребуемыеРасшифровкиПересекающихсяДоговоров );
			ТЗ_Расшифровки = Запрос.Выполнить().Выгрузить();
			
			РасшифрованнаяПромежуточнаяТаблица = ПромежуточнаяТаблица.СкопироватьКолонки();
			//РасшифрованнаяПромежуточнаяТаблица.Колонки.Добавить( "ПериодРегистрации" );
			//РасшифрованнаяПромежуточнаяТаблица.Колонки.Добавить( "ПериодВзаиморасчетов" );
			
			Отбор = Новый Структура( "ФизЛицо, Период" );
			
			Для каждого Стр Из ПромежуточнаяТаблица Цикл
				
				ЗаполнитьЗначенияСвойств( Отбор, Стр );
				НайдРасшифровки = ТЗ_Расшифровки.НайтиСтроки( Отбор );
				Если НайдРасшифровки.Количество() = 0 Тогда
					НовСтр = РасшифрованнаяПромежуточнаяТаблица.Добавить();
					ЗаполнитьЗначенияСвойств( НовСтр, Стр );
				Иначе
					Сч = 0;
					Для каждого СтрРасш Из НайдРасшифровки Цикл
						НовСтр = РасшифрованнаяПромежуточнаяТаблица.Добавить();
						НовСтр.Больничные = 0;
						//Вся сумма колонки "Больничные" остается в первой строке расшифровок за месяц (за период)
						ЗаполнитьЗначенияСвойств( НовСтр, Стр, , ?( Сч = 0, "", "Больничные" ) );
						//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
						//ЗаполнитьЗначенияСвойств( НовСтр, СтрРасш, "НомерДокумента, СуммаДохода", "ПенсионныйФонд, ФСЗН" );
						//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
						//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
						ЗаполнитьЗначенияСвойств( НовСтр, СтрРасш, "НомерДокумента, ДатаДокумента, СуммаДохода", "ПенсионныйФонд, ФСЗН" );
						//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
						НовСтр.НомерДокумента = СокрЛП( НовСтр.НомерДокумента );
						НовСтр.ПенсионныйФонд = Окр( НовСтр.СуммаДохода / 100, 2 ) ;
						//+ СВЭЙ КДЯ 21.10.19 СВФР-004944
						//НовСтр.ФСЗН = Окр( НовСтр.СуммаДохода * Стр.ПроцентФСЗН / 100, 2 ) ;
						//- СВЭЙ КДЯ 21.10.19 СВФР-004944
						//+ СВЭЙ КДЯ 21.10.19 СВФР-004944
						НовСтр.ФСЗН = Окр( НовСтр.СуммаДохода * ?( ЗначениеЗаполнено( Стр.ПроцентФСЗН ), Стр.ПроцентФСЗН, 1 ) / 100, 2 ) ;
						//- СВЭЙ КДЯ 21.10.19 СВФР-004944
						
						
						Сч = Сч + 1;
					КонецЦикла; // СтрРасш Из НайдРасшифровки
				КонецЕсли; 
				
			КонецЦикла; // Стр Из ПромежуточнаяТаблица
			
		иначе
			РасшифрованнаяПромежуточнаяТаблица = ПромежуточнаяТаблица;
		конецесли; //  ДогПодряда или ВсеСотрудники
	
		РасшифрованнаяПромежуточнаяТаблица.Сортировать( "ДатаДокумента,НомерДокумента" );	
		Возврат РасшифрованнаяПромежуточнаяТаблица;
	КонецФункции // ПолучитьРасшифрованнуюПромежуточнуюТаблицу
	// - СВЭЙ КДЯ 31.07.19 СВФР-004561
	
	//+ СВЭЙ КДЯ 09.09.19 СВФР-004631 ( пункт 20. )
	Функция СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, ИдентификацияДоговораПоРеквизитам = Ложь )
		Перем Значениефункции;
		
		// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
		//Значениефункции =
		//		  ?( ЗначениеЗаполнено( СтрокаСтаж.Договор ),
		//		  
		//		        //а) договор заполнен:
		//				ПолучитьНомерДокументаДляПУ( СтрокаСтаж.Договор ) = СтрокаМес.НомерДокумента
		//				ИЛИ ПолучитьДатуДокументаДляПУ( СтрокаСтаж.Договор ) = СтрокаМес.ДатаДокумента,
		//				
		//				//б) договор не заполнен:
		//				НачалоМесяца( СтрокаСтаж.ДатаНачалаРабот ) <= НачалоМесяца( СтрокаМес.ДатаДокумента ) 
		//				И СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента 
		//			);
		// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
				
		// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
		Если ИдентификацияДоговораПоРеквизитам Тогда
			Значениефункции =
						СтрокаСтаж.НомерДокумента  = СтрокаМес.НомерДокумента
						И СтрокаСтаж.ДатаДляПУ = СтрокаМес.ДатаДокумента
						И СтрокаСтаж.ФизЛицо = СтрокаМес.ФизЛицо;
		Иначе	
			Значениефункции =
					
					  ?( ЗначениеЗаполнено( СтрокаСтаж.Договор ),
					  
					        //а) договор заполнен:
							ПолучитьНомерДокументаДляПУ( СтрокаСтаж.Договор ) = СтрокаМес.НомерДокумента
							ИЛИ ПолучитьДатуДокументаДляПУ( СтрокаСтаж.Договор ) = СтрокаМес.ДатаДокумента,
							
							//б) договор не заполнен:
							НачалоМесяца( СтрокаСтаж.ДатаНачалаРабот ) <= НачалоМесяца( СтрокаМес.ДатаДокумента ) 
							И СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента 
					  );
		КонецЕсли; 
		
		// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
				
		Возврат Значениефункции;
	
	КонецФункции // СтрокаСтажаСоответствуетСтрокеДоговора()
	//- СВЭЙ КДЯ 09.09.19 СВФР-004631 ( пункт 20. )
	
	
	Функция  ПолучитьДоходыПоВидамЗаГод( Запрос )
		
		// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
		////О.Т. Аверсон 23.08.2018 № 2335
		//// Выборка списка физлиц, для которых надо получать доходы
		//СписокФизлицТекст = "ВЫБРАТЬ 
		//|	ТЧРаботникиОрганизации.ФизЛицо
		//|ИЗ
		//|	Документ.СведенияОЗаработкеРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|
		//|ГДЕ
		//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		//
		//Если ВыгрузкаДоговоровПодрядаБезОграничения Тогда //О.Т. Аверсон 22.08.2018 № 2335
		//	ДоходыПоВидамЗаГод =
		//	
		//	"ВЫБРАТЬ
		//	|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		//	|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		//	|	ОбщаяТаблицаФСЗН.ФизЛицо,
		//	|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		//	// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	НАЧАЛОПЕРИОДА( ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов, МЕСЯЦ ) КАК ПериодВзаиморасчетов,
		//	|	НАЧАЛОПЕРИОДА( ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов, МЕСЯЦ ) КАК ПериодРегистрации,
		//	// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//	|	Выразить(СУММА(ОбщаяТаблицаФСЗН.СуммаДохода)*&СтавкаПенс/100 как число(15,2)) КАК ПенсионныйФонд,
		//	|	Выразить(СУММА(ОбщаяТаблицаФСЗН.СуммаДохода)*&СтавкаФСЗН/100 как число(15,2)) КАК ФСЗН,
		//	|	ВложенныйЗапрос.ВидДоговора,
		//	|	ВложенныйЗапрос.ДоговорНомер КАК НомерДокумента,
		//	|	ВложенныйЗапрос.ДоговорДата КАК ДатаДокумента,
		//	|	ОбщаяТаблицаФСЗН.ДокументОснование,
		//	|	ВложенныйЗапрос.ПричиныМинимальнойЗП
		//	|ИЗ
		//	|	(ВЫБРАТЬ
		//	|		NULL КАК Больничные,
		//	|		СУММА(ВЫБОР
		//	|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		//	|						И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		//	|					ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
		//	|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		//	|			КОНЕЦ) КАК СуммаДохода,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		//	|		КОНЕЦ КАК ПериодВзаиморасчетов,
		//	|		34 КАК ПроцентФСЗН,
		//	|		0 КАК ПенсионныйФонд,
		//	|		0 КАК ФСЗН,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ДокументОснование как ДокументОснование
		//	|	ИЗ
		//	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		//	|	ГДЕ
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//	|		И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо В(" + СписокФизлицТекст + ")
		//	
		//	|		И ВЫБОР
		//	|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоНП И &КонецНП
		//	|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоНП И &КонецНП
		//	|			КОНЕЦ
		//	|		И ДополнительныеНачисленияРаботниковОрганизаций.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ДоговорНаВыполнениеРаботСФизЛицом.ПустаяСсылка)
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		//	|		КОНЕЦ,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ДокументОснование
		//	|	
		//	|	ОБЪЕДИНИТЬ ВСЕ
		//	|	
		//	|	ВЫБРАТЬ
		//	|		СУММА(ВЫБОР
		//	|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СпособРасчета)
		//	|					ТОГДА ВЫБОР
		//	|							КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
		//	|									И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
		//	|								ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
		//	|							ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
		//	|						КОНЕЦ
		//	|				ИНАЧЕ 0
		//	|			КОНЕЦ),
		//	|		NULL,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		//	|		КОНЕЦ,
		//	|		34,
		//	|		0,
		//	|		0,
		//	|		Null
		//	|	ИЗ
		//	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		//	|	ГДЕ
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//	|		И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо В(" + СписокФизлицТекст + ")
		//	
		//	|		И ВЫБОР
		//	|				КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоНП И &КонецНП
		//	|				ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало МЕЖДУ &НачалоНП И &КонецНП
		//	|			КОНЕЦ
		//	|		И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СпособРасчета)
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ)
		//	|		КОНЕЦ,
		//	|		ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо) КАК ОбщаяТаблицаФСЗН
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ФизЛицо КАК ФизЛицо,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Месяц КАК Месяц,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ВидДоговора КАК ВидДоговора,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ПричиныМинимальнойЗП КАК ПричиныМинимальнойЗП, //О.Т. Аверсон 15.03.2019 № 4091
		//	//О.Т. Аверсон 31.01.2019 № 3056
		//	|		ВЫБОР
		//	|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу = """"
		//	|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.Номер
		//	|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу
		//	|		КОНЕЦ КАК ДоговорНомер,
		//	|		ВЫБОР
		//	|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
		//	|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаНачала
		//	|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ
		//	|		КОНЕЦ КАК ДоговорДата
		//	//О.Т. Аверсон 31.01.2019 № 3056
		//	|		ИЗ
		//	|			Документ.СведенияОЗаработкеРаботниковДПУ.СведенияОВзносах КАК СведенияОЗаработкеРаботниковДПУСведенияОВзносах
		//	|		ГДЕ
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Ссылка = &ДокументСсылка) КАК ВложенныйЗапрос
		//	|		ПО ОбщаяТаблицаФСЗН.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		//	|			И ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов = ВложенныйЗапрос.Месяц
		//	|		И (ВЫБОР
		//	|			КОГДА НЕ ЕСТЬNULL(ОбщаяТаблицаФСЗН.ДокументОснование, 0) = 0
		//	|				ТОГДА ОбщаяТаблицаФСЗН.ДокументОснование.Номер = ВложенныйЗапрос.ДоговорНомер
		//	|						И ОбщаяТаблицаФСЗН.ДокументОснование.ДатаНачала = ВложенныйЗапрос.ДоговорДата
		//	|		КОНЕЦ)

		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ОбщаяТаблицаФСЗН.ФизЛицо,
		//	|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		//	// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	НАЧАЛОПЕРИОДА( ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов, МЕСЯЦ ),
		//	|	НАЧАЛОПЕРИОДА( ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов, МЕСЯЦ ),
		//	// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//	|	ВложенныйЗапрос.ВидДоговора,
		//	|	ВложенныйЗапрос.ДоговорНомер,
		//	|	ВложенныйЗапрос.ДоговорДата,
		//	|	ОбщаяТаблицаФСЗН.ДокументОснование,
		//	|	ВложенныйЗапрос.ПричиныМинимальнойЗП
		//	|
		//	|УПОРЯДОЧИТЬ ПО
		//	|	Период,
		//	|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование"
		//	
		//иначе
		//	
		//	ДоходыПоВидамЗаГод =
		//	//"ВЫБРАТЬ
		//	//|	СУММА(ВЫБОР
		//	//|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
		//	//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//	//|			ИНАЧЕ 0
		//	//|		КОНЕЦ) КАК Больничные,
		//	//|	СУММА(ВЫБОР
		//	//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//	//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//	//|			ИНАЧЕ 0
		//	//|		КОНЕЦ) КАК СуммаДохода,
		//	//|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//	//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) КАК Период,
		//	//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		//	//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//	//|	34 КАК ПроцентФСЗН
		//	//|ИЗ
		//	//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//	//|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//	//|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//	//|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		//	//|			34 КАК ПроцентФСЗН,
		//	//|			СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	//|			СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН
		//	//|		ИЗ
		//	//|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//	//|		ГДЕ
		//	//|			ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		//	//|			И ЕСНИсчисленный.Организация = &Организация
		//	//|			И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//	//|		
		//	//|		СГРУППИРОВАТЬ ПО
		//	//|			ЕСНИсчисленный.ФизЛицо,
		//	//|			НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)) КАК ЕСНИсчисленный
		//	//|		ПО ЕСНСведенияОДоходах.ФизЛицо = ЕСНИсчисленный.ФизЛицо
		//	//|			И (НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ЕСНИсчисленный.ПериодВзаиморасчетов)
		//	//|ГДЕ
		//	//|	ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		//	//|	И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//	//|
		//	//|СГРУППИРОВАТЬ ПО
		//	//|	ЕСНСведенияОДоходах.ФизЛицо,
		//	//|	НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	//|	ЕСНИсчисленный.ФСЗН,
		//	//|	ЕСНИсчисленный.ПенсионныйФонд";
		//	"ВЫБРАТЬ
		//	|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		//	|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		//	|	ВложенныйЗапрос.ФизЛицо как ФизЛицо,
		//	|	ВложенныйЗапрос.Месяц КАК Период,
		//	// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	НАЧАЛОПЕРИОДА( ВложенныйЗапрос.Месяц, МЕСЯЦ ) КАК ПериодВзаиморасчетов,
		//	|	НАЧАЛОПЕРИОДА( ВложенныйЗапрос.Месяц, МЕСЯЦ ) КАК ПериодРегистрации,
		//	// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//	|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		//	|	ВложенныйЗапрос.ВидДоговора,
		//	|	ВложенныйЗапрос.ДоговорНомер КАК НомерДокумента,
		//	|	ВложенныйЗапрос.ДоговорДата КАК ДатаДокумента,
		//	|	ВложенныйЗапрос.ПричиныМинимальнойЗП
		//	|ИЗ
		//	|		(ВЫБРАТЬ
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ФизЛицо КАК ФизЛицо,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Месяц КАК Месяц,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ВидДоговора КАК ВидДоговора,
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.ПричиныМинимальнойЗП КАК ПричиныМинимальнойЗП, //О.Т. Аверсон 15.03.2019 № 4091
		//	//О.Т. Аверсон 31.01.2019 № 3056
		//	|		ВЫБОР
		//	|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу = """"
		//	|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.Номер
		//	|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.НомерДляПу
		//	|		КОНЕЦ КАК ДоговорНомер,
		//	|		ВЫБОР
		//	|		КОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
		//	|			ТОГДА СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаНачала
		//	|		ИНАЧЕ СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Договор.ДатаПУ
		//	|		КОНЕЦ КАК ДоговорДата
		//	//О.Т. Аверсон 31.01.2019 № 3056
		//	|		ИЗ
		//	|			Документ.СведенияОЗаработкеРаботниковДПУ.СведенияОВзносах КАК СведенияОЗаработкеРаботниковДПУСведенияОВзносах
		//	|		ГДЕ
		//	|			СведенияОЗаработкеРаботниковДПУСведенияОВзносах.Ссылка = &ДокументСсылка) КАК ВложенныйЗапрос

		//	|		ЛЕВОЕ СОЕДИНЕНИЕ 

		//	|	(ВЫБРАТЬ
		//	|		NULL КАК Больничные,
		//	|		NULL КАК СуммаДохода,
		//	|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		//	|		КОНЕЦ КАК ПериодВзаиморасчетов,
		//	|		34 КАК ПроцентФСЗН,
		//	|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//	|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//	|	ГДЕ
		//	|		ЕСНИсчисленный.Организация = &Организация
		//	|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//	|		И ВЫБОР
		//	|				КОГДА ЕСНИсчисленный.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|					ТОГДА ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		//	|				ИНАЧЕ ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		//	|			КОНЕЦ
		//	
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		ЕСНИсчисленный.ФизЛицо,
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		//	|		КОНЕЦ
		//	|	
		//	|	ОБЪЕДИНИТЬ ВСЕ
		//	|	
		//	|	ВЫБРАТЬ
		//	|		СУММА(ВЫБОР
		//	|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 03.04.2019 № 3224
		//	|				и НЕ ЕСНСведенияОДоходах.ВидРасчета ССЫЛКА ПланВидовРасчета.ДополнительныеНачисленияОрганизаций
		//	|			ТОГДА ВЫБОР
		//	|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
		//	|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
		//	|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
		//	|					ИНАЧЕ ЕСНСведенияОДоходах.Результат конец
		//	
		//	|				ИНАЧЕ 0
		//	|			КОНЕЦ),
		//	|		СУММА(ВЫБОР
		//	|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//	
		//	|			ТОГДА ВЫБОР
		//	|					КОГДА ЕСНСведенияОДоходах.Период < ДАТАВРЕМЯ(2016, 7, 1)
		//	|							И ЕСНСведенияОДоходах.ПериодВзаиморасчетов >= ДАТАВРЕМЯ(2016, 7, 1)
		//	|						ТОГДА ВЫРАЗИТЬ(ЕСНСведенияОДоходах.Результат / 10000 КАК ЧИСЛО(15, 2))
		//	|					ИНАЧЕ ЕСНСведенияОДоходах.Результат конец
		//	
		//	|				ИНАЧЕ 0
		//	|			КОНЕЦ),
		//	|		ЕСНСведенияОДоходах.ФизЛицо,
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		//	|			ИНАЧЕ ВЫБОР
		//	|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
		//	|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		//	|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		//	|		КОНЕЦ
		//	|		КОНЕЦ,
		//	|		34,
		//	|		NULL,
		//	|		NULL
		//	|	ИЗ
		//	|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//	|	ГДЕ
		//	|		ЕСНСведенияОДоходах.Организация = &Организация
		//	|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//	|		И ВЫБОР
		//	|				КОГДА ЕСНСведенияОДоходах.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|					ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		//	|				ИНАЧЕ выбор когда ЕСНСведенияОДоходах.ВидРасчета в (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
		//	|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		//	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) конец  МЕЖДУ &НачалоНП И &КонецНП
		//	|		КОНЕЦ
		//	
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		ЕСНСведенияОДоходах.ФизЛицо,
		//	|		ЕСНСведенияОДоходах.ВидРасчета,
		//	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ),
		//	|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		//	|		ВЫБОР
		//	|			КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//	|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		//	|			ИНАЧЕ ВЫБОР
		//	|		КОГДА ЕСНСведенияОДоходах.ВидРасчета В (&ВидРасчетаПремия) //О.Т. Аверсон 14.03.2019 № 4054 3ч
		//	|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		//	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		//	|	КОНЕЦ
		//	|		КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		//	
		//	|		ПО ОбщаяТаблицаФСЗН.ФизЛицо = ВложенныйЗапрос.ФизЛицо
		//	|			И ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов = ВложенныйЗапрос.Месяц
		//	
		//	|
		//	|СГРУППИРОВАТЬ ПО   
		//	|	ВложенныйЗапрос.ФизЛицо,
		//	|	ВложенныйЗапрос.Месяц,
		//	// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	НАЧАЛОПЕРИОДА( ВложенныйЗапрос.Месяц, МЕСЯЦ ),
		//	|	НАЧАЛОПЕРИОДА( ВложенныйЗапрос.Месяц, МЕСЯЦ ),
		//	// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		//	|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//	|	ВложенныйЗапрос.ВидДоговора,
		//	|	ВложенныйЗапрос.ПричиныМинимальнойЗП,
		//	|	ВложенныйЗапрос.ДоговорНомер,
		//	|	ВложенныйЗапрос.ДоговорДата
		//	|	УПОРЯДОЧИТЬ ПО
		//	|	Период,
		//	|	ВложенныйЗапрос.ФизЛицо.Наименование";
		//	
		//	
		//КонецЕсли;
		//Запрос.Текст = ДоходыПоВидамЗаГод;
		// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
		
		// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. ) -
		Запрос.УстановитьПараметр( "ДокументСсылка", Ссылка );
		Запрос.Текст = 
		            "ВЫБРАТЬ
		            |	СведенияОВзносах.ФизЛицо КАК ФизЛицо,
		            |	НАЧАЛОПЕРИОДА(СведенияОВзносах.Месяц, МЕСЯЦ) КАК Период,
		            |	НАЧАЛОПЕРИОДА(СведенияОВзносах.Месяц, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		            |	НАЧАЛОПЕРИОДА(СведенияОВзносах.Месяц, МЕСЯЦ) КАК ПериодРегистрации,
		            |	СведенияОВзносах.Выплаты КАК СуммаДохода,
		            |	ВЫБОР КОГДА СведенияОВзносах.Взносы > (ВЫРАЗИТЬ(СведенияОВзносах.Выплаты * &СтавкаПенс / 100 КАК ЧИСЛО(15, 2)))
					|   	ТОГДА  СведенияОВзносах.Взносы - (ВЫРАЗИТЬ(СведенияОВзносах.Выплаты * &СтавкаПенс / 100 КАК ЧИСЛО(15, 2)))
					|       ИНАЧЕ  0
					|	КОНЕЦ КАК ФСЗН,
		            |	СведенияОВзносах.Договор КАК ДокументОснование,
		            |	СведенияОВзносах.ВидДоговора,
					|		ВЫБОР
					//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ IS NULL 
					|			ТОГДА """"
					//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
					|		КОГДА СведенияОВзносах.Договор.НомерДляПу = """"
					|			ТОГДА СведенияОВзносах.Договор.Номер
					|		ИНАЧЕ СведенияОВзносах.Договор.НомерДляПу
					|		КОНЕЦ КАК НомерДокумента,
					|		ВЫБОР
					//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ IS NULL 
					|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
					//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
					|			ТОГДА СведенияОВзносах.Договор.ДатаНачала
					|		ИНАЧЕ СведенияОВзносах.Договор.ДатаПУ
					|		КОНЕЦ КАК ДатаДокумента,
		            |	СведенияОВзносах.Пособия КАК Больничные,
		            |	ВЫБОР КОГДА СведенияОВзносах.Взносы >= ВЫРАЗИТЬ(СведенияОВзносах.Выплаты * &СтавкаПенс / 100 КАК ЧИСЛО(15, 2))
					|   	ТОГДА  ВЫРАЗИТЬ(СведенияОВзносах.Выплаты * &СтавкаПенс / 100 КАК ЧИСЛО(15, 2))
					|       ИНАЧЕ  СведенияОВзносах.Взносы
					|	КОНЕЦ КАК ПенсионныйФонд,
					//|	ВЫРАЗИТЬ(СведенияОВзносах.Выплаты * &СтавкаПенс / 100 КАК ЧИСЛО(15, 2)) КАК ПенсионныйФонд,
		            |	СведенияОВзносах.ПричиныМинимальнойЗП КАК ПричиныМинимальнойЗП,
		            |	&СтавкаФСЗН КАК ПроцентФСЗН
		            |ИЗ
		            |	Документ.СведенияОЗаработкеРаботниковДПУ.СведенияОВзносах КАК СведенияОВзносах
		            |ГДЕ
		            |	СведенияОВзносах.Ссылка = &ДокументСсылка
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ФизЛицо,
					// + СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					|	ВЫБОР
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ IS NULL 
					|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
					|			ТОГДА СведенияОВзносах.Договор.ДатаНачала
					|		ИНАЧЕ СведенияОВзносах.Договор.ДатаПУ
					|	КОНЕЦ, // КАК ДатаДокумента
					|	ВЫБОР
					|		КОГДА СведенияОВзносах.Договор.ДатаПУ IS NULL 
					|			ТОГДА """"
					|		КОГДА СведенияОВзносах.Договор.НомерДляПу = """"
					|			ТОГДА СведенияОВзносах.Договор.Номер
					|		ИНАЧЕ СведенияОВзносах.Договор.НомерДляПу
					|	КОНЕЦ,  // КАК НомерДокумента
					// - СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
		            |	Период
					|";
		// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
		
		ПромежуточнаяТаблица = Запрос.Выполнить().Выгрузить();
		Возврат ПромежуточнаяТаблица;
		
	КонецФункции // ПолучитьДоходыПоВидамЗаГод	

	//+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
	Функция ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже, НомерДоговора = Неопределено, ДатаДоговора = Неопределено )
		
		ЗапросНеОплДог = Новый Запрос;
		ЗапросНеОплДог.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросНеОплДог.Текст = "
		| ВЫБРАТЬ 
		| 	СведенияОСтаже.ФизЛицо,
		| 	СведенияОСтаже.НомерДокумента,
		| 	СведенияОСтаже.ДатаДокумента,
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
		|	СведенияОСтаже.ДатаДляПУ, 
		//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
		| 	ВЫРАЗИТЬ( СведенияОСтаже.ВидДеятельности КАК СТРОКА(8) ) КАК ВидДеятельности
		|   ПОМЕСТИТЬ ВтСведенияОСтаже
		| ИЗ 
		|	&СведенияОСтаже КАК СведенияОСтаже
		|;
		| ВЫБРАТЬ ПЕРВЫЕ 1
		| 	СведенияОСтаже.ФизЛицо
		| ИЗ 
		|	ВтСведенияОСтаже КАК СведенияОСтаже
		| ГДЕ 
		|	СведенияОСтаже.НомерДокумента = &НомерДокумента 
		|	И ( НАЧАЛОПЕРИОДА( СведенияОСтаже.ДатаДокумента, ДЕНЬ ) = &ДатаДокумента
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
		|		ИЛИ НАЧАЛОПЕРИОДА( СведенияОСтаже.ДатаДляПУ, ДЕНЬ ) = &ДатаДокумента 
		//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
		|	)
		|	И СведенияОСтаже.ФизЛицо = &ФизЛицо
		|	И СведенияОСтаже.ВидДеятельности = ""НЕОПЛДОГ""
		|";
		ЗапросНеОплДог.УстановитьПараметр( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
		ЗапросНеОплДог.УстановитьПараметр( "НомерДокумента", ?( ЗначениеЗаполнено( НомерДоговора ), НомерДоговора, СтрокаМес.НомерДокумента ) );
		ЗапросНеОплДог.УстановитьПараметр( "ДатаДокумента", НачалоДня( ?( ЗначениеЗаполнено( ДатаДоговора ), ДатаДоговора, СтрокаМес.ДатаДокумента ) ) );
		ЗапросНеОплДог.УстановитьПараметр( "СведенияОСтаже", ТЗ_СведенияОСтаже );
		ЕстьНеоплДог = НЕ ЗапросНеОплДог.Выполнить().Пустой();
		
		Возврат ЕстьНеоплДог;
		
	КонецФункции
	//- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

	
	Функция СформироватьВыходнойФайл1(Отказ) Экспорт
		
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		ИмяФайлаПачки = ПроцедурыПерсонифицированогоУчета.ПолучитьИмяФайлаФормыПУ( 3, 
			?( Отменяющая, 2, ?( НазначениеПенсии, 3, 1 ) ), ДатаОкончания, Организация );
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		
		мДлинаСуток = 86400;
		ЕстьНеоплДог = Ложь;
		//+ СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )
		Дети = Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ДЕТИ" );
		//- СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )

		
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);                  
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
			Отказ = Истина;
			Возврат "";
		КонецЕсли;	
		
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		//О.Т. Аверсон 14.05.2019 № 4328
		НеоплДог = Справочники.ОсобыеУсловияТруда.НайтиПоКоду("НЕОПЛДОГ");
		Если НеоплДог.Пустая() тогда
			НеоплДогОбъект = Справочники.ОсобыеУсловияТруда.СоздатьЭлемент();
			НеоплДогОбъект.Код = "НЕОПЛДОГ";
			НеоплДогОбъект.Наименование = "Неопл.дог";
			НеоплДогОбъект.Записать();
			НеоплДог = НеоплДогОбъект.Ссылка;
		КонецЕсли;
		
		//О.Т. Аверсон 14.05.2019 № 4328

		
		Результат					=	СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации			=	Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
		ЗапросОрг = Новый Запрос;
		ЗапросОрг.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Объект
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид
		|	И КонтактнаяИнформация.Объект.Код = &Код";
		ЗапросОрг.УстановитьПараметр("Объект", ВыборкаПоШапкеДокумента.Организация);
		ЗапросОрг.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
		ЗапросОрг.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		ЗапросОрг.УстановитьПараметр("Код", ВыборкаПоШапкеДокумента.Организация.Код);
		РезОрг = ЗапросОрг.Выполнить().Выбрать();
		ТелефонОрганизации = "";
		Если РезОрг.Следующий() Тогда 
			ТелефонОрганизации = СтрЗаменить(СтрЗаменить(РезОрг.Представление,"(",""),")","");
		КонецЕсли;
		
		ДатаНач = ДатаНачала;
		ДатаКон = ДатаОкончания;
		
		ЗапросУв = Новый Запрос; 
		ЗапросУв.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
		ЗапросСтавка = Новый Запрос;
		ЗапросСтавка.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Пока ДатаНач <= ДатаКон Цикл 
			СтрокаМес = Строка(Месяц(ДатаНач)); 		
			
			ЗапросУв.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Период,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник,
			|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо
			|	ПОМЕСТИТЬ ПакетУВ"+СтрокаМес+"
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период) КАК РаботникиОрганизацийСрезПоследних
			|ГДЕ
			|	РаботникиОрганизацийСрезПоследних.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций";
			
			ЗапросУв.УстановитьПараметр("Период", КонецМесяца(ДатаНач));
			
			ЗапросУв.Выполнить();    		
			
			ЗапросСтавка.Текст = 
			"ВЫБРАТЬ
			|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка,
			|	ГражданствоФизЛицСрезПоследних.ФизЛицо
			|	ПОМЕСТИТЬ ПакетГражд"+СтрокаМес+"
			|ИЗ
			|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&Период, ) КАК ГражданствоФизЛицСрезПоследних";
			
			ЗапросСтавка.УстановитьПараметр("Период", НачалоМесяца(ДатаНач));
			
			ЗапросСтавка.Выполнить(); 	
			
			ДатаНач = ДобавитьМесяц(ДатаНач,1);
		КонецЦикла;
		
		ЗапросПрием = Новый Запрос;
		ЗапросПрием.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросПрием.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизаций.Регистратор,
		|	РаботникиОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		|	РаботникиОрганизаций.Период
		|	ПОМЕСТИТЬ ВТПрием	
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|ГДЕ
		|	(РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
		|			ИЛИ РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций)
		|	И РаботникиОрганизаций.Период <= &ПериодОкончания
		|	И РаботникиОрганизаций.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)"; //О.Т. Аверсон 29.01.2018 № 1511 Доб условие на внутр совм";
		
		ТЗПриемУвольнениеСотрудника = Новый ТаблицаЗначений;
		ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаПриема");
		ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаУвольнения");
		
		ЗапросПрием.УстановитьПараметр("ПериодОкончания", КонецМесяца(ДатаОкончания));
		
		ЗапросПрием.Выполнить();
		
		
		
		//убрал за ненадобностью	
		//Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
		//КонецЕсли;	 
		
		СписокОбработанныхАнкет = Новый СписокЗначений;
		
		ТекстФайла	=	"";
		НомерДокументаВПачке = 0;
		
		//Формируем заголовок выходного файла
		ДатаФормирования = ВыборкаПоШапкеДокумента.Дата;
		ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
		МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
		ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
		ДатаЗаполнения   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		НомерПачки 				= ПроцедурыПерсонифицированогоУчета.НомерПачкиДокумента(ВыборкаПоШапкеДокумента.Номер);
		КоличествоДокументов 	= ВыборкаПоРаботникиОрганизации.Количество();
		
		Если Отказ тогда
			Возврат "";
		КонецЕсли;	 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
		Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
		Запрос.УстановитьПараметр("НачалоНП", НачалоГода(НачалоГода(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1)))); //ДатаРегистрации  1633
		Запрос.УстановитьПараметр("КонецНП", КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		Запрос.УстановитьПараметр("ДатаПодачиСведений", ВыборкаПоШапкеДокумента.ПериодРегистрации);// дата акуальности сведений о доходах и налогах
		
		//О.Т. Аверсон 14.03.2019 № 4054 3ч
		ВидыРасчетаПремия = Новый СписокЗначений;
		ВидыРасчетаПремия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ПремияДляПУ.Основные Цикл 
			ВидыРасчетаПремия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		
		
		Запрос.УстановитьПараметр("ВидРасчетаПремия" , ВидыРасчетаПремия);
		//О.Т. Аверсон 14.03.2019 № 4054 3ч
		
		//+ СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )
		////О.Т. Аверсон 28.02.2019 № 3224
		//СпособыПособия = Новый СписокЗначений;
		//СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		//для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
		//	СпособыПособия.Добавить(стрПособ.ВидРасчета);
		//КонецЦикла;  
		////О.Т. Аверсон 28.02.2019 № 3224
		//
		//Запрос.УстановитьПараметр("СпособРасчета" , СпособыПособия);//О.Т. Аверсон 22.08.2018 № 2335
		//- СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )

		
		//О.Т. Аверсон 28.02.2019 № 3224
		СпособыПособия = Новый СписокЗначений;
		СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
			СпособыПособия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		//О.Т. Аверсон 28.02.2019 № 3224
		Запрос.УстановитьПараметр("СпособРасчета" , СпособыПособия);//О.Т. Аверсон 22.08.2018 № 2335
		
		//О.Т. Аверсон 29.08.2018 № 2363
		Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
			ОсновнойВидНалогообл = ВидНалогообложения;
		иначе
			ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
		КонецЕсли;
		//О.Т. Аверсон 29.08.2018 № 2363
		//О.Т. Аверсон 23.08.2018 № 2335
		СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ДатаРегистрации,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
		СтавкаФСЗН = СтруктураФСЗН.Размер;
		СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ДатаРегистрации,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ПенсионныйФонд,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
		СтавкаПенс = СтруктураПенс.Размер;
		Запрос.УстановитьПараметр( "СтавкаФСЗН", СтавкаФСЗН );
		Запрос.УстановитьПараметр( "СтавкаПенс", СтавкаПенс );

		ПромежуточнаяТаблица = ПолучитьДоходыПоВидамЗаГод( Запрос );
		
		// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		Для каждого Стр Из ПромежуточнаяТаблица Цикл
			Стр.НомерДокумента = СокрЛП( Стр.НомерДокумента );	
		КонецЦикла; 
		Если ВыгрузкаДоговоровПодрядаБезОграничения Тогда
			КолонкиГруппировок = "ФизЛицо, Период, ПериодВзаиморасчетов, ПериодРегистрации, ПроцентФСЗН, ВидДоговора, НомерДокумента, ДатаДокумента, ДокументОснование, ПричиныМинимальнойЗП";
		Иначе
			КолонкиГруппировок = "ФизЛицо, Период, ПериодВзаиморасчетов, ПериодРегистрации, ПроцентФСЗН, ВидДоговора, НомерДокумента, ДатаДокумента, ПричиныМинимальнойЗП";
		КонецЕсли;
		КолонкиСуммирования = "Больничные, СуммаДохода, ПенсионныйФонд, ФСЗН";
		ПромежуточнаяТаблица.Свернуть( КолонкиГруппировок, КолонкиСуммирования );
		// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		
		
		ПТДопСведОстаже = ПолучитьДанныеДляЗаполненияСтажа(ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ПериодРегистрации);
		// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		Для каждого Стр Из ПТДопСведОстаже Цикл
			Стр.НомерДокумента = СокрЛП( Стр.НомерДокумента );
			Если Стр.ВидДейтельности = "СТРАХСЛУЧ" Тогда
				НайдСтроки = ПромежуточнаяТаблица.НайтиСтроки(
					Новый Структура( "ФизЛицо, Период", Стр.ФизЛицо, НачалоМесяца( Стр.НачалоРабот ) ) );
				Для каждого НайдСтрока Из НайдСтроки Цикл
					НайдСтрока.Больничные = 0;	
				КонецЦикла;   
			КонецЕсли;
		КонецЦикла; 
		КолонкиГруппировок = "ФизЛицо, ВидДейтельности, ВидДоговора, ДатаДляПУ, ДатаДокумента, НомерДокумента, НачалоРабот, ОкончаниеРабот";
		КолонкиСуммирования = "";
		ПТДопСведОстаже.Свернуть( КолонкиГруппировок, КолонкиСуммирования ); // сворачиваем дубли
		
		// сворачиваем строки, образующие хронологические звенья, в одну строку для каждого договора
		ПТДопСведОстажеКопия = ПТДопСведОстаже.Скопировать(); //работаем с копией ТЗ, т.к. исходную ТЗ будем менять в цикле
		Отбор = Новый Структура( "ФизЛицо, ВидДейтельности, ВидДоговора, ДатаДляПУ, ДатаДокумента, НомерДокумента" );
		
		
		// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		//ТЗ_ФизЛиц = ПТДопСведОстаже.Скопировать( Новый Структура( "ВидДейтельности", "ДОГОВОР" ) );
		//ТЗ_ФизЛиц.Свернуть( "ФизЛицо, ВидДейтельности" );
		//ОтборФЛ = Новый Структура( "ФизЛицо, ВидДейтельности" );
		// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		ТЗ_ФизЛиц = ПТДопСведОстаже.Скопировать();
		ИменаКолонокХроноЦепочки = "ФизЛицо, ВидДейтельности, НомерДокумента";
		ТЗ_ФизЛиц.Свернуть( ИменаКолонокХроноЦепочки );
		ОтборФЛ = Новый Структура( ИменаКолонокХроноЦепочки );
		// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		ТребуемыеРасшифровкиПересекающихсяДоговоров = ПТДопСведОстаже.СкопироватьКолонки();
		
		
		НеобходимоСвернуть = Ложь;
		Для каждого СтрФЛ Из ТЗ_ФизЛиц Цикл

			ЗаполнитьЗначенияСвойств( ОтборФЛ, СтрФЛ );
			СтрокиФЛ = ПТДопСведОстаже.НайтиСтроки( ОтборФЛ );
			Если СтрокиФЛ.Количество() <= 1 Тогда
				Продолжить;	
			КонецЕсли; 
			
			Для каждого Стр Из СтрокиФЛ Цикл
				
				ЗаполнитьЗначенияСвойств( Отбор, Стр );
				СтрокиДубли = ПТДопСведОстажеКопия.НайтиСтроки( Отбор );
				Если СтрокиДубли.Количество() <= 1 Тогда
					Продолжить;	
				КонецЕсли; 
				
				ДублиБылиОткорректированы = Истина;
				Пока ДублиБылиОткорректированы Цикл
					ДублиБылиОткорректированы = Ложь;
					
					Для каждого СтрокаДубль Из СтрокиДубли Цикл
						Если ПТДопСведОстаже.Индекс( Стр ) = ПТДопСведОстажеКопия.Индекс( СтрокаДубль )
								ИЛИ СтрокаДубль.НачалоРабот > СтрокаДубль.ОкончаниеРабот Тогда
							Продолжить;	
						КонецЕсли; 
						Если ( СтрокаДубль.ОкончаниеРабот + мДлинаСуток ) = Стр.НачалоРабот Тогда
							Стр.НачалоРабот	= СтрокаДубль.НачалоРабот;
							ДублиБылиОткорректированы = Истина;
							Продолжить;
						КонецЕсли;
						Если ( Стр.ОкончаниеРабот + мДлинаСуток ) = СтрокаДубль.НачалоРабот Тогда
							Стр.ОкончаниеРабот	= СтрокаДубль.ОкончаниеРабот;
							ДублиБылиОткорректированы = Истина;
						КонецЕсли;
					КонецЦикла; // СтрокаДубль Из СтрокиДубли
				
					Если ДублиБылиОткорректированы Тогда
						НеобходимоСвернуть = Истина;
					КонецЕсли;
				КонецЦикла; // ДублиБылиОткорректированы
				
			КонецЦикла; // Стр Из СтрокиФЛ
		КонецЦикла; // СтрФЛ Из ТЗ_ФизЛиц
			
			
		Если НеобходимоСвернуть Тогда
			ПТДопСведОстаже.Свернуть( КолонкиГруппировок, КолонкиСуммирования );
		КонецЕсли;
		ПТДопСведОстажеКопия = Неопределено;
		
		//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
		////+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
		//Если НЕ ( ЭтотОбъект.ДогПодряда И ЭтотОбъект.ОбъединятьОсновные ) Тогда
		////- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
		//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
		
		//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
		Если ДогПодряда или ВсеСотрудники Тогда
		//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
		
			// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 34. )
			КолонкиРасшифровок = "ФизЛицо, ВидДейтельности";
			ОтборФЛРасш =  Новый Структура( КолонкиРасшифровок );
			ТЗ_ФизЛицРасш = ТЗ_ФизЛиц.Скопировать( Новый Структура( "ВидДейтельности", "ДОГОВОР" ) );
			ТЗ_ФизЛицРасш.Свернуть( КолонкиРасшифровок );
			// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 34. )
			
			
			Для каждого СтрФЛ Из ТЗ_ФизЛицРасш Цикл

				ЗаполнитьЗначенияСвойств( ОтборФЛРасш, СтрФЛ );
				СтрокиФЛ = ПТДопСведОстаже.НайтиСтроки( ОтборФЛРасш );
				Если СтрокиФЛ.Количество() <= 1 Тогда
					Продолжить;	
				КонецЕсли; 
				
				
					
				Для каждого Стр Из СтрокиФЛ Цикл
					Для каждого СтрКопия Из СтрокиФЛ Цикл
						Если Стр = СтрКопия 
							//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							ИЛИ НЕ ЗначениеЗаполнено( Стр.НомерДокумента )
							//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							//+ СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
							ИЛИ ПТДопСведОстаже.Индекс( Стр ) > ПТДопСведОстаже.Индекс( СтрКопия ) Тогда
							//- СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 34. )
							Продолжить;	
						КонецЕсли;
						Диапазон = ПолучитьПересечениеДиапазонов( 
								Стр.НачалоРабот, Стр.ОкончаниеРабот, СтрКопия.НачалоРабот, СтрКопия.ОкончаниеРабот );
						Если Диапазон <> Неопределено Тогда
							ДатаНач = Макс( Диапазон.Начало, ДатаНачала );
							ДатаКон = Мин( Диапазон.Окончание, ДатаОкончания );
							Пока ДатаНач <= ДатаКон Цикл
								НовРасш = ТребуемыеРасшифровкиПересекающихсяДоговоров.Добавить();
								ЗаполнитьЗначенияСвойств( НовРасш, Стр, "ФизЛицо, НачалоРабот, ОкончаниеРабот" );
								НовРасш.НачалоРабот = Макс( Стр.НачалоРабот, НачалоМесяца( ДатаНач ) );
								НовРасш.ОкончаниеРабот = Мин( Стр.ОкончаниеРабот, КонецМесяца( ДатаНач ) );
								
								ДатаНач = ДобавитьМесяц( ДатаНач, 1 );
							КонецЦикла;
						КонецЕсли; 
					КонецЦикла; // СтрКопия Из ПТДопСведОстаже
				КонецЦикла; // Стр Из СтрокиФЛ
				
			КонецЦикла; // СтрФЛ Из ТЗ_ФизЛиц
			
		//+ СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
		КонецЕсли; // ДогПодряда или ВсеСотрудники 
		//- СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
				
		
		ЕстьРасшифровкиДоговоров = ТребуемыеРасшифровкиПересекающихсяДоговоров.Количество() > 0;
		Если ЕстьРасшифровкиДоговоров Тогда
			ТребуемыеРасшифровкиПересекающихсяДоговоров.Свернуть( "ФизЛицо, НачалоРабот, ОкончаниеРабот" );
			ПромежуточнаяТаблица = ПолучитьРасшифрованнуюПромежуточнуюТаблицу( ПромежуточнаяТаблица, ТребуемыеРасшифровкиПересекающихсяДоговоров );
		КонецЕсли;
		
		ИтогиПоДоговорам = ПромежуточнаяТаблица.Скопировать();
		ИтогиПоДоговорам.Свернуть( "НомерДокумента, ДатаДокумента", "СуммаДохода, Больничные, ФСЗН, ПенсионныйФонд" );
		// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		
		// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		ТЗ_СведенияОСтаже = ПТДопСведОстаже.Скопировать();
		ТЗ_СведенияОСтаже.Колонки[ "ВидДейтельности"].Имя = "ВидДеятельности";
		ТЗ_СведенияОСтаже.Колонки[ "НачалоРабот"].Имя = "ДатаНачалаРабот";
		ТЗ_СведенияОСтаже.Колонки[ "ОкончаниеРабот"].Имя = "ДатаОкончанияРабот";
		
		// + СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
		//УдаляемыеСтрокиВзносыВрем = ПТДопСведОстаже.НайтиСтроки(
		//		Новый Структура( "ВидДейтельности", "ВЗНОСЫВРЕМ" )  );
		//Для каждого УдаляемаяСтрокаВзносыВрем Из УдаляемыеСтрокиВзносыВрем Цикл
		//
		//	ПТДопСведОстаже.Удалить( УдаляемаяСтрокаВзносыВрем );	
		//
		//КонецЦикла; 		
		// - СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
		// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
		
		
		ТекстФайла = Новый ТекстовыйДокумент;
		если ДатаНачала>=Дата(2019,01,01) Тогда 
			ТекстФайла.ДобавитьСтроку("ЗГЛВ=1.7=");
		иначе
			текстФайла.ДобавитьСтроку("ЗГЛВ=1.6="); 
		КонецЕсли;
		
				
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ДобавитьСтроку(Врег("<ПАЧК="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)= "", " ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)) +"="+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)= ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР))+
		"="+?(СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное) = ""," ",СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное))+"="
		//+ СВЭЙ КДЯ 21.10.19 СВФР-004944
		//+ Прав( ВыборкаПоШапкеДокумента.Номер, 5 )
		//- СВЭЙ КДЯ 21.10.19 СВФР-004944
		//+ СВЭЙ КДЯ 21.10.19 СВФР-004944
		+ Лев( ИмяФайлаПачки, СтрДлина( ИмяФайлаПачки ) - 4 )
		//- СВЭЙ КДЯ 21.10.19 СВФР-004944
		+ "= = =1=" ) );
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ДобавитьСтроку("ТИПД=ПУ-3=1= = = =>");
		
		//ТекстФайла.ДобавитьСтроку("<ПУ-3=И="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+"= = ="+СокрЛП(Строка(КоличествоДокументов))+"= = = = =");
		//Островская Татьяна 07.02.2014 № 17089
		если НазначениеПенсии Тогда
			СтрокаПУ3 = "<ПУ-3=П=";
		ИначеЕсли Корректирующая Тогда 
			СтрокаПУ3 = "<ПУ-3=К=";
		ИначеЕсли Отменяющая Тогда //О.Т. Аверсон 06.02.2018 № 1550
			СтрокаПУ3 = "<ПУ-3=О=";
		иначе
			СтрокаПУ3 = "<ПУ-3=И=";
		КонецЕсли;
		
		ТипЗаписи    = СтрокаПУ3+?(СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР) = ""," ",СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)) +"=";
		//Островская Татьяна 07.02.2014 № 17089
		ТекСтрока = 3;
		ИтогДохода = 0;
		ИтогБольн = 0;
		ИтогВзнос = 0;
		ИтогВзнос1 = 0;
		ИтогВзнос2 = 0;
		ИтогВзнос3 = 0;
		РаботДоходСлед =0;
		РаботБольнСлед = 0;
		РаботВзносСлед =0;
		РаботВзносСлед1 =0;
		РаботВзносСлед2 =0;
		РаботВзносСлед3 =0;
		РаботДоход = 0;
		РаботБольн = 0;
		РаботВзнос = 0;
		РаботВзнос1 = 0;//Островская Татьяна 17.01.2014 № 17051
		РаботВзнос2 = 0;
		РаботВзнос3 = 0;
		СтрокаЗамены = 3;
		
		//толик контрольный файл дбф
		
		Дбф=Новый XBase();
		Дбф.Кодировка=КодировкаXBase.OEM;
		Дбф.Поля.Добавить("FIO", "S", 50);
		Дбф.Поля.Добавить("Datr", "D");
		Дбф.Поля.Добавить("Dato", "D");
		Дбф.Поля.Добавить("Sm", "N", 12);
		Дбф.Поля.Добавить("Bl", "N", 12);
		Дбф.Поля.Добавить("Vz", "N", 12);
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			Дбф.СоздатьФайл(ПутьКФайлу+"\VznosyF.DBF");
		иначе
			РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
			б = Сред(РабочийКаталог,7);
			в = Найти(б,Символ(34));
			путьИБ = Лев(б, в-1);
			
			Дбф.СоздатьФайл(путьИБ+"\VznosyF.DBF");
		КонецЕсли;
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		
		//О.Т. Аверсон 28.02.2018 № 1448				
		ЗапросКоррект = Новый Запрос;
		ЗапросКоррект.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаФСЗН.СуммаКорректировки
		|ИЗ
		|	РегистрСведений.КорректировкаФСЗН КАК КорректировкаФСЗН
		|ГДЕ
		|	КорректировкаФСЗН.Период МЕЖДУ &НачалоНП И &КонецНП
		|   И КорректировкаФСЗН.Организация = &Организация";  //Аверсон 17.07.2020 КВВ СВФР-006279
		
		ЗапросКоррект.УстановитьПараметр("НачалоНП", НачалоГода(НачалоГода(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1)))); //ДатаРегистрации  1633
		ЗапросКоррект.УстановитьПараметр("КонецНП", КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		ЗапросКоррект.УстановитьПараметр("Организация", Организация); //Аверсон 17.07.2020 КВВ СВФР-006279

		РезультатЗапросаКорр = ЗапросКоррект.Выполнить();
		
		ВыборкаДетальныеЗаписиКорр = РезультатЗапросаКорр.Выбрать();
		СуммаКорректировки = 0;
		Пока ВыборкаДетальныеЗаписиКорр.Следующий() Цикл
			СуммаКорректировки = СуммаКорректировки + ВыборкаДетальныеЗаписиКорр.СуммаКорректировки;
		КонецЦикла;         
		ТЗСотрудники = ПромежуточнаяТаблица.Скопировать();
		ТЗСотрудники.Свернуть("ФизЛицо,Период");
		ТЗСотрудники.Колонки.Добавить("СуммаКорректировки");
		ОбщееКолКопеек001 = Макс(СуммаКорректировки / 0.01,-СуммаКорректировки / 0.01);
		КолКопеек001 = Макс(СуммаКорректировки / 0.01,-СуммаКорректировки / 0.01);
		Для Каждого стр из ТЗСотрудники Цикл 
			стр.СуммаКорректировки = ?(ЗначениеЗаполнено(ОбщееКолКопеек001),СуммаКорректировки/ОбщееКолКопеек001,0);
			КолКопеек001 = КолКопеек001 - 1;
			Если КолКопеек001 = 0 Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		КолСотрудников = ТЗСотрудники.Количество();
		//Макс((СуммаКорректировки / 0.01) - КолСотрудников,0);
		//О.Т. Аверсон 28.02.2018 № 1448
		
		ПенсияВыгружена = Ложь; //Островская Татьяна 20.01.2014 № 17051
		ДетиВыгружена = Ложь;
		ПособиеВыгружена = Ложь;//Островская Татьяна 05.03.2014 № 17172
		ПремияВыгружена = Ложь;
		ВзносыВрВыгружена = Ложь;//Островская Татьяна 05.03.2014 № 17172
		СтрахСлучВыгружена = Ложь; //О.Т. Аверсон 21.05.2018 № 1985
		//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
		//ДетиЕсть = Ложь;
		//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
		ТекСтрокаДляСтрПУ = ТекСтрока;
		Пока ВыборкаПоРаботникиОрганизации.Следующий()	Цикл
			//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
			ЗначениеКв = "";
			//- СВЭЙ КДЯ 25.07.19 СВФР-004561
			ПенсияВыгружена = Ложь; //Островская Татьяна 20.01.2014 № 17051
			ДетиВыгружена = Ложь;
			ПособиеВыгружена = Ложь;//Островская Татьяна 05.03.2014 № 17172
			ПремияВыгружена = Ложь;
			ВзносыВрВыгружена = Ложь;//Островская Татьяна 05.03.2014 № 17172
			СтрахСлучВыгружена = Ложь;//О.Т. Аверсон 21.05.2018 № 1985
			//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
			//ДетиЕсть = Ложь;
			//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
			ПериодДляДоговора = "";
			//Контроль дубля строк
			СчДляПУ = 0;
			ТипЗаписиНач = "НЧСЛ=";
			Структура = Новый Структура;
			Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
			если ВыборкаПоРаботникиОрганизации.ВидДоговора = Неопределено Тогда 
				Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
			Иначе 
				Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
			КонецЕсли;
			СтрокиПоРаботнику = ПромежуточнаяТаблица.НайтиСтроки(Структура); 
			РаботДоходСлед = 0;	
			РаботБольнСлед = 0;
			РаботВзносСлед = 0;
			РаботВзносСлед1 = 0;
			РаботВзносСлед2 = 0;
			РаботВзносСлед3 = 0;
			КоличествоЗаписейОСтаже = 0;
			Если СтрокиПоРаботнику.Количество()<> 0 тогда
				
				РаботДоход = 0;
				РаботБольн = 0;
				РаботВзнос = 0;
				РаботВзнос1 = 0; //Островская Татьяна 17.01.2014 № 17051
				РаботВзнос2 = 0;
				РаботВзнос3 = 0;
				СтрокаФайла = ТипЗаписи;
				//Инициалы должны быть указаны
				Фамилия = ВРег(?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия)));
				Имя = Врег(?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Имя),1)));
				Отчество = Врег(?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество),1)));
				Категория =?(ВыборкаПоРаботникиОрганизации.Категория = "", "01", СокрЛП(ВыборкаПоРаботникиОрганизации.Категория));
				//толик			СтрокаФайла = СтрокаФайла+СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)+"="+Фамилия+"="+Имя+"="+Отчество+"="+Категория+"=";
				СтрокаЗар = "";
				//Островская Татьяна 02.11.2012 № 15
				если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ВидДоговора) Тогда 
					КатегорияВывод = "ДОГОВОР";
				ИНАЧЕ
					КатегорияВывод = "";
				КонецЕсли;
				
				//О.Т. Аверсон 05.04.2019 № 4187
				НевернаЗапись = Ложь;
				Если КатегорияВывод = "ДОГОВОР" Тогда
					Для Каждого стрДог из СтрокиПоРаботнику Цикл
						СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо,НомерДокумента",ВыборкаПоРаботникиОрганизации.ФизЛицо,стрДог.НомерДокумента));
						Для Каждого СтрСведОСтаже из СтрокиПоРаб Цикл    							
							Если СтрСведОСтаже.НачалоРабот < стрДог.ДатаДокумента Тогда 
								Сообщить("По сотруднику "+ВыборкаПоРаботникиОрганизации.ФизЛицо.Наименование+" в договоре №"+СокрЛП(СтрСведОСтаже.НомерДокумента)+" неверно заполнан реквизит - Дата для ПУ!");
								НевернаЗапись = Истина;
								Прервать;
							КонецЕсли;  							
						КонецЦикла;
						если НевернаЗапись Тогда 
							Прервать;
						КонецЕсли;
					КонецЦикла; 
					если НевернаЗапись Тогда 
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				//О.Т. Аверсон 05.04.2019 № 4187
				
				//Островская Татьяна 03.02.2014 № 17051
				СтрокаДети = СведенияОСтаже.НайтиСтроки( Структура );
				КатегорияДети = "";
				для Каждого СтрДети из СтрокаДети Цикл 
					//+ СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )
					//если СтрДети.ВидДеятельности = "ДЕТИ" Тогда 
					//- СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )
					//+ СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )
					если СтрДети.ВидДеятельности = Дети Тогда 
					//- СВЭЙ КДЯ СВФР-004631 20.08.19 ( Пункт 7. )
						КатегорияДети = "ДЕТИ";
						Прервать; // СВЭЙ КДЯ СВФР-004561 31.07.19
					КонецЕсли;
				КонецЦикла;
				//Островская Татьяна 03.02.2014 № 17051
				Структура = Новый Структура;
				Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				если ВыборкаПоРаботникиОрганизации.ВидДоговора = Неопределено Тогда 
					Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
				Иначе 
					Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
				КонецЕсли;
				
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				ЕстьВидРасчета = Ложь;
				Для каждого СтрДог из СтрокиПоРаб цикл
					если не СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
						ЕстьВидРасчета = Истина;
						Прервать; // СВЭЙ КДЯ СВФР-004561 31.07.19
					КонецЕсли;
				КонецЦикла;
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				Для каждого СтрДог из СтрокиПоРаб цикл 
					если ЕстьВидРасчета Тогда 
						если СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					
					если КатегорияВывод= "ДОГОВОР"  Тогда 
						
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"03"+"=";
					Иначе 
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
						
					КонецЕсли;
					
					Прервать;
					
				КонецЦикла;
				
				Если СтрокиПоРаб.Количество()=0 Тогда 
					СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
					Сообщить("Данные не найдены по сотруднику "+ВыборкаПоРаботникиОрганизации.ФизЛицо.Наименование);					
				КонецЕсли;

				//Островская Татьяна 02.11.2012 № 15
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;                     
				
				НомерДокументаВПачке = 	НомерДокументаВПачке + 1;
				
				//Берем запись с пустыми полями
				//Запись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
				
				ТекстФайла.ДобавитьСтроку(СтрокаФайла);
				ТекСтрока = ТекСтрока+1;
				СтрокаЗамены = ТекСтрока;
				
				КоличествоМес = 0;
				СтрокаДатаДокумента = "";
				СтрокаНомерДокумента = "";
				СтрМес = 1;
				СтрокаФайла1 = "";
				Сч =0;
				СтрокиПоРаботнику1 = ПромежуточнаяТаблица.НайтиСтроки(Структура);
				СтрВзнСл = 0;
				СтрВзнСл1 = 0;
				СтрВзнСл2 = 0;
				СтрВзнСл3 = 0;
				СтрБлнСл = 0;
				РаботДоходСл = 0;
				Колич = СтрокиПоРаботнику1.Количество();
				ДатаНач = ДатаНачала;
				ДатаКон = ДатаОкончания;
				//ЗапросСотр = Новый Запрос;
				//
				//ЗапросСотр.УстановитьПараметр("Физлицо",				ВыборкаПоРаботникиОрганизации.ФизЛицо);
				//ЗапросСотр.УстановитьПараметр("ГоловнаяОрганизация",	Организация);
				//
				//ЗапросСотр.Текст =
				//"ВЫБРАТЬ
				//|	СотрудникиОрганизаций.Ссылка,
				//|	ВЫБОР
				//|		КОГДА СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				//|			ТОГДА 1
				//|		ИНАЧЕ 2
				//|	КОНЕЦ КАК Порядок
				//|ИЗ
				//|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
				//|ГДЕ
				//|	(СотрудникиОрганизаций.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Контракт)
				//|			ИЛИ СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))
				//|	И СотрудникиОрганизаций.Физлицо = &Физлицо
				//|	И СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
				//|
				//|УПОРЯДОЧИТЬ ПО
				//|	Порядок";
				//
				//Выборка = ЗапросСотр.Выполнить().Выбрать();
				//Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(ВыборкаПоРаботникиОрганизации.ФизЛицо.Наименование);
				//Если Выборка.Следующий() Тогда
				//	Сотрудник	= Выборка.Ссылка;
				//КонецЕсли;
				ЗапросПрием.Текст = 
				"ВЫБРАТЬ
				|	РаботникиОрганизаций.Регистратор,
				|	РаботникиОрганизаций.Период КАК Период
				|ИЗ
				|	ВТПрием КАК РаботникиОрганизаций
				|ГДЕ
				|	РаботникиОрганизаций.Физлицо = &Физлицо
				//+ СВЭЙ КДЯ 22.07.19 СВФР-004561 
				|УПОРЯДОЧИТЬ ПО
				|	Период	
				//- СВЭЙ КДЯ 22.07.19 СВФР-004561
				|";
				ТЗПриемУвольнениеСотрудника = Новый ТаблицаЗначений;
				ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаПриема");
				ТЗПриемУвольнениеСотрудника.Колонки.Добавить("ДатаУвольнения");
				
				ЗапросПрием.УстановитьПараметр("ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо);

				РезультПрием = ЗапросПрием.Выполнить().Выбрать();
				ДатаПриема = Дата(1,1,1);
				СтрТЗПриемУвольнениеСотрудника = Неопределено;
				Пока РезультПрием.Следующий() Цикл
					если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда 
						если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
							СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период;
						ИначеЕсли не СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
							СтрТЗПриемУвольнениеСотрудника.ДатаПриема = РезультПрием.Период; 
						КонецЕсли; 
						если СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = ДатаОкончания;
						конецЕсли;
					КонецЕсли;
					если ТипЗнч(РезультПрием.Регистратор) = Тип("ДокументСсылка.УвольнениеИзОрганизаций") Тогда 
						если СтрТЗПриемУвольнениеСотрудника = Неопределено Тогда 
							СтрТЗПриемУвольнениеСотрудника = ТЗПриемУвольнениеСотрудника.Добавить();
						КонецЕсли;
						СтрТЗПриемУвольнениеСотрудника.ДатаУвольнения = РезультПрием.Период-86400;
						
					КонецЕсли;
					
				КонецЦикла;
				ДатаПриема = Дата(1,1,1);
				ДатаУвольнения = ДатаОкончания;
				Для Каждого СтрДата из ТЗПриемУвольнениеСотрудника Цикл
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					//если СтрДата.ДатаПриема < ДатаНачала и СтрДата.ДатаУвольнения < ДатаНачала и СтрДата.ДатаУвольнения<>Дата(1,1,1) Тогда 
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
					Если ЗначениеЗаполнено( СтрДата.ДатаПриема )
						 И ЗначениеЗаполнено( СтрДата.ДатаУвольнения )
						 И СтрДата.ДатаПриема < ДатаНачала 
						 И СтрДата.ДатаУвольнения < ДатаНачала Тогда
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 17. )
						Продолжить;
					КонецЕсли;
					Если не ЗначениеЗаполнено(ДатаПриема) Тогда 
						 ДатаПриема = СтрДата.ДатаПриема;
					 КонецЕсли;
					 если СтрДата.ДатаУвольнения <>Дата(1,1,1) Тогда 
						 ДатаУвольнения = СтрДата.ДатаУвольнения;
					 КонецЕсли;
					
				КонецЦикла;
				

				
				
				ТЗ_ВзносыФизЛица = Новый ТаблицаЗначений;
				ТЗ_ВзносыФизЛица.Колонки.Добавить("Больничные");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("СуммаДохода");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ФизЛицо");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("Период");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ПроцентФСЗН");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ПенсионныйФонд");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ФСЗН");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ВидДоговора");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("НомерДокумента");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ДатаДокумента");
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ДокументОснование");//О.Т. Аверсон 23.08.2018 № 2335
				ТЗ_ВзносыФизЛица.Колонки.Добавить("ПричиныМинимальнойЗП");
				//ЗапросПрием = Новый Запрос;
				//ЗапросПрием.Текст = 
				//"ВЫБРАТЬ
				//|	ВложенныйЗапрос.Сотрудник,
				//|	ВЫБОР
				//|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ДатаУвольнения, 1) = 1
				//|			ТОГДА &ДатаОкончания
				//|		ИНАЧЕ ВложенныйЗапрос.ДатаУвольнения
				//|	КОНЕЦ КАК ДатаУвольнения,
				//|	ВложенныйЗапрос.ДатаПриема
				//|ИЗ
				//|	(ВЫБРАТЬ
				//|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
				//|		ВложенныйЗапрос.ДатаУвольнения КАК ДатаУвольнения,
				//|		ПриемНаРаботуВОрганизациюРаботникиОрганизации.ДатаПриема КАК ДатаПриема
				//|	ИЗ
				//|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				//|				РаботникиОрганизаций.Сотрудник КАК Сотрудник,
				//|				УвольнениеИзОрганизацийРаботникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
				//|			ИЗ
				//|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
				//|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций.РаботникиОрганизации КАК УвольнениеИзОрганизацийРаботникиОрганизации
				//|					ПО РаботникиОрганизаций.Регистратор = УвольнениеИзОрганизацийРаботникиОрганизации.Ссылка
				//|						И РаботникиОрганизаций.Сотрудник = УвольнениеИзОрганизацийРаботникиОрганизации.Сотрудник
				//|			ГДЕ
				//|				РаботникиОрганизаций.Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций
				//|				И РаботникиОрганизаций.Сотрудник.Физлицо = &Физлицо) КАК ВложенныйЗапрос
				//|			ПО РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Сотрудник
				//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриемНаРаботуВОрганизацию.РаботникиОрганизации КАК ПриемНаРаботуВОрганизациюРаботникиОрганизации
				//|			ПО РаботникиОрганизаций.Регистратор = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Ссылка
				//|				И РаботникиОрганизаций.Сотрудник = ПриемНаРаботуВОрганизациюРаботникиОрганизации.Сотрудник
				//|	ГДЕ
				//|		РаботникиОрганизаций.Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию
				//|		И РаботникиОрганизаций.Сотрудник.Физлицо = &Физлицо) КАК ВложенныйЗапрос
				//|ГДЕ
				//|	ВЫБОР
				//|			КОГДА ЕСТЬNULL(ВложенныйЗапрос.ДатаУвольнения, 1) = 1
				//|				ТОГДА &ДатаОкончания
				//|			ИНАЧЕ ВложенныйЗапрос.ДатаУвольнения
				//|		КОНЕЦ >= &ДатаНачала
				//|	И ВложенныйЗапрос.ДатаПриема <= &ДатаОкончания";
				//ЗапросПрием.УстановитьПараметр("Физлицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				//ЗапросПрием.УстановитьПараметр("ДатаНачала",ДатаНачала);
				//ЗапросПрием.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
				//РезПрием = ЗапросПрием.Выполнить().Выбрать();
				//ДатаПриема = Дата("00010101000000");
				//если РезПрием.Следующий() Тогда 
				//	ДатаПриема = РезПрием.ДатаПриема;
				//КонецЕсли;
				//РезУв = ЗапросПрием.Выполнить().Выбрать(); 
				//ДатаУвольнения = ДатаОкончания;
				//Пока РезУв.Следующий() Цикл 	
				//	ДатаУвольнения = РезУв.ДатаУвольнения;
				//КонецЦикла;
				
				если КатегорияВывод <> "ДОГОВОР" Тогда
					если ДатаНач < ДатаПриема Тогда 
						ДатаНач = НачалоМесяца(Макс(ДатаПриема,ДатаНачала));
					КонецЕсли;
					если ДатаОкончания > ДатаУвольнения Тогда 
						ДатаКон = НачалоМесяца(ДатаУвольнения);
					КонецЕсли;
				КонецЕсли;
				
				//РезПереборДат = ЗапросПрием.Выполнить().Выбрать(); 
				ПереборДатТЗ = Новый Массив;
				Для Каждого РезПереборДат из ТЗПриемУвольнениеСотрудника Цикл 
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 16. )
					//ДатаПриемСч = НачалоМесяца(РезПереборДат.ДатаПриема);
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 16. )
					// + СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 16. )
					ДатаПриемСч = НачалоМесяца( ?( ЗначениеЗаполнено( РезПереборДат.ДатаПриема ), 
							РезПереборДат.ДатаПриема, ЭтотОбъект.ДатаНачала ) );
					// - СВЭЙ КДЯ 06.09.19 СВФР-004631 ( Пункт 16. )
					пока ДатаПриемСч <= РезПереборДат.ДатаУвольнения Цикл 
						ПереборДатТЗ.Добавить(ДатаПриемСч);
						ДатаПриемСч = ДобавитьМесяц(ДатаПриемСч,1);
					КонецЦикла;
					
				КонецЦикла;
				
				пока ДатаНач <= ДатаКон Цикл 
					ПериодЕсть = Ложь;
					Для Каждого стр из СтрокиПоРаботнику1 Цикл 
						если стр.Период = ДатаНач Тогда
							если КатегорияВывод = "ДОГОВОР" Тогда
								//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
								//МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо,НомерДокумента,НачалоРабот",стр.ФизЛицо,стр.НомерДокумента,стр.ДатаДокумента));
								//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
								//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
								МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки( Новый Структура( "ФизЛицо, НомерДокумента", стр.ФизЛицо, стр.НомерДокумента ) );
								//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
								Если МасПровПТДопСведОстаже.Количество()> 0 Тогда 
									СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
									ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стр);
									Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
										ПериодЕсть = Истина;
										//+ СВЭЙ КДЯ 22.07.19 СВФР-004561
										//Прервать;
										//- СВЭЙ КДЯ 22.07.19 СВФР-004561
										//+ СВЭЙ КДЯ 22.07.19 СВФР-004561
										Продолжить;
										//- СВЭЙ КДЯ 22.07.19 СВФР-004561
									КонецЕсли;
								иначе //О.Т. Аверсон 05.04.2019 № 4187
									МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо,НомерДокумента",стр.ФизЛицо,стр.НомерДокумента));
									Для Каждого стрДопСвед из МасПровПТДопСведОстаже Цикл 
										Если стрДопСвед.НачалоРабот >= стр.ДатаДокумента Тогда 
											СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
											ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стр);
											Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
												ПериодЕсть = Истина;
												Прервать;
											КонецЕсли;											
										КонецЕсли;  												
									КонецЦикла;
									Если МасПровПТДопСведОстаже.Количество()> 0 Тогда
										Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
											ПериодЕсть = Истина;
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							иначе
								СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стр);
								Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
									ПериодЕсть = Истина;
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли; // стр.Период = ДатаНач
					КонецЦикла; // стр из СтрокиПоРаботнику1
					
					Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
						если не ПериодЕсть Тогда 
							
							Для Каждого стрЗнач из СтрокиПоРаботнику1 Цикл 
								если стрЗнач.Период = ДатаНач Тогда
									если КатегорияВывод = "ДОГОВОР" Тогда
										//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										//МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо,НомерДокумента,НачалоРабот",стр.ФизЛицо,стр.НомерДокумента,стр.ДатаДокумента));
										//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки( Новый Структура( "ФизЛицо, НомерДокумента", стр.ФизЛицо, стр.НомерДокумента ) );
										//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										Если МасПровПТДопСведОстаже.Количество()> 0 Тогда 
											СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
											ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стрЗнач);
											Прервать;
										иначе
											МасПровПТДопСведОстаже = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо,НомерДокумента",стр.ФизЛицо,стр.НомерДокумента));
											Для Каждого стрДопСвед из МасПровПТДопСведОстаже Цикл 
												Если стрДопСвед.НачалоРабот >= стр.ДатаДокумента Тогда 
													СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
													ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стрЗнач);
													Прервать; 													
												КонецЕсли;  												
											КонецЦикла;       									
										КонецЕсли;
									иначе
										СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаСтрокиПоРаботнику1,стрЗнач);
										Прервать;
									КонецЕсли;
									
								КонецЕсли;
							КонецЦикла;
							если КатегорияВывод <> "ДОГОВОР" Тогда
								ДатаОтбор = ПереборДатТЗ.Найти(НачалоМесяца(ДатаНач));
								если не ДатаОтбор = Неопределено Тогда 
									
									СтрокаСтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица.Добавить();
									СтрокаСтрокиПоРаботнику1.Больничные = 0;
									СтрокаСтрокиПоРаботнику1.Период = НачалоМесяца(ДатаНач);
									СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
									СтрокаСтрокиПоРаботнику1.ФизЛицо = ВыборкаПоРаботникиОрганизации.ФизЛицо;
									СтрокаСтрокиПоРаботнику1.ПроцентФСЗН = 0;
									СтрокаСтрокиПоРаботнику1.ПенсионныйФонд = 0;
									СтрокаСтрокиПоРаботнику1.ФСЗН = 0;
									//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
									СтрокаСтрокиПоРаботнику1.НомерДокумента = "";
									СтрокаСтрокиПоРаботнику1.ДатаДокумента = Дата( 1, 1, 1 );
									//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
								КонецЕсли;
							КонецЕсли;
							ПериодЕсть = Ложь;
							
						КонецЕсли; 
					КонецЕсли;
					ДатаНач = ДобавитьМесяц(ДатаНач,1);	
				КонецЦикла; // ДатаНач <= ДатаКон
				
				// + СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
				ТЗ_ВзносыФизЛица.Сортировать( "ФизЛицо, ДатаДокумента, НомерДокумента, Период" );
				// - СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
				СтрокиПоРаботнику1 = ТЗ_ВзносыФизЛица; 
				Колич = ТЗ_ВзносыФизЛица.Количество();
				
				НомерДоговораПрошл = "";
				ДатаДоговораПрошл = "";
				ДокументОснованиеПрошл = ""; //О.Т. Аверсон 23.08.2018 № 2335
				НомерДоговораПервый = "";
				ДатаДоговораПервый = "";
				СтрокаЗамена = СтрокаФайла;  
				СчДляКолСтажа = 0;
				//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
				ПериодДляДоговора = Дата( 1, 1, 1 );
				ОтборДоговора = Новый Структура( "НомерДокумента, ДатаДокумента" );
				//- СВЭЙ КДЯ 25.07.19 СВФР-004561
				// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
				ПрефиксСтрокаФайла1 = "";
				// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
				Для Сч = 0 по Колич - 1 цикл
					
					СтрокаМес = СтрокиПоРаботнику1[ Сч ];
					если КатегорияВывод= "ДОГОВОР" и не ЗначениеЗаполнено(СтрокаМес.НомерДокумента) Тогда
						Продолжить;
					КонецЕсли;
					если Сч = 0 Тогда 
						НомерДоговораПервый = СтрокаМес.НомерДокумента;
						ДатаДоговораПервый = СтрокаМес.ДатаДокумента;
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = "";
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					ЕстьВзносы = Истина;
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					Если КатегорияВывод = "ДОГОВОР" И СтрокаМес.СуммаДохода = 0 
						 И СтрокаМес.Больничные = 0 И СтрокаМес.ФСЗН = 0 И СтрокаМес.ПенсионныйФонд = 0 Тогда
						ЗаполнитьЗначенияСвойств( ОтборДоговора, СтрокаМес );
						ИтогиДоговора = ИтогиПоДоговорам.НайтиСтроки( ОтборДоговора );
						Если ИтогиДоговора.Количество() > 0 Тогда
							Если ИтогиДоговора[0].СуммаДохода > 0 ИЛИ ИтогиДоговора[0].Больничные > 0 
								  ИЛИ ИтогиДоговора[0].ФСЗН > 0 ИЛИ ИтогиДоговора[0].ПенсионныйФонд > 0 Тогда
								//нулевой месяц по договору с ненулевым итогом ( пропускаем ) 
								Продолжить;
							КонецЕсли;
						КонецЕсли; 
						//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
						ЕстьВзносы = Ложь;
						//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					КонецЕсли;
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					
					РезультатДоговор = 0;
					// + СВЭЙ КДЯ СВФР-004561 02.08.19 + 18.09.19 СВФР-004631 ( пункт 31. )
					Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
					// - СВЭЙ КДЯ СВФР-004561 02.08.19
					// + СВЭЙ КДЯ СВФР-004561 02.08.19 - 18.09.19 СВФР-004631 ( пункт 31. )
					//Если НЕ ( ВыгрузкаДоговоровПодрядаБезОграничения И ДогПодряда ИЛИ ЕстьРасшифровкиДоговоров )  Тогда
					// - СВЭЙ КДЯ СВФР-004561 02.08.19
					
						//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
						//Если КатегорияВывод = "ДОГОВОР" Тогда
						//
						//	ЗапросДог = Новый Запрос;
						//	ЗапросДог.Текст = 
						//	"ВЫБРАТЬ
						//	|	ЕСНСведенияОДоходах.Результат
						//	|ИЗ
						//	|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
						//	|ГДЕ
						//	|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
						//	|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
						//	|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
						//	//|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета"; //О.Т. Аверсон 31.01.2017 № 244
						//	ЗапросДог.УстановитьПараметр("ФизЛицо",СтрокаМес.ФизЛицо);
						//	ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
						//	ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(СтрокаМес.Период));
						//	ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(СтрокаМес.Период));
						//	//ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
						//	РезДог = ЗапросДог.Выполнить().Выбрать();
						//	пока РезДог.Следующий() Цикл 
						//		РезультатДоговор = РезультатДоговор+РезДог.Результат; 
						//	КонецЦикла;
						//	
						//КонецЕсли;
						//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
						
						
						//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
						Если КатегорияВывод = "ДОГОВОР" И ЗначениеЗаполнено( СтрокаМес.НомерДокумента ) Тогда
						//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
							
							//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
							////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
							//Для каждого Стр Из ПромежуточнаяТаблица.НайтиСтроки( Новый Структура( "ФизЛицо", СтрокаМес.ФизЛицо ) ) Цикл
							//	Если НачалоМесяца( СтрокаМес.Период ) = НачалоМесяца( Стр.Период ) 
							//		 И СтрокаСтажаСоответствуетСтрокеМесяца( Стр, СтрокаМес, Истина ) 
							//		 И ЗначениеЗаполнено( СтрокаМес.НомерДокумента ) Тогда 
							//			
							//		РезультатДоговор = РезультатДоговор + Стр.СуммаДохода;
							//		
							//	КонецЕсли;
							//КонецЦикла; 
							////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
							//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
							
							
						//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
							ОтборДохода = Новый Структура( "ФизЛицо, Период, НомерДокумента, ДатаДокумента", 
								СтрокаМес.ФизЛицо, СтрокаМес.Период, СтрокаМес.НомерДокумента, СтрокаМес.ДатаДокумента );
							СтрокиДохода = ПромежуточнаяТаблица.НайтиСтроки( ОтборДохода );
							Для каждого СтрокаДохода Из СтрокиДохода Цикл
								РезультатДоговор = РезультатДоговор + СтрокаДохода.СуммаДохода;
							КонецЦикла;
							
							
						КонецЕсли; // КатегорияВывод = "ДОГОВОР" И ЗначениеЗаполнено( СтрокаМес.НомерДокумента )
						//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
						
					иначе
						РезультатДоговор = СтрокаМес.СуммаДохода;
					КонецЕсли;					
					
					
					
					
					если ЗначениеЗаполнено(СтрокаДатаДокумента) и ЗначениеЗаполнено(СтрокаНомерДокумента) Тогда 
					иначе
						
						СтрокаДатаДокумента = СтрокаМес.ДатаДокумента;
						СтрокаНомерДокумента = СтрокаМес.НомерДокумента;
					КонецЕсли;
					если не Сч > Колич-1 Тогда 
						СтрокаДатаДокументаСлед = СтрокиПоРаботнику1[Сч].ДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокиПоРаботнику1[Сч].НомерДокумента;
					иначе
						СтрокаДатаДокументаСлед = СтрокаДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокаНомерДокумента;
						
					КонецЕсли;
					Если Категория <> "03" тогда
						если КатегорияВывод= "ДОГОВОР" Тогда
							если ЗначениеЗаполнено(СтрокаМес.НомерДокумента) Тогда 
								если  не СтрокаДатаДокументаСлед = "" Тогда  
									//если не СтрМес>1 Тогда
									ДеньДатыДоговора        = ?(День(СтрокаДатаДокументаСлед)<10,"0","")+День(СтрокаДатаДокументаСлед);
									МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокументаСлед)<10,"0","")+Месяц(СтрокаДатаДокументаСлед);
									ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокументаСлед), "ЧГ=0")));
									ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;    
									//иначе
									//	ДеньДатыДоговора        = ?(День(СтрокаДатаДокумента)<10,"0","")+День(СтрокаДатаДокумента);
									//	МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокумента)<10,"0","")+Месяц(СтрокаДатаДокумента);
									//	ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокумента), "ЧГ=0")));
									//	ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;
									//КонецЕсли;
								иначе
									ДатаДоговора = "";
								КонецЕсли;
								// О.Т. 05.11.2014 
								
								
								//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
								//ЗапросНеОплДог = Новый Запрос;
								//ЗапросНеОплДог.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								//ЗапросНеОплДог.Текст = "
								//| Выбрать 
								//| ТЧСведОСтаже.ФизЛицо,
								//| ТЧСведОСтаже.Договор,
								//| ТЧСведОСтаже.ВидДеятельности
								//| Поместить ВТТЧСведОСтаже
								//| из &ТЧСведОСтаже как ТЧСведОСтаже
								//| ГДЕ ТЧСведОСтаже.ФизЛицо = &ФизЛицо";
								//ЗапросНеОплДог.УстановитьПараметр( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
								//ЗапросНеОплДог.УстановитьПараметр( "НеОплДог", НеоплДог );
								//ЗапросНеОплДог.УстановитьПараметр( "ТЧСведОСтаже", СведенияОСтаже );
								//
								//ЗапросНеОплДог.Выполнить();
								//ЗапросНеОплДог.Текст = "
								//| Выбрать 
								//| ТЧСведОСтаже.ФизЛицо,
								//| ТЧСведОСтаже.Договор,
								//| ТЧСведОСтаже.ВидДеятельности
								//| из ВТТЧСведОСтаже как ТЧСведОСтаже
								////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
								////| ГДЕ ТЧСведОСтаже.Договор.Номер = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
								////- СВЭЙ КДЯ 25.07.19 СВФР-004561
								////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
								//| ГДЕ ТЧСведОСтаже.Договор.НомерДляПУ = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
								////- СВЭЙ КДЯ 25.07.19 СВФР-004561

								//если не Сч > Колич-1 Тогда
								//	Попытка       									
								//		СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, Число(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";
								//		ЗапросНеОплДог.УстановитьПараметр("Номер",СтрокаНомерДокументаСлед);
								//		ЗапросНеОплДог.УстановитьПараметр("Дата",СтрокаДатаДокументаСлед);
								//	Исключение
								//		СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, СокрЛП(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";	
								//		ЗапросНеОплДог.УстановитьПараметр("Номер",СтрокаНомерДокументаСлед);
								//		ЗапросНеОплДог.УстановитьПараметр("Дата",СтрокаДатаДокументаСлед);
								//	КонецПопытки;
								//иначе
								//	Попытка
								//		СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, Число(СтрокаНомерДокумента)) +"="+ДатаДоговора+"=";
								//		ЗапросНеОплДог.УстановитьПараметр("Номер",СтрокаНомерДокумента);
								//		ЗапросНеОплДог.УстановитьПараметр("Дата",СтрокаДатаДокументаСлед);
								//	Исключение
								//		СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, СокрЛП(СтрокаНомерДокумента)) +"="+ДатаДоговора+"=";
								//		ЗапросНеОплДог.УстановитьПараметр("Номер",СтрокаНомерДокумента);
								//		ЗапросНеОплДог.УстановитьПараметр("Дата",СтрокаДатаДокументаСлед);
								//	КонецПопытки;
								//КонецЕсли;
								//// О.Т. 05.11.2014 
								//РезНеОплДог = ЗапросНеОплДог.Выполнить().Выгрузить();
								//ЕстьНеоплДог = РезНеОплДог.Количество(); 
								//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
								
								//+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
								//ЗапросНеОплДог = Новый Запрос;
								//ЗапросНеОплДог.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
								//ЗапросНеОплДог.Текст = "
								//| ВЫБРАТЬ 
								//| 	СведенияОСтаже.ФизЛицо,
								//| 	СведенияОСтаже.НомерДокумента,
								//| 	СведенияОСтаже.ДатаДокумента,
								//| 	ВЫРАЗИТЬ( СведенияОСтаже.ВидДеятельности КАК СТРОКА(8) ) КАК ВидДеятельности
								//|   ПОМЕСТИТЬ ВтСведенияОСтаже
								//| ИЗ 
								//|	&СведенияОСтаже КАК СведенияОСтаже
								//|;
								//| ВЫБРАТЬ ПЕРВЫЕ 1
								//| 	СведенияОСтаже.ФизЛицо
								//| ИЗ 
								//|	ВтСведенияОСтаже КАК СведенияОСтаже
								//| ГДЕ 
								//|	СведенияОСтаже.НомерДокумента = &НомерДокумента 
								//|	И СведенияОСтаже.ДатаДокумента = &ДатаДокумента
								//|	И СведенияОСтаже.ВидДеятельности = ""НЕОПЛДОГ""
								//|";
								//ЗапросНеОплДог.УстановитьПараметр( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
								//ЗапросНеОплДог.УстановитьПараметр( "НомерДокумента", СтрокаМес.НомерДокумента );
								//ЗапросНеОплДог.УстановитьПараметр( "ДатаДокумента", СтрокаМес.ДатаДокумента );
								//ЗапросНеОплДог.УстановитьПараметр( "СведенияОСтаже", ТЗ_СведенияОСтаже );
								//ЕстьНеоплДог = НЕ ЗапросНеОплДог.Выполнить().Пустой();
								////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 28. )
								//- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								
								//+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
								Если НЕ Сч > Колич-1 Тогда
									Попытка       									
										СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, Число(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";
									Исключение
										СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, СокрЛП(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";	
									КонецПопытки;
								Иначе
									Попытка
										СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, Число(СтрокаНомерДокумента)) +"="+ДатаДоговора+"=";
									Исключение
										СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, СокрЛП(СтрокаНомерДокумента)) +"="+ДатаДоговора+"=";
									КонецПопытки;
								КонецЕсли;
								//- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								
							КонецЕсли;
						Иначе 
							если не СтрМес>1 тогда //?(Колич-1 = сч,истина,СтрМес>1) Тогда
								СтрокаФайла = СтрокаФайла+" = =";
							КонецЕсли;
						КонецЕсли;
						
						
					КонецЕсли;
					//КонецЕсли;
					если СтрМес>1 тогда //?(Колич-1 = сч,истина,СтрМес>1) Тогда 
						если КатегорияВывод= "ДОГОВОР" Тогда
							если не Сч > Колич-1 Тогда
								Если СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл Тогда 
									ДатаНачалаДоговора = Дата(1,1,1);
									ДатаОкончанияДоговора = Дата(1,1,1);
									если КатегорияВывод= "ДОГОВОР" Тогда
										Если СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл Тогда 
											ТипЗаписиНач = "СТАЖ=";
											//ПустойНомерДогПрошл = Ложь;
											//Если НомерДоговораПрошл = "" и Сч = Колич-1 Тогда //О.Т. Аверсон 05.03.2019 № 4036
											//	НомерДоговораПрошл = СтрокаМес.НомерДокумента;
											//	ДатаДоговораПрошл = СтрокаМес.ДатаДокумента;
											//	ПустойНомерДогПрошл = Истина;
											//КонецЕсли;
					
											Структура = Новый Структура;
											Структура.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
											если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
												Структура.Вставить( "ВидДоговора", null );
											Иначе 
												Структура.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
												
												//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												//Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
												//	Структура.Вставить( "НомерДокумента", НомерДоговораПрошл );
												//	Структура.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
												//КонецЕсли;
												//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												
												//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												Если ЗначениеЗаполнено( НомерДоговораПрошл ) Тогда
													Структура.Вставить( "НомерДокумента", НомерДоговораПрошл );
												КонецЕсли;
												//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												
											КонецЕсли;
											
											// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											Структура.Вставить( "ВидДейтельности", "ДОГОВОР" );
											// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											
											СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура);
											
											//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
											Если СтрокиПоРаботнику.Количество() = 0 Тогда
												Структура.ВидДейтельности = "НЕОПЛДОГ";
												СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура);
											КонецЕсли; 
											//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
											
											КоличествоЗаписейОСтаже = 0;
											ПредыдущийВидДейтельности = "";
											ПредыдущееОкончаниеРабот = "";
											ДатаНачалаРабот = "";
											Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
												//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.НачалоРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ОкончаниеРабот)) Тогда 
												//	Продолжить;
												//КонецЕсли;
												
												
												Если ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности) Тогда 
													Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//ДатаФормирования = СтрокаСтаж.НачалоРабот; //О.Т. Аверсон 22.04.2019 № 4269 //СтрЗаменить(СтрокаСтаж.НачалоРабот,"2011","2012");
														//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
														//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
														//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
														//ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														ДатаНачалаРабот   = Формат( СтрокаСтаж.НачалоРабот, "ДФ=""дд/ММ/гггг""" );
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														ДатаНачалаДоговора = СтрокаСтаж.НачалоРабот;
														ДатаОкончанияДоговора = СтрокаСтаж.ОкончаниеРабот;
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//Если НачалоМесяца( СтрокаСтаж.НачалоРабот ) <> НачалоМесяца( СтрокаСтаж.ОкончаниеРабот ) 
														//		и Год( СтрокаСтаж.НачалоРабот ) < Год( СтрокаСтаж.ОкончаниеРабот ) Тогда
														//	ДатаФормирования = КонецМесяца(СтрокаСтаж.НачалоРабот);
														//иначе
														//	ДатаФормирования = СтрокаСтаж.ОкончаниеРабот;
														//КонецЕсли;
														//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
														//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
														//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
														//ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														ВерхняяГраницаПериода = Мин( ДатаОкончания, СтрокаСтаж.ОкончаниеРабот );
														Если Год( СтрокаСтаж.НачалоРабот ) < Год( ВерхняяГраницаПериода ) Тогда
															ДатаФормирования = КонецГода( СтрокаСтаж.НачалоРабот );
														иначе
															ДатаФормирования = ВерхняяГраницаПериода;
														КонецЕсли;
														ДатаОкончанияРабот = Формат( ДатаФормирования, "ДФ=""дд/ММ/гггг""" );
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														
														Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
															
															// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
															//О.Т. Аверсон 14.05.2019 № 4328
															//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки( 
															//	Новый Структура( "ФизЛицо, ДатаНачалаРабот, ДатаОкончанияРабот, ВидДеятельности",
															//	ВыборкаПоРаботникиОрганизации.ФизЛицо, СтрокаСтаж.НачалоРабот, НачалоДня( ДатаФормирования ), НеоплДог ) ); 
															//
															//ЗначВидДеят = Неопределено;
															//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
															//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
															//КонецЕсли;
															////О.Т. Аверсон 14.05.2019 № 4328

															//СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
															//	+ СокрЛП( ?( ЗначениеЗаполнено( ЗначВидДеят ), ЗначВидДеят, СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
															// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
															
															// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
															ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже,
																					НомерДоговораПрошл, ДатаДоговораПрошл );
															СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
																+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
															// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
															
															ТекстФайла.ДобавитьСтроку( СтрокаЗар );
															ТекСтрока = ТекСтрока + 1;
															// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
															КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
															// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
															
														КонецЕсли;
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;//О.Т. 09.03.2015 № ниже суммируется
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
														//ЗапросНеОплДог = Новый Запрос;
														//ЗапросНеОплДог.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
														//ЗапросНеОплДог.Текст = "
														//| Выбрать 
														//| ТЧСведОСтаже.ФизЛицо,
														//| ТЧСведОСтаже.Договор,
														//| ТЧСведОСтаже.ВидДеятельности
														//| Поместить ВТТЧСведОСтаже
														//| из &ТЧСведОСтаже как ТЧСведОСтаже
														//| ГДЕ ТЧСведОСтаже.ФизЛицо = &ФизЛицо";
														//ЗапросНеОплДог.УстановитьПараметр("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
														//ЗапросНеОплДог.УстановитьПараметр("НеОплДог",НеоплДог);
														//ЗапросНеОплДог.УстановитьПараметр("ТЧСведОСтаже",СведенияОСтаже);
														//
														//ЗапросНеОплДог.Выполнить();
														//ЗапросНеОплДог.Текст = "
														//| Выбрать 
														//| ТЧСведОСтаже.ФизЛицо,
														//| ТЧСведОСтаже.Договор,
														//| ТЧСведОСтаже.ВидДеятельности
														//| из ВТТЧСведОСтаже как ТЧСведОСтаже
														////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
														////| ГДЕ ТЧСведОСтаже.Договор.Номер = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
														////- СВЭЙ КДЯ 25.07.19 СВФР-004561
														////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
														//| ГДЕ ТЧСведОСтаже.Договор.НомерДляПУ = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
														////- СВЭЙ КДЯ 25.07.19 СВФР-004561
														// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
														
														Если Категория = "03" тогда
															НомерДоговора = СокрЛП(НомерДоговораПрошл);
															ДатаФормирования = ДатаДоговораПрошл;
															ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
															МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
															ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
															ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
															Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
																СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=");
																
																// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																//ЗапросНеОплДог.УстановитьПараметр("Номер",НомерДоговора);
																//ЗапросНеОплДог.УстановитьПараметр("Дата",ДатаФормирования);
																//																
																//РезНеОплДог = ЗапросНеОплДог.Выполнить().Выгрузить();
																//ЕстьНеоплДог = РезНеОплДог.Количество();
																// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																
																// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже,
																						НомерДоговораПрошл, ДатаДоговораПрошл );
																// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																
															КонецЕсли;
														КонецЕсли; 
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//ПериодНач = НачалоМесяца(ДобавитьМесяц(СтрокаСтаж.НачалоРабот,1));
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														ПериодНач = НачалоГода( ДобавитьМесяц( СтрокаСтаж.НачалоРабот, 12 ) );
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//Если Год( СтрокаСтаж.НачалоРабот ) < Год( СтрокаСтаж.ОкончаниеРабот )  Тогда
														//	
														//	Пока ПериодНач <= НачалоМесяца(СтрокаСтаж.ОкончаниеРабот) Цикл
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														Пока Год( ПериодНач ) <= Год( ВерхняяГраницаПериода ) Цикл
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																//ДатаФормирования = ПериодНач; //О.Т. Аверсон 22.04.2019 № 4269 //СтрЗаменить(СтрокаСтаж.НачалоРабот,"2011","2012");
																//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
																//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
																//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
																//ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																ДатаНачалаРабот   = Формат( ПериодНач, "ДФ=""дд/ММ/гггг""" );
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
																ДатаНачалаДоговора = СтрокаСтаж.НачалоРабот;
																ДатаОкончанияДоговора = СтрокаСтаж.ОкончаниеРабот;
																
																
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																//Если НачалоМесяца(ПериодНач) = НачалоМесяца(СтрокаСтаж.ОкончаниеРабот) Тогда
																//	ДатаФормирования = СтрокаСтаж.ОкончаниеРабот;
																//иначе
																//	ДатаФормирования = КонецМесяца(ПериодНач);
																//КонецЕсли;
																//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
																//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
																//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
																//ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																Если Год( ПериодНач ) < Год( ВерхняяГраницаПериода ) Тогда
																	ДатаФормирования = КонецГода( ПериодНач );
																иначе
																	ДатаФормирования = ВерхняяГраницаПериода;
																КонецЕсли;
																ДатаОкончанияРабот = Формат( ДатаФормирования, "ДФ=""дд/ММ/гггг""" );
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
														
																
																
																Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
																	
																	
																	// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																	//О.Т. Аверсон 14.05.2019 № 4328
																	//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки( 
																	//	Новый Структура( "ФизЛицо, ДатаНачалаРабот, ДатаОкончанияРабот, ВидДеятельности",
																	//	ВыборкаПоРаботникиОрганизации.ФизЛицо, СтрокаСтаж.НачалоРабот, НачалоДня( ДатаФормирования ), НеоплДог ) ); 
																	//
																	//ЗначВидДеят = Неопределено;
																	//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
																	//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
																	//КонецЕсли;
																	////О.Т. Аверсон 14.05.2019 № 4328

																	//СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
																	//	+ СокрЛП( ?( ЗначениеЗаполнено( ЗначВидДеят ), ЗначВидДеят, СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
																	// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																	
																	// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																	ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже,
																							НомерДоговораПрошл, ДатаДоговораПрошл );
																	СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
																		+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
																	// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																	
																	ТекстФайла.ДобавитьСтроку( СтрокаЗар );
																	ТекСтрока = ТекСтрока + 1;
																	
																	// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																	КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1; 
																	// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																	
																КонецЕсли;
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																//КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1; //О.Т. 09.03.2015 № ниже суммируется
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
																
																// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																//ЗапросНеОплДог = Новый Запрос;
																//ЗапросНеОплДог.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
																//ЗапросНеОплДог.Текст = "
																//| Выбрать 
																//| ТЧСведОСтаже.ФизЛицо,
																//| ТЧСведОСтаже.Договор,
																//| ТЧСведОСтаже.ВидДеятельности
																//| Поместить ВТТЧСведОСтаже
																//| из &ТЧСведОСтаже как ТЧСведОСтаже
																//| ГДЕ ТЧСведОСтаже.ФизЛицо = &ФизЛицо";
																//ЗапросНеОплДог.УстановитьПараметр("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
																//ЗапросНеОплДог.УстановитьПараметр("НеОплДог",НеоплДог);
																//ЗапросНеОплДог.УстановитьПараметр("ТЧСведОСтаже",СведенияОСтаже);
																//
																//ЗапросНеОплДог.Выполнить();
																//ЗапросНеОплДог.Текст = "
																//| Выбрать 
																//| ТЧСведОСтаже.ФизЛицо,
																//| ТЧСведОСтаже.Договор,
																//| ТЧСведОСтаже.ВидДеятельности
																//| из ВТТЧСведОСтаже как ТЧСведОСтаже
																////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
																////| ГДЕ ТЧСведОСтаже.Договор.Номер = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
																////- СВЭЙ КДЯ 25.07.19 СВФР-004561
																////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
																//| ГДЕ ТЧСведОСтаже.Договор.НомерДляПУ = &Номер и ТЧСведОСтаже.Договор.ДатаНачала = &Дата и ТЧСведОСтаже.ВидДеятельности = &НеОплДог ";
																////- СВЭЙ КДЯ 25.07.19 СВФР-004561
																// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																
																Если Категория = "03" тогда
																	НомерДоговора = СокрЛП(НомерДоговораПрошл);
																	ДатаФормирования = ДатаДоговораПрошл;
																	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
																	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
																	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
																	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
																	Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
																		СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=");
																				
																		// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																		//ЗапросНеОплДог.УстановитьПараметр("Номер",НомерДоговора);
																		//ЗапросНеОплДог.УстановитьПараметр("Дата",ДатаФормирования);
																		//																
																		//РезНеОплДог = ЗапросНеОплДог.Выполнить().Выгрузить();
																		//ЕстьНеоплДог = РезНеОплДог.Количество();
																		// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																		
																		// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																		ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
																		// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
																		
																	КонецЕсли;
																КонецЕсли;
																
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																//ПериодНач = ДобавитьМесяц(ПериодНач,1);
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																ПериодНач = НачалоГода( ДобавитьМесяц( ПериодНач, 12 ) );
																// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
																
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														//	КонецЦикла; // ПериодНач <= НачалоМесяца(СтрокаСтаж.ОкончаниеРабот)
														//КонецЕсли; // Год( СтрокаСтаж.НачалоРабот ) < Год( СтрокаСтаж.ОкончаниеРабот )
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														
														// + СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )
														КонецЦикла; // Пока Год( ПериодНач ) <= Год( СтрокаСтаж.ОкончаниеРабот ) 
														// - СВЭЙ КДЯ 21.08.19 СВФР-004631 ( пункт 10. )

														
														ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
														ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
														
														
													КонецЕсли; // СтрокаСтаж.ВидДейтельности <> "СП2     "
												КонецЕсли; // ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности)
											КонецЦикла; // СтрокаСтаж из СтрокиПоРаботнику
											//Если ПустойНомерДогПрошл Тогда 
											//	НомерДоговораПрошл = "";
											//	ДатаДоговораПрошл = "";
											//КонецЕсли;

										КонецЕсли; // СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл							
										
									КонецЕсли; // КатегорияВывод= "ДОГОВОР"
									
																		
									
									если НазначениеПенсии Тогда 
										ТипЗаписиНач2 = "СТАЖ=";
										Структура = Новый Структура;
										Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
										если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
											Структура.Вставить("ВидДоговора",null);
										Иначе 
											Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
											// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
												Структура.Вставить("НомерДокумента",НомерДоговораПрошл);
												//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												//Структура.Вставить("ДатаДляПУ",ДатаДоговораПрошл);
												//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											КонецЕсли;
											// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										КонецЕсли;
										ПериодПенсии = СтрокиПоРаботнику1[СтрокиПоРаботнику1.Количество()-1].Период;
										ДеньШапки        = ?(День(НачалоМесяца(ПериодПенсии))<10,"0","")+День(НачалоМесяца(ПериодПенсии));
										МесяцШапки       = ?(Месяц(НачалоМесяца(ПериодПенсии))<10,"0","")+Месяц(НачалоМесяца(ПериодПенсии));
										ГодШапки 		 = Строка(СокрЛП(Формат(Год(НачалоМесяца(ПериодПенсии)), "ЧГ=0")));
										ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										ДеньШапки        = ?(День(КонецМесяца(ПериодПенсии))<10,"0","")+День(КонецМесяца(ПериодПенсии));
										МесяцШапки       = ?(Месяц(КонецМесяца(ПериодПенсии))<10,"0","")+Месяц(КонецМесяца(ПериодПенсии));
										ГодШапки 		 = Строка(СокрЛП(Формат(Год(КонецМесяца(ПериодПенсии)), "ЧГ=0")));
										ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач2+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+"ПЕНСИЯ= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										ПенсияВыгружена = Истина;
									КонецЕсли;
									
									ТипЗаписиНач3 = "СТАЖ=";
									СтруктураДети = Новый Структура;
									СтруктураДети.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
									если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
										СтруктураДети.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
									Иначе 
										СтруктураДети.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
											СтруктураДети.Вставить( "НомерДокумента", НомерДоговораПрошл );
											//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											//СтруктураДети.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
											//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										КонецЕсли;
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									КонецЕсли;
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									//СтруктураДети.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ДЕТИ"));
									//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураДети); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									СтруктураДети.Вставить( "ВидДеятельности", "ДЕТИ" );
									СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураДети ); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									
									
									
									//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
									ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
									//- СВЭЙ КДЯ 25.07.19 СВФР-004561
												 					
									ПредыдущийВидДейтельности = "";
									ПредыдущееОкончаниеРабот = "";
									ДатаНачалаРабот = "";
									
									Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
										если не (ДатаДоговораПрошл >= СтрокаСтаж.ДатаНачалаРабот и  ДатаДоговораПрошл <= СтрокаСтаж.ДатаОкончанияРабот) Тогда 
											Продолжить;
										КонецЕсли;
										
										ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										
										ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ДЕТИ"+"= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										ДетиВыгружена = Истина;
										//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
										//ДетиЕсть = Истина;
										//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
										//Если Категория = "03" тогда
										//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
										//КонецЕсли;
										//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
										//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
										
									КонецЦикла;
									
									
									
									ТипЗаписиНач3 = "СТАЖ=";
									СтруктураПособие = Новый Структура;
									СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
									если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
										СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
									Иначе 
										СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
											СтруктураПособие.Вставить( "НомерДокумента", НомерДоговораПрошл );
											//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											//СтруктураПособие.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
											//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										КонецЕсли;
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									КонецЕсли;
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									//СтруктураПособие.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПОСОБИЕ") );
									//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									СтруктураПособие.Вставить( "ВидДеятельности", "ПОСОБИЕ" );
									СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПособие ); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
									ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
									//- СВЭЙ КДЯ 25.07.19 СВФР-004561
												 					
									ПредыдущийВидДейтельности = "";
									ПредыдущееОкончаниеРабот = "";
									ДатаНачалаРабот = "";
									
									Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
										//О.Т. Аверсон 23.08.2018 № 2335
										Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
											Если СтрокаСтаж.Договор <> ДокументОснованиеПрошл Тогда 
												Продолжить;								
											КонецЕсли;
										иначе
											если не (ДатаДоговораПрошл >= СтрокаСтаж.ДатаНачалаРабот и  ДатаДоговораПрошл <= СтрокаСтаж.ДатаОкончанияРабот) Тогда 
												Продолжить;
											КонецЕсли;
										КонецЕсли;
										//О.Т. Аверсон 23.08.2018 № 2335
										
										ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-201
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										
										ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПОСОБИЕ"+"= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										ПособиеВыгружена = Истина;
										
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;//О.Т. 09.03.2015 № ниже суммируется
										//Если Категория = "03" тогда
										//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
										//КонецЕсли;
										//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
										//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
										
									КонецЦикла;
									
									//О.Т. Аверсон 21.05.2018 № 1985
									ТипЗаписиНач3 = "СТАЖ=";
									СтруктураПособие = Новый Структура;
									СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
									если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
										СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
									Иначе 
										СтруктураПособие.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора);
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
											СтруктураПособие.Вставить( "НомерДокумента", НомерДоговораПрошл );
											//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											//СтруктураПособие.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
											//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										КонецЕсли;
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									КонецЕсли;
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									//СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("СТРАХСЛУЧ"));
									//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									СтруктураПособие.Вставить( "ВидДеятельности", "СТРАХСЛУЧ" );
									СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПособие ); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									
									//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
									ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
									//- СВЭЙ КДЯ 25.07.19 СВФР-004561
									
									ПредыдущийВидДейтельности = "";
									ПредыдущееОкончаниеРабот = "";
									ДатаНачалаРабот = "";
									
									Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
										если не (ДатаДоговораПрошл >= СтрокаСтаж.ДатаНачалаРабот и  ДатаДоговораПрошл <= СтрокаСтаж.ДатаОкончанияРабот) Тогда 
											Продолжить;
										КонецЕсли;
										
										ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										
										ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"СТРАХСЛУЧ"+"= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										СтрахСлучВыгружена = Истина;
										
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;//О.Т. 09.03.2015 № ниже суммируется
										//Если Категория = "03" тогда
										//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
										//КонецЕсли;
										//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
										//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
										
									КонецЦикла;
									//О.Т. Аверсон 21.05.2018 № 1985

									
									ТипЗаписиНач3 = "СТАЖ=";
									СтруктураПособие = Новый Структура;
									СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
									если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
										СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
									Иначе 
										СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
											СтруктураПособие.Вставить( "НомерДокумента", НомерДоговораПрошл );
											//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											//СтруктураПособие.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
											//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
										КонецЕсли;
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									КонецЕсли;
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									//СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПРЕМИЯ"));
									//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									СтруктураПособие.Вставить( "ВидДеятельности", "ПРЕМИЯ" );
									СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПособие ); 
									// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
									
									//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
									ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
									//- СВЭЙ КДЯ 25.07.19 СВФР-004561
												 					
									ПредыдущийВидДейтельности = "";
									ПредыдущееОкончаниеРабот = "";
									ДатаНачалаРабот = "";
									
									Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
										если не (ДатаДоговораПрошл >= СтрокаСтаж.ДатаНачалаРабот и  ДатаДоговораПрошл <= СтрокаСтаж.ДатаОкончанияРабот) Тогда 
											Продолжить;
										КонецЕсли;
										
										ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										
										ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПРЕМИЯ"+"= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										ПремияВыгружена = Истина;
										
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;//О.Т. 09.03.2015 № ниже суммируется
										//Если Категория = "03" тогда
										//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
										//КонецЕсли;
										//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
										//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
										
									КонецЦикла;
									
									Если (СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл) и НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
										ТипЗаписиНач3 = "СТАЖ=";
										СтруктураВзносыВр = Новый Структура;
										СтруктураВзносыВр.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
										если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
											СтруктураВзносыВр.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
										Иначе 
											СтруктураВзносыВр.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
											// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
												СтруктураВзносыВр.Вставить( "НомерДокумента", НомерДоговораПрошл );
												//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												//СтруктураВзносыВр.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
												//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
											КонецЕсли;
											// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										КонецЕсли;
										
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										//СтруктураВзносыВр.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ВЗНОСЫВРЕМ"));
										//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураВзносыВр); 
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										СтруктураВзносыВр.Вставить( "ВидДеятельности", "ВЗНОСЫВРЕМ" );
										СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураВзносыВр ); 
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											
										
										// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
										ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
										// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
									
										ПредыдущийВидДейтельности = "";
										ПредыдущееОкончаниеРабот = "";                                   
										ДатаНачалаРабот = "";
										// + СВЭЙ КДЯ 22.08.19 СВФР-004631 ( пункт 10. )
										//Прерывание = Ложь;
										// - СВЭЙ КДЯ 22.08.19 СВФР-004631 ( пункт 10. )
										Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
											
											// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											//// + СВЭЙ КДЯ 22.08.19 СВФР-004631 ( пункт 10. )
											//если НомерДоговораПрошл <> ПолучитьНомерДокументаДляПУ( СтрокаСтаж.Договор ) 
											//	 ИЛИ ДатаДоговораПрошл <> ПолучитьДатуДокументаДляПУ( СтрокаСтаж.Договор ) Тогда 
											//	Продолжить;
											//КонецЕсли;
											//// - СВЭЙ КДЯ 22.08.19 СВФР-004631 ( пункт 10. )
											// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											
											// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											Если НомерДоговораПрошл <> СтрокаСтаж.НомерДокумента 
												 //+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												 //ИЛИ ДатаДоговораПрошл <> СтрокаСтаж.ДатаДляПУ 
												 //- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
												 Тогда 
												Продолжить;
											КонецЕсли;
											// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
											
											// + СВЭЙ КДЯ 22.08.19 СВФР-004631 ( пункт 10. )
											//если не (ДатаДоговораПрошл >= СтрокаСтаж.ДатаНачалаРабот и  ДатаДоговораПрошл <= СтрокаСтаж.ДатаОкончанияРабот) Тогда 
											//	Продолжить;
											//КонецЕсли;
											//если Прерывание Тогда 
											//	Продолжить;
											//КонецЕсли;
											//если КатегорияВывод = "ДОГОВОР" Тогда
											//	
											//	если не ДатаНачалаДоговора = Дата(1,1,1) Тогда 
											//		ДатаФормированияДети = ДатаНачалаДоговора; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//		Прерывание = Истина;
											//	иначе
											//		ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//	КонецЕсли;

											//иначе
											//	ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//КонецЕсли;

											//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
											//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
											//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
											//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
											//
											//если КатегорияВывод = "ДОГОВОР" Тогда
											//	Если НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <> НачалоМесяца(ДатаОкончанияДоговора) и Год(СтрокаСтаж.ДатаНачалаРабот) < Год(ДатаОкончанияДоговора) Тогда
											//		ДатаФормированияДети = КонецМесяца(СтрокаСтаж.ДатаНачалаРабот);
											//	иначе
											//		если не ДатаОкончанияДоговора = Дата(1,1,1) Тогда 
											//			ДатаФормированияДети = ДатаОкончанияДоговора;
											//		иначе
											//			ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
											//		КонецЕсли;
											//	КонецЕсли;
											//иначе
											//	ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
											//КонецЕсли;
											//
											//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
											//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
											//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
											//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
											//
											//СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаРаботДети + "=" + ДатаОкончанияРаботДети + "= =" + "ВЗНОСЫВРЕМ" + "= = =" );
											//ТекстФайла.ДобавитьСтроку( СтрокаЗар );
											//ТекСтрока = ТекСтрока + 1;
											//ВзносыВрВыгружена = Истина;
											//
											////ТекстФайла.ДобавитьСтроку(СтрокаЗар);
											////ТекСтрока = ТекСтрока+1;
											//КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1; //О.Т. 09.03.2015 № ниже суммируется
											
											//ПериодНач = НачалоМесяца(ДобавитьМесяц(СтрокаСтаж.ДатаНачалаРабот,1));
											//Если Год( СтрокаСтаж.ДатаНачалаРабот ) < Год( ДатаОкончанияДоговора )  Тогда															
											//		
											//	Пока ПериодНач <= НачалоМесяца(ДатаОкончанияДоговора) Цикл 
											//		
											//		если КатегорияВывод = "ДОГОВОР" Тогда 
											//			если не ДатаНачалаДоговора = Дата(1,1,1) Тогда 
											//				ДатаФормированияДети = ПериодНач; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//				Прерывание = Истина;
											//			иначе
											//				ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//			КонецЕсли;
											//		иначе
											//			ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
											//		КонецЕсли;
											//		
											//		ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
											//		МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
											//		ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
											//		ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
											//		
											//		
											//		если КатегорияВывод = "ДОГОВОР" Тогда
											//			Если НачалоМесяца(ПериодНач) <> НачалоМесяца(ДатаОкончанияДоговора) и Год(СтрокаСтаж.ДатаНачалаРабот) < Год(ДатаОкончанияДоговора) Тогда
											//				ДатаФормированияДети = КонецМесяца(ПериодНач);
											//			иначе
											//				
											//				если не ДатаОкончанияДоговора = Дата(1,1,1) Тогда 
											//					ДатаФормированияДети = ДатаОкончанияДоговора;
											//				иначе
											//					ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
											//				КонецЕсли;
											//			КонецЕсли;
											//		иначе
											//			ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
											//		КонецЕсли;
											//		ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
											//		МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
											//		ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
											//		ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
											//		ПериодНач = ДобавитьМесяц(ПериодНач,1);
											//
											//		СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ВЗНОСЫВРЕМ"+"= = =");
											//		ТекстФайла.ДобавитьСтроку( СтрокаЗар);
											//		ТекСтрока = ТекСтрока + 1;
											//		сТРОК = ТекстФайла.ПолучитьТекст();
											//		ВзносыВрВыгружена = Истина;
											//		
											//		//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
											//		//ТекСтрока = ТекСтрока+1;
											//		КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;//О.Т. 09.03.2015 № ниже суммируется
													
											//	КонецЦикла;
											//	
											//КонецЕсли;
											// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
											
											// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
											НижняяГраницаПериода = Макс( СтрокаСтаж.ДатаНачалаРабот, Дата( 2014, 1, 1 ) );  //Задача № 4269 Аверсон 22.04.2019
											ВерхняяГраницаПериода = Мин( ДатаОкончания, СтрокаСтаж.ДатаОкончанияРабот );
											
											ДатаНачалаРаботСтрокой = Формат( НижняяГраницаПериода, "ДФ=""дд/ММ/гггг""" );
											
											если КатегорияВывод = "ДОГОВОР" Тогда
												Если Год( НижняяГраницаПериода ) < Год( ВерхняяГраницаПериода ) Тогда
													ДатаОкончанияРабот = КонецГода( НижняяГраницаПериода );
												иначе
													ДатаОкончанияРабот = ВерхняяГраницаПериода;
												КонецЕсли;
											иначе
												ДатаОкончанияРабот = ВерхняяГраницаПериода;
											КонецЕсли;
											ДатаОкончанияРаботСтрокой  = Формат( ДатаОкончанияРабот, "ДФ=""дд/ММ/гггг""" );
											
														
											СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаРаботСтрокой + "=" + ДатаОкончанияРаботСтрокой + "= =" + "ВЗНОСЫВРЕМ" + "= = =" );
											ТекстФайла.ДобавитьСтроку( СтрокаЗар );
											ТекСтрока = ТекСтрока + 1;
											ВзносыВрВыгружена = Истина;
											КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
											
											
											ПериодНач = НачалоГода( ДобавитьМесяц( НижняяГраницаПериода, 12 ) );
											Пока Год( ПериодНач ) <= Год( ВерхняяГраницаПериода ) Цикл
													
													ДатаНачалаРаботСтрокой = Формат( ПериодНач, "ДФ=""дд/ММ/гггг""" );
													ДатаОкончанияРаботСтрокой = Формат( Мин( КонецГода( ПериодНач ), ВерхняяГраницаПериода ), "ДФ=""дд/ММ/гггг""" );
											
													СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаРаботСтрокой + "=" + ДатаОкончанияРаботСтрокой + "= =" + "ВЗНОСЫВРЕМ" + "= = =" );
													ТекстФайла.ДобавитьСтроку( СтрокаЗар );
													ТекСтрока = ТекСтрока + 1;
													ВзносыВрВыгружена = Истина;
													
													КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
													ПериодНач = НачалоГода( ДобавитьМесяц( ПериодНач, 12 ) );
													
											КонецЦикла; // Пока Год( ПериодНач ) <= Год( ВерхняяГраницаПериода ) Цикл
											// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
											
											//Если Категория = "03" тогда
											//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
											//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
											//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
											//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
											//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
											//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
											//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
											//КонецЕсли;
											//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
											//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
											
										КонецЦикла; // СтрокаСтаж из СтрокиПоРаботнику

									КонецЕсли; // СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл) и НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> ""
									//О.Т. Аверсон 16.03.2017 № 362
									//СтрокаФайла1 = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, " ", СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
									//?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
									//?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
									//?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
									//?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
									//?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
									//?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
									//Формат(КоличествоМес,"ЧГ=0")+"="+?(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0")))="0","0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))+"="+ДатаЗаполнения+"= ="+Формат(ГОД(ДатаРегистрации),"ЧГ=0")+"="+СтрЗаменить(ТелефонОрганизации," ",""))+"=";
									//ДоговорНом = ?(ЗначениеЗаполнено(НомерДоговора),СтрЗаменить(Число(НомерДоговора)," ",""),"");
									//ДоговорДата = ?(ЗначениеЗаполнено(ДатаДокумента),ДатаДокумента,"");
									//СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+ДоговорНом+"="+ДоговорДата+"=");
									//О.Т. Аверсон 16.03.2017 № 362
									
									
									ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар+">");
									ТекстФайла.ДобавитьСтроку(СтрокаФайла1); 
									ТекСтрока = ТекСтрока+1;
	
									//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
									//Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
										//ДопСтрокаФайла1 = СтрЗаменить( НомерДоговораПрошл, " ", "" ) + "=" +  Формат( ДатаДоговораПрошл, "ДФ=""дд/ММ/гггг""" ) + "=" ;
									Если ЗначениеЗаполнено( НомерДоговора ) И ЗначениеЗаполнено( ДатаДокумента ) Тогда
										ДопСтрокаФайла1 = СтрЗаменить( НомерДоговора, " ", "" ) + "=" +  Формат( ДатаДокумента, "ДФ=""дд/ММ/гггг""" ) + "=" ;
									Иначе
										ДопСтрокаФайла1 = "";
									КонецЕсли;		
									//- СВЭЙ КДЯ 22.10.19 СВФР-004948
									
									// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
									СтрокаФайла1 = ВРЕГ( ПрефиксСтрокаФайла1
									
									//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
									+ ДопСтрокаФайла1
									//- СВЭЙ КДЯ 22.10.19 СВФР-004948
									
									+ ?(РаботДоход = 0, ?(ЕстьНеоплДог,"0"," "), СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
									?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
									?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
									?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
									?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
									?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
									?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
									
									?( ЕстьНеоплДог ИЛИ КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
									+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
									                  
									+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
									+ Формат( ГОД( ДатаНачала ),"ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
									// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
											
									если СчДляПУ > 0 Тогда 
										ТекстФайла.ЗаменитьСтроку(ТекСтрокаДляСтрПУ,СтрокаФайла1);
									иначе
										ТекстФайла.ЗаменитьСтроку(СтрокаЗамены,СтрокаФайла1);
									КонецЕсли;
									СчДляПУ = 1;
									ТекСтрокаДляСтрПУ = ТекСтрока;
									СчДляКолСтажа = 1;
									КоличествоЗаписейОСтаже = 0;
									
									
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
									ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
									ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;

								КонецЕсли;
							иначе
								ТекстФайла.ДобавитьСтроку(СтрокаФайла);
								ТекСтрока = ТекСтрока+1;
							КонецЕсли;
							
							ТипЗаписиНач = "НЧСЛ=";
							//если Сч <= СтрокиПоРаботнику1.Количество()-1 Тогда 
							//	если не КатегорияВывод= "ДОГОВОР" Тогда
							//		ИтогДохода = ИтогДохода + РаботДоход;
							//		ИтогБольн = ИтогБольн + РаботБольн;
							//		ИтогВзнос = ИтогВзнос + РаботВзнос;
							//		ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
							//		ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
							//		ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
							//	иначе
							//		ИтогДохода = ИтогДохода + РаботДоход;
							//		ИтогБольн = ИтогБольн + РаботБольнСлед;
							//		ИтогВзнос = ИтогВзнос + РаботВзносСлед;
							//		ИтогВзнос1 = ИтогВзнос1 + РаботВзносСлед1;
							//		ИтогВзнос2 = ИтогВзнос2 + РаботВзносСлед2;
							//		ИтогВзнос3 = ИтогВзнос3 + РаботВзносСлед3;
							//		
							//	КонецЕсли;
							//иначе
							//	если КатегорияВывод= "ДОГОВОР" Тогда
							//		ИтогДохода = ИтогДохода + РаботДоход;
							//		ИтогБольн = ИтогБольн + РаботБольн;
							//		ИтогВзнос = ИтогВзнос + РаботВзнос;
							//		ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
							//		ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
							//		ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
							//		
							//	иначе
							//		ИтогДохода = ИтогДохода + РаботДоход;
							//		ИтогБольн = ИтогБольн + РаботБольн;
							//		ИтогВзнос = ИтогВзнос + РаботВзнос;
							//		ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
							//		ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
							//		ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
							//		
							//	КонецЕсли;
							//КонецЕсли;
							если СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл Тогда 
								РаботДоход = 0;
								РаботДоходСлед = 0;
								РаботБольнСлед = 0;
								РаботВзносСлед = 0;
								РаботВзносСлед1 = 0;
								РаботВзносСлед2 = 0;
								РаботВзносСлед3 = 0;
								РаботБольн = 0;
								РаботВзнос = 0;
								РаботВзнос1 = 0;
								РаботВзнос2 = 0;
								РаботВзнос3 = 0;
								КоличествоМес = 0; 
								КоличествоДокументов 	= КоличествоДокументов+1;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					
					//толик 	добавил округление - ЧДЦ=0;
					//Если (ЗначениеЗаполнено(СтрокаМес.СуммаДохода) Или ЗначениеЗаполнено(СтрокаМес.Больничные) или ЗначениеЗаполнено(СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд)) Тогда
					//Островская Татьяна 31.10.2012 № 15958
					если КатегорияВывод = 	"ДОГОВОР" Тогда 
						СтрокаМес.СуммаДохода = РезультатДоговор;
					иначе
						СтрокаМес.СуммаДохода = СтрокаМес.СуммаДохода - РезультатДоговор;
					КонецЕсли;
					//О.Т. Аверсон 29.08.2018 № 2363
					Если ЗначениеЗаполнено( ВидНалогообложения ) Тогда 
						ОсновнойВидНалогообл = ВидНалогообложения;
					иначе
						ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
					КонецЕсли;
					//О.Т. Аверсон 29.08.2018 № 2363
					
					//О.Т. Аверсон 06.03.2019 № 4054
					СтавкаИнвалид = 0;
					РезультатЗапросаИнвалид = Новый Запрос;
					РезультатЗапросаИнвалид.Текст = 
					"ВЫБРАТЬ
					|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо
					|ИЗ
					|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&Период, ) КАК СведенияОбИнвалидностиФизлицСрезПоследних
					|ГДЕ
					|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность";
					
					РезультатЗапросаИнвалид.УстановитьПараметр("Период", НачалоМесяца(СтрокаМес.Период));
										
					РезультатЗапросаИнвалид = РезультатЗапросаИнвалид.Выполнить().Выгрузить();
					Если не РезультатЗапросаИнвалид.Количество()=0 Тогда 
						МесяцЧисло = Строка(Месяц(СтрокаМес.Период));
						ЗапросСтавка.Текст = 
						"ВЫБРАТЬ
						|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка
						|ИЗ
						|	ПакетГражд"+МесяцЧисло+" КАК ГражданствоФизЛицСрезПоследних
						|ГДЕ
						|	ГражданствоФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
						
						ЗапросСтавка.УстановитьПараметр("ФизЛицо",СтрокаМес.ФизЛицо);
						
						РезультатЗапросаСтавка = ЗапросСтавка.Выполнить().Выбрать();
						
						Пока РезультатЗапросаСтавка.Следующий() Цикл
							СтавкаИнвалид = РезультатЗапросаСтавка.ИнаяСтавка; 
						КонецЦикла;

					КонецЕсли;
					//О.Т. Аверсон 06.03.2019 № 4054

	
					СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокаМес.Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокаМес.Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
					БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
					
					Если СтрокаМес.СуммаДохода > БазаОграниченияФСЗН Тогда 
						СтрокаМес.СуммаДохода = БазаОграниченияФСЗН;
					КонецЕсли;
					
					
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					
						
					СтрЗар = ?(СтрокаМес.СуммаДохода = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.СуммаДохода,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					если не КатегорияВывод= "ДОГОВОР" Тогда
						СтрБлн = ?(СтрокаМес.Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					иначе
						СтрБлн = ?(СтрокаМес.Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					КонецЕсли;
					
					
					Если ЗначениеЗаполнено(СтавкаИнвалид) Тогда 
						СтрВзн1Число = 0; //0,28 не считается у инвалида   
						//О.Т. Аверсон 02.02.2018 № 1535
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							СтрВзн = ?(не ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокаМес.ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд),СтрокаМес.ПенсионныйФонд,0);
						иначе
							СтрВзн = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период));
						КонецЕсли;
						СтрВзн1 = "0";   
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*(0.01+СтавкаИнвалид/100),СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокаМес.ФизЛицо,СтрокаМес.Период));
							СуммаКоррект = 0;
							Для Каждого стр из МассивТЗСотрудники Цикл 
								СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
							КонецЦикла;
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект," ",""));
						иначе
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						КонецЕсли;
						СтрВзн3 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));//О.Т. Аверсон 17.03.2016 № 949 
						
						
					иначе
						//О.Т. Аверсон 02.02.2018 № 1535
						СтрВзн1Число = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период));   
						//О.Т. Аверсон 02.02.2018 № 1535
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							СтрВзн = ?(не ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокаМес.ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд),СтрокаМес.ПенсионныйФонд,0);
						иначе
							СтрВзн = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период));
						КонецЕсли;
						СтрВзн1 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));   
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокаМес.ФизЛицо,СтрокаМес.Период));
							СуммаКоррект = 0;
							Для Каждого стр из МассивТЗСотрудники Цикл 
								СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
							КонецЦикла;
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект," ",""));
						иначе
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						КонецЕсли;
						СтрВзн3 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));//О.Т. Аверсон 17.03.2016 № 949 
					КонецЕсли;
					
					
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////строки следующие 
					//если КатегорияВывод = 	"ДОГОВОР"  и СтрокаМес.СуммаДохода = 0 и СтрокаМес.Больничные = 0 Тогда
					//	ПериодДляДоговора = СтрокаМес.Период;
					//	Продолжить;
					//КонецЕсли;
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					
					если Сч+2 <= СтрокиПоРаботнику1.Количество() Тогда  
						РезультатДоговор= 0;
						
						// + СВЭЙ КДЯ СВФР-004561 02.08.19 + 18.09.19 СВФР-004631 ( пункт 31. )
						Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
						// - СВЭЙ КДЯ СВФР-004561 02.08.19
						// + СВЭЙ КДЯ СВФР-004561 02.08.19 - 18.09.19 СВФР-004631 ( пункт 31. )
						//Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда ИЛИ ЕстьРасшифровкиДоговоров ) Тогда
						// - СВЭЙ КДЯ СВФР-004561 02.08.19
						
						Если КатегорияВывод = "ДОГОВОР" Тогда
								
								
								// + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
								//// + СВЭЙ КДЯ СВФР-004561 02.08.19
								//ЗапросДог = Новый Запрос;
								//ЗапросДог.Текст = 
								//"ВЫБРАТЬ
								//|	ЕСНСведенияОДоходах.Результат
								//|ИЗ
								//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
								//|ГДЕ
								//|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
								//|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
								//|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
								////|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета"; //О.Т. Аверсон 31.01.2017 № 244
								//ЗапросДог.УстановитьПараметр("ФизЛицо",СтрокиПоРаботнику1[Сч+1].ФизЛицо);
								//ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
								//ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(СтрокиПоРаботнику1[Сч+1].Период));
								//ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(СтрокиПоРаботнику1[Сч+1].Период));
								////ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
								//РезДог = ЗапросДог.Выполнить().Выбрать();
								//
								//пока РезДог.Следующий() Цикл 
								//	РезультатДоговор = РезультатДоговор + РезДог.Результат; 
								//КонецЦикла;
								//// - СВЭЙ КДЯ СВФР-004561 02.08.19
								// - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
								
								//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
								Если ЗначениеЗаполнено( СтрокаМес.НомерДокумента ) Тогда
								//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
									
									ОтборДохода = Новый Структура( "ФизЛицо, Период, НомерДокумента, ДатаДокумента", 
										СтрокаМес.ФизЛицо, СтрокаМес.Период, СтрокаМес.НомерДокумента, СтрокаМес.ДатаДокумента );
									СтрокиДохода = ПромежуточнаяТаблица.НайтиСтроки( ОтборДохода );
									Для каждого СтрокаДохода Из СтрокиДохода Цикл
										РезультатДоговор = РезультатДоговор + СтрокаДохода.СуммаДохода;
									КонецЦикла;
									
								//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
								КонецЕсли; // ЗначениеЗаполнено( СтрокаМес.НомерДокумента ) Тогда
								//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 31. )
								
								// - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )

									
							КонецЕсли;
							
						Иначе
							РезультатДоговор = СтрокиПоРаботнику1[Сч+1].СуммаДохода ;
						КонецЕсли;
						
						если КатегорияВывод = 	"ДОГОВОР" Тогда 
							РаботДоходСл = РезультатДоговор;
						иначе
							РаботДоходСл = СтрокиПоРаботнику1[Сч+1].СуммаДохода - РезультатДоговор;
						КонецЕсли;
						//О.Т. Аверсон 29.08.2018 № 2363
						Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
							ОсновнойВидНалогообл = ВидНалогообложения;
						иначе
							ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
						КонецЕсли;
						//О.Т. Аверсон 29.08.2018 № 2363
						//О.Т. Аверсон 29.01.2018 № 1511
						СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокиПоРаботнику1[Сч+1].Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
						РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокиПоРаботнику1[Сч+1].Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
						БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
						
						Если РаботДоходСл > БазаОграниченияФСЗН Тогда 
							РаботДоходСл = БазаОграниченияФСЗН;
						КонецЕсли;
						//О.Т. Аверсон 29.01.2018 № 1511
						
						ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
						СтрЗарСл = ?(РаботДоходСл = 0, "0", СокрЛП(Строка(Формат(РаботДоходСл,"ЧДЦ=0;ЧГ=0"))));
						если не КатегорияВывод= "ДОГОВОР" Тогда
							СтрБлнСл = ?(СтрокиПоРаботнику1[Сч+1].Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[Сч+1].Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						иначе
							СтрБлнСл = ?(СтрокиПоРаботнику1[Сч+1].Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[Сч+1].Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтавкаИнвалид) Тогда
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзн1СлЧисло = 0;//для инвалида 0,28 не считается   
							//О.Т. Аверсон 02.02.2018 № 1535
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								СтрВзнСл = ?(не ЗначениеЗаполнено(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнСлЧисло = ?(ЗначениеЗаполнено(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд),СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд,0);
							иначе
								СтрВзнСл = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнСлЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период));
							КонецЕсли;
							
							СтрВзн1Сл = "0";   
							СуммаВсеСл = ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*(0.01+СтавкаИнвалид/100),СтрокаМес.Период);
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокиПоРаботнику1[Сч+1].ФизЛицо,СтрокиПоРаботнику1[Сч+1].Период));
								СуммаКоррект = 0;
								Для Каждого стр из МассивТЗСотрудники Цикл 
									СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
								КонецЦикла;
								
								СтрВзн2Сл = ?(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло+СуммаКоррект," ","")); //О.Т. Аверсон 02.02.2018 № 1535
							иначе
								
								СтрВзн2Сл = ?(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло=0,"0",СтрЗаменить(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло," ","")); //О.Т. Аверсон 02.02.2018 № 1535
							КонецЕсли;
							СтрВзн3Сл = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Сл)+Число(СтрВзн2Сл),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Сл)+Число(СтрВзн2Сл),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0")))); 
						
						иначе
							
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзн1СлЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.28,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.28,СтрокаМес.Период));   
							//О.Т. Аверсон 02.02.2018 № 1535
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								СтрВзнСл = ?(не ЗначениеЗаполнено(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнСлЧисло = ?(ЗначениеЗаполнено(СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд),СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд,0);
							иначе
								СтрВзнСл = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнСлЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.01,СтрокаМес.Период));
							КонецЕсли;
							
							СтрВзн1Сл = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.28,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.28,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));   
							СуммаВсеСл = ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходСл*0.35,СтрокаМес.Период);
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокиПоРаботнику1[Сч+1].ФизЛицо,СтрокиПоРаботнику1[Сч+1].Период));
								СуммаКоррект = 0;
								Для Каждого стр из МассивТЗСотрудники Цикл 
									СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
								КонецЦикла;
								
								СтрВзн2Сл = ?(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло+СуммаКоррект," ","")); //О.Т. Аверсон 02.02.2018 № 1535
							иначе
								
								СтрВзн2Сл = ?(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло=0,"0",СтрЗаменить(СуммаВсеСл-СтрВзнСлЧисло-СтрВзн1СлЧисло," ","")); //О.Т. Аверсон 02.02.2018 № 1535
							КонецЕсли;
							СтрВзн3Сл = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Сл)+Число(СтрВзн2Сл),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Сл)+Число(СтрВзн2Сл),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0")))); 
						КонецЕсли;
						
					КонецЕсли;
					
					
					//Островская Татьяна 31.10.2012 № 15958
					
					НомерМесяца = Формат(Месяц(СтрокаМес.Период),"ЧГ=0");
					
					//+ СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					//изменился формат файла пачки ПУ-3 - незначащие нули не проходят проверку
					//если НомерМесяца = Лев(НомерМесяца,1) Тогда 
					//	НомерМесяца = "0"+НомерМесяца;
					//КонецЕсли;
					//- СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					
					//Островская Татьяна 30.11.2012 № 15958
					//Островская Татьяна 30.11.2012 № 15958
					//СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаМес.ФизЛицо));
					//Для каждого СтрДог из СтрокиПоРаб цикл 
					//	если КатегорияВывод= "ДОГОВОР" Тогда
					//		если Основные Тогда
					//		Иначе 
					//			если СтрБлн = "0" Тогда 
					//				СтрБлн = " ";
					//				Прервать;
					//			КонецЕсли;
					//		КонецЕсли;
					//	КонецЕсли;
					//	
					//КонецЦикла;
					
					
					//Островская Татьяна 30.11.2012 № 15958
					
					//О.Т. Аверсон 29.08.2018 № 2363
					МесяцЧисло = Строка(Месяц(СтрокаМес.Период));
					
					ЗапросУв.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизацийСрезПоследних.Период
					|ИЗ
					|	ПакетУВ"+МесяцЧисло+" КАК РаботникиОрганизацийСрезПоследних
					|ГДЕ
					|	РаботникиОрганизацийСрезПоследних.ФизЛицо = &ФизЛицо"; 					
					ЗапросУв.УстановитьПараметр("ФизЛицо", СтрокаМес.ФизЛицо);
					
					РезультатЗапросаУв = ЗапросУв.Выполнить().Выбрать();
					ДатаУвольнения = Дата(1,1,1);
					Пока РезультатЗапросаУв.Следующий() Цикл
						ДатаУвольнения = РезультатЗапросаУв.Период;
					КонецЦикла;
					
					Если ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*1/100,СтрокаМес.Период)<> СтрВзнЧисло и ЗначениеЗаполнено(ДатаУвольнения) Тогда
						ДатаУвольненияФормат = Формат(ДатаУвольнения,"ДФ=""дд/ММ/гггг""");
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+НомерМесяца+"="+СтрЗар+"="+СтрБлн+"="+СтрВзн+"="+СтрВзн1+"="+СтрВзн2+"="+СтрВзн+"="+СтрВзн3+"=0="+?(СтавкаИнвалид,"0","28")+"=6="+ДатаУвольненияФормат+"=");
					иначе
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+НомерМесяца+"="+СтрЗар+"="+СтрБлн+"="+СтрВзн+"="+СтрВзн1+"="+СтрВзн2+"="+СтрВзн+"="+СтрВзн3+"=1="+?(СтавкаИнвалид,"0","28")+"=6= "+"="); //Островская Татьяна 17.01.2013 № 16153
					КонецЕсли;
					//О.Т. Аверсон 15.03.2019 № 4091
					Если не ДатаНачала < Дата(2019,01,01) Тогда
						Если ЗначениеЗаполнено(СтрокаМес.ПричиныМинимальнойЗП) Тогда
							СтрокаЗар = СтрокаЗар + СтрокаМес.ПричиныМинимальнойЗП.Код+"=";
						иначе   						
							СтрокаЗар = СтрокаЗар + " =";  						
						КонецЕсли;
					КонецЕсли;
					//О.Т. Аверсон 15.03.2019 № 4091
					
					
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					Если ЕстьВзносы Тогда
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
						
						//О.Т. Аверсон 29.08.2018 № 2363
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						//толик формирование контрольного файла
						Дбф.Добавить();
						Дбф.УстановитьЗначениеПоля("FIO", СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо)));
						Дбф.УстановитьЗначениеПоля("Dato", СтрокаМес.Период);
						Дбф.УстановитьЗначениеПоля("Sm", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода, СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
						Дбф.УстановитьЗначениеПоля("Bl", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.Больничные, СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
						Дбф.УстановитьЗначениеПоля("Vz", ОбщегоНазначения.ОкруглитьЗначение2016((СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд), СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
						Дбф.Записать();
						
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					КонецЕсли; // ЕстьВзносы
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					
					если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
						РаботДоходСлед = РаботДоходСлед + Число(РаботДоходСл);
						РаботБольнСлед = РаботБольнСлед + Число(СтрБлнСл);
						//Островская Татьяна 17.01.2014 № 17051
						РаботВзносСлед = РаботВзносСлед + Число(СтрВзнСл);
						РаботВзносСлед1 = РаботВзносСлед1 + Число(СтрВзн1Сл);
						//СуммаВсе = окр(СтрокиПоРаботнику1[Сч+1].СуммаДохода*0.35);					
						РаботВзносСлед2 = РаботВзносСлед2 + Число(СтрВзн2Сл);
						
						РаботВзносСлед3 = РаботВзносСлед3 + Число(СтрВзн3Сл);
						
						
						
						
						//если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
						//	РаботДоходСлед = РаботДоход + Окр(СтрокиПоРаботнику1[Сч+1].СуммаДохода, 0);
						//	РаботБольнСлед = РаботБольн + СтрокиПоРаботнику1[Сч+1].Больничные;
						//	РаботВзносСлед = РаботВзнос + СтрокиПоРаботнику1[Сч+1].ФСЗН + СтрокиПоРаботнику1[Сч+1].ПенсионныйФонд;
						//	РаботДоход = РаботДоход + Окр(СтрокаМес.СуммаДохода, 0);
						//	РаботБольн = РаботБольн + СтрокаМес.Больничные;
						//	РаботВзнос = РаботВзнос + СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд;
						//	//если не КатегорияВывод= "ДОГОВОР" Тогда
						//	//	ИтогДохода = ИтогДохода + РаботДоход;
						//	//	ИтогБольн = ИтогБольн + РаботБольн;
						//	//	ИтогВзнос = ИтогВзнос + РаботВзнос;
						//	//иначе
						//	//	ИтогДохода = ИтогДохода + РаботДоходСлед;
						//	//	ИтогБольн = ИтогБольн + РаботБольнСлед;
						//	//	ИтогВзнос = ИтогВзнос + РаботВзносСлед;
						//	//КонецЕсли;
						//иначе
						//	если КатегорияВывод= "ДОГОВОР" Тогда
						//		РаботДоход = РаботДоход + Окр(СтрокиПоРаботнику1[0].СуммаДохода, 0);
						//		РаботБольн = РаботБольн + СтрокиПоРаботнику1[0].Больничные;
						//		РаботВзнос = РаботВзнос + СтрокиПоРаботнику1[0].ФСЗН + СтрокиПоРаботнику1[0].ПенсионныйФонд;
						//		//ИтогДохода = ИтогДохода + РаботДоход;
						//		//ИтогБольн = ИтогБольн + РаботБольн;
						//		//ИтогВзнос = ИтогВзнос + РаботВзнос;
						//		
						//	иначе
						//		РаботДоход = РаботДоход + Окр(СтрокаМес.СуммаДохода, 0);
						//		РаботБольн = РаботБольн + СтрокаМес.Больничные;
						//		РаботВзнос = РаботВзнос + СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд;
						//		//ИтогДохода = ИтогДохода + РаботДоход;
						//		//ИтогБольн = ИтогБольн + РаботБольн;
						//		//ИтогВзнос = ИтогВзнос + РаботВзнос;
						//		
						//	КонецЕсли;
						//КонецЕсли;
						
						
						
						
						
						//Островская Татьяна 17.01.2014 № 17051
						РаботДоход = РаботДоход + Число(СтрЗар);
						РаботБольн = РаботБольн + Число(СтрБлн);
						РаботВзнос = РаботВзнос + Число(СтрВзн); //Островская Татьяна 17.01.2014 № 17051
						РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1); //Островская Татьяна 17.01.2014 № 17051
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2); //Островская Татьяна 17.01.2014 № 17051
						РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3); //Островская Татьяна 17.01.2014 № 17051
						//если не КатегорияВывод= "ДОГОВОР" Тогда
						//	ИтогДохода = ИтогДохода + РаботДоход;
						//	ИтогБольн = ИтогБольн + РаботБольн;
						//	ИтогВзнос = ИтогВзнос + РаботВзнос;
						//иначе
						//	ИтогДохода = ИтогДохода + РаботДоходСлед;
						//	ИтогБольн = ИтогБольн + РаботБольнСлед;
						//	ИтогВзнос = ИтогВзнос + РаботВзносСлед;
						//КонецЕсли;
					иначе 
						РезультатДоговор= 0;
						Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
							
							если КатегорияВывод= "ДОГОВОР" Тогда
								ЗапросДог = Новый Запрос;
								ЗапросДог.Текст = 
								"ВЫБРАТЬ
								|	ЕСНСведенияОДоходах.Результат
								|ИЗ
								|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
								|ГДЕ
								|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
								|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
								|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
								//|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета";//О.Т. Аверсон 31.01.2017 № 244
								ЗапросДог.УстановитьПараметр("ФизЛицо",СтрокиПоРаботнику1[0].ФизЛицо);
								ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
								ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(СтрокиПоРаботнику1[0].Период));
								ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(СтрокиПоРаботнику1[0].Период));
								//ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
								РезДог = ЗапросДог.Выполнить().Выбрать();
								пока РезДог.Следующий() Цикл 
									РезультатДоговор =РезультатДоговор+РезДог.Результат; 
								КонецЦикла;
							КонецЕсли;
						иначе
							РезультатДоговор = СтрокиПоРаботнику1[0].СуммаДохода;
						КонецЕсли;
						
						если КатегорияВывод = 	"ДОГОВОР" Тогда 
							РаботДоходПер = РезультатДоговор;
						иначе
							РаботДоходПер = СтрокиПоРаботнику1[0].СуммаДохода - РезультатДоговор;
						КонецЕсли;
						//О.Т. Аверсон 29.08.2018 № 2363
						Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
							ОсновнойВидНалогообл = ВидНалогообложения;
						иначе
							ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
						КонецЕсли;
						//О.Т. Аверсон 29.08.2018 № 2363
						
						//О.Т. Аверсон 06.03.2019 № 4054
						СтавкаИнвалид = 0;
						РезультатЗапросаИнвалид = Новый Запрос;
						РезультатЗапросаИнвалид.Текст = 
						"ВЫБРАТЬ
						|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо
						|ИЗ
						|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&Период, ) КАК СведенияОбИнвалидностиФизлицСрезПоследних
						|ГДЕ
						|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность";
						
						РезультатЗапросаИнвалид.УстановитьПараметр("Период", НачалоМесяца(СтрокаМес.Период));
						
						РезультатЗапросаИнвалид = РезультатЗапросаИнвалид.Выполнить().Выгрузить();
						Если не РезультатЗапросаИнвалид.Количество()=0 Тогда
							МесяцЧисло = Строка(Месяц(СтрокаМес.Период));
							ЗапросСтавка.Текст = 
							"ВЫБРАТЬ
							|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка
							|ИЗ
							|	ПакетГражд"+МесяцЧисло+" КАК ГражданствоФизЛицСрезПоследних
							|ГДЕ
							|	ГражданствоФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
							
							ЗапросСтавка.УстановитьПараметр("ФизЛицо",СтрокаМес.ФизЛицо);
							
							РезультатЗапросаСтавка = ЗапросСтавка.Выполнить().Выбрать();
							
							Пока РезультатЗапросаСтавка.Следующий() Цикл
								СтавкаИнвалид = РезультатЗапросаСтавка.ИнаяСтавка; 
							КонецЦикла;
							
						КонецЕсли;
						//О.Т. Аверсон 06.03.2019 № 4054
						
						СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокиПоРаботнику1[0].Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
						РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокиПоРаботнику1[0].Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
						БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
						
						Если РаботДоходПер > БазаОграниченияФСЗН Тогда 
							РаботДоходПер = БазаОграниченияФСЗН;
						КонецЕсли;
						
						
						ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
						СтрЗарПр = ?(РаботДоходПер = 0, "0", СокрЛП(Строка(Формат(РаботДоходПер,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						если не КатегорияВывод= "ДОГОВОР" Тогда
							СтрБлнПер = ?(СтрокиПоРаботнику1[0].Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[0].Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						иначе
							СтрБлнПер = ?(СтрокиПоРаботнику1[0].Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[0].Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтавкаИнвалид) Тогда 
							//О.Т. Аверсон 01.02.2018 № 1535
							СтрВзн1ПерЧисло = 0;   
							//О.Т. Аверсон 01.02.2018 № 1535
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								СтрВзнПер = ?(не ЗначениеЗаполнено(СтрокиПоРаботнику1[0].ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[0].ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнПерЧисло = ?(ЗначениеЗаполнено(СтрокиПоРаботнику1[0].ПенсионныйФонд),СтрокиПоРаботнику1[0].ПенсионныйФонд,0);
							иначе
								СтрВзнПер = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнПерЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период));
							КонецЕсли;
							
							СтрВзн1Пер = "0";   
							
							СуммаВсеПер = ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*(0.01+СтавкаИнвалид/100),СтрокаМес.Период);
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокиПоРаботнику1[0].ФизЛицо,СтрокиПоРаботнику1[0].Период));
								СуммаКоррект = 0;
								Для Каждого стр из МассивТЗСотрудники Цикл 
									СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
								КонецЦикла;
								
								СтрВзн2Пер = ?(СуммаВсеПер-СтрВзнПерЧисло - СтрВзн1ПерЧисло+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсеПер - СтрВзнПерЧисло - СтрВзн1ПерЧисло+СуммаКоррект," ",""));
							иначе
								
								СтрВзн2Пер = ?(СуммаВсеПер-СтрВзнПерЧисло - СтрВзн1ПерЧисло=0,"0",СтрЗаменить(СуммаВсеПер - СтрВзнПерЧисло - СтрВзн1ПерЧисло," ",""));
							КонецЕсли;
							
							СтрВзн3Пер = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Пер)+Число(СтрВзн2Пер),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Пер)+Число(СтрВзн2Пер),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0")))); 
							
						иначе
							
							//О.Т. Аверсон 01.02.2018 № 1535
							СтрВзн1ПерЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.28,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.28,СтрокаМес.Период));   
							//О.Т. Аверсон 01.02.2018 № 1535
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								СтрВзнПер = ?(не ЗначениеЗаполнено(СтрокиПоРаботнику1[0].ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокиПоРаботнику1[0].ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнПерЧисло = ?(ЗначениеЗаполнено(СтрокиПоРаботнику1[0].ПенсионныйФонд),СтрокиПоРаботнику1[0].ПенсионныйФонд,0);
							иначе
								СтрВзнПер = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
								//О.Т. Аверсон 02.02.2018 № 1535
								СтрВзнПерЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.01,СтрокаМес.Период));
							КонецЕсли;
							
							СтрВзн1Пер = ?(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.28,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.28,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));   
							
							СуммаВсеПер = ОбщегоНазначения.ОкруглитьЗначение2016(РаботДоходПер*0.35,СтрокаМес.Период);
							Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
								МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокиПоРаботнику1[0].ФизЛицо,СтрокиПоРаботнику1[0].Период));
								СуммаКоррект = 0;
								Для Каждого стр из МассивТЗСотрудники Цикл 
									СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
								КонецЦикла;
								
								СтрВзн2Пер = ?(СуммаВсеПер-СтрВзнПерЧисло - СтрВзн1ПерЧисло+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсеПер - СтрВзнПерЧисло - СтрВзн1ПерЧисло+СуммаКоррект," ",""));
							иначе
								
								СтрВзн2Пер = ?(СуммаВсеПер-СтрВзнПерЧисло - СтрВзн1ПерЧисло=0,"0",СтрЗаменить(СуммаВсеПер - СтрВзнПерЧисло - СтрВзн1ПерЧисло," ",""));
							КонецЕсли;
							
							СтрВзн3Пер = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Пер)+Число(СтрВзн2Пер),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1Пер)+Число(СтрВзн2Пер),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0")))); 
						КонецЕсли;
						
						
						//если КатегорияВывод= "ДОГОВОР" Тогда
						//	РаботДоход = РаботДоход + РаботДоходПер;
						//	РаботБольн = РаботБольн + Число(СтрБлнПер);
						//	//Островская Татьяна 17.01.2014 № 17051
						//	РаботВзнос = РаботВзнос + Число(СтрВзнПер);
						//	РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1Пер);
						//	//СуммаВсе = окр(СтрокиПоРаботнику1[0].СуммаДохода*0.35);
						//	
						//	РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2Пер);
						//	РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3Пер);
						//	//Островская Татьяна 17.01.2014 № 17051
						//	//ИтогДохода = ИтогДохода + РаботДоход;
						//	//ИтогБольн = ИтогБольн + РаботБольн;
						//	//ИтогВзнос = ИтогВзнос + РаботВзнос;
						//	
						//иначе
						РаботДоход = РаботДоход + Число(СтрЗар);
						РаботБольн = РаботБольн + Число(СтрБлн);
						РаботВзнос = РаботВзнос + Число(СтрВзн);
						//Островская Татьяна 17.01.2014 № 17051
						РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1);
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2);
						РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3);
						//Островская Татьяна 17.01.2014 № 17051
						//ИтогДохода = ИтогДохода + РаботДоход;
						//ИтогБольн = ИтогБольн + РаботБольн;
						//ИтогВзнос = ИтогВзнос + РаботВзнос;
						
						//КонецЕсли;
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					Если ЕстьВзносы Тогда
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
						КоличествоМес = КоличествоМес + 1;
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					КонецЕсли;
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					
					//КонецЕсли;
					если не Сч > Колич-1 Тогда
						
						Если КатегорияВывод = "ДОГОВОР" Тогда
							
							//если СчДляКолСтажа = 1 и ДатаДоговораПрошл<>"" Тогда 
							//	если КатегорияВывод= "ДОГОВОР" Тогда
							//		
							//		ТипЗаписиНач = "СТАЖ=";
							//		Структура = Новый Структура;
							//		Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
							//		если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							//			Структура.Вставить("ВидДоговора",null);
							//		Иначе 
							//			Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
							//			Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
							//				Структура.Вставить("НомерДокумента",СтрокаМес.НомерДокумента);
							//				Структура.Вставить("НачалоРабот",СтрокаМес.ДатаДокумента);
							//			КонецЕсли;
							//		КонецЕсли;
							//		
							//		СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура); 
							//		
							//		Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							//			
							//			Если ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности) Тогда 
							//				Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда 
							//					
							//					КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//					
							//				КонецЕсли;
							//			КонецЕсли;
							//		КонецЦикла;
							//	КонецЕсли;
							//КонецЕсли;
							//
							//если СчДляКолСтажа >= 0 Тогда	
							//	ТипЗаписиНач3 = "СТАЖ=";
							//	СтруктураПособие = Новый Структура;
							//	СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
							//	если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							//		СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
							//	Иначе 
							//		СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
							//	КонецЕсли;
							//	СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПОСОБИЕ"));
							//	СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
							//	
							//	Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							//		если не (СтрокаСтаж.ДатаНачалаРабот >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокументаи 
							//			и НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) = НачалоМесяца(СтрокаМес.Период)) Тогда 
							//			Продолжить;
							//		КонецЕсли;
							//		
							//		КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//		
							//	КонецЦикла;
							//	
							//	
							//	ТипЗаписиНач3 = "СТАЖ=";
							//	СтруктураВзносыВр = Новый Структура;
							//	СтруктураВзносыВр.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
							//	если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							//		СтруктураВзносыВр.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
							//	Иначе 
							//		СтруктураВзносыВр.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
							//	КонецЕсли;
							//	СтруктураВзносыВр.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ВЗНОСЫВРЕМ"));
							//	СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураВзносыВр); 
							//	
							//	Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							//		если не (СтрокаСтаж.ДатаНачалаРабот >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента 
							//			и НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) = НачалоМесяца(СтрокаМес.Период)) Тогда 
							//			Продолжить;
							//		КонецЕсли;
							//		
							//		КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//		
							//	КонецЦикла;
							//КонецЕсли;
							
							
							// + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
							////О.Т. Аверсон 31.08.2018 № 
							//СтруктураДоговоры = Новый Структура;
							//СтруктураДоговоры.Вставить( "ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо );
							//Если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							//	СтруктураДоговоры.Вставить( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
							//КонецЕсли;
							//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураДоговоры );
							// - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
							
							// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							//ВидДеятельностиПрошл = "";
							//ДоговорПрошл = "";
							//Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							//	//О.Т. Аверсон 23.08.2018 № 2335
							//	Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
							//		Если СтрокаСтаж.Договор <> СтрокаМес.ДокументОснование Тогда 
							//			Продолжить;								
							//		КонецЕсли;
							//	иначе
							//		если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
							//			и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
							//			//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
							//			Продолжить;
							//		КонецЕсли;
							//	КонецЕсли;
							//	
							//	
							//	//О.Т. Аверсон 23.08.2018 № 2335
							//	Если Год(СтрокаСтаж.ДатаНачалаРабот) < Год(СтрокаСтаж.ДатаОкончанияРабот) Тогда
							//		
							//		ПериодНач = НачалоМесяца(ДобавитьМесяц(СтрокаСтаж.ДатаНачалаРабот,1));															
							//		Пока ПериодНач <= НачалоМесяца(СтрокаСтаж.ДатаОкончанияРабот) Цикл 
							//			Если ДоговорПрошл <> СтрокаСтаж.Договор Тогда 
							//				КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//			ИначеЕсли ВидДеятельностиПрошл <> СтрокаСтаж.ВидДеятельности Тогда 
							//				КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//			КонецЕсли;
							//			ПериодНач = ДобавитьМесяц(ПериодНач,1);
							//		КонецЦикла;
							//		
							//	иначе
							//		Если ДоговорПрошл <> СтрокаСтаж.Договор Тогда 
							//			КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//		ИначеЕсли ВидДеятельностиПрошл <> СтрокаСтаж.ВидДеятельности Тогда 
							//			КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
							//		КонецЕсли;
							//	КонецЕсли;
							//	
							//	ВидДеятельностиПрошл = СтрокаСтаж.ВидДеятельности;
							//	ДоговорПрошл = СтрокаСтаж.Договор;
							//КонецЦикла;
							////О.Т. Аверсон 31.08.2018 № 
							// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							
							// + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
							////ПСА 04.07.2019 СВФР-004497++
							//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику
							//		                          //+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5. )
							//									, ЗначениеКв, СтрокаМес
							//								  //- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5. )
							//			 					);
							////+++ПСА 04.07.2019 СВФР-004497
							// - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
							
							//СтрокаЗар = СтрокаЗар + ">";
							
							//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
							Если ЕстьВзносы Тогда
							//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
								
								ТекстФайла.ЗаменитьСтроку( ТекСтрока, СтрокаЗар );
								
							//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
							КонецЕсли; // ЕстьВзносы
							//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
							
							// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							//если не Сч > Колич-1 Тогда
							//	СтрокаФайла1 = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, ?(ЕстьНеоплДог,"0"," "), СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
							//	?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
							//	?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
							//	?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
							//	?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
							//	?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
							//	?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
							//	
							//	//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
							//	//?( ЕстьНеоплДог и КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
							//	//+ ?(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0")))="0","0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
							//	//- СВЭЙ КДЯ 25.07.19 СВФР-004561
							//	//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
							//	?( ЕстьНеоплДог ИЛИ КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
							//	+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
							//	//- СВЭЙ КДЯ 25.07.19 СВФР-004561
							//	                  
							//	+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
							//	+ Формат( ГОД( ДатаНачала ),"ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
							//	//ДоговорНом = ?(ЗначениеЗаполнено(НомерДоговора),СтрЗаменить(СокрЛП(НомерДоговора)," ",""),"");
							//	//ДоговорДата = ?(ЗначениеЗаполнено(ДатаДокумента),ДатаДокумента,"");
							//	//
							//	//СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+ДоговорНом+"="+ДоговорДата+"=");

							//	//Островская Татьяна 20.01.2014 № 17051
							//КонецЕсли;
							//КоличествоЗаписейОСтаже = 0;
							// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							
							// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							ПрефиксСтрокаФайла1 = СтрокаФайла;
							// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
							
						КонецЕсли;
					иначе
						если  КатегорияВывод = "ДОГОВОР" Тогда
							//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
							Если ЕстьВзносы Тогда
							//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
								
								СтрокаЗар = СтрокаЗар + ">";
								ТекстФайла.ЗаменитьСтроку( ТекСтрока, СтрокаЗар );
									
							//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
							КонецЕсли; // ЕстьВзносы
							//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 17.01.2013 № 16153
					//Островская Татьяна 25.10.2012 № 15958	
					
					
					НомерДоговораПрошл = СтрокаМес.НомерДокумента;
					ДатаДоговораПрошл = СтрокаМес.ДатаДокумента;
					Если ВыгрузкаДоговоровПодрядаБезОграничения Тогда 
						ДокументОснованиеПрошл = СтрокаМес.ДокументОснование;//О.Т. Аверсон 23.08.2018 № 2335
					КонецЕсли;
					//О.Т. 06.03.2015 № 
					СчДляКолСтажа = СчДляКолСтажа + 1;
					
					Если ПериодДляДоговора <> СтрокаМес.Период Тогда // СВЭЙ КДЯ 25.07.19 СВФР-004561
						СтрМес = СтрМес + 1;
					КонецЕсли; // СВЭЙ КДЯ 25.07.19 СВФР-004561

					ПериодДляДоговора = СтрокаМес.Период;
				КонецЦикла; // Сч = 0 по Колич-1 ; начало со стр. 7185 7426 8371
				
				// Проверка Кол Стажа
				Если КатегорияВывод = "ДОГОВОР" Тогда 	
					
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					////Структура = Новый Структура;
					////Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					////если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					////	Структура.Вставить("ВидДоговора",null);
					////Иначе 
					////	Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					////	Структура.Вставить("НомерДокумента",СтрокаМес.НомерДокумента);
					////	Структура.Вставить("ДатаДляПУ",СтрокаМес.ДатаДокумента);
					////КонецЕсли;
					////СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура);
					//
					//
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					////Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл						
					////	Если ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности) Тогда 
					////		Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда 
					////			КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;		
					////		КонецЕсли;
					////	КонецЕсли;
					////КонецЦикла;
					////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//
					//// + СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
					//////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					////ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//// - СВЭЙ КДЯ 23.08.19 СВФР-004631 ( пункт 10. )
					//
					//
					//
					////+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////СтруктураПособие = Новый Структура;
					////СтруктураПособие.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					////если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					////	СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					////КонецЕсли;
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					////СтруктураПособие.Вставить( "ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ПОСОБИЕ" ) );
					////СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
					////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					////СтруктураПособие.Вставить( "ВидДеятельности", "ПОСОБИЕ" );
					////СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПособие ); 
					//////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//ОтборСтрокДоговора.ВидДеятельности = "ПОСОБИЕ";
					//СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокДоговора ); 
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//			 					
					//
					//Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
					//	
					//	//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					//	////О.Т. Аверсон 23.08.2018 № 2335
					//	//Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
					//	//	Если СтрокаСтаж.Договор <> СтрокаМес.ДокументОснование Тогда 
					//	//		Продолжить;								
					//	//	КонецЕсли;
					//	//иначе
					//	//	
					//	//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//	//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
					//	//	//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
					//	//	//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
					//	//	//	Продолжить;
					//	//	//КонецЕсли;
					//	//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//	
					//	//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//	Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес ) Тогда
					//	//			
					//	//		Продолжить;
					//	//		
					//	//	КонецЕсли;
					//	//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//		
					//	//КонецЕсли;
					//	////О.Т. Аверсон 23.08.2018 № 2335
					//	//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					//	
					//	//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//	Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
					//			
					//		Продолжить;
					//		
					//	КонецЕсли;
					//	//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//	КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
					//	
					//КонецЦикла;
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////СтруктураПремия = Новый Структура;
					////СтруктураПремия.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					////
					//////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////СтруктураПремия.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
					////Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
					////	СтруктураПремия.Вставить( "НомерДокумента", НомерДоговораПрошл );
					////	СтруктураПремия.Вставить( "ДатаДляПу", ДатаДоговораПрошл );
					////КонецЕсли;	
					//////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					////Если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					////	СтруктураПремия.Вставить( "ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
					////КонецЕсли;
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					////СтруктураПремия.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ПРЕМИЯ" ) );
					////СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураПремия ); 
					////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					////СтруктураПремия.Вставить( "ВидДеятельности", "ПРЕМИЯ" );
					////СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПремия ); 
					//////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					////+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//ОтборСтрокДоговора.ВидДеятельности = "ПРЕМИЯ";
					//СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокДоговора ); 
					////- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					//
					//
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//			 					
					//
					//Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
					//	
					//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
					//	//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
					//	//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
					//	//	Продолжить;
					//	//КонецЕсли;
					//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	
					//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
					//			
					//		Продолжить;
					//		
					//	КонецЕсли;
					//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	
					//	КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
					//	
					//КонецЦикла;
					//
					//
					//ТипЗаписиНач3 = "СТАЖ=";
					//СтруктураВзносыВр = Новый Структура;
					//СтруктураВзносыВр.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					//если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					//	СтруктураВзносыВр.Вставить( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
					//Иначе 
					//	СтруктураВзносыВр.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
					//	Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
					//		//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//		//Структура.Вставить("НомерДокумента",НомерДоговораПрошл);
					//		//Структура.Вставить("НачалоРабот",ДатаДоговораПрошл);
					//		//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//		//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//		СтруктураВзносыВр.Вставить( "НомерДокумента", НомерДоговораПрошл );
					//		// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					//		//СтруктураВзносыВр.Вставить( "ДатаДокумента", ДатаДоговораПрошл );
					//		// - СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					//		// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					//		СтруктураВзносыВр.Вставить( "ДатаДляПу", ДатаДоговораПрошл );
					//		// - СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					//		//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//	КонецЕсли;	
					//КонецЕсли;
					////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					////СтруктураВзносыВр.Вставить( "ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ВЗНОСЫВРЕМ"));
					////СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураВзносыВр); 
					////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					////+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//СтруктураВзносыВр.Вставить( "ВидДеятельности", "ВЗНОСЫВРЕМ" );
					//СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураВзносыВр ); 
					////- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
					//
					//Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
					//	
					//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина) 
					//	//	и СтрокаСтаж.ДатаНачалаРабот <= КонецМесяца(ПериодДляДоговора))
					//	//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
					//	////	или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
					//	//	если СтрокаСтаж.ДатаНачалаРабот > КонецМесяца(ПериодДляДоговора) Тогда 
					//	//		ВзносыВрВыгружена = Истина;
					//	//	КонецЕсли;
					//	//	
					//	//	Продолжить;
					//	//КонецЕсли;
					//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	
					//	//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
					//			
					//		Продолжить;
					//		
					//	КонецЕсли;
					//	//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
					//	
					//	КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
					//	
					//КонецЦикла;
					////О.Т. Аверсон 15.03.2019 № 4091
					////ПСА 04.07.2019 СВФР-004497++
					//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику
					//		                          //+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//									, ЗначениеКв
					//								  //- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//			 					);
					////+++ПСА 04.07.2019 СВФР-004497
					////О.Т. Аверсон 15.03.2019 № 4091
					////- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
					//
					//// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					////// + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
					////ОтборСтрокСтажаДоговора = Новый Структура;
					////ОтборСтрокСтажаДоговора.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					////ОтборСтрокСтажаДоговора.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
					////Если НомерДоговораПрошл <> "" Тогда
					////	ОтборСтрокСтажаДоговора.Вставить( "НомерДокумента", НомерДоговораПрошл );
					////	ОтборСтрокСтажаДоговора.Вставить( "ДатаДляПу", ДатаДоговораПрошл );
					////КонецЕсли;
					////СтрокиСтажаДоговора = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокСтажаДоговора );
					////
					////ЗначениеКв = ПолучитьЗначениеКВ( СтрокиСтажаДоговора, ЗначениеКв );
					////// - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
					//// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
					
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )

					
					//+ СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					ОтборСтрокСтажаДоговора = Новый Структура();
					ОтборСтрокСтажаДоговора.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					ОтборСтрокСтажаДоговора.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
					Если НомерДоговораПрошл <> "" И ДатаДоговораПрошл <> "" Тогда
						ОтборСтрокСтажаДоговора.Вставить( "НомерДокумента", НомерДоговораПрошл );
						//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
						//ОтборСтрокСтажаДоговора.Вставить( "ДатаДляПу", ДатаДоговораПрошл );
						//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
					КонецЕсли;
					СтрокиСтажаДоговора = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокСтажаДоговора );
					КоличествоЗаписейОСтаже = СтрокиСтажаДоговора.Количество();
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиСтажаДоговора, ЗначениеКв );
					//- СВЭЙ КДЯ 21.09.19 СВФР-004631 ( пункт 45. )
					
					
							
					СтрокаФайла1 = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, ?(ЕстьНеоплДог,"0"," "), СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
					?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//?(ЕстьНеоплДог и КоличествоМес=0,"0",Формат(КоличествоМес,"ЧГ=0"))+"="
					//+?(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0")))="0","0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					?( ЕстьНеоплДог ИЛИ КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					                  
					+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
					+ Формат( ГОД( ДатаНачала ),"ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
					//О.Т. Аверсон 01.03.2017 № 362
					//ДоговорНом = ?(ЗначениеЗаполнено(НомерДоговора),СтрЗаменить(Число(НомерДоговора)," ",""),"");
					//ДоговорДата = ?(ЗначениеЗаполнено(ДатаДокумента),ДатаДокумента,"");
					//СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+ДоговорНом+"="+ДоговорДата+"=");
					//О.Т. Аверсон 01.03.2017 № 362
					
					//если СчДляПУ > 0 Тогда
					//	СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+Число(НомерДоговора)+"="+ДатаДокумента+"=");
					//КонецЕсли;
				КонецЕсли;

				
				ДатаНачалаДоговора = Дата(1,1,1);
				ДатаОкончанияДоговора = Дата(1,1,1);
				если КатегорияВывод= "ДОГОВОР" Тогда 
					ТипЗаписиНач = "СТАЖ=";
					Структура = Новый Структура;
					Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						Структура.Вставить("ВидДоговора",null);
					Иначе 
						Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						Структура.Вставить("НомерДокумента",СтрокаМес.НомерДокумента);
						//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
						//Структура.Вставить("ДатаДляПУ",СтрокаМес.ДатаДокумента);
						//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
					КонецЕсли;
					
					// + СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40. )
					//// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
					//Структура.Вставить( "ВидДейтельности", "ДОГОВОР" );
					//// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
					// - СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40. )
					
					СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки( Структура ); 
					КоличествоЗаписейОСтаже = 0;
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.НачалоРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ОкончаниеРабот)) Тогда 
						//	Продолжить;
						//КонецЕсли;
						
						// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 37. )
						//// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
						//Если СокрЛП( СтрокаСтаж.ВидДейтельности ) = "ВЗНОСЫВРЕМ" Тогда
						//	Продолжить;	
						//КонецЕсли; 
						//// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
						// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 37. )
						
						// + СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40. )
						Если СокрЛП( СтрокаСтаж.ВидДейтельности ) <> "ДОГОВОР" 
							 И СокрЛП( СтрокаСтаж.ВидДейтельности ) <> "НЕОПЛДОГ" Тогда
							Продолжить;	
						КонецЕсли; 
						// - СВЭЙ КДЯ 20.09.19 СВФР-004631 ( пункт 40. )

						Если ЗначениеЗаполнено( СтрокаСтаж.ВидДейтельности ) Тогда 
							Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда 
								
								//О.Т. Аверсон 05.04.2019 № 4187
								ДатаНачалаДог = СтрокаСтаж.НачалоРабот;
								ДатаОкончанияДог = СтрокаСтаж.ОкончаниеРабот;
								
								// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								//Если Год( СтрокаСтаж.НачалоРабот ) < Год( ПериодДляДоговора ) Тогда
									
									//ЕстьНеопл = Ложь;
									//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ВидДеятельности",ВыборкаПоРаботникиОрганизации.ФизЛицо,НеоплДог));
									//Для Каждого стрЗначСвед из ЗначСведенияОСтаже Цикл 
									//	Если стрЗначСвед.ДатаНачалаРабот >= СтрокаСтаж.НачалоРабот и стрЗначСвед.ДатаНачалаРабот <= СтрокаСтаж.ОкончаниеРабот Тогда 
									//		ЕстьНеопл = Истина;
									//		Прервать;
									//	КонецЕсли;   											
									//КонецЦикла;
								// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

									
									Пока Год( ДатаНачалаДог ) < Год( ПериодДляДоговора ) Цикл 
										
										ДатаОкончанияДог = КонецГода( ДатаНачалаДог );
																			
										ДатаНачалаДоговора = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										
										// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										//ДатаФормирования = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										//
										//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										//
										//
										//ДатаФормирования = Мин(ДатаОкончанияДог,КонецМесяца(ПериодДляДоговора));
										//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										//ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										
										// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										ДатаНачалаРабот   = Формат( ДатаНачалаДог, "ДФ=""дд/ММ/гггг""" );
										ДатаОкончанияРабот   = Формат( Мин( ДатаОкончанияДог, КонецМесяца( ПериодДляДоговора ) ) , "ДФ=""дд/ММ/гггг""" );
										// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										
										// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
										////О.Т. Аверсон 14.05.2019 № 4328
										//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ДатаНачалаРабот,ДатаОкончанияРабот,ВидДеятельности",ВыборкаПоРаботникиОрганизации.ФизЛицо,ДатаНачалаДог,НачалоДня(ДатаФормирования),НеоплДог));  
										//
										//ЗначВидДеят = Неопределено;
										//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
										//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
										//КонецЕсли;
										//
										////О.Т. Аверсон 14.05.2019 № 4328
										//Если не ЕстьНеопл Тогда 
										//	СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+СокрЛП(?(ЗначениеЗаполнено(ЗначВидДеят),ЗначВидДеят,СтрокаСтаж.ВидДейтельности))+"= = =");
										//	ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//	ТекСтрока = ТекСтрока+1;
										//	КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
										//КонецЕсли;
										// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
												

										// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
										ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
										СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
											+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
										ТекстФайла.ДобавитьСтроку( СтрокаЗар );
										ТекСтрока = ТекСтрока + 1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
										// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
										
										Если Категория = "03" тогда
											НомерДоговора = СокрЛП(НомерДоговораПервый);
											ДатаФормирования = ДатаДоговораПервый;
											ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
											МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
											ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
											ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
											СтрокаФайла = СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=";
											//Для нового расчета договоров
											НомерДоговора = СокрЛП(СтрокаМес.НомерДокумента);
											ДатаФормирования = СтрокаМес.ДатаДокумента;
											ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
											МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
											ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
											ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
											СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=");
										КонецЕсли;
										
										ДатаНачалаДог = Дата(Год(ДатаНачалаДог)+1,01,01);
									КонецЦикла;
									
								// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								//КонецЕсли;
								//О.Т. Аверсон 05.04.2019 № 4187
								// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								
								// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
								//ДатаФормирования = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
								//ДатаНачалаДоговора = СтрокаСтаж.НачалоРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012

								//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
								//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
								//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
								//ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
								//
								//
								//ДатаФормирования = Мин(СтрокаСтаж.ОкончаниеРабот,КонецМесяца(ПериодДляДоговора));
								//ДатаОкончанияДоговора = Мин(СтрокаСтаж.ОкончаниеРабот,КонецМесяца(ПериодДляДоговора));
								//ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
								//МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
								//ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
								//ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
								// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
								
								// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
								ДатаНачалаДоговора = СтрокаСтаж.НачалоРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
								ДатаНачалаРабот   = Формат( ДатаНачалаДог, "ДФ=""дд/ММ/гггг""" );
								ДатаОкончанияРабот   = Формат( Мин( СтрокаСтаж.ОкончаниеРабот, ЭтотОбъект.ДатаОкончания ) , "ДФ=""дд/ММ/гггг""" );
								// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
								
								// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								////О.Т. Аверсон 14.05.2019 № 4328
								//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ДатаНачалаРабот,ДатаОкончанияРабот,ВидДеятельности",ВыборкаПоРаботникиОрганизации.ФизЛицо,ДатаНачалаДог,НачалоДня(ДатаФормирования),НеоплДог));
								//
								//ЗначВидДеят = Неопределено;
								//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
								//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
								//КонецЕсли;
								////О.Т. Аверсон 14.05.2019 № 4328
								//СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="
								//		+СокрЛП(?(ЗначениеЗаполнено(ЗначВидДеят),ЗначВидДеят,СтрокаСтаж.ВидДейтельности))+"= = =");
								// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

								// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
								СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
									+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
								// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

								ТекстФайла.ДобавитьСтроку( СтрокаЗар );
								ТекСтрока = ТекСтрока + 1;
								КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
								Если Категория = "03" тогда
									НомерДоговора = СокрЛП(НомерДоговораПервый);
									ДатаФормирования = ДатаДоговораПервый;
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
									СтрокаФайла = СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=";
									//Для нового расчета договоров
									НомерДоговора = СокрЛП(СтрокаМес.НомерДокумента);
									ДатаФормирования = СтрокаМес.ДатаДокумента;
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
									СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=");
								КонецЕсли;
								ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
								ПредыдущееОкончаниеРабот = ДатаОкончанияДоговора;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					
				КонецЕсли;			
				
				если СчДляПУ = 0 и КатегорияВывод = "ДОГОВОР" Тогда
					ДоговорНом = ?(ЗначениеЗаполнено(НомерДоговора),СтрЗаменить(НомерДоговора," ",""),"");
					ДоговорДата = ?(ЗначениеЗаполнено(ДатаДокумента),ДатаДокумента,"");
					СтрокаФайла1 = СтрЗаменить(СтрокаФайла1,СтрокаЗамена,СтрокаЗамена+ДоговорНом+"="+ДоговорДата+"=");
				КонецЕсли;
				
				
				Если КатегорияВывод = "ДОГОВОР" Тогда 
					
					если НазначениеПенсии Тогда 
						ТипЗаписиНач2 = "СТАЖ=";
						Структура = Новый Структура;
						Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
						если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							Структура.Вставить("ВидДоговора",null);
						Иначе 
							Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						КонецЕсли;
						ПериодПенсии = СтрокиПоРаботнику1[СтрокиПоРаботнику1.Количество()-1].Период;
						ДеньШапки        = ?(День(НачалоМесяца(ПериодПенсии))<10,"0","")+День(НачалоМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(НачалоМесяца(ПериодПенсии))<10,"0","")+Месяц(НачалоМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(НачалоМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						ДеньШапки        = ?(День(КонецМесяца(ПериодПенсии))<10,"0","")+День(КонецМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(КонецМесяца(ПериодПенсии))<10,"0","")+Месяц(КонецМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(КонецМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач2+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+"ПЕНСИЯ= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						ПенсияВыгружена = Истина;
					КонецЕсли;
					
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураДети = Новый Структура;
					СтруктураДети.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураДети.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						СтруктураДети.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					//СтруктураДети.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ДЕТИ" ) );
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураДети); 
					//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					СтруктураДети.Вставить( "ВидДеятельности", "ДЕТИ" );
					СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураДети ); 
					//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
						//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
						//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
						//	Продолжить;
						//КонецЕсли;
						//	
						//ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//
						//ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
								
							Продолжить;
							
						КонецЕсли;
						ДатаНачалаРаботДети   = Формат( СтрокаСтаж.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""" );
						ДатаОкончанияРаботДети = Формат( СтрокаСтаж.ДатаОкончанияРабот, "ДФ=""дд/ММ/гггг""" );
						//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаРаботДети + "=" + ДатаОкончанияРаботДети + "= =" + "ДЕТИ" + "= = =" );
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						ДетиВыгружена = Истина;
						//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						//ДетиЕсть = Истина;
						//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						
						//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						//КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
					
					
					
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураПособие = Новый Структура;
					СтруктураПособие.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураПособие.Вставить( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
					Иначе 
						//СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					//СтруктураПособие.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ПОСОБИЕ" ) );
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
					//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					СтруктураПособие.Вставить( "ВидДеятельности", "ПОСОБИЕ" );
					СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПособие ); 
					//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						//О.Т. Аверсон 23.08.2018 № 2335
						Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
							//Если СтрокаСтаж.Договор <> СтрокаМес.ДокументОснование Тогда 
							//	Продолжить;								
							//КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
							Если ЗначениеЗаполнено( СтрокаМес.ДокументОснование )
								И ( СтрокаСтаж.НомерДокумента <> ПолучитьНомерДокументаДляПУ( СтрокаМес.ДокументОснование )
								ИЛИ СтрокаСтаж.ДатаДокумента <> ПолучитьДатуДокументаДляПУ( СтрокаМес.ДокументОснование ) ) Тогда 
								Продолжить;								
							КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
						Иначе
							
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
							//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
							//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
							//	Продолжить;
							//КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
									
								Продолжить;
								
							КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						КонецЕсли;
						//О.Т. Аверсон 23.08.2018 № 2335

						
						//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						//ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//
						//ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПОСОБИЕ"+"= = =");
						//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						ДатаНачалаПособия   = Формат( СтрокаСтаж.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""" );
						ДатаОкончанияПособия = Формат( СтрокаСтаж.ДатаОкончанияРабот, "ДФ=""дд/ММ/гггг""" );
						СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаПособия + "=" + ДатаОкончанияПособия + "= =" + "ПОСОБИЕ" + "= = =" );
						//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						ПособиеВыгружена = Истина;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
					
					//О.Т. Аверсон 21.05.2018 № 1985
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураСтрахСлуч = Новый Структура;
					СтруктураСтрахСлуч.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураСтрахСлуч.Вставить( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					//СтруктураСтрахСлуч.Вставить( "ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "СТРАХСЛУЧ" ) );
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураСтрахСлуч ); 
					//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					СтруктураСтрахСлуч.Вставить( "ВидДеятельности", "СТРАХСЛУЧ" );
					СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураСтрахСлуч ); 
					//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						//О.Т. Аверсон 23.08.2018 № 2335
						Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
							Если СтрокаСтаж.Договор <> СтрокаМес.ДокументОснование Тогда 
								Продолжить;								
							КонецЕсли;
						иначе
							
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
							//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
							//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
							//	Продолжить;
							//КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							
							//+ СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
							если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
									
								Продолжить;
								
							КонецЕсли;
							//- СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 15. )
						
						КонецЕсли;
						//О.Т. Аверсон 23.08.2018 № 2335

						
						//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						//ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//
						//ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПОСОБИЕ"+"= = =");
						//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						
						
						//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						ДатаНачалаСтрахСлуч   = Формат( СтрокаСтаж.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""" );
						ДатаОкончанияСтрахСлуч = Формат( СтрокаСтаж.ДатаОкончанияРабот, "ДФ=""дд/ММ/гггг""" );
						СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаСтрахСлуч + "=" + ДатаОкончанияСтрахСлуч + "= =" + "СТРАХСЛУЧ" + "= = =" );
						//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						СтрахСлучВыгружена = Истина;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
					//О.Т. Аверсон 21.05.2018 № 1985
					
					
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураПремия = Новый Структура;
					СтруктураПремия.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураПремия.Вставить( "ВидДоговора", Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() );
					КонецЕсли;
					
					//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					//СтруктураПремия.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ПРЕМИЯ" ) );
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураПремия ); 
					//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					СтруктураПремия.Вставить( "ВидДеятельности", "ПРЕМИЯ" );
					СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураПремия ); 
					//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 26. )
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),СтрокаСтаж.Договор.Номер =СтрокаМес.НомерДокумента,истина))
						//	и ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда
						//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
						//	Продолжить;
						//КонецЕсли;
						//
						//ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//
						//ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						//
						//СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПРЕМИЯ"+"= = =");
						//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						
						//+ СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
								
							Продолжить;
							
						КонецЕсли;
						
						ДатаНачалаПремия   = Формат( СтрокаСтаж.ДатаНачалаРабот, "ДФ=""дд/ММ/гггг""" );
						ДатаОкончанияПремия = Формат( СтрокаСтаж.ДатаОкончанияРабот, "ДФ=""дд/ММ/гггг""" );
						СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаПремия + "=" + ДатаОкончанияПремия + "= =" + "ПРЕМИЯ" + "= = =" );
						//- СВЭЙ КДЯ 16.09.19 СВФР-004631 ( пункт 15. )
						
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						ПремияВыгружена = Истина;
						
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						
					КонецЦикла;

					
					//Если (СтрокаМес.НомерДокумента <> НомерДоговораПрошл или СтрокаМес.ДатаДокумента <> ДатаДоговораПрошл) и НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураВзносыВр = Новый Структура;
					СтруктураВзносыВр.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураВзносыВр.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						СтруктураВзносыВр.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
							// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
							//Структура.Вставить("НомерДокумента",НомерДоговораПрошл);
							//Структура.Вставить("НачалоРабот",ДатаДоговораПрошл);
							// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
							// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
							СтруктураВзносыВр.Вставить( "НомерДокумента", НомерДоговораПрошл );
							//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
							//СтруктураВзносыВр.Вставить( "ДатаДляПУ", ДатаДоговораПрошл );
							//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
							// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
						КонецЕсли;	
					КонецЕсли;
					
					// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					//СтруктураВзносыВр.Вставить( "ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду( "ВЗНОСЫВРЕМ" ) );
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураВзносыВр ); 
					// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					СтруктураВзносыВр.Вставить( "ВидДеятельности", "ВЗНОСЫВРЕМ" );
					СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( СтруктураВзносыВр ); 
					// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					
					// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					//ПредыдущийВидДейтельности = "";
					//ПредыдущееОкончаниеРабот = "";                                   
					//ДатаНачалаРабот = "";
					//Прерывание = Ложь;
					// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					ВыгруженыРанниеВзносы = Ложь;
					// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
						//если не (НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) <= НачалоМесяца(СтрокаМес.ДатаДокумента) 
						//			и СтрокаСтаж.ДатаОкончанияРабот >= СтрокаМес.ДатаДокумента 
						//			и ?( ЗначениеЗаполнено( СтрокаСтаж.Договор ), СтрокаСтаж.Договор.Номер = СтрокаМес.НомерДокумента, истина ) 
						//		и СтрокаСтаж.ДатаНачалаРабот <= КонецМесяца( ПериодДляДоговора ) )
						//		и ?( ЗначениеЗаполнено( СтрокаСтаж.Договор ), 
						//			не ( СтрокаСтаж.Договор.ДатаНачала <= СтрокаМес.ДатаДокумента 
						//				и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента ), Ложь ) Тогда
						//	
						//	//или ?(ЗначениеЗаполнено(СтрокаСтаж.Договор),не (СтрокаСтаж.Договор.ДатаНачала >= НачалоМесяца(СтрокаМес.ДатаДокумента) и СтрокаСтаж.Договор.ДатаОкончания >= СтрокаМес.ДатаДокумента),Ложь) Тогда //О.Т. Аверсон 04.04.2019 № 4187
						//	если СтрокаСтаж.ДатаНачалаРабот > КонецМесяца( ПериодДляДоговора ) Тогда 
						//		ВзносыВрВыгружена = Истина;
						//	КонецЕсли;
						//	Продолжить;
						//КонецЕсли;
						//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
						
						//+ СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
						// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
						//Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес ) Тогда
						// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
						// + СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
						Если НЕ СтрокаСтажаСоответствуетСтрокеМесяца( СтрокаСтаж, СтрокаМес, Истина ) Тогда
						// - СВЭЙ КДЯ 15.09.19 СВФР-004631 ( пункт 26. )
								
							Продолжить;
							
						КонецЕсли;
						//- СВЭЙ КДЯ 10.09.19 СВФР-004631 ( пункт 15. )
						
						
						// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
						//если Прерывание Тогда 
						//	Продолжить;
						//КонецЕсли;
						// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
			
						// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
						ДатаНачалаДоговора = СтрокаСтаж.ДатаНачалаРабот;
						// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
						// + СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 37. )
						ДатаНачалаДог = СтрокаСтаж.ДатаНачалаРабот;
						// - СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 37. )
						
						//О.Т. Аверсон 05.04.2019 № 4187
						если КатегорияВывод = "ДОГОВОР" 
									// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
									И НЕ ВыгруженыРанниеВзносы
									// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
									Тогда
									
							если не ДатаНачалаДоговора = Дата(1,1,1) Тогда
								
								// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
								Если Год( Дата( ДатаНачалаДоговора ) ) < Год( ПериодДляДоговора ) Тогда
								// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
									
									ДатаНачалаДог = Макс( Дата( ДатаНачалаДоговора ), Дата( 2014, 01, 01 ) );
									ДатаОкончанияДог = Дата( ДатаОкончанияДоговора );
									Пока Год( ДатаНачалаДог ) < Год( ПериодДляДоговора ) Цикл 
										ДатаОкончанияДог = КонецГода( ДатаНачалаДог );

										// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										//ДатаФормированияДети = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										//
										//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										//ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										//
										//
										//ДатаФормированияДети = ДатаОкончанияДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										//
										//ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										//МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										//ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										//ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										//
										//СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ВЗНОСЫВРЕМ"+"= = =");
										// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										
										
										// + СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										ДатаНачалаВзносыВрем   = Формат( ДатаНачалаДог, "ДФ=""дд/ММ/гггг""" );
										ДатаОкончанияВзносыВрем   = Формат( ДатаОкончанияДог , "ДФ=""дд/ММ/гггг""" );
										СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаВзносыВрем + "=" + ДатаОкончанияВзносыВрем + "= =" + "ВЗНОСЫВРЕМ" + "= = =" );
										// - СВЭЙ КДЯ 13.09.19 СВФР-004631 ( пункт 23. )
										
										ТекстФайла.ДобавитьСтроку( СтрокаЗар );
										ТекСтрока = ТекСтрока + 1;
										ВзносыВрВыгружена = Истина;
										
										// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
										ВыгруженыРанниеВзносы = Истина;
										// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
										
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
										
										ДатаНачалаДог = Дата( Год( ДатаНачалаДог ) + 1, 01, 01 )
									КонецЦикла;
									
								КонецЕсли; // Год(Дата(ДатаНачалаДоговора)) < Год(ПериодДляДоговора)
								
							КонецЕсли; // не ДатаНачалаДоговора = Дата(1,1,1)
							
						КонецЕсли; // КатегорияВывод = "ДОГОВОР"
						//О.Т. Аверсон 05.04.2019 № 4187					
						
						если КатегорияВывод = "ДОГОВОР" Тогда
								 
							Если не ДатаНачалаДоговора = Дата(1,1,1) Тогда
									 
								ДатаФормированияДети = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
								
								
								// + СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
								//Прерывание = Истина;
								// - СВЭЙ КДЯ 14.09.19 СВФР-004631 ( пункт 26. )
							Иначе 
								ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
							КонецЕсли;
						иначе
							ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012							
						КонецЕсли;

						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						
						если КатегорияВывод = "ДОГОВОР" Тогда 
							если не ДатаОкончанияДоговора = Дата(1,1,1) Тогда 
								ДатаФормированияДети = ДатаОкончанияДоговора; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
							Иначе 
								//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
								//ДатаФормированияДети = Мин(СтрокаСтаж.ДатаОкончанияРабот,КонецМесяца(ПериодДляДоговора));
								//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
								//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
								ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
								//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
							КонецЕсли;
						иначе
							//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
							//ДатаФормированияДети = Мин(СтрокаСтаж.ДатаОкончанияРабот,КонецМесяца(ПериодДляДоговора));
							//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
							//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
							ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
							//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 35. )
						КонецЕсли;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ( ТипЗаписиНач3 + ДатаНачалаРаботДети + "=" + ДатаОкончанияРаботДети + "= =" + "ВЗНОСЫВРЕМ" + "= = =" );
						ТекстФайла.ДобавитьСтроку( СтрокаЗар );
						ТекСтрока = ТекСтрока + 1;
						ВзносыВрВыгружена = Истина;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
					//КонецЕсли;
					
					
				КонецЕсли;
				
				
				////Для пенсии
				если НазначениеПенсии Тогда 
					если не ПенсияВыгружена Тогда 
						ТипЗаписиНач2 = "СТАЖ=";
						Структура = Новый Структура;
						Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
						если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							Структура.Вставить("ВидДоговора",null);
						Иначе 
							Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						КонецЕсли;
						ПериодПенсии = СтрокиПоРаботнику1[СтрокиПоРаботнику1.Количество()-1].Период;
						ДеньШапки        = ?(День(НачалоМесяца(ПериодПенсии))<10,"0","")+День(НачалоМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(НачалоМесяца(ПериодПенсии))<10,"0","")+Месяц(НачалоМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(НачалоМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						ДеньШапки        = ?(День(КонецМесяца(ПериодПенсии))<10,"0","")+День(КонецМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(КонецМесяца(ПериодПенсии))<10,"0","")+Месяц(КонецМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(КонецМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач2+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+"ПЕНСИЯ= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
					КонецЕсли;
					ПенсияВыгружена = Ложь;  //Островская Татьяна 20.01.2014 № 17051
				КонецЕсли;
				
				если не ДетиВыгружена Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураДети = Новый Структура;
					СтруктураДети.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураДети.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						СтруктураДети.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					СтруктураДети.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ДЕТИ"));
					СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураДети);
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					
					//КоличествоЗаписейОСтаже = 0;
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ДатаОкончанияРабот)) Тогда 
						//	Продолжить;
						//КонецЕсли;
						
						ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						
						ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ДЕТИ"+"= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						ДетиВыгружена = Ложь;
						//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						//ДетиЕсть = Истина;
						//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
				КонецЕсли;
				
				
				если не ПособиеВыгружена Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураПособие = Новый Структура;
					СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						//СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПОСОБИЕ"));
					СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ДатаОкончанияРабот)) Тогда 
						//	Продолжить;
						//КонецЕсли;
						//О.Т. Аверсон 23.08.2018 № 2335
						Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
							Если СтрокаСтаж.Договор <> СтрокаМес.ДокументОснование Тогда 
								Продолжить;								
							КонецЕсли;
						КонецЕсли;
						//О.Т. Аверсон 23.08.2018 № 2335

						
						ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						
						ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПОСОБИЕ"+"= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						ПособиеВыгружена = Ложь;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
				КонецЕсли;
				
				//О.Т. Аверсон 21.05.2018 № 1985
				если не СтрахСлучВыгружена Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураПособие = Новый Структура;
					СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						//СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("СТРАХСЛУЧ"));
					СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ДатаОкончанияРабот)) Тогда 
						//	Продолжить;
						//КонецЕсли;
						
						ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						
						ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"СТРАХСЛУЧ"+"= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						СтрахСлучВыгружена = Ложь;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
				КонецЕсли;
				//О.Т. Аверсон 21.05.2018 № 1985
				
				если не ПремияВыгружена Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураПособие = Новый Структура;
					СтруктураПособие.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураПособие.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						//СтруктураПособие.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					СтруктураПособие.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПРЕМИЯ"));
					СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураПособие); 
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								 					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						
						ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						
						ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ПРЕМИЯ"+"= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						ПремияВыгружена = Ложь;
						
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						
					КонецЦикла;
				КонецЕсли;

				
				КолВзносыВрем = 0;
				если не ВзносыВрВыгружена Тогда
					ТипЗаписиНач3 = "СТАЖ=";
					СтруктураВзносыВр = Новый Структура;
					СтруктураВзносыВр.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
						СтруктураВзносыВр.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					Иначе 
						СтруктураВзносыВр.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					КонецЕсли;
					СтруктураВзносыВр.Вставить("ВидДеятельности",Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ВЗНОСЫВРЕМ"));
					СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(СтруктураВзносыВр); 
					
					//+ СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
					//- СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )
					
					ПредыдущийВидДейтельности = "";
					ПредыдущееОкончаниеРабот = "";
					ДатаНачалаРабот = "";
					Прерывание = Ложь;
					Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
						//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ДатаОкончанияРабот)) Тогда 
						//	Продолжить;
						//КонецЕсли;
						если Прерывание Тогда 
							Продолжить;
						КонецЕсли;
						
						
						//О.Т. Аверсон 05.04.2019 № 4187
						если КатегорияВывод = "ДОГОВОР" Тогда 
							если не ДатаНачалаДоговора = Дата(1,1,1) Тогда 
								Если Год(Дата(ДатаНачалаДоговора)) < Год(ПериодДляДоговора) Тогда 
									ДатаНачалаДог = Макс(Дата(ДатаНачалаДоговора),Дата(2014,01,01));
									ДатаОкончанияДог = Дата(ДатаОкончанияДоговора);
									Пока Год(ДатаНачалаДог) < Год(ПериодДляДоговора) Цикл 
										ДатаОкончанияДог = КонецГода(ДатаНачалаДог);

										ДатаФормированияДети = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										
										ДатаФормированияДети = ДатаОкончанияДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
										
										ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
										МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
										ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
										ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
										
										СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ВЗНОСЫВРЕМ"+"= = =");
										ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										ТекСтрока = ТекСтрока+1;
										ВзносыВрВыгружена = Истина;
										
										//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
										//ТекСтрока = ТекСтрока+1;
										КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
										
										ДатаНачалаДог = Дата(Год(ДатаНачалаДог)+1,01,01)
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						//О.Т. Аверсон 05.04.2019 № 4187	
						
						если КатегорияВывод = "ДОГОВОР" Тогда 
							если не ДатаНачалаДоговора = Дата(1,1,1) Тогда 
								ДатаФормированияДети = ДатаНачалаДог; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
								Прерывание = Истина;
							Иначе 
								ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
							КонецЕсли;
						иначе
							ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012							
						КонецЕсли;
						
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						если КатегорияВывод = "ДОГОВОР" Тогда 
							если не ДатаОкончанияДоговора = Дата(1,1,1) Тогда 
								ДатаФормированияДети = ДатаОкончанияДоговора; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
								Прерывание = Истина;
							Иначе 
								ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
							КонецЕсли;
						иначе
							ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;							
						КонецЕсли;
						ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
						МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
						ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
						ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач3+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+"ВЗНОСЫВРЕМ"+"= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						ВзносыВрВыгружена = Ложь;
						КолВзносыВрем = КолВзносыВрем+1;
						
						//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						//ТекСтрока = ТекСтрока+1;
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
						//Если Категория = "03" тогда
						//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
						//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
						//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
						//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
						//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
						//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
						//КонецЕсли;
						//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
						//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
						
					КонецЦикла;
				КонецЕсли;
				
				Если КатегорияВывод= "ДОГОВОР" Тогда
					ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар+">");
				КонецЕсли;
				
				//+ СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )
				////ПСА 04.07.2019 СВФР-004497++
				//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику
				//		                          //+ СВЭЙ КДЯ 25.07.19 СВФР-004561
				//									, ЗначениеКв
				//								  //- СВЭЙ КДЯ 25.07.19 СВФР-004561
				//			 					);
				////+++ПСА 04.07.2019 СВФР-004497
				//- СВЭЙ КДЯ 26.10.19 СВФР-004631 ( Пункт 48. )
				
				
				// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
				//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
				////учитываем пособия
				//СтруктураПособия = Новый Структура;
				//СтруктураПособия.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				//если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
				//	СтруктураПособия.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
				//Иначе 
				//	СтруктураПособия.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
				//КонецЕсли;
				//СтруктураПособия.Вставить("ВидДеятельности", Справочники.ОсобыеУсловияТруда.НайтиПоКоду("ПОСОБИЕ"));
				//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураПособия ); 
				//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв );
				// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
				
				Если СтрДлина( ЗначениеКв ) = 2 И Лев( ЗначениеКв, 1 ) = " " Тогда
				
					//Значит, по договору все записи о стаже: НЕОПЛДОГ  - подсчитываем их.
					
					// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
					//СтруктураНеоплДог = Новый Структура;
					//СтруктураНеоплДог.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
					//если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					//	СтруктураНеоплДог.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
					//Иначе 
					//	СтруктураНеоплДог.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
					//КонецЕсли;
					//СтруктураНеоплДог.Вставить("ВидДеятельности", НеоплДог);
					//СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки( СтруктураНеоплДог );
					//
					//ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику, ЗначениеКв
					//			//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5 )
					//			, СтрокаМес
					//			//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5 )
					//			);
					// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								
					
					// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
					//все записи по договору "НЕОПЛДОГ"
					ОтборСтрокСтажаДоговора = Новый Структура;
					ОтборСтрокСтажаДоговора.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
					ОтборСтрокСтажаДоговора.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
					Если НомерДоговораПрошл <> "" Тогда
						ОтборСтрокСтажаДоговора.Вставить( "НомерДокумента", НомерДоговораПрошл );
						// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
						//ОтборСтрокСтажаДоговора.Вставить( "ДатаДокумента", ДатаДоговораПрошл );
						// - СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
						//+ СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
						//// + СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
						//ОтборСтрокСтажаДоговора.Вставить( "ДатаДляПу", ДатаДоговораПрошл ); 
						//// - СВЭЙ КДЯ СВФР-004631 19.09.19 ( пункт 32. )
						//- СВЭЙ КДЯ 28.10.19 СВФР-004631 ( Пункт 49. )
					КонецЕсли;
					СтрокиСтажаДоговора = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокСтажаДоговора );
					
					ЗначениеКв = ПолучитьЗначениеКВ( СтрокиСтажаДоговора, ЗначениеКв );
					КоличествоЗаписейОСтаже = СтрокиСтажаДоговора.Количество();
					// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
								
				КонецЕсли; 
				//- СВЭЙ КДЯ 25.07.19 СВФР-004561
				
				
				//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
				КоличествоЗаписейОСтажеИтого = КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0);
				//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
							
				//если не СтрМес>1 Тогда 
				если не КатегорияВывод= "ДОГОВОР" Тогда
					//Островская Татьяна 20.01.2014 № 17051
					СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, "0", СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
					?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//Формат(КоличествоМес,"ЧГ=0")+"="+?(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0")))="0","0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					
					//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//?( КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					//+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
					////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
					
					//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
					?( КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					+ ?( КоличествоЗаписейОСтажеИтого = 0, "0", Формат( КоличествоЗаписейОСтажеИтого, "ЧГ=0" ) )
					//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
					                  
					+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
					+ Формат( ГОД( ДатаНачала ), "ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";    //О.Т. Аверсон 08.04.2019 № 4203 убрала -  +?(ДетиЕсть,1,0)
				иначе
					

					//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
					//Если НомерДоговораПрошл <> "" и ДатаДоговораПрошл <> "" Тогда
						//ДопСтрокаФайла1 = СтрЗаменить( НомерДоговораПрошл, " ", "" ) + "=" +  Формат( ДатаДоговораПрошл, "ДФ=""дд/ММ/гггг""" ) + "=" ;
					//Если НомерДоговора <> "" и ДатаДокумента <> "" Тогда
					//	ДопСтрокаФайла1 = СтрЗаменить( ДатаДокумента, " ", "" ) + "=" +  Формат( ДатаДоговораПрошл, "ДФ=""дд/ММ/гггг""" ) + "=" ;
					Если ЗначениеЗаполнено( НомерДоговора ) И ЗначениеЗаполнено( ДатаДокумента ) Тогда
						ДопСтрокаФайла1 = СтрЗаменить( НомерДоговора, " ", "" ) + "=" +  Формат( ДатаДокумента, "ДФ=""дд/ММ/гггг""" ) + "=" ;
					Иначе
						ДопСтрокаФайла1 = "";
					КонецЕсли;		
					//- СВЭЙ КДЯ 22.10.19 СВФР-004948
									
					
					//если не СтрМес>1 Тогда
					//Островская Татьяна 20.01.2014 № 17051
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, ?(ЕстьНеоплДог,"0"," "), СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					
					//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
					////+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//СтрокаФайла = ВРЕГ( СтрокаФайла
					////- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//- СВЭЙ КДЯ 22.10.19 СВФР-004948
					
					//+ СВЭЙ КДЯ 22.10.19 СВФР-004948
					СтрокаФайла = ВРЕГ( ПрефиксСтрокаФайла1 + ДопСтрокаФайла1
					//- СВЭЙ КДЯ 22.10.19 СВФР-004948
					
					+ ?( РаботДоход = 0, "0", Формат( РаботДоход, "ЧГ=0" ) ) + "=" +
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
					?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//?(ЕстьНеоплДог и КоличествоМес=0,"0",Формат(КоличествоМес,"ЧГ=0"))+"="+
					//?(СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0")))="0","0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					?( КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					                  
					+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "="
					+ Формат( ГОД( ДатаНачала ), "ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "="; //О.Т. Аверсон 08.04.2019 № 4203 убрала -  +?(ДетиЕсть,1,0)
					если СчДляПУ > 0 Тогда 
						//+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
						//ТекстФайла.ЗаменитьСтроку(ТекСтрокаДляСтрПУ,СтрокаФайла1);
						//- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
						//+ СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
						ТекстФайла.ЗаменитьСтроку( ТекСтрокаДляСтрПУ, СтрокаФайла );
						//- СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
					КонецЕсли;
					ТекСтрокаДляСтрПУ = ТекСтрока;
					//КонецЕсли;	
				КонецЕсли;
				//+ СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
				//ДетиЕсть = Ложь;
				//- СВЭЙ КДЯ 27.08.19 СВФР-004631 ( пункт 11. )
				//КонецЕсли;   
				СтрокаЗар = СтрокаЗар + ">";
				если КатегорияВывод= "ДОГОВОР" Тогда 
					если СчДляПУ = 0 Тогда 
						ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, СтрокаФайла);
						если не КатегорияВывод= "ДОГОВОР" Тогда		
							ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
						КонецЕсли; 
						
					КонецЕсли;
					
				иначе
					ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, СтрокаФайла);
					если не КатегорияВывод= "ДОГОВОР" Тогда
						ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
					КонецЕсли; 
					
				КонецЕсли;
				
				
			иначе
				
				РаботДоход = 0;
				РаботБольн = 0;
				РаботВзнос = 0;
				РаботВзнос1 = 0; //Островская Татьяна 17.01.2014 № 17051
				РаботВзнос2 = 0;
				РаботВзнос3 = 0;
				РаботДоход = 0;
				РаботБольн = 0;
				РаботВзнос = 0;
				РаботВзнос1 = 0;
				РаботВзнос2 = 0;
				РаботВзнос3 = 0;
				СтрокаФайла = ТипЗаписи;
				//Инициалы должны быть указаны
				Фамилия = ВРег(?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия)));
				Имя = Врег(?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Имя),1)));
				Отчество = Врег(?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", Лев(СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество),1)));
				Категория =?(ВыборкаПоРаботникиОрганизации.Категория = "", "01", СокрЛП(ВыборкаПоРаботникиОрганизации.Категория));
				//толик			СтрокаФайла = СтрокаФайла+СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)+"="+Фамилия+"="+Имя+"="+Отчество+"="+Категория+"=";
				СтрокаЗар = "";
				//Островская Татьяна 02.11.2012 № 15
				если ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.ВидДоговора) Тогда 
					КатегорияВывод = "ДОГОВОР";
				ИНАЧЕ
					КатегорияВывод = "";
				КонецЕсли;
				Структура = Новый Структура;
				Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				если ВыборкаПоРаботникиОрганизации.ВидДоговора = Неопределено Тогда 
					Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
				Иначе 
					Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
				КонецЕсли;
				
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				ЕстьВидРасчета = Ложь;
				Для каждого СтрДог из СтрокиПоРаб цикл
					если не СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
						ЕстьВидРасчета = Истина;
					КонецЕсли;
				КонецЦикла;
				СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо));
				Для каждого СтрДог из СтрокиПоРаб цикл 
					если ЕстьВидРасчета Тогда 
						если СокрЛП(СтрДог.ВидДейтельности) = "" Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					
					если КатегорияВывод= "ДОГОВОР"  Тогда 
						
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"03"+"=";
					Иначе 
						СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
						
					КонецЕсли;
					
					Прервать;
					
				КонецЦикла;
				Если СтрокиПоРаб.Количество()=0 Тогда 
					СтрокаФайла = СтрокаФайла+?(ЗначениеЗаполнено(СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер)), СокрЛП(ВыборкаПоРаботникиОрганизации.ЛичныйНомер), СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо.Код))+"N")+"="+Фамилия+"="+Имя+"="+Отчество+"="+"01"+"=";
					Сообщить("Данные не найдены по сотруднику "+ВыборкаПоРаботникиОрганизации.ФизЛицо.Наименование);					
				КонецЕсли;
				
				//Островская Татьяна 02.11.2012 № 15
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;                     
				
				НомерДокументаВПачке = 	НомерДокументаВПачке + 1;
				
				//Берем запись с пустыми полями
				//Запись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
				
				НомерДокументаВПачке = НомерДокументаВПачке;
				ТекстФайла.ДобавитьСтроку(СтрокаФайла);
				ТекСтрока = ТекСтрока+1;
				СтрокаЗамены = ТекСтрока;
				
				КоличествоМес = 0;
				СтрокаДатаДокумента = "";
				СтрокаНомерДокумента = "";
				СтрМес = 1;
				СтрокаФайла1 = "";
				Сч =0;
				СтрокиПоРаботнику1 = ПромежуточнаяТаблица.НайтиСтроки(Структура);
				
				
				Колич = СтрокиПоРаботнику1.Количество();
				
				
				если Колич = 0 Тогда 
					СтрокиПоРаботнику1 = Новый ТаблицаЗначений;
					СтрокиПоРаботнику1.Колонки.Добавить("Больничные");
					СтрокиПоРаботнику1.Колонки.Добавить("СуммаДохода");
					СтрокиПоРаботнику1.Колонки.Добавить("ФизЛицо");
					СтрокиПоРаботнику1.Колонки.Добавить("Период");
					СтрокиПоРаботнику1.Колонки.Добавить("ПроцентФСЗН");
					СтрокиПоРаботнику1.Колонки.Добавить("ПенсионныйФонд");
					СтрокиПоРаботнику1.Колонки.Добавить("ФСЗН");
					СтрокиПоРаботнику1.Колонки.Добавить("ВидДоговора");
					СтрокиПоРаботнику1.Колонки.Добавить("НомерДокумента");
					СтрокиПоРаботнику1.Колонки.Добавить("ДатаДокумента");
					СтрокиПоРаботнику1.Колонки.Добавить("ПричиныМинимальнойЗП"); //О.Т. Аверсон 15.03.2019 № 4091
					Дата1 = ДатаНачала;
					Дата2 = ДатаОкончания;
					пока Дата1 <= Дата2 Цикл  
						СтрокаСтрокиПоРаботнику1 = СтрокиПоРаботнику1.Добавить();
						СтрокаСтрокиПоРаботнику1.Больничные = 0;
						СтрокаСтрокиПоРаботнику1.Период = НачалоМесяца(Дата1);
						СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
						СтрокаСтрокиПоРаботнику1.ФизЛицо = ВыборкаПоРаботникиОрганизации.ФизЛицо;
						СтрокаСтрокиПоРаботнику1.ПроцентФСЗН = 0;
						СтрокаСтрокиПоРаботнику1.ПенсионныйФонд = 0;
						СтрокаСтрокиПоРаботнику1.ФСЗН = 0;
						//О.Т. Аверсон 18.04.2019 № 4246
						ПричинаМинЗП = Справочники.ПричиныМинимальнойЗаработнойПлаты.ПустаяСсылка();
						МассивСтрок = СведенияОВзносах.НайтиСтроки(Новый Структура("ФизЛицо,Месяц",ВыборкаПоРаботникиОрганизации.ФизЛицо,НачалоМесяца(Дата1)));
						Для каждого СтрокаТабличнойЧасти Из МассивСтрок Цикл
							ПричинаМинЗП = СтрокаТабличнойЧасти.ПричиныМинимальнойЗП; 							
						КонецЦикла;
						//О.Т. Аверсон 18.04.2019 № 4246
						СтрокаСтрокиПоРаботнику1.ПричиныМинимальнойЗП = ПричинаМинЗП;

						//СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
						//СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
						//СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
						//СтрокаСтрокиПоРаботнику1.СуммаДохода = 0;
						Дата1 = ДобавитьМесяц(Дата1,1);
					КонецЦикла;
					
					Колич = СтрокиПоРаботнику1.Количество();
					
				КонецЕсли;
				
				СтрокаЗамена = СтрокаФайла;
				Для Сч = 0 по Колич-1 цикл
					СтрокаМес = СтрокиПоРаботнику1[Сч];
					
					РезультатДоговор= 0;
					Если не (ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда) Тогда //О.Т. Аверсон 22.08.2018 № 2335
						если КатегорияВывод= "ДОГОВОР" Тогда
							ЗапросДог = Новый Запрос;
							ЗапросДог.Текст = 
							"ВЫБРАТЬ
							|	ЕСНСведенияОДоходах.Результат
							|ИЗ
							|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
							|ГДЕ
							|	ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо
							|	И ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &ПериодВзаиморасчетов И &ПериодВзаиморасчетов1
							|	И ЕСНСведенияОДоходах.ВидРасчета.КодДоходаЕСН <> &ДоходБольничныйФСЗН";
							//|	И ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета = &СпособРасчета";//О.Т. Аверсон 31.01.2017 № 244
							ЗапросДог.УстановитьПараметр("ФизЛицо",СтрокаМес.ФизЛицо);
							ЗапросДог.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
							ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов",НачалоМесяца(СтрокаМес.Период));
							ЗапросДог.УстановитьПараметр("ПериодВзаиморасчетов1",КонецМесяца(СтрокаМес.Период));
							//ЗапросДог.УстановитьПараметр("СпособРасчета",Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
							РезДог = ЗапросДог.Выполнить().Выбрать();
							пока РезДог.Следующий() Цикл 
								РезультатДоговор =РезультатДоговор+РезДог.Результат; 
							КонецЦикла;
						КонецЕсли;
					иначе
						РезультатДоговор = СтрокаМес.СуммаДохода;
					КонецЕсли;
					
					
					
					
					
					если ЗначениеЗаполнено(СтрокаДатаДокумента) и ЗначениеЗаполнено(СтрокаНомерДокумента) Тогда 
					иначе
						
						СтрокаДатаДокумента = СтрокаМес.ДатаДокумента;
						СтрокаНомерДокумента = СтрокаМес.НомерДокумента;
					КонецЕсли;
					если не Сч > Колич-1 Тогда 
						СтрокаДатаДокументаСлед = СтрокиПоРаботнику1[Сч].ДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокиПоРаботнику1[Сч].НомерДокумента;
					иначе
						СтрокаДатаДокументаСлед = СтрокаДатаДокумента;
						СтрокаНомерДокументаСлед = СтрокаНомерДокумента;
						
					КонецЕсли;
					Если Категория <> "03" тогда
						если КатегорияВывод= "ДОГОВОР" Тогда
							//+  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							//если  не СтрокаДатаДокументаСлед = "" Тогда  
							//-  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							//+  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							Если ЗначениеЗаполнено( СтрокаДатаДокументаСлед ) Тогда  
							//-  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
								//если не СтрМес>1 Тогда
								ДеньДатыДоговора        = ?(День(СтрокаДатаДокументаСлед)<10,"0","")+День(СтрокаДатаДокументаСлед);
								МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокументаСлед)<10,"0","")+Месяц(СтрокаДатаДокументаСлед);
								ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокументаСлед), "ЧГ=0")));
								ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;    
								//иначе
								//	ДеньДатыДоговора        = ?(День(СтрокаДатаДокумента)<10,"0","")+День(СтрокаДатаДокумента);
								//	МесяцДатыДоговора       = ?(Месяц(СтрокаДатаДокумента)<10,"0","")+Месяц(СтрокаДатаДокумента);
								//	ГодДатыДоговора 		 = Строка(СокрЛП(Формат(Год(СтрокаДатаДокумента), "ЧГ=0")));
								//	ДатаДоговора   = ДеньДатыДоговора+"/"+МесяцДатыДоговора+"/"+ГодДатыДоговора;
								//КонецЕсли;
							Иначе
								ДатаДоговора = "";
							КонецЕсли;
							если не Сч > Колич-1 Тогда
								//+  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
								//СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокументаСлед= "",СтрокаНомерДокументаСлед, Число(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";					
								//-  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
								//+  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
								СтрокаФайла = СтрокаЗамена +?( НЕ ЗначениеЗаполнено( СтрокаНомерДокументаСлед ), СтрокаНомерДокументаСлед, 
												Число(СтрокаНомерДокументаСлед)) +"="+ДатаДоговора+"=";					
								//-  СВЭЙ КДЯ 18.09.19 СВФР-004631 ( пункт 31. )
							иначе
								СтрокаФайла = СтрокаЗамена +?(СтрокаНомерДокумента= "",СтрокаНомерДокумента, Число(СтрокаНомерДокумента)) +"="+ДатаДоговора+"=";
							КонецЕсли;
						Иначе 
							если не СтрМес>1 тогда //?(Колич-1 = сч,истина,СтрМес>1) Тогда
								СтрокаФайла = СтрокаФайла+" = =";
							КонецЕсли;
						КонецЕсли;
						
						
					КонецЕсли;
					//КонецЕсли;
					если СтрМес>1 тогда //?(Колич-1 = сч,истина,СтрМес>1) Тогда 
						если КатегорияВывод= "ДОГОВОР" Тогда
							если не Сч > Колич-1 Тогда
								ТекстФайла.ДобавитьСтроку(СтрокаФайла1);
							иначе
								ТекстФайла.ДобавитьСтроку(СтрокаФайла);
							КонецЕсли;
							ТекСтрока = ТекСтрока+1;
							ТипЗаписиНач = "НЧСЛ=";
							если Сч <= СтрокиПоРаботнику1.Количество()-1 Тогда 
								если не КатегорияВывод= "ДОГОВОР" Тогда
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
									ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
									ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
								иначе
									ИтогДохода = ИтогДохода + РаботДоходСлед;
									ИтогБольн = ИтогБольн + РаботБольнСлед;
									ИтогВзнос = ИтогВзнос + РаботВзносСлед;
									ИтогВзнос1 = ИтогВзнос1 + РаботВзносСлед1;
									ИтогВзнос2 = ИтогВзнос2 + РаботВзносСлед2;
									ИтогВзнос3 = ИтогВзнос3 + РаботВзносСлед3;
									
								КонецЕсли;
							иначе
								если КатегорияВывод= "ДОГОВОР" Тогда
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
									ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
									ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
									
								иначе
									ИтогДохода = ИтогДохода + РаботДоход;
									ИтогБольн = ИтогБольн + РаботБольн;
									ИтогВзнос = ИтогВзнос + РаботВзнос;
									ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
									ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
									ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
									
								КонецЕсли;
							КонецЕсли;
							РаботДоход = 0;
							РаботБольн = 0;
							РаботВзнос = 0;
							РаботВзнос1 = 0;
							РаботВзнос2 = 0;
							РаботВзнос3 = 0;
							КоличествоМес = 0;
							КоличествоДокументов 	= КоличествоДокументов+1;
						КонецЕсли;
					КонецЕсли;
					
					//толик 	добавил округление - ЧДЦ=0;
					//Если (ЗначениеЗаполнено(СтрокаМес.СуммаДохода) Или ЗначениеЗаполнено(СтрокаМес.Больничные) или ЗначениеЗаполнено(СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд)) Тогда
					//Островская Татьяна 31.10.2012 № 15958
					если КатегорияВывод = 	"ДОГОВОР" Тогда 
						СтрокаМес.СуммаДохода = РезультатДоговор;
					иначе
						СтрокаМес.СуммаДохода = СтрокаМес.СуммаДохода - РезультатДоговор;
					КонецЕсли;
					
					//О.Т. Аверсон 29.08.2018 № 2363
					Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
						ОсновнойВидНалогообл = ВидНалогообложения;
					иначе
						ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
					КонецЕсли;
					//О.Т. Аверсон 29.08.2018 № 2363
					
					//О.Т. Аверсон 06.03.2019 № 4054
					СтавкаИнвалид = 0;
					ЗапросИнвалид = Новый Запрос;
					ЗапросИнвалид.Текст = 
					"ВЫБРАТЬ
					|	СведенияОбИнвалидностиФизлицСрезПоследних.Физлицо
					|ИЗ
					|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&Период, ) КАК СведенияОбИнвалидностиФизлицСрезПоследних
					|ГДЕ
					|	СведенияОбИнвалидностиФизлицСрезПоследних.Инвалидность";
					
					ЗапросИнвалид.УстановитьПараметр("Период", НачалоМесяца(СтрокаМес.Период));
										
					РезультатЗапросаИнвалид = ЗапросИнвалид.Выполнить().Выгрузить();
					Если не РезультатЗапросаИнвалид.Количество()=0 Тогда 
						МесяцЧисло = Строка(Месяц(СтрокаМес.Период));
						ЗапросСтавка.Текст = 
						"ВЫБРАТЬ
						|	ГражданствоФизЛицСрезПоследних.ИнаяСтавка
						|ИЗ
						|	ПакетГражд"+МесяцЧисло+" КАК ГражданствоФизЛицСрезПоследних
						|ГДЕ
						|	ГражданствоФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
						
						ЗапросСтавка.УстановитьПараметр("ФизЛицо",СтрокаМес.ФизЛицо);
						
						РезультатЗапросаСтавка = ЗапросСтавка.Выполнить().Выбрать();
						
						Пока РезультатЗапросаСтавка.Следующий() Цикл
							СтавкаИнвалид = РезультатЗапросаСтавка.ИнаяСтавка; 
						КонецЦикла;

					КонецЕсли;
					//О.Т. Аверсон 06.03.2019 № 4054


					//О.Т. Аверсон 29.01.2018 № 1511
					СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокаМес.Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
					РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокаМес.Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
					БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
					
					Если СтрокаМес.СуммаДохода > БазаОграниченияФСЗН Тогда 
						СтрокаМес.СуммаДохода = БазаОграниченияФСЗН;
					КонецЕсли;
					//О.Т. Аверсон 29.01.2018 № 1511
					
					ЗначениеОкругления = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ДатаОкончания,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ТочностьРасчетов)).Размер; //О.Т. Аверсон 22.06.2016 № 949
					СтрЗар = ?(СтрокаМес.СуммаДохода = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.СуммаДохода,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					если не КатегорияВывод= "ДОГОВОР" Тогда
						СтрБлн = ?(СтрокаМес.Больничные = 0, "0", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					иначе
						СтрБлн = ?(СтрокаМес.Больничные = 0, " ", СокрЛП(Строка(Формат(СтрокаМес.Больничные,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтавкаИнвалид) Тогда 
						СтрВзн1Число = 0; //0,28 не считается у инвалида   
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							СтрВзн = ?(не ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокаМес.ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд),СтрокаМес.ПенсионныйФонд,0);
						иначе
							СтрВзн = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период));
						КонецЕсли;
						
						СтрВзн1 = "0";  
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*(0.01+СтавкаИнвалид/100),СтрокаМес.Период);
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокаМес.ФизЛицо,СтрокаМес.Период));
							СуммаКоррект = 0;
							Для Каждого стр из МассивТЗСотрудники Цикл 
								СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
							КонецЦикла;
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						иначе
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						КонецЕсли;
						
						СтрВзн3 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));//О.Т. Аверсон 17.03.2016 № 949 
					
						
					иначе
						//О.Т. Аверсон 02.02.2018 № 1535
						СтрВзн1Число = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период));//О.Т. Аверсон 17.03.2016 № 949   
						//О.Т. Аверсон 02.02.2018 № 1535
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							СтрВзн = ?(не ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд), "0", СокрЛП(Строка(Формат(СтрокаМес.ПенсионныйФонд,"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ЗначениеЗаполнено(СтрокаМес.ПенсионныйФонд),СтрокаМес.ПенсионныйФонд,0);
						иначе
							СтрВзн = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));
							//О.Т. Аверсон 02.02.2018 № 1535
							СтрВзнЧисло = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период) = 0, 0, ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.01,СтрокаМес.Период));
						КонецЕсли;
						
						СтрВзн1 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.28,СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));//О.Т. Аверсон 17.03.2016 № 949   
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);
						Если СКорректировкойФСЗН Тогда //О.Т. Аверсон 28.02.2018 № 1448
							МассивТЗСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо,Период",СтрокаМес.ФизЛицо,СтрокаМес.Период));
							СуммаКоррект = 0;
							Для Каждого стр из МассивТЗСотрудники Цикл 
								СуммаКоррект = СуммаКоррект + ?(ЗначениеЗаполнено(стр.СуммаКорректировки),стр.СуммаКорректировки,0);							
							КонецЦикла;
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число+СуммаКоррект," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						иначе
							
							СтрВзн2 = ?(СуммаВсе-СтрВзнЧисло-СтрВзн1Число=0,"0",СтрЗаменить(СуммаВсе-СтрВзнЧисло-СтрВзн1Число," ",""));//О.Т. Аверсон 02.02.2018 № 1535
						КонецЕсли;
						
						СтрВзн3 = ?(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период) = 0, "0", СокрЛП(Строка(Формат(ОбщегоНазначения.ОкруглитьЗначение2016(Число(СтрВзн1)+Число(СтрВзн2),СтрокаМес.Период),"ЧДЦ="+Строка(ЗначениеОкругления)+";ЧГ=0"))));//О.Т. Аверсон 17.03.2016 № 949 
					КонецЕсли;
					//Островская Татьяна 31.10.2012 № 15958
					НомерМесяца = Формат(Месяц(СтрокаМес.Период),"ЧГ=0");
					
					//+ СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					//изменился формат файла пачки ПУ-3 - незначащие нули не проходят проверку
					//если НомерМесяца = Лев(НомерМесяца,1) Тогда 
					//	НомерМесяца = "0"+НомерМесяца;
					//КонецЕсли;
					//- СВЭЙ КДЯ 23.09.19 СВФР-004631 ( пункт 46. )
					
					//Островская Татьяна 30.11.2012 № 15958
					//Островская Татьяна 30.11.2012 № 15958
					//СтрокиПоРаб = ПТДопСведОстаже.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаМес.ФизЛицо));
					//Для каждого СтрДог из СтрокиПоРаб цикл 
					//	если КатегорияВывод= "ДОГОВОР" Тогда
					//		если Основные Тогда
					//		Иначе 
					//			если СтрБлн = "0" Тогда 
					//				СтрБлн = " ";
					//				Прервать;
					//			КонецЕсли;
					//		КонецЕсли;
					//	КонецЕсли;
					//	
					//КонецЦикла;
					
					
					//Островская Татьяна 30.11.2012 № 15958
					
					//О.Т. Аверсон 29.08.2018 № 2363
					МесяцЧисло = Строка(Месяц(СтрокаМес.Период));
					
					ЗапросУв.Текст = 
					"ВЫБРАТЬ
					|	РаботникиОрганизацийСрезПоследних.Период
					|ИЗ
					|	ПакетУВ"+МесяцЧисло+" КАК РаботникиОрганизацийСрезПоследних
					|ГДЕ
					|	РаботникиОрганизацийСрезПоследних.ФизЛицо = &ФизЛицо"; 					
					ЗапросУв.УстановитьПараметр("ФизЛицо", СтрокаМес.ФизЛицо);
					
					РезультатЗапросаУв = ЗапросУв.Выполнить().Выбрать();
					ДатаУвольнения = Дата(1,1,1);
					Пока РезультатЗапросаУв.Следующий() Цикл
						ДатаУвольнения = РезультатЗапросаУв.Период;
					КонецЦикла;
					
					Если ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*1/100,СтрокаМес.Период)<> СтрВзнЧисло и ЗначениеЗаполнено(ДатаУвольнения) Тогда
						ДатаУвольненияФормат = Формат(ДатаУвольнения,"ДФ=""дд/ММ/гггг""");
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+НомерМесяца+"="+СтрЗар+"="+СтрБлн+"="+СтрВзн+"="+СтрВзн1+"="+СтрВзн2+"="+СтрВзн+"="+СтрВзн3+"=0="+?(СтавкаИнвалид,"0","28")+"=6="+ДатаУвольненияФормат+"=");
					иначе
						СтрокаЗар = ВРЕГ(ТипЗаписиНач+НомерМесяца+"="+СтрЗар+"="+СтрБлн+"="+СтрВзн+"="+СтрВзн1+"="+СтрВзн2+"="+СтрВзн+"="+СтрВзн3+"=1="+?(СтавкаИнвалид,"0","28")+"=6= "+"="); //Островская Татьяна 17.01.2013 № 16153
					КонецЕсли;   					
					//О.Т. Аверсон 29.08.2018 № 2363
					
					//О.Т. Аверсон 15.03.2019 № 4091
					Если не ДатаНачала < Дата(2019,01,01) Тогда
						Если ЗначениеЗаполнено(СтрокаМес.ПричиныМинимальнойЗП) Тогда
							СтрокаЗар = СтрокаЗар + СтрокаМес.ПричиныМинимальнойЗП.Код+"=";
						иначе
							СтрокаЗар = СтрокаЗар + " =";  						
						КонецЕсли;
					КонецЕсли;
					//О.Т. Аверсон 15.03.2019 № 4091
					
					ТекстФайла.ДобавитьСтроку(СтрокаЗар);
					ТекСтрока = ТекСтрока+1;
					//толик формирование контрольного файла
					Дбф.Добавить();
					Дбф.УстановитьЗначениеПоля("FIO", СокрЛП(Строка(ВыборкаПоРаботникиОрганизации.ФизЛицо)));
					Дбф.УстановитьЗначениеПоля("Dato", СтрокаМес.Период);
					Дбф.УстановитьЗначениеПоля("Sm", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода, СтрокаМес.Период));//О.Т. Аверсон 17.03.2016 № 949
					Дбф.УстановитьЗначениеПоля("Bl", ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.Больничные,СтрокаМес.Период)); //О.Т. Аверсон 17.03.2016 № 949
					Дбф.УстановитьЗначениеПоля("Vz", ОбщегоНазначения.ОкруглитьЗначение2016((СтрокаМес.ФСЗН + СтрокаМес.ПенсионныйФонд), СтрокаМес.Период));//О.Т. Аверсон 14.03.2016 № 949
					Дбф.Записать();
					
					если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
						РаботДоходСлед = РаботДоходСлед + Число(СтрЗар);
						РаботБольнСлед = РаботБольнСлед + Число(СтрБлн);
						//Островская Татьяна 17.01.2014 № 17051
						РаботВзносСлед = РаботВзносСлед + Число(СтрВзн);
						РаботВзносСлед1 = РаботВзносСлед1 + Число(СтрВзн1);
						//О.Т. Аверсон 29.01.2018 № 1511
						//О.Т. Аверсон 29.08.2018 № 2363
						Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
							ОсновнойВидНалогообл = ВидНалогообложения;
						иначе
							ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
						КонецЕсли;
						//О.Т. Аверсон 29.08.2018 № 2363
						СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокиПоРаботнику1[Сч+1].Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
						РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокиПоРаботнику1[Сч+1].Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
						БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
						
						Если СтрокиПоРаботнику1[Сч+1].СуммаДохода > БазаОграниченияФСЗН Тогда 
							СтрокиПоРаботнику1[Сч+1].СуммаДохода = БазаОграниченияФСЗН;
						КонецЕсли;
						//О.Т. Аверсон 29.01.2018 № 1511
						
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокиПоРаботнику1[Сч+1].СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949					
						РаботВзносСлед2 = РаботВзносСлед2 + Число(СтрВзн2);
						
						РаботВзносСлед3 = РаботВзносСлед3 + Число(СтрВзн3);
						//Островская Татьяна 17.01.2014 № 17051
						РаботДоход = РаботДоход + Число(СтрЗар);
						РаботБольн = РаботБольн + Число(СтрБлн);
						РаботВзнос = РаботВзнос + Число(СтрВзн); //Островская Татьяна 17.01.2014 № 17051
						РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1); //Островская Татьяна 17.01.2014 № 17051
						СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
						РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2); //Островская Татьяна 17.01.2014 № 17051
						РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3); //Островская Татьяна 17.01.2014 № 17051
						//если не КатегорияВывод= "ДОГОВОР" Тогда
						//	ИтогДохода = ИтогДохода + РаботДоход;
						//	ИтогБольн = ИтогБольн + РаботБольн;
						//	ИтогВзнос = ИтогВзнос + РаботВзнос;
						//иначе
						//	ИтогДохода = ИтогДохода + РаботДоходСлед;
						//	ИтогБольн = ИтогБольн + РаботБольнСлед;
						//	ИтогВзнос = ИтогВзнос + РаботВзносСлед;
						//КонецЕсли;
					иначе
						если КатегорияВывод= "ДОГОВОР" Тогда
							РаботДоход = РаботДоход + Число(СтрЗар);
							РаботБольн = РаботБольн + Число(СтрБлн);
							//Островская Татьяна 17.01.2014 № 17051
							РаботВзнос = РаботВзнос + Число(СтрВзн);
							РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1);
							
							//О.Т. Аверсон 29.08.2018 № 2363
							Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
								ОсновнойВидНалогообл = ВидНалогообложения;
							иначе
								ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
							КонецЕсли;
							//О.Т. Аверсон 29.08.2018 № 2363
							//О.Т. Аверсон 29.01.2018 № 1511
							СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(СтрокиПоРаботнику1[0].Период),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
							РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(СтрокиПоРаботнику1[0].Период) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
							БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
							
							Если СтрокиПоРаботнику1[0].СуммаДохода > БазаОграниченияФСЗН Тогда 
								СтрокиПоРаботнику1[0].СуммаДохода = БазаОграниченияФСЗН;
							КонецЕсли;
							//О.Т. Аверсон 29.01.2018 № 1511
							
							СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокиПоРаботнику1[0].СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
							
							РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2);
							РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3);
							//Островская Татьяна 17.01.2014 № 17051
							//ИтогДохода = ИтогДохода + РаботДоход;
							//ИтогБольн = ИтогБольн + РаботБольн;
							//ИтогВзнос = ИтогВзнос + РаботВзнос;
							
						иначе
							РаботДоход = РаботДоход + Число(СтрЗар);
							РаботБольн = РаботБольн + Число(СтрБлн);
							РаботВзнос = РаботВзнос + Число(СтрВзн);
							//Островская Татьяна 17.01.2014 № 17051
							РаботВзнос1 = РаботВзнос1 + Число(СтрВзн1);
							СуммаВсе = ОбщегоНазначения.ОкруглитьЗначение2016(СтрокаМес.СуммаДохода*0.35,СтрокаМес.Период);//О.Т. Аверсон 17.03.2016 № 949
							РаботВзнос2 = РаботВзнос2 + Число(СтрВзн2);
							РаботВзнос3 = РаботВзнос3 + Число(СтрВзн3);
							//Островская Татьяна 17.01.2014 № 17051
							//ИтогДохода = ИтогДохода + РаботДоход;
							//ИтогБольн = ИтогБольн + РаботБольн;
							//ИтогВзнос = ИтогВзнос + РаботВзнос;
							
						КонецЕсли;
					КонецЕсли;
					КоличествоМес = КоличествоМес+1;
					//КонецЕсли;
					
					
					если КатегорияВывод= "ДОГОВОР" Тогда
						ТипЗаписиНач = "СТАЖ=";
						Структура = Новый Структура;
						Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
						если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							Структура.Вставить("ВидДоговора",null);
						Иначе 
							Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						КонецЕсли;
						
						СтрокиПоРаботнику = ПТДопСведОстаже.НайтиСтроки(Структура); 
						КоличествоЗаписейОСтаже = 0;
						ПредыдущийВидДейтельности = "";
						ПредыдущееОкончаниеРабот = "";
						ДатаНачалаРабот = "";
						Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
							если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.НачалоРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ОкончаниеРабот)) Тогда 
								Продолжить;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтрокаСтаж.ВидДейтельности) Тогда 
								Если СтрокаСтаж.ВидДейтельности <> "СП2     " Тогда 
									ДатаФормирования = СтрокаСтаж.НачалоРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
									
									
									Если НачалоМесяца(СтрокаСтаж.НачалоРабот) <> НачалоМесяца(СтрокаСтаж.ОкончаниеРабот) и Год(СтрокаСтаж.НачалоРабот) < Год(СтрокаСтаж.ОкончаниеРабот) Тогда
										ДатаФормирования = КонецМесяца(СтрокаСтаж.НачалоРабот);
									иначе
										ДатаФормирования = СтрокаСтаж.ОкончаниеРабот;
									КонецЕсли;
									ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
									МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
									ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
									ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
									
									// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
									////О.Т. Аверсон 14.05.2019 № 4328
									//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ДатаНачалаРабот,ДатаОкончанияРабот,ВидДеятельности",ВыборкаПоРаботникиОрганизации.ФизЛицо,ДатаНачалаДог,НачалоДня(ДатаФормирования),НеоплДог));
									//
									//ЗначВидДеят = Неопределено;
									//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
									//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
									//КонецЕсли;
									////О.Т. Аверсон 14.05.2019 № 4328
									//СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="
									//		+СокрЛП(?(ЗначениеЗаполнено(ЗначВидДеят),ЗначВидДеят,СтрокаСтаж.ВидДейтельности))+"= = =");
									// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

									// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
									ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
									СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
										+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
									// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

									ТекстФайла.ДобавитьСтроку( СтрокаЗар );
									ТекСтрока = ТекСтрока + 1;
									КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже + 1;
									Если Категория = "03" тогда
										НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
										ДатаФормирования = СтрокаСтаж.ДатаДокумента;
										ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
										МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
										ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
										ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
										СтрокаФайла = СтрокаФайла+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=";
									КонецЕсли;
									
									Если Год(СтрокаСтаж.НачалоРабот) < Год(СтрокаСтаж.ОкончаниеРабот)  Тогда
										ПериодНач = НачалоМесяца(ДобавитьМесяц(СтрокаСтаж.НачалоРабот,1));
										Пока ПериодНач <= НачалоМесяца(СтрокаСтаж.ОкончаниеРабот) Цикл 
											ДатаФормирования = ПериодНач; //О.Т. Аверсон 22.04.2019 № 4269 //СтрЗаменить(СтрокаСтаж.НачалоРабот,"2011","2012");
											ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
											МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
											ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
											ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
											
											
											Если НачалоМесяца(ПериодНач) = НачалоМесяца(СтрокаСтаж.ОкончаниеРабот) Тогда
												ДатаФормирования = СтрокаСтаж.ОкончаниеРабот;
											иначе
												ДатаФормирования = КонецМесяца(ПериодНач);
											КонецЕсли;
											ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
											МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
											ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
											ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
											
											// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
											////О.Т. Аверсон 14.05.2019 № 4328
											//ЗначСведенияОСтаже = СведенияОСтаже.НайтиСтроки(Новый Структура("ФизЛицо,ДатаНачалаРабот,ДатаОкончанияРабот,ВидДеятельности",ВыборкаПоРаботникиОрганизации.ФизЛицо,ДатаНачалаДог,НачалоДня(ДатаФормирования),НеоплДог));
											//
											//ЗначВидДеят = Неопределено;
											//Если ЗначСведенияОСтаже.Количество()>0 Тогда 
											//	ЗначВидДеят = ЗначСведенияОСтаже[0].ВидДеятельности;																
											//КонецЕсли;
											////О.Т. Аверсон 14.05.2019 № 4328
											//СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="
											//		+СокрЛП(?(ЗначениеЗаполнено(ЗначВидДеят),ЗначВидДеят,СтрокаСтаж.ВидДейтельности))+"= = =");
											// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

											// + СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )
											ЕстьНеоплДог = ЕстьНеоплДог( ВыборкаПоРаботникиОрганизации, СтрокаМес, ТЗ_СведенияОСтаже );
											СтрокаЗар = ВРЕГ( ТипЗаписиНач + ДатаНачалаРабот + "=" + ДатаОкончанияРабот + "= =" 
												+ СокрЛП( ?( ЕстьНеоплДог, "НЕОПЛДОГ", СтрокаСтаж.ВидДейтельности ) ) + "= = =" );
											// - СВЭЙ КДЯ 17.09.19 СВФР-004631 ( пункт 28. )

														
											ТекстФайла.ДобавитьСтроку( СтрокаЗар );
											ТекСтрока = ТекСтрока + 1;
											КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
											Если Категория = "03" тогда
												НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
												ДатаФормирования = СтрокаСтаж.ДатаДокумента;
												ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
												МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
												ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
												ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
												СтрокаФайла = СтрокаФайла+СтрЗаменить(НомерДоговора," ","")+"="+ДатаДокумента+"=";
											КонецЕсли;
											ПериодНач = ДобавитьМесяц(ПериодНач,1);
										КонецЦикла;
									КонецЕсли;

									ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
									ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						
						
					КонецЕсли;
					
					
					
					
					//Островская Татьяна 25.10.2012 № 15958
					//Островская Татьяна 17.01.2013 № 16153
					если не Сч > Колич-1 Тогда 
						если не КатегорияВывод= "ДОГОВОР" Тогда
							
						иначе
							////Для пенсии
							если НазначениеПенсии Тогда 
								ТипЗаписиНач2 = "СТАЖ=";
								Структура = Новый Структура;
								Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
								если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
									Структура.Вставить("ВидДоговора",null);
								Иначе 
									Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
								КонецЕсли;
								ПериодПенсии = СтрокиПоРаботнику1[СтрокиПоРаботнику1.Количество()-1].Период;
								ДеньШапки        = ?(День(НачалоМесяца(ПериодПенсии))<10,"0","")+День(НачалоМесяца(ПериодПенсии));
								МесяцШапки       = ?(Месяц(НачалоМесяца(ПериодПенсии))<10,"0","")+Месяц(НачалоМесяца(ПериодПенсии));
								ГодШапки 		 = Строка(СокрЛП(Формат(Год(НачалоМесяца(ПериодПенсии)), "ЧГ=0")));
								ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
								ДеньШапки        = ?(День(КонецМесяца(ПериодПенсии))<10,"0","")+День(КонецМесяца(ПериодПенсии));
								МесяцШапки       = ?(Месяц(КонецМесяца(ПериодПенсии))<10,"0","")+Месяц(КонецМесяца(ПериодПенсии));
								ГодШапки 		 = Строка(СокрЛП(Формат(Год(КонецМесяца(ПериодПенсии)), "ЧГ=0")));
								ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
								
								
								СтрокаЗар = ВРЕГ(ТипЗаписиНач2+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+"ПЕНСИЯ= = =");
								ТекстФайла.ДобавитьСтроку(СтрокаЗар);
								ТекСтрока = ТекСтрока+1;
								ПенсияВыгружена = Истина;
							КонецЕсли;
							
							СтрокаЗар = СтрокаЗар + ">";
							ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
							
							//+ СВЭЙ КДЯ 18.10.19 СВФР-004943
							ОтборСтрокДоговоров = Новый Структура;
							ОтборСтрокДоговоров.Вставить( "ФизЛицо", ВыборкаПоРаботникиОрганизации.ФизЛицо );
							ОтборСтрокДоговоров.Вставить( "ВидДоговора", ВыборкаПоРаботникиОрганизации.ВидДоговора );
							ОтборСтрокДоговоров.Вставить( "ВидДеятельности", ?( ЕстьНеоплДог, "НЕОПЛДОГ", "ДОГОВОР" ) );
							
							СтрокиПоРаботнику = ТЗ_СведенияОСтаже.НайтиСтроки( ОтборСтрокДоговоров );
							//- СВЭЙ КДЯ 18.10.19 СВФР-004943
							

							//ПСА 04.07.2019 СВФР-004497++
							ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику
									                          //+ СВЭЙ КДЯ 25.07.19 СВФР-004561
																, ЗначениеКв
															  //- СВЭЙ КДЯ 25.07.19 СВФР-004561
										 					);
							//+++ПСА 04.07.2019 СВФР-004497							
							если не Сч > Колич-1 Тогда
								СтрокаФайла1 = ВРЕГ(СтрокаФайла+ ?(РаботДоходСлед = 0, " ", СокрЛП(Строка(Формат(РаботДоходСлед,"ЧГ=0"))))+"="+
								?(РаботБольнСлед = 0, " ", СокрЛП(Строка(Формат(РаботБольнСлед,"ЧГ=0"))))+"="+
								?(РаботВзносСлед = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед,"ЧГ=0"))))+"="+
								?(РаботВзносСлед1 = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед1,"ЧГ=0"))))+"="+
								?(РаботВзносСлед2 = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед2,"ЧГ=0"))))+"="+
								?(РаботВзносСлед = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед,"ЧГ=0"))))+"="+
								?(РаботВзносСлед3 = 0, " ", СокрЛП(Строка(Формат(РаботВзносСлед3,"ЧГ=0"))))+"="+
								
								//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
								//?( ЕстьНеоплДог и КоличествоМес=0,"0",Формат(КоличествоМес,"ЧГ=0"))+"="
								//+?(КоличествоЗаписейОСтаже=0,"0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))+"="
								//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
								?( ЕстьНеоплДог ИЛИ КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
								+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
								//- СВЭЙ КДЯ 25.07.19 СВФР-004561
								                  
								+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "="
								+ Формат( ГОД( ДатаНачала ),"ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
								//Островская Татьяна 20.01.2014 № 17051
							КонецЕсли;	
						КонецЕсли;
					иначе
						если  КатегорияВывод= "ДОГОВОР" Тогда
							СтрокаЗар = СтрокаЗар + ">";
							ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
						КонецЕсли;
					КонецЕсли;
					//Островская Татьяна 17.01.2013 № 16153
					//Островская Татьяна 25.10.2012 № 15958	
					
					
					
					СтрМес = СтрМес+1;
				КонецЦикла;
				////Для пенсии
				если НазначениеПенсии Тогда 
					если не ПенсияВыгружена Тогда 
						ТипЗаписиНач2 = "СТАЖ=";
						Структура = Новый Структура;
						Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
						если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
							Структура.Вставить("ВидДоговора",null);
						Иначе 
							Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
						КонецЕсли;
						ПериодПенсии = СтрокиПоРаботнику1[СтрокиПоРаботнику1.Количество()-1].Период;
						ДеньШапки        = ?(День(НачалоМесяца(ПериодПенсии))<10,"0","")+День(НачалоМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(НачалоМесяца(ПериодПенсии))<10,"0","")+Месяц(НачалоМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(НачалоМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаНачалаРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						ДеньШапки        = ?(День(КонецМесяца(ПериодПенсии))<10,"0","")+День(КонецМесяца(ПериодПенсии));
						МесяцШапки       = ?(Месяц(КонецМесяца(ПериодПенсии))<10,"0","")+Месяц(КонецМесяца(ПериодПенсии));
						ГодШапки 		 = Строка(СокрЛП(Формат(Год(КонецМесяца(ПериодПенсии)), "ЧГ=0")));
						ДатаОкончанияРабот   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
						
						СтрокаЗар = ВРЕГ(ТипЗаписиНач2+ДатаНачалаРабот+"="+ДатаОкончанияРабот+"= ="+"ПЕНСИЯ= = =");
						ТекстФайла.ДобавитьСтроку(СтрокаЗар);
						ТекСтрока = ТекСтрока+1;
						
					КонецЕсли;
					ПенсияВыгружена = Ложь;  //Островская Татьяна 20.01.2014 № 17051
				КонецЕсли;
				
				
				ТипЗаписиНач = "СТАЖ=";
				Структура = Новый Структура;
				Структура.Вставить("ФизЛицо",ВыборкаПоРаботникиОрганизации.ФизЛицо);
				если ВыборкаПоРаботникиОрганизации.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка() Тогда 
					Структура.Вставить("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.ПустаяСсылка());
				Иначе 
					Структура.Вставить("ВидДоговора",ВыборкаПоРаботникиОрганизации.ВидДоговора);
				КонецЕсли;
				
				СтрокиПоРаботнику = СведенияОСтаже.НайтиСтроки(Структура); 
				КоличествоЗаписейОСтаже = 0;
				ПредыдущийВидДейтельности = "";
				ПредыдущееОкончаниеРабот = "";
				ДатаНачалаРабот = "";
				Для каждого СтрокаСтаж из СтрокиПоРаботнику цикл
					//если не (СтрокаМес.Период >= НачалоМесяца(СтрокаСтаж.ДатаНачалаРабот) и  СтрокаМес.Период <= КонецМесяца(СтрокаСтаж.ДатаОкончанияРабот)) Тогда 
					//	Продолжить;
					//КонецЕсли;
					
					
					ДатаФормированияДети = СтрокаСтаж.ДатаНачалаРабот; //О.Т. Аверсон 22.04.2019 № 4269 убрать замену 2011-2012
					ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
					МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
					ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
					ДатаНачалаРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
					
					
					ДатаФормированияДети = СтрокаСтаж.ДатаОкончанияРабот;
					ДеньШапкиДети        = ?(День(ДатаФормированияДети)<10,"0","")+День(ДатаФормированияДети);
					МесяцШапкиДети       = ?(Месяц(ДатаФормированияДети)<10,"0","")+Месяц(ДатаФормированияДети);
					ГодШапкиДети 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияДети), "ЧГ=0")));
					ДатаОкончанияРаботДети   = ДеньШапкиДети+"/"+МесяцШапкиДети+"/"+ГодШапкиДети;
					
					СтрокаЗар = ВРЕГ(ТипЗаписиНач+ДатаНачалаРаботДети+"="+ДатаОкончанияРаботДети+"= ="+СокрЛП(СтрокаСтаж.ВидДеятельности)+"= = =");
					ТекстФайла.ДобавитьСтроку(СтрокаЗар);
					ТекСтрока = ТекСтрока+1;
					//ТекстФайла.ДобавитьСтроку(СтрокаЗар);
					//ТекСтрока = ТекСтрока+1;
					Если СокрЛП(СтрокаСтаж.ВидДеятельности) = "ДЕТИ" Тогда 
						КоличествоЗаписейОСтаже = КоличествоЗаписейОСтаже+1;
					КонецЕсли;
					//Если Категория = "03" тогда
					//	НомерДоговора = СокрЛП(СтрокаСтаж.НомерДокумента);
					//	ДатаФормирования = СтрокаСтаж.ДатаДокумента;
					//	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
					//	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
					//	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
					//	ДатаДокумента   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
					//	СтрокаФайла = СтрокаФайла+Число(НомерДоговора)+"="+ДатаДокумента+"=";
					//КонецЕсли;
					//ПредыдущийВидДейтельности = СтрокаСтаж.ВидДейтельности;
					//ПредыдущееОкончаниеРабот = СтрокаСтаж.ОкончаниеРабот;
				КонецЦикла;
				
				//О.Т. Аверсон 15.03.2019 № 4091
				//ПСА 04.07.2019 СВФР-004497++
				ЗначениеКв = ПолучитьЗначениеКВ( СтрокиПоРаботнику
						                          //+ СВЭЙ КДЯ 25.07.19 СВФР-004561
													, ЗначениеКв
												  //- СВЭЙ КДЯ 25.07.19 СВФР-004561
							 					);
			    //+++ПСА 04.07.2019 СВФР-004497
				//О.Т. Аверсон 15.03.2019 № 4091

				//если не СтрМес>1 Тогда 
				если не КатегорияВывод= "ДОГОВОР" Тогда
					//Островская Татьяна 20.01.2014 № 17051
					СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, "0", СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
					?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
					
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//Формат(КоличествоМес,"ЧГ=0")+"="+?(КоличествоЗаписейОСтаже=0,"0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					?( КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) ) 
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					
					+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
					+ Формат( ГОД( ДатаНачала ), "ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
				иначе
					
					//если не СтрМес>1 Тогда
					//Островская Татьяна 20.01.2014 № 17051
					СтрокаФайла = ВРЕГ(СтрокаФайла+ ?(РаботДоход = 0, ?(ЕстьНеоплДог,"0"," "), СокрЛП(Строка(Формат(РаботДоход,"ЧГ=0"))))+"="+
					?(РаботБольн = 0, "0", СокрЛП(Строка(Формат(РаботБольн,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос1 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос1,"ЧГ=0"))))+"="+
					?(РаботВзнос2 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос2,"ЧГ=0"))))+"="+
					?(РаботВзнос = 0, "0", СокрЛП(Строка(Формат(РаботВзнос,"ЧГ=0"))))+"="+
					?(РаботВзнос3 = 0, "0", СокрЛП(Строка(Формат(РаботВзнос3,"ЧГ=0"))))+"="+
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					//?(ЕстьНеоплДог и КоличествоМес=0,"0",Формат(КоличествоМес,"ЧГ=0"))+"="+?(КоличествоЗаписейОСтаже=0,"0",СокрЛП(Строка(Формат(КоличествоЗаписейОСтаже+?(НазначениеПенсии,1,0),"ЧГ=0"))))
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
					?( ЕстьНеоплДог ИЛИ КоличествоМес = 0, "0", Формат( КоличествоМес, "ЧГ=0" ) ) + "=" 
					+ ?( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0) = 0, "0", Формат( КоличествоЗаписейОСтаже + ?( НазначениеПенсии, 1, 0 ), "ЧГ=0" ) )
					//- СВЭЙ КДЯ 25.07.19 СВФР-004561
					+ "=" + ДатаЗаполнения + "=" + ?( ЗначениеКв = " ", ЗначениеКв, СокрЛП( ЗначениеКв ) ) + "=" 
					+ Формат( ГОД( ДатаНачала ), "ЧГ=0" ) + "=" + СтрЗаменить( ТелефонОрганизации, " ", "" ) ) + "=";
					//КонецЕсли;	
				КонецЕсли;
				//КонецЕсли;
				ТекстФайла.ЗаменитьСтроку(СтрокаЗамены, СтрокаФайла);
				если не КатегорияВывод= "ДОГОВОР" Тогда
					СтрокаЗар = СтрокаЗар + ">";
					ТекстФайла.ЗаменитьСтроку(ТекСтрока, СтрокаЗар);
				КонецЕсли;
				
				
				
				
				
				
				
				
				
				
			КонецЕсли;
			если Сч+1 <= СтрокиПоРаботнику1.Количество()-1 Тогда 
				если не КатегорияВывод= "ДОГОВОР" Тогда
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
					ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
					ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
				иначе
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;          
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
					ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
					ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
				КонецЕсли;
			иначе
				если КатегорияВывод= "ДОГОВОР" Тогда
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
					ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
					ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
					
				иначе
					ИтогДохода = ИтогДохода + РаботДоход;
					ИтогБольн = ИтогБольн + РаботБольн;
					ИтогВзнос = ИтогВзнос + РаботВзнос;
					ИтогВзнос1 = ИтогВзнос1 + РаботВзнос1;
					ИтогВзнос2 = ИтогВзнос2 + РаботВзнос2;
					ИтогВзнос3 = ИтогВзнос3 + РаботВзнос3;
					
				КонецЕсли;                          
			КонецЕсли;
			
			
		КонецЦикла; 
		Дбф.ЗакрытьФайл();
		//Островская Татьяна 25.10.2012 № 15
		//Островская Татьяна 17.01.2013 № 16153
		//Островская Татьяна 20.01.2014 № 17051
		если не КатегорияВывод= "ДОГОВОР" Тогда
			
			СтрокаФайла = "ТИПД=ПУ-3="+СокрЛП(Строка(КоличествоДокументов))+"="+ ?(ИтогДохода = 0, "0", СокрЛП(Строка(Формат(ИтогДохода,"ЧГ=0"))))+"="+
			?(ИтогБольн = 0, "0", СокрЛП(Строка(Формат(ИтогБольн,"ЧГ=0"))))+"="+
			?(ИтогВзнос+ИтогВзнос1+ИтогВзнос2 = 0, "0", СокрЛП(Строка(Формат(ИтогВзнос+ИтогВзнос1+ИтогВзнос2,"ЧГ=0"))))+"="+
			?(ИтогВзнос+ИтогВзнос1+ИтогВзнос2 = 0, "0", СокрЛП(Строка(Формат(ИтогВзнос+ИтогВзнос1+ИтогВзнос2,"ЧГ=0"))))+"=>";//Островская Татьяна 17.01.2013 № 16153
		Иначе 
			СтрокаФайла = "ТИПД=ПУ-3="+СокрЛП(Строка(КоличествоДокументов))+"="+ ?(ИтогДохода = 0, "0", СокрЛП(Строка(Формат(ИтогДохода,"ЧГ=0"))))+"="+
			?(ИтогБольн = 0, "0", СокрЛП(Строка(Формат(ИтогБольн,"ЧГ=0"))))+"="+
			?(ИтогВзнос+ИтогВзнос1+ИтогВзнос2 = 0, "0", СокрЛП(Строка(Формат(ИтогВзнос+ИтогВзнос1+ИтогВзнос2,"ЧГ=0"))))+"="+
			?(ИтогВзнос+ИтогВзнос1+ИтогВзнос2 = 0, "0", СокрЛП(Строка(Формат(ИтогВзнос+ИтогВзнос1+ИтогВзнос2,"ЧГ=0"))))+"=>";//Островская Татьяна 17.01.2013 № 16153
		КонецЕсли;	
		//Островская Татьяна 20.01.2014 № 17051
		//Островская Татьяна 17.01.2013 № 16153
		
		
		//Островская Татьяна 25.10.2012 № 15
		ТекстФайла.ЗаменитьСтроку(3, СтрокаФайла);
		
		//толик проверка ФСЗН дбф	
		//ДоходыПоВидамЗаГод =
		//"ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК Больничные,
		//|	СУММА(ВЫБОР
		//|			КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|				ТОГДА ЕСНСведенияОДоходах.Результат
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК СуммаДохода,
		//|	ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		//|	ЕСНИсчисленный.ФСЗН КАК ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд КАК ПенсионныйФонд,
		//|	34 КАК ПроцентФСЗН,
		//|	ЕСНСведенияОДоходах.Период КАК ПериодРегистрации
		//|ИЗ
		//|	РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|			34 КАК ПроцентФСЗН,
		//|			СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//|			СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//|			ЕСНИсчисленный.Период КАК Период
		//|		ИЗ
		//|			РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|		ГДЕ
		//|			ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		//|			И ЕСНИсчисленный.Организация = &Организация
		//|			И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ЕСНИсчисленный.ФизЛицо,
		//|			ЕСНИсчисленный.Период) КАК ЕСНИсчисленный
		//|		ПО ЕСНСведенияОДоходах.ФизЛицо = ЕСНИсчисленный.ФизЛицо
		//|			И ЕСНСведенияОДоходах.Период = ЕСНИсчисленный.Период
		//|ГДЕ
		//|	ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		//|	И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЕСНСведенияОДоходах.ФизЛицо,
		//|	ЕСНИсчисленный.ФСЗН,
		//|	ЕСНИсчисленный.ПенсионныйФонд,
		//|	ЕСНИсчисленный.ПроцентФСЗН,
		//|	ЕСНСведенияОДоходах.Период";
		
		// + СВЭЙ КДЯ 31.07.19 СВФР-004561
		//ДоходыПоВидамЗаГод =
		//"ВЫБРАТЬ
		//|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		//|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		//|	ОбщаяТаблицаФСЗН.ФизЛицо,
		//|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		//|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		//|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		//|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		NULL КАК Больничные,
		//|		NULL КАК СуммаДохода,
		//|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		//|		ВЫБОР
		//|		КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		//|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		//|		КОНЕЦ КАК ПериодВзаиморасчетов,
		//|		34 КАК ПроцентФСЗН,
		//|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		//|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		//|		ЕСНИсчисленный.Период КАК Период
		//|	ИЗ
		//|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		//|	ГДЕ
		//|		ЕСНИсчисленный.Организация = &Организация
		//|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		//|		И (ЕСНИсчисленный.Период МЕЖДУ &НачалоНП И &КонецНП
		//|				ИЛИ ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП)
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		ЕСНИсчисленный.ФизЛицо,
		//|		ЕСНИсчисленный.Период,
		//|		ВЫБОР
		//|			КОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|				ТОГДА НАЧАЛОПЕРИОДА(ЕСНИсчисленный.Период, МЕСЯЦ)
		//|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		//|		КОНЕЦ
		//
		//|	
		//|	ОБЪЕДИНИТЬ ВСЕ
		//|	
		//|	ВЫБРАТЬ
		//|		СУММА(ВЫБОР
		//|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		//|					ТОГДА ЕСНСведенияОДоходах.Результат
		//|				ИНАЧЕ 0
		//|			КОНЕЦ),
		//|		СУММА(ВЫБОР
		//|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		//|					ТОГДА ЕСНСведенияОДоходах.Результат
		//|				ИНАЧЕ 0
		//|			КОНЕЦ),
		//|		ЕСНСведенияОДоходах.ФизЛицо,
		//|		ВЫБОР
		//|		КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		//|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		//|		КОНЕЦ,
		//|		34,
		//|		NULL,
		//|		NULL,
		//|		ЕСНСведенияОДоходах.Период
		//|	ИЗ
		//|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		//|	ГДЕ
		//|		ЕСНСведенияОДоходах.Организация = &Организация
		//|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		//|		И (ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		//|				ИЛИ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП)
		//|	СГРУППИРОВАТЬ ПО
		//|	ЕСНСведенияОДоходах.ФизЛицо,
		//|	ЕСНСведенияОДоходах.Период,
		//|	ВЫБОР
		//|		КОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//|			ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ)
		//|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ)
		//|	КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		//
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ОбщаяТаблицаФСЗН.ФизЛицо,
		//|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		//|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		//|	ОбщаяТаблицаФСЗН.Период
		//|	УПОРЯДОЧИТЬ ПО
		//|	ПериодРегистрации";	
		//Запрос.Текст = ДоходыПоВидамЗаГод;
		//ПромежуточнаяТаблица = Запрос.Выполнить().Выгрузить();
		// - СВЭЙ КДЯ 31.07.19 СВФР-004561
		
		//формируем файл
		
		Дбф=Новый XBase();
		Дбф.Кодировка=КодировкаXBase.OEM;
		Дбф.Поля.Добавить("Tab_nom", "S", 10);
		Дбф.Поля.Добавить("FIO", "S", 50);
		Дбф.Поля.Добавить("Datr", "D");
		Дбф.Поля.Добавить("Dato", "D");
		Дбф.Поля.Добавить("Sm", "N", 12);
		Дбф.Поля.Добавить("Bl", "N", 12);
		Дбф.Поля.Добавить("Vz", "N", 12);
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			Дбф.СоздатьФайл(ПутьКФайлу+"\Vznosy.DBF");
		иначе
			РабочийКаталог = СтрокаСоединенияИнформационнойБазы();
			б = Сред(РабочийКаталог,7);
			в = Найти(б,Символ(34));
			путьИБ = Лев(б, в-1);
			
			Дбф.СоздатьФайл(путьИБ+"\Vznosy.DBF");
		КонецЕсли;
		//Островская Татьяна 22.02.2013 № 16256 Островская Татьяна 27.05.2014 № 17388
		
		
		Для Каждого мСтрока из ПромежуточнаяТаблица Цикл
			Дбф.Добавить();
			Дбф.УстановитьЗначениеПоля("FIO", СокрЛП(Строка(мСтрока.ФизЛицо)));
			Дбф.УстановитьЗначениеПоля("Datr", мСтрока.ПериодРегистрации);
			Дбф.УстановитьЗначениеПоля("Dato", мСтрока.ПериодВзаиморасчетов);
			//О.Т. Аверсон 29.08.2018 № 2363
			Если ЗначениеЗаполнено(ВидНалогообложения) Тогда 
				ОсновнойВидНалогообл = ВидНалогообложения;
			иначе
				ОсновнойВидНалогообл = Организация.ОсновнаяСтавкаНалогообложения;
			КонецЕсли;
			//О.Т. Аверсон 29.08.2018 № 2363
			//О.Т. Аверсон 29.01.2018 № 1511
			СтруктураФСЗН = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(КонецМесяца(мСтрока.ПериодРегистрации),Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ФСЗН,ОсновнойВидНалогообл));//О.Т. Аверсон 26.03.2016 № 950
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(НачалоМесяца(мСтрока.ПериодРегистрации) - 86400,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			БазаОграниченияФСЗН = СтруктураФСЗН.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			
			Если ?(мСтрока.СуммаДохода=Null, 0,мСтрока.СуммаДохода) > БазаОграниченияФСЗН Тогда 
				мСтрока.СуммаДохода = БазаОграниченияФСЗН;
			КонецЕсли;
			//О.Т. Аверсон 29.01.2018 № 1511
			
			Дбф.УстановитьЗначениеПоля("Sm", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.СуммаДохода=Null, 0, мСтрока.СуммаДохода), мСтрока.ПериодРегистрации));//О.Т. Аверсон 14.03.2016 № 949
			Дбф.УстановитьЗначениеПоля("Bl", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.Больничные=Null, 0, мСтрока.Больничные), мСтрока.ПериодРегистрации)); //О.Т. Аверсон 14.03.2016 № 949
			Дбф.УстановитьЗначениеПоля("Vz", ОбщегоНазначения.ОкруглитьЗначение2016(?(мСтрока.ФСЗН=Null, 0, мСтрока.ФСЗН) + ?(мСтрока.ПенсионныйФонд=Null, 0, мСтрока.ПенсионныйФонд),мСтрока.ПериодРегистрации)); //О.Т. Аверсон 14.03.2016 № 949
			Дбф.Записать();
		КонецЦикла;
		Дбф.ЗакрытьФайл();
		//Предупреждение("Данные сформированы !!!");//О.Т. Аверсон 26.10.2015 № 661
		
		//О.Т. Аверсон 26.10.2015 № 661
		//записываем файл
		//О.Т. Аверсон 27.06.2016 № 1278
		ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
		
		если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			//ТекстФайла.Записать(ПутьКФайлу+"\"+"PU3_"+Номер+".txt",КодировкаТекста.ANSI);
			//Сообщить("Файл сохранен: " + ПутьКФайлу+"\"+"PU3_"+Номер+".txt");
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
			//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
			ТекстФайла.Записать( ПутьКФайлу + "\" + ИмяФайлаПачки, КодировкаТекста.ANSI );
			Сообщить( "Файл сохранен: " + ПутьКФайлу + "\" + ИмяФайлаПачки );
			//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		иначе   			
			ЗапросПутьКФайлу = Новый Запрос;
			ТекстЗапроса = "ВЫБРАТЬ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.ПутьКФайламБанк
			|ИЗ
			|	РегистрСведений.УчетнаяПолитикаПоПерсоналуОрганизаций КАК УчетнаяПолитикаПоПерсоналуОрганизаций
			|ГДЕ
			|	УчетнаяПолитикаПоПерсоналуОрганизаций.Организация = &Организация";
			
			ЗапросПутьКФайлу.УстановитьПараметр("Организация", Организация);
			
			ЗапросПутьКФайлу.Текст = ТекстЗапроса; 
			
			ПутьКФайламБанка = ЗапросПутьКФайлу.Выполнить().Выгрузить();
			
			Если Не ЗначениеЗаполнено(ПутьКФайламБанка[0].ПутьКФайламБанк) Тогда
				Сообщить("Не указан путь к файлам ПУ в учетной политике по персоналу организаций");
			Иначе
				//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
				//ТекстФайла.Записать(СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+"PU3_"+Строка(Номер) +".txt", КодировкаТекста.ANSI);
				//Сообщить("Файл сохранен: " + СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+"PU3_"+ Строка(Номер) +".txt");
				//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
				//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
				ТекстФайла.Записать(СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ИмяФайлаПачки, КодировкаТекста.ANSI);
				Сообщить("Файл сохранен: " + СокрЛП(ПутьКФайламБанка[0].ПутьКФайламБанк)+ИмяФайлаПачки);
				//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
			КонецЕсли;
			//О.Т. Аверсон 26.10.2015 № 661
		КонецЕсли;

		Возврат ТекстФайла.ПолучитьТекст();
	КонецФункции 
	
	//ПСА 04.07.2019 СВФР-004497++
	Функция ПолучитьЗначениеКВ( СтрокиПоРаботнику
		                          //+ СВЭЙ КДЯ 25.07.19 СВФР-004561
									, ИсходноеЗначениеКв = "" //, СтрокаМес = Неопределено  // СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
								  //- СВЭЙ КДЯ 25.07.19 СВФР-004561
								) 
		
		//О.Т. Аверсон 15.03.2019 № 4091
		Если ДатаНачала < Дата(2019,01,01) Тогда 
			ЗначениеКв = " ";
		иначе
			
			Если СтрокиПоРаботнику = Неопределено или СтрокиПоРаботнику.Количество() = 0 Тогда
				ДатаДляЗначенияКВ = ДатаОкончания;
				//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
				ЕстьВыборка = Ложь;
				//- СВЭЙ КДЯ 25.07.19 СВФР-004561
			Иначе
				ДатаДляЗначенияКВ = Дата(1,1,1);
				Для Каждого СтрокаПоРаботнику Из СтрокиПоРаботнику Цикл
					//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5. )
					Если 
		 				 // + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
						 //СтрокаМес <> Неопределено
						 //И СтрокаМес.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.Подряда
 						 //И (
						 //	НЕ ЗначениеЗаполнено( СтрокаПоРаботнику.Договор )
						 //   ИЛИ
						 //	ТипЗнч( СтрокаПоРаботнику.Договор ) <>  Тип( "ДокументСсылка.ДоговорНаВыполнениеРаботСФизЛицом" ) 
						 //   ИЛИ
						 //	СтрокаМес.ВидДоговора <> СтрокаПоРаботнику.ВидДоговора
						 //   
						 //	ИЛИ
						 //   СокрЛП( СтрокаМес.НомерДокумента ) <> ПолучитьНомерДокументаДляПУ( СтрокаПоРаботнику.Договор )
						 //   
						 //   ИЛИ
						 //   СтрокаМес.ДатаДокумента <> ПолучитьДатуДокументаДляПУ( СтрокаПоРаботнику.Договор )
						 //  )
 		 				 // - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
 		 				 // + СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
						 СокрЛП( СтрокаПоРаботнику.ВидДеятельности ) = "ДОГОВОР"
 		 				 // - СВЭЙ КДЯ СВФР-004631 17.09.19 ( пункт 28. )
							
					Тогда
					
						Продолжить;	
					
					КонецЕсли; 
					//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 5.)
					Если ДатаДляЗначенияКВ < СтрокаПоРаботнику.ДатаОкончанияРабот Тогда 
						ДатаДляЗначенияКВ = СтрокаПоРаботнику.ДатаОкончанияРабот;
					КонецЕсли;
				КонецЦикла;
				
				//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
				
				
				ЕстьВыборка = Истина;
				ДатаДляЗначенияКВ = Мин( Макс( ДатаДляЗначенияКВ, ДатаНачала ), ДатаОкончания );
				//- СВЭЙ КДЯ 25.07.19 СВФР-004561
				
			КонецЕсли;	
			
			Если Месяц(ДатаДляЗначенияКВ) >=1 и  Месяц(ДатаДляЗначенияКВ) <=3 Тогда 
				ЗначениеКв = "1";
			ИначеЕсли Месяц(ДатаДляЗначенияКВ) >=4 и  Месяц(ДатаДляЗначенияКВ) <=6 Тогда 
				ЗначениеКв = "2";
			ИначеЕсли Месяц(ДатаДляЗначенияКВ) >=7 и  Месяц(ДатаДляЗначенияКВ) <=9 Тогда 
				ЗначениеКв = "3";	  
			ИначеЕсли Месяц(ДатаДляЗначенияКВ) >=10 и  Месяц(ДатаДляЗначенияКВ) <=12 Тогда 
				ЗначениеКв = "4"; 			
			КонецЕсли; 
			
			//+ СВЭЙ КДЯ 25.07.19 СВФР-004561
			//Если НЕ ЕстьВыборка И СокрЛП( ИсходноеЗначениеКв ) <> "" И ЗначениеКв <> ИсходноеЗначениеКв Тогда
			//	ЗначениеКв = ИсходноеЗначениеКв;	
			//КонецЕсли;
			Если ЕстьВыборка Тогда
				
				Если НЕ ПустаяСтрока( ИсходноеЗначениеКв ) Тогда
					Если Лев( ИсходноеЗначениеКв, 1 ) = " " Тогда  // это значение квартала было вычислено ранее без выборки
						// оставляем ЗначениеКв без изменений
					Иначе // ИсходноеЗначениеКв	- было вычислено ранее на основании выборки
						Если Число( ЗначениеКв ) < Число( ИсходноеЗначениеКв ) Тогда
						
							ЗначениеКв = ИсходноеЗначениеКв;	
						
						КонецЕсли; 	
					КонецЕсли; // Лев( ИсходноеЗначениеКв, 1 ) = " "
				КонецЕсли; // НЕ ПустаяСтрока( ИсходноеЗначениеКв )
				
			Иначе  // НЕ ЕстьВыборка
				
				ЗначениеКв = " " + ЗначениеКв; //пробел слева - признак того, что квартал вычислен без выборки
				Если НЕ ПустаяСтрока( ИсходноеЗначениеКв ) И ЗначениеКв <> ИсходноеЗначениеКв Тогда
					ЗначениеКв = ИсходноеЗначениеКв;	
				КонецЕсли; // НЕ ПустаяСтрока( ИсходноеЗначениеКв )
				
			КонецЕсли; // ЕстьВыборка
			//- СВЭЙ КДЯ 25.07.19 СВФР-004561
			
			
		КонецЕсли;
		
		Возврат ЗначениеКв;
	КонецФункции
	//+++ПСА 04.07.2019 СВФР-004497

	
	
	Функция ПолучитьДанныеДляЗаполненияСтажа( Организация, Год ) Экспорт
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр( "ДокументСсылка" , Ссылка );
		
		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 23. )
		//Запрос.УстановитьПараметр("Организация", Организация);
		//Запрос.УстановитьПараметр("НачалоНП", НачалоГода(НачалоГода(ДобавитьМесяц(НачалоКвартала(ДатаНачала),-1))));
		//Запрос.УстановитьПараметр("КонецНП", КонецГода(Год));
		//Запрос.УстановитьПараметр("БольничныйПоТравме", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве);
		//Запрос.УстановитьПараметр("ОтпускПоУходуЗаРебенком", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты);
		//Запрос.УстановитьПараметр("ПриемНаРаботу", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
		//Запрос.УстановитьПараметр("Перемещение", Перечисления.ПричиныИзмененияСостояния.Перемещение);
		//Запрос.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
		//Запрос.УстановитьПараметр("Договор", Перечисления.СпособыРасчетаОплатыТруда.ПоДоговоруФиксированнойСуммой);
		//
		//СписокФизлицТекст = "ВЫБРАТЬ 
		//|	ТЧРаботникиОрганизации.ФизЛицо
		//|ИЗ
		//|	Документ.СведенияОЗаработкеРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		//|
		//|ГДЕ
		//|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		//
		//ДатыДвиженийТекст = 
		//"ВЫБРАТЬ
		//|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо,
		//|	&НачалоНП КАК ДатаС,
		//|	РаботникиОрганизацийСрезПоследних.Организация КАК Организация,
		//|	РаботникиОрганизацийСрезПоследних.Должность.ВидДейтельности.Код КАК ВидДейтельности
		//|ИЗ
		//|   РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоНП) КАК РаботникиОрганизацийСрезПоследних
		//|ГДЕ
		//|   РаботникиОрганизацийСрезПоследних.Организация = &Организация
		//|   И РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо В (" + СписокФизлицТекст + ")
		//|   И РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> &Увольнение
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|	
		//|ВЫБРАТЬ
		//|	РаботникиОрганизаций.Сотрудник.Физлицо,
		//|	РаботникиОрганизаций.Период,
		//|	РаботникиОрганизаций.Организация, 
		//|	РаботникиОрганизаций.Должность.ВидДейтельности.Код КАК ВидДейтельности 
		//|ИЗ
		//|   РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		//|ГДЕ
		//|	РаботникиОрганизаций.Организация = &Организация
		//|   И РаботникиОрганизаций.Сотрудник.Физлицо В (" + СписокФизлицТекст + ")
		//|   И РаботникиОрганизаций.Период МЕЖДУ &НачалоНП И &КонецНП
		//|   И РаботникиОрганизаций.ПричинаИзмененияСостояния <> &Увольнение";
		//
		//ЗапросТекст = 
		//"ВЫБРАТЬ 
		//|	ДопСведОСтаже.ВидДейтельности КАК ВидДейтельности,
		//|	ДопСведОстаже.ФизЛицо КАК ФизЛицо,
		//|   ДопСведОСтаже.НачалоРабот КАК НачалоРабот,
		//|   ДопСведОСтаже.ОкончаниеРабот КАК ОкончаниеРабот,
		//|   ДопСведОСтаже.ДатаДокумента КАК ДатаДокумента,
		//|   ДопСведОСтаже.НомерДокумента КАК НомерДокумента,
		//|   ДопСведОСтаже.ДатаДляПУ КАК ДатаДляПУ,
		//|   ДопСведОСтаже.ВидДоговора КАК ВидДоговора
		//|ИЗ
		//|   (";
		//ЕСЛИ ДогПодряда или ВсеСотрудники Тогда 
		//	ЗапросТекст = ЗапросТекст +	
		//	"ВЫБРАТЬ
		//	|		""ДОГОВОР"" КАК ВидДейтельности,
		//	|		ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.Физлицо КАК ФизЛицо,
		//	|		ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаНачала КАК НачалоРабот,
		//	|		ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаОкончания КАК ОкончаниеРабот,
		//	|       Выбор когда ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаПУ = ДатаВремя(1,1,1) тогда  ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.Дата иначе ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаПУ конец КАК  ДатаДокумента,
		//	|       Выбор когда ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.НомерДляПу = """" тогда ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.Номер иначе ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.НомерДляПу конец КАК НомерДокумента,
		//	|       Выбор когда ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаПУ = ДатаВремя(1,1,1) тогда  ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаНачала иначе ПлановыеНачисленияРаботниковОрганизаций.ДокументОснование.ДатаПУ конец КАК  ДатаДляПУ,
		//	|       ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.ВидДоговора как ВидДоговора
		//	|	ИЗ
		//	|		РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
		//	|	ГДЕ
		//	|		ПлановыеНачисленияРаботниковОрганизаций.Период <= &КонецНП
		//	|		И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения >= &НачалоНП
		//	|		И ПлановыеНачисленияРаботниковОрганизаций.Организация = &Организация
		//	|		И ПлановыеНачисленияРаботниковОрганизаций.Сотрудник.Физлицо В (" + СписокФизлицТекст + ")
		//	|		И ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = &Договор
		//	|
		//	|ОБЪЕДИНИТЬ ВСЕ ";
		//КонецЕсли;
		//ЗапросТекст = ЗапросТекст +
		//"ВЫБРАТЬ  
		//|       ""СТРАХСЛУЧ"" КАК ВидДейтельности, 
		//|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ФизЛицо КАК ФизЛицо,
		//|		ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК НачалоРабот,
		//|		ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ОкончаниеРабот,
		//|       NULL КАК  ДатаДокумента,
		//|       NULL КАК НомерДокумента,
		//|       NULL КАК  ДатаДляПУ,
		//|      NULL как ВидДоговора
		//| 	ИЗ
		//|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|   ГДЕ
		//|      ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало <= &КонецНП
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец >= &НачалоНП
		//|		И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//|		И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ФизЛицо В (" + СписокФизлицТекст + ")
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = &БольничныйПоТравме
		//|
		////";
		////если ВсеСотрудники или Основные Тогда 
		////ЗапросТекст = ЗапросТекст +
		////" 
		//| ОБЪЕДИНИТЬ ВСЕ
		//|
		//|    ВЫБРАТЬ  
		//|       ""ДЕТИ"" КАК ВидДейтельности, 
		//|		ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ФизЛицо КАК ФизЛицо,
		//|		ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК НачалоРабот,
		//|		ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ОкончаниеРабот,
		//|       NULL КАК  ДатаДокумента,
		//|       NULL  КАК НомерДокумента,
		//|       NULL КАК  ДатаДляПУ,
		//|      NULL как ВидДоговора
		//| 	ИЗ
		//|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		//|   ГДЕ
		//|      ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало <= &КонецНП
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец >= &НачалоНП
		//|		И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
		//|		И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник.ФизЛицо В (" + СписокФизлицТекст + ")
		//|		И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета = &ОтпускПоУходуЗаРебенком
		//| 
		////";
		////КонецЕсли;
		////ЗапросТекст = ЗапросТекст +
		//| ОБЪЕДИНИТЬ ВСЕ
		//|
		//|	ВЫБРАТЬ
		//|	ДатыНазначений1.ВидДейтельности КАК ВидДейтельности,
		//|	ДатыНазначений1.ФизЛицо КАК ФизЛицо,
		//|	ДатыНазначений1.ДатаС КАК НачалоРабот,
		//|	ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.Период), &КонецНП) КАК ДатаОкончанияРабот,
		//|	NULL КАК  ДатаДокумента,
		//|	NULL  КАК НомерДокумента,
		//|       NULL КАК  ДатаДляПУ,
		//|      NULL как ВидДоговора
		//|ИЗ
		//|	(" + ДатыДвиженийТекст + ") КАК ДатыНазначений1
		//|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДатыНазначений2
		//|					ПО ДатыНазначений2.Сотрудник.Физлицо = ДатыНазначений1.ФизЛицо
		//|						И ДатыНазначений2.Организация = ДатыНазначений1.Организация
		//|						И ДатыНазначений2.Период > ДатыНазначений1.ДатаС
		//|						И (ДатыНазначений2.Период < &КонецНП)
		//|			
		//|СГРУППИРОВАТЬ ПО
		//|	ДатыНазначений1.ФизЛицо,
		//|   ДатыНазначений1.ВидДейтельности,
		//|	ДатыНазначений1.ДатаС
		//|) КАК ДопСведОСтаже
		//|УПОРЯДОЧИТЬ ПО
		//|	ФизЛицо,
		//|	ВидДейтельности,
		//|	НачалоРабот";
		//
		//
		//Запрос.Текст = ЗапросТекст;
		//ТаблицаСтажа = Запрос.Выполнить().Выгрузить();
		//
		//// Удалим из таблицы стажа незначимые записи:
		////  - если по физлицу имеется 2 непрерывных записи с одинаковыми условиями труда, то объединим данные записи 
		////Н = ТаблицаСтажа.Количество() - 1;
		////Пока Н > 0 Цикл
		////	
		////	ТекущаяЗапись = ТаблицаСтажа[Н];
		////	ПредшествующаяЗапись = ТаблицаСтажа[Н-1];
		////	
		////	Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
		////		И ТекущаяЗапись.НачалоРабот = КонецДня(ПредшествующаяЗапись.ОкончаниеРабот)+1 // если записи непрерывны (идут друг за другом по времени)
		////		// и совпадают параметры стажа
		////		И ТекущаяЗапись.ВидДейтельности = ПредшествующаяЗапись.ВидДейтельности  
		////		Тогда
		////		// объединим записи в одну
		////		ПредшествующаяЗапись.ОкончаниеРабот = ТекущаяЗапись.ОкончаниеРабот;
		////		ТаблицаСтажа.Удалить(ТекущаяЗапись);
		////	КонецЕсли; 
		////	Н = Н - 1;	
		////КонецЦикла;
		//
		//ПредшествующееФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		//МассивСтрок = Новый Массив;
		//СтрокСтажа = 0;
		//СтруктураПоиска = Новый Структура("ФизЛицо");
		//Н = ТаблицаСтажа.Количество();
		//Пока Н > 0 Цикл
		//	
		//	ТекущаяЗапись = ТаблицаСтажа[Н - 1];
		//	
		//	Если ТекущаяЗапись.ФизЛицо <> ПредшествующееФизЛицо Тогда
		//		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущаяЗапись);
		//		МассивСтрок = ТаблицаСтажа.НайтиСтроки(СтруктураПоиска);
		//		ПредшествующееФизЛицо = ТекущаяЗапись.ФизЛицо;
		//	КонецЕсли; 
		//	
		//	СтрокСтажа = МассивСтрок.Количество();
		//	//Если СтрокСтажа = 0 Тогда
		//	//	ЗаполнитьЗначенияСвойств(Таблица.Добавить(),ТекущаяЗапись);
		//	//	Н = Н - 1;	
		//	//	Продолжить;
		//	//КонецЕсли;
		//	
		//	НачалоРабот = ТекущаяЗапись.НачалоРабот;
		//	ОкончаниеРабот = ТекущаяЗапись.ОкончаниеРабот;
		//	
		//	Для Сч = 1 По СтрокСтажа Цикл
		//		СтрокаСтажа = МассивСтрок[СтрокСтажа - Сч];
		//		Если СтрокаСтажа.ВидДейтельности = "ДЕТИ" тогда
		//			
		//			Если НачалоРабот = СтрокаСтажа.НачалоРабот И ТекущаяЗапись.ВидДейтельности <> "ДЕТИ" тогда
		//				//Если ОкончаниеРабот = СтрокаСтажа.ОкончаниеРабот тогда
		//				//	ТекущаяЗапись.Удалить();
		//				//КонецЕсли;
		//				ТекущаяЗапись.НачалоРабот = НачалоДня(СтрокаСтажа.ОкончаниеРабот + 1);
		//			КонецЕсли;
		//			
		//			Если НачалоРабот < СтрокаСтажа.НачалоРабот Тогда
		//				Если ОкончаниеРабот > СтрокаСтажа.ОкончаниеРабот Тогда
		//					НоваяСтрока = ТаблицаСтажа.Добавить();
		//					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяЗапись);
		//					НоваяСтрока.НачалоРабот = КонецДня(СтрокаСтажа.ОкончаниеРабот) + 1;
		//					НоваяСтрока.ОкончаниеРабот = ОкончаниеРабот;
		//					ТекущаяЗапись.ОкончаниеРабот = НачалоДня(СтрокаСтажа.НачалоРабот) -1;
		//					
		//					
		//				КонецЕсли;
		//			КонецЕсли;		
		//			
		//			Если ОкончаниеРабот = СтрокаСтажа.ОкончаниеРабот И ТекущаяЗапись.ВидДейтельности <> "ДЕТИ" тогда
		//				ТекущаяЗапись.ОкончаниеРабот = НачалоДня(СтрокаСтажа.НачалоРабот - 1);
		//			КонецЕсли;
		//			
		//			
		//			
		//		КонецЕсли;
		//		
		//	КонецЦикла;				
		//	Н = Н - 1;	
		//КонецЦикла;
		//
		//ТаблицаСтажа.Сортировать("ФизЛицо,НачалоРабот,ВидДейтельности");	
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 23. )

		// + СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 23. )
		Запрос.Текст = 
		            "ВЫБРАТЬ
		            |	СведенияОСтаже.ФизЛицо КАК ФизЛицо,
		            |	СведенияОСтаже.ДатаНачалаРабот КАК НачалоРабот,
		            |	СведенияОСтаже.ДатаОкончанияРабот КАК ОкончаниеРабот,
		            |	ВЫРАЗИТЬ( СведенияОСтаже.ВидДеятельности.Код КАК СТРОКА ) КАК ВидДейтельности,
		            |	ВЫБОР
		            |		КОГДА СведенияОСтаже.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
		            |			ТОГДА СведенияОСтаже.Договор.Дата
		            |		ИНАЧЕ СведенияОСтаже.Договор.ДатаПУ
		            |	КОНЕЦ КАК ДатаДокумента,
		            |	ВЫБОР
		            |		КОГДА СведенияОСтаже.Договор.НомерДляПу = """"
		            |			ТОГДА СведенияОСтаже.Договор.Номер
		            |		ИНАЧЕ СведенияОСтаже.Договор.НомерДляПу
		            |	КОНЕЦ КАК НомерДокумента,
		            |	ВЫБОР
		            |		КОГДА СведенияОСтаже.Договор.ДатаПУ = ДАТАВРЕМЯ(1, 1, 1)
		            |			ТОГДА СведенияОСтаже.Договор.ДатаНачала
		            |		ИНАЧЕ СведенияОСтаже.Договор.ДатаПУ
		            |	КОНЕЦ КАК ДатаДляПУ,
		            |	СведенияОСтаже.ВидДоговора
		            |ИЗ
		            |	Документ.СведенияОЗаработкеРаботниковДПУ.СведенияОСтаже КАК СведенияОСтаже
		            |ГДЕ
		            |	СведенияОСтаже.Ссылка = &ДокументСсылка
					//+ СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
					//не расскомментировать, иначе будут нули в начислениях !!!
					//|	И СведенияОСтаже.ВидДеятельности.Код <> ""ВЗНОСЫВРЕМ""
					//- СВЭЙ КДЯ 19.09.19 СВФР-004631 ( пункт 32. )
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ФизЛицо.Наименование,
		            |	НачалоРабот,
		            |	ВЫРАЗИТЬ( СведенияОСтаже.ВидДеятельности.Код КАК СТРОКА(100) )";
		ТаблицаСтажа = Запрос.Выполнить().Выгрузить();
		Для каждого Стр Из ТаблицаСтажа Цикл
		
			Стр.ВидДейтельности = СокрЛП( Стр.ВидДейтельности );	
			Стр.НомерДокумента = СокрЛП( Стр.НомерДокумента );	
		
		КонецЦикла; 
		// - СВЭЙ КДЯ 12.09.19 СВФР-004631 ( пункт 23. )
		
		Возврат ТаблицаСтажа;
	КонецФункции
	
	
	
	//Процедура вывода файла сведений на печать
	Процедура ПечатьФайла(РежимПечати = 0, МестоВызова = "") Экспорт
		
		ЕстьОшибки = Ложь;
		ТекстФайла = РегламентированнаяОтчетность.ПолучитьТекстФайла(ЭтотОбъект,ЕстьОшибки);
		Если ЕстьОшибки тогда
			Возврат;
		КонецЕсли;	 
		
		Макет = ПолучитьМакет("ФормаАДВ_1");
		ДокументРезультат = Новый ТабличныйДокумент;
		ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_ФормаАДВ_1";
		
		//Получаем таблицу формата записи
		ДокументФорматЗаписей = ПолучитьМакет("ФорматЗаписей");
		ТаблицаФорматаЗаписи = ПроцедурыПерсонифицированогоУчета.ПолучитьФорматЗаписи("АНКТ",ДокументФорматЗаписей);
		
		//Получаем инициализированную структуру, соответствующую формату записи 
		//ПустаяЗапись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		
		//Обработка заголовка файла
		ИнформацияОПачке = Новый Структура;
		Если ПроцедурыПерсонифицированогоУчета.РазобратьЗаголовокФайла(ТекстФайла,ИнформацияОПачке)=0 тогда
			Возврат;
		КонецЕсли;	
		
		//Обработка документов файла
		ОбластьАнкета = Макет.ПолучитьОбласть("Анкета");
		
		Для Н=5 по СтрЧислоСтрок(ТекстФайла) цикл
			//Прочитаем запись из файла
			СтрокаФайла = СтрПолучитьСтроку(ТекстФайла,Н);
			Запись = ПроцедурыПерсонифицированогоУчета.ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
			СтрОшибка = "";
			Если НЕ ПроцедурыПерсонифицированогоУчета.РазложитьСтрокуВСтруктуруЗаписи(СтрокаФайла,"АНКТ",ТаблицаФорматаЗаписи,Запись,СтрОшибка) тогда
				Сообщить("Ошибка в строке файла № "+Н+": "+СтрОшибка);
				Возврат;
			КонецЕсли;	
			
			ОбластьАнкета.Параметры.ДатаЗаполнения					= 	"Дата заполнения "+ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДатаЗаполнения);
			ОбластьАнкета.Параметры.Фамилия 						= Запись.Фамилия; 
			ОбластьАнкета.Параметры.Имя 							= Запись.Имя; 
			ОбластьАнкета.Параметры.Отчество 						= Запись.Отчество; 
			ОбластьАнкета.Параметры.Пол 							= Запись.Пол+"     (м/ж)"; 
			ОбластьАнкета.Параметры.ДатаРождения 					= ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.СтандартнаяДатаРождения); 
			
			//Место рождения
			ОбластьАнкета.Параметры.МестоРожденияТип 				= 	?(Запись.ТипМестаРождения = "ОСОБОЕ", "особое", "");
			ОбластьАнкета.Параметры.МестоРожденияГород 				= 	Запись.МестоРожденияНаселенныйПункт;
			ОбластьАнкета.Параметры.МестоРожденияРайон 				= 	Запись.МестоРожденияРайон;
			ОбластьАнкета.Параметры.МестоРожденияОбласть			= 	Запись.МестоРожденияОбласть;
			ОбластьАнкета.Параметры.МестоРожденияСтрана			 	= 	Запись.МестоРожденияСтрана;
			
			ОбластьАнкета.Параметры.Гражданство 					= 	Запись.Гражданство;
			
			//Паспортные данные
			НаименованиеДокумента 									= 	Запись.ДокументНаименование;
			Серия1 													= 	Запись.ДокументСерияРимскиеЦифры;
			Серия2 													= 	Запись.ДокументСерияРусскиеБуквы;
			
			СерияНомер = Серия1 +?( СокрЛП(НаименованиеДокумента) 	= ВРЕГ("паспорт РБ"), " ", ?( СокрЛП(НаименованиеДокумента) = ВРЕГ("паспорт"), "-", "") ) + Серия2 +",  " + Формат(Запись.ДокументНомер,"ЧГ=0");
			
			ОбластьАнкета.Параметры.НаименованиеДокумента		= 	НаименованиеДокумента;
			ОбластьАнкета.Параметры.СерияНомер			 		= 	СерияНомер;
			ОбластьАнкета.Параметры.ДатаВыдачи 					= 	ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДокументДатаВыдачи);
			ОбластьАнкета.Параметры.КемВыдан 					= 	Запись.ДокументКемВыдан;
			
			//Адреса
			ОбластьАнкета.Параметры.АдресРегистрации 			=	ПроцедурыПерсонифицированогоУчета.ПредставлениеАдресадляПФР(Запись.АдресРегистрации,0,"");
			ОбластьАнкета.Параметры.АдресФактический 			= 	ПроцедурыПерсонифицированогоУчета.ПредставлениеАдресадляПФР(Запись.АдресФактический,0,"");
			ОбластьАнкета.Параметры.Телефоны 					= 	Запись.Телефоны;
			
			ДокументРезультат.Вывести(ОбластьАнкета);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		РаботаСДиалогами.НапечататьДокумент(ДокументРезультат,1,Ложь,"Анкета застрахованного лица АДВ-1");
		
		//Печать описи документов
		ДокументОписи = Новый ТабличныйДокумент;
		ДокументОписи.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_АДВ_6";
		ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,Дата,Ответственный.ФизЛицо);
		ПроцедурыПерсонифицированогоУчета.ВывестиОписьАДВ6(ДокументОписи,ИнформацияОПачке,ОтветственныеЛица);
		РаботаСДиалогами.НапечататьДокумент(ДокументОписи,1,Ложь,"Опись документов АДВ-6");
	КонецПроцедуры
	
#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Номер, 
	|	Организация,
	|	ДатаНачала КАК ПериодРегистрации, //ДатаРегистрации
	|	Ответственный,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Выбирает данные, необходимые для заполнения утвержденных форм как из спр-ка
//  физлиц, так и из соотв. регистров сведений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Результат запроса к данным работников документа.
//
Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности" , Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	
	Запрос.Текст = "
	//Островская Татьяна 25.10.2012 № 15958
	//+ СВЭЙ КДЯ СВФР-004561 06.08.19
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ( НомерСтроки ) КАК НомерСтроки,
	|	ФизЛицо,
	|	ФизЛицоНаименование,
	|	ЛичныйНомер,
	|	ДокументСерия,
	|	ДокументНомер,
	|	ДокументДатаВыдачи,
	|	ДокументКемВыдан,
	|	АдресРегистрации,
	|	ИндексРегистрации,
	|	Телефоны,
	|	Фамилия,
	|	Имя,
	|	Отчество,
	|	Пол,
	|	ДатаПриема,
	|	ДатаУвольнения,
	|	ДатаРождения,
	|	ГородРождения,
	|	Страна,
	|	РайонРождения,
	|	СтранаРождения,
	|	ОбластьРождения,
	|	Категория,
	|	ВидДоговора
	|ИЗ
	|(
	//- СВЭЙ КДЯ СВФР-004561 06.08.19
	|ВЫБРАТЬ 
	|	АнкетаЗастрахованногоЛицаРаботники.НомерСтроки КАК НомерСтроки,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо КАК ФизЛицо,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер
	|	КОНЕЦ КАК ЛичныйНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия
	|	КОНЕЦ КАК ДокументСерия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер
	|	КОНЕЦ КАК ДокументНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи
	|	КОНЕЦ КАК ДокументДатаВыдачи,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан
	|	КОНЕЦ КАК ДокументКемВыдан,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации
	|	КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации
	|	КОНЕЦ КАК ИндексРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Телефоны ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Телефоны
	|	КОНЕЦ КАК Телефоны,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Фамилия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Фамилия
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Имя ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Имя
	|	КОНЕЦ КАК Имя,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Отчество ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Отчество
	|	КОНЕЦ КАК Отчество,
	|	АнкетаЗастрахованногоЛицаРаботники.Пол,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаПриема ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаПриема
	|	КОНЕЦ КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаУвольнения
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДатаРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДатаРождения
	|	КОНЕЦ КАК ДатаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ГородРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ГородРождения
	|	КОНЕЦ КАК ГородРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.Гражданство.Наименование КАК Страна,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.РайонРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.РайонРождения
	|	КОНЕЦ КАК РайонРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.СтранаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения
	|	КОНЕЦ КАК ОбластьРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Категория.КодПФР ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Категория.КодПФР
	|	КОНЕЦ КАК Категория,
	//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	//|	АнкетаЗастрахованногоЛицаРаботники.ВидДоговора
	//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	//+ СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	|	ВЫБОР КОГДА АнкетаЗастрахованногоЛицаРаботники.ВидДоговора = ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.Подряда ) 
	|			ТОГДА АнкетаЗастрахованногоЛицаРаботники.ВидДоговора
	|         	ИНАЧЕ ЗНАЧЕНИЕ( Перечисление.ВидыДоговоровСФизЛицами.ПустаяСсылка )
	|   КОНЕЦ КАК ВидДоговора
	//- СВЭЙ КДЯ 29.10.19 СВФР-004631 ( Пункт 50. )
	|ИЗ
	|	Документ.СведенияОЗаработкеРаботниковДПУ.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботники
	|ГДЕ
	|	АнкетаЗастрахованногоЛицаРаботники.Ссылка = &ДокументСсылка
	|
	//+ СВЭЙ КДЯ СВФР-004561 06.08.19
	|) КАК Анкеты
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизЛицо,
	|	ФизЛицоНаименование,
	|	ЛичныйНомер,
	|	ДокументСерия,
	|	ДокументНомер,
	|	ДокументДатаВыдачи,
	|	ДокументКемВыдан,
	|	АдресРегистрации,
	|	ИндексРегистрации,
	|	Телефоны,
	|	Фамилия,
	|	Имя,
	|	Отчество,
	|	Пол,
	|	ДатаПриема,
	|	ДатаУвольнения,
	|	ДатаРождения,
	|	ГородРождения,
	|	Страна,
	|	РайонРождения,
	|	СтранаРождения,
	|	ОбластьРождения,
	|	Категория,
	|	ВидДоговора
	//- СВЭЙ КДЯ СВФР-004561 06.08.19
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	//Островская Татьяна 25.10.2012 № 15958
	Возврат Запрос.Выполнить();
	
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, которая подает сведения!", Отказ, Заголовок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ответственное лицо!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по работникам, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Фамилия, Имя, Отказ ,Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке № """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";
	// ФизЛицо
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не выбран работник!", Отказ ,Заголовок);
	Иначе	
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + ВыборкаПоСтрокамДокумента.ФизЛицо + " ";
		
		Если ЗначениеЗаполнено(СтрЗаменить(ВыборкаПоСтрокамДокумента.СтраховойНомерПФР,"-","")) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Уже имеет страховой номер!", Отказ ,Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Фамилия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана фамилия!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Имя) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задано имя!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Пол) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан пол!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаРождения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата рождения!", Отказ ,Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаРождения > Дата тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не может быть больше даты подачи сведений!", Отказ ,Заголовок);
			КонецЕсли;	 
		КонецЕсли;	
		
		Если СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "" 
			или СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "0" Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указано место рождения!", Отказ ,Заголовок);
		КонецЕсли; 
		
		//Паспортные данные
		Если ВыборкаПоСтрокамДокумента.ДокументВид = NULL Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указаны паспортные данные!", Отказ ,Заголовок);
			
		Иначе
			
			//Проверка реквизитов паспортных данных
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументВид) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан вид документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
			Иначе
				Если (ВыборкаПоСтрокамДокумента.ДатаРождения > ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не должна превышать дату выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
				КонецЕсли;
			КонецЕсли;	
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументСерия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана серия документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан номер документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
		КонецЕсли; 
		
		// Проверка адреса регистрации и проживания
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.АдресРегистрации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан адрес регистрации (юридический адрес)!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(УправлениеКонтактнойИнформацией.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресРегистрации)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В адресе регистрации присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(УправлениеКонтактнойИнформацией.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресФактический)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В фактическом адресе проживания присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//При проведении файл формируем заново 
	ТекстФайла = "";
	#Если Клиент Тогда
		
		ТекстФайла = СформироватьВыходнойФайл1(Отказ);//О.Т.(К) 24.03.2015
	#КонецЕсли
	
	Если Отказ тогда
		Возврат;
	КонецЕсли;	 
	
	//Сохраним сформированный файл сведений в регистре сведений
	Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
	Запись.Объект = Ссылка;
	Запись.ОписаниеДанных = "Файл-пачка форм ПУ-3";
	Запись.Данные = ТекстФайла; 
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"ФизЛицо");
	
КонецПроцедуры

Функция ПолучитьТаблицуПособий(ЗапросПособие,ФизЛицо = Неопределено,Месяц = Неопределено)//О.Т. Аверсон 25.04.2019 № 4274

	ЗапросПособие.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если Месяц = Неопределено Тогда
		ДатаНач = ДатаНачала;
		ДатаКон = ДатаОкончания;
	иначе
		ДатаНач = Месяц;
		ДатаКон = Месяц; 
	КонецЕсли;
	
	Пока ДатаНач <= ДатаКон Цикл 
		
		
		СписокВидРасчета = Новый СписокЗначений;
		СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
		СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
		СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
		СписокВидРасчета.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
		ЗапросПособие.УстановитьПараметр("ВидРасчета" , СписокВидРасчета);
		ЗапросПособие.УстановитьПараметр("ПериодВзаиморасчетов",ДатаНач); 		
		ЗапросПособие.УстановитьПараметр("ДатаПодачиСведений",ДатаОкончания);
		ЗапросПособие.УстановитьПараметр("ФизЛицо",ФизЛицо);
		ЗапросПособие.УстановитьПараметр("ВидРасчета" , СписокВидРасчета);
		ЗапросПособие.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
		//ЗапросПособие.УстановитьПараметр("Результат" , ВыборкаПоДоговорам.Пособия);
		ЗапросПособие.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
		
		//О.Т. Аверсон 28.02.2019 № 3224
		СпособыПособия = Новый СписокЗначений;
		СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
			СпособыПособия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		//О.Т. Аверсон 28.02.2019 № 3224
		
		ЗапросПособие.УстановитьПараметр("СпособРасчета" , СпособыПособия);//О.Т. Аверсон 22.08.2018 № 2335
		СтрокаМес = Строка(Месяц(ДатаНач));
		Если ВыгрузкаДоговоровПодрядаБезОграничения и ДогПодряда Тогда 
			ЗапросПособие.Текст = 
			"ВЫБРАТЬ
			|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(ВЫБОР
			|						КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|							ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|						ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало
			|					КОНЕЦ, 1) <> 1
			|				ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК Пособия,
			|	ВЫБОР
			|		КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало
			|	КОНЕЦ КАК ПериодДействияНачало,
			|	ВЫБОР
			|		КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|	КОНЕЦ КАК ПериодДействияКонец,
			|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	ДополнительныеНачисленияРаботниковОрганизаций.НомерДоговора,
			|	ДополнительныеНачисленияРаботниковОрганизаций.ДатаДоговора
			| ПОМЕСТИТь ВТДанныеОПособии"+СтрокаМес+"
			
			|ИЗ
			|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодВзаиморасчетов, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследнихПрием
			|	ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = РаботникиОрганизацийСрезПоследнихПрием.Сотрудник.Физлицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодВзаиморасчетов, Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК РаботникиОрганизацийСрезПоследнихУвольн
			|	ПО ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = РаботникиОрганизацийСрезПоследнихУвольн.Сотрудник.Физлицо
			
			
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если не ОтборПоПериодуВзаиморасчетов Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации <= &ДатаПодачиСведений";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "
			|	
			|	И ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета В (&СпособРасчета)";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "
			|
			|СГРУППИРОВАТЬ ПО
			|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|	ВЫБОР
			|		КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|	КОНЕЦ,
			|	НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ),
			|	ДополнительныеНачисленияРаботниковОрганизаций.НомерДоговора,
			|	ДополнительныеНачисленияРаботниковОрганизаций.ДатаДоговора
			
			|";
			//|УПОРЯДОЧИТЬ ПО
			//|	ПериодДействияНачало";
			
		иначе
			
			ЗапросПособие.Текст =  
			"	ВЫБРАТЬ ";
			Если не ОтборПоПериодуВзаиморасчетов Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + "ЕСНСведенияОДоходах.Период,";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "
			|		ЕСНСведенияОДоходах.Организация КАК Организация,
			|		ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|		СУММА(ЕСНСведенияОДоходах.Результат) КАК Результат,
			|		ЕСНСведенияОДоходах.КодДоходаЕСН КАК КодДоходаЕСН,
			|		ЕСНСведенияОДоходах.ВидРасчета КАК ВидРасчета,
			|		ЕСНСведенияОДоходах.ДоходФСЗН КАК ДоходФСЗН
			|	ПОМЕСТИТЬ Пакет"+СтрокаМес+"
			|	ИЗ
			|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			|	ГДЕ
			|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "
			|	
			|	СГРУППИРОВАТЬ ПО ";
			Если не ОтборПоПериодуВзаиморасчетов Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + "ЕСНСведенияОДоходах.Период,";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "
			
			|		ЕСНСведенияОДоходах.КодДоходаЕСН,
			|		ЕСНСведенияОДоходах.ВидРасчета,
			|		ЕСНСведенияОДоходах.ДоходФСЗН,
			|		ЕСНСведенияОДоходах.Организация,
			|		ЕСНСведенияОДоходах.ФизЛицо,
			|		ЕСНСведенияОДоходах.ПериодВзаиморасчетов
			|;
			
			////////////////////////////////////////////////////////////////////////////////
			|		ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|			СУММА(ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
			|				КОНЕЦ + ЕСТЬNULL(ВложенныйЗапрос.Результат, 0)) КАК Результат,
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ВложенныйЗапрос.ПериодДействияКонец, 1) = 1
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|				ИНАЧЕ ВложенныйЗапрос.ПериодДействияКонец
			|			КОНЕЦ КАК ПериодДействияКонец,
			|			ВложенныйЗапрос.ПериодДействияНачало КАК ПериодДействияНачало1,
			|			ВложенныйЗапрос.ПериодДействияКонец КАК ПериодДействияКонец1,
			|			ВложенныйЗапрос.Результат КАК Результат1
			|		ПОМЕСТИТЬ ВТОсновные"+СтрокаМес+"
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
			|					ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|					СУММА(ВЫБОР
			|							КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|									И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|								ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|							ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
			|						КОНЕЦ) КАК Результат,
			|					ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ПериодДействияКонец,
			|					ОсновныеНачисленияРаботниковОрганизаций.Регистратор.ПервичныйБольничныйЛист КАК РегистраторПервичныйБольничныйЛист
			|				ИЗ
			|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|				ГДЕ
			|					НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &ПериодВзаиморасчетов
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|					ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|					ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец,
			|					ОсновныеНачисленияРаботниковОрганизаций.Регистратор.ПервичныйБольничныйЛист) КАК ВложенныйЗапрос
			|				ПО ОсновныеНачисленияРаботниковОрганизаций.Регистратор = ВложенныйЗапрос.РегистраторПервичныйБольничныйЛист
			|					И (ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец, ДЕНЬ), ДЕНЬ, 1) = ВложенныйЗапрос.ПериодДействияНачало)
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &ПериодВзаиморасчетов
			|			И ВложенныйЗапрос.Результат > 0";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "


			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ВложенныйЗапрос.ПериодДействияНачало,
			|			ВложенныйЗапрос.ПериодДействияКонец,
			|			ВложенныйЗапрос.Результат,
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ВложенныйЗапрос.ПериодДействияКонец, 1) = 1
			|					ТОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|				ИНАЧЕ ВложенныйЗапрос.ПериодДействияКонец
			|			КОНЕЦ
			|		;

			|		////////////////////////////////////////////////////////////////////////////////
			|		ВЫБРАТЬ
			|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|			СУММА(ВЫБОР
			|					КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ОсновныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ОсновныеНачисленияРаботниковОрганизаций.Результат
			|				КОНЕЦ) КАК Результат,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ПериодДействияКонец
			|		ПОМЕСТИТЬ ВТОсновнойБезГруппировки"+СтрокаМес+"
			|		ИЗ
			|			РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "


			|		СГРУППИРОВАТЬ ПО
			|			ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
			|			ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|			ОсновныеНачисленияРаботниковОрганизаций.Организация,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало,
			|			ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец
			|		;

			|		////////////////////////////////////////////////////////////////////////////////
			|		ВЫБРАТЬ
			|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|			СУММА(ВЫБОР
			|					КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
			|				КОНЕЦ + ЕСТЬNULL(ВложенныйЗапрос.Результат, 0)) КАК Результат,
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ВложенныйЗапрос.БазовыйПериодКонец, 1) = 1
			|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|				ИНАЧЕ ВложенныйЗапрос.БазовыйПериодКонец
			|			КОНЕЦ КАК БазовыйПериодКонец,
			|			ВложенныйЗапрос.БазовыйПериодНачало КАК БазовыйПериодНачало1,
			|			ВложенныйЗапрос.БазовыйПериодКонец КАК БазовыйПериодКонец1,
			|			ВложенныйЗапрос.Результат КАК Результат1
			|		ПОМЕСТИТЬ ВТДополнительные"+СтрокаМес+"
			|		ИЗ
			|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|					ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|					СУММА(ВЫБОР
			|							КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|									И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|								ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|							ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
			|						КОНЕЦ) КАК Результат,
			|					ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец КАК БазовыйПериодКонец,
			|					ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПервичныйБольничныйЛист КАК РегистраторПервичныйБольничныйЛист
			|				ИЗ
			|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|				ГДЕ
			|					НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = &ПериодВзаиморасчетов
			|				
			|				СГРУППИРОВАТЬ ПО
			|					ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
			|					ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|					ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец,
			|					ДополнительныеНачисленияРаботниковОрганизаций.Регистратор.ПервичныйБольничныйЛист) КАК ВложенныйЗапрос
			|				ПО ДополнительныеНачисленияРаботниковОрганизаций.Регистратор = ВложенныйЗапрос.РегистраторПервичныйБольничныйЛист
			|					И (ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец, ДЕНЬ), ДЕНЬ, 1) = ВложенныйЗапрос.БазовыйПериодНачало)
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = &ПериодВзаиморасчетов
			|			И ВложенныйЗапрос.Результат > 0";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "


			|		СГРУППИРОВАТЬ ПО
			|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизаций.Организация,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ВложенныйЗапрос.БазовыйПериодНачало,
			|			ВложенныйЗапрос.БазовыйПериодКонец,
			|			ВложенныйЗапрос.Результат,
			|			ВЫБОР
			|				КОГДА ЕСТЬNULL(ВложенныйЗапрос.БазовыйПериодКонец, 1) = 1
			|					ТОГДА ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|				ИНАЧЕ ВложенныйЗапрос.БазовыйПериодКонец
			|			КОНЕЦ
			|		;

			|		////////////////////////////////////////////////////////////////////////////////
			|		ВЫБРАТЬ
			|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо КАК ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизаций.Организация КАК Организация,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало КАК БазовыйПериодНачало,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета КАК ВидРасчета,
			|			СУММА(ВЫБОР
			|					КОГДА ДополнительныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2016, 7, 1)
			|							И ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало >= ДАТАВРЕМЯ(2016, 7, 1)
			|						ТОГДА ВЫРАЗИТЬ(ДополнительныеНачисленияРаботниковОрганизаций.Результат / 10000 КАК ЧИСЛО(15, 2))
			|					ИНАЧЕ ДополнительныеНачисленияРаботниковОрганизаций.Результат
			|				КОНЕЦ) КАК Результат,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец КАК БазовыйПериодКонец
			|		ПОМЕСТИТЬ ВТДополнительныеБезГруппировки"+СтрокаМес+"
			|		ИЗ
			|			РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
			|		ГДЕ
			|			НАЧАЛОПЕРИОДА(ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "

			|		СГРУППИРОВАТЬ ПО
			|			ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
			|			ДополнительныеНачисленияРаботниковОрганизаций.Организация,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодНачало,
			|			ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
			|			ДополнительныеНачисленияРаботниковОрганизаций.БазовыйПериодКонец
			|		;

			|		////////////////////////////////////////////////////////////////////////////////
			|		ВЫБРАТЬ
			|			ЕСНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
			|			ЕСНСведенияОДоходах.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|			ЕСНСведенияОДоходах.ВидРасчета КАК ВидРасчета
			|		ПОМЕСТИТЬ ВТДоходыОклад"+СтрокаМес+"
			|		ИЗ
			|			РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
			|		ГДЕ
			|			ЕСНСведенияОДоходах.ВидРасчета В(&ВидРасчета)
			|			И НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если ЗначениеЗаполнено(ФизЛицо) Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И ЕСНСведенияОДоходах.ФизЛицо = &ФизЛицо";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "

			|		;
			
			|	ВЫБРАТЬ
			
			|	СУММА(ВЫБОР
			|		КОГДА Пакет1.КодДоходаЕСН = &ДоходБольничныйФСЗН
			|				ИЛИ Пакет1.ВидРасчета.СпособРасчета В (&СпособРасчета)
			|					И ЕСТЬNULL(ВЫБОР
			|							КОГДА ВТОсновные.ПериодДействияНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|								ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|							ИНАЧЕ ЕСТЬNULL(ВТОсновные.ПериодДействияНачало, ВТОсновнойБезГруппировки.ПериодДействияНачало)
			|						КОНЕЦ, 1) <> 1
			|			ТОГДА Пакет1.Результат
			|		ИНАЧЕ 0
			|	КОНЕЦ) КАК Пособия,
			|	ВЫБОР
			|		КОГДА ВТОсновные.ПериодДействияНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ВТОсновные.ПериодДействияНачало, ВТОсновнойБезГруппировки.ПериодДействияНачало), Пакет1.ПериодВзаиморасчетов)
			|	КОНЕЦ КАК ПериодДействияНачало,
			|	Пакет1.ПериодВзаиморасчетов,
			|	СУММА(ВЫБОР
			|			КОГДА Пакет1.ДоходФСЗН = &ДоходФСЗН
			|				ТОГДА Пакет1.Результат
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК Выплаты,
			|	ВЫБОР
			|		КОГДА ВТОсновные.ПериодДействияКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|				ИЛИ ВТДополнительные.БазовыйПериодКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|			ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ВТОсновные.ПериодДействияКонец, ВТОсновнойБезГруппировки.ПериодДействияКонец), ЕСТЬNULL(ВТДополнительные.БазовыйПериодКонец, ВТДополнительныеБезГруппировки.БазовыйПериодКонец)), КОНЕЦПЕРИОДА(Пакет1.ПериодВзаиморасчетов, МЕСЯЦ))
			|	КОНЕЦ КАК ПериодДействияКонец,
			|	ВТОсновнойБезГруппировки.ПериодДействияНачало КАК ПериодДействияНачало1,
			|	Пакет1.ФизЛицо
			| ПОМЕСТИТь ВТДанныеОПособии"+СтрокаМес+"
			|		ИЗ
			|Пакет"+СтрокаМес+" КАК Пакет1
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыОклад"+СтрокаМес+" КАК ВТДоходыОклад
			|	ПО Пакет1.ФизЛицо = ВТДоходыОклад.ФизЛицо
			|		И (НАЧАЛОПЕРИОДА(Пакет1.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВТДоходыОклад.ПериодВзаиморасчетов, МЕСЯЦ))
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодВзаиморасчетов, Регистратор ССЫЛКА Документ.ПриемНаРаботуВОрганизацию) КАК РаботникиОрганизацийСрезПоследнихПрием
			|	ПО Пакет1.ФизЛицо = РаботникиОрганизацийСрезПоследнихПрием.Сотрудник.Физлицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ПериодВзаиморасчетов, Регистратор ССЫЛКА Документ.УвольнениеИзОрганизаций) КАК РаботникиОрганизацийСрезПоследнихУвольн
			|	ПО Пакет1.ФизЛицо = РаботникиОрганизацийСрезПоследнихУвольн.Сотрудник.Физлицо
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновные"+СтрокаМес+" КАК ВТОсновные
			|	ПО Пакет1.ФизЛицо = ВТОсновные.ФизЛицо
			|		И Пакет1.ВидРасчета = ВТОсновные.ВидРасчета
			|		И Пакет1.Организация = ВТОсновные.Организация
			|		И Пакет1.Результат = ВТОсновные.Результат
			|		И Пакет1.ПериодВзаиморасчетов = ВТОсновные.ПериодДействияНачало
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновнойБезГруппировки"+СтрокаМес+" КАК ВТОсновнойБезГруппировки
			|	ПО Пакет1.ФизЛицо = ВТОсновнойБезГруппировки.ФизЛицо
			|		И Пакет1.ВидРасчета = ВТОсновнойБезГруппировки.ВидРасчета
			|		И Пакет1.Организация = ВТОсновнойБезГруппировки.Организация
			|		И Пакет1.Результат = ВТОсновнойБезГруппировки.Результат
			|		И Пакет1.ПериодВзаиморасчетов = ВТОсновнойБезГруппировки.ПериодДействияНачало
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительные"+СтрокаМес+" КАК ВТДополнительные
			|	ПО Пакет1.ФизЛицо = ВТДополнительные.ФизЛицо
			|		И Пакет1.ВидРасчета = ВТДополнительные.ВидРасчета
			|		И Пакет1.Организация = ВТДополнительные.Организация
			|		И Пакет1.Результат = ВТДополнительные.Результат
			|		И Пакет1.ПериодВзаиморасчетов = ВТДополнительные.БазовыйПериодНачало
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеБезГруппировки"+СтрокаМес+" КАК ВТДополнительныеБезГруппировки
			|	ПО Пакет1.ФизЛицо = ВТДополнительныеБезГруппировки.ФизЛицо
			|		И Пакет1.ВидРасчета = ВТДополнительныеБезГруппировки.ВидРасчета
			|		И Пакет1.Организация = ВТДополнительныеБезГруппировки.Организация
			|		И Пакет1.Результат = ВТДополнительныеБезГруппировки.Результат
			|		И Пакет1.ПериодВзаиморасчетов = ВТДополнительныеБезГруппировки.БазовыйПериодНачало

			|		
			|	ГДЕ
			|		НАЧАЛОПЕРИОДА(Пакет1.ПериодВзаиморасчетов, МЕСЯЦ) = &ПериодВзаиморасчетов";
			Если не ОтборПоПериодуВзаиморасчетов Тогда 
				ЗапросПособие.Текст = ЗапросПособие.Текст + " И Пакет1.Период <= &ДатаПодачиСведений";
			КонецЕсли;
			ЗапросПособие.Текст = ЗапросПособие.Текст + "    
			
			|СГРУППИРОВАТЬ ПО
			|ВТОсновнойБезГруппировки.ПериодДействияНачало,
			|ВЫБОР
			|	КОГДА ВТОсновные.ПериодДействияНачало < РаботникиОрганизацийСрезПоследнихПрием.Период
			|		ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|	ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ВТОсновные.ПериодДействияНачало, ВТОсновнойБезГруппировки.ПериодДействияНачало), Пакет1.ПериодВзаиморасчетов)
			|КОНЕЦ,
			|Пакет1.ПериодВзаиморасчетов,
			|ВЫБОР
			|	КОГДА ВТОсновные.ПериодДействияКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|			ИЛИ ВТДополнительные.БазовыйПериодКонец > РаботникиОрганизацийСрезПоследнихУвольн.Период
			|		ТОГДА РаботникиОрганизацийСрезПоследнихПрием.Период
			|	ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ВТОсновные.ПериодДействияКонец, ВТОсновнойБезГруппировки.ПериодДействияКонец), ЕСТЬNULL(ВТДополнительные.БазовыйПериодКонец, ВТДополнительныеБезГруппировки.БазовыйПериодКонец)), КОНЕЦПЕРИОДА(Пакет1.ПериодВзаиморасчетов, МЕСЯЦ))
			|КОНЕЦ,
			|Пакет1.ФизЛицо
			|";
			//|УПОРЯДОЧИТЬ ПО
			//|	ПериодДействияНачало";
		КонецЕсли;
		
		ДатаНач = ДобавитьМесяц(ДатаНач,1);
		ЗапросПособие.Выполнить();
	КонецЦикла;
	
	Возврат ЗапросПособие;
КонецФункции




//толик

#Если Клиент Тогда
	
	Процедура ПечатьОтклонений() Экспорт
		
		мДлинаСуток = 86400;
		
		ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
		Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
			Отказ = Истина;
			Возврат ;
		КонецЕсли;	
		
		Макет = ПолучитьМакет("Макет");
		ОбластьШГруппа = Макет.ПолучитьОбласть("Шапка");
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		ДеталиОтклонения = Макет.ПолучитьОбласть("ДеталиОтклонения");
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
		Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("ДоходБольничныйФСЗН", Справочники.ДоходыЕСН.БольничныйИзФСЗН);
		Запрос.УстановитьПараметр("ДоходФСЗН", Перечисления.ДоходыФСС_НС.Облагается);
		Запрос.УстановитьПараметр("НачалоНП", НачалоГода(НачалоКвартала(ДатаНачала))); //О.Т. Аверсон 15.03.2018 № 1693 убрано ДобавитьМесяц,-1
		Запрос.УстановитьПараметр("КонецНП", КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));// последний месяц налогового периода, за который подаём сведения
		Запрос.УстановитьПараметр("ПериодВзаиморасчетов" , ДатаОкончания); //О.Т. Аверсон 23.03.2018 № 1751
		Запрос.УстановитьПараметр("ФлагПериодВзаиморасчетов" , ОтборПоПериодуВзаиморасчетов); //О.Т. Аверсон 19.04.2019 № 4121
		//О.Т. Аверсон 28.02.2019 № 3224
		СпособыПособия = Новый СписокЗначений;
		СпособыПособия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ДопПособияДляПУ3.Основные Цикл 
			СпособыПособия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		//О.Т. Аверсон 28.02.2019 № 3224
		
		Запрос.УстановитьПараметр("СпособРасчета" , СпособыПособия);
		//О.Т. Аверсон 28.02.2019 № 3224
		ВидыРасчетаПремия = Новый СписокЗначений;
		ВидыРасчетаПремия.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС);
		для Каждого стрПособ из Справочники.ГруппыРасчетов.ПремияДляПУ.Основные Цикл 
			ВидыРасчетаПремия.Добавить(стрПособ.ВидРасчета);
		КонецЦикла;  
		//О.Т. Аверсон 28.02.2019 № 3224
		
		Запрос.УстановитьПараметр("ВидРасчетаПремия" , ВидыРасчетаПремия);

		
		
		
		// Выборка списка физлиц, для которых надо получать доходы
		СписокФизлицТекст = "ВЫБРАТЬ 
		|	ТЧРаботникиОрганизации.ФизЛицо
		|ИЗ
		|	Документ.СведенияОЗаработкеРаботниковДПУ.РаботникиОрганизации КАК ТЧРаботникиОрганизации
		|
		|ГДЕ
		|	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка";
		//Персонификация	
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНаименование
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")		
		|		И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|		И ЕСНИсчисленный.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов //О.Т. Аверсон 23.03.2018 № 1751
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|	ВЫБОР
		|		КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121 
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		|	КОНЕЦ КАК ПериодВзаиморасчетов,
		|		34,
		|		NULL,
		|		NULL
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ВЫБОР
		|			КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121
		|			ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		|			ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|		КОНЕЦ
		|		И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов //О.Т. Аверсон 23.03.2018 № 1751
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|	ВЫБОР
		|		КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		|	КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ФизЛицоНаименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ,
		|	ФизЛицо,
		|	Период";
		
		//Если ОтборПоПериодуВзаиморасчетов Тогда 
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов","");
		//иначе                      
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов","И ЕСНСведенияОДоходах.Период <= &ПериодВзаиморасчетов");
		//КонецЕсли;
		
		Запрос.Текст = ДоходыПоВидамЗаГод;
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДок.Вывести(ОбластьШГруппа);
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		Пока Результат.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Результат);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "1. Данные по ДПУ по форме ПУ-3 ""Индивидуальные сведения""";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(Результат.ФСЗН=Null, 0, Результат.ФСЗН) + ?(Результат.ПенсионныйФонд=Null, 0 , Результат.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Результат.Уровень(), , Ложь);
			ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); //О.Т. Аверсон 07.02.2016 № 862 Смена группировок
			Пока ВыборкаПериод.Следующий() Цикл
				ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.Надпись = Символы.Таб+Строка(ВыборкаПериод.ФизЛицо);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаПериод.Уровень(), , Ложь);
				
				ВыборкаФизЛицо = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); //О.Т. Аверсон 07.02.2016 № 862 смена группировок
				Пока ВыборкаФизЛицо.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаФизЛицо);
					ОбластьДетальныхЗаписей.Параметры.Надпись = Символы.Таб+Строка(ВыборкаФизЛицо.Период);
					ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаФизЛицо.ФСЗН=Null, 0, ВыборкаФизЛицо.ФСЗН) + ?(ВыборкаФизЛицо.ПенсионныйФонд=Null, 0 , ВыборкаФизЛицо.ПенсионныйФонд);
					ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаФизЛицо.Уровень(), , Ложь);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		
		//ЗП						
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ЕСНИсчисленный.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|		//И ЕСНИсчисленный.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов //О.Т. Аверсон 23.03.2018 № 1751
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		ЕСНИсчисленный.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		34,
		|		NULL,
		|		NULL,
		|	ВЫБОР
		|		КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121 
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		|	КОНЕЦ КАК ПериодВзаиморасчетов
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ВЫБОР
		|			КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121
		|			ТОГДА ЕСНСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
		|			ИНАЧЕ ЕСНСведенияОДоходах.ПериодВзаиморасчетов МЕЖДУ &НачалоНП И &КонецНП
		|		КОНЕЦ
		|		//И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов //О.Т. Аверсон 23.03.2018 № 1751
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|	ВЫБОР
		|		КОГДА не &ФлагПериодВзаиморасчетов //О.Т. Аверсон 19.04.2019 № 4121
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.Период, МЕСЯЦ) 
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ) 
		|	КОНЕЦ) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодРегистрации, ФизЛицоНаименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ,
		|	ПериодРегистрации,
		|	ФизЛицо";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		
		Если ОтборПоПериодуВзаиморасчетов Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов","И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНИсчисленный.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов ","И ЕСНИсчисленный.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов");
		иначе                      
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНСведенияОДоходах.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов","И ЕСНСведенияОДоходах.Период <= &ПериодВзаиморасчетов");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//И ЕСНИсчисленный.ПериодВзаиморасчетов <= &ПериодВзаиморасчетов ","И ЕСНИсчисленный.Период <= &ПериодВзаиморасчетов");
		КонецЕсли;
		
		РезультатЗП = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		Пока РезультатЗП.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(РезультатЗП);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "2. Данные по периодам регистрации";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(РезультатЗП.ФСЗН=Null, 0, РезультатЗП.ФСЗН) + ?(РезультатЗП.ПенсионныйФонд=Null, 0 , РезультатЗП.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, РезультатЗП.Уровень(), , Ложь);
			ВыборкаПериод = РезультатЗП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериод.Следующий() Цикл
				ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.Надпись = Символы.Таб+Строка(ВыборкаПериод.ПериодРегистрации);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаПериод.Уровень(), , Ложь);
				ВыборкаФизЛицо = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаФизЛицо.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаФизЛицо);
					ОбластьДетальныхЗаписей.Параметры.Надпись = Символы.Таб+Строка(ВыборкаФизЛицо.ФизЛицо);
					ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаФизЛицо.ФСЗН=Null, 0, ВыборкаФизЛицо.ФСЗН) + ?(ВыборкаФизЛицо.ПенсионныйФонд=Null, 0 , ВыборкаФизЛицо.ПенсионныйФонд);
					ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаФизЛицо.Уровень(), , Ложь);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		//разница	
		Результат.Сбросить();
		Результат.Следующий();
		РезультатЗП.Сбросить();
		РезультатЗП.Следующий();
		ОбластьДетальныхЗаписей.Параметры.Надпись = "3. Сумма расхождений в рублях (+/-) (стр.1 - стр.2)";
		ОбластьДетальныхЗаписей.Параметры.СуммаДохода = Результат.СуммаДохода - РезультатЗП.СуммаДохода;
		ОбластьДетальныхЗаписей.Параметры.Больничные = Результат.Больничные - РезультатЗП.Больничные;
		ОбластьДетальныхЗаписей.Параметры.ФСЗН = (Результат.ФСЗН + Результат.ПенсионныйФонд) - (РезультатЗП.ФСЗН + РезультатЗП.ПенсионныйФонд);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
		ОбластьДетальныхЗаписей.Параметры.Надпись = "4. Причины расхождений (с указанием суммы)";
		ОбластьДетальныхЗаписей.Параметры.СуммаДохода = 0;
		ОбластьДетальныхЗаписей.Параметры.Больничные = 0;
		ОбластьДетальныхЗаписей.Параметры.ФСЗН = 0;
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		ОбластьДетальныхЗаписей.Параметры.Надпись = "- по выплатам, пособиям и страховым взносам";
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
		
		
		//ЗП отклонения	до отчетного периода
		мГод = Год(КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		Запрос.УстановитьПараметр("Год", мГод);
		
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНИсчисленный.Период) = &Год
		|		И ГОД(ЕСНИсчисленный.ПериодВзаиморасчетов) < &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНИсчисленный.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		34,
		|		NULL,
		|		NULL,
		|		ЕСНСведенияОДоходах.Период
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНСведенияОДоходах.Период) = &Год
		|		И ГОД(ЕСНСведенияОДоходах.ПериодВзаиморасчетов) < &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНСведенияОДоходах.Период) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицоНименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Пока Результат.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Результат);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "Переходящие выплаты прошлых годов выплаченные в "+Строка(мГод)+" г. (-)";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(Результат.ФСЗН=Null, 0, Результат.ФСЗН) + ?(Результат.ПенсионныйФонд=Null, 0 , Результат.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Результат.Уровень(), , Ложь);
			ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериод.Следующий() Цикл
				ДеталиОтклонения.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ДеталиОтклонения, ВыборкаПериод.Уровень(), , Ложь);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		//Персонификация отклонения						
		
		Запрос.УстановитьПараметр("Год", Год(КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
		
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНИсчисленный.Период) < &Год
		|		И ГОД(ЕСНИсчисленный.ПериодВзаиморасчетов) = &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНИсчисленный.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		34,
		|		NULL,
		|		NULL,
		|		ЕСНСведенияОДоходах.Период
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНСведенияОДоходах.Период) < &Год
		|		И ГОД(ЕСНСведенияОДоходах.ПериодВзаиморасчетов) = &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНСведенияОДоходах.Период) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицоНаименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Пока Результат.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Результат);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "Переходящие выплаты по ФСЗН прошлых годов выплаченные в "+Строка(мГод)+" г. (+)";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(Результат.ФСЗН=Null, 0, Результат.ФСЗН) + ?(Результат.ПенсионныйФонд=Null, 0 , Результат.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Результат.Уровень(), , Ложь);
			ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериод.Следующий() Цикл
				ДеталиОтклонения.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ДеталиОтклонения, ВыборкаПериод.Уровень(), , Ложь);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		//ЗП отклонения	после отчетного периода
		мГод = Год(КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		Запрос.УстановитьПараметр("Год", мГод);
		
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНИсчисленный.Период) = &Год
		|		И ГОД(ЕСНИсчисленный.ПериодВзаиморасчетов) > &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНИсчисленный.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		34,
		|		NULL,
		|		NULL,
		|		ЕСНСведенияОДоходах.Период
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНСведенияОДоходах.Период) = &Год
		|		И ГОД(ЕСНСведенияОДоходах.ПериодВзаиморасчетов) > &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНСведенияОДоходах.Период) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицоНаименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Пока Результат.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Результат);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "Переходящие выплаты по ФСЗН "+Строка(мГод)+" г. выплаченные в последующих годах (-)";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(Результат.ФСЗН=Null, 0, Результат.ФСЗН) + ?(Результат.ПенсионныйФонд=Null, 0 , Результат.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Результат.Уровень(), , Ложь);
			ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериод.Следующий() Цикл
				ДеталиОтклонения.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ДеталиОтклонения, ВыборкаПериод.Уровень(), , Ложь);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		//Персонификация отклонения						
		
		Запрос.УстановитьПараметр("Год", Год(КонецГода(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
		
		ДоходыПоВидамЗаГод =
		"ВЫБРАТЬ
		|	СУММА(ОбщаяТаблицаФСЗН.Больничные) КАК Больничные,
		|	СУММА(ОбщаяТаблицаФСЗН.СуммаДохода) КАК СуммаДохода,
		|	ОбщаяТаблицаФСЗН.ФизЛицо КАК ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование КАК ФизЛицоНаименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов КАК Период,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	СУММА(ОбщаяТаблицаФСЗН.ПенсионныйФонд) КАК ПенсионныйФонд,
		|	СУММА(ОбщаяТаблицаФСЗН.ФСЗН) КАК ФСЗН,
		|	ОбщаяТаблицаФСЗН.Период КАК ПериодРегистрации
		|ИЗ
		|	(ВЫБРАТЬ
		|		NULL КАК Больничные,
		|		NULL КАК СуммаДохода,
		|		ЕСНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
		|		34 КАК ПроцентФСЗН,
		|		СУММА(ЕСНИсчисленный.ПенсионныйФонд) КАК ПенсионныйФонд,
		|		СУММА(ЕСНИсчисленный.ФСЗН) КАК ФСЗН,
		|		ЕСНИсчисленный.Период КАК Период
		|	ИЗ
		|		РегистрНакопления.ЕСНИсчисленный КАК ЕСНИсчисленный
		|	ГДЕ
		|		ЕСНИсчисленный.Организация = &Организация
		|		И ЕСНИсчисленный.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНИсчисленный.Период) > &Год
		|		И ГОД(ЕСНИсчисленный.ПериодВзаиморасчетов) = &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНИсчисленный.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНИсчисленный.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНИсчисленный.Период
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.КодДоходаЕСН = &ДоходБольничныйФСЗН или ЕСНСведенияОДоходах.ВидРасчета.СпособРасчета в (&СпособРасчета) //О.Т. Аверсон 28.02.2019 № 3224
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ЕСНСведенияОДоходах.ДоходФСЗН = &ДоходФСЗН
		|					ТОГДА ЕСНСведенияОДоходах.Результат
		|				ИНАЧЕ 0
		|			КОНЕЦ),
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		34,
		|		NULL,
		|		NULL,
		|		ЕСНСведенияОДоходах.Период
		|	ИЗ
		|		РегистрНакопления.ЕСНСведенияОДоходах КАК ЕСНСведенияОДоходах
		|	ГДЕ
		|		ЕСНСведенияОДоходах.Организация = &Организация
		|		И ЕСНСведенияОДоходах.ФизЛицо В(" + СписокФизлицТекст + ")
		|		И ГОД(ЕСНСведенияОДоходах.Период) > &Год
		|		И ГОД(ЕСНСведенияОДоходах.ПериодВзаиморасчетов) = &Год
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЕСНСведенияОДоходах.ФизЛицо,
		|		НАЧАЛОПЕРИОДА(ЕСНСведенияОДоходах.ПериодВзаиморасчетов, МЕСЯЦ),
		|		ЕСНСведенияОДоходах.Период) КАК ОбщаяТаблицаФСЗН
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяТаблицаФСЗН.ФизЛицо,
		|	ОбщаяТаблицаФСЗН.ФизЛицо.Наименование,
		|	ОбщаяТаблицаФСЗН.ПериодВзаиморасчетов,
		|	ОбщаяТаблицаФСЗН.ПроцентФСЗН,
		|	ОбщаяТаблицаФСЗН.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицоНаименование
		|ИТОГИ
		|	СУММА(Больничные),
		|	СУММА(СуммаДохода),
		|	СУММА(ПенсионныйФонд),
		|	СУММА(ФСЗН)
		|ПО
		|	ОБЩИЕ";	
		Запрос.Текст = ДоходыПоВидамЗаГод;
		Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		Пока Результат.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Результат);
			ОбластьДетальныхЗаписей.Параметры.Надпись = "Переходящие выплаты "+Строка(мГод)+" г. выплаченные в последующих годах (+)";
			ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(Результат.ФСЗН=Null, 0, Результат.ФСЗН) + ?(Результат.ПенсионныйФонд=Null, 0 , Результат.ПенсионныйФонд);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Результат.Уровень(), , Ложь);
			ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПериод.Следующий() Цикл
				ДеталиОтклонения.Параметры.Заполнить(ВыборкаПериод);
				ОбластьДетальныхЗаписей.Параметры.ФСЗН = ?(ВыборкаПериод.ФСЗН=Null, 0, ВыборкаПериод.ФСЗН) + ?(ВыборкаПериод.ПенсионныйФонд=Null, 0 , ВыборкаПериод.ПенсионныйФонд);
				ТабДок.Вывести(ДеталиОтклонения, ВыборкаПериод.Уровень(), , Ложь);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		
		РаботаСДиалогами.НапечататьДокумент(ТабДок);
		
	КонецПроцедуры
	
#КонецЕсли

//енд

//+ СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
мДлинаСуток = 24 * 60 * 60; // продолжительность суток в секундах
//- СВЭЙ КДЯ 19.08.19 СВФР-004631 ( пункт 9 )
