////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

// заполнение доходов и расчет документа
//
Функция Автозаполнение(ПоРаботникамОрганизаций = Истина) Экспорт //Аверсон ЕАЕ 15.03.2021 СВФР-007324 параметр
	
	Отказ = Ложь;
	
	ЗапросПоСотрудникам = Новый Запрос;
	
	Если ПоРаботникамОрганизаций Тогда //Аверсон ЕАЕ 15.03.2021 СВФР-007324 условие
		ЗапросПоСотрудникам.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.СотрудникФизлицо КАК Физлицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|		РаботникиОрганизаций.Сотрудник.Физлицо КАК СотрудникФизлицо
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период МЕЖДУ &НачДата И &КонДата
		|		И РаботникиОрганизаций.ВидДеятельностиИзмерение.ИспользуетсяВПУ6
		|		И РаботникиОрганизаций.Организация = &Организация";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
			|	И РаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник,
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
		|	ИЗ
		
		//Аверсон 14.02.2023 КВВ СВФР-010249 (
		//|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачДата, НЕ Временно) КАК РаботникиОрганизацийСрезПоследних
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачДата) КАК РаботникиОрганизацийСрезПоследних
		//Аверсон 14.02.2023 КВВ СВФР-010249 )
		
		|	ГДЕ
		|		РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение.ИспользуетсяВПУ6";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
			|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
		|		И РаботникиОрганизацийСрезПоследних.Организация = &Организация) КАК ВложенныйЗапрос";
		
		//Аверсон ЕАЕ 15.03.2021 СВФР-007324
	Иначе
		ЗапросПоСотрудникам.Текст = 
		
		//Аверсон ЕАЕ 28.07.2021 СВФР-007922
		
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ДополнительныеДанныеДляППС.Сотрудник КАК Сотрудник
		//|ПОМЕСТИТЬ ВТДополнительныеДанныеДляППС
		//|ИЗ РегистрСведений.ДополнительныеДанныеДляППС КАК ДополнительныеДанныеДляППС
		//|ГДЕ ДополнительныеДанныеДляППС.Период МЕЖДУ &НачДата И &КонДата
		//|И 			
		//|ГДЕ РаботникиОрганизаций.ВидДеятельности.ИспользуетсяВПУ6
		
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ДополнительныеДанныеДляППССрезПоследних.Сотрудник	
		//|ИЗ РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&НачДата) КАК ДополнительныеДанныеДляППССрезПоследних
		//|;
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеДанныеДляППССрезПоследних.Период КАК Период,
		|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности,
		|	ДополнительныеДанныеДляППССрезПоследних.Сотрудник
		|ПОМЕСТИТЬ ВТДопДанные
		|ИЗ
		|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&НачДата) КАК ДополнительныеДанныеДляППССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ВТДопДанные.Период) КАК МаксПериод,
		|	ВТДопДанные.Сотрудник
		|ПОМЕСТИТЬ ВТМаксПериоды
		|ИЗ
		|	ВТДопДанные КАК ВТДопДанные
		|СГРУППИРОВАТЬ ПО
		|	ВТДопДанные.Сотрудник
		|ИНДЕКСИРОВАТЬ ПО
		|	МаксПериод,
		|	Сотрудник
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаксПериоды.Сотрудник
		|ПОМЕСТИТЬ ВТРаботающиеНаНачПериода
		|ИЗ
		|	ВТМаксПериоды КАК ВТМаксПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДопДанные КАК ВТДопДанные
		|		ПО ВТМаксПериоды.МаксПериод = ВТДопДанные.Период
		|       	И ВТМаксПериоды.Сотрудник = ВТДопДанные.Сотрудник
		|ГДЕ
		|	ВТДопДанные.ВидДеятельности.ИспользуетсяВПУ6
		|;
		|///////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТРаботающиеНаНачПериода.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТДополнительныеДанныеДляППС
		|ИЗ ВТРаботающиеНаНачПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеДанныеДляППС.Сотрудник	
		|ИЗ РегистрСведений.ДополнительныеДанныеДляППС КАК ДополнительныеДанныеДляППС
		|ГДЕ ДополнительныеДанныеДляППС.Период МЕЖДУ &НачДата И &КонДата
		|	И ДополнительныеДанныеДляППС.ВидДеятельности.ИспользуетсяВПУ6
		|;
		
		//Аверсон СВФР-007922
		
		|///////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.СотрудникФизлицо КАК Физлицо
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
		|		РаботникиОрганизаций.Сотрудник.Физлицо КАК СотрудникФизлицо
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
		|	ГДЕ
		|		РаботникиОрганизаций.Период МЕЖДУ &НачДата И &КонДата
		//|		И РаботникиОрганизаций.ВидДеятельностиИзмерение.ИспользуетсяВПУ6
		|		И РаботникиОрганизаций.Сотрудник В (ВЫБРАТЬ ВТДополнительныеДанныеДляППС.Сотрудник ИЗ ВТДополнительныеДанныеДляППС)
		|		И РаботникиОрганизаций.Организация = &Организация";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
			|	И РаботникиОрганизаций.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаботникиОрганизацийСрезПоследних.Сотрудник,
		|		РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
		|	ИЗ
		|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачДата, Сотрудник В (ВЫБРАТЬ ВТДополнительныеДанныеДляППС.Сотрудник ИЗ ВТДополнительныеДанныеДляППС)) КАК РаботникиОрганизацийСрезПоследних
		|	ГДЕ
		//|		РаботникиОрганизацийСрезПоследних.ВидДеятельностиИзмерение.ИспользуетсяВПУ6
		|	РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
			|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ЗапросПоСотрудникам.Текст = ЗапросПоСотрудникам.Текст + "
		|) КАК ВложенныйЗапрос";
	КонецЕсли;
	//Аверсон СВФР-007324
	
	Если ПериодРегистрации = Дата(2016,12,1) Тогда //О.Т. Аверсон 24.03.2017 № 449
		ЗапросПоСотрудникам.УстановитьПараметр("НачДата", ДобавитьМесяц(НачалоМесяца(ПериодРегистрации),1));
		ЗапросПоСотрудникам.УстановитьПараметр("КонДата", ДобавитьМесяц(КонецМесяца(ПериодРегистрации),1));
	иначе 		
		ЗапросПоСотрудникам.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
		ЗапросПоСотрудникам.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	КонецЕсли;
	ЗапросПоСотрудникам.УстановитьПараметр("Организация", Организация);
	ЗапросПоСотрудникам.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	ТЗСотрудники = ЗапросПоСотрудникам.Выполнить().Выгрузить();
	мСписокСотрудников = ЗапросПоСотрудникам.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	ЗапросПоСотрудникам.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
	ЗапросПоСотрудникам.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	
	
	ЗапросПоСотрудникам.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Дата,
	|	0 КАК ОтработаноЧасов,
	|	&ВидДеятельности,
	|	0 КАК ТарифВзносов,
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	0 КАК Группа,
	|	РаботникиОрганизацийСрезПоследних.ГрафикРаботы,
	|	0 КАК ПроцентЗанятости,
	|	""                    "" КАК Причина,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо КАК Физлицо,
	|	РаботникиОрганизацийСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&КонДата,
	|			Организация = &Организация
	|				И ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних,
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник В(&СписокСотрудник)
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачДата И &КонДата
	|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Дата";
	
	ЗапросПоСотрудникам.УстановитьПараметр("СписокСотрудник", мСписокСотрудников);
	ЗапросПоСотрудникам.УстановитьПараметр("ВидДеятельности", Справочники.ОсобыеУсловияТруда.ПустаяСсылка());
	
	мТаблицаДанных = ЗапросПоСотрудникам.Выполнить().Выгрузить();
	
	//Запрос по Индивидуальным графикам
	ЗапросПоГрафикам = Новый Запрос;
	ЗапросПоГрафикам.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение,
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК Сотрудник,
	|	ГрафикиРаботыПоВидамВремени.Дата
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачДата И &КонДата
	|	И ГрафикиРаботыПоВидамВремени.ГрафикРаботы В(&СписокСотрудник)
	|	И ГрафикиРаботыПоВидамВремени.План
	|	И ГрафикиРаботыПоВидамВремени.ВидВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)";
	
	ЗапросПоГрафикам.УстановитьПараметр("СписокСотрудник", мСписокСотрудников);
	ЗапросПоГрафикам.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
	ЗапросПоГрафикам.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	
	мТаблицаГрафиков = ЗапросПоГрафикам.Выполнить().Выгрузить();
	
	//Запрос по Отпускам
	ЗапросПоОтпускам = Новый Запрос;
	ЗапросПоОтпускам.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК Начало,
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК Конец
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	(НЕ ОсновныеНачисленияРаботниковОрганизаций.Сторно)
	|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням)
	|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодДействия МЕЖДУ &НачДата И &КонДата
	|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник В(&СписокСотрудник)";
	
	ЗапросПоОтпускам.УстановитьПараметр("СписокСотрудник", мСписокСотрудников);
	ЗапросПоОтпускам.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
	ЗапросПоОтпускам.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	
	мТаблицаОтпусков = ЗапросПоОтпускам.Выполнить().Выгрузить();
	
	//убираем дни не подлежащие СП1 и СП2	
	
	ЗапросИсключений = Новый Запрос;
	ЗапросИсключений.Текст = 
	//"ВЫБРАТЬ
	//|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало КАК ПериодДействияНачало,
	//|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияКонец КАК ПериодДействияКонец,
	//|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	//|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета.Наименование КАК Причина
	//|ИЗ
	//|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	//|ГДЕ
	//|	ОсновныеНачисленияРаботниковОрганизаций.ПериодДействияНачало МЕЖДУ &НачДата И &КонДата
	//|	И ОсновныеНачисленияРаботниковОрганизаций.Организация = &Организация
	//|	И ОсновныеНачисленияРаботниковОрганизаций.Сотрудник В(&СписокСотрудник)
	//|	И ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета В
	//|			(ВЫБРАТЬ
	//|				ОсновныеНачисленияОрганизаций.Ссылка
	//|			ИЗ
	//|				ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	//|			ГДЕ
	//|				ОсновныеНачисленияОрганизаций.ОтчисленияНаППС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.НеОблагается))
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	"ВЫБРАТЬ
	|	ГрафикиРаботыПоВидамВремени.Дата КАК ПериодДействияНачало,
	|	ГрафикиРаботыПоВидамВремени.Дата КАК ПериодДействияКонец,
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК Сотрудник,
	|	ГрафикиРаботыПоВидамВремени.ВидВремени.Наименование КАК Причина
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы В(&СписокСотрудник)
	|	И ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачДата И &КонДата
	|	И ГрафикиРаботыПоВидамВремени.ВидВремени.ИсключатьИзПУ6
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	ЗапросИсключений.УстановитьПараметр("НачДата", НачалоМесяца(ПериодРегистрации));
	ЗапросИсключений.УстановитьПараметр("КонДата", КонецМесяца(ПериодРегистрации));
	ЗапросИсключений.УстановитьПараметр("Организация", Организация);
	ЗапросИсключений.УстановитьПараметр("СписокСотрудник", мСписокСотрудников);
	
	мТаблицаИсключений = ЗапросИсключений.Выполнить().Выгрузить();
	
	Для Каждого мСтрокаИсключений Из мТаблицаИсключений Цикл
		мСтрокиПУ6 = мТаблицаДанных.НайтиСтроки(Новый Структура("Сотрудник", мСтрокаИсключений.Сотрудник));
		Для Каждого мСтрокаПУ6 Из мСтрокиПУ6 Цикл
			Если мСтрокаПУ6.Дата >= мСтрокаИсключений.ПериодДействияНачало И мСтрокаПУ6.Дата <= мСтрокаИсключений.ПериодДействияКонец Тогда
				мСтрокаПУ6.Причина = мСтрокаИсключений.Причина;
				#Если Клиент Тогда
					Сообщить(Строка(мСтрокаПУ6.Сотрудник)+" "+Строка(мСтрокаПУ6.Дата)+" "+Строка(мСтрокаПУ6.Причина));
				#КонецЕсли
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//перем для изменения сотрудника
	мГруппаСотрудник = Справочники.СотрудникиОрганизаций.ПустаяСсылка();
	мГруппаВидДеятельности = Справочники.ОсобыеУсловияТруда.ПустаяСсылка();
	мГруппаДолжность = Справочники.ДолжностиОрганизаций.ПустаяСсылка();
	мГруппа = 0;
	
	ТЗСводныйТабель = Новый ТаблицаЗначений;
	ТЗСводныйТабель.Колонки.Добавить("ФизЛицо");
	
	Для Каждого мСтрока Из мТаблицаДанных Цикл
		Если НЕ ЗначениеЗаполнено(мСтрока.Причина) Тогда
			мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мСтрока.Дата,
			Новый Структура("Сотрудник, Организация", мСтрока.Сотрудник, мСтрока.Организация));
			Если ПериодРегистрации = Дата(2016,12,1) и не ЗначениеЗаполнено(мСтрокаРегистра1.ВидДеятельностиИзмерение) Тогда //О.Т. Аверсон 24.03.2017 № 449
				мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДобавитьМесяц(мСтрока.Дата,1),
				Новый Структура("Сотрудник, Организация", мСтрока.Сотрудник, мСтрока.Организация));
			КонецЕсли;
			
			//Аверсон ЕАЕ 15.03.2021 СВФР-007324
			Если Не ПоРаботникамОрганизаций Тогда
				ВидДеятельности = ПолучитьВидДеятельности(мСтрока.Сотрудник, мСтрока.Дата);
			КонецЕсли;
			//Аверсон СВФР-007324
			
			мСтрокаРегистра = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мСтрока.Дата,
			Новый Структура("Сотрудник, Организация", мСтрока.Сотрудник, мСтрока.Организация));
			
			//Аверсон ЕАЕ 15.03.2021 СВФР-007324
			//мСтрока.ВидДеятельности = мСтрокаРегистра1.ВидДеятельностиИзмерение;
			Если ПоРаботникамОрганизаций Тогда
				мСтрока.ВидДеятельности = мСтрокаРегистра1.ВидДеятельностиИзмерение;
			Иначе
				мСтрока.ВидДеятельности = ВидДеятельности;
			КонецЕсли;
			//Аверсон СВФР-007324
			
			мСтрока.Должность = мСтрокаРегистра.Должность;
			мСтрока.ТарифВзносов = РегистрыСведений.ТарифыВзносовНаППС.ПолучитьПоследнее(мСтрока.Дата,
			Новый Структура("ВидДеятельности", мСтрокаРегистра1.ВидДеятельностиИзмерение)).Процент;
			Если ЗначениеЗаполнено(мСтрока.ВидДеятельности) Тогда
				//отработанное время
				мСтрокаРегистраГрафикСотрудника = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
				Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
				мСтрока.Сотрудник, НачалоМесяца(мСтрока.Дата), Ложь, Перечисления.ВидыУчетаВремени.ПоЧасам, мСтрока.Дата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
				мСтрока.ОтработаноЧасов = мСтрокаРегистраГрафикСотрудника.ОсновноеЗначениеПолное;
				
				если мСтрокаРегистраГрафикСотрудника.ОсновноеЗначениеПолное = 0 Тогда 	
					Если Организация.ИНН="100765738" Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
						|ИЗ
						|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
						|ГДЕ
						|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
						|	И РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод
						|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
						|	И РабочееВремяРаботниковОрганизаций.ДатаНачала = &Период";
					иначе
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов
						|ИЗ
						|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
						|ГДЕ
						|	РабочееВремяРаботниковОрганизаций.Сотрудник = &Сотрудник
						|	И РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод
						|	И РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &ВидИспользованияРабочегоВремени
						|	И РабочееВремяРаботниковОрганизаций.Период = &Период";
					КонецЕсли;
					
					
					
					Запрос.УстановитьПараметр("ВидИспользованияРабочегоВремени", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
					Запрос.УстановитьПараметр("Период", мСтрока.Дата);
					Запрос.УстановитьПараметр("Сотрудник", мСтрока.Сотрудник);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						мСтрока.ОтработаноЧасов = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Часов),ВыборкаДетальныеЗаписи.Часов,0);
						если ТЗСводныйТабель.НайтиСтроки(Новый Структура("Физлицо",мСтрока.Физлицо)).Количество()=0 Тогда 
							СтрТЗСводныйТабель = ТЗСводныйТабель.Добавить();
							СтрТЗСводныйТабель.ФизЛицо = мСтрока.Сотрудник.Физлицо;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				
				//время по графику индивидуальному графику
				мСтрокаРегистраГрафик = мТаблицаГрафиков.НайтиСтроки(Новый Структура("Сотрудник, Дата", мСтрока.Сотрудник, мСтрока.Дата));
				Если мСтрокаРегистраГрафик.Количество() = 0 Тогда
					//мСтрокаРегистраГрафик = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
					//		Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
					//			мСтрока.Сотрудник, НачалоМесяца(мСтрока.Дата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мСтрока.Дата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
					мСтрокаРегистраГрафик = РегистрыСведений.ГрафикиРаботыПоВидамВремени.Получить(
					Новый Структура("ГрафикРаботы, Месяц, План, ВидУчетаВремени, Дата, ВидВремени",
					мСтрока.ГрафикРаботы, НачалоМесяца(мСтрока.Дата), Истина, Перечисления.ВидыУчетаВремени.ПоЧасам, мСтрока.Дата, Справочники.КлассификаторИспользованияРабочегоВремени.Работа));
					мЧасовПоГрафику = мСтрокаРегистраГрафик.ОсновноеЗначение;
				Иначе
					мЧасовПоГрафику = мСтрокаРегистраГрафик[0].ОсновноеЗначение;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(мЧасовПоГрафику) Тогда
					мСтрока.ПроцентЗанятости = (мСтрока.ОтработаноЧасов/мЧасовПоГрафику)*100;
					Если мСтрока.ПроцентЗанятости = 0 Тогда
						мСтрокиОтпуска = мТаблицаОтпусков.НайтиСтроки(Новый Структура("Сотрудник", мСтрока.Сотрудник));
						Для Каждого мСтрокОтпуска Из мСтрокиОтпуска Цикл
							Если  мСтрока.Дата >= мСтрокОтпуска.Начало И мСтрока.Дата <= мСтрокОтпуска.Конец Тогда
								мСтрока.ПроцентЗанятости = 222.99;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				Иначе
					мСтрока.ПроцентЗанятости = 100;
				КонецЕсли;
				//Если мСтрока.ПроцентЗанятости < 80 И ЗначениеЗаполнено(мСтрока.ВидДеятельности) Тогда
				//	мСтрока.ВидДеятельности = Справочники.ОсобыеУсловияТруда.ПустаяСсылка();
				//	#Если Клиент Тогда
				//		Сообщить(Строка(мСтрока.Сотрудник)+" "+Строка(мСтрока.Дата)+" неполный рабочий день "+Строка(мСтрока.ПроцентЗанятости));
				//	#КонецЕсли
				//КонецЕсли;
			КонецЕсли;
			Если мГруппаСотрудник <> мСтрока.Сотрудник Или мГруппаВидДеятельности <> мСтрока.ВидДеятельности Или мГруппаДолжность <> мСтрока.Должность Тогда
				мГруппа = мГруппа + 1;
				мСтрока.Группа = мГруппа;
				мГруппаСотрудник = мСтрока.Сотрудник;
				мГруппаВидДеятельности = мСтрока.ВидДеятельности;
				мГруппаДолжность = мСтрока.Должность;
			Иначе
				мСтрока.Группа = мГруппа;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//удалим пустые строки
	мПустоеЗначение = мТаблицаДанных.НайтиСтроки(Новый Структура("ВидДеятельности", Справочники.ОсобыеУсловияТруда.ПустаяСсылка()));
	Для Каждого мСтрока Из мПустоеЗначение Цикл
		мТаблицаДанных.Удалить(мСтрока);
	КонецЦикла;
	
	ОтработанноеВремя.Загрузить(мТаблицаДанных.Скопировать());
	
	Записать();
	
	//формируем Данные по суммам
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетППСОтработанноеВремя.Сотрудник.Физлицо КАК Физлицо,
	|	СУММА(РасчетППСОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	РасчетППСОтработанноеВремя.ВидДеятельности,
	|	РасчетППСОтработанноеВремя.ТарифВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетППСОтработанноеВремя.ОтработаноЧасов <> 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОтработаноДней,
	|	РасчетППСОтработанноеВремя.Должность,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РасчетППСОтработанноеВремя.ПроцентЗанятости = 222.99
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Удалять
	|ИЗ
	|	Документ.РасчетППС.ОтработанноеВремя КАК РасчетППСОтработанноеВремя
	|ГДЕ
	|	РасчетППСОтработанноеВремя.Ссылка = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетППСОтработанноеВремя.ВидДеятельности,
	|	РасчетППСОтработанноеВремя.Сотрудник.Физлицо,
	|	РасчетППСОтработанноеВремя.ТарифВзносов,
	|	РасчетППСОтработанноеВремя.Должность";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчисленияНаППС", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
	тзИсчисленныйЕСН = Запрос.Выполнить().Выгрузить();
	
	ТЗДляОтработанногоВр = Запрос.Выполнить().Выгрузить();
	ТЗДляОтработанногоВр.Свернуть("ФизЛицо","ОтработаноДней");
	//удалим записи без отработанного времени	
	//мПустоеЗначение = тзИсчисленныйЕСН.НайтиСтроки(Новый Структура("ОтработаноЧасов", 0));
	//Для Каждого мСтрока Из мПустоеЗначение Цикл
	//	Если Не мСтрока.Удалять Тогда
	//		мПустоеЗначениеТЗ = ОтработанноеВремя.НайтиСтроки(Новый Структура("ФизЛицо, ВидДеятельности, Должность", мСтрока.ФизЛицо, мСтрока.ВидДеятельности, мСтрока.Должность));
	//		Для Каждого мСтрокаТЗ Из мПустоеЗначениеТЗ Цикл
	//			ОтработанноеВремя.Удалить(мСтрокаТЗ);
	//		КонецЦикла;
	//		тзИсчисленныйЕСН.Удалить(мСтрока);
	//	КонецЕсли;
	//КонецЦикла;
	
	Таблица = СформироватьТаблицуЗаработка(тзИсчисленныйЕСН, ПоРаботникамОрганизаций); //Аверсон ЕАЕ 15.03.2021 СВФР-007324
	
	ИсчисленныйЕСН.Очистить();
	Для Каждого СтрокаППС Из тзИсчисленныйЕСН Цикл
		Если ТЗСводныйТабель.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаППС.ФизЛицо)).Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиНачисленногоФонда = Таблица.НайтиСтроки(Новый Структура("ФизЛицо, ВидДеятельности, Должность", СтрокаППС.ФизЛицо,СтрокаППС.ВидДеятельности,СтрокаППС.Должность)); // , ВидДеятельности, Должность
		Для Каждого СтрокаПериода Из СтрокиНачисленногоФонда Цикл
			мНоваяСтрока = ИсчисленныйЕСН.Добавить();
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, СтрокаППС); 
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, СтрокаПериода); 
			//О.Т. Аверсон 08.06.2016 № 1178
			МассивСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаППС.ФизЛицо));
			Если МассивСотрудники.Количество()>0 Тогда 
				СпрСотр =МассивСотрудники[0].Сотрудник;
			иначе
				СпрСотр = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(СтрокаППС.ФизЛицо.Наименование);
			КонецЕсли;
			
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			
			Если СпрСотр.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = СпрСотр.ВидНалогообложенияОсновной;
			КонецЕсли;
			
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации - 86400,
			Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ППС,ВидНалогообложения));
			БазаОграничения = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			//О.Т. Аверсон 08.06.2016 № 1178
			ВсегоОтработаноДней = 0;
			МассивТЗДляОтработанногоВр = ТЗДляОтработанногоВр.НайтиСтроки(Новый Структура("ФизЛицо",СтрокаППС.ФизЛицо));
			Для Каждого стр из МассивТЗДляОтработанногоВр Цикл 
				ВсегоОтработаноДней = ВсегоОтработаноДней + стр.ОтработаноДней;
			КонецЦикла;
			
			Если БазаОграничения <> 0 Тогда 
				мНоваяСтрока.ФондППС = ОбщегоНазначения.ОкруглитьПоВалюте(Мин(БазаОграничения,СтрокаПериода.Результат), Константы.ВалютаРегламентированногоУчета.Получить());// /ВсегоОтработаноДней*СтрокаППС.ОтработаноДней
			иначе
				мНоваяСтрока.ФондППС = ОбщегоНазначения.ОкруглитьПоВалюте(СтрокаПериода.Результат, Константы.ВалютаРегламентированногоУчета.Получить());//  /ВсегоОтработаноДней*СтрокаППС.ОтработаноДней
			КонецЕсли;
			
			мНоваяСтрока.ППС = ОбщегоНазначения.ОкруглитьПоВалюте(мНоваяСтрока.ФондППС * мНоваяСтрока.ТарифВзносов /100, Константы.ВалютаРегламентированногоУчета.Получить());
			Если НачалоМесяца(мНоваяСтрока.ПериодВзаиморасчетов) <> НачалоМесяца(ПериодРегистрации) Тогда
				мНоваяСтрока.ОтработаноДней = 0;
				мНоваяСтрока.ОтработаноЧасов = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрСводный из ТЗСводныйТабель Цикл 
		СтрокиНачисленногоФонда = Таблица.НайтиСтроки(Новый Структура("ФизЛицо", СтрСводный.ФизЛицо));
		Для Каждого СтрокаПериода Из СтрокиНачисленногоФонда Цикл
			
			//СВЭЙ 30.10.2023 КВВ СВФР-011719 (
			Если СтрокаПериода.Результат = 0 Тогда  
				Продолжить;
			 КонецЕсли;
			//СВЭЙ 30.10.2023 КВВ СВФР-011719 )
			
			мНоваяСтрока = ИсчисленныйЕСН.Добавить();
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, СтрокаПериода); 
			мНоваяСтрока.ТарифВзносов = РегистрыСведений.ТарифыВзносовНаППС.ПолучитьПоследнее(СтрокаПериода.ПериодВзаиморасчетов,
			Новый Структура("ВидДеятельности", СтрокаПериода.ВидДеятельности)).Процент;
			//О.Т. Аверсон 08.06.2016 № 1178
			МассивСотрудники = ТЗСотрудники.НайтиСтроки(Новый Структура("ФизЛицо",СтрСводный.ФизЛицо));
			Если МассивСотрудники.Количество()>0 Тогда 
				СпрСотр =МассивСотрудники[0].Сотрудник;
				
				//Аверсон 03.08.2021 КВВ СВФР-007943 (
				ТЗКомОплПоСр = ПроведениеРасчетов.ПроверитьКомандировкиИОплатуПоСреднему(Организация,СпрСотр,НачалоМесяца(СтрокаПериода.ПериодВзаиморасчетов), КонецМесяца(СтрокаПериода.ПериодВзаиморасчетов));
				Если ТЗКомОплПоСр.Количество() > 0 Тогда
					ТЗКомОплПоСр.Свернуть(,"НормаЧ,Норма,Часов,Дней");
					ЕстьЧД = ТЗКомОплПоСр[0].НормаЧ + ТЗКомОплПоСр[0].Норма + ТЗКомОплПоСр[0].Дней + ТЗКомОплПоСр[0].Часов;
					Если ЕстьЧД > 0 Тогда
						ДатыКомандировок = "";
						ЗапросПоКоманд = Новый Запрос;
						ЗапросПоКоманд.Текст = 
						"ВЫБРАТЬ
						|	Командировки.Сотрудник,
						|	Командировки.ДатаНачала,
						|	Командировки.ДатаОкончания,
						|	Командировки.Ссылка	
						|ИЗ Документ.КомандировкиОрганизаций.РаботникиОрганизации КАК Командировки
						|ГДЕ Командировки.Сотрудник = &Сотр
						|	И (Командировки.ДатаНачала МЕЖДУ &ДНач И &ДКон
						|		ИЛИ Командировки.ДатаОкончания МЕЖДУ &ДНач И &ДКон)
						|	И Командировки.Ссылка.Проведен";
						ЗапросПоКоманд.УстановитьПараметр("Сотр",СпрСотр);
						ЗапросПоКоманд.УстановитьПараметр("ДНач",НачалоМесяца(СтрокаПериода.ПериодВзаиморасчетов));
						ЗапросПоКоманд.УстановитьПараметр("ДКон",КонецМесяца(СтрокаПериода.ПериодВзаиморасчетов));
						ТЗКом = ЗапросПоКоманд.Выполнить().Выгрузить();
						Если ТЗКом.Количество() <> 0 Тогда 
							Для Каждого СтрТЗКом ИЗ ТЗКом Цикл
								ДатыКомандировок = ДатыКомандировок + ?(ЗначениеЗаполнено(ДатыКомандировок),"; ","") + Формат(СтрТЗКом.ДатаНачала,"ДЛФ=Д") + " - " + Формат(СтрТЗКом.ДатаОкончания,"ДЛФ=Д");
							КонецЦикла;
						КонецЕсли;	
						Сообщить(СокрЛП(СпрСотр.Наименование) + " (" + СокрЛП(СпрСотр.Код) + ") " + ?(СпрСотр.ФизЛицо.Пол = Перечисления.ПолФизическихЛиц.Женский,"находилась","находился") + " в командировке " + ДатыКомандировок);	
					КонецЕсли;
				КонецЕсли;
				//Аверсон 03.08.2021 КВВ СВФР-007943 )
				
			иначе
				СпрСотр = Справочники.СотрудникиОрганизаций.НайтиПоНаименованию(СтрСводный.ФизЛицо.Наименование);
			КонецЕсли;
			
			ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			
			Если СпрСотр.ВидНалогообложенияОсновной = Справочники.ВидыНалогообложения.ПустаяСсылка() Тогда 
				ВидНалогообложения = Организация.ОсновнаяСтавкаНалогообложения;
			иначе
				ВидНалогообложения = СпрСотр.ВидНалогообложенияОсновной;
			КонецЕсли;
			
			РазмерСреднейЗарплаты = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(ПериодРегистрации - 86400,
			Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.СредняяЗПРаботников)).Размер;
			СтруктураПенс = РегистрыСведений.СтавкиОтчисленийСФОТиЗП.ПолучитьПоследнее(ПериодРегистрации,Новый Структура("Организация,ВидОтчисления,ВидНалогообложения",Организация,Перечисления.ВидыОтчисленийСФОТиЗП.ППС,ВидНалогообложения));
			БазаОграничения = СтруктураПенс.ОграничениеПоДоходам*РазмерСреднейЗарплаты;
			//О.Т. Аверсон 08.06.2016 № 1178
			
			Если БазаОграничения <> 0 Тогда 
				мНоваяСтрока.ФондППС = ОбщегоНазначения.ОкруглитьПоВалюте(Мин(БазаОграничения,СтрокаПериода.Результат), Константы.ВалютаРегламентированногоУчета.Получить());
			иначе
				мНоваяСтрока.ФондППС = ОбщегоНазначения.ОкруглитьПоВалюте(СтрокаПериода.Результат, Константы.ВалютаРегламентированногоУчета.Получить());
			КонецЕсли;
			
			мНоваяСтрока.ППС = ОбщегоНазначения.ОкруглитьПоВалюте(мНоваяСтрока.ФондППС * мНоваяСтрока.ТарифВзносов /100, Константы.ВалютаРегламентированногоУчета.Получить());
			Если НачалоМесяца(мНоваяСтрока.ПериодВзаиморасчетов) <> НачалоМесяца(ПериодРегистрации) Тогда
				мНоваяСтрока.ОтработаноДней = 0;
				мНоваяСтрока.ОтработаноЧасов = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	Возврат Не Отказ;
	
КонецФункции // Автозаполнение()

//Аверсон ЕАЕ 15.03.2021 СВФР-007324
Функция ПолучитьВидДеятельности(Сотр, Дат)
	ВидД = Справочники.ОсобыеУсловияТруда.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеДанныеДляППССрезПоследних.ВидДеятельности
	|ИЗ
	|	РегистрСведений.ДополнительныеДанныеДляППС.СрезПоследних(&Дат, Сотрудник = &Сотр) КАК ДополнительныеДанныеДляППССрезПоследних";
	
	Запрос.УстановитьПараметр("Дат", Дат);
	Запрос.УстановитьПараметр("Сотр", Сотр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВидД = ВыборкаДетальныеЗаписи.ВидДеятельности;
	КонецЦикла;
	
	Возврат ВидД;
КонецФункции
//Аверсон СВФР-007324

Функция СформироватьТаблицуЗаработка(тзИсчисленныйЕСН, ПоРаботникамОрганизаций = Истина) //Аверсон ЕАЕ 15.03.2021 СВФР-007324 параметр ПоРаботникамОрганизаций
	//Островская Татьяна 11.06.2013 № 16547
	
	СписокФизЛиц = тзИсчисленныйЕСН.ВыгрузитьКолонку("ФизЛицо");
	
	Запрос = Новый Запрос;
	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	
	Разрезы = Новый Массив(4);
	Разрезы[0] = "ДоходФСЗН";
	Разрезы[1] = "ДоходСтрах";
	Разрезы[2] = "ДоходЕдиногоПлатежа";
	Разрезы[3] = "КодДоходаЕСН";
	
	Запрос.УстановитьПараметр("парамИзмерения",		Измерения);
	Запрос.УстановитьПараметр("парамРазрезыЕСН",	Разрезы);
	Запрос.УстановитьПараметр("парамКатегорияПервичная", Справочники.КатегорииРасчетов.Первичное);
	Запрос.УстановитьПараметр("парамПустойСпособЕСНУ", Перечисления.ДоходыФСС_НС.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("парамСпособНеОблагаетсяКодДоходаЕСН", Перечисления.ДоходыФСС_НС.НеОблагается);
	Запрос.УстановитьПараметр("парамПустойКодЕСНУ", Справочники.ДоходыЕСН.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодЕСН", Справочники.ДоходыЕСН.ОблагаетсяПолностью);
	Запрос.УстановитьПараметр("ОблагаетсяСтрах", Справочники.ДоходыЕСН.ОблагаетсяСтрах);
	
	Запрос.УстановитьПараметр("СписокФизЛиц", СписокФизЛиц);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчисленияНаППС", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Период1", КонецМесяца(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ВидДеятельности", Справочники.ОсобыеУсловияТруда.ПустаяСсылка());
	Запрос.УстановитьПараметр("Должность", Справочники.ДолжностиОрганизаций.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюКодДоходаЕСН", Перечисления.ДоходыФСС_НС.Облагается);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	
	
	ПенсФондБудМес = РегистрыСведений.РазмерыПараметровДляРасчетаРБ.ПолучитьПоследнее(,Новый Структура("ВидПараметра",Перечисления.ВидыПараметровДляРасчетаЗарплаты.ПенсионныйФондБудущегоМесяца)).размер;
	если ?(Организация.ИНН = "100765738", ПенсФондБудМес = 0,ПенсФондБудМес = 1) тогда //О.Т. Аверсон 31.01.2017 поменяла местами 0 и 1 
		ТекстЗапроса = 
		
		//Аверсон ЕАЕ 06.11.2022 СВФР-009799
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОснНачисления.Сотрудник,
		|	ОснНачисления.ФизЛицо,
		|	ОснНачисления.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНужныеОснНачисления
		|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНачисления
		|ГДЕ 	
		|	ВЫБОР
		|	КОГДА ОснНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|	ТОГДА ОснНачисления.Организация
		|	ИНАЧЕ ОснНачисления.ПодразделениеОрганизации.Владелец
		|	КОНЕЦ = &Организация
		|И 
		|((ОснНачисления.ПериодРегистрации МЕЖДУ &период И &Период1
		|И 
		|(ОснНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1 ИЛИ ОснНачисления.ПериодДействияНачало < &период)
		|)
		|ИЛИ
		|(ОснНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|И (ОснНачисления.ПериодРегистрации < &период))
		|)
		|	И ОснНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОснНачисления.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|		И ОснНачисления.ФизЛицо В(&СписокФизЛиц)
		|; 
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТНужныеОснНачисления.ФизЛицо,
		|	ВТНужныеОснНачисления.Сотрудник,
		|	ВТНужныеОснНачисления.ПериодРегистрации,
		|	МАКСИМУМ(Гражданство.Период) КАК МаксПериод
		|ПОМЕСТИТЬ ВТПериодыГражданства
		|ИЗ ВТНужныеОснНачисления
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТНужныеОснНачисления.ФизЛицо = Гражданство.ФизЛицо
		|	И Гражданство.Период < ВТНужныеОснНачисления.ПериодРегистрации
		|СГРУППИРОВАТЬ ПО
		|	ВТНужныеОснНачисления.ФизЛицо,
		|	ВТНужныеОснНачисления.Сотрудник,
		|	ВТНужныеОснНачисления.ПериодРегистрации
		|; 
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТПериодыГражданства.ФизЛицо,
		|	ВТПериодыГражданства.Сотрудник,
		|	ВТПериодыГражданства.ПериодРегистрации,
		|   Гражданство.НеИмеетПравоНаПенсию
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ ВТПериодыГражданства
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТПериодыГражданства.ФизЛицо = Гражданство.ФизЛицо
		|	И ВТПериодыГражданства.МаксПериод = Гражданство.Период
		|;
		|////////////////////////////////////////////////////////////////////////////
		//Аверсон СВФР-009799
		
		|ВЫБРАТЬ
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходФСЗН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходСтрах,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидРасчета,
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.ПериодДействияНачало КАК ПериодВзаиморасчетов,
		|	ДанныеУчета.ПериодДействияКонец КАК ПериодКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	&ВидДеятельности,
		|	&Должность,
		|	0 КАК Тип,
		|	ДанныеУчета.Регистратор.ИсключитьИзПУ6
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Регистратор КАК Регистратор,
		|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ ОсновныеНачисления.ВидРасчета.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|				ТОГДА &ОблагаетсяСтрах
		|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
		|		КОНЕЦ КАК КодДоходаЕСН,
		|		ОсновныеНачисления.Организация КАК Организация,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ОсновныеНачисления.Сторно КАК Сторно,
		|		ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ОсновныеНачисления.Организация КАК Организация,
		|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ОсновныеНачисления.Организация
		|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И ОсновныеНачисления.ПериодРегистрации = &Период
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо,
		|					ОсновныеНачисления.Организация,
		|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
		
		//Аверсон ЕАЕ 06.11.2022 СВФР-009799
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		//|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		//|			ИЗ  
		//|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		//|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК НеПравоНаПенсию
		|ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	И ОсновныеНачисления.ПериодРегистрации = НеПравоНаПенсию.ПериодРегистрации
		
		//Аверсон ЕАЕ 14.12.2022 СВФР-010013
		|	И ОсновныеНачисления.Сотрудник = НеПравоНаПенсию.Сотрудник
		//Аверсон СВФР-010013
		
		//Аверсон СВФР-009799
		
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ОсновныеНачисления.Организация
		|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация";
		
		//Аверсон 15.06.2021 КВВ СВФР-007702 (
		////Аверсон 20.11.2020 КВВ СВФР-006848 (
		////|		И ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		//Если ПоРегистрации Тогда
		//	ТекстЗапроса = ТекстЗапроса + "                                 
		//	|		И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &период И &Период1";
		//Иначе
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|		И ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1";
		//КонецЕсли;  
		////Аверсон 20.11.2020 КВВ СВФР-006848 )
		ТекстЗапроса = ТекстЗапроса + "
		|И 
		|((ОсновныеНачисления.ПериодРегистрации МЕЖДУ &период И &Период1
		|	И 
		|	(ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|		ИЛИ
		|	ОсновныеНачисления.ПериодДействияНачало < &период)
		|  )
		|  ИЛИ
		|(ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|И
		|(ОсновныеНачисления.ПериодРегистрации < &период)
		|)
		|)";
		//Аверсон 15.06.2021 КВВ СВФР-007702 )
		
		ТекстЗапроса = ТекстЗапроса + "
		|		И ОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОсновныеНачисления.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|		И ОсновныеНачисления.ФизЛицо В(&СписокФизЛиц)) КАК ДанныеУчета
		|ГДЕ
		|	ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН = ИСТИНА
		|	И ЕСТЬNULL(ДанныеУчета.Регистратор.ИсключитьИзПУ6, ЛОЖЬ) <> ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.ПериодДействияКонец,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.ПериодДействияНачало,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	ДанныеУчета.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ДанныеУчета.Регистратор,
		|	ДанныеУчета.Регистратор.ИсключитьИзПУ6
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
	иначе
		ТекстЗапроса =
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ  
		|	ОснНачисления.Сотрудник,
		|	ОснНачисления.ФизЛицо,
		|	ОснНачисления.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНужныеОснНачисления
		|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНачисления
		|ГДЕ 
		|ВЫБОР
		|КОГДА ОснНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|ТОГДА ОснНачисления.Организация
		|ИНАЧЕ ОснНачисления.ПодразделениеОрганизации.Владелец
		|КОНЕЦ = &Организация
		|И ОснНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		|И 
		|((ОснНачисления.ПериодРегистрации МЕЖДУ &период И &Период1
		|	И 
		|	(ОснНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|		ИЛИ
		|	ОснНачисления.ПериодДействияНачало < &период)
		|  )
		|  ИЛИ
		|(ОснНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|И
		|(ОснНачисления.ПериодРегистрации < &период)
		|)
		|)";
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОснНачисления.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|		И ОснНачисления.ФизЛицо В(&СписокФизЛиц)
        |;
		|//////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТНужныеОснНачисления.ФизЛицо,
		|	ВТНужныеОснНачисления.Сотрудник,
		|	ВТНужныеОснНачисления.ПериодРегистрации,
		|	МАКСИМУМ(Гражданство.Период) КАК МаксПериод
		|ПОМЕСТИТЬ ВТПериодыГражданства
		|ИЗ ВТНужныеОснНачисления
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТНужныеОснНачисления.ФизЛицо = Гражданство.ФизЛицо
		|	И Гражданство.Период < ВТНужныеОснНачисления.ПериодРегистрации
		|СГРУППИРОВАТЬ ПО
		|	ВТНужныеОснНачисления.ФизЛицо,
		|	ВТНужныеОснНачисления.Сотрудник,
		|	ВТНужныеОснНачисления.ПериодРегистрации
		|; 
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТПериодыГражданства.ФизЛицо,
		|	ВТПериодыГражданства.Сотрудник,
		|	ВТПериодыГражданства.ПериодРегистрации,
		|   Гражданство.НеИмеетПравоНаПенсию
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ ВТПериодыГражданства
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТПериодыГражданства.ФизЛицо = Гражданство.ФизЛицо
		|	И ВТПериодыГражданства.МаксПериод = Гражданство.Период
		|;
		|////////////////////////////////////////////////////////////////////////////
		//Аверсон СВФР-009799
		
		|ВЫБРАТЬ
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходФСЗН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходСтрах,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидРасчета,
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.ПериодДействияНачало КАК ПериодВзаиморасчетов,
		|	ДанныеУчета.ПериодДействияКонец КАК ПериодКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	&ВидДеятельности,
		|	&Должность,
		|	0 КАК Тип,
		|	ДанныеУчета.Регистратор.ИсключитьИзПУ6
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Регистратор КАК Регистратор,
		|		ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|		ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА ОсновныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ ОсновныеНачисления.ВидРасчета.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|				ТОГДА &ОблагаетсяСтрах
		|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
		|		КОНЕЦ КАК КодДоходаЕСН,
		|		ОсновныеНачисления.Организация КАК Организация,
		|		ОсновныеНачисления.Результат КАК Результат,
		|		ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|		ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|		ОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|		ОсновныеНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|		ОсновныеНачисления.Сторно КАК Сторно,
		|		ОсновныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ОсновныеНачисления.Организация КАК Организация,
		|					ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ОсновныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ОсновныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ОсновныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ОсновныеНачисления.ПериодДействияНачало)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ОсновныеНачисления.Организация
		|							ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И ОсновныеНачисления.ПериодРегистрации = &Период
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ОсновныеНачисления.Сотрудник,
		|					ОсновныеНачисления.Сотрудник.Физлицо,
		|					ОсновныеНачисления.Организация,
		|					ОсновныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ОсновныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ОсновныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ОсновныеНачисления.ВидРасчета)
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		//|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		//|			ИЗ
		//|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		//|			ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо 
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК НеПравоНаПенсию
		|ПО ОсновныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	И ОсновныеНачисления.ПериодРегистрации = НеПравоНаПенсию.ПериодРегистрации
		
		//Аверсон ЕАЕ 14.12.2022 СВФР-010013
		|	И ОсновныеНачисления.Сотрудник = НеПравоНаПенсию.Сотрудник
		//Аверсон СВФР-010013
		
		//Аверсон СВФР-009799
		
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ОсновныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ОсновныеНачисления.Организация
		|				ИНАЧЕ ОсновныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И ОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС";
		
		//Аверсон 16.06.2021 КВВ СВФР-007702 (
		//|		И ОсновныеНачисления.ПериодРегистрации = &Период
		ТекстЗапроса = ТекстЗапроса + "
		|И 
		|((ОсновныеНачисления.ПериодРегистрации МЕЖДУ &период И &Период1
		|	И 
		|	(ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|		ИЛИ
		|	ОсновныеНачисления.ПериодДействияНачало < &период)
		|  )
		|  ИЛИ
		|(ОсновныеНачисления.ПериодДействияНачало МЕЖДУ &период И &Период1
		|И
		|(ОсновныеНачисления.ПериодРегистрации < &период)
		|)
		|)";
		//Аверсон 16.06.2021 КВВ СВФР-007702 )
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда 
			ТекстЗапроса = ТекстЗапроса + "
			|	И ОсновныеНачисления.ПодразделениеОрганизации = &Подразделение";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|		И ОсновныеНачисления.ФизЛицо В(&СписокФизЛиц)) КАК ДанныеУчета
		|ГДЕ
		|	ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН = ИСТИНА
		|	И ЕСТЬNULL(ДанныеУчета.Регистратор.ИсключитьИзПУ6, ЛОЖЬ) <> ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.Регистратор,
		|	ДанныеУчета.НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.ПериодДействияНачало,
		|	ДанныеУчета.ПериодДействияКонец,
		|	ДанныеУчета.ГрафикРаботы,
		|	ДанныеУчета.Сторно,
		|	ДанныеУчета.ВидУчетаВремени,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	ДанныеУчета.Регистратор.ИсключитьИзПУ6
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
		
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	
	
	
	
	
	//"ВЫБРАТЬ
	//|	РасчетЕСНОсновныеНачисления.ФизЛицо,
	//|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
	//|	РасчетЕСНОсновныеНачисления.ПериодДействияНачало КАК ПериодВзаиморасчетов,
	//|	СУММА(РасчетЕСНОсновныеНачисления.Результат) КАК Результат,
	//|	РасчетЕСНОсновныеНачисления.Сотрудник,
	//|	&ВидДеятельности,
	//|	&Должность,
	//|	0 КАК Тип,
	//|	РасчетЕСНОсновныеНачисления.ПериодДействияКонец КАК ПериодКонец
	//|ИЗ
	//|	Документ.РасчетЕСН.ОсновныеНачисления КАК РасчетЕСНОсновныеНачисления
	//|ГДЕ
	//|	РасчетЕСНОсновныеНачисления.ФизЛицо В(&СписокФизЛиц)
	//|	И НАЧАЛОПЕРИОДА(РасчетЕСНОсновныеНачисления.Ссылка.ПериодРегистрации, МЕСЯЦ) = &Период
	//|	И РасчетЕСНОсновныеНачисления.Ссылка.Проведен
	//|	И РасчетЕСНОсновныеНачисления.Ссылка.Организация = &Организация
	//|	И РасчетЕСНОсновныеНачисления.ДоходФСЗН = &ОтчисленияНаППС
	//|	И РасчетЕСНОсновныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасчетЕСНОсновныеНачисления.ДоходФСЗН,
	//|	РасчетЕСНОсновныеНачисления.ПериодДействияНачало,
	//|	РасчетЕСНОсновныеНачисления.ФизЛицо,
	//|	РасчетЕСНОсновныеНачисления.Сотрудник,
	//|	РасчетЕСНОсновныеНачисления.ПериодДействияКонец";
	ИсходнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	//Аверсон 21.07.2021 КВВ СВФР-007892 (
	ЗПраздников = Новый Запрос;
	ЗПраздников.Текст = "ВЫБРАТЬ
	|РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|ИЗ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачМесяца И &КонМесяца
	|И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник)";
	ЗПраздников.УстановитьПараметр("НачМесяца",НачалоМесяца(ПериодРегистрации));
	ЗПраздников.УстановитьПараметр("КонМесяца",КонецМесяца(ПериодРегистрации));
	ТЗПраздников = ЗПраздников.Выполнить().Выгрузить();
	//Аверсон 21.07.2021 КВВ СВФР-007892 )
	
	//Аверсон 13.11.2020 КВВ СВФР-006819 (
	СписокВР1 = Новый СписокЗначений;
	Для Каждого Строка Из Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Повышения Цикл  // 3 ТЧ
		СписокВР1.Добавить(Строка.ВидРасчета.Ссылка);
	КонецЦикла;
	СписокВР2 = Новый СписокЗначений;
	Для Каждого Строка Из Справочники.ГруппыРасчетов.ИсключенияИзЗаписейСтажаПоППС.Доплаты Цикл   // 4 ТЧ
		
		//Аверсон 15.06.2021 КВВ СВФР-007702 ( (закомментировано)
		////Аверсон 26.05.2021 КВВ СВФР-007574 (
		//ЗначВСпискеВР1 = СписокВР1.НайтиПоЗначению(Строка.ВидРасчета.Ссылка);
		//Если НЕ ЗначВСпискеВР1 = Неопределено Тогда
		//	//Аверсон 26.05.2021 КВВ СВФР-007574 )
		//Аверсон 15.06.2021 КВВ СВФР-007702 ) (закомментировано)
		
		СписокВР2.Добавить(Строка.ВидРасчета.Ссылка);
		//КонецЕсли;
	КонецЦикла;
	
	Если СписокВР1.Количество() <> 0 И СписокВР2.Количество() <> 0 Тогда
		ТЗПериодовСотрИсхТабл = Новый ТаблицаЗначений;
		ТЗПериодовСотрИсхТабл.Колонки.Добавить("ПериодВзаиморасчетов");
		ТЗПериодовСотрИсхТабл.Колонки.Добавить("Сотрудник");
		ТЗПериодовСотрИсхТабл.Колонки.Добавить("ВидРасчета");
		ТЗПериодовСотрИсхТабл.Колонки.Добавить("ПериодНачалаДок");
		ТЗПериодовСотрИсхТабл.Колонки.Добавить("НачМесПериодНачалаДок");
		
		ИсходнаяТаблицаКопия = ИсходнаяТаблица.Скопировать(); //СВЭЙ 30.10.2023 КВВ СВФР-011719
		
		Для Каждого СтрТЗПер ИЗ ИсходнаяТаблица Цикл
			НайденныйЭлт = СписокВР2.НайтиПоЗначению(СтрТЗПер.ВидРасчета);
			Если НайденныйЭлт <> Неопределено Тогда
				
				//СВЭЙ 30.10.2023 КВВ СВФР-011719 (
				Если СтрТЗПер.Сторно = Истина Тогда
					Продолжить;
				КонецЕсли;  
				ОтборСторно = Новый Структура;    
				ОтборСторно.Вставить("Сторно", Истина);
				ОтборСторно.Вставить("ВидРасчета", СтрТЗПер.ВидРасчета);
				ОтборСторно.Вставить("ПериодКонец", СтрТЗПер.ПериодКонец);
				ОтборСторно.Вставить("ПериодВзаиморасчетов", СтрТЗПер.ПериодВзаиморасчетов);
				ОтборСторно.Вставить("Результат", -СтрТЗПер.Результат); 
				ОтборСторно.Вставить("ФизЛицо", СтрТЗПер.ФизЛицо);
				ОтборСторно.Вставить("Сотрудник", СтрТЗПер.Сотрудник);
				
				СтрокиСторно = ИсходнаяТаблицаКопия.НайтиСтроки(ОтборСторно);
				Если СтрокиСторно.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				//СВЭЙ 30.10.2023 КВВ СВФР-011719 )
				
				Стр00 = ТЗПериодовСотрИсхТабл.Добавить();
				Стр00.Сотрудник = СтрТЗПер.Сотрудник;
				Стр00.ПериодВзаиморасчетов = СтрТЗПер.ПериодВзаиморасчетов;
				Стр00.ВидРасчета = СтрТЗПер.ВидРасчета;
				Если ТипЗнч(СтрТЗПер.Регистратор) = Тип("ДокументСсылка.НачислениеОтпускаРаботникамОрганизаций") Тогда
					//Стр00.ПериодНачалаДок = СтрТЗПер.Регистратор.ДатаНачалаОсновногоОтпуска;
					Стр00.ПериодНачалаДок = ?(ЗначениеЗаполнено(СтрТЗПер.Регистратор.ДатаНачалаОсновногоОтпуска),СтрТЗПер.Регистратор.ДатаНачалаОсновногоОтпуска,СтрТЗПер.Регистратор.ДатаНачалаДополнительногоОтпуска); //СВЭЙ 30.10.2023 КВВ СВФР-011719
				Иначе
					Стр00.ПериодНачалаДок = СтрТЗПер.ПериодВзаиморасчетов;
				КонецЕсли;
				Стр00.НачМесПериодНачалаДок = НачалоМесяца(Стр00.ПериодНачалаДок);
			КонецЕсли;
		КонецЦикла;
		ТЗПериодовСотрИсхТабл.Свернуть("ПериодВзаиморасчетов,ПериодНачалаДок,Сотрудник,НачМесПериодНачалаДок,ВидРасчета");
		ТЗПериодовСотрИсхТабл.Сортировать("Сотрудник,ПериодВзаиморасчетов,ПериодНачалаДок");
		
		ТЗПериодовСотрИсхТабл5 = ТЗПериодовСотрИсхТабл.Скопировать(); //СВЭЙ 30.10.2023 КВВ СВФР-011719
		
		ТЗПериодовСотрИсхТабл2 = ТЗПериодовСотрИсхТабл.Скопировать(,"НачМесПериодНачалаДок,Сотрудник");
		ТЗПериодовСотрИсхТабл2.Свернуть("Сотрудник,НачМесПериодНачалаДок");
		
		Для Каждого Стр2 ИЗ ТЗПериодовСотрИсхТабл2 Цикл
			З = Новый Запрос;
			З.Текст = "ВЫБРАТЬ 
			|ОснНач.ПериодДействияНачало, //Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2)
			|ОснНач.ПериодДействияКонец
			|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНач
			|ГДЕ ОснНач.Сотрудник = &Сотрудник
			|И ОснНач.ВидРасчета В (&СписокВР)
			|И ОснНач.ПериодДействияНачало МЕЖДУ &Начало И &Окончание";
			З.УстановитьПараметр("Сотрудник",Стр2.Сотрудник);
			З.УстановитьПараметр("СписокВР",СписокВР1);
			З.УстановитьПараметр("Начало",Стр2.НачМесПериодНачалаДок);
			З.УстановитьПараметр("Окончание",КонецМесяца(Стр2.НачМесПериодНачалаДок));
			РезЗ = З.Выполнить().Выгрузить();
			Если РезЗ.Количество() <> 0 Тогда
				Для Каждого Стр3 ИЗ РезЗ Цикл
					ДатаПроверкиС = Стр3.ПериодДействияНачало; //Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2)
					ДатаПроверки = Стр3.ПериодДействияКонец;
					
					Отбор = Новый Структура;
					Отбор.Вставить("Сотрудник", Стр2.Сотрудник);
					Строки1 = ТЗПериодовСотрИсхТабл.НайтиСтроки(Отбор);
					Для Каждого Стр3 Из Строки1 Цикл
						//Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2) (
						Удалять = Ложь;
						Если НачалоДня(Стр3.ПериодНачалаДок) >= НачалоДня(ДатаПроверкиС)
							И КонецДня(Стр3.ПериодНачалаДок) <= КонецДня(ДатаПроверки) 
							И НачалоМесяца(Стр3.ПериодНачалаДок) = НачалоМесяца(ПериодРегистрации) Тогда
							Удалять = Истина;	
						КонецЕсли;
						Если НЕ Удалять Тогда
							//Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2) )
							//Аверсон 21.07.2021 КВВ СВФР-007892 (
							//Если ДатаПроверки < Стр3.ПериодНачалаДок Тогда
							Вчера = НачалоДня(Стр3.ПериодНачалаДок)-1;
							Если ДеньНедели(Вчера) = 6 ИЛИ ДеньНедели(Вчера) = 7 Тогда
								Вчера = Вчера - (60*60*24) * ?(ДеньНедели(Вчера) = 6,1,2);
							КонецЕсли;
							Если ТЗПраздников.Количество() > 0 Тогда
								Для Каждого СтрТЗПраздников Из ТЗПраздников Цикл
									Если НачалоДня(Вчера) = НачалоДня(СтрТЗПраздников.ДатаКалендаря) Тогда
										Вчера = НачалоДня(Вчера)-1;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
							Если НачалоДня(ДатаПроверки) = НачалоДня(Вчера) Тогда
								//Аверсон 21.07.2021 КВВ СВФР-007892 )
								Удалять = Истина;  //Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2)
							КонецЕсли;
						КонецЕсли;
						
						//СВЭЙ 30.10.2023 КВВ СВФР-011719 (
						Если НЕ Удалять Тогда     
							З2 = Новый Запрос;
							З2.Текст = "ВЫБРАТЬ 
							|ОснНач.ПериодДействияНачало, 
							|ОснНач.ПериодДействияКонец
							|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНач
							|ГДЕ ОснНач.Сотрудник = &Сотрудник 
							|И ОснНач.Сторно = Ложь
							|И ОснНач.ВидРасчета = &ВР
							|И ОснНач.ПериодДействияКонец = &ДатаПроверки";
							З2.УстановитьПараметр("Сотрудник",Стр2.Сотрудник);
							З2.УстановитьПараметр("ВР",Стр3.ВидРасчета);
							З2.УстановитьПараметр("ДатаПроверки",НачалоДня(Стр3.ПериодНачалаДок)-1);
							РезЗ2 = З2.Выполнить().Выгрузить();
							Если РезЗ2.Количество() <> 0 Тогда 
								Для Каждого СтрЗ2 ИЗ РезЗ2 Цикл 
									НачВР = СтрЗ2.ПериодДействияНачало; 
									Отбор6 = Новый Структура;             
									Отбор6.Вставить("Сотрудник", Стр3.Сотрудник);
									Отбор6.Вставить("ПериодВзаиморасчетов", НачВР);
									Отбор6.Вставить("ВидРасчета", Стр3.ВидРасчета);
									Строки6 = ИсходнаяТаблицаКопия.НайтиСтроки(Отбор6); 
									Если Строки6.Количество() > 0 Тогда
										Отбор7 = Новый Структура;             
										Отбор7.Вставить("Сотрудник", Стр3.Сотрудник);
										Отбор7.Вставить("ПериодВзаиморасчетов", НачВР);
										Отбор7.Вставить("ВидРасчета", Стр3.ВидРасчета);
										Строки7 = ИсходнаяТаблица.НайтиСтроки(Отбор7); 
										Если Строки7.Количество() = 0 Тогда
											Удалять = Истина;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
						//СВЭЙ 30.10.2023 КВВ СВФР-011719 )
						
						Если Удалять Тогда  //Аверсон 29.07.2021 КВВ СВФР-007892 (пункт 2)
							Отбор2 = Новый Структура;             
							Отбор2.Вставить("Сотрудник", Стр3.Сотрудник);
							Отбор2.Вставить("ПериодВзаиморасчетов", Стр3.ПериодВзаиморасчетов);
							Отбор2.Вставить("ВидРасчета", Стр3.ВидРасчета);
							Строки2 = ИсходнаяТаблица.НайтиСтроки(Отбор2);
							Для Каждого Стр4 Из Строки2 Цикл
								ИсходнаяТаблица.Удалить(Стр4); 
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Аверсон 13.11.2020 КВВ СВФР-006819 )
	
	//Аверсон 15.06.2021 КВВ СВФР-007702 (
	Если ПоРаботникамОрганизаций Тогда
		СтаршийИндексКолонок = ИсходнаяТаблица.Колонки.Количество() - 1; 
		Индекс = ИсходнаяТаблица.Количество() - 1; 
		Пока Индекс >= 0 Цикл 
			Для Сч = 0 По СтаршийИндексКолонок Цикл 
				ВД = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ИсходнаяТаблица[Индекс].ПериодВзаиморасчетов,Новый Структура("Сотрудник",ИсходнаяТаблица[Индекс].Сотрудник)).ВидДеятельностиИзмерение;
				Если НЕ ЗначениеЗаполнено(ВД) Тогда
					ИсходнаяТаблица.Удалить(Индекс); 
					Прервать; 
				КонецЕсли; 
			КонецЦикла; 
			Индекс = Индекс - 1; 
		КонецЦикла;
	КонецЕсли;
	//Аверсон 15.06.2021 КВВ СВФР-007702 )
	
	если ?(Организация.ИНН = "100765738", ПенсФондБудМес = 0,ПенсФондБудМес = 1) тогда
		ТекстЗапроса = 
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДопНачисления.ФизЛицо,
		|	ДопНачисления.Сотрудник,
		|	ДопНачисления.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНужныеДопНачисления
		|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДопНачисления
		|ГДЕ
		|		ВЫБОР
		|				КОГДА ДопНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДопНачисления.Организация
		|				ИНАЧЕ ДопНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДопНачисления.ПериодРегистрации, МЕСЯЦ) = &Период
		|		И ДопНачисления.ФизЛицо В(&СписокФизЛиц)
		|		И ДопНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		|;
		|///////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТНужныеДопНачисления.ФизЛицо,
		|	ВТНужныеДопНачисления.Сотрудник,
		|	ВТНужныеДопНачисления.ПериодРегистрации,
		|	МАКСИМУМ(Гражданство.Период) КАК МаксПериод
		|ПОМЕСТИТЬ ВТПериодыГражданства
		|ИЗ ВТНужныеДопНачисления
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТНужныеДопНачисления.ФизЛицо = Гражданство.ФизЛицо
		|	И Гражданство.Период < ВТНужныеДопНачисления.ПериодРегистрации
		|СГРУППИРОВАТЬ ПО
		|	ВТНужныеДопНачисления.ФизЛицо,
		|	ВТНужныеДопНачисления.Сотрудник,
		|	ВТНужныеДопНачисления.ПериодРегистрации
		|; 
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТПериодыГражданства.ФизЛицо,
		|	ВТПериодыГражданства.Сотрудник,
		|	ВТПериодыГражданства.ПериодРегистрации,
		|   Гражданство.НеИмеетПравоНаПенсию
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ ВТПериодыГражданства
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТПериодыГражданства.ФизЛицо = Гражданство.ФизЛицо
		|	И ВТПериодыГражданства.МаксПериод = Гражданство.Период
		|;
		|////////////////////////////////////////////////////////////////////////////
		//Аверсон СВФР-009799
		
		|ВЫБРАТЬ
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходФСЗН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходСтрах,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.СпособРасчета,
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.НачалоБазовогоПериода КАК ПериодВзаиморасчетов,
		|	ДанныеУчета.КонецБазовогоПериода КАК БазовыйПериодКонец,
		|	ДанныеУчета.БазовыйНачало КАК БазовыйНачало,
		|	ДанныеУчета.БазовыйКонец КАК БазовыйКонец,
		|	ДанныеУчета.ПериодРегистрации,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	&ВидДеятельности,
		|	&Должность,
		|	0 КАК Тип,
		|	ДанныеУчета.ВидРасчета.ВидПремии КАК ВидПремии
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДополнительныеНачисления.Регистратор КАК Регистратор,
		|		ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
		|		КОНЕЦ КАК НачалоБазовогоПериода,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
		|		КОНЕЦ КАК КонецБазовогоПериода,
		|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
		|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|				ТОГДА &ОблагаетсяСтрах
		|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
		|		КОНЕЦ КАК КодДоходаЕСН,
		|		ДополнительныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|		ДополнительныеНачисления.Организация КАК Организация,
		|		ДополнительныеНачисления.Результат КАК Результат,
		|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ДополнительныеНачисления.Организация КАК Организация,
		|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ДополнительныеНачисления.Организация
		|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.БазовыйПериодНачало, МЕСЯЦ) = &Период
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ДополнительныеНачисления.Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо,
		|					ДополнительныеНачисления.Организация,
		|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		//|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		//|			ИЗ
		//|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		//|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК НеПравоНаПенсию
		|ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	И ДополнительныеНачисления.ПериодРегистрации = НеПравоНаПенсию.ПериодРегистрации
		//Аверсон СВФР-009799
		
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДополнительныеНачисления.Организация
		|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &Период
		|		И ДополнительныеНачисления.ФизЛицо В(&СписокФизЛиц)
		|		И ДополнительныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДополнительныеНачисления.БазовыйПериодНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец,
		|		ДополнительныеНачисления.Регистратор,
		|		ДополнительныеНачисления.Сотрудник,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|				ТОГДА &ОблагаетсяСтрах
		|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
		|		КОНЕЦ,
		|		ДополнительныеНачисления.ВидРасчета,
		|		ДополнительныеНачисления.Организация,
		|		ДополнительныеНачисления.ПериодРегистрации,
		|		НеПравоНаПенсию.НеИмеетПравоНаПенсию,
		|		ДополнительныеНачисления.НомерСтроки,
		|		ДополнительныеНачисления.Сотрудник.Физлицо,
		|		ДополнительныеНачисления.ВидРасчета.СпособРасчета,
		|		ДополнительныеНачисления.Результат) КАК ДанныеУчета
		|ГДЕ
		|	ЕСТЬNULL(ДанныеУчета.Регистратор.ИсключитьИзПУ6, ЛОЖЬ) <> ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	ДанныеУчета.ПериодРегистрации,
		|	ДанныеУчета.БазовыйКонец,
		|	ДанныеУчета.БазовыйНачало,
		|	ДанныеУчета.КонецБазовогоПериода,
		|	ДанныеУчета.НачалоБазовогоПериода,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.Регистратор,
		|	ДанныеУчета.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ДанныеУчета.ВидРасчета.ВидПремии
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
	иначе
		ТекстЗапроса = 
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДопНачисления.ФизЛицо,
		|	ДопНачисления.Сотрудник,
		|	ДопНачисления.ПериодРегистрации
		|ПОМЕСТИТЬ ВТНужныеДопНачисления
		|ИЗ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДопНачисления
		|ГДЕ
		|		ВЫБОР
		|				КОГДА ДопНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДопНачисления.Организация
		|				ИНАЧЕ ДопНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДопНачисления.ПериодРегистрации, МЕСЯЦ) = &Период
		|		И ДопНачисления.ФизЛицо В(&СписокФизЛиц)
		|		И ДопНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС 
		|;
		|///////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТНужныеДопНачисления.ФизЛицо,
		|	ВТНужныеДопНачисления.Сотрудник,
		|	ВТНужныеДопНачисления.ПериодРегистрации,
		|	МАКСИМУМ(Гражданство.Период) КАК МаксПериод
		|ПОМЕСТИТЬ ВТПериодыГражданства
		|ИЗ ВТНужныеДопНачисления
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТНужныеДопНачисления.ФизЛицо = Гражданство.ФизЛицо
		|	И Гражданство.Период < ВТНужныеДопНачисления.ПериодРегистрации
		|СГРУППИРОВАТЬ ПО
		|	ВТНужныеДопНачисления.ФизЛицо,
		|	ВТНужныеДопНачисления.Сотрудник,
		|	ВТНужныеДопНачисления.ПериодРегистрации
		|; 
		|////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВТПериодыГражданства.ФизЛицо,
		|	ВТПериодыГражданства.Сотрудник,
		|	ВТПериодыГражданства.ПериодРегистрации,
		|   Гражданство.НеИмеетПравоНаПенсию
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ ВТПериодыГражданства
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК Гражданство
		|ПО ВТПериодыГражданства.ФизЛицо = Гражданство.ФизЛицо
		|	И ВТПериодыГражданства.МаксПериод = Гражданство.Период
		|;
		|////////////////////////////////////////////////////////////////////////////
		//Аверсон СВФР-009799
		
		|ВЫБРАТЬ
		|	ДанныеУчета.Регистратор КАК Регистратор,
		|	ДанныеУчета.НомерСтроки КАК НомерСтроки,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходФСЗН,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходСтрах,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ КАК ДоходЕдиныйПлатеж,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.СпособРасчета,
		|	СУММА(ДанныеУчета.Результат) КАК Результат,
		|	ДанныеУчета.НачалоБазовогоПериода КАК ПериодВзаиморасчетов,
		|	ДанныеУчета.КонецБазовогоПериода КАК БазовыйПериодКонец,
		|	ДанныеУчета.БазовыйНачало КАК БазовыйНачало,
		|	ДанныеУчета.БазовыйКонец КАК БазовыйКонец,
		|	ДанныеУчета.ПериодРегистрации,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	&ВидДеятельности,
		|	&Должность,
		|	0 КАК Тип,
		|	ДанныеУчета.ВидРасчета.ВидПремии КАК ВидПремии
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДополнительныеНачисления.Регистратор КАК Регистратор,
		|		ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|		ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодНачало
		|		КОНЕЦ КАК НачалоБазовогоПериода,
		|		ВЫБОР
		|			КОГДА ДополнительныеНачисления.ВидРасчета.ПериодРегистрацииКакБазовый
		|				ТОГДА КОНЕЦПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ)
		|			ИНАЧЕ ДополнительныеНачисления.БазовыйПериодКонец
		|		КОНЕЦ КАК КонецБазовогоПериода,
		|		ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйНачало,
		|		ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйКонец,
		|		ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|		ВЫБОР
		|			КОГДА РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ РеглУчетПлановыхНачисленийРаботниковОрганизаций.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН <> &парамПустойКодЕСНУ
		|				ТОГДА ВЫБОР
		|						КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|							ТОГДА &ОблагаетсяСтрах
		|						ИНАЧЕ ДополнительныеНачисления.ВидРасчета.КодДоходаЕСН
		|					КОНЕЦ
		|			КОГДА НеПравоНаПенсию.НеИмеетПравоНаПенсию = ИСТИНА
		|				ТОГДА &ОблагаетсяСтрах
		|			ИНАЧЕ &парамСпособПоУмолчаниюКодЕСН
		|		КОНЕЦ КАК КодДоходаЕСН,
		|		ДополнительныеНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета,
		|		ДополнительныеНачисления.Организация КАК Организация,
		|		ДополнительныеНачисления.Результат КАК Результат,
		|		ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
		|		НеПравоНаПенсию.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо КАК ФизЛицо,
		|					ДополнительныеНачисления.Организация КАК Организация,
		|					ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|					МАКСИМУМ(РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период) КАК Период
		|				ИЗ
		|					РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеглУчетПлановыхНачисленийРаботниковОрганизаций КАК РеглУчетПлановыхНачисленийРаботниковОрганизаций
		|						ПО ДополнительныеНачисления.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник
		|							И ДополнительныеНачисления.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация
		|							И ДополнительныеНачисления.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета
		|							И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период <= ДополнительныеНачисления.ПериодРегистрации)
		|				ГДЕ
		|					ВЫБОР
		|							КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|								ТОГДА ДополнительныеНачисления.Организация
		|							ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|						КОНЕЦ = &Организация
		|					И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &Период
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ДополнительныеНачисления.Сотрудник,
		|					ДополнительныеНачисления.Сотрудник.Физлицо,
		|					ДополнительныеНачисления.Организация,
		|					ДополнительныеНачисления.ВидРасчета) КАК СведенияОНачисленияхСрез
		|				ПО (СведенияОНачисленияхСрез.Сотрудник = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник)
		|					И (СведенияОНачисленияхСрез.Организация = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация)
		|					И (СведенияОНачисленияхСрез.ВидРасчета = РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета)
		|					И (СведенияОНачисленияхСрез.Период = РеглУчетПлановыхНачисленийРаботниковОрганизаций.Период)
		|			ПО (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Сотрудник = ДополнительныеНачисления.Сотрудник)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.Организация = ДополнительныеНачисления.Организация)
		|				И (РеглУчетПлановыхНачисленийРаботниковОрганизаций.ВидРасчета = ДополнительныеНачисления.ВидРасчета)
		
		//Аверсон ЕАЕ 08.11.2022 СВФР-009799
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
		//|				ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаПенсию
		//|			ИЗ
		//|				РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц) КАК НеПравоНаПенсию
		//|			ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК НеПравоНаПенсию
		|ПО ДополнительныеНачисления.ФизЛицо = НеПравоНаПенсию.ФизЛицо
		|	И ДополнительныеНачисления.ПериодРегистрации = НеПравоНаПенсию.ПериодРегистрации
		//Аверсон СВФР-009799
		
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА ДополнительныеНачисления.ПодразделениеОрганизации.Владелец ЕСТЬ NULL 
		|					ТОГДА ДополнительныеНачисления.Организация
		|				ИНАЧЕ ДополнительныеНачисления.ПодразделениеОрганизации.Владелец
		|			КОНЕЦ = &Организация
		|		И НАЧАЛОПЕРИОДА(ДополнительныеНачисления.ПериодРегистрации, МЕСЯЦ) = &Период
		|		И ДополнительныеНачисления.ФизЛицо В(&СписокФизЛиц)
		|		И ДополнительныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС) КАК ДанныеУчета
		|ГДЕ
		|	ЕСТЬNULL(ДанныеУчета.Регистратор.ИсключитьИзПУ6, ЛОЖЬ) <> ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеУчета.Регистратор,
		|	ДанныеУчета.Сотрудник,
		|	ДанныеУчета.ФизЛицо,
		|	ДанныеУчета.КодДоходаЕСН,
		|	ДанныеУчета.ВидРасчета,
		|	ДанныеУчета.СпособРасчета,
		|	ДанныеУчета.НачалоБазовогоПериода,
		|	ДанныеУчета.КонецБазовогоПериода,
		|	ДанныеУчета.БазовыйНачало,
		|	ДанныеУчета.БазовыйКонец,
		|	ДанныеУчета.ПериодРегистрации,
		|	ДанныеУчета.НеИмеетПравоНаПенсию,
		|	ДанныеУчета.НомерСтроки,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуФСЗН
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуСтрах
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеУчета.КодДоходаЕСН.ВходитВБазуЕдиныйПлатеж
		|			ТОГДА &парамСпособПоУмолчаниюКодДоходаЕСН
		|		ИНАЧЕ &парамСпособНеОблагаетсяКодДоходаЕСН
		|	КОНЕЦ,
		|	ДанныеУчета.ВидРасчета.ВидПремии
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	НомерСтроки";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	РасчетЕСНДополнительныеНачисления.ФизЛицо КАК ФизЛицо,
	//	|	СУММА(РасчетЕСНДополнительныеНачисления.Результат) КАК Результат,
	//	|	РасчетЕСНДополнительныеНачисления.Сотрудник,
	//	|	РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
	//	|	РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало КАК ПериодВзаиморасчетов,
	//	|	РасчетЕСНДополнительныеНачисления.БазовыйПериодКонец,
	//	|	РасчетЕСНДополнительныеНачисления.ВидРасчета.ВидПремии КАК ВидПремии,
	//	|	&ВидДеятельности,
	//	|	&Должность,
	//	|	0 КАК Тип
	//	|ИЗ
	//	|	Документ.РасчетЕСН.ДополнительныеНачисления КАК РасчетЕСНДополнительныеНачисления
	//	|ГДЕ
	//	|	РасчетЕСНДополнительныеНачисления.ФизЛицо В(&СписокФизЛиц)
	//	|	И РасчетЕСНДополнительныеНачисления.ВидРасчета.ОтчисленияНаППС = &ОтчисленияНаППС
	//	|	И РасчетЕСНДополнительныеНачисления.ДоходФСЗН = &ОтчисленияНаППС
	//	|	И РасчетЕСНДополнительныеНачисления.Ссылка.Организация = &Организация
	//	|	И НАЧАЛОПЕРИОДА(РасчетЕСНДополнительныеНачисления.Ссылка.ПериодРегистрации, МЕСЯЦ) = &Период
	//	|	И РасчетЕСНДополнительныеНачисления.Ссылка.Проведен
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	РасчетЕСНДополнительныеНачисления.ФизЛицо,
	//	|	РасчетЕСНДополнительныеНачисления.Сотрудник,
	//	|	РасчетЕСНДополнительныеНачисления.БазовыйПериодНачало,
	//	|	РасчетЕСНДополнительныеНачисления.БазовыйПериодКонец,
	//	|	РасчетЕСНДополнительныеНачисления.ДоходФСЗН,
	//	|	РасчетЕСНДополнительныеНачисления.ВидРасчета.ВидПремии";
	
	Результат = Запрос.Выполнить().Выбрать();
	//Островская Татьяна 11.06.2013 № 16547
	
	Пока Результат.Следующий() Цикл
		
		
		//Аверсон 13.11.2020 КВВ СВФР-006819 (
		Добавлять = Истина;
		Если СписокВР1.Количество() <> 0 И СписокВР2.Количество() <> 0 Тогда
			НайденныйЭлт = СписокВР2.НайтиПоЗначению(Результат.ВидРасчета);
			Если НайденныйЭлт <> Неопределено Тогда
				Если ТипЗнч(Результат.Регистратор) = Тип("ДокументСсылка.НачислениеОтпускаРаботникамОрганизаций") Тогда
					_ПериодНачалаДок = Результат.Регистратор.ДатаНачалаОсновногоОтпуска;
				Иначе
					_ПериодНачалаДок = Результат.ПериодВзаиморасчетов;
				КонецЕсли;
				_НачМесПериодНачалаДок = НачалоМесяца(_ПериодНачалаДок);
				
				З = Новый Запрос;
				З.Текст = "ВЫБРАТЬ 
				|ОснНач.ПериодДействияКонец
				|ИЗ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОснНач
				|ГДЕ ОснНач.Сотрудник = &Сотрудник
				|И ОснНач.ВидРасчета В (&СписокВР)
				|И ОснНач.ПериодДействияНачало МЕЖДУ &Начало И &Окончание";
				З.УстановитьПараметр("Сотрудник",Результат.Сотрудник);
				З.УстановитьПараметр("СписокВР",СписокВР1);
				З.УстановитьПараметр("Начало",_НачМесПериодНачалаДок);
				З.УстановитьПараметр("Окончание",КонецМесяца(_НачМесПериодНачалаДок));
				РезЗ = З.Выполнить().Выгрузить();
				Если РезЗ.Количество() <> 0 Тогда
					Для Каждого Стр3 ИЗ РезЗ Цикл
						ДатаПроверки = Стр3.ПериодДействияКонец;
						Если ДатаПроверки < _ПериодНачалаДок Тогда
							Добавлять = Ложь;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		//Аверсон 15.06.2021 КВВ СВФР-007702 (
		Если ПоРаботникамОрганизаций Тогда
			ВД = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(Результат.ПериодВзаиморасчетов,Новый Структура("Сотрудник",Результат.Сотрудник)).ВидДеятельностиИзмерение;
			Если НЕ ЗначениеЗаполнено(ВД) Тогда
				Добавлять = Ложь;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 15.06.2021 КВВ СВФР-007702 )
		
		Если Добавлять Тогда
			//Аверсон 13.11.2020 КВВ СВФР-006819 )
			мНоваяСтрока = ИсходнаяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, Результат);
			мНоваяСтрока.Тип = 1;
			
			//Аверсон 14.02.2023 КВВ СВФР-010249 (
			Если НЕ ЗначениеЗаполнено(мНоваяСтрока.ПериодКонец) Тогда
				мНоваяСтрока.ПериодКонец = ?(ЗначениеЗаполнено(Результат.БазовыйПериодКонец),КонецДня(Результат.БазовыйПериодКонец),КонецДня(Результат.БазовыйКонец));
			КонецЕсли;
			//Аверсон 14.02.2023 КВВ СВФР-010249 )
			
			мПериодНачало = НачалоМесяца(ПериодРегистрации);
			мПериодКонец = КонецМесяца(ПериодРегистрации);
			//Аверсон 06.09.2021 КВВ СВФР-008065 ( (закомментировано)
			//Если не (Результат.ВидПремии = Перечисления.ВидыПремии.НеПремия ИЛИ (не ЗначениеЗаполнено(Результат.ВидПремии))) Тогда
			//	мВремя = ПрочиеПроцедуры.ОтработанноеВремяПоСводнымГраффикам(мПериодНачало, мПериодКонец, Результат.Сотрудник, Справочники.КлассификаторИспользованияРабочегоВремени.Работа, Ложь,,Организация).Часов;
			//	СтрокиОтработанногоВремени = тзИсчисленныйЕСН.НайтиСтроки(Новый Структура("ФизЛицо", Результат.ФизЛицо));
			//	Если СтрокиОтработанногоВремени.Количество() <> 0 И ЗначениеЗаполнено(мВремя) Тогда
			//		Если ЗначениеЗаполнено(СтрокиОтработанногоВремени[0].ОтработаноЧасов) Тогда
			//			мНоваяСтрока.Результат = мНоваяСтрока.Результат/мВремя*?(СтрокиОтработанногоВремени[0].ОтработаноЧасов > мВремя, мВремя, СтрокиОтработанногоВремени[0].ОтработаноЧасов);
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			//Аверсон 06.09.2021 КВВ СВФР-008065 ) (закомментировано)
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого мСтрокаНачислений Из ИсходнаяТаблица Цикл
		мДатаНачала = ОтработанноеВремя.НайтиСтроки(Новый Структура("ФизЛицо", мСтрокаНачислений.ФизЛицо));
		
		Если мДатаНачала.Количество() <> 0 И мСтрокаНачислений.Тип = 1 Тогда
			мСтрокаРегистра = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаНачала[0].Дата,
			Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			
			мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мДатаНачала[0].Дата,
			Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			
			Если ПериодРегистрации = Дата(2016,12,1) и не ЗначениеЗаполнено(мСтрокаРегистра1.ВидДеятельностиИзмерение) Тогда  //О.Т. Аверсон 24.03.2017 № 449
				мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДобавитьМесяц(мДатаНачала[0].Дата,1),
				Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			КонецЕсли;
			
		Иначе
			мСтрокаРегистра = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мСтрокаНачислений.ПериодВзаиморасчетов,
			Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			
			мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мСтрокаНачислений.ПериодВзаиморасчетов,
			Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			Если ПериодРегистрации = Дата(2016,12,1) и не ЗначениеЗаполнено(мСтрокаРегистра1.ВидДеятельностиИзмерение) Тогда //О.Т. Аверсон 24.03.2017 № 449
				мСтрокаРегистра1 = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(ДобавитьМесяц(мСтрокаНачислений.ПериодВзаиморасчетов,1),
				Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			КонецЕсли;
		КонецЕсли;
		
		Если ПоРаботникамОрганизаций Тогда //Аверсон ЕАЕ 15.03.2021 СВФР-007324 условие
			
			//проверка корректности по датам
			мСтрокаРегистраПроверка = РегистрыСведений.РаботникиОрганизаций.ПолучитьПоследнее(мСтрокаНачислений.ПериодКонец,
			Новый Структура("Сотрудник, Организация", мСтрокаНачислений.Сотрудник, Организация));
			Если ПериодРегистрации = Дата(2016,12,1) и ЗначениеЗаполнено(мСтрокаРегистра.ВидДеятельностиИзмерение) Тогда  //О.Т. Аверсон 24.03.2017 № 449
				Если мСтрокаРегистра1.ВидДеятельностиИзмерение <> мСтрокаРегистраПроверка.ВидДеятельностиИзмерение Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Ошибка периода по сотруднику "+Строка(мСтрокаНачислений.Сотрудник));
				КонецЕсли;
			ИначеЕсли ПериодРегистрации <> Дата(2016,12,1) Тогда 
				Если мСтрокаРегистра1.ВидДеятельностиИзмерение <> мСтрокаРегистраПроверка.ВидДеятельностиИзмерение Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Ошибка периода по сотруднику "+Строка(мСтрокаНачислений.Сотрудник));
				КонецЕсли;
			КонецЕсли;
			//		
			Если Не мСтрокаРегистра1.ВидДеятельностиИзмерение.ИспользуетсяВПУ6 Тогда
				мСтрокаНачислений.ДоходФСЗН = Перечисления.ДоходыФСС_НС.НеОблагается;
			КонецЕсли;
			
			//Аверсон ЕАЕ 15.03.2021 СВФР-007324
		Иначе
			//проверка корректности по датам
			ВидДеятельностиПроверка = ПолучитьВидДеятельности(мСтрокаНачислений.Сотрудник,мСтрокаНачислений.ПериодКонец);
			
			ВидДеятельности = ПолучитьВидДеятельности(мСтрокаНачислений.Сотрудник, мСтрокаНачислений.ПериодВзаиморасчетов);
			
			Если ВидДеятельности <> ВидДеятельностиПроверка Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Ошибка периода по сотруднику "+Строка(мСтрокаНачислений.Сотрудник));
			КонецЕсли;
		КонецЕсли;
		//Аверсон СВФР-007324
		
		мСтрокаНачислений.ПериодВзаиморасчетов = НачалоМесяца(мСтрокаНачислений.ПериодВзаиморасчетов);
		
		//Аверсон ЕАЕ 15.03.2021 СВФР-007324
		Если ПоРаботникамОрганизаций Тогда
			мСтрокаНачислений.ВидДеятельности = мСтрокаРегистра1.ВидДеятельностиИзмерение;
		Иначе
			мСтрокаНачислений.ВидДеятельности = ВидДеятельности;
		КонецЕсли;
		//Аверсон СВФР-007324
		
		мСтрокаНачислений.Должность = мСтрокаРегистра.Должность;
	КонецЦикла;
	
	
	мПустоеЗначение = ИсходнаяТаблица.НайтиСтроки(Новый Структура("ДоходФСЗН", Перечисления.ДоходыФСС_НС.НеОблагается));
	Для Каждого мСтрока Из мПустоеЗначение Цикл
		ИсходнаяТаблица.Удалить(мСтрока);
	КонецЦикла;
	
	ИсходнаяТаблица.Свернуть("ФизЛицо, ПериодВзаиморасчетов,ВидДеятельности,Должность", "Результат");
	
	Если ИсходнаяТаблица.Количество() = 0 Тогда
		#Если Клиент Тогда
			Если ПоРаботникамОрганизаций Тогда
				Предупреждение("Не рассчитаны отчисления с ФОТ и ЗП !!!");
				
				//Аверсон ЕАЕ 15.03.2021 СВФР-007324
			Иначе
				Предупреждение("Не рассчитаны отчисления с ФОТ и ЗП или нет данных в регистре сведений Дополнительные данные для ППС!!!");
			КонецЕсли;
			//Аверсон
		#КонецЕсли
	КонецЕсли;
	
	Возврат ИсходнаяТаблица;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетППСИсчисленныйЕСН.ФизЛицо,
	|	РасчетППСИсчисленныйЕСН.ПериодВзаиморасчетов,
	|	РасчетППСИсчисленныйЕСН.ТарифВзносов,
	|	РасчетППСИсчисленныйЕСН.ОтработаноДней,
	|	РасчетППСИсчисленныйЕСН.ОтработаноЧасов,
	|	РасчетППСИсчисленныйЕСН.ВидДеятельности,
	|	РасчетППСИсчисленныйЕСН.ФондППС,
	|	РасчетППСИсчисленныйЕСН.ППС,
	|	РасчетППСИсчисленныйЕСН.Ссылка.ПериодРегистрации КАК Период,
	|	РасчетППСИсчисленныйЕСН.Ссылка.Организация,
	|	РасчетППСИсчисленныйЕСН.Должность
	|ИЗ
	|	Документ.РасчетППС.ИсчисленныйЕСН КАК РасчетППСИсчисленныйЕСН
	|ГДЕ
	|	РасчетППСИсчисленныйЕСН.Ссылка = &ДокументСсылка";
	
	Движения.ЕСНСведенияОДоходахППС.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

