//Островская Татьяна 20.11.2013 № 16927
Функция обТипСтрокой(лкОбъект, Режим = 0) Экспорт
	лкТип = Неопределено;

	Если Режим = 0 Тогда
		метаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(лкОбъект));
		Если Лев(лкОбъект, 10) = "ПланСчетов" Тогда
			лкТип = "ПланыСчетов";
		ИначеЕсли Лев(лкОбъект, 10) = "Справочник" Тогда
			лкТип = "Справочники";

		ИначеЕсли Лев(лкОбъект, 8) = "Документ" Тогда
			лкТип = "Документы";

		ИначеЕсли Лев(лкОбъект, 16) = "ЖурналДокументов" Тогда
			лкТип = "ЖурналыДокументов";

		ИначеЕсли Лев(лкОбъект, 16) = "РегистрСведений" Тогда
			лкТип = "РегистрыСведений";
		КонецЕсли;

		лкПозиция = Найти(Строка(лкОбъект), ".");
		Если лкПозиция > 0 Тогда
			лкТип = лкТип + "." + Сред(лкОбъект, лкПозиция + 1);
		КонецЕсли;

		Возврат лкТип;

	ИначеЕсли Режим = 1 Тогда

		Если ТипЗнч(лкОбъект) = Тип("Строка") Тогда
			лкТипОбъект = лкОбъект;
		Иначе
			лкТипОбъект = ТипЗнч(лкОбъект);
		КонецЕсли;

		Если Лев(лкТипОбъект, 10) = "ПланСчетов" Или Лев(лкТипОбъект, 11) = "План счетов" Тогда

			Возврат "ПланыСчетов";

		ИначеЕсли Лев(лкТипОбъект, 10) = "Справочник" Тогда
			Возврат "Справочники";

		ИначеЕсли Лев(лкТипОбъект, 8) = "Документ" Тогда
			Возврат "Документы";

		ИначеЕсли Лев(лкТипОбъект, 16) = "ЖурналДокументов" Или Лев(лкТипОбъект, 17) = "Журналыдокументов" Или Лев(лкТипОбъект, 17) = "Журнал документов" Тогда


			Возврат "ЖурналыДокументов";

		ИначеЕсли Лев(лкТипОбъект, 16) = "РегистрСведений" Тогда
			Возврат "РегистрыСведений";

		ИначеЕсли Лев(лкТипОбъект, 17) = "РегистрНакопления" Тогда
			Возврат "РегистрыНакопления";

		ИначеЕсли Лев(лкТипОбъект, 18) = "РегистрБухгалтерии" Тогда
			Возврат "РегистрыБухгалтерии";

		КонецЕсли;
		Возврат Неопределено;

	ИначеЕсли Режим = 2 Тогда

		метаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(лкОбъект));

		Если метаОбъект <> Неопределено Тогда
			Возврат метаОбъект.Имя;
		КонецЕсли;
	Иначе
		Сообщить("Ошибка в функции обТипСтрокой! Режим = " + Режим);
		Возврат Неопределено;
	КонецЕсли;

КонецФункции



