
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если БазовыеРасценкиНаДату.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.БазовыеРасценки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого Стр ИЗ БазовыеРасценкиНаДату Цикл
		Если ЗначениеЗаполнено(Стр.БазоваяРасценка) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период	= НачалоДня(Дата);
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.БазоваяРасценка = Стр.БазоваяРасценка;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Ставка = Стр.Ставка;
		Иначе
			Сообщить("В строке " + СокрЛП(Стр.НомерСтроки) + " не заполнен реквизит ""Базовая расценка"". В регистр внесено не будет." );
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);

КонецЕсли;
КонецПроцедуры
